{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "corruption",
            "id": 417
         },
         {
            "name": "undercover",
            "id": 1568
         },
         {
            "name": "war on drugs",
            "id": 1601
         },
         {
            "name": "mayor",
            "id": 1919
         },
         {
            "name": "drug dealer",
            "id": 2231
         },
         {
            "name": "presidential election",
            "id": 2946
         },
         {
            "name": "undercover agent",
            "id": 4654
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "drugs",
            "id": 14964
         }
      ],
      "imdb_id": "tt0115907",
      "video": false,
      "title": "City Hall",
      "recommendations": [
         10551,
         10410,
         10337,
         42217,
         12150,
         11060,
         31640,
         32274,
         12280,
         31587,
         27224,
         6346,
         10170,
         10433,
         9440,
         10990,
         11306,
         505,
         10608,
         6723
      ],
      "backdrop_path": "/pyopmpNMW3mTBz0ZqInyGYDEgb6.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "570dc359c3a3680a300011de",
         "content": "Being a huge fan of Al Pacino (from the likes of 'Heat', the 'Godfather' movies, and 'Dog Day Afternoon' especially) and having had a huge crush on Bridget Fonda ('Single White Female', anyone?) back in the day (Peter Fonda's famous daughter was named 85th sexiest star in film history, and Mrs. Danny Elfman hasn't been involved in film, unfortunately, since 2002), I was hugely disappointed in this film, especially since I had loved director Harold Becker's previous 'Sea of Love', which also starred Pacino. The first half was decent and involving, but it kind of slid off the rails, interest-wise for me, the rest of the way and got too talky and uninspired.\r\n\r\nI don't really know if the problem was with the script or its direction. I know I'm not the greatest John Cusack fan in the world (I find he's much better in comedy, like his sister Joan), but he had pretty good co-stars, whose talents were basically wasted, in Martin Landau, Anthony Franciosa and Danny Aiello (these guys were BORN for these roles and films, so on paper, this should have really worked out well). I had always wondered why this film had bombed so miserably, and now I know why. In cases like this, more should have been done to alter the story arc, just some basic tweaks, to make it more suspenseful and/or (though I usually balk at such 'Hollywood' tendencies) some romantic tension (a beauty such as Fonda's was misused--they may as well have hired someone else). All in all, a wasted opportunity that's worth a look if you like dramas about corruption--just don't go in with big expectations, and don't bother with a rewatch.",
         "url": "https://www.themoviedb.org/review/570dc359c3a3680a300011de"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mayor John Pappas",
               "gender": 2,
               "credit_id": "52fe43ee9251416c7502371d",
               "name": "Al Pacino",
               "profile_path": "/f9tBVwcNHnawvMoyuuzmKvEhBsb.jpg",
               "id": 1158,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Deputy Mayor Kevin Calhoun",
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023721",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marybeth Cogan",
               "gender": 1,
               "credit_id": "52fe43ee9251416c75023725",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Frank Anselmo",
               "gender": 2,
               "credit_id": "52fe43ee9251416c7502374d",
               "name": "Danny Aiello",
               "profile_path": "/UvPalkz4ynJJrTcrbpfD05gVoO.jpg",
               "id": 1004,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Judge Walter Stern",
               "gender": 2,
               "credit_id": "54e40104925141195a00a8f8",
               "name": "Martin Landau",
               "profile_path": "/ylT7pqkcPNsHloe2dJsePFSoIkE.jpg",
               "id": 2641,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Abe Goodman",
               "gender": 2,
               "credit_id": "54e40125c3a368087b0044c1",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Larry Schwartz",
               "gender": 2,
               "credit_id": "54e40133c3a368454b0099ed",
               "name": "Richard Schiff",
               "profile_path": "/gHFxL7MIGvmcbg5hhTNrbjIttQN.jpg",
               "id": 31028,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c7502372b",
               "name": "Harold Becker",
               "profile_path": "/pZjPh9NdTE0gf4aSndMOMj7XaXs.jpg",
               "id": 23213,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023731",
               "name": "Ken Lipper",
               "profile_path": null,
               "id": 68210,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023737",
               "name": "Harold Becker",
               "profile_path": "/pZjPh9NdTE0gf4aSndMOMj7XaXs.jpg",
               "id": 23213,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023743",
               "name": "John Corso",
               "profile_path": null,
               "id": 68211,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023749",
               "name": "David Bretherton",
               "profile_path": null,
               "id": 3898,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "571fb8ccc3a368775b0032ff",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.32299,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11062,
      "vote_count": 82,
      "budget": 0,
      "overview": "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.",
      "similar": [
         20676,
         4771,
         11423,
         479,
         10900,
         807,
         75780,
         341013,
         3580,
         193893,
         984,
         2142,
         25376,
         11647,
         9104,
         21484,
         1266,
         357096,
         9631,
         96
      ],
      "original_title": "City Hall",
      "runtime": 111,
      "poster_path": "/ttdjD9NpxXsTJidPT3o1Gk0oTkG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-16",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "It started with a shootout on a rainswept street and ended in a scandal that shattered New York.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Harold Becker"],
      "runtime": 111,
      "synopsis": "This complex 1996 drama directed by Harold Becker (Sea of Love) attempts to explore big-city corruption and the flexibility of what's right and wrong in the political arena. John Cusack plays the senior aide to mayor John Pappas (Al Pacino), a popular and seasoned politician whose administration is threatened when what seems to be an accidental shooting of a child reveals a nest of corruption and lifelong personal debts. This tests Cusack's loyalty to the man he thought he knew. Pacino turns in a finely textured performance as a man who has his own lofty ideals, but whose pragmatism sets in motion a series of events with tragic results. Cusack admirably captures the essence of someone polished and savvy at his job but must cope with fundamental disillusionment. This political thriller suffers at times from a lack of focus, but still offers an insightful and poignant treatise on the quagmire of politics in the modern age and the human toll it sometimes exacts.",
      "writers": [
         "Ken Lipper",
         "Paul Schrader"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115907/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNzEzMzQwN15BMl5BanBnXkFtZTcwOTk5MDYyMQ@@._V1_SY292_CR1,0,214,292_AL_.jpg",
      "actors": ["Stars: Al Pacino, John Cusack, Bridget Fonda | See full cast and crew »"],
      "reviews": [
         "I had been long awaiting this movie ever since I saw the trailer, which made it look like a political drama, starring three of my favorite actors; Al Pacino, John Cusack, and Bridget Fonda. And even though it was directed by Harold Becker, who has done uneven work, he and Pacino did combine on SEA OF LOVE, which ranks among each of their best work. But interference on some level(for starters, several of the scenes in the original trailer don't appear in the movie) and changing of tone(subsequent trailers make it look like a thriller) make this, while watchable, nowhere near as it could have been. Which is too bad, because I really wanted to like this movie. There was great potential here to be a film about how government can still be worthwhile despite all the corruption, and to make a complex statement about that corruption, not the usual good guys vs. bad guys. And there is good acting here. Pacino and Cusack are both very good, and Danny Aiello gives one of the best performances of his career. But Fonda is wasted in her role, having nothing to do, and while there is merit in the central storyline, when it turns to a thriller, the movie loses its way, briefly recovers in the final scene between Cusack and Pacino, and then falls down completely in the end. I wish I could like this more, but no.",
         "I liked this neglected movie quite a bit, for a number of reasons. The characters. I found them believable, real, with some depth, in conflict. Not cardboard, cartoon-like. I found that I could really identify with and care about them. The story. I thought it was really interesting and realistic. The behind-the-scenes look at political machinations was exciting. I tend to like movies without special effects, that are not unrealistic fantasies. (\"Ordinary People\" generally comes to my mind.) I thought that this movie simply took real-life type people, put them in interesting situations, filled with conflict, and had us watch them deal with the problems they were in. I also think the movie had a message for us, in terms of right and wrong. In fact, it's downright Shakespearian. (Contrast this with another Al Pacino movie, \"Heat\", where the criminals are portrayed just as sympathetically as the law enforcement officers, and there is no inkling at all that there is anything morally wrong with armed robbery. I'm uncomfortable with that.) It's refreshing to see a movie in this day and age without gratuitous sex, violence, bombs and bullets, profanity. On a cinematic level, I found the directing, acting (the entire cast) and production to be first rate. I realize that many, many people (possibly the large majority) don't see things as I've described here. But if what I've written resonates, then you'll probably like this movie a lot.",
         "Well, there is a plenty of ways how to spoil a political thriller. Usually they are derivative or too ambitious, often they feature a conspiracy that is totally paranoic and unbelievable. But City Hall does not do neither of the above mentioned. The plot is cleverly crafted, story is believable. As far as characters go I would say this movie is a solid average. No character seems out of place and Al Pacino is brilliant as always. His portrayal of a charismatic NYC mayor is superb and proves again that Al Pacino belongs to the absolute top of American actors nowadays.",
         "This is a movie for John Cusack fans. He is in almost every scene as a mayoral aide who gets in way over his head trying to solve a murder mystery involving a drug dealer, a lonewolf cop and a six-year-old boy. Cusack has definitely grown into serious adult roles, as this film makes abundantly clear. Pacino is also topnotch as a crusading mayor who harbors a terrible secret. He is in control and charismatic as hell. Watch for the funeral scene where he sways what could have been a very hostile crowd. Danny Aiello also is terrific as a Brooklyn borough chief in bed with the mafia. Too bad the shaky script wasn't up to the acting. Is this a drama or an action piece? It wavers back and forth. But even if you figure out the resolution early on, which my kid did less than halfway through, this may keep you reasonably spellbound. A little too talky, although some pretty good dialogue.",
         "Being a transplanted New Yorker, I might be more critical than most in watching City Hall. But I have to say that before even getting to the story itself I was captivated by the location shooting and the political atmosphere of New York City that Director Harold Becker created. For example there's a reference to Woerner's Restaurant in Brooklyn where political boss Frank Anselmo likes to eat. There is or was a Woerner's Restaurant on Remsen Street in downtown Brooklyn when I lived in New York back in 1996. It was in fact particularly favored by political people in the Borough though they did have a couple of other hangouts. No surprise because the script was co-authored by Nicholas Pileggi who still writes both political and organized crime stories. He knows the atmosphere quite well and he sure knows how those two worlds cross as they do in this film. A detective played by Nestor Serrano goes for an unofficial meeting with a relative of mob boss Anthony Franciosa and things erupt and three people wind up dead, including an innocent 6 year old boy whose father was walking him to school. The story mushrooms and at the end it's reached inside City Hall itself. Al Pacino plays Mayor John Pappas and John Cusack is his Deputy Mayor a transplanted Louisianan, a state which has a tradition of genteel corruption itself. He's the outsider here and in trying to do damage control, Cusack finds more than he bargained for, Danny Aiello plays Brooklyn political boss Frank Anselmo and for those of you not from New York, his character is based on the late Borough President of Queens Donald Manes who was also brought down by scandal. He's very much the kind of Brooklyn politician I knew back in the day whose friendship with organized crime and favors done for them, do Aiello in. City Hall was the farewell performance on film for Anthony Franciosa, one of the most underrated and under-appreciated talents ever on the screen. No one watches anyone else whenever he's on. Al Pacino's best moment is when at the funeral of the young child killed, he takes over the proceedings and turns it into a political triumph for himself. His is a complex part, he's a decent enough man, but one caught up in the corruption it takes to rise in a place like New York. For those who want to know about political life in the Big Apple, City Hall is highly recommended.",
         "Excellent political thriller, played much quieter and slower than other, higher ranking films in this genre. When people talk about Pacino and Cusack how do they manage to skip over these amazing career topping performances? A story of friendships, father-son relationships, corruption and deceit. The two actors gel amazingly well together, and the supports from Aiello and Fonda are equally as impressive, although Aiello is brilliant, especially when the papers run to press. Instead of focussing on an over complex corruption scandal, it creates wonderful characters who show the human side of failure an political bribery, The final scenes with each of the main characters are wonderfully written and acted.",
         "One thing that shocked me about this film, considering the cast, was the small amount of profanity. I mean, with Al Pacino, John Cusack, Bridget Fonda and Danny Aiello, I didn't expect this low-key a film. Aiello and Cusack not uttering one swear word? Wow, that's almost unheard of in films. The story is very low-key, maybe too much so for a lot of people which includes me at times, but I enjoyed this. In fact, just watching and listening to Pacino and Cusack in this movie was plenty of entertainment. They played a mayor and a deputy mayor, respectively. However, to be honest, I didn't always comprehend what was going on in the story. Apparently the mayor knew what was going on all the time and it was just business (or politics) as usual, for him. Pacino's speech at the funeral of the young black kid was outstanding. Talk about a smooth political orator! Pacino played New York City Mayor \"John Pappas.\" He reminded me a lot of another New Yorker, former governor Mario Cuomo who, although I disagreed with many of his statements, was a smooth talker like Pacino's character in here. I wonder if they modeled \"Pappas\" after Cuomo?",
         "This is one of the best crime-drama movies during the late 1990s. It was filled with a great cast, a powerful storyline, and many of the players involved gave great performances. Pacino was great; he should have been nominated for something. John Cusack was good too, as long as the viewer doesn't mind his Louuu-siana accent. He may come off as annoying if you can't stand this dialect. The way that Pacino's character interacted with Cusack's character was believable, dramatic, and slightly comical at times. Danny Aiello was superb as always. David Paymer was great in a supporting role. Bridget Fonda was good but not memorable. There were times when this picture mentioned so many characters, probably too many. It may take a second viewing to remember, \"which Zapatti was which?\" After so many cross-references, one has to stop and think just to recap. The ending didn't have a lot of sting. It was built up for so long and then was a bit of a letdown. This was one of the few problems with the film. Since the movie wasn't billed as a \"huge, blockbuster\" big screen hit, it made some forget that this movie even existed. Pacino and Aiello were great but the film's lack of \"splash\" in the theaters may have accounted for no nominations. It was semi-successful in the home market, and viewers are still learning that this title is out there. Made in 1996, it still stands up today and will remain popular for many years to come. So, make yourself some lemon pudding (you'll see) and see this movie!",
         "Has Al Pacino ever been in a bad movie? His name seems to be an imprimatur for top notch cinema. This is as good a performance as he's ever given. Pacino is an American Olivier. And this is a political thriller as good as they get. There are no good guys and no bad guys. But the system has its inexorable effect on the people who think they're running it. Not only is Pacino's performance compelling --- the eulogy at the dead child's funeral is awesomely powerful --- the film has a fast paced, gritty realism to it that enhances the fine performances without resorting to gimmicks. This outstanding portrait of big city politics also manages to provide two hours of superb movie watching without undue violence, overheated sex or gutter language. There is murder. There are bad people. But they come across effectively without crossing the line. A film like this restores my jaded faith in Hollywood. I don't award many tens. This one richly deserves it!",
         "I've seen this movie about 6 times now. And each time I view it, I'm more impressed by the story and the acting. Its like watching a train wreck being set in motion. Its subtle in its approach, but very effective in reaching its goal. Spoilers-> At the center of the story is a very nice dichotomy. On the one hand we have Deputy major, Eddy Calhoun (Cusack) unknowingly tearing at the old boys network that forms the hart of major of New York's Administration and on the other hand we have the mob boss Zappati who's deliberately trying to maintain the status quo through all means necessary. This situation nicely culminates in the end when Zappati orders Alselmo to make it easy on himself by killing himself and Calhoun ordering Pappas to do the same, politically speaking. The movie also contains some really great one-liners such as (a personal weakness of mine): - You don't sum up a man's life in one moment - The only thing new in this world is the history you don't know All in all, a great movie that deserves a much higher rating."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Columbia Pictures Corporation"
      ],
      "summaries": [
         "A young boy dies from a stray bullet during a shootout between a cop and mob family member who had previously been supiciously given probabtion, only to break its terms. New York's Deputy Mayor, Kevin Calhoun starts digging for information.",
         "One seemingly routine morning, a little boy is shot dead in the cross fire between a drug dealer and a narcotics detective in a predominantly black New York City neighborhood. John Pappas, the idealistic mayor of the city, cleverly prevents a race riot, and everything seems to be OK. However, things get complicated again when Kevin Calhoun, Pappas's loyal chief of staff, who is even more idealistic than Pappas himself, begins to wonder why the drug dealer, who just happens to be the son of the local Mafia boss, was out on the streets in the first place after receiving a sentence of five year's probation for a conviction which would normally warrant a 10 to 20-year jail term. Further complicating matters is Marybeth Cogan who represents the widow of the narcotics detective. She is trying to find out why the pension for the cop is being withheld and she brings Calhoun deeper into a scandal that makes him take a second look at what he once took for granted.",
         "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences."
      ],
      "budget": 40000000
   },
   "movielensId": 100,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-16",
      "dvdReleaseDate": "1999-07-27",
      "directors": ["Harold Becker"],
      "runtime": 111,
      "movieId": 100,
      "title": "City Hall",
      "mpaa": "R",
      "actors": [
         "Al Pacino",
         "John Cusack",
         "Bridget Fonda",
         "Danny Aiello",
         "Martin Landau",
         "David Paymer",
         "Richard Schiff"
      ],
      "imdbMovieId": "0115907",
      "originalTitle": "City Hall",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "OlCO01s1upA",
         "QgEObrHE_2k"
      ],
      "plotSummary": "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.",
      "tmdbMovieId": 11062,
      "avgRating": 3.23128,
      "releaseYear": "1996",
      "numRatings": 4447,
      "posterPath": "/ttdjD9NpxXsTJidPT3o1Gk0oTkG.jpg"
   }
}