{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "past",
            "id": 6162
         },
         {
            "name": "cop",
            "id": 8015
         },
         {
            "name": "series of murders",
            "id": 14676
         },
         {
            "name": "homicide detective",
            "id": 180668
         }
      ],
      "imdb_id": "tt0116421",
      "video": false,
      "title": "The Glimmer Man",
      "recommendations": [
         9569,
         14289,
         9624,
         14362,
         10877,
         6058,
         9395,
         10173,
         12542,
         3512,
         2320,
         10167,
         18248,
         10861,
         30806,
         24546,
         9057,
         9091,
         4954,
         8845
      ],
      "backdrop_path": "/iu4BJNiA3P2XigTZtXuQwO6UCLk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lt. Jack Cole",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf13",
               "name": "Steven Seagal",
               "profile_path": "/f8OFR4h3ngyFesiudCygrNFdsCE.jpg",
               "id": 23880,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Det. Jim Campbell",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf17",
               "name": "Keenen Ivory Wayans",
               "profile_path": "/4uCVzk6JrNflrqWyzkPhLuwZzoC.jpg",
               "id": 35689,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Frank Deverell",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf1b",
               "name": "Bob Gunton",
               "profile_path": "/b3NfI0IzPYI40eIEtO9O0XQiR8j.jpg",
               "id": 4029,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Smith",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf1f",
               "name": "Brian Cox",
               "profile_path": "/m15C58NWii5WCIg57Llr7hejnfy.jpg",
               "id": 1248,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jessica Cole",
               "gender": 1,
               "credit_id": "52fe4513c3a36847f80baf23",
               "name": "Michelle Johnson",
               "profile_path": "/b87fTFmIzdy4CYPvlUbzhtA6Oua.jpg",
               "id": 17225,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Johnny Deverell",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf57",
               "name": "Johnny Strong",
               "profile_path": "/mai8GzxPcvdIo1RzymbwBwayhxe.jpg",
               "id": 12796,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Donald Cunningham",
               "gender": 2,
               "credit_id": "5583193a9251413bdc000a03",
               "name": "John M. Jackson",
               "profile_path": "/cgBh0ds37j0Ek58UruzLWpg4wly.jpg",
               "id": 116128,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Christopher Maynard",
               "gender": 2,
               "credit_id": "5583194ac3a3682d86000519",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Capt. Harris",
               "gender": 2,
               "credit_id": "55831959c3a368236c000528",
               "name": "Ryan Cutrona",
               "profile_path": "/b2DueYTc1uInvmyl56XMWsmswyO.jpg",
               "id": 93345,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Detective Roden",
               "gender": 2,
               "credit_id": "55831967c3a3686cc5000b7d",
               "name": "Richard Gant",
               "profile_path": "/sL5Sl2ukTbgerMONHdYNvgAYTbz.jpg",
               "id": 16662,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Cole's Daughter",
               "gender": 1,
               "credit_id": "5583197c9251413bdc000a07",
               "name": "Alexa PenaVega",
               "profile_path": "/aHABeErlMgzBkrMSaHOsZFsNlhV.jpg",
               "id": 57674,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Millie - Johnny's Girlfriend",
               "gender": 1,
               "credit_id": "5583198dc3a3686cc5000b81",
               "name": "Nikki Cox",
               "profile_path": "/hFmNQPXI4HU89B9MI2iTQrIMtv3.jpg",
               "id": 87317,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf29",
               "name": "John Gray",
               "profile_path": null,
               "id": 35155,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf2f",
               "name": "Kevin Brodbin",
               "profile_path": null,
               "id": 10947,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf35",
               "name": "Julius R. Nasso",
               "profile_path": null,
               "id": 58206,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf3b",
               "name": "Steven Seagal",
               "profile_path": "/f8OFR4h3ngyFesiudCygrNFdsCE.jpg",
               "id": 23880,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf41",
               "name": "Michael I. Rachmil",
               "profile_path": null,
               "id": 58183,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf47",
               "name": "Trevor Rabin",
               "profile_path": null,
               "id": 894,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf4d",
               "name": "Rick Bota",
               "profile_path": "/lTMdMIUYAvfUOTFmpJvgPADSeBl.jpg",
               "id": 58209,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80baf53",
               "name": "Donn Cambern",
               "profile_path": null,
               "id": 8847,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.550769,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9625,
      "vote_count": 124,
      "budget": 45000000,
      "overview": "A former government operative renowned for his stealth, Jack Cole is now a Los Angeles police detective. When a series of horrible murders occurs in the metro area, Cole is assigned to the case, along with tough-talking fellow cop Jim Campbell. Although the two men clash, they gradually become effective partners as they uncover a conspiracy linked to the killings, which also involves terrorism and organized crime.",
      "similar": [
         954,
         37724,
         36955,
         206647,
         646,
         681,
         47971,
         207703,
         9486,
         10285,
         37834,
         9342,
         5236,
         4982,
         4638,
         253,
         714,
         861,
         27576,
         50456
      ],
      "original_title": "The Glimmer Man",
      "runtime": 92,
      "poster_path": "/2I1BMhKrjK9wcxvJ2SllttPIsIh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Seagal/Nasso Productions",
            "id": 17825,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-10-04",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "Two good cops. One bad situation.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Gray"],
      "runtime": 91,
      "synopsis": "Jack Cole (Steven Seagal) was once a government intelligence operative known as \"The Glimmer Man,\" because he could move so quickly and quietly through the jungle that his victims would only see a glimmer before they died. Having left the Glimmer Man job behind him, Colesteeped in buddhism and not used to working with othershas become a detective with the Los Angeles Police Department. Cole is partnered with Jim Campbell (Keenen Ivory Wayans), a tough, no-nonsense cop who has little patience for Cole's New Age philosophies and outsider attitude. Cole and Campbell have to set aside their differences when they're assigned to track down a serial killer called \"The Family Man,\" for his habit of killing entire households. The Family Man's latest victims turn out to be Cole's former wife Ellen and her current husband Andrew Dunleavyand Cole's fingerprints are found on Ellen's body. Cole and Campbell think that Cole's former bosses in the government may somehow be involved in the killings. Cole contacts his friend Smith (Brian Cox), unaware that he has been working with local crime boss Frank Deverell (Bob Gunton). Cole and Campbell receive a tip that leads them to Christopher Maynard (Stephen Tobolowsky), who admits that he committed the Family Man murders that happened before Cole arrived in Los Angeles. Someone else has been committing the more recent murders and making it look like Maynard's work. Cole fatally shoots Maynard in self defense. Cole, hoping to get a lead on the new killer, goes to the home of Deverell's Russian translator Celia Roslov (Susan Reno), who was a victim of the killer. The killer attacks Cole, and later sets Campbell's home on fire. Cole and Campbell discover that Deverell's stepson Johnny (Johnny Strong) knows some important information. Johnny tells Cole and Campbell that Deverell's right-hand man, Donald Cunningham (John M. Jackson), is the new killer who has been making his killings look like Maynard's work. Johnny also tells them that Smith has been working with Deverell. Cole and Campbell confront Smith, and torture him into revealing that Deverell is smuggling chemical weapons into the USA from Russia, with plans to sell the weapons to a group of Serbian terrorists. Smith made the contacts, with the deal being cut by a group of Russian terrorists known as the Russian Liberation Fighters. The meeting for the deal is scheduled to take place at a downtown welfare hotel. Cole and Campbell storm the hotel, where Cunningham fatally shoots Deverell, and Cole kills Cunningham by throwing him through a window and onto a wrought iron fence below. Campbell, having been shot, tells Cole that, ever since he met him, he's been nothing but trouble. Cole says he'll keep that in mind, as Campbell is taken away in an ambulance.",
      "writers": ["Kevin Brodbin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116421/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMDY2Mzg4MF5BMl5BanBnXkFtZTcwNzAyMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steven Seagal, Keenen Ivory Wayans, Bob Gunton | See full cast and crew »"],
      "reviews": [
         "Truly my favorite Seagal movie. Akido, one liners, arrogance, and humor all provided by the action star the critics love to hate. The Lento's scene is probably the best of Seagal's troubled career and is sorely missed in his latest films. An action vehicle that played perfectly to his talents and probably the last of the finest when it comes to the Seagal collection with the exception of \"Exit Wounds\". Although unappreciated at the box office, this is what made Seagal \"Seagal\" and belongs in any Seagal fans DVD collection.",
         "Neatly crafted action thriller, with Seagal on top wrist-snapping form as a Buddhist cop from New York, with a shadowy past, teamed with Wayans' wisecracking LA cop to investigate the gruesome murders of a serial killer, known as the `Family Man'. The two leads work well together; in typical buddy cop fashion which provides the film with the comic relief it needs to give the audience a break from the serious themes involved. The script is competently composed; trying to surprise us as best it can with several twists and turns, however, the story is so fully packed with things going on that it's easy for the audience to get lost along the way. However, that is not a problem as Seagal is on the case with his usual array of impressive martial arts and likeable personality, encased in an interesting character. To me, Seagal represents, in a way, a modern day John Wayne, always playing the same out for justice, good guy role and taking no crap from anyone along the way. He is a screen presence that can carry even the most brainless of films, but this film has both brains and brawn. Wayans does very well here too, managing to avoid the typical stereotype of the African-American cop who is simply there for laughs. The direction is standard but competent in keeping a relaxed balance between the hectic action (entwined with the tense build-ups) and the comedic peace-time goings on. The gorier parts of the film, like the murders, are handled with skill and successfully manage to create an eerie atmosphere rather than simply a gory head-turning occasion. The Glimmer Man is not a masterpiece by any means but it serves its purpose well as a tense action thriller. It tries hard to be more than it is, but its lack of originality is its biggest flaw but it gets top marks for trying. You can't take anything away with you afterwards, but you can enjoy yourself along the way.",
         "in my opinion this is one of Steven Seagal's better films,due in large part to having Keenan Ivory Wayans as a co star.they have good chemistry together.it's also one of his darkest films,at least of those i have seen to date.but there some funny moments to balance things out,comic relief,if you will.the fighting scenes are pretty are good,and as brutal as usual for a Seagal flick.you won't really find much new here,but if you're a Seagal fan,or a fan of the genre,this should keep you satisfied for the most part.by now,with Steven Seagal,you know what you're getting,or at least you should know.i was entertained for around 90 minutes or so.for me,The Glimmer Man is a 7/10",
         "This was a very good action thriller that kept me interested throughout. If you like Segal or Keenan Ivory Wayans, you are guaranteed to love this movie. Keenan Ivory Wayans provided the comedy while Segal added the martial arts and fighting to create a great movie. I strongly recommend that you see thins movie if you like the cast or the genre!",
         "***SPOILERS*** The years since Steven Seagal burst upon the screen as Det. Nico Toscani in the movie \"Above The Law\" back in 1988 have been like the seven fat years in the book of Genesis. By the time he made \"The Glimmer Man\", some seven years later, Seagal had to wear extra baggy clothes to hide the extra weight that he put on his frame from all the success he had since then. Steven Seagal, Det. Jack Cole and his partner Det. Jim Campall(Keenen Ivory Wayans), who only seems to be in the movie for comedy relief, are put on the \"Family Man\" murder case in L.A. The \"Family Man\" murdered some half dozen families and had them crucified in some weird ritual after they were dead. Seagal here plays a cop who who cracked up back in the early 1980's from the guilt that he felt about his service in Vietnam where he was known as \"The Glimmer Man\"; a hard as nails killer who the enemy only saw a glimmer of before he did them in. Det. Cole, or Seagal, later went to Thailand and took up Buddhism and became a sweet and peaceful man who wouldn't hurt a fly! Even though the movie \"The Glimmer Man\" is one of the most violent films that Seagal ever made. \"The Glimmer Man\" is an almost incomprehensible movie to understand and follow. It starts off with a serial murder and then goes to what seems like a weirdo psychiatrist Frank Deverell, Bob Gunton, who thinks that he's the Godfather and uses a gang of thugs to smuggle arms from the now defunct Soviet Union to a Serbian freedom fighting organization. This whole racket is run Det. Jack Cole's former boss in Vietnam Mr. Smith, Brian Cox, who's working together with the Russian Mafia. That's about the best way I can describe the plot in the movie. Early in the film Det. Cole's ex-wife Helen and her husband Andrew Dunleavy are murdered by the \"Family Man\" killer and it's made to look like it was Det. Cole who was the killer. This makes Cole realize that the killings are a cover for something more sinister. After breaking a number of heads and arms and legs of Russian gangsters and Deverell thugs Det. Cole finally gets to the bottom of what is really behind all these killings. The movie is so violent it made me wonder what Seagal, who had a lot of control of the material in the film, was trying to tell his audience, love your fellow man? Since it went against everything that Buddhism stands for which I at first thought that the movie was advocating!\"The Glimmer Man\" builds itself up to it's inevitable bloody conclusion at the Overington Hotel in downtown L.A where Det. Cole has the Deverell mob turn on each other. This all happened when Det. Cole had a tape recording of Deverell played back on the phone to his top henchmen Donald Cunningham, John M. Jackson. The tape said that his boss was going to turn Cunningham in to save his own behind. That lead to a shootout between the two at the hotel where they were supposed to find both Det. Cole and Campell,the C&C boys , as Cunningham trapped Deverell there without knowing that he knew about his plans to double-cross him. The hoods ended up killing themselves with, of course, the help of Cole & Campbell. Only Cunningham is left for Cole to do in at the end of the movie who after almost beating him almost to death ends up crucifying him! Steven Seagal seems to really enjoy working people over in the movie, he does it with such relish and enthusiasm, despite his non-violent Buddhist beliefs. Seagal does it to the point where he beats them in some cases to death even when their no longer a threat to him at all! when all he had to do is just put the cuffs on them and have them locked up behind bars! This isn't by a long shot going to make too many people watching the movie get turned on to Buddhism which I assume the film wanted them to do.",
         "Steven Seagal certainly knows how to fight, and in some of his fight scenes in \"The Glimmer Man\" he comes across as a forceful, don't-mess-with-me presence. What he doesn't know is how to act: he's so wooden he's almost funny, especially when he has to show \"disgust\" at the horrible crimes he's witnessing, or when he's whispering his lines in an attempt to come off as \"menacing\". Keenen Ivory Wayans is likably unaggressive as his partner, and the director does his best to emulate the style of \"Seven\" (minus the intelligence), but (SPOILERS FOLLOW) the whole serial-killer business is actually a big red herring, and the film ultimately turns out to be the typical Seagal actioner. At least there are some good action sequences. (**)",
         "Seagal who had become famous as a one man wrecking crew teams up in this to do a two fisted action movie. If you liked 48 Hours or any of the Lethal Weapon movies this is for you. This is not some fruity drama or foreign romance\u0085this is a fighting shooting DUDE movie. The story is clean and full of action with clever bits of comedy and well placed explosions. This is a kind of movie that can be watched over and over again in the company of dudes who love dude movies. Seagal plays his Asian holy man role, that for peace and harmony likes to beat the living crap out of bad guys. For a partner there is the wise cracking Keenen Wayans who perfectly compliments Seagal. And there are plenty of smaller role bad guys that meet their demise. But the parts played by Brian Cox and John Jackson were great. Well worth owning.",
         "This is another Segal formula flick. Thankfully, unlike some of his more recent movies, he's in much better physical shape (i.e. he's not fat). Segal plays yet another former government operative, now a local police officer/detective, trying to live out his life out of the \"business\". Shrouded in mystery and controversy, Segal, once again, become a one man wrecking crew taking out everyone and everything, while maintaining his clam, Buddhist/Art of War philosophies in the process. Why on earth they dragged, Keenan Ivory Wayans into a Segal formula movie is beyond me. I mean not say I didn't like him in the flick, but why him? Better yet, why anyone? As far as I can tell Segal usually does his better movies running solo, as he is the bona fide martial artist. One would figure if you were going to pair him up with someone, make it another action hero or another martial artist. Either way, if you're a Segal, action movie fan this movie is a good way to kill a couple of hours. If you're not into that, then skip this flick.",
         "Spoiler Alert The beginning of this movie starts out nicely, laying the basic plot, but it's in the possibilities that arouse that the movie fails to deliver. It would have been great to see that Seagal was actually the killer. Man, what a great bad guy he would make, but instead we are left with the usual unfolding of the recycled story that just doesn't seen to work anymore. The buddy buddy cop story that has some nice moments with the main actors is therefore nothing more than any previous Seagal cop movie, but it still possesses some bright moments. 6/10",
         "This movie has three things going for it: one is Steven Seagal as a mystical character with a shadowy past who does magical things; two Keenan Ivory Wayans as his partner, a man who cries while watching Casablanca; and three John M. Jackson(Adm. Chegwidden from JAG)as the bad guy. Wayans spends his time trying to figure out Seagal, while Segal is going after Jackson for killing his ex-wife. Anyone who has see Seagal knows that killing his wife is bad move, and we see here that he holds his ex just as dear. This is typical Segal martial arts action. The addition of Wayans gives it some comedy to made the ride more enjoyable. Don't think, just sit back and enjoy."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Seagal/Nasso Productions"
      ],
      "summaries": [
         "Jack Cole is a soft spoken, mystical, new age New York cop with a checkered past. He is transferred to Los Angeles to help Los Angeles cop Jim Campbell solve a series of brutal murders in which the victims are crucified. The murders that have happened since Jack arrived in Los Angeles just don't sit right with him. When the killer, known as the \"Family Man\", kills Ellen DunLeavy, who happens to be Jack's ex wife and the mother of his two kids, and Ellen's husband Andrew DunLeavy, it becomes personal - especially when Jack's prints are found on Ellen's body. Jack meets with his military mentor Smith, not knowing that Smith is in cahoots with local crime boss Frank Deverell.",
         "Jack Cole is a cop from the East Coast with vague history who transferred to L.A. He works with a detective Campbell who is pursuing a serial killer. Campbell learns Cole is not a man to be messed with. One of the victims of the serial killer turns out to be Cole's ex-wife. Later the killer is caught but they learn he wasn't the one who killed Cole's ex-wife. And evidence turns up that implicates Cole. Cole claims he didn't do it. He suspects that he's being framed that's when he calls someone who is a spook and the man doesn't give him a straight answer. Later someone tries to kill Cole and Campbell. They suspect it might have something to do with some dead Russians they found who died of radiation poisoning.",
         "Steven Seagal plays a cop with a mysterious past. He and his partner, Keenen Wayans, are Los Angeles policemen who must race against the clock to catch a serial killer and his copycat.",
         "Two cops, played by Seagal and Wayans, are forced to work together to solve a chain of mysterious killings by a killer nicknamed \"The Family Man\""
      ],
      "budget": 45000000
   },
   "movielensId": 1004,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-04",
      "dvdReleaseDate": "1997-03-26",
      "directors": ["John Gray"],
      "runtime": 92,
      "movieId": 1004,
      "title": "The Glimmer Man",
      "mpaa": "R",
      "actors": [
         "Steven Seagal",
         "Keenen Ivory Wayans",
         "Bob Gunton",
         "Brian Cox",
         "Michelle Johnson",
         "Johnny Strong",
         "John M. Jackson",
         "Stephen Tobolowsky",
         "Ryan Cutrona",
         "Richard Gant",
         "Alexa PenaVega",
         "Nikki Cox"
      ],
      "imdbMovieId": "0116421",
      "originalTitle": "The Glimmer Man",
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["MGQ5Nq7r-Ho"],
      "plotSummary": "A former government operative renowned for his stealth, Jack Cole is now a Los Angeles police detective. When a series of horrible murders occurs in the metro area, Cole is assigned to the case, along with tough-talking fellow cop Jim Campbell. Although the two men clash, they gradually become effective partners as they uncover a conspiracy linked to the killings, which also involves terrorism and organized crime.",
      "tmdbMovieId": 9625,
      "avgRating": 2.68825,
      "releaseYear": "1996",
      "numRatings": 1660,
      "posterPath": "/2I1BMhKrjK9wcxvJ2SllttPIsIh.jpg"
   }
}