{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "frontiersman",
            "id": 156017
         },
         {
            "name": "davy crockett",
            "id": 208448
         }
      ],
      "imdb_id": "tt0047977",
      "video": false,
      "title": "Davy Crockett, King of the Wild Frontier",
      "recommendations": [
         50717,
         38107,
         53624,
         93115,
         79101,
         20173,
         40454,
         64877,
         462357,
         43885,
         26643,
         39295,
         23590,
         43785,
         43506,
         60545,
         38716,
         55150,
         64866,
         26542
      ],
      "backdrop_path": "/szjjXD6f4FjIXd5lbelBoT7oRvi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Davy Crockett",
               "gender": 2,
               "credit_id": "52fe45939251416c910371d3",
               "name": "Fess Parker",
               "profile_path": "/xtUQk0RgNSP9OBOlpPPQxplhgef.jpg",
               "id": 50571,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Thimblerig",
               "gender": 2,
               "credit_id": "52fe45939251416c910371dd",
               "name": "Hans Conried",
               "profile_path": "/7JnEMvdZEoA1uumb0HG2qKFh6ZP.jpg",
               "id": 16421,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "George Russel",
               "gender": 2,
               "credit_id": "52fe45939251416c910371e1",
               "name": "Buddy Ebsen",
               "profile_path": "/xBscNtDuEAUld96AlFEUPKM8TG9.jpg",
               "id": 1935,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gen. / President Andrew Jackson",
               "gender": 2,
               "credit_id": "52fe45939251416c910371e5",
               "name": "Basil Ruysdael",
               "profile_path": "/ptpgz4Rgql6FKVJNwjAcFo1kWbV.jpg",
               "id": 100919,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Maj. Tobias Norton",
               "gender": 2,
               "credit_id": "54ef3ccd9251417974006312",
               "name": "William Bakewell",
               "profile_path": "/k4IdU14MvpMCmrq4OXrV86i8404.jpg",
               "id": 2015,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Col. Jim Bowie",
               "gender": 2,
               "credit_id": "54ef3cf0c3a3686d5e005b99",
               "name": "Kenneth Tobey",
               "profile_path": "/eDD3rIv203f48tnu7ONwfjXQW7J.jpg",
               "id": 103069,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Col. William Travis",
               "gender": 2,
               "credit_id": "54ef3d3ac3a3686b9a003c2b",
               "name": "Don Megowan",
               "profile_path": "/x1PLgA5v2e8zYBGwJ042zqJhAqJ.jpg",
               "id": 31208,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Polly Crockett",
               "gender": 0,
               "credit_id": "54ef3d60c3a368402d003531",
               "name": "Helene Stanley",
               "profile_path": "/9v9lD28VLR498JQfvsfJfJ6mbRR.jpg",
               "id": 38236,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Bigfoot Mason",
               "gender": 2,
               "credit_id": "54ef3d809251417968006266",
               "name": "Mike Mazurki",
               "profile_path": "/s1alibwL5JiBhBNZQGiN91Hccc3.jpg",
               "id": 84229,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45939251416c910371d9",
               "name": "Norman Foster",
               "profile_path": "/y38fh2EnK9aqPWkhExs8eEY1Kiz.jpg",
               "id": 87459,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45939251416c910371eb",
               "name": "Thomas W. Blackburn",
               "profile_path": null,
               "id": 1002070,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54ef3b4cc3a3684aff0018a2",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54ef3b75c3a36869e5003b09",
               "name": "George Bruns",
               "profile_path": "/qH2a2m2LoLDCjpPj1h6sISFHDr0.jpg",
               "id": 57337,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "54ef3b8fc3a3686d5e005b73",
               "name": "Charles P. Boyle",
               "profile_path": null,
               "id": 231234,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54ef3ba9925141795f006452",
               "name": "Chester W. Schaeffer",
               "profile_path": null,
               "id": 103085,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54ef3bd4c3a3686b9a003c0b",
               "name": "Marvin Aubrey Davis",
               "profile_path": null,
               "id": 1432111,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "54ef3bf8c3a3680b80006868",
               "name": "Patrick Delany",
               "profile_path": null,
               "id": 1432112,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "54ef3c0d92514179650062e4",
               "name": "Emile Kuri",
               "profile_path": null,
               "id": 17670,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54ef3c2bc3a3686d58005f54",
               "name": "Dolores Rubin",
               "profile_path": null,
               "id": 1338894,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "54ef3c52c3a36869e5003b1c",
               "name": "Harvey Gould",
               "profile_path": null,
               "id": 1346728,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "54ef3c78c3a368402d00351a",
               "name": "Louis Phillipi",
               "profile_path": null,
               "id": 1432114,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 3.506385,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35115,
      "vote_count": 19,
      "budget": 0,
      "overview": "Legends (and myths) from the life of famed American frontiersman Davey Crockett are depicted in this feature film edited from television episodes. Crockett and his friend George Russell fight in the Creek Indian War. Then Crockett is elected to Congress and brings his rough-hewn ways to the House of Representatives. Finally, Crockett and Russell journey to Texas and the last stand at the Alamo.",
      "similar": [
         50717,
         66035,
         73194,
         65586,
         301764,
         342122,
         460821,
         445167
      ],
      "original_title": "Davy Crockett, King of the Wild Frontier",
      "runtime": 93,
      "poster_path": "/116pwuzAGuaH8mXM1lwebbvW4Po.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1955-05-25",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Davy Crockett Collection",
         "id": 181496,
         "poster_path": "/8CuB1HGxpy9C0og8WmpLABe4XSi.jpg"
      },
      "tagline": "NOW...on the MOTION PICTURE SCREEN!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Foster"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Thomas W. Blackburn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047977/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0ODU1MzcwNl5BMl5BanBnXkFtZTcwNjU4MTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Fess Parker, Buddy Ebsen, Basil Ruysdael | See full cast and crew »"],
      "reviews": [
         "I was 7 years old when this movie came out. I had a coonskin cap and wore it until it cut off my circulation. I'm now 50+ and have seen exactly three professional basketball, one hockey, two baseball and no football games. I built and hunt with a 1775 flintlock, horn and bag. My focus these days is Lewis and Clark but it was Fess Parker and Buddy Ebsen who captured my imagination and have kept me dreamin' for nearly half a century. Sure there were some Hollywood inaccuracies but the flavor, feeling and freedom of the eastern woodlands and the early frontiersmen were portrayed good enough to make me, and a lot of others, life-long Crockett admirers. \"Be sure you are right then go ahead.\"",
         "How can you say anything bad about a movie that gave you so much joy as a child and one that you can watch over and over again? The acting is a little bad and the script is a little stupid. Reference General Jackson \"stoppered?\" But even thought those things I feel are true, the joy is still there and you hate to see it end. Since no one knows how Crockett really died, not having him dead at the end but knowing it was only moments away was the best way they could have done it. The movie even had some historic truths which other movies about the Alamo lacked such as the attack before dawn. It seemed longer when I was a kid and I know they have cut some; yea even important scenes, which I wish they would restore to DVD or VHS.",
         "I first saw this film in 3 half hour segments over a 3 week period in 1956 and have seen it so often I can almost recite the dialogue. Fess Parker has been and always will be Davy Crockett, and even though George Russell was a ficticious character, he also did a super job. I reccommend this film highly, and its so much nicer to see at one time.",
         "I first saw this movie, over the 3 Sunday nights it ran on THE WONDERFUL WORLD OF COLOR, as The Disney show was then called, and fell head over heels with the character of Davy. He was so honest and good to my 5 year old mind and now, 50 (50!?!?!?) years later, I still admire the man and all he stood for. I was living in San Antonio, TX, at the time these 3 shorts came out, so I had my parents take me to the Alamo after the last installment and today I own a model 1816 Flintlock musket that was carried by a Mexican soldier in the second wave of the morning assault of March 6, 1836. The soldier; Eduardo Escalon's Great-Grandson furnished me written provenance from his Grandmother, who died in 1924, that her father had carried this particular rifle in the assault, and when he mustered out of the army after San Jacinto, he brought it with him when he emigrated to the US (Texas, of course), in 1838, and documents the history of the weapon during the battle, and it is in Fine shape for a rifle that's 179 years old and is still very accurate, though only for maybe 5- to 75 yards. And the tie-in to this film is obvious, and yes, I sometimes sit with the rifle in my hands when I watch the now DVD that just came out and think about the history of the whole scene.",
         "The life of Davy Crockett is told in this popular Disney television series that introduces Fess Parker as the resourceful backwoodsman from Tennessee. Crockett's exploits as Indian fighter are detailed in the first part of the series as he and partner Georgie Russel save the soldiers from being wiped out by the Creeks in that Indian war. Crockett as a Congressman from Tennessee comprises the middle part which sets up the third and exciting finale as Crockett and friends battle the Mexican army in the famous battle at the Alamo. The Appalachians of North Carolina where the Creek War skirmishes were filmed show beautiful mountain vistas and add realism to this fine film story of an American legend.",
         "The mid fifties television production of Walt Disney's \"Davy Crockett\" struck a nerve in the physic of American children. This three part TV mini-series launched the \"Davy Crockett Craze\", a phenomena that swept the Nation for some time. Davy Crockett collecting cards, coonskin caps, toys, other assorted memorabilia, and the ever popular recording of the \"Ballad of Davy Crockett\", were only some of the outward signs of it's vast popularity. Actors, Fess Parker, as Davy Crockett, and Buddy Ebson as his sidekick, Georgie Russell became popular with almost most every child in America, practically over night. The show was so successful that the original three part series was clipped together and released to theaters as a full length movie. Then the Disney Studio produced a two part TV sequel the following year. There is little doubt that by today's standards there was nothing special about it's plot, or dialog, or the acting, etc. Some critics might go as far to say it was rather silly, childish, and a mediocre production at best. Perhaps that's all true, but it would miss the most important point. Seldom has any TV production cause so many young people to love a couple of screen characters so deeply, and with such spontaneous joy. In this regard it is a Classic and holds a special place in the history of television art.",
         "Fess Parker's \"Davey Crockett\" provides an entertaining story of his Tennessee origins to his final act of courageous devotion at the Alamo. Serious historians can certainly dispute the film's adherence to the facts of Davey Crockett's life. This portrayal made Davey Crockett a hero to the men of the US's baby boomer generation.",
         "Wow, was this big stuff back in the mid '50s. I remember my little brother walking around with his coonskin cap on all day. This was exciting material back then, and when we were young boys. When we first saw this, it wasn't one film but three episodes on the weekly \"Disneyland\" TV program. Looking at it 50 years later was a bit disappointing, but I should have expected that. It looks so dated and the story ends so abruptly. However, it was still fun to watch, not just a piece of nostalgia. It's almost refreshing to see such a likable, old-fashioned, God-honoring hero on screen again. You certainly don't see a lot of that today. The grammar is so bad in here with Davy (Fess Parker) and his buddy \"George\" (Buddy Ebsen) and the expressions so country-corn pone that you can't believe some of the things you hear! The best part for us old codgers might be that Davy Crockett theme song. Tough to get that out of your head, once it's in there.",
         "probably the best movie ever made. i grew up watching this movie. i have always loved it and i always will. Fess Parker was great in this film he is the perfect davy crockett. i didn't any of the other crockett movies, but i bet they are pretty good. i recommend this movie to anybody who likes history.",
         "1st watched 9/23/2001 - 6 out of 10(Dir-Norman Foster): Simple yet BIG-hearted hero in Davy Crockett is represented here as doing many bigger than life things than dying as a martyr for the American old west at the Alamo but living on in the hearts of others. Fess Parker displays this hero with much humor along with his partner played by Buddy Epsen which helps because we have a hard time believing all of the stories of grinning a bear down(or 'bar' according to Crockett) and fighting injuns with his bare hands and winning. Light-hearted fare with wonderful character shown in the Davy Crockett legend should always be appealing to the American spirit."
      ],
      "genres": [
         "Family",
         "Western",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Legends (and myths) from the life of famed American frontiersman Davey Crockett are depicted in this feature film edited from television episodes. Crockett and his friend George Russell fight in the Creek Indian War. Then Crockett is elected to Congress and brings his rough-hewn ways to the House of Representatives. Finally, Crockett and Russell journey to Texas and partake in the last stand at the Alamo.",
         "This theatrical feature was a compilation of \"Davy Crockett Indian Fighter\" and \"Davy Crockett at The Alamo\", the 1st and 3rd of episodes of the \"Davy Crocket\" series that first aired on ABC TV's \"Disneyland\"(1954-5), two hour long shows less commercials. As the film ran 93 minutes, the 2nd episode, \"Davy Crockett Goes To Congress\", was not included."
      ],
      "budget": 0
   },
   "movielensId": 1008,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1955-05-25",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Norman Foster"],
      "runtime": 93,
      "movieId": 1008,
      "title": "Davy Crockett, King of the Wild Frontier",
      "mpaa": "",
      "actors": [
         "Fess Parker",
         "Hans Conried",
         "Buddy Ebsen",
         "Basil Ruysdael",
         "William Bakewell",
         "Kenneth Tobey",
         "Don Megowan",
         "Helene Stanley",
         "Mike Mazurki"
      ],
      "imdbMovieId": "0047977",
      "originalTitle": "Davy Crockett, King of the Wild Frontier",
      "genres": [
         "Action",
         "Adventure",
         "Family",
         "Western"
      ],
      "youtubeTrailerIds": ["AFN_1Ju7Hak"],
      "plotSummary": "Legends (and myths) from the life of famed American frontiersman Davey Crockett are depicted in this feature film edited from television episodes. Crockett and his friend George Russell fight in the Creek Indian War. Then Crockett is elected to Congress and brings his rough-hewn ways to the House of Representatives. Finally, Crockett and Russell journey to Texas and the last stand at the Alamo.",
      "tmdbMovieId": 35115,
      "avgRating": 3.31873,
      "releaseYear": "1955",
      "numRatings": 822,
      "posterPath": "/116pwuzAGuaH8mXM1lwebbvW4Po.jpg"
   }
}