{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "car race",
            "id": 830
         },
         {
            "name": "suicide attempt",
            "id": 1252
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "golden gate bridge",
            "id": 12393
         },
         {
            "name": "racecar driver",
            "id": 14725
         },
         {
            "name": "bug",
            "id": 15037
         },
         {
            "name": "car",
            "id": 33885
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "car trouble",
            "id": 156809
         },
         {
            "name": "automobile racing",
            "id": 159953
         },
         {
            "name": "volkswagen beetle",
            "id": 162463
         },
         {
            "name": "dual role",
            "id": 163129
         },
         {
            "name": "ghost town",
            "id": 166701
         },
         {
            "name": "animate car",
            "id": 169638
         },
         {
            "name": "smart car",
            "id": 169639
         },
         {
            "name": "entrepreneur",
            "id": 171068
         },
         {
            "name": "toll booth",
            "id": 179110
         },
         {
            "name": "the love bug",
            "id": 208361
         }
      ],
      "imdb_id": "tt0064603",
      "video": false,
      "title": "The Love Bug",
      "recommendations": [
         10869,
         14140,
         12129,
         18444,
         173,
         18966,
         17984,
         16249,
         11002,
         19186,
         13665,
         31102,
         29228,
         19378,
         37969,
         20723,
         12335,
         11843,
         22660,
         15944
      ],
      "backdrop_path": "/5OCkbaGGsyOGhqjMtHIcBSs0U9L.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jim Douglas",
               "gender": 2,
               "credit_id": "52fe45cf9251416c7506331d",
               "name": "Dean Jones",
               "profile_path": "/n9eCdZR2pUylbx53VEoTZ6INuIr.jpg",
               "id": 40393,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Carole Bennett",
               "gender": 1,
               "credit_id": "52fe45cf9251416c75063321",
               "name": "Michele Lee",
               "profile_path": "/eAFkwA216b6bFbkenlAqp03luT5.jpg",
               "id": 46944,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tennessee Steinmetz",
               "gender": 2,
               "credit_id": "52fe45cf9251416c75063325",
               "name": "Buddy Hackett",
               "profile_path": "/oOysYfFKgCHe1TUGa3wC743KFrx.jpg",
               "id": 67393,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Havershaw",
               "gender": 2,
               "credit_id": "52fe45cf9251416c75063329",
               "name": "Joe Flynn",
               "profile_path": "/jUZjkepueZTzW6X4PaaMwPxD95.jpg",
               "id": 23586,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mr. Wu",
               "gender": 2,
               "credit_id": "52fe45cf9251416c7506332d",
               "name": "Benson Fong",
               "profile_path": "/scGvvWLDaxHwRsNVmDaOzwGAidX.jpg",
               "id": 91254,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Association President",
               "gender": 0,
               "credit_id": "52fe45cf9251416c75063331",
               "name": "Andy Granatelli",
               "profile_path": null,
               "id": 118924,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Peter Thorndyke",
               "gender": 2,
               "credit_id": "52fe45cf9251416c7506333b",
               "name": "David Tomlinson",
               "profile_path": "/1QJLJtcJ4x8DQFflrbd2144ZzLg.jpg",
               "id": 5825,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Police Sgt.",
               "gender": 2,
               "credit_id": "52fe45cf9251416c75063343",
               "name": "Barry Kelley",
               "profile_path": "/q1t3gNvtx0A4pGHEGUJATuMIrwZ.jpg",
               "id": 89834,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Carhop",
               "gender": 1,
               "credit_id": "52fe45cf9251416c75063347",
               "name": "Iris Adrian",
               "profile_path": "/lLZZYHBg14NJ9aUt7BqeCQri36q.jpg",
               "id": 34509,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Detective",
               "gender": 0,
               "credit_id": "558a5739c3a36805450051a2",
               "name": "Joe E. Ross",
               "profile_path": "/zXCLzvsXCv6tC8ZddiG96U3O8jI.jpg",
               "id": 198065,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45cf9251416c75063337",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "545b8b07c3a368535d001724",
               "name": "Bill Walsh",
               "profile_path": null,
               "id": 5836,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "545b8b110e0a261fb3001f10",
               "name": "Don DaGradi",
               "profile_path": "/umaANl0jfZwnytLvyJetUPXHFkK.jpg",
               "id": 5837,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 9.134827,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14136,
      "vote_count": 163,
      "budget": 0,
      "overview": "Herbie is a car - but no ordinary car. The story follows the Volkswagen Beetle with a mind of its own from the showroom to the race track, with various close escapes in between. Three further Herbie movies were to follow.",
      "similar": [
         920,
         9291,
         86130,
         11287,
         10637,
         107,
         22881,
         70,
         96721,
         168259,
         323677,
         2323,
         26602,
         319888,
         11451,
         9955,
         9767,
         9563,
         13680,
         10393
      ],
      "original_title": "The Love Bug",
      "runtime": 107,
      "poster_path": "/nZ1ZGuFP0okrwuGhvl7A2q3YSul.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         }
      ],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1968-12-22",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": "/hgi9EeU50KFhv9pCDmJyx4VLp5G.jpg",
         "name": "Herbie Collection",
         "id": 12087,
         "poster_path": "/uFvt8t7HlB6BzjiJDU6ea1eI28L.jpg"
      },
      "tagline": "Herbie will honk his way into your heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Bill Walsh",
         "Don DaGradi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064603/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxOTgxMzI1OV5BMl5BanBnXkFtZTcwOTcwMDAwMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Dean Jones, Michele Lee, David Tomlinson | See full cast and crew »"],
      "reviews": [
         "Dean Jones plays a race car driver who meets a pretty young woman (Michelle Lee) he sees working in the window at a fancy car dealership. He pretends to be interested in a car, but the dealer has nothing he can afford. Well, actually, that's not true. There is one little Volkswagen Beetle that was purchased by a woman who also bought a Bentley. She bought it for her maid but brought it back because the car misbehaved. Jones isn't interested in the car, but it follows him home. Cops show up at his place accusing him of stealing the car, which of course he didn't. Jones blames the sleazy car dealer for this, and for the strange behavior the car exhibits when he tries to drive it. The car has a mind of its own, and its special qualities make it good for racing. A romance develops between Jones and Lee when Lee tries to convince Jones the car is normal but soon finds out the truth. Lee can't stand Jones at first, of course. Eventually Jones decides to keep the car and race it, but the car dealer wants in on the action, offering to buy this special car. Jones won't sell to him, but he eventually sells to a Mr. Wu (some people may be offended by stereotypical portrayals of Chinese people, and Wu starts out as a stereotype but later seems quite sophisticated). The car dealer tries his best to keep Herbie from being a success. Jones and Lee did well in their parts but they seemed like they were acting. Buddy Hackett was quite good as an artist who creates works out of car parts and later served as Jones' crew. Hackett named the car Herbie because it reminded him of his uncle. And the actor playing the car dealer was delightfully evil. The special effects were amazing for the era in which the movie was made. It really looked like the car could do some amazing things. And of course the car seemed to have a personality, one that made us like it. The racing scenes were quite well done, and it's hard to believe there were not more wrecks. Maybe the cars were filmed at slower speeds than what we saw. While quite funny, the movie also had its tender moments and could even be sad: Herbie tried to jump off the Golden Gate Bridge, for example. I didn't really see anything to concern parents, though maybe it was a little violent for the littlest ones.",
         "This is a true Disney Classic, in fact Walt Disney had a hand in developing the story but, sad to say, never lived to see it hit the big screen. In the film, we learn rather quickly that race car driver Jim Douglas(Dean Jones) has hit rock bottom after being a prominent race car driver(what caused his demise? it's not explained but it appears that he got into quite a few bang ups). He lives with a Buddhist named Tennessee Steinmetz(Buddy Hackett)who finds a soul in everything. Jim soon looks for a new car and comes across a fancy dealership, only to be embarrassed by the owner Peter Thorndyke(David Tomlinson) who refuses Jim's $80 offer for a gorgeous race car. While in the showroom, a VW rolls in that was supposed to be scrapped. As Thorndyke berates the little car, Jim sticks up for it and soon the car thinks it has a friend and follows Jim home. To avoid being blamed for stealing the car, Jim agrees to buy it from Thorndyke but the car acts up. Jim is about to return it when he's caught in a drag race because someone makes fun of the VW. Herbie blows the competition away and Jim falls in love with the car's speed, but Tennessee knows it has heart and names it Herbie. Soon Jim, Herbie and Tennessee are winning races and Jim's ego inflates while Thorndyke's temper grows since he too races and loses every time to Herbie. Thorndyke decides to sabotage the little car and when he succeeds, Jim turns his back on Herbie. Once Jim realizes HE hasn't being winning the races he tries to find Herbie who has since run off. Herbie gets impounded after an accident and Jim must sell him to a Chinese man who agrees to let Jim drive Herbie in a big race. If Jim wins, he gets to buy Herbie back for a buck. Needless to say, Thorndyke once again sabotages Herbie,but hey, this is Disney. Who do YOU think wins out at the end? I had to give this movie a 10 because it has so much going for it. Comedy, some drama, romance. We know very little about Jim Douglas except when Tennessee describes him as down on his luck, angry, and one who was prone to getting into trouble. Jones did an excellent job as the cocky, angry, egotistical driver who is knocked down a few pegs by his friends and a little car. The character mirrored Jones back then, who admits in his biography that he was a dirt bike racing nut prone to losing his temper quite a bit and having an affinity for women other than his wife. Michelle Lee is grand but we don't see much of her and Hackett plays the sincere bit amazingly well especially when he tells Jim that he was nothing without Herbie. For comedic relief David Tomlinson was terrific as was his assistant Havershaw(Joe Flynn of McHale's Navy fame). Yes there are some over the top, goofy and somewhat embarrassing sight gags and a few interesting moments(i.e. Carol thinking Jim has ulterior motives when Herbie brings them to a make-out point, i.e. when Herbie tries to kill itself, and when Jim finally admits to Carol that he's just a bum), but the film has heart, like Herbie. The film had three more sequels, a five part TV miniseries, a re-make in 1998(or so) and there's a new film coming out. Jones only did Love Bug, Monte Carlo(film 3), the miniseries and made a pathetic appearance in the 1998 film. In each one, Jones was still down on his luck but nothing like the sad figure he portrayed in Love Bug. Great classic film, filled with 60's nostalgia.",
         "[MAY CONTAIN SOME SPOILERS] Jim Douglas is a race car driver who isn't having much luck in racing. He always get's into accidents. He goes to stay with his spiritual friend, Tennessee. Next day he goes to a local car store that sells European Imports, but what caught Jim's attention were two beautiful legs, belonging to Miss Bennett, who was hanging signs on the window. Jim meets the owner, Peter Thorndyke, a greedy and a not-nice man (played by David Tomlinson, who's a vetera Disney actor). As Jim leaves, he notices a Volkswagen Beetle (after it bumps his leg). He also notices that same car in his front yard the next day. Everyone claims he stole it but he knows he didn't, so he purchases it and finds there's something \"different\" about it. Like, he wants to go one way and it wants to go the other. It also has cheeky ideas, like when Miss Bennet and Jim go for a ride in it to prove it's normal, it stops them at Seabreeze Point. Tennesse believes the car is special. He names it Herbie, after his Uncle Herb. Jim enters the little car in races and boy does Herbie race a mean race! Jim's back on his feet, and Thorndyke, despite his efforts to cheat, is always left in the dust. He's very angry, so one night, while Jim and Miss Bennet (Carol) were on a date, and they took The Special, Thorndyke pays Tennesse a visit. They suck back some Irish Coffee and get so drunk that when Tennessee is asked what part of Ireland he's from, he responds \"Coney Ireland\". Get it? Thorndyke also gives Herbie some of the stuff, and Herbie can't handle liquid, so his system is all messed up. He get's fixed and sees Jim bought a new car, so he runs away and Jim tries to find him. He finds him and also finds out that Herbie caused some vandalism. To Mr. Woo's Fish Market, but Mr. Woo offers to sponser Jim and the car in the El Dorado race because he learns the car can become his. So Jim, with the aid of Carol and Tennessee, enters the race. So does Thorndyke, and cheats! But the next day, it's Thorndyke who's left in the dust and Herbie wins first--and third place! Because he literally went to pieces! A happy ending! It's followed by three sequels. Dean Jones reprises his role as Jim Douglas in the third one: Herbie Goes to Monte Carlo. There was also a TV series and a TV movie. Yes the little Volkswagen has become a classic! I personally like this movie!! I find Volkswagen Beetles to be interesting looking cars. So see this movie, I think you'll like it! -",
         "What if things really do have an inner life? What if the machines we take for granted as being under our control have an essence, a life force, a soul that needs only to be cultivated to be brought out into the open? Mystic-minded hippie-type Tennessee Steinmetz (Buddy Hackett) argues that this is the case when his roommate, down-on-his-luck race driver Jim Douglas (Dean Jones) acquires a Volkswagen Beetle that frequently refuses to comply with its driver's demands. Tennessee claims that the car is alive, and names it Herbie. Jim doesn't believe this for a second, but that doesn't stop him from using the car's unusual speed to bring success to his previously undistinguished racing career. Meanwhile, Peter Thorndyke (David Tomlinson), the snobbish and hot-tempered owner of the dealership where Douglas bought the car, is having fits over Douglas' inexplicable winning streak. A race driver himself, Thorndyke becomes Jim's (and Herbie's) primary rival, resorting to increasingly sneaky tactics to prevail on the racetrack. Jim believes his own driving skill deserves the credit for his newfound success, but finally comes to believe the truth about Herbie in time for the final climactic race. By far the funniest and best of Disney's Herbie series, The Love Bug is silly fun that's still smartly written enough to be fun for all ages. The special effects are somewhat dated and primitive, but they suffice. It's not easy to make a car show emotion, but here it's done with surprising effectiveness. It also doesn't hurt that as a car, the VW Bug has a lot of personality to start with. The human actors do well too; Dean Jones makes for a likeable hero, and Michele Lee the love interest. However, the real comic gold comes from Buddy Hackett as the offbeat Tennessee, who in Jim's words is `just in off a flying saucer,' and David Tomlinson as British rival Thorndyke, whose angry outbursts are deliciously over-the-top without crossing the fine line into obnoxious overacting.",
         "The Love Bug is one of my favorite Disney movies. A movie about a car with a mind of it's own, a vw beetle with a heart, how could you not love a movie like that. Among all the great characters are the evil Peter Thorndyke, the beautiful Carole, the down on his luck driver Jim Douglas and the best one of the bunch Buddy Hackett as the wonderfully eccentric Tennessee Steinmetz, Tennessee has a Buddhist soul and does not discount the car as being alive. Love Bug is funny, sad and has scenes that will leave you to tears, you will laugh and shake your head. RIP Buddy wahhhhhhhhhhhhhhhhhhh",
         "After you've watched The Love Bug, you will notice 2 things: 1) You will not be able to get that infectious calypso tune out of your head for at least a week and will be whistling it everywhere you go! 2) You will want to rush out and hug the nearest VW Beetle! And when you see one, you will no longer just see a car - you will see Herbie! You will see Herbie's personality spring to life right in front of you! You will see the headlamps as eyes and the wing mirrors as ears... This lovely film is a timeless classic, packed with cute moments, great music, and fantastically funny lines !! Script-wise, it is definitely the best of all the Herbie movies. One criticism I have of the later movies is that I would like to have seen Herbie stay with his original owner Jim Douglas, and follow his adventures with that family rather than see him owned by lots of different people - partly because Jim, Tennessee and Carol are great owners for Herbie, but also because how does the poor little car feel being passed from owner to owner?! If Herbie was mine I would keep him and never sell him!!",
         "Since, I was three years old I have loved Herbie, the Volkswagen Beetle with a mind of his own. The Love Bug is a wonderful film for the family. Filled with adventure, comedy, and sweetness it is perfect for kids of all ages. When Jim Douglas, played by Dean Jones, starts to have a fluke in his racing career he almost gives up hope. He is stunned by a car dealership that is owned by Thorndyke, played by David Tomlinson, where he first runs into the famous Herbie. After standing up for the little car, Jim has found that the little car is his for keeps. After winning numerous races, Jim believes it is his luck and not the little car. Tennessee, played by Buddy Hackett, knows that it is the little car and not Jim. Tennessee also influences Carole, played by Michele Lee, who took a little more convincing. Thorndyke tries many evil and cruel stunts to win Herbie back. After a mere loss, Jim has to prove himself to the little car and to the rest of his friends. A big race is where Jim believes he will do it. The race is two days long and in those two days the little car will be tested to the limits. Herbie rides on water, rides with only two wheels, and even comes apart. Thorndyke is a true bad loser and is actually intimidated by the little car. This will determine who the better person in the end is. The actors in this movie are truly acting and the content of the movie is good as well. Robert Stevenson did a wonderful job directing this movie. Having the actors know how to act and having the little car doing all of the stunts played a really made a difference in this movie. As for the little car, I would like to know how they made him come to life so well that kept my interest for fifteen years. This is a wonderful movie and families every where will fall in love with Herbie and the rest of the cast.",
         "The phrase \"they don't make 'em like this any more\" has become a bit of a cliche, but in this case it certainly applies. This minor classic proves that there really was a time in which family entertainment movies were made for the whole family. The performances are excellent, especially David Tomlinson makes a gorgeous comedy villain. However, Dean Jones' play is equally recommendable, as the heroic lead is a much less rewarding role in pictures like this - while Tomlinson can just go for full throttle lovable nastiness, Jones needs to provide just the right dosages of heroism, arrogant charm, etc. to keep his character believable and flawed and likeable.",
         "Definitely this one is the best in the whole Herbie series. The characters are excellent. I found Dean Jones (Douglas) the most interesting to watch. At the beginning of the movie, he is totally dependent upon himself, not thinking the little car he is driving is actually doing it all for him. At the end, it is totally different. Michele Lee (Carole) helps to tame Jones really well and works very well at supporting Jones. Buddy Hackett (Tennessee) is a very interesting and funny character to watch - his belief that Herbie has an inner person in him, talking to Herbie as if Herbie actually had a real soul, and so on. David Tomlison (Thornkyke) as the movie villain is so cool. His lines are funny and his actions are engaging to the very end. Herbie himself is great providing all the laughs as well as only a Volkswagon can. Herbie was what really inspired me to want to get a VW bug. \"The Love Bug\" is terrific and if you like slapstick commedy, this film is for you. Only don't get too disappointed if you come away feeling that you're too old for this film.",
         "OK, this movie isn't high art. It's a silly comedy for kids or families. But if that's what you're looking for then this is a good one. Some of the performances are goofy, some of the images are goofy, but hey, there's nothing wrong with enjoying this movie. Just don't take it too seriously (because you can't) and let yourself be a kid for a while."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy",
         "Sport"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Meet Jim Douglas, a down-on-his-luck race car driver who lives in an old run-down fire house in San Francisco with his friend Tennessee Steinmetz, a occasional drunk mechanic. One day, Jim went to a luxury car dealer and surprisingly seen a strange Volkswagon Beetle with a unusual problem, it tends to drive on it's own almost having its own mind. Then this car drove all the way to Jim's home. Believing that the owner of the car dealership Peter Thorndyke, planted the car on him. Then, Jim wanted to try out the car for himself, then, he experienced the nature of the car for himself. Then, Jim fixed it and now is in more control. Tennessee dubbed the car \"Herbie\". Then, Jim used Heribe for races. Jim then, was rising to fame and becoming more successful in racing, Then, Thorndyke wants Herbie back, but Jim refuses and Thorndyke wanted to compete against Jim in the races, then Thorndyke sabotaged Herbie before a race so, he can win. then, a big race known as the \"El Dorado\" was coming up and Jim and Tennessee along with Thorndyke's former assistant (and ex-Girlfriend) Carrol Bennet, repaired Herbie before the El Dorado. The trio are determined to beat Thorndyke in the El Dorado, who will swindle and cheat to make sure that they do not win.",
         "A race car driver becomes a champion with a Volkswagen Beetle with a mind of its own."
      ],
      "budget": 0
   },
   "movielensId": 1010,
   "movielens": {
      "languages": [
         "Español",
         "English",
         "广州话 / 廣州話"
      ],
      "releaseDate": "1968-12-22",
      "dvdReleaseDate": "2003-05-20",
      "directors": ["Robert Stevenson"],
      "runtime": 107,
      "movieId": 1010,
      "title": "The Love Bug",
      "mpaa": "G",
      "actors": [
         "Dean Jones",
         "Michele Lee",
         "Buddy Hackett",
         "Joe Flynn",
         "Benson Fong",
         "Andy Granatelli",
         "David Tomlinson",
         "Barry Kelley",
         "Iris Adrian",
         "Joe E. Ross"
      ],
      "imdbMovieId": "0064603",
      "originalTitle": "The Love Bug",
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["KHoSXE9nIHg"],
      "plotSummary": "Herbie is a car - but no ordinary car. The story follows the Volkswagen Beetle with a mind of its own from the showroom to the race track, with various close escapes in between. Three further Herbie movies were to follow.",
      "tmdbMovieId": 14136,
      "avgRating": 3.07383,
      "releaseYear": "1968",
      "numRatings": 2763,
      "posterPath": "/nZ1ZGuFP0okrwuGhvl7A2q3YSul.jpg"
   }
}