{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "san francisco",
            "id": 582
         },
         {
            "name": "estate agent",
            "id": 2918
         },
         {
            "name": "shopping mall",
            "id": 6490
         },
         {
            "name": "volkswagon",
            "id": 179124
         },
         {
            "name": "käfer",
            "id": 179286
         }
      ],
      "imdb_id": "tt0071607",
      "video": false,
      "title": "Herbie Rides Again",
      "recommendations": [
         14140,
         12129,
         14136,
         19762,
         25305,
         9699,
         43041,
         27549,
         15310,
         18966,
         18783,
         22777,
         38539,
         31671,
         18698,
         11843,
         42466,
         19378,
         51036,
         41279
      ],
      "backdrop_path": "/3b7KBWUVoAN9sc90gvyZwX30cFV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mrs. Steinmetz",
               "gender": 1,
               "credit_id": "52fe43c79251416c7501dcbf",
               "name": "Helen Hayes",
               "profile_path": "/6QJDTvIT0v5E9pR1rgPtq59Ej8.jpg",
               "id": 47439,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Willoughby Whitfield",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dcc3",
               "name": "Ken Berry",
               "profile_path": "/i8fHfRK4668hqSxWfSEd1l6nh5Z.jpg",
               "id": 35031,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nicole Harris",
               "gender": 1,
               "credit_id": "52fe43c79251416c7501dcc7",
               "name": "Stefanie Powers",
               "profile_path": "/xjK7ytgxD9MVkB1vTgjHgn83xMS.jpg",
               "id": 39762,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Judson",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dccb",
               "name": "John McIntire",
               "profile_path": "/mqg5Cs6d6FCXlkR0ntUZfmR4As6.jpg",
               "id": 53010,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Alonzo P Hawk",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dcf9",
               "name": "Keenan Wynn",
               "profile_path": "/vKRcpt50Eh9AQ6yi9umy1YFZWyf.jpg",
               "id": 4966,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Loostgarten",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dcfd",
               "name": "Chuck McCann",
               "profile_path": "/vRsH2ZDfrrXe8ldfsUpd5qqTx2t.jpg",
               "id": 88450,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dcd1",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c79251416c7501dcd7",
               "name": "Gordon Buford",
               "profile_path": null,
               "id": 62397,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dcdd",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dce3",
               "name": "Cotton Warburton",
               "profile_path": null,
               "id": 5841,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dce9",
               "name": "Bill Walsh",
               "profile_path": null,
               "id": 5836,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c79251416c7501dcef",
               "name": "Frank V. Phillips",
               "profile_path": null,
               "id": 58007,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dcf5",
               "name": "George Bruns",
               "profile_path": "/qH2a2m2LoLDCjpPj1h6sISFHDr0.jpg",
               "id": 57337,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 5.479057,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10869,
      "vote_count": 95,
      "budget": 0,
      "overview": "The living Volkswagen Beetle helps a old lady protect her home from a corrupt developer.",
      "similar": [
         788,
         293863,
         256961,
         6978,
         20048,
         9802,
         707,
         402,
         10204,
         534,
         1949,
         14,
         426,
         1927,
         1402,
         628,
         160588,
         525,
         72207,
         2018
      ],
      "original_title": "Herbie Rides Again",
      "runtime": 88,
      "poster_path": "/1zwUtG1kwpJGtVqidpOrarswUB0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1974-02-14",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": "/hgi9EeU50KFhv9pCDmJyx4VLp5G.jpg",
         "name": "Herbie Collection",
         "id": 12087,
         "poster_path": "/uFvt8t7HlB6BzjiJDU6ea1eI28L.jpg"
      },
      "tagline": "The Loveable Bug's back doin' his thing!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Bill Walsh",
         "Gordon Buford"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071607/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NzU2MjU2Ml5BMl5BanBnXkFtZTcwNDM5MzUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Helen Hayes, Ken Berry, Stefanie Powers | See full cast and crew »"],
      "reviews": [
         "Willoughby Whitfield comes to work for his uncle Alonzo Hawk in a development company. His first job is to force the owner of an old fire station to shift off land earmarked for development. However Willoughby makes friends with the owners, including their eccentric car Herbie, and finds out about his Uncle's dirty tricks to move the residents on and joins with them to stop his uncle. This is a late Herbie movie \u0096 but really his appeal never goes away (they just remade The Love Bug). However here much has changed since his original appearance. Here the story doesn't involve him that much until the last half \u0096 up till then it could easily be any movie, and his scenes feel forced into the plot. That's not to say it's not good \u0096 but the story isn't as interesting as his race-car incarnation. There are some funny bits, like the dream sequence of Mr Hawk, but even the silly stuff that has Herbie driving up suspension bridges will please kids! Also where `Herbie Goes Bananas' benefited from a good support cast \u0096 this has no one to speak of. Not only has Dean Jones left (a big, big loss to the film) but no-one is good enough to provide any human interest. Berry makes a dull figure who can't do comedy, and Stefanie Powers is only of interest because, well, because it's Stefanie Powers! The only interest comes from Wynn's bellowing bad guy and Hayes' sweet grandmother. Herbie is OK but he is in charge the whole time and has maybe lost a touch of the `lovable little guy' appeal that he had in The Love Bug. Overall kids will love it, and it isn't a bad Herbie movie \u0096 it's just not as good as the first couple. But really \u0096 you know what to expect and it delivers nothing more.",
         "I grew up on Herbie movies. I even \"met\" Herbie in the Panama Canal Zone during the filming of Herbie Goes Bananas. (Thank you Mrs. Kelstom!) I hadn't seen a Herbie movie in 25 years. They're exactly as I remember. These films were made back when Disney still had a keen eye on children's imaginations. Is the film cheesy? Absolutely. Intentionally so. How else could a movie about a \"living\" car turn out? Helen Hayes is charming. Stephanie Powers is spunky. Keenan Wynn is almost perfect in his role as the over-the-top Disney villain. OK - the flashbacks to Herbie's racing career are too long. But the film is strong enough to succeed despite that setback. This film is classic early Disney - full of impossible fantasy and magical inventions. If you have children - this film is a must.",
         "Herbie the Volkswagon is one of my childhood favorites and this is the movie I discovered Him. Seeing this movie again, I ended up loving it all over again and think it is a pretty good family movie. A weird thing about this movie is that even though it was filmed in 1973, it looks like it was made in the mid sixties. I guess it was Stephanie Powers's character's sense of style and the heavy use of sets and rear projection. The Volkswagon beatle has always had a persona to it and the Herbie movies highlight it. \"The Love Bug\" and \"Herbie Rides Again\" are great examples of the child like spirit of Disney at their best.",
         "Herbie Rides Again is a great family comedy. The funniest part in the movie was when Herbie and all of his volkswagen friends chased Alonso Hawke down the streets of San Francisco. That part is hilarious and priceless. Children and adults will love this movie and the other Herbie movies too. Go out and buy all of the Herbie movies. You won't regret it.",
         "Warning - possible spoilers********************************* Sequels have a history of not turning out as great as their predecessor. This one is no exception. The replacement for Dean Jones, Ken Barry, while not poorly chosen, is definitely not as heartwarming or memorable as Dean Jones. Ditto for Stefanie Powers replacing Michelle Lee. Helen Hayes is good but she's just a little too sappy for my liking. Kenaan Wynn does the best job of all the actors in here. He's almost more enjoyable than David Tomlinson (Mr. Thorndyke) All the scenes were decent, but still not nearly as memorable as the original. Herbie's flashbacks to the first film is terribly boring and of not much value to the film. the feeble jousting scene seemed to be put there to show Herbie's racing value and was totally needless. The climbing of the Golden Gate Bridge scene was so obviously fake. Herbie did do more slapstick comedy and I did enjoy that part. Still, nothing like the original both in acting and in plot development.",
         "The thing that brought this film down the most was that the only original character was the VW. I much preferred Herbie Goes to Monte Carlo for two main reasons. Firstly the main character (Jim Douglas) was there and secondly because the plot was more about the car. This film felt more like a regular comedy that happened to involve Herbie. I would've rather the film to be more about the car rather than just involving him (as the original and Monte Carlo were). Funny moments saved the film from total lameness, as did the amusing 1974 special effects (was there really as many special effects people involved as were listed in the credits to get these results?). Not all the charm of the lovable car was lost on the plot that didn't involve him as he still played his part when the chips were down. In terms of acting, Herbie was obviously the best performance followed (albeit by a large margin) by Keenan Wynn as the baddie. I think he actually did a better job as the baddie than David Tomlinson did in the original 1968 film The Love Bug.",
         "\"The Love Bug\" runs this entry a very close second, but the energy of \"Herbie Rides Again\" makes it perfect for kids. There are many great scenes and sequences that appeal to the younger set, and the normally 'bo-ring' opening credits are spiced up with stock footage of buildings being demolished. That immediately made me pay attention when I was a little whipper-snapper! Disney should have stopped this series at this point. The next film, \"Herbie Goes to Monte Carlo,\" was pedestrian, and only saving grace was that it, A) features Don Knotts, and B) is 1,000 times better than \"Herbie Goes Bananas,\" the only good thing about which is the whacky title.",
         "In the first movie, Herbie was a real personality and he could be jealous, angry, depressed or suicidal and even intoxicated. The viewer saw that there was a special bond between car and owner. But in this sequel, again set in San Francisco, the bond is with Helen Hayes and Herbie instead of the man. Stephanie Powers as the love interest is too violent and aggressive, and her character played against the wimpy Ken Berry comes across as downright harsh--there is no chemistry between them (unlike Dean Jones and Michelle Lee in the original film). In various scenes, she is seen assaulting Berry.In one scene they are having lunch at Fisherman's Wharf and she stands up and smacks him in the face with a lobster (\"He's YOUR uncle?!\") Is this really supposed to be funny? But in this uninspired sequel, the real star is Helen Hayes--not the car and certainly not with Ken Berry, who merely becomes a supporting character in this. Helen Hayes, as an old lady battling a developer, is seen in various life-threatening situations in the movie. In various surreal scenes, Haye's character is knitting while riding Herbie,impervious to the danger around her as Herbie scales a skyscraper or rides atop the Golden Gate Bridge. She is sickeningly sacharrin sweet but she plays her scenes well. The climax of this movie is weak, and it is really a collection of surreal scenes involving Herbie and Helen Hayes. There is no romance and no racing, both of which were key elements which made the original such a success. This movie was made in the transitional period, between the really great Disney classics like \"Mary Poppins\" and the excellent productions that Disney puts out today. The movie and plot are very predictable as is the inevitable outcome. Naturally, there's no way that the outcome is realistic as city zoning laws forbid houses in a district of skyscrapers.",
         "Agreeable Disney's love bug Wolkswagen plenty of action , slapstick , laughs and fun . This comical Herbie story concerns about Alonzo Hawk (Keenan Wynn) who is an ambitious property developer who has bought lots of blocks of land in the Downstreet district in order to build a shopping mall and apartments . There is one obstacle however ; an old woman , firefighter's widow named Steinmetz ( Helen Hayes) who won't sell the one remaining lot that Hawk needs to carry out with his gigantic plot . So Hawk resorts to all manner of traps , legal or otherwise, to get it. Fortunately, the elderly widow Steinmetz has an ace under her sleeve in the form of Herbie , the fantastic car which she receives from her niece , as she takes a magical Wolkswagen Bug named Herbie with a mind of its own . Miraculous Herbie takes her for a ride and stumbles into Hawk's evil hoodlums who pursue through skyscrapers , bridges and buildings . As always, Herbie the love bug , is helping the young couple (Ken Barry , Stefanie Powers) find romance but encountering all sorts of hilarious obstacles along the way . Meanwhile Herbie with the number 53 dreams that intervenes in the biggest race cars located in Daytona to compete in the Grand Prize , a challenge among top competitors circle the world's most famous racing circuits and quickly slipping in the ranking. This ordinary Disney slapdash film displays great loads of amusement , fun , giggles , race cars and is pretty entertaining . It's an enjoyable movie for kids and for those who like cars racing round and round and bounds and leaps by Herbie . The actors seem to enjoy immensely , as Ken Berry and Stephanie Powers play of sympathetic manner and the mean-spirited owner Keenan Wynn , as excessive villain , is top notch . Colorful cinematography and jolly soundtrack including the lively leitmotif , usual in the Herbie's series. This is a delightful film , the original film turns out to be : ¨The love bug¨ (1969) by Robert Stevenson , followed by ¨ Herbie rides again , Herbie goes to Montecarlo , Herbie goes bananas ¨ among others and a 1997-for-television-movie and a TV series , the most part filmed by Stevenson and Vincent McEveety and usually starred by Dean Jones . Furthermore recent version starred by Linsay Lohan , Justin Long and Matt Dillon , being directed by Angela Robinson. This \" Herbie rides again ¨versi on is amusing and with lots of laughs but is a familiar film . The motion picture is correctly directed by Robert Stevenson .Worthwhile seeing , it's a great fun to watch and there are loads of entertainment in this one . It' one of the best and funniest of ¨Herbie¨ series .",
         "In this second Herbie movie, the car resides at an old ladys residence in an old fire station building. She is the only resident of a block not to give in to the demands of Alonzo Hawk, a developer planning the world's highest office tower. Whitfield, a relative of Hawk's and a newbie at being a lawyer, is given the mission by his new employer and uncle of convincing the woman to move so as to demolish her 'house'. Herbie and the woman's aeroplane hostess friend fight Whitfield over the matter until Whitfield is convinced that Alonzo is a no-good. Then Whitfield and the hostess fall for each other and with the help of Herbie stop the development. This is one of those interesting films from the 70s that uses older style movie making techniques to its advantage, not yet in the fast paced 80s but out of the experimental 60s, the film has a certain quality that is quite nice to the eye. The special effects and chromakey are used well, and at points a tad overused, but it is all in all a very enjoyable film."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Alonzo Hawk is a mean-spirited property developer who has bought several blocks of land in the downtown district in order to build a gigantic shopping mall. There is one problem however; an elderly widow named Steinmetz won't sell the one remaining lot that Hawk needs to proceed with his scheme. So he resorts to all manner of chicanery, legal or otherwise, to get it. Fortunately, the widow Steinmetz has an ace up her sleeve in the form of Herbie, the miraculous Volkswagen.",
         "The living Volkswagen Beetle helps an old lady protect her home from a corrupt developer."
      ],
      "budget": 0
   },
   "movielensId": 1011,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-02-14",
      "dvdReleaseDate": "2004-05-04",
      "directors": ["Robert Stevenson"],
      "runtime": 88,
      "movieId": 1011,
      "title": "Herbie Rides Again",
      "mpaa": "G",
      "actors": [
         "Helen Hayes",
         "Ken Berry",
         "Stefanie Powers",
         "John McIntire",
         "Keenan Wynn",
         "Chuck McCann"
      ],
      "imdbMovieId": "0071607",
      "originalTitle": "Herbie Rides Again",
      "genres": [
         "Romance",
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["swDEaCgluWQ"],
      "plotSummary": "The living Volkswagen Beetle helps a old lady protect her home from a corrupt developer.",
      "tmdbMovieId": 10869,
      "avgRating": 2.75045,
      "releaseYear": "1974",
      "numRatings": 1653,
      "posterPath": "/1zwUtG1kwpJGtVqidpOrarswUB0.jpg"
   }
}