{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ranch",
            "id": 2752
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "cattle",
            "id": 15225
         },
         {
            "name": "boy and dog",
            "id": 158416
         },
         {
            "name": "cattle ranch",
            "id": 158615
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt0050798",
      "video": false,
      "title": "Old Yeller",
      "recommendations": [
         18444,
         37969,
         31102,
         24816,
         15944,
         22777,
         15943,
         25773,
         19762,
         6174,
         43506,
         20583,
         215405,
         157974,
         29428,
         47841,
         126914,
         43767,
         100339,
         115039
      ],
      "backdrop_path": "/dYxm1GXu9AJtTzZvVm871nsWQjr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Katie Coates",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01abc1",
               "name": "Dorothy McGuire",
               "profile_path": "/iGkamkWnIor7eYrTDQMxAjxoQbA.jpg",
               "id": 24815,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jim Coates",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01abc5",
               "name": "Fess Parker",
               "profile_path": "/xtUQk0RgNSP9OBOlpPPQxplhgef.jpg",
               "id": 50571,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Travis Coates",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01abc9",
               "name": "Tommy Kirk",
               "profile_path": "/30E79Tjibru53EWmXNmAddZSKlx.jpg",
               "id": 83130,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Arliss Coates",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01abcd",
               "name": "Kevin Corcoran",
               "profile_path": "/3RLdYK6I0JNqDf5FtAG4EFPzy5f.jpg",
               "id": 83131,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bud Searcy",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01abd1",
               "name": "Jeff York",
               "profile_path": "/9IT2PeqOiqA3jMYa0bGRmSMfrGZ.jpg",
               "id": 34470,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lisbeth Searcy",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01abd5",
               "name": "Beverly Washburn",
               "profile_path": "/z4mrxE78UFYUB0PsyKapjU3s7rm.jpg",
               "id": 15983,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Sanderson",
               "gender": 2,
               "credit_id": "54f01748c3a3682e97000aae",
               "name": "Chuck Connors",
               "profile_path": "/bBjFRL4ULfnegDMU6iNKBwS4IVj.jpg",
               "id": 27747,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01abdb",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01abe1",
               "name": "Fred Gipson",
               "profile_path": null,
               "id": 240006,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe444ac3a368484e01abe7",
               "name": "William Tunberg",
               "profile_path": null,
               "id": 165517,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54ef3940925141795f006421",
               "name": "Oliver Wallace",
               "profile_path": "/6itGFNrQVHPRC3C0sOXVMevFqii.jpg",
               "id": 64868,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "54ef3959c3a3680b80006826",
               "name": "Charles P. Boyle",
               "profile_path": null,
               "id": 231234,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54ef3973925141796800620e",
               "name": "Stanley E. Johnson",
               "profile_path": null,
               "id": 1432108,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54ef399fc3a3686b9a003bda",
               "name": "Carroll Clark",
               "profile_path": null,
               "id": 3255,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "54ef39c8c3a3686d66006f1b",
               "name": "Emile Kuri",
               "profile_path": null,
               "id": 17670,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54ef39ed925141795f006432",
               "name": "Fred M. MacLean",
               "profile_path": null,
               "id": 13974,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54ef3a039251413ae8003634",
               "name": "Gertrude Casey",
               "profile_path": null,
               "id": 1432109,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54ef3a2fc3a3680b80006836",
               "name": "Chuck Keehne",
               "profile_path": null,
               "id": 1332198,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54ef3a7d92514179650062c0",
               "name": "Frank McWhorter",
               "profile_path": null,
               "id": 120033,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 5.586611,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22660,
      "vote_count": 86,
      "budget": 0,
      "overview": "Young Travis Coates is left to take care of the family ranch with his mother and younger brother while his father goes off on a cattle drive in the 1860s. When a yellow mongrel comes for an uninvited stay with the family, Travis reluctantly adopts the dog.",
      "similar": [
         9598,
         82703,
         9447,
         12501,
         10345,
         21183,
         10063,
         66125,
         47354,
         33660,
         26703,
         77946,
         26179,
         50241,
         29058,
         43384,
         52032,
         87589,
         26702,
         299583
      ],
      "original_title": "Old Yeller",
      "runtime": 83,
      "poster_path": "/cpmJyQpmg6fF8VkBUAAFIs8tLKh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1957-12-25",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "All the heart, all the excitement of a great frontier adventure!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 83,
      "synopsis": "Not long after the end of the Civil War, a young family settles in a community called Salt Licks, Texas. Jim Coates (Fess Parker), his wife Katie (Dorothy McGuire) and two sons, Travis (Tommy Kirk) and Arliss (Kevin Corcoran), have a pretty good start on things, but are lacking money, except some minor amounts of useless Confederate money. The same is true for most of the other families in the area. Jim joins forces with other ranchers and they embark on a cattle drive to Kansas, to trail and sell their cattle and acquire money to buy things they need. Jim tells Travis he's depending on him to help his mother and look after the ranch while he's gone for the next 3-4 months. He promises to bring Travis the horse he wants when he returns from Kansas. Travis is plowing the cornfield with Jumper the mule when a big yellow dog barrels through the field while chasing a rabbit. That spooks the mule, which bolts and takes off running, dragging Travis behind. Travis escapes from the plow harness, but the mule continues running, the plow knocking down a long section of fence in the process. Travis is furious with the dog, throwing rocks and threatening to shoot it if it comes around again. The younger boy, Arliss, regularly collects small animals and puts them in his pants pockets, much to the dismay of his mother. When Arliss hears about what happened with the strange yellow dog, he immediately wants to find and keep it. The next morning, the dog is lying outside the front door, and when Travis goes for a stick to use in chasing the dog off, Arliss is upset and is ready to fight his older brother in order to protect the dog. Arliss immediately adopts the dog and his mother approves, encouraging Travis to reconsider his feelings about having the dog around. Travis really wants nothing to do with the dog, but his feelings begin to change after he brings home a deer he shot and hangs the meat on the front porch, warning the yellow dog not to touch it or he'd pay the consequences. Travis then purposely lowers the meat so it will be easily within reach of the dog. The next morning, Travis grabs his gun in anticipation and goes out onto the porch, expecting the meat to be gone and thus providing a reason for him to shoot the dog. However, the meat is untouched and the yellow dog is lying quietly nearby. The makes a great impression on Travis. Arliss has taken to calling the dog \"Yeller.\" He rides Yeller like a small horse, takes him fishing (Yeller catches a catfish), and they go swimming together in the family's spring water pool. One day, Arliss is breaking off small pieces of bread and tossing them to a small black bear cub. When the cub comes closer, Arliss jumps on it and tries to catch it. The cub cries out and within moments, the mother bear comes running, heading right for Arliss. Yeller flies into the picture and attacks the mother bear, keeping her at bay until Mrs. Coates rescues Arliss. That event confirms the complete acceptance and respect for Yeller by Travis. Bud Searcy (Jeff York) and his daughter Elizabeth (Beverly Washburn) come by to check up on the Coates family. Bud is a lazy, big-mouthed sort who was left behind by the men of the community to look after the families while they were gone to Kansas. Bud's most redeeming points are his ability to show up around meal-time, get his daughter to do any work that needs done, and to tell exaggerated tales about his experiences and those of his family members. Elizabeth, who is about Travis age, confides in Travis that she has seen Yeller stealing eggs and cornbread from members of the community. She won't tell her father or anyone else however, because she knows Yeller is the father of the pups her dog is expecting and she doesn't think it would be nice to get the father of her dog's pups in trouble. Travis determines that one way to keep Yeller from roaming and getting in further trouble, is to put him on guard duty in the cornfield, where raccoons have been eating the corn. Yeller does a good job of chasing off the coons. The Coate's lone milk cow, Red, goes off into the woods to birth her calf and Travis takes Yeller to go find them. The cow, being protective of her calf, attacks Travis and Yeller intervenes and actually knocks the cow down twice before she decides to stop chasing Travis. Travis carries the calf home while Yeller herds Red back. Red is still very upset, having been tied to a fence without her calf nearby. Travis must attempt to milk her, but she kicks at him. So, he calls to Yeller to come help. Yeller slowly walks towards Red, stopping a few feet away and just stares at her. She immediately calms down and presents no further problem. Mrs. Coates is amazed. Burn Sanderson, a rancher passing through from San Antonio, comes by the house and announces that he lost a big 'ol yellow dog recently. He said the dog was an excellent cattle dog and he hoped to get him back. Mrs. Coates tells Travis to go get Yeller. Travis doesn't want to, but he does as told. As Sanderson puts a rope around Yeller's neck and begins to ride away, Arliss picks up some rocks and throws them at Sanderson. That spooks Sanderson's horse and it bucks him off. Sanderson is a wise and kind person and he immediately realizes the impact Yeller has made on this family in the short time he's been there. He challenges Arliss to approach him, as though to deal with the matter man-to-man. He then offers to trade the yellow dog for the horned frog that Arliss has in his pocket, plus a \"woman-cooked meal.\" Arliss agrees and his mother helps with the meal part of the deal. Before he leaves, Sanderson releases the horned frog and confides in Travis that there are cases of hydrophobia (rabies) showing up in the area. He advises him not to delay in quickly dispatching any unusually aggressive animals he may come across. Travis decides to try a method of catching some wild pigs that Mr. Searcy had told him about. It involves climbing into a low hanging branch, having your dog herd the pigs under the branch, lowering a rope noose to catch one pig at a time, pulling it up, notching it's ear (in effect, branding it), then continuing with the rest of the pigs. Travis and Yeller collaborate well and he successfully marks one small pig, but his second attempt is a larger pig and it pulls him out of the tree. A boar with sharp tusks then attacks Travis, cutting his leg. Yeller saves him, but in the process, Yeller is severely injured. Travis uses a neckerchief on his leg, then wraps his shirt around Yeller's torso wound and helps him into a small cave for protection and runs for home. Mrs. Coates returns with Travis, Arliss, and Jumper to see about Yeller. She sends Arliss off to catch a green lizard for her (to keep him busy), while she uses one of Jumper's tail hairs to sew up Yeller's wound. They then use a travois to haul Yeller home to recover. While Travis and Yeller are recovering, Mr. Searcy and Elizabeth come by. Elizabeth brings with her a small yellow puppy, one of Yeller's pups, and offers it to Travis. Travis says he's not interested and tells her to give it to Arliss. Elizabeth is very hurt and deposits the puppy in Arliss' lap as she rushes out, crying. Arliss is thrilled with the pup. Some days later, the hydrophobia makes its presence known in the form of the cow, Red, becoming infected and going crazy. Travis must shoot the cow, and while his mother and Elizabeth are putting wood on a large fire to burn the carcass, a wolf attacks them. Yeller is right on the spot and engages the wolf. Travis runs out with his rifle and when he has a clear shot, he shoots the wolf dead. Yeller has some bite marks and Mrs. Coates tells Travis that he will need to shoot Yeller too, because he's no doubt infected, as the wolf had been acting very strangely when it attacked. Travis convinces his mother to let him put Yeller in a pen and observe him. After nearly four weeks of being penned, Yeller does in fact turn mean and snarls and snaps, first at Travis then Arliss. Travis acknowledges the inevitable and goes to get his gun. After considerable difficulty, Travis points the gun at Yeller and pulls the trigger. The next day, Mr. Coates returns home, bearing gifts of a new dress and shoes for his wife, an Indian headbonnet and hatchet for Arliss, and a new horse for Travis. Travis and Elizabeth are in the process of burying Yeller. Travis is despondent and doesn't respond as his father hoped he would upon seeing him and the new horse. Mr. Coates fully understands the situation, however, and counsels his son. Mr. Coates tells Travis that life can sometimes knock a person flat and make them hurt bad. He says that people need to be careful that life's bad events don't overwhelm them and cause all life to seem bad. He explains that along with the bad in life, there's also good, and the good can be found if a person just looks for it. Travis is naturally skeptical, and probably disbelieving, but when he observes his mother getting angry at the little puppy for dragging off a slab of venison to chew on, he immediately recognizes Yeller's character exhibiting itself in the pup, and he smiles in recognition of what his father was talking about.",
      "writers": [
         "Fred Gipson",
         "William Tunberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050798/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MTcwNjAwNF5BMl5BanBnXkFtZTcwMTYzODAzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dorothy McGuire, Fess Parker, Tommy Kirk | See full cast and crew »"],
      "reviews": [
         "While there are many really good dog films out there, in my honest opinion, they all submit to the leader of the pack, and that leader's name is Old Yeller. I first saw this film when I was 10 years old, and have been a huge fan ever since. While the acting is superb, and the story is top notch, the real star of this film is the 170 pound Labrador/Mastiff mix named Spike who played the part of Yeller with heart and soul. If you are one of the few in the world who does not know the story of \"Old Yeller\", be warned that you may shed tears after seeing what many consider to be one of the most heartbreaking scenes in movie history. But that scene only makes you love this movie even more as through tragedy comes hope and learning experiences. Don't miss one of the greatest classics of all time.",
         "Not used as a scale of masculinity anymore, but more like a joke among men, Did you cry? Hell yes I cried my ever living loving guts out. I was so upset I probably cried three hours after the movie was over. Guess I was about eight when I saw it but yes, I still cry when I watch Old Yeller. This is one of those movies that every single person in America should watch. And if you have ever had to put a pet down, you know how heart wrenching and how that animal looks back at you with those innocent eyes right before death. But life continues on and death is just one of those parts of life. But Disney knows how to pull every heart string in the world, even a man's.",
         "I must have seen this when I was a kid (on TV), but I'd forgotten just how good a movie this is. The technical aspects are great (that color!), the acting believable and naturalistic, and the story moves along at a really nice pace. There's nothing condescending or \"cutesy\" here, and the plot point of the kid trying to play grown up (ie, Tommy Kirk as man of the house while his father's away) is played out without the traps that so many coming-of-age films fall into: In this boy's world, being an adult is about working and taking responsibility, not sneaking drinks and experimenting with sex. Also, the \"messages\" were woven nicely into the script, not tacked on and rammed over your head. It also helped that they had actors, rather than \"stars\". This is really what family filmmaking (a term I generally hate) should be: Something that kids and adults can appreciate.",
         "The quintessential boy/dog movie. It does have obvious correlations with Marjorie Rawling's \"The Yearling\". I first saw this film on TV when I was six years old or so. Interestingly, at that time, I remember the Chuck Connors character as menacing and almost evil. On viewing as an adult, that character was a perfect gentleman, giving up the dog to the boy when he was under absolutely no obligation to do so. Also interesting to see the casual, and basically unnoticed cruelty of the Travis character toward the little girl. I don't remember even noticing that as a child. Disney knew how to make real family entertainment in those days. Now, it seems that material suitable for children is targeted directly at them, and is generally a chore for adults to sit through. OY found a way to split the difference. Truly a classic.",
         "This film has a lot of heart, and there's not a phony performance in the entire movie. Fess Parker and Dorothy McGuire are perfect as the down to earth parents, and Tommy Kirk shines as the oldest son trying to become a man. Jeff York, who played Mike Fink in \"Davy Crockett and the River Pirates\", is funny as a lazy settler who doesn't do a thing. Even Chuck Connors has a fine cameo as the real owner of Old Yeller who gives the dog up to please a child. Old Yeller still has the power to make me cry, and I've seen it at least 50 times. It's sentimental and pushes all the right buttons, but I still love it.",
         "Old Yeller is one of Disney's Best. Superb performances all around, a very touching (especially for dog lovers, it might even be to painful for some i.e. my wife) with a very heart-wrenching ending. They don't make them like this any more. If you enjoyed Old Yeller, may I recommend you give The Yearling a try. Which is even better (if possible) than Old Yeller.",
         "I get the feeling that many people consider this movie \"old fashioned\". That's unfortunate. The story of people appreciating a dog's love and loyalty should always be considered first rate material. And in this case it was done by the master himself; Walt Disney. Who could not be captivated by Old Yeller's lovable face and smile. The well done story line took him from scoundrel to protector and companion. Granted, the scenes showing Old Yeller fighting off the animal \"villains\" had a somewhat unnatural look about them; but getting a herd of wild pigs, for example, to do what you want, can't be too easy. And Tommy Kirk really nailed it (the feeling of grief) in the scene where he put Old Yeller out of his misery.",
         "One of Walt Disney's most enduring films in popularity will continue to be Old Yeller. There's something in the saga of the Coates family and that yellow mutt that touches the kid in all of us. Fess Parker, wife Dorothy McGuire, and sons Tommy Kirk and Kevin Corcoran are the Coates family scratching out a living on a small ranch on the Texas frontier. Dad has to drive their herd to market in Kansas and he leaves the other three behind. Parker though he's second billed in the cast has barely fifteen minutes of screen time in the film. He leaves before the main action starts and returns really as anti-climax. Nevertheless he was a big name back in 1957, coming fresh off his triumph as Disney's Davy Crockett. Didn't hurt him at all to come from Texas for this part. So McGuire is left to cope with the kids, the farm, and a newly found stray yellow dog that both the boys take to. His coloring makes his name a natural and he proves quite a useful dog, earning more than his keep on the ranch. Sad to say though that Old Yeller provides the saddest moment in any Disney film since Bambi's mother was shot by the hunters. I really can't say too much more, but the Coates boys prove to be made of stern stuff and Dad provides some sound country wisdom as he gets back from his cattle drive. Because the setting is out in the wilds there are few human speaking parts. All the players here are well cast, but the one who's the best by far is Jeff York as the Coates neighbor Mr. Searcy. York appeared in a whole bunch Disney features and usually stole scenes in every one of them. York's a guy who's full of wisdom in his own right, he'll dispense with advice at the drop of a hat, but when there's work to be done is usually elsewhere. McGuire does remark it's no accident he's not on the cattle drive. When she needs help on the ranch, York delegates his daughter Beverly Washburn to stay behind. She's a sweet kid and a good worker and Tommy Kirk doesn't mind having her around at all. Chuck Connors is also in this as a visiting trail boss and I wouldn't be surprised if his appearance here in this family feature led to his family television series, The Rifleman. Fifty years after it was released Old Yeller is still good entertainment and will be making young folks dream about that idyllic boyhood the Coates kids have on those Texas plains.",
         "OLD YELLER (1957) **** Tommy Kirk, Dorothy McGuire, Fess Barker, Kevin Corcoran, Chuck Connors. ***SPOILER*** Disney live-action classic about Old West pioneer family's adopted stray dog, Old Yeller, who provides protection and much needed love all around. One of the most beloved family films and saddest of endings ever (to quote Bill Murray in `Stripes': `Who cried when Old Yeller died? I cried my eyes out!') landmarks this timeless classic",
         "Of all the movies I saw as a young in the theaters in the 1950s, the only one that haunted me or brought tears to my eyes was this one. It made a lasting impression on everyone in our family. Not long afterward, we bought a Golden Retriever puppy and it was a fabulous dog. After a long, long absence, I saw it for the third time in the late1990s on VHS. Since I never forgot the sad ending, I was prepared for that. My attitude was great going in, especially since I had become a fan of Dorothy McGuire since her magnificent performance in \"A Tree Grows In Brooklyn.\" Anyway - hey, I have to be honest - this time around I was disappointed. I think I expected too much since the film had such strong nostalgia value. Yes, it was still a nice old-fashioned story but the impact was so-so and McGuire looked like she had aged 20 years since \"Brooklyn.\" She didn't look like the same person from the famous 1945 drama. Tommy Kirk went on to be a star on television and in the movies for Walt Disney while I don't believe Kevin Corcoran, who was just as good as Kirk, did a whole lot after this....some westerns into the '60s. Good 'ole \"Davy Crockett,\" Fess Parker, also is in this movie but has a minor role, being seen only in the beginning and at the end. Chuck Connors also had a small role. A nice story, no doubt. Perhaps another viewing with lower expectations would make me rate this highly again. Just the name \"Old Yeller\" is still special to me, however."
      ],
      "genres": [
         "Family",
         "Drama",
         "Adventure",
         "Western"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Young Travis Coates is left to take care of the family ranch with his mother and younger brother while his father goes off on a cattle drive in the 1860's. When a yellow mongrel comes for an uninvited stay with the family, Travis reluctantly adopts the dog. After a series of scrapes involving raccoons, snakes, bears and all manner of animals, Travis grows to love and respect Old Yeller, who comes to have a profound effect on the boy's life.",
         "A boy brings a yellow dog home. The dog loves the family as much as they love him, but can the love last ?"
      ],
      "budget": 0
   },
   "movielensId": 1012,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-12-25",
      "dvdReleaseDate": "2002-05-07",
      "directors": ["Robert Stevenson"],
      "runtime": 83,
      "movieId": 1012,
      "title": "Old Yeller",
      "mpaa": "G",
      "actors": [
         "Dorothy McGuire",
         "Fess Parker",
         "Tommy Kirk",
         "Kevin Corcoran",
         "Jeff York",
         "Beverly Washburn",
         "Chuck Connors"
      ],
      "imdbMovieId": "0050798",
      "originalTitle": "Old Yeller",
      "genres": [
         "Adventure",
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": ["McSI-8TYPNQ"],
      "plotSummary": "Young Travis Coates is left to take care of the family ranch with his mother and younger brother while his father goes off on a cattle drive in the 1860s. When a yellow mongrel comes for an uninvited stay with the family, Travis reluctantly adopts the dog.",
      "tmdbMovieId": 22660,
      "avgRating": 3.54975,
      "releaseYear": "1957",
      "numRatings": 3809,
      "posterPath": "/cpmJyQpmg6fF8VkBUAAFIs8tLKh.jpg"
   }
}