{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "girl",
            "id": 14659
         },
         {
            "name": "tween girl",
            "id": 208185
         }
      ],
      "imdb_id": "tt0054195",
      "video": false,
      "title": "Pollyanna",
      "recommendations": [
         19186,
         103130,
         115360,
         79359,
         107673,
         132994,
         116696,
         143529,
         269749,
         81789,
         118898,
         184915,
         103886,
         429866,
         226343,
         98986,
         120506,
         260139,
         354524,
         194246
      ],
      "backdrop_path": "/6sN8AlLQu3RoG3tJdqMuTfgc36P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Pollyanna",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e407",
               "name": "Hayley Mills",
               "profile_path": "/aXXiQcIoFp7WywXDOsskfuLkRe3.jpg",
               "id": 36819,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Aunt Polly",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e3d9",
               "name": "Jane Wyman",
               "profile_path": "/nw2qjwNEEJvhJbgqSu9DmqBGY0W.jpg",
               "id": 20391,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. Edmond Chilton",
               "gender": 2,
               "credit_id": "52fe445e9251416c9100e3e9",
               "name": "Richard Egan",
               "profile_path": "/qOLUdKOQzu9HgKOHTG5Pbj0gIme.jpg",
               "id": 93105,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Reverend Paul Ford",
               "gender": 2,
               "credit_id": "52fe445e9251416c9100e3ed",
               "name": "Karl Malden",
               "profile_path": "/mszc66eJmCKzOD2vwl8qJrVSz1W.jpg",
               "id": 9857,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nancy Furman",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e3f1",
               "name": "Nancy Olson",
               "profile_path": "/hon9m9nniX5pJ6hqKLeeHCgigoX.jpg",
               "id": 8631,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mr. Pendergast",
               "gender": 2,
               "credit_id": "52fe445e9251416c9100e3f5",
               "name": "Adolphe Menjou",
               "profile_path": "/jAZRVhDGvEfRfJgGQCGk1GXMp1C.jpg",
               "id": 14563,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mayor Karl Warren",
               "gender": 0,
               "credit_id": "52fe445e9251416c9100e3f9",
               "name": "Donald Crisp",
               "profile_path": "/vESX6aAjaZlEgHYncLE1y76BFtD.jpg",
               "id": 8841,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mrs. Snow",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e3fd",
               "name": "Agnes Moorehead",
               "profile_path": "/ajpbxYhFVcpGAGMnux9zCwzRYlo.jpg",
               "id": 11025,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Jimmy Bean",
               "gender": 2,
               "credit_id": "52fe445e9251416c9100e417",
               "name": "Kevin Corcoran",
               "profile_path": "/3RLdYK6I0JNqDf5FtAG4EFPzy5f.jpg",
               "id": 83131,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Tillie Lagerlof",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e41b",
               "name": "Reta Shaw",
               "profile_path": "/vEiRl8Mj51VCykLT3TQox05CGKt.jpg",
               "id": 5828,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Angelica",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e41f",
               "name": "Mary Grace Canfield",
               "profile_path": "/8Jp6RS6cJQ6NBIbsts0SkBPpXPB.jpg",
               "id": 164778,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "George Dodds",
               "gender": 2,
               "credit_id": "52fe445e9251416c9100e423",
               "name": "James Drury",
               "profile_path": "/u5DdHFlBsKgcUokoZ3RDH4XjFZL.jpg",
               "id": 123524,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Amelia Tarbell",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e427",
               "name": "Anne Seymour",
               "profile_path": "/qulq6eZtU5qVPn2bxnOUu4AM4HK.jpg",
               "id": 40233,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Ben Tarbell",
               "gender": 2,
               "credit_id": "52fe445e9251416c9100e42b",
               "name": "Edward Platt",
               "profile_path": "/3ZEEg2FwYjDxJVzNU4nR03l0K2h.jpg",
               "id": 2646,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Mrs. Ford",
               "gender": 1,
               "credit_id": "52fe445e9251416c9100e42f",
               "name": "Leora Dana",
               "profile_path": "/rLZFb3BseMB6PndPu7kOlR9lnhv.jpg",
               "id": 76980,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Mildred Snow",
               "gender": 0,
               "credit_id": "52fe445e9251416c9100e433",
               "name": "Jenny Egan",
               "profile_path": null,
               "id": 1168519,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Mr. Neely",
               "gender": 2,
               "credit_id": "52fe445e9251416c9100e437",
               "name": "Ian Wolfe",
               "profile_path": "/ylp7puM2Hcd0VkQvXfmD7zkP4m7.jpg",
               "id": 2782,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Mr. Thomas",
               "gender": 0,
               "credit_id": "52fe445e9251416c9100e43b",
               "name": "Nolan Leary",
               "profile_path": "/cvDAH9SaOxrLHYrS1LCwVa4jEVd.jpg",
               "id": 103911,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Mr. Gorman",
               "gender": 0,
               "credit_id": "52fe445e9251416c9100e43f",
               "name": "Edgar Dearing",
               "profile_path": "/aHjtlKqJc3aa555TBO2Ksj1F11w.jpg",
               "id": 1240252,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe445e9251416c9100e3df",
               "name": "Eleanor H. Porter",
               "profile_path": null,
               "id": 110142,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe445e9251416c9100e403",
               "name": "David Swift",
               "profile_path": "/yDBh4Fv4cwilXTPGhl8FaEmpK7Q.jpg",
               "id": 29715,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe445e9251416c9100e413",
               "name": "David Swift",
               "profile_path": "/yDBh4Fv4cwilXTPGhl8FaEmpK7Q.jpg",
               "id": 29715,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53bca9560e0a2615760007fe",
               "name": "George Golitzen",
               "profile_path": null,
               "id": 1339264,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a775b57c3a3682265003454",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.942717,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31102,
      "vote_count": 61,
      "budget": 0,
      "overview": "A young girl comes to an embittered town and confronts its attitude with her determination to see the best in life.",
      "similar": [
         13523,
         11293,
         276,
         44564,
         979,
         19913,
         28178,
         489,
         13,
         68718,
         397422,
         226,
         48150,
         1024,
         49950,
         109689,
         862,
         50544,
         72105,
         297222
      ],
      "original_title": "Pollyanna",
      "runtime": 134,
      "poster_path": "/tNxBYc2uaOhWnzQwOwc1m3hnwHm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1960-05-19",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Meet the people, the pleasure, the entertainment of the year! All the love, laughter and drama that life can hold, poured into one unforgettable motion picture!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Swift"],
      "runtime": 134,
      "synopsis": null,
      "writers": [
         "Eleanor H. Porter",
         "David Swift"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0054195/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxOTk3MzE4OV5BMl5BanBnXkFtZTYwMjI2NjQ5._V1._CR8,70,266,404_SX214_AL_.jpg",
      "actors": ["Stars: Jane Wyman, Hayley Mills, Richard Egan | See full cast and crew »"],
      "reviews": [
         "A period piece that boasts about \"The Glad Game?\" Ready to tune out? So was I, until I got what was happening. This movie is profound, not only in its execution of story, but in the relevant, lovely message it naturally brings, as opposed to the message it sells. I've viewed it 5 times and each time, I am newly informed as to how I can adjust my attitude for a better way of life. I come from a school of thought where sunny is ridiculed and message movies are tedious, so the lead is an obvious target of disdain. Stay with Pollyanna awhile and watch her reform all the bitter, crusty malcontents on the planet into fans with a straightforward logic and uncanny point of view. A true heroine.",
         "A vast improvement on the cutesy, blatantly unrealistic and cliched story on which it is based, the Disney film Pollyanna is a truly enjoyable, BELIEVABLE film. It has a very charming, nostalgic feel to it. The period costumes and sets are very good, and the direction is good, too. The best thing about it, however, are the performances. The talented cast really makes you believe in them and forget they're all stereotypes. Jane Wyman is quite good as Aunt Polly, as are Agnes Moorehead, Adolphe Menjou, and espicially Karl Malden. And Hayley Mills more than holds her own, giving a very good, subtle, believable performance. This Pollyanna does not spend all her time chatting her mouth off and misinterpreting every cold act of her aunt's as an expression of love, which made her very annoying in the book, but rather, she really gets to know people and very subtly brings out the best in them. A truly good family film, much better than the book, and one really worth viewing.",
         "This is an absolutely remarkable film.It is uplifting,life-affirming,and painfully truthful about human ways.Even though it is set in the early 1900's, its message is still very applicable in the modern world.I was blown away by the genuine power of Hayley Mill's performance.The supporting cast is also excellent,especially Karl Malden and Agnes Moorehead.If you want to see a nearly flawless and absolutely charming fim,than this is the one to see.Far and away Hayley's best performance.",
         "SOME SPOILERS I wish that this movie could sink-in to some of the more cynical minds that walk the earth today. It is a great story that is full of meaning and nostalgia (which I love). Now before you sit down to watch this film, remember that the book, \"Pollyanna,' was a smash hit in the early 1900s. Several books followed the original along with board games and other children's merchandise. It is also important to note that the Pollyanna character was much more \"glad\" (more on that later) and overly talkative in the book than in Disney's rendition. But Disney's telling of the story, choice in casting, and authentic 1900s period recreation could not be any better. The film is set in the picturesque town of Harrington where all politics and decision-making are controlled by the wealthiest resident, Polly Harrington (Pollyanna's adopted aunt). Until being adopted, the little girl Pollyanna did not live a silver-spoon lifestyle. We soon find out that she was very poor while living with her missionary parents before they died. This somewhat explained why she is overwhelmingly upbeat and \"glad.' She plays \"The Glad Game\" with her new friends and neighbors and gradually wins over the entire town with her optimism and love. What was so moving about this story is how this little girl made grownups realize that they should be happy to be healthy and alive. Director David Swift went through hundreds of girls to find the right Pollyanna. And thanks to Uncle Walt (Disney), he found a Special Academy Award winner in Hayley Mills. Other notable characters that I loved were Jane Wyman as the prim and proper Aunt Polly, Karl Malden as the fire and brimstone Minister, Adolphe Menjou as the town hermit Mr. Pendergast, Reta Shaw as the cake-baking Mrs. Lagerlof and Agnes Moorehead as the hypochondriacal Mrs. Snow. All of these characters had great moments of dialogue which made the story seem so real. The one thing I love about Walt-era Disney films is the attention-to-detail. And the detail in this film was incredible. Costumes, buildings (Main Street USA, anyone?), songs, automobiles and the town bazaar are just some of the things that were authentic. Even the preacher's (Karl Malden) passionate flamed sermons were something not uncommon in this time period. This film really showed Walt's sentimental side. During the screening of the film, Walt wiped tears from his eyes because it was so touching. And how could anyone not do the same? I certainly do when I see the end. A perfect mix of cute moments for children and meaningful points for adults, Pollyanna (like Mary Poppins) is also \"practically perfect in every way.\"",
         "Filling the tiny, but oh so impressive feet of Mary Pickford in one of her most acclaimed silent screen classics was quite a chore for Walt Disney. But in an impressive American screen debut, Hayley Mills launched her career in a most impressive way as Pollyanna. Pollyanna, who is now an orphan, comes to live with her aunt Polly played by Jane Wyman who is one reserved New Englander. She's the richest woman in town and pretty much everyone kowtows to her. But when the eternally optimistic Hayley Mills comes to live in that town, her infectious spirit seems to effect everyone and everything around her. Pollyanna is one of Disney's best live action films, Mills and the rest of the cast make it believable without being maudlin. Disney gave Mills and Wyman an impressive roster of players in support that include, Donald Crisp, Leora Dana, Karl Malden, Nancy Olson, James Drury, Reta Shaw, Mary Grace Canfield, and Kevin Corcoran as Mills's partner in juvenile hijinks. Two people deserve special mention. One is Adolphe Menjou because this turned out to be his last film. He plays Mr. Prendergast the old miser who lives alone and miserable, but who softens at the warmth Pollyanna brings in his life. The second is my favorite here, Agnes Moorehead, who plays crotchety old Ms. Snow, one of those old folks who seem to enjoy being sick and miserable. Her scene at the end with Hayley Mills is the most touching of all in the film. Pollyanna like George Bailey in It's A Wonderful Life both never realizes all the good she's done in that town and like Jimmy Stewart's character faces a crisis. But all her friends rally to her in an It's A Wonderful Life type climax. Walt Disney does a wonderful job in recreating that era before World War I in small town America, very much like The Music Man. Pollyanna is what they mean by fine family entertainment, as good now as it was when I first saw it in theaters in 1960. In fact it might just make one curious enough to check out the Mary Pickford silent version.",
         "The DVD double-disk edition of this movie is a perfect example of just how GREAT DVDs can be! Ostensibly a \"big-kids' movie,\" \"Pollyanna\" is good enough to appeal to adults as well. I saw it when I was 10 years old, and fell in love with it then. I also had a crush on Haley Mills, as did most of the other boys I knew. Coming back now and finding the movie on DVD to be a treasure for myself--- nostalgia, childhood revisited, etc.--- came as no surprise. However, finding the high quality of bonus materials and extras on the two disks was amazing. Good for Disney Studios... Very well done! Contrast \"Pollyanna\" DVD extras with those found on the new \"Harry Potter\" DVD. \"Harry,\" an excellent movie, nonetheless has DVD extras that are mostly geared towards children. \"Harry's\" entire second DVD disk, the bonus disk, has high production values (that is, it was obviously expensive to produce), but most of it is so simplistic and slow that one can only imagine it was designed for the 8- to 12-year old crowd. Which is fine (note, however, that the \"Interviews\" selection on that disk is excellent and informative for adults, too). \"Pollyanna,\" however, gives us half a dozen bonus disk features that are ALL aimed at adults (yet might also be appealing to older, brighter, more inquisitive children). For example, Disney's film restorer guy gives a behind the scenes explanation and multiple demonstrations of how and why color film degrades, and how it can be brought back to life. \"Where are they now?\" type things give us modern day glimpses of the surviving stars of the movie. We get to hear them relate their experiences on the set, and experiences vis-a-vis the movie since that time. We see archival TV footage of Walt Disney commenting on the movie, what Haley Mills thought at the time, what she went through, what her dad (famed actor Sir John Mills) said, and what she thinks NOW, etc. The film's writer and director also makes in-depth appearances in various features on the bonus disk, AND, he and Haley Mills provide an interesting audio commentary as the feature itself is viewed (I read that the director, whose name I cannot recall this instant, died at the age of 80 or 81, just a few months ago. His death came just after the DVD bonus materials were prepared). The whole thing was as meaty and appropriate and entertaining as anything I've ever seen on The History Channel, or A&E or Bravo channels. Finally, the movie itself has been restored and lovingly presented (again, optional director and star commentary is available). It is still a good and solid entertainment! I gave this DVD edition of \"Pollyanna\" 10 out of 10. Seriously, I hope the other studios and DVD makers will study this disk religiously, and learn how it's done! I'd love to see ALL my DVDs prepared with this degree of detail, care, and mastery.",
         "Pollyanna is one of the sweetest movies I've ever seen. So what if it's cheesy at times? Movies are still cheesy today, sometimes, but at least Pollyanna is wholesome. Now don't get me wrong, I'm not an advocate for violence-free, nudity-free, perfectly goody-goody movies. But I do think this is a beautiful movie that just happens to be OK for everyone. Young children might be scared by the minister or by the ordeal Pollyanna faces, but the fun and happy scenes in the movie (the carnival is my favorite) will more than make up for the -- in the words of Pollyanna herself -- \"gloomy\" ones. Hayley Mills is terrific. Watch Pollyanna's expressions. You can tell, at times, she thinks everyone in town is completely nuts, but she never says it out loud. Instead, she keeps a happy and hopeful demeanor through most of the movie. And while, at first, the townsfolk resent her attitude and even insult her, she doesn't lose it, and she is rewarded for it in the end. This is a great message.",
         "This is a great family movie. I recommend this movie for children & their mothers. It might be a little cheesy for dads or men. It is very idealistic - Good values - good plot. It is not for everyone - especially if you are not \"young & pure at heart\" (or at least long to be). This Disney film is about a young girl and her joyous, Christian outlook on life. Her view & beliefs turn the town around. Hayley Mills was a wonderful young actress who also starred in Parent Trap (original), Summer Magic, That Darn Cat, etc. I have to make this review at least 10 lines - so I'll just end by saying that I hope this becomes a family favorite in your house, as it is in ours.",
         "As Pollyanna would say, the movie is simply \"gorgeous\"! In my 57 years I've seen this movie more times than I should admit. Just watched it again on Hallmark and felt compelled to offer my first comments on IMDb. Everyone can feel down, lonely or put upon at one time or another. \"Pollyanna\" is just the right medicine for those ailments. I realize this is early Disney, but that is a positive attribute, not an indictment. Cheezy? How about \"touching\" instead? The cast, the performances, the setting, and most of all, the message are right on. The film makes me laugh and cry every time I view it. How could you possibly ask for more? Guess I'm just a soft touch. Highly recommended for all but the terminally cynical.",
         "This movie ,,Pollyanna'' is quite fascinating especially the leading actress makes a wonderful atmosphere while watching the actual film. A good adaptation but it would have been nice if they'd show the ending with Pollyanna on crutches. In some moments you could have seen a tear in my eye, which proves the fact of the movie being sad and realistic. Sweet Haylie Mills and the other actors make a great-standard presentation of their talent.Unfortunately their seems to be something missing and my vote goes for the ending. I also loved to see Agnes Moorehead and the lovely cooks.If you liked this movie you'd probably love ,,The parent trap'' with the same actress, or should I say actresses taking the lead. A good film for the whole family."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "A little girl comes to a town that is embattled by feuds and intimidated by her aunt. By the time she must leave, she has transformed the community with her indominatable will to see the good side of even the worst situations and bring it out for the betterment of all.",
         "Even after having lived the hardscrabble life of a missionary's daughter all her life and seen the loss of both parents, young Pollyanna Whittier refuses to be depressed. Instead, she must be glad about anything she can think of, and it's paid off big time. Now, however, she must go to live with her cold, spinsterish aunt in a town inhibited by embittered, unfriendly souls. Can she use her glad game to win over everyone and transform the town?",
         "A young girl comes to an embittered town and confronts its attitude with her determination to see the best in life."
      ],
      "budget": 0
   },
   "movielensId": 1014,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1960-05-19",
      "dvdReleaseDate": "2002-05-07",
      "directors": ["David Swift"],
      "runtime": 134,
      "movieId": 1014,
      "title": "Pollyanna",
      "mpaa": "G",
      "actors": [
         "Hayley Mills",
         "Jane Wyman",
         "Richard Egan",
         "Karl Malden",
         "Nancy Olson",
         "Adolphe Menjou",
         "Donald Crisp",
         "Agnes Moorehead",
         "Kevin Corcoran",
         "Reta Shaw",
         "Mary Grace Canfield",
         "James Drury",
         "Anne Seymour",
         "Edward Platt",
         "Leora Dana",
         "Jenny Egan",
         "Ian Wolfe",
         "Nolan Leary",
         "Edgar Dearing"
      ],
      "imdbMovieId": "0054195",
      "originalTitle": "Pollyanna",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["XVtLP5tfpCA"],
      "plotSummary": "A young girl comes to an embittered town and confronts its attitude with her determination to see the best in life.",
      "tmdbMovieId": 31102,
      "avgRating": 3.37586,
      "releaseYear": "1960",
      "numRatings": 1736,
      "posterPath": "/oWxzmMZHIqtZLXztpPv5kbrcuD9.jpg"
   }
}