{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "journey",
            "id": 189092
         }
      ],
      "imdb_id": "tt0107131",
      "video": false,
      "title": "Homeward Bound: The Incredible Journey",
      "recommendations": [
         25059,
         11359,
         10603,
         10380,
         14819,
         9446,
         24795,
         13225,
         19933,
         9822,
         10414,
         11497,
         11806,
         11164,
         332,
         1634,
         47951,
         8989,
         11076,
         10438
      ],
      "backdrop_path": "/xBodl3B2IvBHQYMjn0WwtrYuxLl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Chance (voice)",
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093d17",
               "name": "Michael J. Fox",
               "profile_path": "/2CwTJuL6UHqPJ82oh8WpWUw8Q0V.jpg",
               "id": 521,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Sassy (voice)",
               "gender": 1,
               "credit_id": "52fe4466c3a36847f8093d1f",
               "name": "Sally Field",
               "profile_path": "/ymhpsxujOO3a9qaGYSpkenCt9Le.jpg",
               "id": 35,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Shadow (voice)",
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093d1b",
               "name": "Don Ameche",
               "profile_path": "/q4t9dds6jQuuqpMLvALbOqVJRFV.jpg",
               "id": 18156,
               "order": 2
            },
            {
               "cast_id": 21,
               "character": "Laura Burnford-Seaver",
               "gender": 1,
               "credit_id": "54fd187f9251412329003625",
               "name": "Kim Greist",
               "profile_path": "/u857tppmsyDcYuzqXyj83G70mq0.jpg",
               "id": 387,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jamie Seaver",
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093cf3",
               "name": "Kevin Chevalia",
               "profile_path": null,
               "id": 51337,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Research Assistant",
               "gender": 1,
               "credit_id": "52fe4466c3a36847f8093cf7",
               "name": "Anne Christianson",
               "profile_path": null,
               "id": 51338,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Vet",
               "gender": 0,
               "credit_id": "52fe4466c3a36847f8093cfb",
               "name": "Ted D'Arms",
               "profile_path": "/gPQpUe86El0A5FXARkCaC2tJfe7.jpg",
               "id": 51339,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Molly's Father",
               "gender": 0,
               "credit_id": "52fe4466c3a36847f8093d23",
               "name": "Don Alder",
               "profile_path": null,
               "id": 120990,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Desk Sergeant",
               "gender": 0,
               "credit_id": "53bd7f6bc3a3684cf4001b7b",
               "name": "Ed Bernard",
               "profile_path": null,
               "id": 1242308,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Peter Burnford",
               "gender": 0,
               "credit_id": "58b237b0c3a368077501434c",
               "name": "Benj Thall",
               "profile_path": null,
               "id": 1765509,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Hope Burnford",
               "gender": 1,
               "credit_id": "58b237e29251415b1d016810",
               "name": "Veronica Lauren",
               "profile_path": "/cS8gnKZaY2vZrCje8U5OnNjwuLo.jpg",
               "id": 76031,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Quentin",
               "gender": 2,
               "credit_id": "58b23821c3a3680732016a40",
               "name": "William Phipps",
               "profile_path": "/hqN5f8MxRYfFLRA3hZfF2HVTHZa.jpg",
               "id": 99754,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Frank",
               "gender": 0,
               "credit_id": "58b2384d9251415b25015e56",
               "name": "Gary Taylor",
               "profile_path": null,
               "id": 1152489,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Kate",
               "gender": 1,
               "credit_id": "58b2386cc3a368074a01507a",
               "name": "Jean Smart",
               "profile_path": "/nhUcqFbrtkQEzgTjLGlGIcOeihG.jpg",
               "id": 5376,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Special Vocal Effects (voice)",
               "gender": 2,
               "credit_id": "58b238d69251415b25015eac",
               "name": "Frank Welker",
               "profile_path": "/b3gImArbw13mMKJIe9leFc9YYb7.jpg",
               "id": 15831,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093cdd",
               "name": "Duwayne Dunham",
               "profile_path": "/bmWGTwrB3O14Fgp2AI5UXIqiB3F.jpg",
               "id": 6592,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4466c3a36847f8093ce3",
               "name": "Sheila Burnford",
               "profile_path": null,
               "id": 51334,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4466c3a36847f8093ce9",
               "name": "Caroline Thompson",
               "profile_path": null,
               "id": 1901,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4466c3a36847f8093cef",
               "name": "Linda Woolverton",
               "profile_path": "/AagHXmW37oiLSCsUYIifAaFfkz.jpg",
               "id": 38792,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093d01",
               "name": "Franklin R. Levy",
               "profile_path": null,
               "id": 51344,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093d07",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093d0d",
               "name": "Reed Smoot",
               "profile_path": null,
               "id": 51345,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093d13",
               "name": "Jonathan P. Shaw",
               "profile_path": null,
               "id": 15806,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4466c3a36847f8093d29",
               "name": "Jeffrey Chernov",
               "profile_path": null,
               "id": 40592,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.795275,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6878,
      "vote_count": 278,
      "budget": 0,
      "overview": "Remake of the popular Disney classic, this time featuring some well known voices as two dogs and a cat trek across America encountering all sorts of adventures in the quest to be reunited with their owners.",
      "similar": [
         13,
         28178,
         281957,
         9598,
         10948,
         82703,
         433808,
         452507,
         19913,
         16859,
         40807,
         858,
         862,
         35,
         5915,
         137106,
         118,
         105864,
         82693,
         449176
      ],
      "original_title": "Homeward Bound: The Incredible Journey",
      "runtime": 84,
      "poster_path": "/yBFfd6AqraqKnP4HPPxTk5oUnjI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Touchwood Pacific Partners 1",
            "id": 8830,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-02-03",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Homeward Bound Collection",
         "id": 43058,
         "poster_path": "/4S9WMNUJFzxKOjcoS1mGrKFfygI.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Duwayne Dunham"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Sheila Burnford",
         "Caroline Thompson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107131/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyNTE4NDU2Nl5BMl5BanBnXkFtZTcwNTgyNjQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael J. Fox, Sally Field, Don Alder | See full cast and crew »"],
      "reviews": [
         "Homeward Bound is a great family film, one of the last best used with talking animals. Still to this day I cannot resist watching this film, and I still laugh, keep my eyes glued to the screen and I cannot help but cry. I always have to have a major box of tissues next to me when I watch this movie. It has such a soul and is a great story with wonderful characters. All of us as children had pets who were like our best friends and they were just as loyal back and Homeward Bound shows us the love that animals could have for their owners. Chance, an American Bulldog, explains that he is the pet of Jamie Burnford, but expresses no interest in his owner or having a \"home\". He shares his home with Shadow, an older Golden Retriever owned by Jamie's brother Peter, and Sassy, a Himalayan cat, owned by their sister Hope. Bob Seaver is marrying Laura Burnford, joining the family. Shortly after the wedding, the family goes on a trip to San Francisco, leaving the pets at a ranch belonging to Kate, a family friend. Kate later goes on a cattle drive, leaving the animals at the ranch to be looked after by one of her ranch hands. However, the animals think they have been abandoned, and Shadow begins to worry about Peter, so he decides to go find them. Sassy and a reluctant Chance follow. They head into the rocky, mountainous wilderness, with Shadow leading by instinct but of course the road is a bumpy one and it's not an easy journey coming back home. I'm going to give a few spoilers here, so don't read on if you haven't seen this movie. There are some absolute great laughs, with Sally Field as Sassy you just couldn't go wrong. Her leading the vet security guard around was so cute and very funny. Plus when Chance is curious about a porcupine, Shadow and Sassy warn him to get away, but being a dog he can't help but wonder and BAM, \"it bit me with it's butt!\", he's stung with the needles, poor Chance, but what a funny scene! Then there are some very touching moments where Chance is learning how wonderful life could be having a home. The scene where Sassy is reunited with Chance and Shadow was wonderful. Then there are the tear jerker moments that are killer. Shadow falls into a muddy pit where he hurts his leg and can't get out, Chance tries to help him but Shadow thinks he's too old and can't move and says to Chance \"I've taught you everything you needed to know, now all you need to learn is how to say good-bye\", I'm actually tearing up as I'm writing it, seriously. Then Shadow makes a triumphant return into Peter's arms and seeing him act like a puppy was so wonderful. I adore this movie, the voices, the setting, the story, it's just a touching family movie that is perfect to watch. I have no complaints about this movie and could go on, but trust me when I say it's more than worth the watch. 10/10",
         "Maybe I'm a sap but this is the sweetest movies ever! I saw it for the first time when I was around 4 or 5, and I cried my eyes out. Between then and now (embarrassed at age 15) I have seen it over 25 times and have sobbed each and every one of them. Don't worry they're tears of happiness! And it's not all sap! There's a lot of humor and comedy in it too. Usually the whole talking animal thing can be a huge drag but in this movie it's not the case. My only word of advice: Even if you love this-Don't see the sequal...cornyness! I suggest everyone checks this out...you won't be sorry, no matter how old or young you are!",
         "HOMEWARD BOUND: THE INCREDIBLE JOURNEY (1993) THE GOOD: --What can I say but I'm a sucker for cute animals, and this movie delivers. I adored the trio of Shadow the old and wise, Chance the loveable goof and Sassy the fussy puss. These animals were too cute for words and terrific actors in their own right, as well as being voiced by the equally terrific Don Ameche, Michael J Fox and Sally Field. --As the animals in the film go cross country, over hills, plains, rivers, forests and more, the cinematography only becomes more breathtaking. I loved the huge scale shots of the giant, beautiful Oregon and California filming locations. --This movie had a lot more dramatic injection than some Disney films coming out nowadays, I really cared for the characters and sympathised with them. I was horrified when Sassy was floating down the river, found it tragic seeing Shadow feel like he couldn't go on and I also felt that the story that took place with the family having lost their pets was realistically dealt with. --Simply put, this film has sentimental value because I loved it so much as a kid, and I think it's bloody remarkable that I still love it as much now. I don't care what anyone says, I'll always treasure \"Homeward Bound: The Incredible Journey\" as one of my personal favourites. THE BAD: --Some scenes with the family were horrifically cheesy. I just hate the part where they run around the school getting everyone in the family to collect the animals, and when they're in the car singing \"Chitti chitti bang bang\". The story with the animals is much more, dare I say it, humane. RATING: 8/10 - A beautiful, moving family motion picture that I loved as a child and still do now. IF YOU LIKED THIS MOVIE I RECOMMEND: Babe (9/10) Cats & Dogs (7/10) Homeward Bound II: Lost in San Francisco (7/10) The Land Before Time (6/10) The Little Mermaid (9/10)",
         "Robert Hays and Kim Griest play normal human beings while Sally Field, Michael J. Fox and Ameche are voices of animals. All of them combined to make a nice family movie here, and a pretty successful one at the box office. There are many funny lines given to Fox to read as the main character, the dog. Field also has a good lines as the cat while Ameche plays it straight as the mature Golden Retriever. The only somewhat-bothersome character is the 13-year-old boy who is impatient and pouty at times, but he gets out that after awhile. The scenery is nice, too, with photographers doing a fine job capturing the beauty of California's Sierra mountain range. All in all, a very nice movie and highly-recommended for one of those 'family nights.'",
         "I was very young when I first watched this movie, and I love it just as much today as I did then. The main idea of \"Homeward Bound: The Incredible Journey\" is three pets, Shadow, a wise old golden retriever, Chance, a goofy, fun-loving American bulldog puppy, and Sassy, a hilarious Himalayan cat who are left in the care of their owners' friend that lives hundreds of miles away on a farm. After several days, the pets begin to worry. Thinking that their owners must be in some kind of trouble, they set out on their adventure home.Along the way they encounter many unexpected surprises but their determination and love for their owners helps them in finding their way. For me, this was an unforgettable story of love, courage and devotion that will inspire everyone who watches it. A must see for animal lovers! I give it a 10!",
         "Two dogs named Chance (voice by Michael J. Fox) and Shadow (voice by Don Ameche) and a cat named Sassy (voice by Sally Field) are left behind when the family that owns them goes on vacation. They are not sure what happened and therefore they have to find the family. An incredible journey is what is next. This is a movie for all ages but especially kids will love this. The animals, the beautiful nature, some nice and funny moments, a good heart and a happy ending, everything what a movie for the whole family needs. Of course the story is simple and some events are quite impossible, but with movies like this you are not suppose to ask too many questions and you must not be too critical.",
         "It's a classic! Everybody knows that! I remember seeing the original Homeward Bound (it was called \"The Incredible Journey\") and it basically was the exact same story this one is, only more bland. I hated that narrator that told us the whole story. With this version, however the story is told by the animals that lived the adventure. That's what makes this story interesting and worthwhile, when you see the characters and the plot from a different point of view. Chance, an American bulldog (Michael J. Fox), Sassy, a Himalayan cat (Sally Field), and Shadow, a golden retriever (Don Ameche) must find their way across the Californian mountains and valleys in search of the family that loves them. No journey is without its conflicts and there are some that each take a toll on the main characters. Another perfect Disney show--it easily scored a 8 out of 10 for me. If you're considering watching the sequel, don't bother. It doesn't have the magic or personality this one does and Shadow sounds nothing like he used to (I think Don Ameche died before they made the second one).",
         "I watch this movie all the time. I've watched it with family ages 3 to 87, and everyone in between; They all loved it. It really shows the true scenes a dog has, and the love and loyalty you get from a pet. Just beautiful. It's great for thoes who love comedy movies, the tear-jerker movies, or even just pets. The music is wonderful, the animals spectacular, the scenes truly thought out, and the characters perfect. What I liked about the characters is the true and nicely mixed personalities: Shadow (The oldest, a Golden Retriever) He's the wise one, filled with the wisdom and mindset of any dog, Chance (the American Bulldog puppy) is basically a puppy with a witty side, the comical character; And Sassy (The Hymilayan cat) She's the real cat who shows what a real cat will do for their owner, the real girly one.",
         "This is a great movie for all ages. Its the story about three animals how have to find their way home. There is a bit of a twist at the end and mainly throughout the whole movie. You never know what is going to happen next. This movie makes you cry and makes you laugh. You just don't know what going to happen next. The trek home is all beautiful with all the wonderful wildlife scenes. They producers also spent a lot of money for this movie and it shows too. The animals in this movie were well trained and are great actors/actress themselves. Everything about this movie is great! 10 out of 10 the whole way! Rent or buy it today I can guarantee you will love it the whole family will!",
         "This movie is definitely on the list of my top 10 favorites. The voices for the animals are wonderful. Sally Field and Michael J. Fox are both brilliant as the sassy feline and the young inexperienced pooch, but the real standout is Don Ameche as the old, faithful golden retriever. This movie is a great family movie because it can be appreciated and loved by children as well as adults. Humorous and suspenseful, and guaranteed to make every animal lover cry! (happy tears!)"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family",
         "Comedy"
      ],
      "productionCompanies": [
         "Touchwood Pacific Partners 1",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "Three pets (Chance, a young dog unfamiliar with the world; Shadow, an aging, wise dog; and Sassy, a snobby cat) are left behind when their family goes on vacation. Unsure of what happened, the animals set out on a quest to find their family. This journey across America is very dangerous and the animals risk never seeing their masters again. The group of pets travel across forested mountains and areas of wide-open countryside, while their family searches for them in the same areas.",
         "The adventure begins when the loving owners of three irresistible pets (Chance, a fun-loving American bulldog pup; Sassy, a hilarious Himalayan cat who lives up to her name; and Shadow, a wise old golden retriever) are forced to leave them in the temporary care of a friend who lives hundreds of miles away. But after several days, the worried animals begin to their family must be in trouble, so they decide to head for home. On their incredible journey across the ruggedly beautiful Sierras, they encounter unexpected surprises from man, beast, and nature alike.",
         "Three pets escape from a California ranch to find their owners in San Francisco."
      ],
      "budget": 0
   },
   "movielensId": 1015,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-02-03",
      "dvdReleaseDate": "2000-12-12",
      "directors": ["Duwayne Dunham"],
      "runtime": 84,
      "movieId": 1015,
      "title": "Homeward Bound: The Incredible Journey",
      "mpaa": "G",
      "actors": [
         "Michael J. Fox",
         "Sally Field",
         "Don Ameche",
         "Kim Greist",
         "Kevin Chevalia",
         "Anne Christianson",
         "Ted D'Arms",
         "Don Alder",
         "Ed Bernard",
         "Benj Thall",
         "Veronica Lauren",
         "William Phipps",
         "Gary Taylor",
         "Jean Smart",
         "Frank Welker"
      ],
      "imdbMovieId": "0107131",
      "originalTitle": "Homeward Bound: The Incredible Journey",
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["U8LO9hRL3fQ"],
      "plotSummary": "Remake of the popular Disney classic, this time featuring some well known voices as two dogs and a cat trek across America encountering all sorts of adventures in the quest to be reunited with their owners.",
      "tmdbMovieId": 6878,
      "avgRating": 3.27546,
      "releaseYear": "1993",
      "numRatings": 4320,
      "posterPath": "/yBFfd6AqraqKnP4HPPxTk5oUnjI.jpg"
   }
}