{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "baseball",
         "id": 1480
      }],
      "imdb_id": "tt0109127",
      "video": false,
      "title": "Angels in the Outfield",
      "recommendations": [
         21845,
         26441,
         20726,
         11164,
         13962,
         9446,
         14819,
         11528,
         10680,
         10414,
         17745,
         16314,
         6878,
         19933,
         8989,
         20737,
         17207,
         10897,
         12475,
         11359
      ],
      "backdrop_path": "/8p7EMtGZStplGISGVFG5pU8Ftv.jpg",
      "revenue": 50236831,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George Knox",
               "gender": 2,
               "credit_id": "52fe44a9c3a368484e02fced",
               "name": "Danny Glover",
               "profile_path": "/jSNTEnm0Sxm8FRtoBfJmhmQyozH.jpg",
               "id": 2047,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maggie Nelson",
               "gender": 1,
               "credit_id": "52fe44a9c3a368484e02fcf1",
               "name": "Brenda Fricker",
               "profile_path": "/z2ARJBvxE1mCwQ6XARTKvvPQySu.jpg",
               "id": 18345,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roger Bomman",
               "gender": 2,
               "credit_id": "52fe44a9c3a368484e02fcf5",
               "name": "Joseph Gordon-Levitt",
               "profile_path": "/zSuXCR6xCKIgo0gWLdp8moMlH3I.jpg",
               "id": 24045,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Al the Boss Angel",
               "gender": 2,
               "credit_id": "52fe44a9c3a368484e02fcf9",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mel Clark",
               "gender": 2,
               "credit_id": "52fe44a9c3a368484e02fcfd",
               "name": "Tony Danza",
               "profile_path": "/zuGqT0ZJQFm0GMUnEa32jYu75Fy.jpg",
               "id": 18298,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Hank Murphy",
               "gender": 2,
               "credit_id": "52fe44a9c3a368484e02fd01",
               "name": "Ben Johnson",
               "profile_path": "/yqPEXD23jLYxmCCLNWtyQ3tJ89V.jpg",
               "id": 8258,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Ranch Wilder",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fd05",
               "name": "Jay O. Sanders",
               "profile_path": "/wgCFAatAtmfN5zWgwzGgA48wwXu.jpg",
               "id": 6067,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ben Williams",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fd09",
               "name": "Matthew McConaughey",
               "profile_path": "/jdRmHrG0TWXGhs4tO6TJNSoL25T.jpg",
               "id": 10297,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "David Montagne",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fd13",
               "name": "Taylor Negron",
               "profile_path": "/l641HJtE8WSjWAJGHAer5Hx89SG.jpg",
               "id": 37043,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Danny Hemmerling",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fd17",
               "name": "Adrien Brody",
               "profile_path": "/zvMslH1C8xmEBpGgDsdzL797Rv.jpg",
               "id": 3490,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mr. Bomman / Roger's Dad",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fd1b",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Wally",
               "gender": 2,
               "credit_id": "55042a40c3a36862e5000d2b",
               "name": "Tim Conlon",
               "profile_path": "/sOwMfG9kn1rQamSiiIY5R5sMpxI.jpg",
               "id": 1212249,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "J.P.",
               "gender": 2,
               "credit_id": "5665c1f392514179e500033b",
               "name": "Milton Davis Jr.",
               "profile_path": "/brDXLEUi9TYAR8ftbJBTyG4GJVl.jpg",
               "id": 1546030,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Triscuitt Messmer",
               "gender": 2,
               "credit_id": "5665c3fbc3a36806b400040b",
               "name": "Tony Longo",
               "profile_path": "/1kRcEeiz6cFAX41xz9ttCDE2MfG.jpg",
               "id": 13644,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Whitt Bass",
               "gender": 2,
               "credit_id": "5665c4b492514179df00041e",
               "name": "Neal McDonough",
               "profile_path": "/8Vg7WKE4QEGz18at8mQHP9aqEbB.jpg",
               "id": 2203,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Ray Mitchell",
               "gender": 2,
               "credit_id": "5665c518c3a36806ae000407",
               "name": "Stoney Jackson",
               "profile_path": "/oPVcNOZcFeyjCKLw6hipocigMtz.jpg",
               "id": 102690,
               "order": 15
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe44aac3a368484e02fd0f",
            "name": "William Dear",
            "profile_path": "/zd7BF2zZTarjru9K4Rwgw6CMFZW.jpg",
            "id": 56506,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.509324,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24795,
      "vote_count": 154,
      "budget": 0,
      "overview": "Roger is a foster child whose irresponsible father promises to get his act together when Roger's favourite baseball team, the California Angels, wins the pennant. The problem is that the Angels are in last place, so Roger prays for help to turn the team around. Sure enough, his prayers are answered in the form of angel Al.",
      "similar": [
         287,
         11287,
         2323,
         9614,
         9655,
         9472,
         12163,
         10637,
         15070,
         1578,
         1374,
         45317,
         42888,
         22881,
         8456,
         8923,
         9390,
         9291,
         5925,
         489
      ],
      "original_title": "Angels in the Outfield",
      "runtime": 102,
      "poster_path": "/zdbzzEoWMYztvfGjm4kyKntwhEq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-07-15",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Angels in the ...",
         "id": 508334,
         "poster_path": null
      },
      "tagline": "Ya Gotta Believe!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["William Dear"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Dorothy Kingsley",
         "George Wells"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109127/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzOTQ5MDM0N15BMl5BanBnXkFtZTcwMDk3NjAwMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny Glover, Brenda Fricker, Tony Danza | See full cast and crew »"],
      "reviews": [
         "I really do not understand the negative reviews on this film and I never will. People who question the plot are in some serious need of a check up because this was such a wonderful movie. I used to watch it all the time with my grandfather, I grew up in a baseball oriented family and my grandfather and I just adored this movie. I avoided the film for a few years though after he passed away because it would bring up sad memories, but wanting to think of him I bought the movie and I still love it. I love everything this film has to offer. It makes me feel good, it's funny, it's charming, has wonderful characters and makes you believe that anything could happen. Young foster children Roger and his friend J.P. love to sneak into baseball games of the hopelessly dreadful California Angels. Still in limited contact with his widower father, Roger asks when they will be a family again. His father replies , \"I'd say when the Angels win the pennant.\" Taking his father's words literally, Roger prays for God to help the Angels win. After he prays, a star, unseen by Roger, twinkles in the sky. His wish comes true as real angels help the Angels win and the down on his luck coach George Knox uses him thinking he's a good luck charm. But then he discovers that there may be a little something more to Roger, then opening up his heart to something bigger. He becomes a better coach, the team becomes better naturally and Roger starts to believe not only in angels but love as well. Joseph Gordon-Levitt as Roger was so wonderful, he had such heart and put passion into the role. Most child actors are very annoying and play up to the cute factor too much, but if you're telling me that you did not tear up when his father just abandons him in court and he breaks down in Maggie's arm you need to have your heart checked to see if it's beating. His chemistry with Christopher Lloyd was wonderful and they really played off each other well. Danny Glover, how could you not love his character? George Knox is a has-been who has lost any faith that anything could happen, the boys that entered his life just changed it forever. I love everything about this movie, I don't know how anyone couldn't. It's a wonderful movie and if given the fair chance it deserves, the rating should be much higher. After all the angels are always watching. 9/10",
         "Angels in the Outfield contains absolutely no unpredictable elements. The premise involves a young boy named Roger whose deadbeat father has all but abandoned him, saying that their being a family again is as unlikely as the last-place Angels winning the pennant. This prompts Roger to pray for the team and for a family. Suddenly, real angels jump in to help the inept team, and the coach of the Angels insists on Roger and his friend JP attending every home game. I have now told you everything you need to know to figure out every plot turn in the movie. Yes, it is THAT predictable. Combine that with some unbearably goofy comedy, and you have what would appear to be a complete waste of 90 minutes. But appearances aren't everything, and Angels ends up being more than the sum of its parts. While every part of the movie stays true to formula, the acting and directing never descend into mediocrity, and this infuses the film a with a sincere heart, a sense of joy that allows us to care for the characters even though we know exactly what's going to happen to them. To be sure, there are many better films out there, and adults would almost certainly want to spend their time watching one with a bit more maturity. But for those looking for a movie they can enjoy along with their children, they will find Angels worth their time.",
         "As a baseball die-hard, this movie goes contrary to what I expect in a sports movie: authentic-looking sports action, believable characters, and an original story line. While \"Angels in the Outfield\" fails miserably in the first category, it succeeds beautifully in the latter two. \"Angels\" weaves the story of Roger and J.P., two Anaheim foster kids in love with baseball but searching for a family, with that of the woebegone Angels franchise, struggling to draw fans and win games. Pushed by his deadbeat father's promise that they would be a family only when the Angels win the pennant, Roger asks for some heavenly help, and gets it in the form of diamond-dwelling spirits bent on reversing the franchise's downward spiral. And, when short-fused manager George Knox (portrayed by Danny Glover) begins believing in what Roger sees, the team suddenly has hope for turning their season around--and Roger and J.P. find something to believe in. Glover in particular gives a nice performance, and Tony Danza, playing a washed-up pitcher, also does well, despite clearly having ZERO idea of how to pitch out of the windup!",
         "I enjoy movies like this for their spirit, no pun intended. Its a decent, clean movie about a baseball team that's falling behind, and a young fan wishes for them to win, since his deadbeat dad said that was the only way he'd come back for him. The spirit shines through in two ways: A funny cast with Danny Glover and a young Joseph Gordon-Levitt, and the heavenly herald Al, taking the dynamic form of Christopher Lloyd. Its an energetic movie. It gets you smiling, and really involves you in the sport. Therein lies my gripe. the one thing that kinda bugs me is these sports movies that kind of turn you into an unexpecting fan for the team. There's absolutely nothing wrong with that. I just find it odd that I should come away from the movie thinking the Angels are a strong, cool team, when really my base loyalty, such as it is, lies with the Toronto Blue Jays. It's interesting, really. If it's just a movie about an underdog kids team, then its okay.",
         "That was definitely the case with Angels in the Outfield. It was on TV last night and I believe I hadn't seen the film since my sophomore year in high school and I'm now in my 4th year of college. Although the film has many flaws, it is just so touching that you can't help but sit down, watch it, and enjoy yourself. It is also hilarious. Danny Glover's ranting is just so over the top that you can't help but laugh out loud at him at most time. It adds to the film and I'm sure it's exactly what the director wanted. You actually feel for the characters in the film even though the development isn't the best. A must see. I highly recommend. 8/10",
         "I have always like this great baseball movie! It has a good cast including two tremendous actors and two of My favorites Danny Glover and Christopher Lloyd! Also in this movie is Ben Johnson, Brenda Fricker, Big Tony Longo, Tony Danza, and Matthew McConaughey! Also Jay O. Sanders and Dermot Mulroney! The film has great special effects and acting from all of the film's actors! The baseball scenes are all realistic! The music by composer Randy Edelman is very good and it fits the film very well! Some of the actors who reminded Me the actual baseball personalities. Stoney Jackson's Ray Mitchell character reminded Me Royce Clayton, McConaughey's character reminded Me of Steve Finley, and Jay O. Sanders's commentator in My opinion resembled how Al Hrabosky looks today. This is a fantastic movie for non and Baseball fans and I strongly recommend this film!",
         "I really enjoyed this movie as a young kid. At that age I thought that the silly baseball antics were funny and that the movie was \"cool\" because of it's about sports. Now, several years later, I can look back and see what a well designed movie this was. This movie opened my eyes as a small child to the struggles other children dealt with and real world issues. That kind of exposure is largely lacking in kids movies these days which I don't think is to our society's benefit. Sure the baseball antics seem really dumb now, but they drew kids in. No seven year old is going to ask to see a movie about foster children, but they will ask to see a movie about baseball. Disney realized this fact and took advantage of it to teach these children an important lesson about the world. As a young adult the performance of Al and the other angels seems far less impressive, however I will give credit to the actors playing both children and Danny Glover who all did a fantastic job.",
         "Although I don't usually go for relentlessly heartwarming fare like this, I happened to catch the 1994 version of ANGELS IN THE OUTFIELD (AitO) on cable one Saturday morning just as it was starting. Being an Adrien Brody fan, I was curious to see what Brody was like as a youth of 21 (20 when he filmed it, I suppose) in this early role as Danny Hemmerling, utility infielder for the California Angels (in the 1951 original, the hard-luck baseball team was the Pittsburgh Pirates. The name change is a nice touch, since it turns the title into wordplay). I decided to give the flick a chance, and it turned out to be a pretty painless, even amiable experience, with a decent balance of laughs, tears, sweetness, and baseball-based excitement. Also, my 7-year-old daughter liked the angel effects! :-) Directed by Mike Nesmith's frequent collaborator William Dear, AitO is the story of Roger (Joseph Gordon-Levitt), a foster child who prays real hard after his ne'er-do-well dad (the convincingly sleazy Dermot Mulroney) sarcastically says they'll be a family again once the last-place California Angels win the pennant. Soon Roger starts seeing real angels at the Angels' games, led by Christopher Lloyd, whose usual zany, eccentric irreverence keeps AitO from plummeting irretrievably into The Schmaltz Zone. Crusty manager George Knox (Danny Glover in world-weary, exasperated mode) is a hard sell, but once the team starts winning, he believes Roger's angel sightings, and soon Knox has Roger and his cute li'l pal and fellow foster kid J.P. (the adorable Milton Davis Jr.) at every Angels game for good luck. Knox even starts toning down his own temperamental outbursts and profane language, as much to appease the angels as for the kids' sake, resulting in a funny bit when he starts dressing down an umpire in his usual way but starts editing himself as he goes along. Predictable obstacles ensue, such as obnoxious sportcaster Ranch Wilder (Jay O. Sanders) trying to make trouble for Knox because of the angel angle. Sure, it all works out fine for our heroes in the end, but they're so darn amiable you don't mind! :-) Baby-faced Brody has a couple of good lines (I especially like his exchange with Glover about the emotional impact of the National Anthem at a ballgame) as well as a cute bit where a pretty blonde angel massages his shoulders before he goes up to bat. Brody isn't the only future star in AitO's lineup: his teammates include Matthew McConaughey and Neal McDonough, and of course, young Gordon-Levitt went on to co-star in TV's 3rd ROCK FROM THE SUN as well as such films as 10 THINGS I HATE ABOUT YOU. The always-amusing Taylor Negron and Oscar winners (but not for this film :-) Brenda Fricker and Ben Johnson lend able support. If you're a baseball fan who wants to rent a movie appropriate for the kids and check out some notable young actors before they became stars, AitO '94 will do nicely.",
         "I saw this film on TV many years ago and I saw this film when I got this on tape. I thought that this was reasonably well done. It was not the best of all movies, but it was good enough. The movie has enough talent to inspire many people, especially younger kids. The acting was good, with Danny Glover leading the cast. The plot line was not very believable, but the script was well written. This movie can also be the interest of avid baseball fans. It does not directly apply to a action-packed sports movie. It directly applies to a nice film that you can watch with your family and learn some messages that are hidden in this film. Overall, the film was good, but not great. I give this a movie a 7/10.",
         "At first you think another Disney movie, it might be good, but it's a kids movie. But when you watch it, you can't help but enjoy it. All ages will love this movie. I first saw this movie when I was 10 and now 8 years later I still love it! Danny Glover is superb and could not play the part any better. Christopher Lloyd is hilarious and is perfect for the part. Tony Danza is so believable as Mel Clark. You can't help, but to enjoy this movie! I give it a 10/10!"
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy",
         "Sport"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "Roger who has lost his mother is living separated from his father. As he and his friend J.P. are one of the biggest fans of the Los Angeles baseball team he has got only two dreams: Living together with a real family and let LA win the championship. As he is praying for these two things to happen some angels show up in order to help him - but he is the only one to see them and believe in them. Fortunately the coach of the baseball team sees his abilities and so LA has a run to the finals...",
         "Roger Bomman lives in a foster home along with his best friend J.P., but when Roger's dad comes to visit him, a little bit of hope grows back into Roger's heart about him going to live with his dad. But his hopes suddenly die down when his dad says that they can be a family again when Roger's favorite baseball team, the California Angels, win the pennant, but the team is in last place in their division. So Roger prays to heaven and ask if the angels up there can help the Angels (baseball team) win the pennant so Roger can have the family that he always wanted, and because of his prayer, he just might.",
         "The California Angels are currently the worst team in their division. It seems that the players have a little trouble with their teamwork. Manager George Knox would like nothing better than to dump all of them, which the owner says is impossible. Roger is a boy whose mother died and is currently living in a foster home. His father feels that it would probably be in Roger's best interest if he becomes a ward of the state. But Roger would rather that he and his father get back together, and when he asks his father if that is possible; his father's reply is \"when the Angels win the pennant\". Roger then prays and asks if they could help the team. When Roger goes to a game, he sees some Angels come down from the sky and they help the players make some astounding catches and hits. When Roger tells Mr. Knox about it, Mr. Knox decides to keep him at every game, and it seems that Mr. Knox's faith is put to the test cause it seems that the angel are going to help if uses his worst players, but it seems to be working.",
         "When a boy prays for a chance to have a family if the California Angels win the pennant, angels are assigned to make that possible."
      ],
      "budget": 24000000
   },
   "movielensId": 1021,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Italiano",
         "Español"
      ],
      "releaseDate": "1994-07-15",
      "dvdReleaseDate": "2002-04-23",
      "directors": ["William Dear"],
      "runtime": 102,
      "movieId": 1021,
      "title": "Angels in the Outfield",
      "mpaa": "PG",
      "actors": [
         "Danny Glover",
         "Brenda Fricker",
         "Joseph Gordon-Levitt",
         "Christopher Lloyd",
         "Tony Danza",
         "Ben Johnson",
         "Jay O. Sanders",
         "Matthew McConaughey",
         "Taylor Negron",
         "Adrien Brody",
         "Dermot Mulroney",
         "Tim Conlon",
         "Milton Davis Jr.",
         "Tony Longo",
         "Neal McDonough",
         "Stoney Jackson"
      ],
      "imdbMovieId": "0109127",
      "originalTitle": "Angels in the Outfield",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "ajBCBBR8RWg",
         "OY3RVurntpo"
      ],
      "plotSummary": "Roger is a foster child whose irresponsible father promises to get his act together when Roger's favourite baseball team, the California Angels, wins the pennant. The problem is that the Angels are in last place, so Roger prays for help to turn the team around. Sure enough, his prayers are answered in the form of angel Al.",
      "tmdbMovieId": 24795,
      "avgRating": 2.84592,
      "releaseYear": "1994",
      "numRatings": 4157,
      "posterPath": "/zdbzzEoWMYztvfGjm4kyKntwhEq.jpg"
   }
}