{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "könig arthur",
            "id": 3971
         },
         {
            "name": "merlin",
            "id": 8504
         },
         {
            "name": "knight",
            "id": 10466
         },
         {
            "name": "king arthur",
            "id": 10982
         }
      ],
      "imdb_id": "tt0057546",
      "video": false,
      "title": "The Sword in the Stone",
      "recommendations": [
         11886,
         11319,
         10112,
         11360,
         10895,
         10948,
         10693,
         10340,
         10882,
         12230,
         3170,
         12092,
         9325,
         10545,
         408,
         11224,
         756,
         9994,
         10144,
         12233
      ],
      "backdrop_path": "/nFM5i0ur7XstB9WvvkPX6QGPq86.jpg",
      "revenue": 22182353,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Narrator/Sir Ector (voice)",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adaed",
               "name": "Sebastian Cabot",
               "profile_path": "/x4xosGUCYnuUQntxgbcZryWaKH6.jpg",
               "id": 21877,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Merlin (voice)",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adaf1",
               "name": "Karl Swenson",
               "profile_path": "/yyeaz3ruAZbyPWame4CZW49GSHe.jpg",
               "id": 12158,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Archimedes the Owl (voice)",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adaf5",
               "name": "Junius Matthews",
               "profile_path": null,
               "id": 57313,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kay (voice)",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adaf9",
               "name": "Norman Alden",
               "profile_path": "/vdzvCDT4UtVctmo17OSpU8HVUxe.jpg",
               "id": 7139,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Wart (voice)",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adb15",
               "name": "Rickie Sorensen",
               "profile_path": "/niR4p3VkHvE07CP29YN4nBraY00.jpg",
               "id": 159552,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Little Girl Squirrel (voice)",
               "gender": 1,
               "credit_id": "52fe44d9c3a36847f80adb19",
               "name": "Ginny Tyler",
               "profile_path": "/yo0uqIwLh4mrFgjI0dYMYDr3DVh.jpg",
               "id": 955923,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Madam Mim / Old Lady Squirrel",
               "gender": 1,
               "credit_id": "52fe44d9c3a36847f80adb1d",
               "name": "Martha Wentworth",
               "profile_path": "/jyWAHneC2QdoC1Wpnvwf05wCMZs.jpg",
               "id": 71780,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Sir Pellinore (voice)",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adb21",
               "name": "Alan Napier",
               "profile_path": "/mmOemlQeMp0ViF4cy8QL1bArm4y.jpg",
               "id": 6933,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Wart (voice)",
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80adb25",
               "name": "Richard Reitherman",
               "profile_path": "/l8b4y7zmuFeMuWeaVTpq2Sqdwvy.jpg",
               "id": 1287645,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Wart (voice)",
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80adb29",
               "name": "Robert Reitherman",
               "profile_path": "/hsAuBmxp4c1F99R9M2r41IYsmO2.jpg",
               "id": 1287646,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adaff",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adb05",
               "name": "Wolfgang Reitherman",
               "profile_path": "/p9ywBLS3Pvv3BcocjLsPwnll6mc.jpg",
               "id": 57314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80adb0b",
               "name": "T.H. White",
               "profile_path": null,
               "id": 57315,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80adb11",
               "name": "Bill Peed",
               "profile_path": "/pLcJMWe2rCVLcMJRn4Y7fVcCup0.jpg",
               "id": 57316,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59d3ef0a9251414b70004e5f",
               "name": "Donald Halliday",
               "profile_path": null,
               "id": 64869,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "565a07d592514161ae000a9e",
               "name": "Eric Larson",
               "profile_path": "/gVmjOBQ1Gf6xrL6xgPCyHgKa8f1.jpg",
               "id": 22066,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a192c92514161b4000d13",
               "name": "Milt Kahl",
               "profile_path": "/olKWgwkVShdJnRJRZ4Po6uK0iq6.jpg",
               "id": 138170,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a1c8092514161ae000d8d",
               "name": "Frank Thomas",
               "profile_path": "/gfxSwlnGBikBjneXC3lWnENAQgo.jpg",
               "id": 63646,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "565a247692514161c1000ef1",
               "name": "Ollie Johnston",
               "profile_path": "/76RFwErmaMm7tx8OHFU0eYCvMMr.jpg",
               "id": 143786,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a2a8c92514161ae000f3d",
               "name": "John Lounsbery",
               "profile_path": "/5iwFX8llmSfEudddEXO8BGczdTs.jpg",
               "id": 69003,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "59c54696c3a368140302fd2d",
               "name": "Don Bluth",
               "profile_path": "/sek7iLDM6J8Poc2FueAkgCUytfn.jpg",
               "id": 40345,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "59d3ef72c3a3684528004e09",
               "name": "George Bruns",
               "profile_path": "/qH2a2m2LoLDCjpPj1h6sISFHDr0.jpg",
               "id": 57337,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "59d3f0349251414ba500523c",
               "name": "Robert O. Cook",
               "profile_path": null,
               "id": 2117,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 11.837931,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9078,
      "vote_count": 1256,
      "budget": 3000000,
      "overview": "Wart is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for him beyond mere squiredom. He starts by trying to give him an education, believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
      "similar": [
         6520,
         762,
         20662,
         11527,
         10473,
         192,
         9477,
         766,
         10353,
         23047,
         10882,
         27022,
         1495,
         274857,
         9476,
         335988,
         8840,
         11469,
         300803,
         41215
      ],
      "original_title": "The Sword in the Stone",
      "runtime": 79,
      "poster_path": "/wZyRYmYrAWNiFhXohp4Ly8svpJH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1963-12-25",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Tired of living in a Medieval mess...Merlin uses all his magic powers to change a scrawny little boy into a legendary hero!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wolfgang Reitherman"],
      "runtime": 79,
      "synopsis": "In olden times, England is in turmoil. With the death of the King, noone can decide who is the rightful heir to the throne. With war threatening to tear the country asunder, a stone and anvil appear from the heavens in London town, with a sword planted firmly in the anvil. On the hilt of the sword, read the words, \"Whoso pulleth out this sword of this stone and anvil is rightwise king, born of England.\" Many try to pull the sword, but none can budge it. In time, the sword is forgotten, and the Dark Ages plunge the countryside into a dismal state. Out in the woods one day, Sir Kaye is out hunting with his adopted brother Arthur, whom everyone names 'Wart.' After causing Kaye to miss shooting a deer, Arthur promises to retrieve the arrow. Arthur's journey leads him to a small hut, wherein resides a sorcerer named Merlin, and his pet owl, Archimedes, who can talk. Merlin explains to Arthur that he was expecting him to appear. After they have tea, Merlin decides to accompany Arthur back to his home, and after packing up everything in the hut into a small satchel, the two set off. Arthur and Merlin arrive at the castle of Sir Ector, where Arthur is immediately put to work in the kitchen. Merlin introduces himself to Ector, and displays his powers to the doubting Knight. After some persuasion, Ector allows Merlin to stay, putting him up in the Northwest Tower, a crumbling edifice of the castle. A few days later, Archimedes observes the arrival of Sir Pelinore, who has brought news from London of a jousting tournament to Ector and Kaye. According to the rules, the winner of the tournament will become the new King of England. Ector eagerly begins to have Kaye train, and in his excitement, promises Arthur that if he keeps working hard at his duties, he can become Kaye's squire. Merlin hears of this news, and decides to push Arthur to see his true potential (as Merlin can move into the past and the future, he knows who Arthur will become). While walking outside along the castle's moat, Merlin explains that he can turn into a fish. This idea excites Arthur, and Merline turns them both into fish, to explore the moat. However, a much larger fish soon gives chase to young Arthur, until they both manage to escape. Arthur's tardiness in helping Kaye practice results in him washing dishes. Merlin finds him, and after bewitching the dishes and washing utensils, leads Arthur into the forest, where they both are turned into squirrels by the sorcerer. As Arthur leaps among the trees, he comes across a girl squirrel, who is soon madly infatuated with him. Merlin finds the whole scenario cute, until he is soon found irresistible by another squirrel. Merlin then changes himself and Arthur back to normal. The girl squirrel who was infatuated with Arthur, skitters away, heartbroken. Arthur and Merlin return to the castle, where Ector lectures Merlin for making Arthur shirk his duties. Arthur tries to defend Merlin, but his 'mouthing off' ends causes Ector to declare that Arthur will not become Kaye's squire, and that that honor will belong to another person of the castle, who is named Hobbes. Arthur is dejected at what has happened, but Merlin tries to get him to persevere, and plans to educate Arthur. As he attempts to explain things, Archimedes interjects on Merlin's teaching methods, as Merlin is educating Arthur on things that will not be proven for hundreds of years, and could very well lead people to think of Arthur as a raving lunatic in their current Dark Ages. Exasperated at this lecturing, Merlin turns teaching duties over to Archimedes, while he fiddles with a model plane. Archimedes scoffs at the toy plane, while Merlin attempts to prove that 'man will fly.' His efforts lead to the plane plummeting like a rock to the moat below. Even though the plane's flight was a failure, Arthur tells of how he's often dreamed of soaring like a bird. It is then that Merlin uses his magic to fulfill this wish. Archimedes then takes it upon himself to teach Arthur to fly, but is soon impressed by how quickly he has picked up the technique. Their lessons are then interrupted when a hawk appears, chasing Arthur into the nearby woods. Arthur soon finds himself in the thatched hut of a witch named Madam Mim, who playfully shows Arthur her magic powers, which are moreso for evil purposes. As Arthur explains more about Merlin and his magic, Mim decides to 'destroy' the little bird. However, before she can do this, Merlin appears, and Mim proposes a Wizard's Duel. Merlin accepts, and the two head off into the woods, where they then shapeshift into a number of creatures, all in an attempt to destroy the other. It appears that Mim has won, until Merlin turns himself into a germ, causing the witch to become gravely ill. With Mim now safely 'detained,' Merlin, Arthur and Archimedes head back to the castle. Back at the castle a few days later, as Kaye and Ector prepare to head off to London for the tournament, they are informed that Kaye's squire, Hobbes, has come down with a terrible cold. Needing a replacement quickly, Ector recruits Arthur. Arthur then joyfully goes to tell Merlin the news. Archimedes commends the boy, but Merlin is incensed that after all he's done to try and teach Arthur, he has chosen such a demeaning thing as being a squire to Kaye. Arthur tries to reason with Merlin, but the sorcerer grows so upset, that he rockets out of the room, yelling 'Blow me to Bermuda!' Archimedes explains that he's gone to an undiscovered island somewhere, but doesn't know if the sorcerer will return. In London, the tournament is under way, and Kaye is soon up for battle. However, Arthur realizes that he left Kaye's sword back at the inn they are staying at. Kaye furiously yells for Arthur to retrieve it immediately! When Arthur gets there, he is saddened to find the inn locked. As Archimedes looks around, he sees the sword in the stone. With little effort, Arthur draws the sword from it's resting place, and rushes back to the tournament. Kaye is at first angered that the sword isn't his, until Sir Ector notices the inscription, and word spreads that someone has pulled the Sword from the Stone. When Ector asks Arthur how he got it, he refuses to believe the boy could have pulled the sword out himself. Arthur, Ector, Kaye and a crowd return to the stone and anvil, where Ector re-inserts the sword, wanting Arthur to do it again. Kaye brushes the boy aside, feeling that since it's already been pulled, anyone can do it. However, the sword has again become immovable. This causes a stampede of others trying to pull it out, before several people demand that Arthur try again. The rabble dies down, and Arthur tries again...and succeeds where the others have failed. As the legend decrees, Arthur is made King of England. However, he is unsure just what to do, and cries out for Merlin's help. Merlin then returns, back from Bermuda, and the 20th Century. When Arthur explains what happened, Merlin grows happy that it seems that Arthur has fulfilled his destiny, and now plans to help the 'once and future king.'",
      "writers": [
         "Bill Peet",
         "T.H. White"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057546/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxMTE5NjkwN15BMl5BanBnXkFtZTYwODMwNzQ5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Rickie Sorensen, Sebastian Cabot, Karl Swenson | See full cast and crew »"],
      "reviews": [
         "This movie is another proof of the high quality of the classic Disney films. Today feature films are quite funny too... but they based mostly on simple, crude jokes and spoofing of other topical movies (remember the bullet time-spoof in \"Shrek\"). There is no substance to think about in it. You can see them, laughing about them...and forgot them almost completely a few years later. Who will remember, i.e., \"Ice Age\" or \"Madagascar\" in 40, 50 or 60 years? The old Disney classics are different, there are timeless! \"The Sword in the Stone\" contains a lot of joyful gags too, but no gag stands above the characters, no joke was made only to fill a hole in the plot. The story, the plot, and the characters are primary. And Disney add not only joyful gags. As Walt himself once said: \"For every laugh, there should be a tear.\" Disney take children always quite seriously, and a lot of his early films contains a lesson for life, sometimes the lesson can be very sad and cruel, like in \"Bambi\", sometimes lesser sad, like in \"The Sword in the Stone\"... but can anybody forget the cute little girl squirrel, that was left by Wart, desperately crying and with a broken heart? And Merlin's closing words about love: \"Well, yes, in its own way... yes, I'd say it's the most powerful force on Earth\"! This is one of the main ingredient of the famous Disney Magic: Joy and tragedy! Another is the art of hand drawn animation. The quality of the animation went downwards at Disney after WW-II too, slowly, but surely. But in 1963 cel-animation was still on a high level. Not so good as in the golden Era, when \"Fantasia\", \"Pinocchio\" or especially \"Bambi\" set the utmost high standards of perfectionism, but quite better than in \"Hercules\", \"The Lion King\" or \"The Rescuers down under\". 7 of 10 stars for \"The Sword in the Stone\"! It is not the best of all Disney films, but quite better and deeper than the most of the modern CGI movies!",
         "The 90 minute cartoon is in fact the first chapter of T.H. White's novel The Once and Future King. Made for the kids, Disney does it again taking a classic story and adding fictional animal characters that can talk. Still, Disney remains loyal to the story by keeping many of the characters in the story including Kay, Sr. Pellinoire, and Sir Ector. Worth watching twice with the family. An animated classic",
         "The 18th animated Disney classic is among the most hilarious of all time. It was never very popular, which is too bad, because it deserves to be more known. However, like other forgotten Disney classics, it has been winning a legion of fans with time. \"The Sword in the Stone\" is almost at the same level of the 1960's and 1970's Disney classics when it comes to artwork. It was one of the last movies with the participation of Walt Disney himself. \"The Sword in the Stone\" is Disney's version of the famous King Arthur's story. Disney tells this story with its personal touch and classic humor. I don't know if the Disney version is totally faithful to the real story, but that's not the point. Arthur, called \"Wart\" by Sir Ector (his adoptive father) and Kay (Sir Ector's son), is overworked and humiliated by them both. \"Wart\" is almost like a \"Cinderella boy\". But despite these problems, he remains optimistic and still dreams about being a great warrior and a knight's squire. Somehow \"Wart\" was the inspiration for the character Taran from \"The Black Cauldron\". In the meantime, he meets the powerful but clumsy and hilarious wizard Merlin, who wants to give him education and culture. Merlin believes that pure strength means nothing when a person has no brain. Together, Merlin and \"Wart\" live great adventures, funny moments and Merlin teaches everything he knows to \"Wart\". We mustn't forget the owl Archimedes too. The owl, as you know, is usually «the fountain of knowledge» on cartoons. Archimedes is wise, intelligent, clever but also very lazy, very confident, grumpy and has a strong personality. That's what makes him so funny. In fact, both Merlin and Archimedes are a comic relief. This film might take place in medieval times (which year is unknown). But it is one the funniest Disney classics ever, like \"Pinocchio\", \"Aladdin\", \"Robin Hood\" and \"The Aristocats\". It has lots of hilarious moments which can make one get into uncontrollable laughter. Let me mention some of them: the scenes with Merlin and the Granny Squirrel; the scene when the dishes wash themselves and Sir Ector and Kay get a \"bath\"; the scene when Kay brutally crashes with the castle's oldest tower; the part when the plane model gets stuck on Merlin's beird and Archimedes laughs so hysterically that he almost can't breathe; that part when Archimedes nearly shrinks inside his little house; the moments with the sugarpot... I could go on, but it would take forever because there are so many hilarious moments. The songs are clever and enjoyable, such as \"The Sword in the Stone\", \"That's what makes the world go round\" and especially \"Higitus Figitus\", my personal favorite. I like this movie and I've gotta say that humor is, without a doubt, the strongest attribute of this movie. This should definitely be on Top 250.",
         "I'm really not much of a Disney fan, and a lot of their films I find are sentimental rubbish, to put it bluntly. This, however, is different. I remember watching this when I was little and finding it hilarious. I hadn't watched it for years until recently when my younger siblings borrowed some videos from a friend. I still find it funny. The animation's nothing amazing, it's done more or less in the style of 101 Dalmations, and the storyline is basic King Arthur stuff (but I do like King Arthur stories anyway). It's the humour that really makes it memorable and charming. The characters have personality, there are no bimbo princesses or princes, and I find myself warming greatly to Merlin and Arthur and even grumpy Archimedes. Well worth watching.",
         "I used to watch the Sword in the Stone quite a number of times as a kid, and I know why later on in my years. It's actually quite a fun little movie considering its a quasi-history lesson on how Arthur (aka 'Wart') became King of England. It includes Merlin, and his 'educated Owl' Archamedes, and a whole lot of wacky adventures trying to get Arthur, who can't read or write, into a mode of thought higher than how he's been raised. For a Disney film, as well, it's also quite the quotable film at times, with some lines and situations still sticking out in my mind years later. For example, the sequence involving Arthur and Merlin as squirrels in the trees, and a small lesson in love (or lack thereof) a lady squirrel presents in the face of danger. Or the story involving Arthur as a bird, trapped in the clutches of Madamn Mim (maybe one of the funniest sequences in any Disney movie). So, as one can figure from what I've described (if you haven't seen the film yet), it's fairly over-the-top, loaded with silly-songs (one of which a true charmer involving Merlin's proclivity for organizing a packing up of his house) and little lessons for kids. But it actually is also funny for adults too, I'd guess, or at least funny to watch along with the kids. It may not be in the absolute peek of the period in Disney films (one may try to look to the Jungle Book or Winnie the Pooh for that, or the underrated Aristocats), however I sometimes come back to this film in my mind. It has a catchy attitude that made being in the 'dark ages' as fun as possible- Archamedes in particular is maybe one of the great side-characters in any Disney film. Alakazam!",
         "This very nice Disney Classic was based on the children's novel by TH White. This was not yet that very well-known, heavy novel titled \"the Once and Future King\" that so many later movies were based upon, but the lighthearted earlier version. Many agreed that the later novel has disfigured the first, so that we may be thankful for the Disney version! Though it does not quite follow the book (this is hardly possible, at times) it is a very good version as animated movies go. Not tedious, though of an age where children were meant to learn something from a movie... A collectors item!",
         "This is one of my all time favorite Disney films. The lyrics of the songs are clever and memorable. Who can forget \"Hockety Pockety Wockey Wack?\" The characters are also very entertaining. The idea of Merlin as a clutz is unique to this version of the story. Archimedes also offers several laughs. Though there isn't much of a plot, the development of character makes this film very entertaining. My four year old sister loved the film. She has already watched it at least a dozen times, and I only checked it out from the library three days ago. Modern Disney bores her. I've found that young children can't sit through \"Beauty and the Beast\" or \"Mulan.\" This older style of Disney catches attention and entertains.",
         "''The Sword in the Stone'''is one of the classics from Disney that I watched when I was a kid and probably the first movie I saw about the Arthur's and Merlin's stories. Wart is a young boy who wants to be a knight's squire. During a hunting trip,Wart meets Merlin, a great and powerful wizard who sees in the boy the chance to give a great education. Wart learns many of the truths of life with Merlin when he become different types of animals. The problem is when Wart makes contact with the evil witch Madam Mim, who will fight against Merlin in a witch/sorceress battle. Ps:I think it is pretty obvious to say that Wart will pulls the famous sword in the stone out of it, and will become the future King of England, thanks to his good,loyal and brave heart.",
         "This isn't usually counted as being one of the top-ranking Disney films, but I insist on not being snobbish in this list, and remembering the films that brought me joy as a kid. Wart gets to be a squirrel, a bird and a fish during this film which plays fast and loose with Arthurian legend. Merlin is great, and his battle with Madam Mim the stuff of legend. It's not big, it's not clever, but it is fun!",
         "The Sword and the Stone is a very relaxing movie to watch. In an animation, you want humour and emotion, and this movie had plenty of both. Most of the humour comes from Sir Ektor(voice of Sebastian Cabot) and Archimedes (voice of Junius Matthews), but Merlin (voice of Karl Swenson) had some truly delicious lines. I just love Archimedes, he is absolutely hilarious, and still manages to be likable, despite being very grumpy. The animation was lovely, and the scenes when Wart (voice of Ricky Sorenson)was an animal were truly entertaining. My personal favourite was the squirrel scene, but the duel of Merlin and Mim was the highlight of the film for me. The songs by the Sherman Brothers, while not particularly memorable, were very pleasant to listen to, as was the incidental music by the composer of the Jungle Book George Bruns. All in all, a truly enjoyable movie, that is definitely underrated. 9/10 from me. Bethany Cox"
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Arthur (aka Wart) is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for Wart beyond mere squiredom. He starts by trying to give Wart an education (whatever that is), believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
         "The kingdom of England has, for years, remained divided. Wart, a measly servant knave, dreams of becoming a knight but is barely certain he may act as squire to castle lord Sir Ector's son Kay; then, the sorcerer Merlin and his grumpy, talking owl Archimedes invite themselves to the castle and move into its dilapidated north tower. Merlin, who can magically access the future, intends to prepare Wart for a grand future, so he gives the squirt dangerous lessons, transforming themselves into animals to learn the mental skills befitting a knight and a ruler. Since the once-renown magical sword in the stone that could confer the kingdom of all England unto one person (thus unifying it) has never been able to be withdrawn for years, a tournament in London is formed to designate a ruler instead. Kay is going to compete, but the rude, lout stands no chance.",
         "The wizard Merlin teaches a young boy who is destined to be King Arthur."
      ],
      "budget": 0
   },
   "movielensId": 1025,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-12-25",
      "dvdReleaseDate": "2001-03-20",
      "directors": ["Wolfgang Reitherman"],
      "runtime": 79,
      "movieId": 1025,
      "title": "The Sword in the Stone",
      "mpaa": "G",
      "actors": [
         "Sebastian Cabot",
         "Karl Swenson",
         "Junius Matthews",
         "Norman Alden",
         "Rickie Sorensen",
         "Ginny Tyler",
         "Martha Wentworth",
         "Alan Napier",
         "Richard Reitherman",
         "Robert Reitherman"
      ],
      "imdbMovieId": "0057546",
      "originalTitle": "The Sword in the Stone",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [
         "ThOtoGV6ylU",
         "wYjUX1THmg8"
      ],
      "plotSummary": "Wart is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for him beyond mere squiredom. He starts by trying to give him an education, believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
      "tmdbMovieId": 9078,
      "avgRating": 3.55685,
      "releaseYear": "1963",
      "numRatings": 6631,
      "posterPath": "/wZyRYmYrAWNiFhXohp4Ly8svpJH.jpg"
   }
}