{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0041890",
      "video": false,
      "title": "So Dear to My Heart",
      "recommendations": [
         29254,
         38469,
         70106
      ],
      "backdrop_path": "/pZDIhKMJn3TcFXrBuqBM8nN4XQ8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jeremiah 'Jerry' Kincaid",
               "gender": 2,
               "credit_id": "52fe45f3c3a368484e0783f1",
               "name": "Bobby Driscoll",
               "profile_path": "/ib5Age9peuCwy6L5eZBN7W3egt3.jpg",
               "id": 50997,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Tildy",
               "gender": 1,
               "credit_id": "52fe45f3c3a368484e0783f5",
               "name": "Luana Patten",
               "profile_path": "/nJH9a8RChJKrYecjb4veNVuWenQ.jpg",
               "id": 137831,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Granny Kincaid",
               "gender": 1,
               "credit_id": "52fe45f3c3a368484e0783f9",
               "name": "Beulah Bondi",
               "profile_path": "/dduvRQRhbwdlbS12nljnHTkChIR.jpg",
               "id": 17755,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Uncle Hiram Douglas",
               "gender": 2,
               "credit_id": "52fe45f3c3a368484e0783fd",
               "name": "Burl Ives",
               "profile_path": "/fx4W7qSBI5392uQL5Cv5a7lSuF4.jpg",
               "id": 2753,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Head Judge at County Fair",
               "gender": 2,
               "credit_id": "53fe0a1b0e0a262deb002209",
               "name": "Harry Carey",
               "profile_path": "/anb733JSA0OPnYEnWRFdztKuncw.jpg",
               "id": 30212,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45f3c3a368484e0783e7",
               "name": "Harold D. Schuster",
               "profile_path": null,
               "id": 9082,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f3c3a368484e0783ed",
               "name": "Hamilton Luske",
               "profile_path": "/xeyWJsFlMtgjyfZnnElMnc6qFF6.jpg",
               "id": 11429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53fe0a7e0e0a262de20021ce",
               "name": "John Tucker Battle",
               "profile_path": null,
               "id": 120175,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53fe0a940e0a262ddc0021ad",
               "name": "Maurice Rapf",
               "profile_path": null,
               "id": 938322,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "53fe0aa60e0a262de20021d7",
               "name": "Ted Sears",
               "profile_path": "/xc5mW6SH0Hr6u5tgwJund0JbWL9.jpg",
               "id": 5449,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "53fe0ab30e0a262de5002177",
               "name": "Sterling North",
               "profile_path": null,
               "id": 1357429,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "565dcfa3c3a3687cf700267a",
               "name": "Mary Blair",
               "profile_path": "/vf3PzRot9sDJq7j884RnhTf25yj.jpg",
               "id": 77612,
               "department": "Art",
               "job": "Conceptual Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.809423,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29682,
      "vote_count": 7,
      "budget": 0,
      "overview": "The tale of Jeremiah Kincaid and his quest to raise his 'champion' lamb, Danny. Jeremiah's dream of showing Danny at the Pike County Fair must overcome the obstinate objections of his loving, yet strict, grandmother Granny. Jeremiah's confidant, Uncle Hiram, is the boy's steady ally.",
      "similar": [],
      "original_title": "So Dear to My Heart",
      "runtime": 79,
      "poster_path": "/6r2nvEUw1x06BGXOnledUDWn54z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1948-11-29",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Harold D. Schuster",
         "Hamilton Luske"
      ],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "John Tucker Battle",
         "Maurice Rapf"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041890/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NTAyNDg5NF5BMl5BanBnXkFtZTcwNTc2ODcxMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Burl Ives, Beulah Bondi, Bobby Driscoll | See full cast and crew »"],
      "reviews": [
         "A boy-and-his-sheep story, set on a farm at the turn of the century, and a valentine to childhood. This family film from Walt Disney opens, literally, with help from a collection of animated greeting cards. It proceeds from there with bits of animation accentuating the story of a likable youngster entering his beloved pet sheep in a county fair contest. Attempt to recapture the uncanny mix of animation and live-action warmth and humor of \"Song of the South\" doesn't completely succeed because, although the same kids--Bobby Driscoll and Luana Patten--are present, there's no Uncle Remus or any memorable songs beyond \"Lavender Blue\" (which, granted, is a dilly). Still, the film is meticulously produced and overwhelmingly heartfelt. A nice addition to the Disney catalogue, and rather touching in its old-fashioned way. *** from ****",
         "So Dear To My Heart is a more-or-less forgotten Disney movie made in 1949. It feels like an attempt to repeat the success of the studio's 1946 classic Song of the South, but the innocent, twee approach is likely to be met with derision by many of today's street-wise youngsters. That's not to say the film is bad. In fact, if you can put it into the context of when it was made and try to enjoy it for its merits, this film is actually a lovely slice of entertainment. The simple story tells of a young boy called Jeremiah Kincaid (Bobby Driscoll) who lives on a farm in 1903, helping his granny (Beulah Bondi) with the up-keep of the place. He comes to own a young black lamb named Danny, and dreams of taking the lamb to the County Fair - though granny advises him not to bother, since there's no call for black wool. Young Jeremiah is visited by some animated creatures who convince him to follow his heart.... if he thinks the lamb has a chance of winning, what the hell! Why not go for it? Driscoll was one of the finest child actors ever and here he is excellent as the young boy with a far-fetched dream. Bondi as granny is stern but lovable, and Burl Ives is good too as the boy's optimistic uncle. The animation is quite good, but the live action takes up most of the screen time. There are some memorable songs, although the Oscar nominated tune \"Lavender Blue\" is actually rather disappointing. So Dear To My Heart is worth watching, just so long as you remember that it was made in a time when the world was more innocent.",
         "\"So Dear to My Heart\" is yet another great Disney live-action/animation film. Kind of a follow-up to \"Song of the South\", but equally good. Burl Ives and his songs make the film worth seeing alone. A surprise song in the movie is \"Billy Boy\", sung in a duet between Beulah Bondi and Burl Ives. Bobby Driscoll and Luana Patten are just as fresh and appealing here as they were in \"Song of the South\". During the scene with the song \"Billy Boy\", watching them smile just fills me with joy. Equally joyous is seeing them dance with Bondi and Ives later in the same scene. If only they lived longer in real life, then I'd probably meet and work with them. This movie is not as well-known as other Disney films, probably because of its simple story, but don't miss it. With a lot of pros I've mentioned above, it doesn't seem dated. I love it as much as \"Song of the South\" and rate it **** out of ****.",
         "So Dear To My Heart is such a wonderful movie. Full of hope and faith with a little fantasy and imagination mixed in. I love the simple loving family atmosphere shown in the movie. This was a time when friends and neighbors truly knew and loved each other and helped each other. As we see so often today, those viewers under 40 years of age will probably not understand and might even be critical of the beliefs and priorities shown in the film. Those of us old enough to remember seeing it in the theater will love the feeling of being taken back to a time when simple things were the important things in life. I hope you enjoy it as much as our family. Like Song of the South, it is not currently out on DVD in the United States, but fortunately I bought a laser-disc copy of the film several years ago.",
         "Being a huge fan of Song of the South, this movie was also a delight. Bobby Driscoll and Luana Patten (\"The Sweetheart Team\"), are great as usual just like in all the classic Disney productions of this decade. And Burl Ives (voice of the eagle in Disneyland's old attraction America Sings) and his song Lavender Blue bring back memories! Quite honestly, I'm surprised the \"offend no-one\" attitude of Disney today hasn't got to the religious content of this film, which is refreshing and makes me thankful that they at least hold SOME things sacred (unlike digitally removing Pecos Bill's cigarette or editing out the Hatfields and McCoys scene from Make Mine Music). I love this film.",
         "Enjoyable Disney romp about a young boy who dreams of aquiring his own lamb--and even draws cartoon images of one--and then finally gets one, only to find out that they're much harder to take care of than he had ever dreamed. Touching, sweet, sappy, corny, and more often than not quite likable, this Disney classic will entertain your entire family and leave you feeling happy. It ain't great but it's decent enough. (I've owned a copy for years, and that says something.) ****/*****",
         "The title matches my feelings about it: indeed it is so dear to my heart. This is one of those early Disney classics which mix live-action and animation. It's a relic, one of those cinema pearls incredibly difficult to find and almost completely forgotten today. Which is a shame. It really is a fine little film. A small Disney masterpiece. I can even use the old-fashioned but charming exclamation of surprise «Gee whiz» to describe it. «Gee whiz» was probably Bobby Driscoll's favorite saying, as he often used this phrase in his films. They don't make anything like this nowadays. This is from a time when films were made with love, art and talent. Now the priority is purely to profit, with no real quality, no real talent and sadistic humor. Made shortly after 'Song of the South', has evident similarities with that one. Like that one, it mixes live-action and cartoons and has the same couple of children: the unforgettable Bobby Driscoll and Luana Patten. Another thing in common is the beauty of sceneries and locations, all in a big farm and they're about farm life. On the other hand, I can see that the famous 1995 film 'Babe' got some of its inspiration from 'So Dear To My Heart'. Now, as for the comparison between 'Song of the South' and 'So Dear To My Heart', which one is the better film? 'Song of the South' is good, but 'So Dear To My Heart' is the winner to me. The 4 main actors are excellent: Bobby Driscoll as Jeremiah Kincaid, Luana Patten as Tildy, Beulah Bondi as Jeremiah's loving grandmother but serious Granny Kincaid and Burl Ives as Uncle Hiram Douglas. The narrator does a wonderful job too. Oh yes, I can also mention the black lamb that portrays Danny: a fine animal actor, even though it might sound a little strange to say this. Danny the lamb is quite an extraordinary creature, to say the least. Danny is completely hilarious whenever he runs and causes mess and Jeremiah runs after him and tries to stop him. So, this film takes place in the early 20th century (in the year 1903, to be exact). It is basically the tale of Jeremiah and his love for his lamb Danny, being also a very educative film that teaches some culture and some good messages. Both the live-action and the animation look beautiful, pure, colorful, alive, artistic and magical. This and 'The Window' from 1949 are both masterpieces with the great Bobby Driscoll. Title in Portugal: 'Tão Perto do Coração'.",
         "With all of the stories within this story you really have to look at this film several times to get all the messages that are in it. Themes that were so real-to-life's lessons, and filled with teaching values like Stick-to-it-isty, I recommend it as a film that today's kids and parents should view together and re-examine with discussions. It was Disney story telling at his best. I especially enjoyed the Columbus Stick-to-it-isty piece.",
         "A small boy becomes emotionally attached to a new born black lamb and decides to enter it in the county fair. Living with his stern Granny on a farm means there is little money for frivolities, so the youngster goes out and gets the needed funds the old fashioned way...he earned them. Many things conspire to halt the trip to the fair: most brought on by the critter itself, but, of course, the lad and his pet enter the competition. There are lots of songs and animation in this dated but still enjoyable film, which also carries a simple but solid message about dealing with life's good and bad times.",
         "Like other Disney's films, simplicity is the support of an intense message about life.I think this old movie would be seen by today's children, considering the actual tendency to loose essential valors and go on the fantastic ways, putting wonder-workers and extraordinary actions on service of something in the antipodes of the day by day. This movie is today more important than it was in 1948. Then it was a poetic image of real life and real valors. Today it proposes the recuperation of a lost paradise. But the real paradise built by man's inside.Yonder postures and feelings, the music represents, per sea,the right sonorous image of life equilibrium:support,tenderness and peace. Remains of a lost paradise is, today and by me, the true sense of this great Walt Disney's film."
      ],
      "genres": [
         "Family",
         "Drama"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["This heartwarming classic tells the tale of a country boy who adopts a mischevious black lamb and learns valuable lessons about love and dedication."],
      "budget": 0
   },
   "movielensId": 1026,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-11-29",
      "dvdReleaseDate": null,
      "directors": [
         "Harold D. Schuster",
         "Hamilton Luske"
      ],
      "runtime": 79,
      "movieId": 1026,
      "title": "So Dear to My Heart",
      "mpaa": "",
      "actors": [
         "Bobby Driscoll",
         "Luana Patten",
         "Beulah Bondi",
         "Burl Ives",
         "Harry Carey"
      ],
      "imdbMovieId": "0041890",
      "originalTitle": "So Dear to My Heart",
      "genres": [
         "Animation",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The tale of Jeremiah Kincaid and his quest to raise his 'champion' lamb, Danny. Jeremiah's dream of showing Danny at the Pike County Fair must overcome the obstinate objections of his loving, yet strict, grandmother Granny. Jeremiah's confidant, Uncle Hiram, is the boy's steady ally.",
      "tmdbMovieId": 29682,
      "avgRating": 3.20155,
      "releaseYear": "1948",
      "numRatings": 129,
      "posterPath": "/6r2nvEUw1x06BGXOnledUDWn54z.jpg"
   }
}