{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "memory",
            "id": 10937
         },
         {
            "name": "forensic",
            "id": 160313
         },
         {
            "name": "gunman",
            "id": 163114
         }
      ],
      "imdb_id": "tt0118040",
      "video": false,
      "title": "Unforgettable",
      "recommendations": [
         18856,
         31583,
         41587,
         36778,
         10433,
         51321,
         34314,
         10879,
         38295,
         61418,
         44895,
         44181,
         219575,
         83489,
         50116,
         2047,
         20721,
         48781,
         20761,
         18551
      ],
      "backdrop_path": "/bvHbQelrzd7vL9zPeqs3IwQxjzN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Dr. David Krane",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e4b",
               "name": "Ray Liotta",
               "profile_path": "/o4jJSH3sri9dSIJwsCgT4de1535.jpg",
               "id": 11477,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Dr. Martha Briggs",
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040e6b",
               "name": "Linda Fiorentino",
               "profile_path": "/aKadq5uC9CjCKtkMYPYECNcGz3s.jpg",
               "id": 9625,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Don Bresler",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e4f",
               "name": "Peter Coyote",
               "profile_path": "/5zVvYZxE6T0OeL1iaFBBCzY3QOi.jpg",
               "id": 9979,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Stewart Gleick",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e53",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Curtis Avery",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e57",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Michael Stratton",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e5b",
               "name": "Duncan Fraser",
               "profile_path": "/65nwyXassO3PmeL8vvC7DKDXcSM.jpg",
               "id": 14595,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Lindy Krane",
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040e5f",
               "name": "Colleen Rennison",
               "profile_path": "/rJdgCklRuMpHtzWldaYhYePIXLz.jpg",
               "id": 21058,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Cara Crane",
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040e63",
               "name": "Caroline Elliott",
               "profile_path": null,
               "id": 21059,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mary Krane",
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040e67",
               "name": "Stellina Rusich",
               "profile_path": "/qDTvakXxuic4YuCiMZVosER0qto.jpg",
               "id": 21060,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e23",
               "name": "John Dahl",
               "profile_path": "/klMxcB64Tu0sWCn3YDTMcGWPArQ.jpg",
               "id": 21053,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040e29",
               "name": "Bill Geddie",
               "profile_path": null,
               "id": 21054,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e2f",
               "name": "Dino De Laurentiis",
               "profile_path": "/l5skcaSr7QLDMOpAahznDjUW9Ec.jpg",
               "id": 5398,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040e35",
               "name": "Martha De Laurentiis",
               "profile_path": null,
               "id": 19051,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e3b",
               "name": "Christopher Young",
               "profile_path": "/2laVovSXDVpHRS6HSpKyCspSmze.jpg",
               "id": 19155,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e41",
               "name": "Jeff Jur",
               "profile_path": null,
               "id": 720,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e47",
               "name": "Eric L. Beason",
               "profile_path": null,
               "id": 21055,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040e71",
               "name": "Scott Chestnut",
               "profile_path": null,
               "id": 55178,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.292296,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2045,
      "vote_count": 33,
      "budget": 18000000,
      "overview": "Ray Liotta stars as a medical examiner who has been acquitted for his wife's murder but many still question his innocence. Obsessed with finding his wife's killer, a possible solution presents itself in an experimental serum designed by a neurobiology Linda Fiorentino which has the ability to transfer memories from one person to another, but not without consequences. Liotta driven to solve the case injects himself with the serum, bringing him closer and closer to finding her killer but bringing him closer to death.",
      "similar": [
         26390,
         12150,
         4771,
         445954,
         22825,
         18587,
         4639,
         15069,
         8090,
         949,
         979,
         1586,
         1949,
         2832,
         281,
         75780,
         807,
         281957,
         357096,
         3597
      ],
      "original_title": "Unforgettable",
      "runtime": 106,
      "poster_path": "/qQek3X5Yv0iLZqQ98KWIKtE3x4m.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dino De Laurentiis Company",
            "id": 10308,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Spelling Films",
            "id": 10355,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-02-23",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "He loved her. He lost her. He won't let her memory die... until it tells him who killed her.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Dahl"],
      "runtime": 117,
      "synopsis": "In Unforgettable Ray Liotta plays Dr. David Krane, a medical examiner investigating crime scenes for the Seattle Police. While investigating a drug store robbery and murder he discovers a clue that he believes is a direct connection to the unsolved identity of the person who killed his wife. Dr. Krane's wife was found murdered in their home, and the doctor was tried but not convicted, on the grounds that the Police mishandled evidence. Krane, a recovering alcoholic, is still obsessed with solving his wife's murder. Krane attends the lecture of Dr. Martha Briggs (Linda Fiorentino), who is studying the technique of memory transferal in rats that involves injecting spinal fluid from one animal to another. When Krane steals the serum and begins combining it with spinal fluid from recently murdered victims he is able to experience a host of sensations the primary one being the actual visual memory of the murderer in the cases. The major threat to the serum is that it puts tremendous pressure of the human sensory system and can lead to heart attacks in humans. When Dr. Briggs realizes that he has stolen his serum and is abusing it she is both fascinated but alarmed and tries to stop him, or at least attend to him given his drive to continue self-administering the dangerous formula. Krane discovers the identity of the drug store murderer Eddie Dutton (Kim Coates) through his sensory reclaiming of the victim's spinal fluid and also concludes from specific mannerisms of the criminal that Dutton is the man who killed Krane's wife. Police Inspector Don Bresler (Peter Coyote) intervenes to prevent Krane from discovering more about the past of Eddie Dutton, but Detective Stewart Gleick (Chris McDonald) initially against Krane begins to see some possible miss-doings in the Police force and takes steps to support Krane and find the killer of his wife. When Krane gains possession of his own wife's spinal fluid and with Dr. Briggs assistance injects himself with it, the results bring about the discovery and involvement of more than he considered.",
      "writers": ["Bill Geddie"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118040/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MjA4MzIxMV5BMl5BanBnXkFtZTcwMTg3Mjg3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ray Liotta, Linda Fiorentino, Peter Coyote | See full cast and crew »"],
      "reviews": [
         "The best points of this sci-fi/mystery/thriller, I thought, were: 1 - very good suspense; 2 - a different-angle story; and 3 - an involving \"whodunit\" story; 4 - and a fast- moving for a two-hour film. Another big plus: John Dahl directed this, and in his prime. This movie came on the heels of Kill Me Again, Red Rock West and The Last Seduction.....all of them very entertaining films. This would be best for the first-time viewer, but I still have enjoyed it the three times I've seen it. I just wait about 4-5 years between viewings so as not to remember everything. One thing unusual: Linda Fiorentino actually plays a nice lady! Usually, she's brutal! Ray Liotta, Peter Coyote, Christopher McDonald and David Paymer all provide good male performances with Liotta playing the central character. Be warned that this story is a bit unbelievable. It's pretty far out, and it can get on the gory side, but it's different and will keep your attention.",
         "I was really surprised at the quality of this thriller. Ray Liotta stars. Why didn't I ever hear about it? What a thrilling surprise. Try it if you like sci-fi new-formula medical stuff that requires intelligent imagination. Lots of twists and turns. Buy the premise and you'll love the movie.",
         "There have been harsh words about this \"unforgettable\",probably exaggerated.This could be some kind of update of \"spellbound\"(1945) and it recalls sometimes\" D.O.A. \"with Dennis Quaid and Meg Ryan (1988) ,and even \"Jennifer eight\"(1992)with Andy Garcia (the latter for the murderer's identity).Except for Hitchcock's classic,of course , the movies I mention had disastrous reviews.And however,they have much more imaginative scripts than ,say,\"die hard\" (one,two or three,take your pick,they are interchangeable) Script for \"unforgettable\" is more polished than it has been given credit for.It's stunning when,in the end,the two stories come together,this time recalling \"dead again\" (K.Brannagh ,1991),another movie with an unfairly mediocre reputation;only 2 stars and a half on the Maltin!OK ,the plot for \"unforgettable\" is far-fetched,but it has an intern logic,and anyway,is it less credible than B.Willis singlehandedly taming a whole bunch of terrorists ?(Die Hard is rated 3 stars!) Ray Liotta is an actor whose parts are not always worthy of himself.He's convincing here:during the whole movie,his face remains sad,wistful,as if he were waging an almost lost war.He rarely smiles,except when he's with his daughters.Linda Fiorentino,once she's provided Liotta with her drug,is not very important for the action (definitely not Ingrid Bergman in \"spellbound\").And we will be very thankful to Dahl for sparing us the umpteenth love affair between the patient and his doctor.More,we have here a very original ending,marred by the syrupy eponymous song though.It might be a happy end,after all,and which justifies the title. All in all,it's an entertaining movie,mixing smartly sci-fi,thriller,and whodunit.It could become a sleeper.",
         "I do not know why people tend to rate this film low. Of course, I am slightly prejudiced as i always thought that Ray Liotta may be a cousin until I found out he was adopted. That doesn't take away the quality of his acting, especially in this film. He really has to lay it on thick as he takes the mind of others through an experimental drug developed by Dr. Martha Briggs (Linda Fiorentino) in an effort to find out who killed his wife (Stellina Rusich). Fiorentino (Dogma, Jay and Silent Bob Strike Back) does a really good job as the research scientist who helps him through his ordeal. The film had other favorites: Kim Cattrall and Peter Coyote, who added to the mystery and suspense. I really like Liotta for his range and you could do a lot worse than spend two hours with him as he catches a killer.",
         "Ray Liotta as a forensic examiner who discovers he can experience and thereby solve his wife's murder by injecting himself with cerebral spinal fluid from those involved. Dahl's direction is leaden and every character is dull. Linda Fiorentino fans will find nothing here. By the time it's over you may wish you can siphon some CSF from people who saw a better movie that night and mix it with some of Fiorentino's cocktail, grab a syringe, flex your arm... Seriously though, it's a pretty cool story that would have been more successful as a novel. Hey, what's with Kim Cattrall playing a non-sexpot supporting character?",
         "Dr David Krane's world caves in when his wife is murdered and he is a major suspect. For legal reasons the case falls apart but the shadow hangs over him. When a colleague develops an experimental fluid that allows users to experience the memories of others Krane starts to use it to try and piece together what happened to his wife. However with the drug impacting on his heart he only has so long to uncover the truth. Some thrillers manage to have good ideas and spoil them with a bad film. Some turn bad ideas into good films, but many are spoilt by a bad idea. This thriller works well for much of the investigation by Krane \u0096 but when it relies totally on the memory drug to move things along it really is very weak indeed. The direction is good enough to give the illusion of pace and excitement but really it never manages to shake off this central terrible idea and the film suffers as a result. Liotta is always OK in most things but really hasn't much to work with. He does well despite the material. Fiorentino was great in The Last Seduction but only because she had a great character in a great story. Here she has no character in a dumb thriller and it shows. Support from McDonald, Coyote, Kim Cattrall and Kim Coates vary between average and good but really they are mainly all red herrings to try and sustain the interest. Overall this is enjoyable in most parts but where it relies on the memory drug heavily it falls down a bit. Goes to show that you can't make a purse out of a pig's ear and this film never manages to shake off the fact that it's central idea is just plain dumb.",
         "Let me preface this review by saying this movie started off great with a great original idea. In fact the movie treaded on a good path besides a few stumbles here and there. The movie is about a doctor, Doctor Krane (Ray Liotta), whose wife was murdered. The case was never solved although he was tried for the crime but acquitted. Later he comes across another doctor, Dr. Martha Briggs (Linda Fiorentino), who has a highly experimental drug that can transfer one person's memories to another person. Well, Dr. Krane uses this drug to try to track down his wife's killer. At first the movie was rolling along fine, in fact is was down right captivating. But somewhere along the way it got predictable and then they didn't know how to end it. And when I say predictable, I mean reeeeally predictable. This movie could have done itself justice by not being as long as it was and by not making the culprit so obvious. It made out to be just an average movie after all.",
         "I recently saw this movie although it was released in 1996. I was pleasantly surprised by Ray Liotta's performance. Usually he plays such a bad guy. However, I enjoyed that his character showed some emotion. There are a lot of twists and turns in this movie and you will be surprised at the ending. The storyline is far fetched, but you will enjoy it. However, the movie at two hours, is a bit long and they could really have cut out a half hour. There were times I thought the movie could have ended, but it went on and on... All in all, a good movie.",
         "Linda Fiorentino has played a couple of self-absorbed seductresses, in \"Jade\" and \"The Last Seduction\", and she was extremely good, especially in that last, semi-comic role as an exploitative nympho. Here, she's a scientist investigating the transfer of memory by means of fluid extraction from the brain one the donor into the arm of the receiver. She's pretty good here too, and it was a surprise because she'd seemed made for the more treacherous roles. No kidding. As the principled doctor here, she's sometimes frightened and often wide-eyed with bemusement. Not exactly Alice in Wonderland but not Selene either. Ray Liotta is the medical examiner whose pregnant wife has been murdered and he begins to self administer the serum in order to recapture the experiences of the murder victim. It leads to more than he bargained for. It puts all sorts of unbearable strain on his heart and he undergoes all the emotions associated with being murdered. (Evidently, your life flashes before your eyes as you expire.) It's an interesting premise. I wonder if it wasn't inspired by a controversial experiment done in the late 50s or early 60s (I'm too lazy to look it up) involving flatworms and a Y-shaped maze. The experimenters trained a flatworm to find food at the end of the maze, then they chopped up the flatworm and fed it to a second flatworm in a kind of Planaria pate, and the second flatworm learned the maze more quickly than controls. The premise is full of promise but the story is knee-capped by its obvious desire to become just another action thriller with blood splattering all over the walls and pokers bashing in heads and Ray Liota taking the drug and writhing all over the floor like Jeykll turning into Hyde. The story is sometimes confusing too because, at times, Liota's own flashbacks are interpolated into the flashbacks of a couple of murder victims, so it's hard to tell whose memory (or insight) we're witnessing. Too bad it's so sloppily done. It ends with a monumental explosion and a house afire and Liota trying to rescue an unconscious body and a tape recording at the same time, while Fiorentino and a gorgeous Kim Cattral watch helplessly. At the final fade, Liota gets to spend an indefinite amount of time playing with his two cute little girls in such sunshine as the Seattle climate allows.",
         "Ray Liotta is convincing enough in this mystery film with scifi overtones as Dr. Crane, an accused but acquitted suspect in his wife murder whom steals an experimental mind- expanding yet incredibly dangerous drug from scientist Marta Briggs (Linda Fiorentino) in order to solve the crime and deduce the true killer. The film is able to keep up a tense mood throughout despite it's more fantastical conceits and I enjoyed myself. While it may be far from perfect (one or two of the supporting actors drop the ball, the movie as a whole seemed a touch derivative),, it's still perfectly adequate, My Grade: C+ Where I saw it: Instant Netflix"
      ],
      "genres": [
         "Sci-Fi",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": [
         "Dino De Laurentiis Company",
         "Metro-Goldwyn-Mayer (MGM)",
         "Spelling Films"
      ],
      "summaries": ["Unsuccessfully framed for his wife's murder, Dr. David Krane attempts to find the real culprit by utilizing a new drug that allows him to experience the memories of other people first-hand. As he gets closer to the truth, the injections begin to take their toll on his life. Additionally, a history of alcoholism, a career crisis, and the involvement of police officers in the murder all conspire to prevent Dr. Crane from learning what really happened. The challenge, then, is for the doctor to overcome these obstacles before his time runs out."],
      "budget": 18000000
   },
   "movielensId": 103,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-23",
      "dvdReleaseDate": "1999-07-23",
      "directors": ["John Dahl"],
      "runtime": 106,
      "movieId": 103,
      "title": "Unforgettable",
      "mpaa": "R",
      "actors": [
         "Ray Liotta",
         "Linda Fiorentino",
         "Peter Coyote",
         "Christopher McDonald",
         "David Paymer",
         "Duncan Fraser",
         "Colleen Rennison",
         "Caroline Elliott",
         "Stellina Rusich"
      ],
      "imdbMovieId": "0118040",
      "originalTitle": "Unforgettable",
      "genres": [
         "Drama",
         "Mystery",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["ppsp24yW7ac"],
      "plotSummary": "Ray Liotta stars as a medical examiner who has been acquitted for his wife's murder but many still question his innocence. Obsessed with finding his wife's killer, a possible solution presents itself in an experimental serum designed by a neurobiology Linda Fiorentino which has the ability to transfer memories from one person to another, but not without consequences. Liotta driven to solve the case injects himself with the serum, bringing him closer and closer to finding her killer but bringing him closer to death.",
      "tmdbMovieId": 2045,
      "avgRating": 3.27197,
      "releaseYear": "1996",
      "numRatings": 1206,
      "posterPath": "/qQek3X5Yv0iLZqQ98KWIKtE3x4m.jpg"
   }
}