{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "part live action",
            "id": 9977
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "dragon",
            "id": 12554
         },
         {
            "name": "part animation",
            "id": 193521
         }
      ],
      "imdb_id": "tt0076538",
      "video": false,
      "title": "Pete's Dragon",
      "recommendations": [
         12335,
         11319,
         9994,
         10948,
         12233,
         11135,
         4978,
         10380,
         28032,
         10957,
         14136,
         11360,
         18975,
         31102,
         11704,
         250480,
         19186,
         15171,
         15789,
         11886
      ],
      "backdrop_path": "/qSSvOqCYJPte40rR61owSCtcXtd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Pete",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f3b",
               "name": "Sean Marshall",
               "profile_path": "/mEYBEfTuNthgz94v4EVBxI0hanq.jpg",
               "id": 68130,
               "order": 0
            },
            {
               "cast_id": 28,
               "character": "Nora",
               "gender": 1,
               "credit_id": "52fe43fb9251416c75024f83",
               "name": "Helen Reddy",
               "profile_path": "/ixVMkRf1J3pRW73EkZu75AtcOnK.jpg",
               "id": 553509,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lampie",
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f2f",
               "name": "Mickey Rooney",
               "profile_path": "/bgCm55k2eo2YV5bMn3D0O4NPwU.jpg",
               "id": 1937,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Hoagy",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f33",
               "name": "Red Buttons",
               "profile_path": "/iog7plLpG4qvBlkq1aKSutkAys.jpg",
               "id": 7503,
               "order": 3
            },
            {
               "cast_id": 2,
               "character": "Dr. Terminus",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f2b",
               "name": "Jim Dale",
               "profile_path": "/uXRnV6La3Yg2brM46kijHoCNy9O.jpg",
               "id": 40945,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Prince John/ Robin's Grandpapa",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f6f",
               "name": "Peter Ustinov",
               "profile_path": "/8Lv4g3ZPVSM1ckKk15OnryX8sL7.jpg",
               "id": 14501,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Lena Gogan",
               "gender": 1,
               "credit_id": "52fe43fb9251416c75024f37",
               "name": "Shelley Winters",
               "profile_path": "/zVg966M0RVK5kycHZUEDc51QULV.jpg",
               "id": 7632,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Marian Sheeta",
               "gender": 1,
               "credit_id": "52fe43fb9251416c75024f73",
               "name": "Stefanie Powers",
               "profile_path": "/xjK7ytgxD9MVkB1vTgjHgn83xMS.jpg",
               "id": 39762,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Sir Hiss a Snake",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f7b",
               "name": "Terry-Thomas",
               "profile_path": "/tdsN3NUsBNEPtHkWX5BskfG7yCi.jpg",
               "id": 29427,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Miss Taylor",
               "gender": 1,
               "credit_id": "52fe43fb9251416c75024f8d",
               "name": "Jane Kean",
               "profile_path": "/fpuUpzY01kfaJXqC0NpCfQBQmDo.jpg",
               "id": 142726,
               "order": 10
            },
            {
               "cast_id": 31,
               "character": "The Mayor",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f91",
               "name": "Jim Backus",
               "profile_path": "/iBZLbwdnnT9pFnBIlBZPfT6n06b.jpg",
               "id": 2771,
               "order": 11
            },
            {
               "cast_id": 32,
               "character": "Merle",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f95",
               "name": "Charles Tyner",
               "profile_path": "/6OHlhUQcMXIMIkqIskBw4tK2Mp7.jpg",
               "id": 4974,
               "order": 12
            },
            {
               "cast_id": 38,
               "character": "Grover",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024fa9",
               "name": "Gary Morgan",
               "profile_path": "/oqlGC4bi8TO9owbEcg78d4ZqRvT.jpg",
               "id": 1217505,
               "order": 13
            },
            {
               "cast_id": 34,
               "character": "Willie",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f99",
               "name": "Jeff Conaway",
               "profile_path": "/dzsbIbWFlwsKpOU6D8Men0Geumi.jpg",
               "id": 8894,
               "order": 14
            },
            {
               "cast_id": 35,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f9d",
               "name": "Cal Bartlett",
               "profile_path": "/o0ZLqM29kF8HfzZgZOc1cLvpX9h.jpg",
               "id": 45388,
               "order": 15
            },
            {
               "cast_id": 36,
               "character": "Elliott (voice)",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024fa1",
               "name": "Charlie Callas",
               "profile_path": "/rKMBYPnsZC7uyfHU8COlEYxjLtl.jpg",
               "id": 168211,
               "order": 16
            },
            {
               "cast_id": 37,
               "character": "Captain",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024fa5",
               "name": "Walter Barnes",
               "profile_path": "/m7OtPTdxtRSRFJeAYnBSTFjINgX.jpg",
               "id": 33544,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f41",
               "name": "Malcolm Marmorstein",
               "profile_path": null,
               "id": 68132,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f47",
               "name": "Jerome Courtland",
               "profile_path": "/6DN7AT5wDEo41qVr1tEYiWcunwQ.jpg",
               "id": 68133,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f4d",
               "name": "Ron W. Miller",
               "profile_path": null,
               "id": 12863,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f53",
               "name": "Frank V. Phillips",
               "profile_path": null,
               "id": 58007,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f59",
               "name": "Gordon D. Brenner",
               "profile_path": null,
               "id": 68134,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f5f",
               "name": "Joel Hirschhorn",
               "profile_path": null,
               "id": 68135,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f65",
               "name": "Al Kasha",
               "profile_path": null,
               "id": 68136,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024f6b",
               "name": "Irwin Kostal",
               "profile_path": null,
               "id": 68137,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024f89",
               "name": "Don Chaffey",
               "profile_path": null,
               "id": 25558,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 7.738434,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11114,
      "vote_count": 254,
      "budget": 10000000,
      "overview": "Pete, a young orphan, runs away to a Maine fishing town with his best friend a lovable, sometimes invisible dragon named Elliott! When they are taken in by a kind lighthouse keeper, Nora, and her father, Elliott's prank playing lands them in big trouble. Then, when crooked salesmen try to capture Elliott for their own gain, Pete must attempt a daring rescue.",
      "similar": [
         62211,
         862,
         137106,
         10191,
         809,
         810,
         8839,
         888,
         23168,
         1429,
         1368,
         40807,
         68718,
         41630,
         107846,
         7191,
         28178,
         1701,
         708,
         36536
      ],
      "original_title": "Pete's Dragon",
      "runtime": 128,
      "poster_path": "/e0jZxnjmR6S4EhMl3reHOJYRrqo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1977-11-03",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Brazzle Dazzle Brilliance!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Chaffey"],
      "runtime": 102,
      "synopsis": "In early 20th-century Maine, Pete (Sean Marshall) is fleeing his adoptive family, the Gogans, who mistreat him and use him as a slave. As family matriarch Lena Gogan (Shelley Winters) and company attempt to lure him back (\"The Happiest Home in These Hills\"), an unseen force, which Pete calls Elliott, distracts the Gogans by knocking Willie (Jeff Conaway) and the rest of the family into the mud. Frustrated, the Gogans resume their search elsewhere, since they spent their savings on \"buying\" Pete and can't afford to adopt another orphan. The next morning, Pete and Elliott, who is revealed to be a large green and purple dragon, share breakfast in an apple orchard (\"Boo Bop BopBop Bop (I Love You, Too)\"). The pair decide to go to a nearby fishing village, Passamaquoddy. Unfortunately, the unseen Elliott makes his presence known by knocking over things and making footprints in wet cement. Pete is immediately labeled a source of ill luck and is forced to flee. Nearby, Lampie (Mickey Rooney) stumbles out of a tavern and encounters Pete. Elliott decides to make himself visible and playfully scare Lampie, much to the disgust of Pete. Panicked, Lampie runs back into the bar to warn the townsfolk, who take his rantings as a drunken delusion (\"I Saw a Dragon\"). Nora (Helen Reddy), Lampie's headstrong daughter, comes looking for him and gets swept up in the tavern's lampooning. Nora takes Lampie back to their home, the Passamaquoddy lighthouse, and settles him down. After putting Lampie to bed, she spies a young boy, Pete, walking along the beach and decides to investigate. Pete and Elliott sit in a cave near the lighthouse, where Pete rebukes Elliott for causing trouble and worries about his own future. The two make up just as Pete is discovered by Nora, who invites him into the lighthouse for the night. There, he explains his history and how Elliott rescued him from the Gogans (\"It's Not Easy\"). As they talk, Pete sees a picture of a sailor and asks who it is. Nora explains that it is her fiancé Paul, whose ship has been missing for a long time. Pete tells her that he will ask Elliott about Paul, because he [Elliott] has a way of knowing things. Nora believes Elliott to be an imaginary friend, and that Pete is trying to cheer her up, so she pretends to believe that Elliott will help her. Doc Terminus (Jim Dale), a snake-oil salesman, and his shill Hoagie (Red Buttons), fleeing from pursuers, arrive in Passamaquoddy. The town's population, who have been visited by Terminus before, are initially angered by his return. But, thanks to his clever salesmanship, Terminus is able to calm the mob (\"Passamashloddy\") and sets up shop to sell more of his wares. Meanwhile, Nora has taken Pete to buy some new clothes. That evening, Pete asks to go to the cave to show Elliott his new suit and to take Paul's picture so Elliott can help find him. Both agree, with Lampie adding that Elliott isn't allowed in the lighthouse. Nora thanks her father for pretending that the dragon exists, but Lampie insists he actually saw a dragon. Nora tells him to be realistic, to which Lampie retorts that Nora has been holding out hope for Paul's return, something nobody else expects to happen. Lampie apologizes for his outburst and excuses himself, giving Nora time to think (\"Candle on the Water\"). As Terminus and Hoagie \"treat\" the townsfolk in the tavern, Lampie drunkenly stumbles up and tells them both about the dragon. Terminus dismisses the tale, but Hoagie, just as drunk as Lampie, agrees to go with Lampie to the cave. In the cave, Elliott observes the duo as they frighten themselves with exaggerated descriptions of a terrifying monster. Fearful himself, and not realizing they are describing him, Elliott joins them as they explore, to the shock of Hoagie and Lampie. After all three face each other, Hoagie offers Elliott some liquor as a gesture of peace. The alcohol, however, triggers a fiery belch from his mouth that chases both men out of the cave. Nora escorts Pete to school, while the local fishermen complain about the recent scarcity of fish, and upon seeing Pete believe he is the cause. Nora angrily reminds them the fishing grounds shift at times, and that \"There's Room For Everyone\" in town, even Pete and his \"dragon.\" At the schoolhouse, Miss Taylor is wary of accepting Pete as a new student, but relents. During the lessons, the invisible Elliott begins ringing the school bell. As Pete tries to stop Elliott, Miss Taylor sees Pete on the bell's rope and thinks that he is ringing it. Miss Taylor punishes Pete for lying, which enrages Elliott, who smashes into the building, leaving dragon-shaped holes in the walls. Doc Terminus, hearing the ruckus, sees the damage and realizes the dragon is quite real. He discovers that dragons have a lot of uses (\"Every Little Piece\") and hatches a plot to buy Elliott from Pete. At the lighthouse, Terminus makes Pete an offer for Elliott, which Pete refuses since he doesn't \"own\" Elliott. The two crooks are subsequently chased away by Nora's foghorn. Afterwards, Nora reveals to Pete that she and Lampie would like for Pete to stay with them, so that Pete can \"stop running\" and live a normal life. Gratefully, Pete accepts their offer (\"Brazzle Dazzle Day\"). Unfortunately, the Gogans arrive in Passamaquoddy, still searching for Pete. They ask Hoagie if he knows a Pete, one that always talks about a dragon. Nearby townsfolk react to the question, telling them this is where Pete is. The Gogans find Pete with Nora and Lampie by the wharf (\"Bill of Sale\"), but Elliott arrives in time to save the day. Terminus later visits the Gogans, convincing them that he will give them Pete if they help him capture Elliott. He then gathers allies among the superstitious who take the dragon as a sign of misfortune and prepares a trap. That evening, a storm starts to blow in. Elliott tells Pete he has located Paul. Pete tries to tell Nora the good news; however, Nora, still believing that Pete has made up Elliott, says that since Pete has a new home, it was time both of them became more realistic so they could move on. Even Lampie begins to doubt that he saw a dragon. Pete, however, is largely undeterred, and he helps Nora prepare the lighthouse for the storm. Out at sea, a sailing ship is heading for Passamaquoddy. The ship's captain is assisted by none other than Paul, who knows the local waters, as well as the lighthouse-keepers. Terminus comes to the lighthouse and lures Pete to the town's boathouse, while the frightened Hoagie does the same to Elliott. At the boathouse, Elliott discovers Pete just as Terminus springs his trap. Elliott is able to break free and rescues Pete from the Gogans before they can escape. In a last effort, Lena Gogan shows Elliott the bill of sale that declares her Pete's legal guardian. Elliott sets the paper on fire, tips Lena Gogan into a barrel of creosote, and chases off the family's carriage horse. As Pete and Elliott celebrate, Terminus aims a large harpoon gun at the distracted dragon. He is about to fire when he realizes that the harpoon's rope is looped around his ankle. He diverts the cannon, but is unable to stop it from shooting him through the ceiling. The harpoon lands in a pole, leaving Terminus dangling and, with his wagon destroyed, out of business. As they prepare to leave, Elliott sees a utility pole start to fall towards the town hall, just as the mayor, Miss Taylor and the town council are exiting. Elliott, now visible, catches the pole and saves them, much to their surprise. Off the coast, a ship is headed for the jagged rocks of a reef. The Passamaquoddy lighthouse has been hit by a monstrous wave that shattered the lantern room windows, drenching the oil-burning lamp, and Lampie cannot find a dry wick. Elliott arrives just in time to light the lamp with his own fire. As he is trying to do so, Nora comes in and is astonished by his presence. After several failures, the light is ignited and the ship is saved. The saving of the ship enables Elliott to become accepted by the townspeople as a heroic figure or guardian. The economy prospers, and the mayor is humbled. Nora's love Paul returns, the sole survivor of the wreck of which Nora was informed earlier. It is revealed that Paul had lost his memory until an intervention by Elliott restored it, and shown that he was aboard the ship saved during the previous night. Elliott, however, has sad news: because Pete is now safe and has a loving family of his own, the dragon must move on to help other children. Pete and Elliott say their goodbyes, and Elliott flies off to his next task, with Pete reminding him to remain invisible. A reprise of the line \"There really is a dragon\" is provided by Paul.",
      "writers": [
         "Malcolm Marmorstein",
         "Seton I. Miller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076538/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTQ3ODEyNTk2M15BMl5BanBnXkFtZTcwMjY2MzQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sean Marshall, Helen Reddy, Jim Dale | See full cast and crew »"],
      "reviews": [
         "Too many people spend too much time comparing Disney movies to each other, as if to say that every Disney movie made should unfold in such a way as to easily identify it as a \"Disney Movie.\" That's a shame, as each movie should be judged on it's own contributions to the motion picture lexicon. Fortunately for Pete's Dragon, it contributes something that is essential and valuable to a child's world: fun. There's nothing too serious in Pete's Dragon. Granted, the catalyst for the action in the film is a boy running away from an abusive family, only to encounter an equally abusive society (not to mention a scheming charlatan who wants to capture - and kill - Pete's Dragon for his own monetary gain), but all involved in the production are aware that their target audience is children, and so all of the aforementioned is handled with kid gloves. The best example of this is the acting. The cast does their best to have fun with their character and, as such, contributes greatly to the light-hearted tone of the film. In particular, the villains are played with great, over-the-top gusto, which is exactly what is needed in a kids movie. You want to teach children a lesson, not scare the crap out of them. As such, Shelley Winters as Ma Gogan and Jim Dale as Doc Terminus are classic kiddie villains: Winters stomps through her scenes in a bluster of hilarious hillbilly kookiness, while Dale steals every scene he's in - and nearly the whole show - in a deliciously maniacal role that should have one him an oscar - seriously! Any actor can bring on the tears and boo-hoo their way through an \"emotionally intense\" role; they're a dime a dozen. It takes a real actor to come up with the kind of performance Dale did, in which every line of dialogue is nailed, and his voice and his body seem to be in completely in synch with each other and with the character. There is not one word left untouched by his genius. Especially fun are his interactions with his sidekick, Hoagy, played by Red Buttons. The two are perfect comic foils. They are no matches, however, for the straight-shooting Nora. Nora (Helen Reddy), along with her father Lampie (Mickey Rooney) tend to the local lighthouse. It is in these two characters that children find their protectors. In any kids movie, there needs to be at least one character on screen with which children can find comfort and solace. Reddy plays Nora as a down-to-earth, take no bull lady who becomes a mother figure to Pete. Rooney plays Lampie as a drunken old coot who rides the fence about Pete until about halfway through, at which time he, too, joins the side of good. There's a lesson in this movie for adults, too. Nora and Lampie both learn a little about life from Pete. Nora had decided to keep people at arm's length for fear of losing them (as she did her beau, a seaman who was lost at sea). Through her encounters with Pete, she learns to open up and allow love back into her life, this time in the form of motherly love. Lampie, too, becomes attached to the kid, and, throughout the process of his daughter and Pete bonding, learns that there's more to life than the bottle: there's family. These, really, are important lessons for adults, and ones that are never dated, rather, always applicable to any time and place. So is the lesson for children. At the heart of Pete's Dragon is a simple message for children: hold tight to all that is right, no matter how bad life gets, and good things will come. Pete escapes a horrid life slaving away for the wretched Gogan family, only to run into the arms of a civilized society that looks down on him because of he's an outsider. He's anything but welcomed, and when things start going wrong, he's the first one to be blamed. No matter how hard he tries, society won't believe him, or accept him. He could easily make the wrong choice: give in and become the ruffian they all think he is or, worse, do what society did to him, and turn his back on his friend, Elliot, who is partly to blame for Pete's predicament, as he pulls pranks while he's invisible, leaving Pete to take the rap. In the end, his perseverance pays off: the town embraces him and he gets a family. This lesson is learned, as is to be expected in a musical, with a song and a dance. The musical numbers are by far the weakest element in the movie. The songs are simple, yet they work (believe me, after you watch the movie, you'll find yourself spontaneously singing the choruses the next day). The dancing is the most difficult to digest, as it is often stiff and pointless. That's okay, though, as the story and the acting more than make up for it. When all is said and done, Pete's Dragon is everything a kids movie should be: educating and entertaining.",
         "You can be fairly sure with the animated Disney films that you're going to get something good. But with the studio's live-action films there are no guarantees. On the one hand, you might get something like Mary Poppins or 20,000 Leagues Under The Sea - in which case you'd be plenty satisfied. On the other hand you could get something as terrible as Popeye, in which case you'd need a great deal of willpower to make it to the end. Pete's Dragon is one of Disney's live-action ventures (though it features one animated character in Elliot, the dragon of the title). Though a little overlong and rambling, it is on the whole a well-made and entertaining film, and it is certainly a gulf ahead of the likes of Condorman, Popeye and Herbie Goes Bananas. Scruffy young orphan Pete (Sean Marshall) is on the run in the woodland of Maine from the Gogan family, a bunch of abusive rednecks led by Lena Gogan (Shelly Winters), who claims that she owns Pete because she bought him at a market. Pete escapes from them, and sets off for Passamaquoddy, a nearby coastal town where he hopes to find safety. Accompanying Pete is an animated dragon named Elliot, who can make himself invisible and who has come to look after Pete until the kid has got his life sorted out. Once in Passamaquoddy, Pete and Elliot inadvertently cause havoc, including scaring the wits out of lighthouse-keeper Lampie (Mickey Rooney). They hide out in some nearby caves, but Pete is found by Lampie's daughter Nora (Helen Reddy), who decides to take him in. Elliot's job seems done (Pete is now safe and wanted, after all) but then con-man Dr. Terminus (Jim Dale) arrives in town.... and soon he's got his mind set on capturing the dragon. Like I said, the film is rambling, and from this synopsis it's clear that the plot wanders around a lot, introducing probably more events and characters than necessary. Nonetheless, Pete's Dragon is still entertaining. Jim Dale as the unscrupulous Dr Terminus, and Red Buttons as his dim side-kick, are genuinely funny villains. The blending together of animated Elliot and the living, breathing actors is very good - especially for 1977 - though in a shipwreck sequence near the end the special effects are utterly dreadful. Kids will find a lot to like in Pete's Dragon as long as they can sit still for over 2 hours, and adults too will find pleasures along the way. It's certainly one of the better live-action offerings to come from the Disney studio at a time when their output was quite indifferent in quality.",
         "\"Pete's Dragon\" is an enchanting Disney tale that combines live-action and animation. The dragon is the only animated character, but that doesn't change the fact that this is a perfect combination of live-action and animation. This is definitely one of the best live-action movies produced by Disney. One of my favorites. It's cute and charming. It looks dated, but that's not a major flaw. Actually, that's part of its charm (which is timeless). There are plenty of beautiful vistas: a lighthouse, mountains, green places, the endless sea and more. Passamaquoddy is a strange name, but the village is nice. The dragon Elliott is cute and lovable. He almost resembles Puff the Magic Dragon and has a funny way to communicate. His sounds are awesome. Elliott is a good and innocent dragon, but big and clumsy. Pete is a cute and lovable kid. I enjoy his friendship with the animated dragon. There is a nice cast in the film. Sean Marshall is excellent as Pete - he is a very underrated former child actor. Helen Reddy is great as Nora. Mickey Rooney is funny as the silly but comical Lampie. Jim Dale is priceless as Doc Terminus. Red Buttons is very convincing as Doc Terminus's sidekick Hoagy. Shelley Winters plays well her role (the wicked Lena Gogan, the leader of the Gogans). This is an underrated film. Yet, it's a nice old-fashioned one. And nostalgic too because it's a reminder of other times and also of my own childhood. There are some cheesy moments, but nothing too serious or enough to ruin the movie. One of the few things I don't like about this movie is Pete's teacher. She is so mean, even more when she does that corporal punishment thing to Pete. Hoagy is one of my favorite characters. I don't consider him a villain. He's not a bad guy, he's just a poor devil who chose the wrong friend. He is hilarious even in his name. I don't know why, but 'Hoagy' sounds funny to my ears. Classic humor is another solid point of this movie. Many of Doc Terminus's lines are funny, as well as the fact that he never says \"Passamaquoddy\" correctly. About the songs, I like most of them very much. My personal favorites are \"Brazzle Dazzle Day\", \"It's not easy\", \"Candle on the Water\", \"Boo Bop Bopbop Bop (I love you, too)\", \"There's Room for Everyone\" and \"Bill of Sale\". These songs are great. Timeless classics. This motion picture is one among many examples of great underrated films. Many times I get more surprised with a less popular and less appreciated film than with one of those films that most everybody loves. It doesn't always happen, but most of the universally loved films end up being overrated and turn out to be disappointing because we create too much expectations on them, while a not so known and valued movie I may not expect that much from it but turns out to be a pleasant surprise. That only makes me respect and admire these less valued movies even more. This should definitely be on Top 250.",
         "This is one of the best musicals of all time, right up there with The Sound of Music. Yes, I have a lot of nostalgia as I had this on Betamax growing up and wore it out... but now I'm watching it with my own kids and they love it just like I did. This movie holds up and translates well to all generations. The songs are fantastic, but my least favorite is the one it may be most known for (Candle on the water). Lampie... Doc Terminus... they're all just really, really good performances of well written songs. It has everything a musical needs. Great acting, great singing, great choreography, great story, and a lot of heart. The live action/animation is really good for the time, so there's no reason to get hung up on that. Plus Elliot is awesome. I honestly can't understand how this is under 9 stars.",
         "\"Pete's Dragon\" is not the last Disney classic combining live-action and animation (although the dragon is really the only cartoon in it), but it's one of the last in the traditional sense. That is why it looks older than it really is. It's from 1977 but in many ways it looks like something from the 60's or even the 50's. This means that even in 1977 it already looked dated, an impression that is even stronger considering \"galactic\" movies like '2001: A Space Odyssey', 'Star Wars' and 'Close Encounters of the Third Kind' and \"galactic\" TV series such as 'Star Trek' and 'Battlestar Gallactica'. But the dated style for its time isn't really a fault. It's just temperament. Actually, \"Pete's Dragon\" has a charm of its own. It's a timeless classic. This was one of my childhood films. Settings are authentic and owners of a great and natural beauty. I wonder if Passamaquoddy exists for real. Nevertheless, Passamaquoddy is one heck of a name. Not as difficult to spell as \"Supercalifragilisticexpialidocious\" (and by no means as difficult as to say it backwards, which is \"dociousaliexpiisticfragicalirupus\" but that's going a bit too far, don't you think?), yet still a little difficult to pronounce at first. Takes its time to learn how to pronounce. But it's not as hard to spell as Doc Terminus wants to make us believe (ha ha ha). The dragon Elliott is cute and very friendly and sweet. If he was real, he'd make a wonderful pet. The kid is cute. What ever happened to Sean Marshall? He was both a very talented actor and a gifted singer. In other words, he was an authentic actor and singed like an angel. Speaking of music, this movie has immensely charming songs. \"Candle on the Water\" is soft and very relaxing. \"It's Not Easy\" is very touching and beautiful. \"Boo Bop Bop Bop Bop (I Love You, Too)\" is quite cute. \"Brazzle Dazzle Day\" is a feel-good and very optimistic song. \"There's Room for Everyone\" is another wonderful and nostalgic song. \"Bill of Sale\" has a different nature than all the songs previously mentioned, but it's just as great and memorable. Jim Dale is hilarious as the sly as a fox and corrupt Dr. Terminus and Red Buttons is priceless as his follower Hoagy. Hoagy is the typical Disney follower of a villain: mostly harmless, not truly evil or threatening, just a poor guy who made the wrong friend. That's real acting in both cases! Charlie Callas makes very well Elliott's sounds. Helen Reddy and Mickey Rooney are great too. The actors who portray the Gogans are quite convincing in their roles. The Gogans are dirty and creepy, they aren't nice and likable people, but there are moments when they're funny. Pete's teacher isn't a nice and likable person either, but the actress convinces in her portrayal. Title in Portugal: 'Meu Amigo o Dragão'.",
         "Endearing animated monster movie about a lively dragon and his little friend . The story takes place in Maine circa 1908 , the starring are an orphaned 9-years-old boy named Pete (Sean Marshall) and his sympathetic dragon Elliot . Freckly Pete flee the overbearing foster Gogan family (Shelley Winters , Charles Tyner), who all utilize him as a slave instead of a kind child. When Pete can successfully escape from them with his protective dragon , his only friend , that only can see , then they stumble into the town of Passamaquaddy- an ocean front dock town plenty of fishermen, drunks and rare people . Pete's arrival does not fit well with the townsfolk , as his pale green dragon Elliott accidentally causes town destruction and rioting among the school teacher , the Mayor (Jim Backus) , the citizens , among others . Expecting to be an outcast yet again, Pete is cared by the loved Nora (Helen Reddy) who lives in a lighthouse with her daddy Lampy (Mickey Rooney ). And when a phony con disguising as a Dr. Terminus (Jim Dale) and his pal (Red Buttons) arrive in the little town , they see Elliott the Dragon as the ultimate profit to his fortune and money. Enjoyable story that mingles animation with live action . This is a likable sort of a kiddies' adaptation of ¨Harvey¨ and another attempt for repeat the Mary Poppins magic . The dragon Elliott steals the show , as itself grins, grunts and botchers around.The primitive but efficient animation is by Don Bluth who subsequently would direct successes as Nimh , Anastasia and Titan A.E. .Colorful and evocative cinematography by cameraman Frank Philips . Agreeable choreography and beautiful songs and musical score by Irwin Kostal. The motion picture is professionally directed by Don Chaffey (Jason and the Argonauts, Lassie , million years B.C ).The children will get a kick out of this Disney musical . Rating : Acceptable and passable.",
         "I saw this movie when I was a little kid and my older siblings before me. I can remember every detail and every character and every song! Brazzel dazzle day, There's room for everyone, candle on the water, its not easy... all songs that I remember word for word! I love this movie! Great for any age! My sisters and I always quote this movie. We go back and forth singing \"We've got a bill of sale right here!\" and every other song. This movie isn't just a kids movie. My sisters are in their 20's and I am 18 and we all watch it still! Granted the acting wasn't the best but come on it was made in 1977! And even for a 70's movie it was awesome and completely unforgettable!",
         "Disney's combo live action and animation fare didn't just end over at \"Mary Poppins.\" No, no; it lived on with \"Pete's Dragon\" from 1977!!!!! It's a nice little film about an orphan who finds a nice, magical dragon. From that point onward, it's a grand old big adventure!!!!! Very nice, indeed! What I like about this film: This is another one of Disney's real/hand-drawn films, and like \"Mary Poppins,\" this movie is wonderful. Seeing this really brought a smile to my face, and that is wonderful also for anyone who watches this movie. This is great Disney fun; no bad stuff, and always 100% G-rated!!!!! \"Pete's Dragon\" is a great movie for people ages 3 to 103. Don't miss it!!!!! 10/10",
         "For 1975 this children's classic is absolutely magnificent. Beautifully cast - masterful songs - brilliant color and scenery. Disney couldn't have produced a more memorable, masterful musical than this one. Mickey Rooney gives a fine, stunning performance as the comical, drunken 'Lampie' and is alloted full use of his veteran musical talents in 'I saw a dragon' - tripping about the saloon after a chance encounter with \"Elliott\". Helen Reddy is dandy as 'Nora', the unmarried daughter. And Jim Dale and Red Buttons are at their comical genius best as 'Dr. Terminus' and 'Hoagie' - especially in their performance of 'Every Little Piece', which I countered in connection with an off-Broadway musical style quality - of which the song could also garner a Tony. The Gogan's - I felt, almost stole the show - next to Elliott-the dragon. Their memorable hillbilly opener \"happiest home in these hills\" was brilliantly choreographed & performed. And actor Conaway is still remembered all these years later (outside 'Kenicki' in GREASE) as one of the bumbling, hillbilly brothers. I proudly own my own DVD copy, the org. vinyl, and my new CD. Sadly, Disney doesn't produce high-quality action-animation like this classic much more these days. Which makes appreciating this film as a work of art. PEANUT",
         "Pete is a small boy running away from slavery with an abusive hillbilly family who have \"bought\" him. He falls in with an invisible dragon and a lighthouse keeper and his daughter, and assorted good and bad things happen. This Disney offering is one of the more forgotten live action movies despite the fact that it has quite a lot going for it. It is colourful, daft, has a good moral heart, some excellent villains, decent songs, and decent effects (both physical effects and traditional animation). The performances are all good, with Helen Reddy doing well in her only movie lead role, and young Sean Marshall's sincerity outweighing his winsome cuteness. This is still a good family film."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "In New England in the early 20th century, Pete is a nine-year-old orphan escaping from his brutal adoptive parents, the Gogans, with his only friend, a cartoon dragon named Elliott. They successfully escape to Passamaquoddy, Maine, and live with Nora, a lighthouse keeper, and her father, Lampie. Elliott is sought for medicinal purposes by the corrupt Dr. Terminus.",
         "A young troubled boy named Pete and his guardian dragon Elliott elude the abusive Gogan family, who uses him as a slave instead of a loved child. When he can successfully run away from them with Elliott, he stumbles into the town of Passamaquaddy - an ocean front harbor town filled with superstitious fishermen, drunken hooligans, and wary townsfolk. His arrival does not mix well with the citizens, as Elliott accidentally causes town rioting and gossip among the town drunks about him. Expecting to be an outcast yet again, Pete is taken in by the kind Nora who lives in a lighthouse with her father Lampie. While Pete bonds with them, the townsfolk have not lowered their guards and suspicions about Elliott. And when Dr. Terminus arrives, a phony con artist posing as a doctor, he sees Elliott as the ultimate profit to his fame. With Passamaquaddy filled with superstition, greed, and lack of imagination, life will not be easy before the town can ever believe Elliott.",
         "An orphan boy and his magical dragon come to town with his abusive adoptive parents in pursuit."
      ],
      "budget": 10000000
   },
   "movielensId": 1030,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-11-03",
      "dvdReleaseDate": "2003-08-07",
      "directors": ["Don Chaffey"],
      "runtime": 128,
      "movieId": 1030,
      "title": "Pete's Dragon",
      "mpaa": "G",
      "actors": [
         "Sean Marshall",
         "Helen Reddy",
         "Mickey Rooney",
         "Red Buttons",
         "Jim Dale",
         "Peter Ustinov",
         "Shelley Winters",
         "Stefanie Powers",
         "Terry-Thomas",
         "Jane Kean",
         "Jim Backus",
         "Charles Tyner",
         "Gary Morgan",
         "Jeff Conaway",
         "Cal Bartlett",
         "Charlie Callas",
         "Walter Barnes"
      ],
      "imdbMovieId": "0076538",
      "originalTitle": "Pete's Dragon",
      "genres": [
         "Fantasy",
         "Animation",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [
         "xFQWRwpG6J0",
         "IgAdReKX5t0",
         "vUW0a_I3kxU"
      ],
      "plotSummary": "Pete, a young orphan, runs away to a Maine fishing town with his best friend a lovable, sometimes invisible dragon named Elliott! When they are taken in by a kind lighthouse keeper, Nora, and her father, Elliott's prank playing lands them in big trouble. Then, when crooked salesmen try to capture Elliott for their own gain, Pete must attempt a daring rescue.",
      "tmdbMovieId": 11114,
      "avgRating": 3.08946,
      "releaseYear": "1977",
      "numRatings": 3538,
      "posterPath": "/cgkzUzFVFdTnHpAuazP5JCeJpzg.jpg"
   }
}