{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "flying",
            "id": 334
         },
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "broom",
            "id": 3872
         }
      ],
      "imdb_id": "tt0066817",
      "video": false,
      "title": "Bedknobs and Broomsticks",
      "recommendations": [
         11708,
         11114,
         4978,
         11135,
         756,
         12233,
         11319,
         14136,
         433,
         11704,
         9078,
         10837,
         9994,
         10380,
         11360,
         8989,
         13225,
         15139,
         10693,
         12154
      ],
      "backdrop_path": "/ttOa1qlKCNLYJgdpsiDrVva9VOJ.jpg",
      "revenue": 17900000,
      "reviews": [{
         "author": "Gimly",
         "id": "5aae36c9c3a36846d5021402",
         "content": "When I was younger, I used to spend a lot of my life alone in a studio with one of those tiny little 15cm TVs you wouldn't be caught dead with nowadays, plugged in to a VCR player, and exactly three movies on VHS. One of those three movies (the best of those three) was _Bedknobs and Broomsticks_. I watched it multiple times a day, every day, for months at a time. A period piece musical that saw orphans and their witch-friend get an army of sentient suits of armour to fight the Nazis... Is it any bloody wonder I turned out the way I did?\r\n\r\nGreat movie though. Wouldn't kill me to see a remake with modern technology. So long as it kept the vibe and setting of the original.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._",
         "url": "https://www.themoviedb.org/review/5aae36c9c3a36846d5021402"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Miss Price",
               "gender": 1,
               "credit_id": "52fe44db9251416c75043667",
               "name": "Angela Lansbury",
               "profile_path": "/nMy8sPPLf8fjSglFLP3IzIGbjly.jpg",
               "id": 14730,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Emelius",
               "gender": 2,
               "credit_id": "52fe44db9251416c7504366b",
               "name": "David Tomlinson",
               "profile_path": "/1QJLJtcJ4x8DQFflrbd2144ZzLg.jpg",
               "id": 5825,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mr. Jelk",
               "gender": 2,
               "credit_id": "52fe44db9251416c7504366f",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bookman",
               "gender": 2,
               "credit_id": "52fe44db9251416c75043673",
               "name": "Sam Jaffe",
               "profile_path": "/drxy1JkTOjhUhQnrFnepTmSHELd.jpg",
               "id": 10024,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Col. Heller",
               "gender": 2,
               "credit_id": "52fe44dc9251416c750436a7",
               "name": "John Ericson",
               "profile_path": "/cOrRIIJyxHev6Oy0sVxVbQFxyN0.jpg",
               "id": 41231,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Swinburne",
               "gender": 2,
               "credit_id": "52fe44dc9251416c750436ab",
               "name": "Bruce Forsyth",
               "profile_path": "/bfY4lDlGY6cF4BEhpHf0VtCHu4v.jpg",
               "id": 210620,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Carrie",
               "gender": 0,
               "credit_id": "52fe44dc9251416c750436af",
               "name": "Cindy O'Callaghan",
               "profile_path": "/uVkM0nMtnx23Ul1IZCjJVnhDRLt.jpg",
               "id": 233563,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe44dc9251416c750436b3",
               "name": "Roy Snart",
               "profile_path": null,
               "id": 1031274,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Charlie",
               "gender": 0,
               "credit_id": "52fe44dc9251416c750436b7",
               "name": "Ian Weighill",
               "profile_path": "/kngt6OqJVZdpYKSx3sPPEZtcFly.jpg",
               "id": 1073801,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Mrs. Hobday",
               "gender": 1,
               "credit_id": "52fe44dc9251416c750436bb",
               "name": "Tessie O'Shea",
               "profile_path": null,
               "id": 123904,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Capt. Greer",
               "gender": 0,
               "credit_id": "52fe44dc9251416c750436bf",
               "name": "Arthur Gould-Porter",
               "profile_path": "/amBzwBjb80cFqhaymgtsnFNvqRN.jpg",
               "id": 153688,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Portobello Rd. Workman",
               "gender": 2,
               "credit_id": "52fe44dc9251416c750436c3",
               "name": "Ben Wrigley",
               "profile_path": null,
               "id": 956544,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Gen. Teagler",
               "gender": 2,
               "credit_id": "52fe44dc9251416c750436c7",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Elderly Farmer",
               "gender": 2,
               "credit_id": "52fe44dc9251416c750436cb",
               "name": "Cyril Delevanti",
               "profile_path": "/ldqsp9NS3cbTQfQvp6JJ5WgTWxA.jpg",
               "id": 88906,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "German Sergeant",
               "gender": 2,
               "credit_id": "52fe44dc9251416c750436cf",
               "name": "Rick Traeger",
               "profile_path": null,
               "id": 165473,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44db9251416c75043679",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44db9251416c7504367f",
               "name": "Bill Walsh",
               "profile_path": null,
               "id": 5836,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44db9251416c75043685",
               "name": "Don DaGradi",
               "profile_path": "/umaANl0jfZwnytLvyJetUPXHFkK.jpg",
               "id": 5837,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44db9251416c7504368b",
               "name": "Mary Norton",
               "profile_path": null,
               "id": 27814,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dc9251416c75043691",
               "name": "Bill Walsh",
               "profile_path": null,
               "id": 5836,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dc9251416c75043697",
               "name": "Frank V. Phillips",
               "profile_path": null,
               "id": 58007,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dc9251416c7504369d",
               "name": "Cotton Warburton",
               "profile_path": null,
               "id": 5841,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dc9251416c750436a3",
               "name": "Irwin Kostal",
               "profile_path": null,
               "id": 68137,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "565a1560c3a3680ac7000d88",
               "name": "Ward Kimball",
               "profile_path": "/vWJedE2eQW8bQdzG9wggipQvG4V.jpg",
               "id": 109453,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 2,
               "credit_id": "565a199892514161b4000d19",
               "name": "Milt Kahl",
               "profile_path": "/olKWgwkVShdJnRJRZ4Po6uK0iq6.jpg",
               "id": 138170,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 10.330723,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12335,
      "vote_count": 340,
      "budget": 20000000,
      "overview": "Three children evacuated from London during World War II are forced to stay with an eccentric spinster (Eglantine Price). The children's initial fears disappear when they find out she is in fact a trainee witch.",
      "similar": [
         5925,
         637,
         1771,
         14574,
         423,
         424,
         228150,
         16859,
         4935,
         671,
         672,
         673,
         675,
         767,
         369885,
         16869,
         853,
         2253,
         289,
         613
      ],
      "original_title": "Bedknobs and Broomsticks",
      "runtime": 117,
      "poster_path": "/1mWFExXAlUSgfBKGkK3mjH1iXk4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1971-10-07",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "You'll beWITCHED! You'll beDAZZLED! You'll be swept into a world of enchantment BEYOND ANYTHING BEFORE!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Stevenson"],
      "runtime": 89,
      "synopsis": "Bedknobs and Broomsticks The movie is mainly set in a small South Coast English village, Pepperinge Eye, during World War II: an elderly farmer (Cyril Delevanti) is painting out the sign-posts, the Home Guard are exercising, led by General Sir Brian Teagler (Reginald Owen) and Captain Aisley Greer (Arthur Gould-Porter), and Mrs. Hobday (Tessie OShea) is allocating homes to children whom have been evacuated from London (sent to the countryside away from the risk of bombing raids). The three Rawlings children, Charlie (Ian Weighill), Carrie (Cindy OCallaghan) and Paul (Roy Smart) are reluctantly taken in by Miss Eglantine Price (Angela Lansbury). The children are also unhappy, not least at Miss Price's vegetarian lifestyle, and plan to run back to London, but unexpectedly discover, through her attempts to fly on a broomstick, that Miss Price is a trainee witch, complete with black cat (\"Cosmic Creepers\") and fully fitted magical laboratory (\"poisoned dragons liver\"); and to ensure their silence about this, she presents Paul, the youngest, with a magical bed-knob with which he can cause the bed to travel anywhere. Miss Price is eagerly awaiting the last installment of her magic correspondence course from 'Professor' Emelius Browne (David Tomlinson) of the College of Witchcraft and Wizardry, and is very disappointed when it fails to arrive, the College having closed. Using the bed (song: 'Age of Not Believing'), she and the children visit Mr. Browne in London, where he is revealed as a somewhat shady stage-magician turned street-vendor selling magic tricks: he takes Miss Price and the children to his home, a mansion abandoned because of an unexploded bomb in the front garden, where the children play in the nursery and he, astounded that Miss Price can actually perform genuine magic, firstly tries to induce her to form a magic variety act with him (song: 'Eglantine'), and then (after being briefly turned into a white rabbit by Miss Price to force him to be sensible) reveals that he copied all the spells used in his correspondence course from an old book, 'The Spells of Astaroth', of which, however, he only possesses the first half, without the \"substitutiary locomotion\" spell so desired by Miss Price. Mr. Browne decides the other half of the book is likely to be found in the Portobello Road street-market, so all go there the following day to search for the book, meeting amongst others an old-book-seller (Ben Wrigley). After an extensive song-and-dance-number (song: 'Portobello Road', featuring representatives of many nations which were part of the Allied WWII forces, including Scots, Indians and Jamaicans), as the market is closing, Browne is approached by the sinister 'spiv' Swinburne (Bruce Forsyth) who takes him (and the children and Miss Price, and the bed) to The Bookman (Sam Jaffe) who possesses the other half of the book, but this also does not contain the spell. It is revealed that the spell is actually inscribed on the 'Star of Astaroth', now in the possession of magically enhanced and now human-like animals, formerly owned by the sorcerer Astaroth, on the Isle of Naboombu. Paul, who has taken a comic-book about the Isle of Naboombu from the nursery, now activates the bed-knob to take Mr. Browne, Miss Price, and the three children there. (The following section of the movie, on Naboombu, is animation with live-action from these five individuals). Arriving at the Isle of Naboombu, the bed and its occupants falls into the lagoon, where it is washed into a sunken ship, the Beautiful Briny Ballroom where the fish are dancing: Mr. Browne and Miss Price join in (song: 'Beautiful Briny Sea'), and win the prize of a gold cup, but then all the fish disperse on seeing a fish-hook descend, which catches on the bed and draws it and the humans to the surface. There they meet a talking bear, who takes them to meet the King's secretary (a secretary bird): the King (a lion) is in a dreadful rage because there is no-one to referee his football match. Mr. Browne volunteers. The football match, between the King's team, the 'Dirty Yellows' (lion, hyena, gorilla, warthog, crocodile, rhinoceros), and the 'True Blues' (ostrich, elephant, cheetah, hippopotamus, kangaroo - yes, there are more players on the King's side) then takes place, the King scoring the winning goal, and Mr. Browne getting thoroughly beaten up, although not fatally injured, to the disappointment of the medical staff (vultures). After the match Mr. Browne pulls the \"gypsy switch\" on the King, substituting his referee's whistle for the Star of Astaroth round the King's neck: the humans then leave (pursued by the King as soon as he realizes what has occurred). Back in Pepperinge Eye, Miss Price tries to read the Star, but as it has come from another world, it has evaporated: however Paul finds the five magic words of the substitutiary locomotion spell on a picture of the Star in his comic-book. Miss Price tries out the spell, which animates clothing, with initially uncontrolled effect (also affecting the hat of the local curate, Mr. Jelk (Roddy McDowall): song: 'Substitutiary Locomotion'). Mrs. Hobday arrives to inform Miss Price that alternative accommodation has been found for the children - which saddens them. Mr. Browne also decides he should return to London, and goes to the station to await the milk-train. However, a troop of German soldiers under the command of Colonel Heller (John Ericson) have landed from a U-boat (submarine) on a raid, and take over Miss Price's cottage for their headquarters. She and the children are taken to the local castle, now a museum, and locked in: they are joined by Mr. Browne, who has also spotted the Germans and managed to turn himself into a white rabbit in order to enter. Using the substitutiary locomotion spell, Miss Price animates the entire contents of the museum, some hundreds of costumes of Vikings, Knights, Cavaliers, Hussars etc., plus drums, trumpets and a trio of bagpipe players, and launches these against the Germans, herself directing them from her broomstick. The Germans, including their sergeant (Rick Traeger) are driven with numerous comic effects back to the U-Boat, although they have left explosives which destroy Miss Price's magical laboratory. Miss Price is injured, at which the whole substitutiary locomotion activated army collapses. The Home Guard arrive to see the Germans leaving, and to claim the victory. The movie ends with the children remaining with Miss Price, and Mr. Browne joining the army, escorted by the Home Guard (song: 'Old Home Guard').",
      "writers": [
         "Ralph Wright",
         "Ted Berman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066817/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4ODYwMDgwMl5BMl5BanBnXkFtZTgwMDkwNDUzMzE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Angela Lansbury, David Tomlinson, Roddy McDowall | See full cast and crew »"],
      "reviews": [
         "It is unfortunate that this film receives such little comment, as compared to \"Mary Poppins\", for the simple fact that most people DO compare it to \"Mary Poppins\" amd really, it stands alone. The story is quite original and well done. The actors are all wonderful, and Angela Lansbury, to me, will always be Miss Price. David Tomlinson is also wonderful as Professor Browne. The children are also great, with the standout being the youngest one, Paul. He has so many funny moments in this movie. Again, the Sherman Brothers lend their creative song-writing talents to this film with excellent results. \"The Age of Not Believing\" is wonderful, as is \"Eglantine\", \"The Beautiful Briny\" and the superb \"Portobello Road\" number. The animation scenes are also great and imaginative. This is certainly an enjoyable film on many counts, and should be remembered just as so many of the other Disney classics. It should also be seen in the recently restored version, which runs over two hours. The story is more fluent in that version, and the songs are intact, for the most part. A great movie.",
         "This is one of the few films where I consider the film rendition to be an improvement on the original book. The story is clear, accessible, amusing and interesting and the musical numbers are without a doubt exceptional. I adored the cyclical rendition of 'The old home guard' and the charming 'Portobello Road', a great combination of early animation + real actors techniques which, though dated do not detract from the charm of the piece. The background of the Second World War worked well and was not omitted as the film got under way, which so often happens in 'evacuee' stories. An often far too underrated film, it produces no end to enjoyment for people of all ages. The performances from the actors are exceptionally well done and the entire text is neatly tied together and well designed. Guaranteed to put a smile on your face!",
         "Bedknobs and Broomsticks is one of many movies that has always been with me, in my heart and memory from the time that I was old enough to focus my eyes on a television screen. Although it was already an \"old\" movie by the time I was able to watch it, Bedknobs and Broomsticks completely enchanted me. People here who say that the movie would not hold the attention of a young child are mistaken. I must have watched this movie dozens of times between the ages of 1 and 10 and every time I watched it all the way though, intensely engrossed through every scene. There are a handful of movies that hold very fond places in my childhood memories, this is one of them. It is a wonderful movie, and even now I still find the story charming. Angela Lansbury stars as Miss Price, a widow who is studying witchcraft through a correspondence course during World War II. She grumpily agrees to let three children board at her home in the country to keep them safe from the air raids going on in London. After the three children discover that Miss Price is an apprentice witch, they are swept up into a magical adventure on a traveling bed along with Miss Price and Professor Brown, the headmaster of the College of Witchcraft. The thing I like best about this movie, is that the magic never stops as the children along with the two adults journey to London, the Island of Naboomboo, Naboomboo Lagoon and Portabello Road. The children are treated to a marvelous adventure, flying through the skies on a bed, swimming underwater in a tropical lagoon, watching a football game played by animals and finally helping out in the war when Miss Price enchants a museum full of ancient suits of armor with the magic words, \"Traguna, Macoities, Tracorum Satis De.\" The songs in the movie may be your typical musical-stock, but I challenge anyone to not tap their toes during \"Portabello Road\", or to not get \"Englentine\" stuck in their head. They just add another element of fun and enjoyment to an already delightful movie. The movie is well worth watching, and suitable for any child. Even today's children will find delight in the cartoon/human relations and the spectacular ending sequence were empty suits of armor are brought to life to fight for the good guys. I consider this movie a timeless classic that shouldn't be passed up.",
         "I saw this film many years ago and I thought it was pure magic. It was a lovely film full of escapism which could be enjoyed by kids and adults alike. The performances throughout the film by it's actors and actresses are magnificent. The songs are great and the special effects are lovely for it's time. The story is a beautiful one. I love films like this and I last watched this film around 1986. As I said earlier, it is pure escapism-one of those beautiful films which whisks you away from real life problems into a lovely fantasy world. It is pure brilliance. I would recommend this film to anyone but particularly to young children born after it was released-even today in 2002 it can be enjoyed.",
         "I loved this masterpiece and quite frankly I, too found Mary Poppins (although I love Julie Andrews and Dick VanDyke) to be silly and sacrine-sweet. Angela Lansbury plays her character to perfection and I don't know why people think of this film as distorted. It was magical and it was lots of fun to watch. Every scene held a certain charm as you got to know the characters better. You truly see how this little thrown together family learn to bond with each other, despite their age and differences. I thought the characters were well developed, especially Charles who was at \"The Age of not Believing\". Mary Poppins may be more popular and cherished by others but this little gem will be the one that I will always love and cherish.",
         "Set during WWII, Bedknobs and Broomsticks is a fun-filled fantasy adventure for kids, starring Angela Lansbury as an apprentice witch who, with the help of three evacuee children and a 'Professor of Witchcraft', thwarts a Nazi invasion. Brilliantly inventive, with loads of laughs, this movie will delight kids of all ages with its great characters, exciting story and catchy tunes. Lansbury is perfect as Eglantine, the not-quite-perfect witch who takes the three children on the adventure of a lifetime, and her three young co-stars (Cindy O'Callaghan, Roy Snart and Ian Weighill) are equally impressive as the Cockney rascals who aid in battling the nasty Hun. The special effects are somewhat dated, but let's face it, kids don't care too much about these things, so long as they are entertained. And entertained, they will be. With some impressive scenes which brilliantly mix live action and animation to great effect, and more genuine movie magic than a hundred Harry Potters, it would be hard not to enjoy this wonderful slice of cinematic escapism. In fact, only a rather drawn-out musical number set in Portobello Road mars the film's perfection, but with so much else to enjoy, that can easily be forgiven. And besides, any film featuring UK television legend Bruce Forsyth as a 'Flash' Harry style spiv is guaranteed a good rating from me.",
         "This Disney piece has its great strengths in casting the great Angela Lansbury as apprentice witch Eglantine Price, in teaming live action with cartoon, and in some enjoyable special effects. The songs, by the Shermans, are in the main memorable - 'The Age of Not Believing', 'Portobello Road', 'Eglantine', and 'The Beautiful Briny'. Sterling support from David Tomlinson (who was also Mr Banks in 'Mary Poppins') and a trio of Cockney kids round off the movie. Miss Price - who has a scene-stealing cat who can put across disdain and embarrassment better than any human! - finds that the 'spells' she has received from Mr Brown's college of witchcraft actually work, much to his amazement when she speeds down to London to tell him so (on a bed, naturally - that's where 'The Age of Not Believing' comes in with great charm). She takes in Charlie, Carrie and cute little Paul as evacuees and win them over with her magic dabbling. Her goal is to find the spell for locomotion and this takes them to the evocative flea market of Portobello Road and on to the magical island where the cartoon part of the movie kicks in. The cartoons are inventive as always, although lacking the quality of the studio when Disney himself was in charge - there's a ballroom where the fish dance in various styles to a swing band and some jazzy singers (and are upstaged by the live action adults who win the dancing cup); then there is a great football match between creatures like hippos, elephants, ostriches, and the like with hapless Mr Brown as the referee. Special effects come into their own when inaminate objects start to have a life of their own (shades of 'Mary Poppins'), especially in the final sequences where an ancient army of knights and heralds take on the Nazis. 'Bedknobs and Broomsticks' drags at times but when it is in full flow, it is a lot of fun. Highly recommended for kids of all ages, and all those Disney devotees out there.",
         "What can i say about a tale such as this? This magical tale has followed me from my early childhood,evoking warm memories in my heart.The characters take you to to so many whimsical places making you want more of each scene. For example in the market there were so many different flavors of lore. I loved the exotic dancers that accompanied the steel drums. The story line was wonderful.I wanted so badly for Landsbury to decide to keep the precocious children and for her to also stay with Mr.Brown,and find the other half of the spell so that the men less armor could win the war. I am still a child inside,and this movie appeals to my inner child like no other. This movie is my definite favorite of all times. I hope that all children will be able to watch this classic and be swept away,and transported into another time.",
         "Bedknobs and Broomsticks is often compared to Mary Poppins and rightfully so as both films have a similar story line. A magical nanny is sent to look after children, both have the same leading protagonist (David Tomlinson,) both feature live film and animation, with songs by the Sherman brothers, and both came out of the Walt Disney studio. Bedknobs and Broomsticks involves an apprentice witch who wants to complete her correspondence course in beginning witchcraft, but to do this, she has to search for a magical spell called Subsitutiary Locomotion which will complete her training. The story involves Angela Lansbury, playing the witch, who flies on a magical bed with Tomlinson and her three caretakers, to an animated land attempting to retrieve the spell. In addition, the film is set in World War II, where a mixture of live Nazi's and animated creatures both try to help and hinder Lansbury, Tomlinson, and the children on their adventures. The five characters control the bed through a magical bedknob that transports them from a reality world to a fantasy world and back again. Years ago, I had a record that had the Songs From Bedknobs and Broomsticks on it and loved it! However, when I saw the film on Turner Classic Movies and later researched it, sadly I learned that this film, which could have been a classic, suffers badly because of editing and failed restoration work. The original release of the film played in limited areas and ran about two and a half hours. Disney decided to make its first cuts to the film several months later when it went into wide release. The wide release version is what I saw on Turner Classic Movies. While this film was trimmed by over twenty minutes, most likely to cater to the shorter attention spans of children at the time of wide release, you can easily spot the edits. The Eglantine number is shortened, only a few words of With a Flair remain, The Old Home Guard seems to start in the middle of the second verse of the song, and the wonderful perhaps best song in the film \"A Step in The Right Direction\" is not there. However, you can hear the instances of the instrumental on the soundtrack. In 1979, the film was re-released again and ludicrously cut even more to about ninety five minutes. For years this is what was played on Standard Cable and Broadcast TV. Only two songs remain in this version. In 1996, Disney attempted to reconstruct the film, but were successful only in spots. About twenty minutes of footage was found and added back into the movie. However, the song \"A Step in the Right Direction\" was mysteriously not found and remains \"Lost.\" The audio track for the song was recovered, and you can hear this on the Special Edition DVD, with still shots from the film showing what the scenes looked like as the song was song. However, the discarded footage soundtrack was not recoverable, because it had been damaged or lost. Many actors were too old or had passed away and could not re-do their speaking and singing parts, so Disney had to hire extras to dub their voices over the restored footage. The dubbing is horribly bad, especially for the voice-over of one of the children, Charlie, and the voice-over for David Tomlinson, sounds nothing like him! You would think Disney could have at least found actors with voices that resembled the tones, accents, and pitches of the original dialog. It is great that several songs were recovered, but without \"Step in the Right Direction,\" restored back to the film, which is such an uplifting and encouraging song, and the terrible dubbing, the film will be a mixed bag. Why Disney cut \"Step in the Right Direction\" is criminal! I think Disney should have taken more time to look for it when they did the film restoration project for the 1996 DVD. What SHOULD have been shortened is the animated soccer match, which remains a sequence that does not help the film at all. The \"With A Flair\" song, as well as \"Eglantine\" are at their full lengths on the restored DVD, as is the Portobello Road dance sequence. However, some critics feel that the extended version of Portobello Road is too long. The restored DVD has a new song called \"Nobody's Problems For Me.\" My vote would be a choice of versions on a double-sided DVD for future release. Side 1 would contain the widespread DVD release that Turner Classic Movies plays. Side 2 would be the extended version, but WITH the originally undubbed dialog found and remastered with \"A Step in the Right Direction\" added in if it is ever found! The loss of \"Step in the Right Direction\" and the bad dubbing in the extended version hurts what could have been a great film. Bedknobs and Broomsticks has the important plot of searching for a missing spell. Tragically ironic that Disney took out bits and pieces of this film that may never be recovered. It is sad to think what this film could have been if the limited release had been LEFT ALONE!",
         "SPOILER ALERT!!!! I had just watched the extended version of Bedknobs and Broomsticks. Though I did like the extended version, I wish they would have left the original version on the DVD. The Portabello Road could have been cut down to the orginal length. It was too long and dragged the movie along. Though the dancing is great, would have been much better left on the DVD as a Deleted Scene. All in all this is a great movie. My 5 year old liked it. And it is wonderful that movies that I enjoyed as a child are being passed on to a new generation. This and Mary Poppins are added to my collection. Just as I had remembered! *** out of ****"
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "During WWII in England, Charlie, Carrie, and Paul Rawlins are sent to live with Eglantine Price, an apprentice witch. Charlie blackmails Miss Price that if he is to keep her practices a secret, she must give him something, so she takes a bedknob from her late father's bed and places the \"famous magic traveling spell\" on it, and only Paul can activate it. Their first journey is to a street in London where they meet Emelius Browne, headmaster of Miss Price's witchcraft training correspondence school. Miss Price tells him of a plan to find the magic words for a spell known as Substitutiary Locomotion, which brings inanimate objects to life. This spell will be her work for the war effort.",
         "London rascals Charlie Paul and Carrie are among a flood of kids evacuated to country villages, in their case Pepperinge Eye, where a lack of host families means they're assigned 'for now' to loner Eglantine Price. They discover she's an apprentice with by correspondence and promise to keep her secret only if allowed to join the fun, finding her not very gifted. Little Paul already mastered making the bed fly them anywhere by means of magical knob when the magic school is closed. Unwilling to miss out of the last chapter, \"substituary locomotion\", they track down founding professor Emelius to London's Portobello Street. He's a crook who never believed his spells would work, but eagerly joins the band in the hunt for the other half of the magic book he copied from but 'modernized'. It means flying to a magical animals Island, in search of the powerful start of sorcerer Astoroth. It's ti be put to use in the war effort, just in time as Germans land in the coastal town for a terror surprise mini-invasion, only to be fought off by a magical army.",
         "In August of 1940 in the English village of Pepperinge Eye, three cockney orphans are sent to live with Eglantine Price, who is studying to become an apprentice witch. When she receives a letter from the Correspondence College of Witchcraft in London, she and the children fly on a bed (by way of a magic bedknob) to London to meet the headmaster of the defunct school, Emelius Brown. At a townhouse where Mr. Brown is staying, Miss Price finds half of a book called THE SPELLS OF ASTOROTH. For the other half, they deal with a shady character known as the Bookman.",
         "An apprentice witch, three kids and a cynical conman search for the missing component to a magic spell useful to the defense of Britain."
      ],
      "budget": 20000000
   },
   "movielensId": 1031,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-10-07",
      "dvdReleaseDate": "2004-03-02",
      "directors": ["Robert Stevenson"],
      "runtime": 117,
      "movieId": 1031,
      "title": "Bedknobs and Broomsticks",
      "mpaa": "G",
      "actors": [
         "Angela Lansbury",
         "David Tomlinson",
         "Roddy McDowall",
         "Sam Jaffe",
         "John Ericson",
         "Bruce Forsyth",
         "Cindy O'Callaghan",
         "Roy Snart",
         "Ian Weighill",
         "Tessie O'Shea",
         "Arthur Gould-Porter",
         "Ben Wrigley",
         "Reginald Owen",
         "Cyril Delevanti",
         "Rick Traeger"
      ],
      "imdbMovieId": "0066817",
      "originalTitle": "Bedknobs and Broomsticks",
      "genres": [
         "Adventure",
         "Fantasy",
         "Animation",
         "Comedy",
         "Family",
         "Music"
      ],
      "youtubeTrailerIds": [
         "8xHM7TNxg3s",
         "C8YkeCNXBCU",
         "Yx2DBvmwul8",
         "x9W_gRWN6HM",
         "8dbi-fN3hJk"
      ],
      "plotSummary": "Three children evacuated from London during World War II are forced to stay with an eccentric spinster (Eglantine Price). The children's initial fears disappear when they find out she is in fact a trainee witch.",
      "tmdbMovieId": 12335,
      "avgRating": 3.33758,
      "releaseYear": "1971",
      "numRatings": 4981,
      "posterPath": "/1mWFExXAlUSgfBKGkK3mjH1iXk4.jpg"
   }
}