{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "attempt to escape",
            "id": 5034
         },
         {
            "name": "step father",
            "id": 6669
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "hitchhiker",
            "id": 11546
         }
      ],
      "imdb_id": "tt0116361",
      "video": false,
      "title": "Freeway",
      "recommendations": [
         9430,
         27607,
         16148,
         25284,
         20794,
         21309,
         9264,
         12520,
         18621,
         10668,
         9005,
         9303,
         9452,
         9434,
         9844,
         3515,
         18215,
         13715,
         476,
         39927
      ],
      "backdrop_path": "/tJE7l3VSyojurbz9CUTQrDqa96O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bob Wolverton",
               "gender": 2,
               "credit_id": "52fe44159251416c75028571",
               "name": "Kiefer Sutherland",
               "profile_path": "/4YvDfOfD4TgyzDkLGoq76g5BZNe.jpg",
               "id": 2628,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Vanessa Lutz",
               "gender": 1,
               "credit_id": "52fe44159251416c75028575",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Detective Mike Breer",
               "gender": 2,
               "credit_id": "52fe44159251416c75028579",
               "name": "Wolfgang Bodison",
               "profile_path": "/xiuvz3cncEwjfyPCT8BNm2KQ1Al.jpg",
               "id": 68672,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Detective Garnet Wallace",
               "gender": 2,
               "credit_id": "52fe44159251416c7502857d",
               "name": "Dan Hedaya",
               "profile_path": "/5E4SUVfLMUKNCiP0dMhyOv3XHVZ.jpg",
               "id": 6486,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ramona Lutz",
               "gender": 1,
               "credit_id": "52fe44159251416c75028581",
               "name": "Amanda Plummer",
               "profile_path": "/uICpVUj29yBcwCEGVZzE77FL98W.jpg",
               "id": 99,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mimi Wolverton",
               "gender": 1,
               "credit_id": "52fe44159251416c75028585",
               "name": "Brooke Shields",
               "profile_path": "/zOyzH2LjJ3CbzpiJcAmpsiC7d1O.jpg",
               "id": 15110,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Rhonda",
               "gender": 1,
               "credit_id": "52fe44169251416c750285bf",
               "name": "Brittany Murphy",
               "profile_path": "/jktbTmFE3TVaKUqPDWw8VZ5rXqc.jpg",
               "id": 328,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Chopper",
               "gender": 2,
               "credit_id": "52fe44169251416c750285c9",
               "name": "Bokeem Woodbine",
               "profile_path": "/OewCN9cV4xwvMwPwBw05kqKy2v.jpg",
               "id": 71913,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Flacco",
               "gender": 2,
               "credit_id": "52fe44169251416c750285cd",
               "name": "Guillermo Díaz",
               "profile_path": "/hnWjRRud2n2rDI6NbaeSIeEOMcP.jpg",
               "id": 8695,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Mesquita",
               "gender": 1,
               "credit_id": "52fe44169251416c750285d1",
               "name": "Alanna Ubach",
               "profile_path": "/g0GOzbSDAzhMxoCBNofiMxHIJJj.jpg",
               "id": 10402,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe44169251416c750285d5",
               "name": "Michael T. Weiss",
               "profile_path": "/ky7sNGtQVrB69ZzhziK68Jz4MPS.jpg",
               "id": 42722,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Lady Cop",
               "gender": 1,
               "credit_id": "52fe44169251416c750285d9",
               "name": "Annette Helde",
               "profile_path": null,
               "id": 167966,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Cop at Truckstop",
               "gender": 0,
               "credit_id": "52fe44169251416c750285dd",
               "name": "Ben Meyerson",
               "profile_path": "/lBbskjDtI3t8NVUUtP5sYRJRjQC.jpg",
               "id": 88525,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Sharon",
               "gender": 1,
               "credit_id": "563406f292514129fe0087d6",
               "name": "Tara Subkoff",
               "profile_path": "/qBbSymmytAOqgAGlll3sN5LXih3.jpg",
               "id": 61111,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Mrs. Sheets",
               "gender": 1,
               "credit_id": "5aa8d0f60e0a263dd0030782",
               "name": "Conchata Ferrell",
               "profile_path": "/p7KiBF2blE5KOXKrXMrVpMgCYZX.jpg",
               "id": 1909,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44159251416c7502858b",
               "name": "Matthew Bright",
               "profile_path": null,
               "id": 55117,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44159251416c75028591",
               "name": "Matthew Bright",
               "profile_path": null,
               "id": 55117,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44159251416c75028597",
               "name": "Dan Halsted",
               "profile_path": null,
               "id": 5379,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44159251416c7502859d",
               "name": "Chris Hanley",
               "profile_path": null,
               "id": 17231,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44159251416c750285a3",
               "name": "Richard Rutowski",
               "profile_path": null,
               "id": 3181,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44159251416c750285a9",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c750285af",
               "name": "Brad Wyman",
               "profile_path": "/7J6N93GqMLfbbaQcoRAENsUct5M.jpg",
               "id": 6887,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c750285b5",
               "name": "Danny Elfman",
               "profile_path": "/pWacZpYPos8io22nEiim7d3wp2j.jpg",
               "id": 531,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44169251416c750285bb",
               "name": "Maysie Hoy",
               "profile_path": null,
               "id": 48443,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c750285c5",
               "name": "John Thomas",
               "profile_path": null,
               "id": 58367,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.251546,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11229,
      "vote_count": 122,
      "budget": 3000000,
      "overview": "Following the arrest of her mother, Ramona, young Vanessa Lutz decides to go in search of her estranged grandmother. On the way, she is given a ride by school counselor Bob Wolverton. During the journey, Lutz begins to realize that Bob is the notorious I-5 Killer and manages to escape by shooting him several times. Wounded but still very much alive, Bob pursues Lutz across the state in this modern retelling of Little Red Riding Hood.",
      "similar": [
         483,
         5925,
         1701,
         431,
         1368,
         769,
         107846,
         339692,
         298312,
         398175,
         2142,
         5971,
         300665,
         3134,
         21950,
         10651,
         294963,
         9093,
         2749,
         1991
      ],
      "original_title": "Freeway",
      "runtime": 110,
      "poster_path": "/hcqW33lk6a1KOd0xLJA5uvEg6jU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "August Entertainment",
            "id": 3322,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Kushner-Locke Company",
            "id": 2499,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Multicom entertainment",
            "id": 30702,
            "origin_country": ""
         }
      ],
      "release_date": "1996-08-23",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": "/ysDeNGwgvTmdYuBF7njZ71bVIh4.jpg",
         "name": "Freeway Collection",
         "id": 355490,
         "poster_path": "/u5BhFwbnLg07R9VXlPeSxKT0FNR.jpg"
      },
      "tagline": "Her life is no fairy tale.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Matthew Bright"],
      "runtime": 110,
      "synopsis": "Vanessa Lutz (Reese Witherspoon) is a tough-minded, Deep South-accented, uneducated, illiterate 15-year-old who lives in a poor neighborhood ghetto in Los Angeles. She's currently living in a run-down motel room and being raised by her neglectful, drug-addicted mother, Ramona (Amanda Plummer), who supports them by collecting welfare and working as a prostitute. Ramona's current boyfriend, Larry (Michael T. Weiss) spends his days getting high by smoking crack and sexually abusing Vanessa. When the police bust Ramona for hooking on a nearby corner, they take Larry and Ramona away to prison and leave Vanessa with foster care as an option. When her social worker comes to take her away, Vanessa handcuffs her to a bed and makes off with her car. Before leaving the neighborhood, Vanessa stops to talk to her boyfriend Chopper (Bokeem Woodbine) to tell him that she is leaving town to search for the only family member she knows of, a distant grandmother who lives in Northern California and who doesn't even know Vanessa exists. Chopper gives Vanessa his gun and tells her to pawn it for cash. As soon as Vanessa drives off and is out of sight, thugs drive by and shoot the now-defenseless Chopper dead. The stolen car that Vanessa is driving breaks down on the local Interstate (I-5) freeway just outside Los Angeles, and a man in an SUV pulls over to help her. He identifies himself as Bob Wolverton (Kiefer Sutherland), and tells Vanessa that the car is not driveable anymore. He offers to give Vanessa a ride with him, and she goes with him in his vehicle. After driving a while, Bob gets Vanessa to open up to him and tell him about her life, and she tells him about her broken home, her mother's drug abuse and prostitution, the violence and abuse that she has encountered in various foster homes, and the sexual abusiveness of Larry. At one point, Vanessa shows Bob a photo she keeps in her wallet of her biological father. (The photo used is actually a picture of mass murderer Richard Speck.) After buying her dinner at a roadside restaurant, and pretending to engage her in a theraputic session during the drive, Bob reveals himself to be a notorious serial killer, known by the press as the \"I-5 Killer\" who has been haunting the freeway and killing innocent young women who walk along it. Vanessa is afraid, but she also becomes infuriated at him for violating the trust she put in him by telling him her life story, and Bob finds that she is not easily intimidated. Furthermore, Vanessa easily identifies the hypocrisy that Bob reveals when he identifies Vanessa and his other victims as \"garbage people\". \"You act like you're on some kind of mission,\" she tells him, \"but you really just wanna get off in a sex type way.\" The fact that Vanessa is so logical and intelligent, despite her limited vocabulary and background, enrages Bob, especially when Vanessa is more disgusted than afraid when he reveals that he wants to perform sex acts on her body after he kills her. Using her quick wit, she is able to attack Bob and turn the tables on him by diving into the back seat and retrieving Chopper's gun. She forces Bob at gunpoint to pull off of the freeway into a desolate area, where she explains that Bob has proved to her that he is rotten and will only continue to murder women if she does not stop him. Vanessa shoots Bob in the face, and is horrified when she must pull the trigger over and over in order to kill him. When she thinks he is finally dead, she takes his wallet and walks to a nearby diner, where the blood all over her clothes alerts everybody that something is wrong. She is easily apprehended minutes later by the police, who take her into custody. Meanwhile, Bob, who is not dead after all, manages to get to a hospital and get help for his injuries. At a local police station, Vanessa is questioned by two policemen, Mike Breer (Wolfgang Bodison) and Garnet Wallace (Dan Hedaya). At first, Vanessa is cooperative and freely admits to shooting Bob, but she is dismayed to learn that she did not kill him. Although she tells the policemen that Bob is the I-5 Killer, they do not believe her. After making a background check on Vanessa, they discover her long criminal record for a variety of crimes from shoplifting, to arson, and assault and battery, while they tell her that Bob Wolverton is a well known and respected citizen with no criminal record or any history of violence at all. Furthermore, when Breer aggressively questions her, Vanessa reveals a violent temper and she attacks him physically while hurling racial insults at him. At her arraignment, Vanessa refuses to show remorse for her actions, insisting to the judge and prosecutor that Bob is the I-5 Killer (which falls on deaf ears), and when she sees how badly she has wounded Bob, who is now deformed, she reacts with laughter and fury over what he tried to do to her. The judge orders Vanessa to a juvenile detention center until she can be evaluated for her ability to be tried as an adult. While in the detention center, Vanessa meets a sympathetic drug-addicted teen girl named Rhonda (Brittany Murphy), who befriends Vanessa and tries to get her to make out with her. Vanessa agrees, but insists that she will not have sex with Rhonda, \"Cause I'm straight.\" Another girl, a tough Latina named Mesquita (Alanna Ubach), tries to bully Vanessa. Before she can even threaten her, Vanessa attacks Mesquita and bloodies her badly, forcing the matrons to lock her in solitary confinement. While there, she makes a shiv out of a toothbrush to protect herself, and plots her escape. Days later, Vanessa's guards in the detention center write a report recommending that Vanessa be tried as an adult, as her chances for rehabilitation seem to be nil. Meanwhile, Bob and his straight-laced wife, Mimi (Brooke Shields), are hailed by the media as \"heroes\" for persevering after Vanessa's attack. Detective Breer begins to change his opinion of Vanessa after he and Wallace interview Vanessa's peers and learn of how highly she was regarded. Breer especially is suprised to learn that Vanessa's deseased boyfriend, Chopper, was black, which changes his perspective regarding the racist remarks that Vanessa made to him in her moment of anger. He returns to the crime scene and finds overlooked evidence that indicates Vanessa's story may actually be true. While Vanessa, Mesquita, and two other twin girls are being transferred in a van to the state prison, Vanessa and Mesquita escape by launching a violent attack on the guards using Vanessa's shiv, killing one, maming another, and making off with the van. Mesquita takes Vanessa into her care and gets her a fake ID, clothes, and a gun when they reunite with Mesquita's boyfriend. She and Vanessa share a moment of bonding, and Mesquita tells Vanessa that she only tried to intimidate her so that Vanessa would \"put out for her.\" They laugh, and Vanessa tells Mesquita that she'd put out for her any day. With that, Vanessa and Mesquita go their seperate ways. Meanwhile, Wallace and Breer obtain a search warrant and invade Wolverton's home to search for evidence. When they unlock a small shed in back of the house, they discover all sorts of lurid items, including a large stash of child pornography and various trophies from his victims. Mimi then realizes that her husband really is a serial killer, and she suddenly commits suicide in response. Bob returns home and sees his house surrounded by police cars, so he quickly drives off to avoid capture. (In his earlier encounter with Vanessa, he had apparently obtained a photo of the grandmother, with her address written on the back.) Vanessa uses the clothes that Mesquita gave her to pose as a prostitute, luring a john into a secluded area and then robbing him at gunpoint. After forcing him into his car trunk, Vanessa drives off in the man's car to where her grandmother lives. At the same time, Wallace and Breer figure out where she is going and hope to intercept her before Bob can get to her. When Vanessa arrives at her grandmother's home, which is actually a trailer in a run-down trailer park (lacking the wicker basket that she had with her earlier in the story), she finds that Bob has killed her and is hiding in her bed while dressed as her. After a vicious struggle, Vanessa kills Wolverton by strangling him to death. Detectives Wallace and Breer arrive too late to stop the confrontation. They eventually enter the trailer to find Wolverton and Vanessa's grandmother both dead, and an exhausted and emotionally broken Vanessa is beside herself who puts up her hands and surrenders to the two detectives. However, the detectives appear to exonerate Vanessa when they both begin laughing, and Vanessa follows suit. Vanessa asks the officers: \"Y'all got a cigarette?\"",
      "writers": ["Matthew Bright"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116361/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1MTEzMDU0N15BMl5BanBnXkFtZTcwNDI2MTc0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Reese Witherspoon, Kiefer Sutherland, Bokeem Woodbine | See full cast and crew »"],
      "reviews": [
         "While watching this film I was disgusted, disturbed, and horrified while all the while LOVING THIS FILM. Living in a house where fairy tale literature is commonplace (my wife studies Children's Literature), I was surprised by this film. Seeing it in the value bin at most video stores, I expected poor production, horrible direction, and a pathetic cast. We have all seen these films that boast big names, but somehow never fully follow through. Freeway is nothing of the kind. It is a carefully written and delivered retelling of one of our most beloved fairy tales with a extremely dark twist. Reece Witherspoon (pre-Legally Blonde) gives a performance that surprised me. I did not realize that she was so capable of bringing this character to life. Her counterpart, the illustrious 'Wolf', played by 80s child Keifer Sutherland, is yet another powerful force in this film. The two of them nearly carry this film on their shoulders. This is one of those perfect examples of a film that did not have much publicity after its release, but has since then obtained 'cult' status through avid viewer's word of mouth. This is definitely a film for all movie critics, film buffs, and fanatics to gaze at just once. I know there were some poor reviews when it was first released, but I am sure that a second viewing would bring this gem back to life. I would also like to add that director Matthew Bright is a film genius. He successfully took a very wholesome and good natured story (or that we think) and transforms it into the fearsome dark story that it should be. Our society has the consistency of taking dark elements and transforming them into stories for our children. A wolf eats a grandmother in this story \u0085 how happy and uplifting is that? I applaud Bright for taking this story and transforming it into a modern day fairy tale. It is gripping, fascinating, and downright beautiful. If you enjoyed Natural Born Killers and was hoping for a nicer twist, this film is your answer. I also suggest that if you couldn't get enough of Freeway that you try to get your hands on the very rare Freeway 2: Confessions of a Trickbaby. See how Bright delicately transforms yet another dark fairy tale (Hansel and Gretel) into a modern masterpiece. Grade: ***** out of *****",
         "I remembered Kiefer Sutherland played a psychotic killer....and IMDB lead me right to this one. I had seen bits and pieces of this movie on cable and couldn't believe how good it was, but back in those days we didn't have \"channel info\". This movie is wickedly funny, and Reese Witherspoon plays the most hilarious, bad-girl, tough trailer trash role I've ever seen and plays it fantastically. The slutty makeup and outfits she wears as well as the endless stream of profanity she swears are definitely a lot different than her \"modern day\" good girl roles she seems stuck in now. This movie is funnier than you can possibly imagine, as things keep happening that just blow you away or shock the pants off you and no main character is what they seem to be at first. Definitely unpredictable, this dark comedy is a rare lost gem I was glad to find again.",
         "Although it started out slow, it really picked up the pace when Vanessa gets into Bob's SUV type vehicle. As the movie went on, it easily turned out to be one of the best movies I've seen in years. Dark, gory and still full of laughs in a twisted way. How Reese Witherspoon didn't win an Academy Award for this is a mystery. I have found new respect for Reese and glad to know she isn't all about fluff movies catering to woman (i.e., \"Sweet Home Alabama\"). I hope Reese digs into the grittier side of life again and does another movie of the \"Freeway\" caliber and leave her mantle of \"the next Meg Ryan\" at home! Way to go Reese, this movie is definitely worth owning!",
         "Deeply entrenched in the subversive world of cult films, \"Freeway\" could be one of the most engrossing movies I've ever seen. Reminiscent of the films of John Waters, it's a satire of such unfunny things as serial killings, drug abuse, prostitution, sexual abuse of underage children, prison life, random acts of violence, and suicide. Like the best Waters, Matthew Bright finds the pathos in all of these things, shaping the movie into a nihilistic comedy. Reese Witherspoon is absolutely marvelous as her character, Vanessa Lutz, a sharp-witted \"white trash\" girl who makes the best out of every situation she finds herself in. Her mother is a drug-addled prostitute. Her stepfather is a jobless, sexually abusive moron who also hits the pipe. Vanessa herself has a history of being in trouble with the law and has trouble reading, but she's far from stupid. We never once doubt that she will prevail, no matter how desperate her situation becomes. Vanessa is forced to make a move one day when her parents are arrested and a social worker plans on sending Vanessa to another foster home. Unable to face that prospect, she gives her social worker the slip and hits the road to search for her grandmother, who she has never met and who is not even aware of Vanessa's existence. Vanessa's life takes a detour when her car breaks down and she is picked up by Kiefer Sutherland. She does not know that he is the \"I-5 Killer\", a pathetic but cunning serial murderer who preys on young women he plucks from the freeway. Unfortunately for him, he comes up against the wrong victim when he targets Vanessa. The rest of the story is best left unsaid, although Roger Ebert gave away most of the plot in his review of the film from 1996 (don't ya just love when he does that?). Bright actually references John Waters several times, first by inserting a brief passage that features the opening theme from \"Pink Flamingos\" and also by making a plot point out of the fact that Vanessa, who is white, has a thing for black guys (much like Penny Pingleton in \"Hairspray\"). The dialogue is often outrageous, too. But unlike Waters' early films, \"Freeway\" is technically well-made and structurally better. It also features a number of terrific cameos and roles, including Brooke Shields as Sutherland's snooty, blissfully ignorant wife. Fans of offbeat movies in general might really love \"Freeway\", while others should probably approach it with a strong stomach.",
         "This film is somewhat deceptive, in that the characters seem so outwardly stereotypical of the kind of the sub class of the under-educated, drug or sex addled teenagers and the people who prey on them, which makers of slasher films have doled out in the last couple of decades. But Witherspoon brings a fighting charm to the lead character, Venessa Lutz, who has just about everything bad thrown at her that a young person can have thrown at them while growing up. She survives and prevails with grittiness, will and humor. As far from an angel as you can get she becomes vigilante and enforcer of her own brand of justice to a particularly malevolent form of evil visited on by Bob Wolverton (Kiefer Sutherland) and an uncaring and unbelieving law enforcement system. It's really a small classic and should be viewed without any predjudice of youth crime. It then becomes an eloquent statement for better and more rational treatment of young offenders.",
         "Teenaged Vanessa Lutz (Reese Witherspoon) is illiterate and has a VIOLENT temper. Her prostitute mother has just been jailed so she tries to get to her grandmother. She's picked up by Bob Wolveton (Kiefer Sutherland) who might be a mass murderer... Film begins and ends like a very perverse version of \"Little Red Riding Hood\". The middle has Witherspoon trying to get to her grandmothers. The film is VERY VERY violent with virtual non-stop swearing and plenty of sexual talk thrown in. How it got by with an R rating is beyond me. Still, I love it. What the point of this is I don't know, but it's unlike any other film I've ever seen. It's not afraid to push over the limit of good taste and is never dull. Also the acting is just great. Witherspoon attacks her role full force and is just astounding. Sutherland is equally good as the wolf (Wolveton--get it?) and the supporting cast is full of talented actors (Amanda Plummer, Michael T. Weiss, Dan Hedaya) all doing great. An undiscovered little gem. But be warned--the violence and language is more than a little extreme. NOT for the squeamish.",
         "Move over, Pulp Fiction. Freeway is totally outrageous, over the top hilarious, yet it all somehow has the ring of either truth or understanding or both. The performance delivered by Reese Witherspoon was not only great, it was startlingly great and the best thing I've seen her do. Each turn in the story hit me like a slap in the face, each new character was like a gift, but Reese Witherspoon playing the queen of trailer park trash was done like a symphony. Fantastic!",
         "In other hands this story might have become just another cheesy teen exploitation flick. But in Matthew Bright's \"Freeway\" we have a solid script, confident direction, an excellent supporting cast, and a gleefully twisted world view, all backing up a boldly brilliant star-turn performance by Reese Witherspoon. Her Vanessa Lutz is brazen, coarse, violent, manipulative, and seemingly doomed no matter which way she turns. But at the end of the day, of every day, she remains her own person, and nothing can intimidate or stop her. Witherspoon seems to live and breathe this demanding role, with never a hint of 'acting a part' -- which is to say she is doing some very fine acting indeed. Vanessa Lutz is a role like Forrest Gump, though even more challenging, where one tiny step out of character would spoil the whole thing. But Miss Witherspoon never misses. Plus, it was great to see Kiefer Sutherland play a smarmy, goody-two-shoes psychopathic villain. Much more fun than his trained chipmunk limp-wrist tendentiousness in \"24.\" I have seen no evidence that this man can actually act, but he really does not need to here. When he first appeared on screen I thought, 'Oh no, this movie's over.' But soon I discovered, to my delight, that he he had been cast precisely for his pathetic loser quality. For some reason IMDB classifies Freeway as a 'crime/drama,' which mostly misses the point. It is a diabolical black comedy with lots of violent action, some of it realistic, but most of it wonderfully absurd. All in all it earns a solid 8/10 for being funny and satisfying, a movie which I would happily watch again.",
         "This is one of the funniest films I've ever seen. Reese Witherspoon can do no wrong after the performance she gives here - brilliant. She is the Tony Montana of teenage girls! And lets not forget Brook Shields as the uknowing wife of the serial killer standing by her man through the trial. The best scene is the shoot-out where Reese and the cops walk away smoking cigarettes and laughing as if the whole thing had been a big joke. Great stuff! Puts \"Natural Born Killers\" to shame!",
         "Based on the classic Grimm Brothers tale, Little Red Riding Hood; Freeway is the disjointed and frankly weird odyssey following a young girl on the way to her grandmother's home. The film begins much like any other hitchhiking film, with a young girl being picked up by a slightly sinister driver. However, you won't be able to predict where it's going to go from there, as Freeway continually puts its characters in absurd situations and delivers the unexpected. The plot doesn't exactly adhere to the story of Little Red Riding Hood, and after the basics have been laid down, it's basically anyone's game right down to the gripping and hilarious climax. The film sees Reese Witherspoon's juvenile delinquent being picked up by Kiefer Sutherland's child psychologist after fleeing from her home when her mother and step father are arrested. After telling the psychologist of her relationship with her step father, she soon realises that he's enjoying what she's saying a little too much; and it's not long before she asks him if he's the infamous I-5 killer, and he doesn't do anything to convince her he's not... Freeway doesn't introduce any characters that are particularly likable, and all are guilty to a degree. Most audience members will be on the side of Witherspoon's character, as although she certainly has personality problems, she's great fun to watch and her twisted logic isn't usually far from being spot on! Witherspoon got one of her best roles in this film, and really does carry it despite her young age. Kiefer Sutherland stars alongside her, and it's rather odd seeing him in the psycho role after getting so used to him being Jack Bauer in 24. He does do it great, however. Perhaps the best thing about this film is the pitch black humour that goes hand in hand brilliantly with the absurdity of the piece. The plot is really freewheeling, and the film jumps from road thriller to prison drama to the court room in the blink of an eye, and this helps to ensure that the audience is always kept on their toes. This film won't appeal to people that don't like their movies to be pitch black and unpleasant, but anyone who enjoys a good does of absurdity shouldn't hesitate to track this film down!"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Kushner-Locke Company, The",
         "Multicom Entertainment",
         "August Entertainment"
      ],
      "summaries": [
         "Little Red Riding Hood for the 1990's: After her mom and step-dad are arrested, 15-year-old Vanessa Lutz decides that instead of once again being put into a foster home, she'd rather go and search for the grandmother she's never met, and live with her. \"On the way to grandma's house,\" (actually a trailer park) Vanessa's car breaks down, and she's picked up from the side of the road by Bob Wolverton, a counselor at a school for troubled boys. Bob slowly earns Vanessa's trust, and eventually convinces her to talk about her sexual abuse at the hands of her stepfather. When Vanessa realizes that Bob is enjoying what she's saying, she realizes that he's \"The I-5 Killer,\" from the news. She tries to get out of his truck, but the inside door handle has been removed...",
         "15 year girl runs away from home to live with her grandmother after mom is arrested for prostitution and step dad for molesting her. Along the way her car breaks down, and a respectable, decent looking guy picks her up. Turns out he's the freeway rapist the news keeps talking about and now he's set his eyes on her. However, she shoots him several times and flees. By some miracle, the freeway rapist survives, and the police charge the girl with attempted homicide. The papers have a field day, making her out to be a scumbag and the guy a victim turned hero. But it's not over yet...",
         "Vanessa the main star of the movie lives a nightmare life. Her mother is a whore and her step father a crack head child molester. When Vanessa's mother is arrested again for prostituiton and her step father is taken away for posession of drugs she decides to hit the road and find her grandmother who she has never met.",
         "A twisted take on 'Little Red Riding Hood' with a teenage juvenile delinquent on the run from a social worker traveling to her grandmother's house and being hounded by a charming, but sadistic, serial killer/pedophile."
      ],
      "budget": 3000000
   },
   "movielensId": 1034,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-23",
      "dvdReleaseDate": "1997-08-19",
      "directors": ["Matthew Bright"],
      "runtime": 110,
      "movieId": 1034,
      "title": "Freeway",
      "mpaa": "R",
      "actors": [
         "Kiefer Sutherland",
         "Reese Witherspoon",
         "Wolfgang Bodison",
         "Dan Hedaya",
         "Amanda Plummer",
         "Brooke Shields",
         "Brittany Murphy",
         "Bokeem Woodbine",
         "Guillermo Díaz",
         "Alanna Ubach",
         "Michael T. Weiss",
         "Annette Helde",
         "Ben Meyerson",
         "Tara Subkoff"
      ],
      "imdbMovieId": "0116361",
      "originalTitle": "Freeway",
      "genres": [
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["TujjYkFcmho"],
      "plotSummary": "Following the arrest of her mother, Ramona, young Vanessa Lutz decides to go in search of her estranged grandmother. On the way, she is given a ride by school counselor Bob Wolverton. During the journey, Lutz begins to realize that Bob is the notorious I-5 Killer and manages to escape by shooting him several times. Wounded but still very much alive, Bob pursues Lutz across the state in this modern retelling of Little Red Riding Hood.",
      "tmdbMovieId": 11229,
      "avgRating": 3.5286,
      "releaseYear": "1996",
      "numRatings": 1626,
      "posterPath": "/hcqW33lk6a1KOd0xLJA5uvEg6jU.jpg"
   }
}