{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "chimp",
            "id": 2552
         },
         {
            "name": "manipulation",
            "id": 2887
         },
         {
            "name": "botanist",
            "id": 4003
         },
         {
            "name": "virtual reality",
            "id": 4563
         },
         {
            "name": "lemonade",
            "id": 11372
         },
         {
            "name": "intelligent",
            "id": 160097
         }
      ],
      "imdb_id": "tt0104692",
      "video": false,
      "title": "The Lawnmower Man",
      "recommendations": [
         11525,
         9278,
         9980,
         11864,
         2614,
         9271,
         12088,
         8010,
         9306,
         9102,
         1551,
         10349,
         9348,
         10216,
         4961,
         9886,
         9556,
         11495,
         9080,
         2157
      ],
      "backdrop_path": "/fXCoMFPV7PSwNBZb02SPRFRp7T4.jpg",
      "revenue": 32101000,
      "reviews": [
         {
            "author": "John Chard",
            "id": "52780dbb19c295600b06fb14",
            "content": "It Lacks Qualcast Quality.\r\n\r\n \r\n\r\nThe Lawnmower Man is directed by Brett Leonard who also co-writes the screenplay with Gimel Everett. It stars Pierce Brosnan, Jeff Fahey, Jenny Wright, Geoffrey Lewis, Jeremy Slate and Dean Norris. Music is by Dan Wyman and cinematography by Russell Carpenter.\r\n\r\n \r\n\r\nDr. Lawrence Angelo (Brosnan) is a big mover in the science of virtual reality. When he tries his new technology  on mentally challenged gardener Jobe Smith (Fahey), it elevates him to a higher intelligence and it’s not long before Jobe acquires scary new powers…\r\n\r\n \r\n\r\nOriginally meant to be, and titled as, Stephen King’s Lawnmower Man, the film eventually, after a King lawsuit, ended up bearing very little resemblance to the author’s short story. There’s a couple of small ligaments that link the two, but in the main (not Maine) this Lawnmower Man is its own entity and an obvious attempt to cash in on the then virtual reality zeitgeist.\r\n\r\n \r\n\r\nLawnmower Man has a cult fan base, of that there is no doubt, where much like Tron from 10 years earlier, the effects work and the capturing of something very much being “in” with the youth of the time,  has proved perpetually appealing to nostalgists. But strip away these and you have your basic Frankenstein story for the 90s, a pretty standard story lacking intelligent smarts or deep thematic points of worth. And then of course there is the bizarre fact of having a film decrying the advancement of computer technology, by using computer technology to make the film’s strongest moments! Hee. It’s only adequately performed by the cast, and Leonard’s direction matches his writing, which is mundane when not about the visual effects; effects work that dated very quickly as it happened.\r\n\r\n \r\n\r\nOther cuts and sequels would follow, the former didn’t improve the same basic problems of the theatrical cut, the latter releases proved to be laughably bad. The Lawnmower Man, an interesting movie in the context of its time, and certainly fun enough for those who were there cloaked in a visually inspired warm glow, but it has not been a must see film for anyone else since 1995. 4/10",
            "url": "https://www.themoviedb.org/review/52780dbb19c295600b06fb14"
         },
         {
            "author": "Gimly",
            "id": "596cd15f9251416c3800f00e",
            "content": "Ahead of its time. Unfortunately, the technology it uses was not.\r\n\r\nFinal rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole.",
            "url": "https://www.themoviedb.org/review/596cd15f9251416c3800f00e"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Jobe Smith",
               "gender": 2,
               "credit_id": "52fe43399251416c7500834d",
               "name": "Jeff Fahey",
               "profile_path": "/6l44xDPdJE4dQAEDN9eShnJOSo8.jpg",
               "id": 20495,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Dr. Lawrence Angelo",
               "gender": 2,
               "credit_id": "52fe43399251416c75008351",
               "name": "Pierce Brosnan",
               "profile_path": "/1JXL0zrA26JjdoX8sqf57fJRDVM.jpg",
               "id": 517,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Marnie Burke",
               "gender": 1,
               "credit_id": "52fe43399251416c75008355",
               "name": "Jenny Wright",
               "profile_path": "/scz1dQwtwyFDej8zCAbk6p5bqdp.jpg",
               "id": 64056,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "Sebastian Timms",
               "gender": 2,
               "credit_id": "582fce6fc3a3685b9d00572e",
               "name": "Mark Bringelson",
               "profile_path": "/kbQDiLpWbXWMDWlrm8FNXNT4WWY.jpg",
               "id": 15443,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Terry McKeen",
               "gender": 2,
               "credit_id": "52fe43399251416c75008363",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Father Francis McKeen",
               "gender": 2,
               "credit_id": "52fe43399251416c75008367",
               "name": "Jeremy Slate",
               "profile_path": "/w9SPBkH6XvFSMCDCOUA28BIZGgN.jpg",
               "id": 78690,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "The Director",
               "gender": 2,
               "credit_id": "52fe43399251416c7500836b",
               "name": "Dean Norris",
               "profile_path": "/owIr4b4VIlJu0m6Drofd3P0qDl5.jpg",
               "id": 14329,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Caroline Angelo",
               "gender": 1,
               "credit_id": "582fce7e92514162c3005499",
               "name": "Colleen Coffey",
               "profile_path": null,
               "id": 175960,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Lieutenant Goodwin",
               "gender": 2,
               "credit_id": "582fce8fc3a3685bb00051cc",
               "name": "Troy Evans",
               "profile_path": "/74r7ajwva1F0yd6moWljQFfqnnR.jpg",
               "id": 31006,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Peter Parkette",
               "gender": 2,
               "credit_id": "52fe43399251416c75008359",
               "name": "Austin O'Brien",
               "profile_path": "/5K63RAJq6iwnOSM8ADpj9ARzIxq.jpg",
               "id": 58119,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Jake Simpson",
               "gender": 2,
               "credit_id": "582fceccc3a3685bad00533d",
               "name": "John Laughlin",
               "profile_path": "/4qVihEb3rMxSQap4N7fC1plTtM0.jpg",
               "id": 104342,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43399251416c75008313",
               "name": "Brett Leonard",
               "profile_path": "/24eM4jVMEY790YFNf3t7VhgX19z.jpg",
               "id": 57090,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43399251416c75008319",
               "name": "Brett Leonard",
               "profile_path": "/24eM4jVMEY790YFNf3t7VhgX19z.jpg",
               "id": 57090,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43399251416c7500831f",
               "name": "Gimel Everett",
               "profile_path": "/rWJHp7R50GRMkXeBbZzilbERXeA.jpg",
               "id": 64049,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43399251416c75008325",
               "name": "Dan Wyman",
               "profile_path": null,
               "id": 64050,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43399251416c7500832b",
               "name": "Russell Carpenter",
               "profile_path": "/zhcM8RBTC8goTfJT3TbraeO1x5n.jpg",
               "id": 8523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43399251416c75008331",
               "name": "Gimel Everett",
               "profile_path": "/rWJHp7R50GRMkXeBbZzilbERXeA.jpg",
               "id": 64049,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43399251416c75008337",
               "name": "Steven A. Lane",
               "profile_path": null,
               "id": 64052,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43399251416c7500833d",
               "name": "Robert Pringle",
               "profile_path": null,
               "id": 64053,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43399251416c75008343",
               "name": "Edward Simons",
               "profile_path": null,
               "id": 64054,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43399251416c75008349",
               "name": "Clive Turner",
               "profile_path": null,
               "id": 64055,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43399251416c7500835f",
               "name": "Alan Baumgarten",
               "profile_path": null,
               "id": 10393,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5aa523c20e0a26075101e4d7",
               "name": "Tony R. Medina",
               "profile_path": null,
               "id": 1995913,
               "department": "Crew",
               "job": "Prop Maker"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.760607,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 10163,
      "vote_count": 249,
      "budget": 10000000,
      "overview": "A simple man is turned into a genius through the application of computer science.",
      "similar": [
         1903,
         281,
         604,
         605,
         81188,
         258230,
         11360,
         10836,
         11033,
         638,
         301804,
         4593,
         614,
         300,
         15050,
         13581,
         3511,
         28891,
         5237,
         72277
      ],
      "original_title": "The Lawnmower Man",
      "runtime": 108,
      "poster_path": "/3tWLM3zMyh3KZOactn8mfjHml05.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Allied Vision",
            "id": 5570,
            "origin_country": ""
         },
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         }
      ],
      "release_date": "1992-03-05",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": "/id05z92s8Pwc2wbR9YAKngGqOyP.jpg",
         "name": "The Lawnmower Man Collection",
         "id": 124935,
         "poster_path": "/slBKrKBbL1g3KURphhAYIyOOH0G.jpg"
      },
      "tagline": "God made him simple. Science made him a god.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brett Leonard"],
      "runtime": 107,
      "synopsis": "Dr. Lawrence Angelo (Larry) works for a governmental institution that is involved with enhancing intelligence through virtual reality. After a project in which a chimp is trained to be a soldier ends in a disaster when the chimp escapes the laboratory Dr. Angelo is send on a leave. After almost falling into a depression he decides to pick up his work at home. This time he tries to enhance the intelligence of the retarded local gardener Jobe Smith, also known as the lawnmower man. To prevent the same disaster as last time from happening, Dr. Angelo decides to leave out the aggressive elements of the previous project and in stead focusses on brain stimulation through the expansion of knowledge with virtual reality and brain stimulating medication. In his every day life Jobe is under the severe supervision of father Francis McKeen. Father McKeen is forceful in his ways of keeping Jobe on track, by submitting him to corporal punishment and penance. Jobe hopes that when he becomes smarter people won't be able to take advantage of him any longer. After the first virtual reality training sessions, Jobe already shows improvement and both Jobe and Dr. Angelo get excited about the results. They seem to get almost obsessed, wanting to push the limits of their experiment further and meanwhile driving Dr. Angelo's wife away. In order to continue the project Dr. Angelo has to involve the laboratory in his experiment. Things start progressing in a rapid speed, when the higher authorities become aware of the project. They force Dr. Angelo's supervisor to reinstate the original project and subject Jobe to the same virtual training as the chimp, making him into a soldier. This is when things take a turn for the worse. Jobe already gained the ability to read people's minds, but is now also able to move objects without touching them. On top of that he is able to manipulate people's minds. He breaks into the laboratory to overdose himself on stimulatory medication and to spend more time in virtual reality, which has become the place where he wants to be most. All these powers get into Jobe's head and he starts seeing himself as a god. He takes a revenge on the people that did him wrong, by burning Father McKeen, killing the abusive neighbor with a lawnmower and possessing the mind of his rival Jake, who has been taunting him for his retardation. Meanwhile Dr. Angelo was brought to the institution's officials in Virginia who want more information and control over the project. This is where Dr. Angelo finds out that the original chimp project was reinstated and he soon finds that he has to escape the officials in order to save Jobe from himself. Dr. Angelo finds Jobe at his house where he possesed the mind of Dr. Angelo's wife and explains to Dr. Angelo what his plans are. He wants to dissolve into virtual reality completely from where he will be able to rule the world through all the interlinked networks (i.e. the internet). His birth cry will be all of the world's phones ringing in unison. After tying Dr. Angelo down, Jobe returns to the laboratory where he takes at the entire security team and hooks himself into the virtual reality system to dissolve into the virtual reality completely. When Dr. Angelo frees himself he uses the neighbor's help to get to the laboratory, where he decides to blow up the entire institute. Before the place explodes he isolates the computer system from the internet so that Jobe is not able to exit the institute's mainframe in the virtual reality. Dr. Angelo enters the virtual reality to reason with Jobe, but it's a lost case and Jobe digitally crucifies him. Only when they here the neigbor's kid is in the building Jobe decides the kid needs to be saved and lets Dr. Angelo go. Dr. Angelo and the kid, Peter, are able to escape the building before it blows up. Right before that Jobe finds a backdoor to the rest of the world's networks and when everything seems to end well every single phone in the world starts ringing in unison.",
      "writers": [
         "Stephen King",
         "Brett Leonard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104692/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2ODExODIwM15BMl5BanBnXkFtZTgwODUyMDY0MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeff Fahey, Pierce Brosnan, Jenny Wright | See full cast and crew »"],
      "reviews": [
         "I got 'The Lawnmower Man' as part of one of those 'Buy a pizza and get a free movie' deals, and I put off watching it. And put it off more. And more, until finally I had nothing else to do, so I popped it in the VCR and sat back. Two and half hours later (It was the director's cut- don't see the normal version as it is not nearly as good) it instantly became one of my favorite movies, so I rewound it and watched it again. To date I have seen it four of five times, as it has problems, it's not very fast paced, but is terribly engaging and Fahey is superb in the lead. The writing isn't great, but is passable, and the computer effects, though far from the center of the story, are excellent. If you haven't seen it yet, or have only seen the normal version, it is well worth the rental, or even purchase.",
         "Stories about a simple person getting turned into something more seem pretty common in movies, but none are like \"The Lawnmower Man\". Portraying scientist Pierce Brosnan turning retarded Jeff Fahey into a super-genius (with unintended consequences), this is one movie destined to blow your mind. The visual effects were beyond impressive even for 1992, but they never dominate the movie. We might say that the movie deals with the dangers of people relying too much on technology, and also the dangers of militarism, but even aside from that, this is a movie worth seeing. Check it out. Oh, and I think that we can all agree that the sequel needs to be avoided at all costs.",
         "Forget the Stephen King connection. Their take on aspects of computers may be a bit off, but it's fiction, let it be fun. And for god's sake, lay off the special effects. What you end up with is a fantastic film about the possibilities and dangers of technology in a hypothetical world. You see the hopes and dreams of a brilliant scientists, and the manipulation of a militaristic government. You get to see a great example of \"power corrupting\" a human being. I've seen this film a lot, from 15 to 25 years old, and the last scene of the movie never fails to give me shivers. But please, please, please don't watch the sequel. Really.",
         "I went to see this movie in the theater when it was released. At the time the graphics were not dated in any way shape or form. Where is VR today? I recently bought the DVD and after watching it and remembering that it was an eight (8) year old movie, I still enjoyed it. I have seen a few VR games in arcades and to be honest the graphics today aren't much better than they were in this movie. I have seen a lot of comments about the effects being dated and I think that should be common sense when watching an older movie. When I watch Tron I don't think that the graphics are dated, I just remember that the movie was made in 1982 and effects and computer animation weren't the same back then as they are today. Most older movies have that look when compared to today's special effects. I always take that into account when watching older movies. I enjoyed Lawnmower Man then, now and I will the next time I watch it. I will keep it in my DVD collection.",
         "Given the absolute trainwreck that this film is in many respects, it's surprising that the story works as well as it does once it gets going. The middle of the film is actually somewhat engaging, there are scenes where odd flashes of competence shine through, and the beginning of the climax, at least, is pretty suspenseful, even though it peters out when it should be reaching a fevered pitch. Even with the plethora of problems, The Lawnmower Man is worth watching for fans of \"so bad it's good\" films (even though this isn't exactly so bad that it's good), just to witness the atrocious special effects (almost all CGI) and the bizarre concatenation of elements that it's almost impossible to imagine anyone thought would be a good idea if they weren't intentionally shooting for a comedy or an absurdist genre film. Yes, director/writer Brett Leonard, co-writer Gimel Everett and the production team were serious, and thought that they were producing a cutting-edge, hip and thrilling genre film--something like the Matrix of its time. That alone is funny enough once you've seen a few minutes of the film to make this worth a watch. The story has two protagonists, one of which eventually becomes something of an anti-hero. The film begins with a text prediction about just how prevalent and influential virtual reality will be at the turn of the 21st Century. In retrospect, it underscores just how ridiculously inflated revolutionary or \"savior\" technology predictions tend to be. We then meet Dr. Lawrence Angelo (Pierce Brosnan before he was in a position to turn down starring roles), who is engaged in virtual reality research for the government (his superiors call their project/division \"The Shop\"). He's experimenting on monkeys, and per his superior's orders, the focus is on military uses--the monkey is being virtual reality trained in battle strategy while they're manipulating its aggression levels. As anyone who has seen at least two or three genre films could guess, this ends up backfiring. The monkey freaks out and runs rampant through the secret government facility, attacking employees. Dr. Angelo semi-voluntarily goes on hiatus. He had wanted to eventually test human subjects for susceptibility to his virtual reality \"mind expansion\", without the emphasis on violence, but that seems a lost cause. However, after his wife leaves him, he decides that maybe he can do the research on his own. He decides that the perfect test subject is the titular lawnmower man--his neighbor Jobe Smith (Jeff Fahey). Jobe happens to be developmentally disabled. Of course, things do not go exactly as planned with the tests on Jobe, either, especially once The Shop gets wind of what Dr. Angelo is doing. The Lawnmower Man grew out of a Stephen King short story that most famously appeared in his Night Shift collection. The King story is only a few pages long, and it bears almost no resemblance to the film. The only scene that's at all similar is the one involving a lawn mower and Peter Parkette's (Austin O'Brien) father. It might be informative for those who have a less than consistently favorable opinion of King-oriented films to note that King sued to have any reference to his name removed. I actually like most King-oriented films, but I find the suit amusing, too. What makes The Lawnmower Man such a trainwreck? The most prominent problem, because it is such a focus of the film, is the CGI. When Dr. Angelo is working with human subjects in The Shop's facilities, they wear \"spiffy\" spandex suits reminiscent of Tron (1982). That may be enough of a problem in itself (and just who made those suits if Dr. Angelo had never been authorized to work with humans?), but the bigger problem is that the CGI is also reminiscent of Tron. That's not to say that Tron isn't successful, but it had very primitive CGI. There, it was more excusable for three reasons. One, it was made in the late 1970s/early 1980s, when CGI _had_ to be much more primitive. Two, realizing this, Tron director Steven Lisberger aimed at creating more of a minimalist world. And three, once introduced to us, most of Tron took place in that world. By the early 1990s, computer graphics had progressed quite a bit. Yet, Leonard allows The Lawnmower Man's CGI sequences to almost exclusively consist of brightly colored, low-resolution, simple geometric shapes floating around in a featureless world. Admittedly, The Lawnmower Man was a bit low-budgeted. But I'm not sure that excuses computer graphics that look like they were done on a Commodore 64 by someone working through a basic pixel animation book. And this stuff is supposed to \"accelerate the evolution of the human mind?\" It wouldn't matter so much if this were not the crux of the film. But the CGI is as important here as the scenes inside The Matrix are to that film. The effects work a bit better when they're integrated with cinematography. But Leonard avoids that more than he should. And the CGI isn't the only problem. The story otherwise is extremely awkward. Most of it is unintentionally absurdist. Jobe lives in a little shack in an otherwise normal suburban neighborhood. A sadistic priest regularly flogs him. A beautiful widow seduces him. Peter's family is almost a spoof of the typical King family, with an abusive, alcoholic father. All of these people bizarrely live right next door to Dr. Angelo. I could go on and on, but there isn't room. Still, there are aspects of the story that work. When Leonard finally gets around to death scenes, they're pretty good. The suspense stuff when Dr. Angelo is in Washington is good. And the overall arc about Jobe transforming, but getting out of control and seeking revenge is enjoyable, pithy and certainly a classic, archetypal plot. But this isn't anything if it's not a mixed bag. Watch expecting a trainwreck, and you should be entertained for an evening.",
         "I saw this movie in early 90's (1991?) and a that time I spaced out on the special effects. In Amsterdam where I lived at that time there were enough helpful \"items\" which influences the way of experiencing movies. So with a little \"green\" help this really was a great movie. Imagine that it is possible to alter your personality or intelligence by experiencing virtual reality. Scary, but interesting thought. Nowadays I still think it was a strong movie for that time. Just use your imagination and don't compare it to real life and Matrix kind of movies and you'll enjoy it. If you have no imagination leave it in the box.",
         "This effect-laden sci-fi horror film looked pretty impressive back in 1992. But of course times move on, and such movies have a tendency to look dated quicker than most as technology marches on to new levels. I guess The Lawnmower Man is one of these films. But in fairness, it can be quite fun to look back at old special effects and see what was cutting edge back in the day. In truth, today if you were to give a 12 year old child a computer game with graphics similar to those in The Lawnmower Man, that child would turn around and laugh in your face. Such is the speed of computer technology. So yes, The Lawnmower Man no longer looks cutting-edge but neither does it look terrible, its effects work within themselves and are only occasionally atrocious, such as the burning priest. As most people already know, the story is about a simpleton who is turned into a genius via virtual reality technology. The side effect of this method is that it turns the, otherwise good natured man into an insane evil psychotic. The Lawnmower Man is neither a particularly good film, nor an especially bad one. There's certainly nothing special here, and the effects were by far its chief selling point. Without them this would almost certainly be a forgotten B-movie. Pierce Brosnan and Jeff Fahey are reasonable enough in their roles, but they were always going to play second fiddle to the CGI. At the heart of it all it's a simple clichéd story that doesn't really hold very many surprises to be perfectly honest. But it's still quite good fun in a silly kind of a way.",
         "As you've probably seen, a lot of people have have seriously slagged off this film. In most cases, its because of the unusual plot. But I think that this is what makes this movie. Your also bound to be confused with what the plot is, but its not complicated. Pierce Brosnan (Known as 'Angelo')is a scientist who works for a company that specialise in virtual reality and computer generation. Brosnan has been working on a project which enables people to become smarter, but has had tough luck finding volunteers. However, his luck changes when he realises that his friend 'Jobe', a lawnmower man who is slightly backwards could be the perfect specimen. Angelos tests prove successful, and things go great. But as in all films, there's a downside.. Jobe becomes too smart and takes revenge on people as his life becomes estranged with computer generation. It would be cruel to tell you any more - the film is marvellous in the directing department. Jobe's frustration is well screened an some of the ideas are great. Even Brosnan plays a great part in this film and makes us forget he is 007 in years to come. The CGI in this film is what makes it. OK, I have to admit, Terminator 2's special effects are in a different league, but the effects in this film are not supposed to be super realistic. They are supposed to be a vision (in most cases) of virtual reality - how a computer generated world would look. They are engaging, but dated. Still, I think there effective and entertaining. some people say this film is a thriller, an in ways their right. But don't get mis led and think this is a horror film - it isn't, its more psychological. So, the final verdict. If your into films that are certainly different than the usual s**t we get these days, I would recommend this definitely. However, if you have no idea what virtual reality is or have no patience, then don't bother. Classic stuff!",
         "When many people (who have seen it) hear of Lawnmower Man, they immediatelycringe and think of a poor rendition of a movie and wonder why the actors who were in it... were in it. The Director's Cut fills in so many blanks left out by the \"normal\" version that it isn't even funny to think about the \"normal\" version anymore. The Director's Cut should have been the one to reach press, and the public... The show was done well with excellent storyline.",
         "Its a good movie , one of those that keep you the whole time your attention on the screen. For this its deserve already a good rate. Then we could tell that the actors are quite good in their acting, that the visual effects aren't always perfect , but we were also in 1992!! Also its a good combination of Science fiction/Thriller/Horror movie , not many movies succeed in this. The supernatural that involve into the story sounds a bit strange but who knows effectively what could happen when certain barriers are broken?....and visual effects are not \"all\" in a movie, the audience fantasy should still play a rule... sorry for my English) *Frankie*"
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Allied Vision",
         "Fuji Eight Company Ltd.",
         "Lane Pringle Productions"
      ],
      "summaries": [
         "A scientist performs experiments involving intelligence enhancing drugs and virtual reality on a simple-minded gardener. He puts the gardener on an extensive schedule of learning, and quickly he becomes brilliant. But at this point the gardener has a few ideas of his own on how the research should continue, and the scientist begins losing control of his experiments.",
         "A trip into virtual reality. Angelo has developed a virtual reality system, which truly immerses the user into the world of computer make-believe. The lawnmower man, Jobe, who is intellectually disabled, is put 'into' the system to find out if his intelligence can be improved. It can, but not without some serious side-effects.",
         "A simple man is turned into a genius through the application of computer science."
      ],
      "budget": 10000000
   },
   "movielensId": 1037,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-03-05",
      "dvdReleaseDate": "1997-12-17",
      "directors": ["Brett Leonard"],
      "runtime": 108,
      "movieId": 1037,
      "title": "The Lawnmower Man",
      "mpaa": "R",
      "actors": [
         "Jeff Fahey",
         "Pierce Brosnan",
         "Jenny Wright",
         "Mark Bringelson",
         "Geoffrey Lewis",
         "Jeremy Slate",
         "Dean Norris",
         "Colleen Coffey",
         "Troy Evans",
         "Austin O'Brien",
         "John Laughlin"
      ],
      "imdbMovieId": "0104692",
      "originalTitle": "The Lawnmower Man",
      "genres": [
         "Horror",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["YCxFGxqLsHE"],
      "plotSummary": "A simple man is turned into a genius through the application of computer science.",
      "tmdbMovieId": 10163,
      "avgRating": 2.73634,
      "releaseYear": "1992",
      "numRatings": 7813,
      "posterPath": "/3tWLM3zMyh3KZOactn8mfjHml05.jpg"
   }
}