{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "san francisco",
            "id": 582
         },
         {
            "name": "sandwich",
            "id": 6878
         },
         {
            "name": "surrogate mother",
            "id": 7638
         },
         {
            "name": "little boy",
            "id": 9736
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "suburb",
            "id": 14632
         },
         {
            "name": "moving out",
            "id": 14633
         }
      ],
      "imdb_id": "tt0118044",
      "video": false,
      "title": "Unhook the Stars",
      "recommendations": [
         41779,
         45174,
         33341,
         38244,
         54659,
         71357,
         103413,
         46280,
         20471,
         47889,
         25985,
         38554,
         112631,
         60158,
         20861,
         27224,
         44413,
         45861,
         16771,
         40562
      ],
      "backdrop_path": "/ki79qgFtTYebC0PszE75xBcEUnV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mildred 'Millie' Hawks",
               "gender": 1,
               "credit_id": "52fe4779c3a36847f81379bd",
               "name": "Gena Rowlands",
               "profile_path": "/kRHNvkcJlwBr1Xb9XREiZob29NX.jpg",
               "id": 4800,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Monica Warren",
               "gender": 1,
               "credit_id": "52fe4779c3a36847f81379c1",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Big Tommy Bellaveau",
               "gender": 2,
               "credit_id": "52fe4779c3a36847f81379d7",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jake 'J.J.' Warren",
               "gender": 2,
               "credit_id": "52fe4779c3a36847f81379db",
               "name": "Jake Lloyd",
               "profile_path": "/1MndIkdjjDypRDi3PpMzy3j0Lof.jpg",
               "id": 33196,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ann Mary Margaret Hawks",
               "gender": 1,
               "credit_id": "52fe4779c3a36847f81379df",
               "name": "Moira Kelly",
               "profile_path": "/pQstHxjYadJBlwD0ifXFRS0xUT5.jpg",
               "id": 20005,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Ethan Hawks",
               "gender": 2,
               "credit_id": "52fe4779c3a36847f81379e3",
               "name": "David Sherrill",
               "profile_path": "/6hSCpy45Zu6F7TzAKYGHrhTSKXu.jpg",
               "id": 102403,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Frankie Warren",
               "gender": 2,
               "credit_id": "52fe4779c3a36847f81379e7",
               "name": "David Thornton",
               "profile_path": "/jDcmAwRCUYd3QSVEVc9Xq2Yi9Xf.jpg",
               "id": 76526,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Jeannie Hawks",
               "gender": 0,
               "credit_id": "52fe4779c3a36847f81379eb",
               "name": "Bridgette Wilson",
               "profile_path": "/l5bUegMA9PHoeRgBkio2bE9R7Vj.jpg",
               "id": 20751,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4779c3a36847f81379c7",
               "name": "Nick Cassavetes",
               "profile_path": "/daXFYs1PxFtrAZJv5iLMpqnIGet.jpg",
               "id": 11151,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4779c3a36847f81379cd",
               "name": "Helen Caldwell",
               "profile_path": null,
               "id": 152204,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4779c3a36847f81379d3",
               "name": "Nick Cassavetes",
               "profile_path": "/daXFYs1PxFtrAZJv5iLMpqnIGet.jpg",
               "id": 11151,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.326975,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 48862,
      "vote_count": 14,
      "budget": 0,
      "overview": "Widowed mother Mildred must suddenly redefine herself and find an outlet for her nurturing side when her adult daughter moves out of the family home. Though Mildred thinks she's found her purpose when her neighbor, overworked single mother Monica, asks her to look after her little boy, she has great difficulty learning to strike a healthy balance between giving selflessly to others and remembering to take care of herself.",
      "similar": [
         2142,
         3134,
         298312,
         11564,
         4771,
         1949,
         205,
         339692,
         281957,
         281,
         769,
         395834,
         445954,
         431,
         10285,
         23483,
         562,
         59967,
         261023,
         8810
      ],
      "original_title": "Unhook the Stars",
      "runtime": 103,
      "poster_path": "/uLRs48H7PvhufiNyiiIWB2YcSaF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1996-09-04",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "When prim & proper meets wild & crazy get ready to...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Cassavetes"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Helen Caldwell",
         "Nick Cassavetes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118044/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NjgxMDQwN15BMl5BanBnXkFtZTcwODk1NTgxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Gena Rowlands, Marisa Tomei, Gérard Depardieu | See full cast and crew »"],
      "reviews": [
         "This is a story of a mature woman who gets to take care of a little boy,after her own daughter moves out.The two have a great time,and the woman even becomes friends with the boy's mother, who is completely different from her.The older woman is very proper,but caring and the boy's mother is the wilder type. Then there also is a truck-driver, who is a friend of the wild woman,and he falls in love with the older woman.By that time her life isn't what it used to be anymore! The acting was very good,especially Marisa Tomei was great as Monica Warren,the little boy's mom! Also I very much liked Gerard Depardieu as the truck-driver,but then again, he is always funny. Jake Lloyd put on a great show too,as \"JJ\" Warren,and also I liked the acting of daughter Annie (Moira Kelly)! Overall this is a nice drama/comedy!",
         "\"Unhook the Stars\" is all about Rowlands who plays a middle aged widow with grown kids who wakes up one day to find herself no longer needed as a wife and mother. An uneventful and even character study which builds enough interest in the Rowlands character to make it not too difficult to overlook her supporting cast who play obvious stereotypes, \"Unhook...\" is a flick with no punchline which plays like a meal with no dessert. The entertainment is in the ride, not the destination. A good slice of mature life flick worth a look.",
         "What a collection of screwed up folks. Here we have a woman who has lost control of her life, not to mention her mouth; a permanently aggravated daughter; a goofy wife beater who sings Cocker atrociously; and a hot to trot trucker and his blinky, well meaning girlfriend. Together they form one of the best dramas I've seen in a good while as they try, try, try to get their lives on track so they can just be whole and happy. First rate.",
         "Two very different women, one a demure, middle-aged woman with an over-bearing son and a rebellious daughter; the other, an \"in -your-face\" young woman. They are neighbors and find a need for each other in a very human way. Depardieu is the fellow who makes a difference in Rowland's life -we never know how much. I wish more had been made of the relationship between Rowland and her daughter. It never becomes clear what their problem really is, and nothing is really resolved. Another exit to the airport ending leaving the viewer with many questions unanswered -very annoying, but overall a good film.",
         "the title of this film goes along with the song ...\"nothing left to do here, but unhook the stars\".... After the death of her husband, Gena Rowlands finds herself in a big house, with no family, and nothing to take care of. She begins to care for the young son of Marisa Tomei, who is involved with an abusive soon to be ex-husband. The actor playing her son does very well, he develops a relationship with Rolands, she becomes a surrogate grandmother. Such a nice story, because it is realistic, and not overdone. Rolands has another son who lives in San Francisco, and wants her to move into his penthouse; when she realizes her daughter-in-law just wants a live-in babysitter, she says ...\"No-I'm done\"...; While she loves her children she now realizes it is her turn; her time to do something SHE actually wants. At the end we see her packing up the house; her younger daughter is upset; there will be no more family home. But Rowlands realizes she is doing the right thing; her relationship with the young boy has faded; she now needs to do something for herself. There are also a few amusing scenes with Gerard Depardieu, as a truck driver who she meets at a bar with Tomei and her friends. Overall a bittersweet movie which is a nice change, showing a mature woman re-discovering her life, and not taking care of everyone else, at the expense of her own identity. 9/10.",
         "UNHOOK THE STARS (1996) ***1/2 Gena Rowlands, Marisa Tomei, Gerard Depardeau, Jake Lloyd, Moira Kelly, David Sherrill, Bridgitte Wilson, David Thornton, Clint Howard. Excellent acting by Rowlands and Tomei as a widower and a troubled neighbor, respectively, who become friends after the latter asks the former to babysit her quiet, yet bright boy (Lloyd in a remarkable debut that eschews cuteness for real depth, no easy task for a five year old; Lloyd later was cast as the young Darth Vader in the Star Wars prequel!). Emotionally satisfying thanks to an even-handed directorial debut by Rowlands' son Nick Cassavettes(the late auteur John's prodigy), who co-wrote the well-written scrip with Helen Cladwell. Guaranteed to have you laughing and crying; dare you not to get a lump in your throat by the film's poignant ending between Lloyd and Rowlands. Nice job by all around! ** Personal note: I relate this film to my own upbringing between my mother and grandmother.",
         "\"Unhook the stars\" marked the directorial film debut of Nick Casavettes, the son of the immensely talented John Casavettes and Gena Rowlands. This is clearly the director's homage to his beautiful mother, which probably was the reason this film was made. The screen play by the director and Helen Caldwell, doesn't translate to a good film, as we watch the finished product. Mr. Casavettes' heart is in the right place, but the movie, as written, doesn't make much sense. First of all, one wonders where Mildred went wrong. Her daughter Annie is a mess. Her son, the yuppie, lives in his own material world. We would like to think Mildred and her late husband created a nice environment for these two children. They both turned out to be losers in their own right. Mildred's neighbors don't belong in her neighborhood. One wonders how the probably low wage earner, Monica, can live across the street from Mildred's better than average home. A lady like Mildred would probably have told Monica off from the beginning. The way Monica curses in every sentence would have been a turn off factor for Mildred. Of course, we know she goes along because suddenly she has found the sweet little J.J. that Monica dumps on her. Monica and Mildred live in two different worlds and it's hard for us to accept their situation because Monica shows no redeeming qualities, except the love for her son. Mildred, on the other hand, doesn't have a clue about how to reach out for her daughter. The only positive thing Mildred does is to sell the house and go into a new life. Miami in her future? The other thing that doesn't make sense is to watch the elegant Mildred going to the dive where Monica takes her to drink. Big Tommy's interest in her, while it might be sexual, is not fully realized either because they stick out like oil and vinegar. There is no chemistry between Mildred and this big French Canadian guy. Gena Rowlands does an excellent job as Mildred. She is always serene and composed. That's why Marisa Tomei over acting, the way she does, looks completely out of place, next to Mildred. Jake Lloyd is sweet and not bratty as J.J., the boy who loves Mildred until his father comes back home. Moira Kelly's Annie is an enigma. David Sherrill and Bridgette Wilson play Mildred's son and daughter-in-law. Poor Gerard Depardieu, a great star in his native France, doesn't have a thing to show for himself. M. Depardieu should choose more carefully his future films in America! With the exception of \"She's so Lovely\", which reminded us more of his father's influence, and \"John Q\", Nick Casavettes hasn't made a name for himself as of yet. It would be a great help for Mr. Casavettes to study his father's films, then, perhaps, he would find an inspiration for directing more movies that will showcase his talent. This one, or \"The Notebook\", alas, don't help him at all.",
         "The film starts out very well with Mildred's daughter, a rebellious teenager, leaving her widowed mother's home. Mildred forms a bond with next door neighbor, played in a wonderful performance by Marisa Tomei, a crude low-life with an even lower-life husband. He walks out on her and Mildred agrees to watch their young child while Tomei works. This all sounds good. Mildred finds romance with Gerard Depardieu at a bar while with the Tomei character. Mildred's son and daughter-in-law want her to join them in San Francisco. Fine. Suddenly the writing goes awry. Tomei reconciles with her husband who comes back as a changed man. Mildred suddenly sells her house and by the picture's end, we don't know where she is going to. Also, since the Tomei and Mildred's daughter had so much in common, it would have been nice to see them in the same scenes together.",
         "Marisa Tomei has always been one of my favorite actresses. She has a very individual, very strong, not to mention incredibly hot, presence and is one of the major scene thieves of our time. She is by far the best thing about My Cousin Vinny, which would hardly be even close to being as worthwhile without her. She is the only reason to watch Just A Kiss. She is wonderful in Happy Accidents and In the Bedroom. In Unhook the Stars, she is a joy to see, not just for her presence and ability to intrigue even inaminate objects but also for the freedom-emblazoned attitude she fleshes out in her character. She is not at all subtle, but she is a realistically subtle contrast to Gene Rowlands, who plays opposite her. However, in this film, Gena Rowlands serves to be the first person I've ever seen who's stolen any scene from the likes of Marisa Tomei. Tomei's earliest scenes are brilliantly fiery, both hilarious and alarming, one of these great instances involving dialogue with other characters while she is in another room cursing and raving into the phone incidentally during the natural pauses in between the other characters' exchanges. But gradually, Rowlands earns our focus a bit more, because I've hardly felt more deeply for many other characters in many other movies. Gena Rowlands plays a mother on the latter end of middle age whose daughter gives her great disrespect and constantly runs off, leaving her to do her paper route. She has a highly serious and successful son who lives for admiration and objectifies his wife. Rowlands is lonely, riding the gentle winds through the motions of life at home. When Tomei, grungy, aggressive young mother, asks her to babysit her young son while she's at work, a new and beautiful relationship emerges into Rowlands's life, giving her great happiness and fulfillment, but the natural interferences and oncoming decisions of life seem to taper it. The scenes with her and the young boy are so touching and full of emotion. I won't explain further into her character or the story that is driven by her, but I will say that what she is is a touching, very very deeply felt characterization of a common, lonely mother of great selflessness, surrounded by the self-absorption of the people she cares the most for. And you will be surprised at how much you care for such overlooked people, people who rarely come to be the lead character in a movie. Though Nick Cassavettes doesn't quite have the intensity or fluently original technique that his father, John Cassavettes, had, he does carry on in the Cassavettes tradition of plain and direct interpretations of reality. His film is about loneliness, and about the sort of person who takes so little from us in return for so much that she gives, and how she is prompted to live.",
         "Targeted to the intelligent, non-adolescent. Character driven story, extraordinarily well written. How did this ever get the green light from a major studio? Marisa Tomei displays her trademark ability to portray hard edged, gritty women."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Hachette Première",
         "Miramax",
         "Sheen/Michaels Entertainment"
      ],
      "summaries": ["Character study about Mildred, an elderly woman who has spent her life caring for others. When her daughter finally leaves home, she finds that, for the first time in her life, she has nobody to worry about - but soon becomes involved in the life of Monica, a young mother whose husband has left her to look after her young son J.J.. As the relationship blossoms, Monica teaches Mildred that there is more to life than taking care of others."],
      "budget": 0
   },
   "movielensId": 1038,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-04",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["Nick Cassavetes"],
      "runtime": 103,
      "movieId": 1038,
      "title": "Unhook the Stars",
      "mpaa": "R",
      "actors": [
         "Gena Rowlands",
         "Marisa Tomei",
         "Gérard Depardieu",
         "Jake Lloyd",
         "Moira Kelly",
         "David Sherrill",
         "David Thornton",
         "Bridgette Wilson"
      ],
      "imdbMovieId": "0118044",
      "originalTitle": "Unhook the Stars",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["9daIbBlaEIA"],
      "plotSummary": "Widowed mother Mildred must suddenly redefine herself and find an outlet for her nurturing side when her adult daughter moves out of the family home. Though Mildred thinks she's found her purpose when her neighbor, overworked single mother Monica, asks her to look after her little boy, she has great difficulty learning to strike a healthy balance between giving selflessly to others and remembering to take care of herself.",
      "tmdbMovieId": 48862,
      "avgRating": 3.21976,
      "releaseYear": "1996",
      "numRatings": 248,
      "posterPath": "/uLRs48H7PvhufiNyiiIWB2YcSaF.jpg"
   }
}