{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bomb",
            "id": 258
         },
         {
            "name": "mentally disabled",
            "id": 791
         },
         {
            "name": "brother-in-law",
            "id": 2102
         },
         {
            "name": "young wife",
            "id": 174534
         },
         {
            "name": "police inspector",
            "id": 174539
         },
         {
            "name": "greenwich london",
            "id": 174543
         },
         {
            "name": "older husband",
            "id": 174548
         },
         {
            "name": "shop owner",
            "id": 174552
         }
      ],
      "imdb_id": "tt0117582",
      "video": false,
      "title": "The Secret Agent",
      "recommendations": [
         150875,
         38665
      ],
      "backdrop_path": "/dEQ9iAGKnIm70SfDtK1wfiXrR0D.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Verloe",
               "gender": 2,
               "credit_id": "52fe4725c3a36847f8125ba7",
               "name": "Bob Hoskins",
               "profile_path": "/mIgAC6q5HcHHxZUIiCOvE6mHLGs.jpg",
               "id": 382,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Winnie",
               "gender": 1,
               "credit_id": "52fe4725c3a36847f8125bab",
               "name": "Patricia Arquette",
               "profile_path": "/9Sz0M91CHHkJ5tlPteiXv34gpgK.jpg",
               "id": 4687,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Chief Inspector Heat",
               "gender": 2,
               "credit_id": "54678bc022136e1e13000385",
               "name": "Jim Broadbent",
               "profile_path": "/50TV6UKJKjmqdn1GQNuuCIYHLzP.jpg",
               "id": 388,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Stevie",
               "gender": 2,
               "credit_id": "52fe4725c3a36847f8125bc7",
               "name": "Christian Bale",
               "profile_path": "/2ocrTd8ChuUyJOzMuD4PsQw8eCB.jpg",
               "id": 3894,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Ossipon",
               "gender": 2,
               "credit_id": "52fe4725c3a36847f8125bbb",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Vladimir",
               "gender": 2,
               "credit_id": "52fe4725c3a36847f8125bc3",
               "name": "Eddie Izzard",
               "profile_path": "/j5hzBqmcyWG2GC754uACCoNgAvS.jpg",
               "id": 1926,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "The Driver",
               "gender": 2,
               "credit_id": "54678bd1eaeb8118b2000423",
               "name": "Peter Vaughan",
               "profile_path": "/z9ZplbTA1ojYhgZ8kJUKKhsJ7Gs.jpg",
               "id": 386,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Assassin (uncredited)",
               "gender": 2,
               "credit_id": "59e392e99251410b6700004f",
               "name": "Robin Williams",
               "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
               "id": 2157,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4725c3a36847f8125bb1",
               "name": "Christopher Hampton",
               "profile_path": "/7L7S5KHE21jFGL2IS1VXqQJxx9R.jpg",
               "id": 12952,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4725c3a36847f8125bb7",
               "name": "Christopher Hampton",
               "profile_path": "/7L7S5KHE21jFGL2IS1VXqQJxx9R.jpg",
               "id": 12952,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4725c3a36847f8125bcd",
               "name": "Joseph Conrad",
               "profile_path": "/e9K1LVshKNQUziyAgSrB3uCjMOZ.jpg",
               "id": 8327,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.007454,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 47199,
      "vote_count": 8,
      "budget": 0,
      "overview": "London of the late 19th century is a haven for political exiles of all sorts - refugees, partisans, anarchists. Verloc has made his living spying for the Russian goverment, an agent provacateur of sorts, while simultaneously providing information to the London police, specifically Chief Inspector Heat. When the new Russian ambassador demands he prove his worth or lose his salary, Verloc sets off a tragic chain of events that involves his pretty young wife Winnie, her retarded brother Stevie, and a figure called the Professor, whose fascination with explosives and destruction makes him the person to call on when Verloc needs a bomb.",
      "similar": [
         1637,
         4012,
         5413
      ],
      "original_title": "The Secret Agent",
      "runtime": 95,
      "poster_path": "/bFt9DI5Rwxu8ZXBMJMdYxh9ObPp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Capitol Films",
            "id": 826,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "World Film Music Limited",
            "id": 38436,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-11-08",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christopher Hampton"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Joseph Conrad",
         "Christopher Hampton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117582/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MjIzODgyOV5BMl5BanBnXkFtZTcwNzY3MjIzMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Bob Hoskins, Patricia Arquette, Gérard Depardieu | See full cast and crew »"],
      "reviews": [
         "I have no idea how this film review ended up on my page, but in typical IMDb fashion, after writing to them to have it removed (dozens of times) over the years, perhaps just overwriting it with this little bit of information is really best. IMDb? you out there? feel free to delete this review, I never heard of nor saw nor wrote a review for this film, so I'd appreciate it if you don't post things on my page that are not my content and delete them promptly when asked. oddly enough, films I had no involvement in at all were also on my page, and it took literally years of emails to UIMDB to eventually have them removed. Either they don't care or are really short on staff. But i really have no clue how a film review (for a film i never heard of nor saw) ended up on my page. Hope you enjoyed this more than some tripe about an unknown film, I really should have done this years ago. Au",
         "Joseph Conrad was a visionary. He realized that the society in which we live is imperfect and hypocritical. Over one hundred years ago he realized, as did Herman Melville and other great thinkers, that women do not enjoy an equal stature with men in society. So he chose to write a great novel that deals with this issue both subtly and forcefully. The Secret Agent is not what it may seem to some to be upon first reading or viewing -- i.e., a spy thriller. On the contrary, it is an in-depth analysis and portrayal of the relative powerlessness of most women in society. It does not preach. It does not advocate. Conrad leaves it up to the reader (or viewer in the case of the excellent movie version) to draw whatever conclusions are pertinent for that person. Thus it is art, because it creates an enduring impression that seems to come from the reader's or viewer's own mind. The movie version is superbly acted by a cast of master actors who quite clearly are very pleased to be participating with each other in creating this masterpiece movie. One gets the impression that each of the \"lucky\" actors has great respect for the book and its author and its messages, much as many Shakespearean players do when they \"give their all\" for the play. The result is a realistic heart-wrenching tragedy. This may explain why it is not favored among common moviegoers that want and expect a Hollywood happy ending. Instead they get the real world, superbly depicted. If you want fun, don't view this film. If you want to be challenged intellectually and ethically, then by all means watch it several times. And then tell your serious-minded friends and acquaintances about the existence of this movie. They will thank you! Professor JimBob",
         "London in the late 19th Century is a haven for all manner of political exiles. Verloc is an anarchist who has spent years in the employment of the Russian Government as a spy while also providing information to the London police. When Vladimir, the new Russian ambassador demands that Verloc start to prove his worth by bombing selected targets. Without a choice but to act, Verloc starts in motion a chain of events that will end with a bombing but hurt himself and his family in the process as it is only a matter of time before the police can find him \u0096 unless his \"colleagues\" can silence him first. Although the plot is fairly enjoyable, it is the delivery of the film that somehow stops it being anything more than interesting. The simple tale shuns the political detail that could have come and centres on the emotional drama around Verloc and his family, but it doesn't totally succeed in doing this to the point where it is enough to make the film work. The construction is good enough; Verloc's position is quite tense and the consequences had the potential to be quite impacting but it somehow never becomes as interesting as the material suggests it would. Part of this is the delivery, that is a bit uneven and unsure of itself but the most obvious weakness is the acting. Hoskins does as well as he can, but spread over the uneven material he comes over as a bit unsure of what he is meant to be doing. Regardless though, he is a big part of me sticking with the film as his character is effective. Of course, sharing his scenes with Arquette can only serve to make Hoskins look like a master of his trade in the same way that Arquette's make her look like some talentless waitress who was sleeping with the director (not that she was of course). Her accent is terrible of course, but this is only one failing in a performance that is wooden, emotionless and totally unconvincing. Support from Depardieu, Broadbent, Izzard, Bale and others adds colour and the impression of depth but none of them really work that well \u0096 Broadbent and Izzard in particular seem to add a slight comic touch that doesn't really fit. Williams has a small role but it is effective and memorable \u0096 just a shame that he seems to almost be in an entirely different film from the main narrative. Overall this is an OK film that is interesting enough to be worth seeing but it is hard to shake the feeling that nobody was totally sure what to do with it and the end result shows an uneven hand on the tiller. Hoskins helps it but Arquette is pitiful and the famous support cannot make up for her being so bad in so central a role.",
         "I'm constantly amazed how well Conrad is adapted by modern film makers. The political intrigue can be mostly ignored, as it is slight and not very interesting. What this movie does well is depict human emotions and reactions in difficult situations, and here is where the well picked cast delivers. Robin Williams is unbilled, but provides a fascinating character study of a true anarchist which contrasts nicely against Bob Hoskins' unwilling agent role. I was beginning to grow tired in the middle of the film, thinking the shallow political action was the ending, but the later intense focus on the human reactions and struggles following the incident do a wonderful job of drawing you back in.",
         "A very good film, if not quite a masterpiece.... This film aims very high, with every intention of obtaining stratospheric heights, but time restraints do not allow this film to fulfill it's full potential, and I think that the obvious effort put into the film by all involved, can produce a slight sense of disappointment in those who appreciate the film, and only increases the alienation of those who are not attuned to the themes of the film. Essentially, I think that the film's greatest flaw is that it is excessively abbreviated, and most characters are not able to be fully developed. This is partly the fault of Joseph Conrad, who wrote complicated and intricately plotted books, but the slow pace which adds greatly (and appropriately) to the atmosphere of the film, also prevents the insertion of additional scenes to develop the characters. This film could have been expanded into a masterpiece, but it would have been very long. To appreciate the film, one must grasp the nature of a large number of characters, and often there are only abbreviated cues to show the way. Thus a story about betrayals small and great, becomes a film of great betrayals. It appears that opinions are very polarized on the acting in this film, but I found most of the performances engaging, with the strong exception of Robin Williams, who seems to be mainly engaged in an attempt to break out of his comedy roles with the aid of a phony scowl. I should note that others disagree with my opinion of Robin Williams in this case however. I found the soundtrack (by Philip Glass) to be outstanding, with a traditional flavor as is appropriate to the film, but quite original.",
         "This is a very dark and mysterious piece of work that captures the sooty mood and gritty feel of Victorian London. Even the extras seem plucked, unbathed, right out of Limehouse and Whitechapel. An unshaven mad bomber is an odd role for Robin Williams. As always, he does it well but unfortunately Williams is Williams and all I could think of was Patch Adams. Bob Hoskins may be best portrayer of losers in all filmdom. Certainly his character here, Verloc, is a confused and pitiable loser. The plot is dark and even a little pointless. The sombre cinematography with its muted colours, deep shadows and European texture emphasizes the grim story of shattered lives . At times there is some needless \"creative\" camera work. Nevertheless this very unconventional film makes for a satisfying if, at times, puzzling couple of hours",
         "I would have chosen \"Never more timely\" for a title had the woman in NYC not taken it first. Robin Williams' fanatic could be any number of \"players in this morning's \"eve of war\" headlines: The \"End Times\" druids who currently have the ear of America's Chosen-By-God president comes to mind. Or Osama bin Laden's Shi'ite zealots. Conrad's literary genius is his ability to portray horror with the narrator's understatement and ambivalence. Bob Hoskins' film accomplishes this horrific understatement. Phillip Glass' (ordinarily no personal musical favorite) score gives the entire creepiness a magnificent auditory bas-relief. I wish I had voted it a \"10\" instead of merely \"9.\" Superb.",
         "Strange movie about a spy in Victorian London of the late nineteenth century. The atmosphere is very well achieved, the atmosphere of the film is sordid and depressing but convincingly transports you to the era. More like a chapter in a series that a feature film, but despite the many flaws that he may find it an interesting movie to watch. You have to give the thumbs up to this movie because it still has interesting pieces that make you gain some points, including an impressive soundtrack composer Phillip Glass, a very good atmosphere of nineteenth century London and the astounding performances of several of its players, among which stand out the little big man Bob Hoskins, actor Ben Kingsley board, for example, your physique does not exactly help when playing certain types of characters and a young Christian Bale showing the enormous versatility of this actor and ease you have to play all kinds of characters, in this case a guy with some mental retardation. The rest of the cast was pleasantly surprised registration change of actor Robin Williams, and Jim Broadbent little can be done with characters so poorly developed as its chief inspector, as the Frenchman Gerard Depardieu is not just weight in the history.",
         "\"The Secret Agent\", a novel by Joseph Conrad, had already been adapted for the screen. Alfred Hitchcock's 1936 film seems a masterpiece in comparison with this attempt by Christopher Hampton of a remake. Although both films are not exactly alike, this new version seems to suffer from a short vision that results in an uneven film. The first problem with this film appears to be the casting of Patricia Arquette in the pivotal role of Winnie. Her accent is wrong and the obvious age difference between her and Verloc doesn't help the film. It's curious to note that Mr. Hampton has done much better work as a screen writer as well as his work for the stage. Nothing of that talent is in clear evidence in the film. The film makers were lucky to get all the talent in the cast. Unfortunately the material doesn't suit Gerard Depardieu, or Robin Willimas, a good actor when he wants to do serious work, but not here. Bob Hoskins, Jim Broadbent, Christian Bale, Eddie Izzard and the great Elizabeth Spriggs, do all they can to make the film better, without much success.",
         "Whoever cares about international terrorism? It's just a boring subject, let's face it. Any objections? Well, I can understand if there are some. This film, however, might unexpectedly make you accept the truth of the above provocative statements. At least until the next time you zap to a TV news channel that is. It's hard not to see awesome potential in doing an adaptation of Joseph Conrad's 'The Secret Agent'. And it's hard to believe such a boring and inconsequential mess could be created following up on that very idea. Incredible, just think of the following issues explored in the movie: a web of anarchist militants finding political refuge in 1880s London, an agent provocateur run by the Russian embassy, a would-be suicide bomber, human drama complicating plots and counter-plots and so on. If I managed to excite you a little by mentioning these themes, so sorry, the film will still be boring. To say something positive, at least it's not altogether unwatchable and, totally unexpectedly for me, the scenes between two actors from whom I would have normally anticipated the least were actually some of the best moments of the film, the scenes between Robin Williams and Gérard Depardieu, both playing anarchists with a rather mysterious (anarchic?) mindset. Oh, and it's quite likely I'll read the book after all, for what I have seen at least was enough to convince me that it might be a good idea."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Capitol Films",
         "World Film Music Limited"
      ],
      "summaries": ["London of the late 19th century is a haven for political exiles of all sorts - refugees, partisans, anarchists. Verloc has made his living spying for the Russian government, an agent provocateur of sorts, while simultaneously providing information to the London police, specifically Chief Inspector Heat. When the new Russian ambassador demands he prove his worth or lose his salary, Verloc sets off a tragic chain of events that involves his pretty young wife Winnie, her intellectually disabled brother Stevie, and a figure called the Professor, whose fascination with explosives and destruction makes him the person to call on when Verloc needs a bomb."],
      "budget": 7000000
   },
   "movielensId": 1040,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-08",
      "dvdReleaseDate": "2005-06-07",
      "directors": ["Christopher Hampton"],
      "runtime": 95,
      "movieId": 1040,
      "title": "The Secret Agent",
      "mpaa": "R",
      "actors": [
         "Bob Hoskins",
         "Patricia Arquette",
         "Jim Broadbent",
         "Christian Bale",
         "Gérard Depardieu",
         "Eddie Izzard",
         "Peter Vaughan",
         "Robin Williams"
      ],
      "imdbMovieId": "0117582",
      "originalTitle": "The Secret Agent",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["I2dB0Fp7yFE"],
      "plotSummary": "London of the late 19th century is a haven for political exiles of all sorts - refugees, partisans, anarchists. Verloc has made his living spying for the Russian goverment, an agent provacateur of sorts, while simultaneously providing information to the London police, specifically Chief Inspector Heat. When the new Russian ambassador demands he prove his worth or lose his salary, Verloc sets off a tragic chain of events that involves his pretty young wife Winnie, her retarded brother Stevie, and a figure called the Professor, whose fascination with explosives and destruction makes him the person to call on when Verloc needs a bomb.",
      "tmdbMovieId": 47199,
      "avgRating": 3.37578,
      "releaseYear": "1996",
      "numRatings": 161,
      "posterPath": "/bFt9DI5Rwxu8ZXBMJMdYxh9ObPp.jpg"
   }
}