{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "painter",
            "id": 437
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "womanizer",
            "id": 9094
         },
         {
            "name": "mistress",
            "id": 11869
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "older man younger woman relationship",
            "id": 14669
         },
         {
            "name": "physical abuse",
            "id": 155794
         },
         {
            "name": "picasso",
            "id": 208710
         }
      ],
      "imdb_id": "tt0117791",
      "video": false,
      "title": "Surviving Picasso",
      "recommendations": [
         119415,
         102947,
         70180,
         150875,
         63988,
         47199,
         119173,
         47018,
         63848,
         54302,
         41776,
         31409,
         102059,
         37718,
         6393,
         80659,
         214163,
         67857,
         44968,
         11331
      ],
      "backdrop_path": "/3uN2ZaL0qou5Am013lNMGWrswi4.jpg",
      "revenue": 1985001,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Pablo Picasso",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df77f",
               "name": "Anthony Hopkins",
               "profile_path": "/btweZvSRBiE6jaMME93BSXeTQN6.jpg",
               "id": 4173,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Françoise Gilot",
               "gender": 1,
               "credit_id": "52fe45e0c3a36847f80df783",
               "name": "Natascha McElhone",
               "profile_path": "/vLiVvD6uRPaunzJEpfA0aPjtD1P.jpg",
               "id": 11317,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dora Maar",
               "gender": 1,
               "credit_id": "52fe45e0c3a36847f80df787",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Henri Matisse",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df78b",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 3
            },
            {
               "cast_id": 23,
               "character": "Großmutter von Françoise",
               "gender": 1,
               "credit_id": "5834c339c3a368287100aeda",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "564526d39251410a47006c7f",
               "name": "David L. Wolper",
               "profile_path": "/lJg7z4Orrc5hP7dQ9vJd0mIMnk8.jpg",
               "id": 3453,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "564526c09251410a44007043",
               "name": "Ismail Merchant",
               "profile_path": null,
               "id": 54448,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df77b",
               "name": "James Ivory",
               "profile_path": "/vj4PY2KciRCZWzT4eCdOoQfzoJs.jpg",
               "id": 54441,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "564525af9251410a4c006b24",
               "name": "Andrew Marcus",
               "profile_path": null,
               "id": 4868,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5645272292514133ab0064e7",
               "name": "Humbert Balsan",
               "profile_path": null,
               "id": 35524,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 1,
               "credit_id": "53204d1ac3a36824b5000271",
               "name": "Ruth Prawer Jhabvala",
               "profile_path": null,
               "id": 54443,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "56452257c3a36870d6006d4d",
               "name": "Arianna Huffington",
               "profile_path": "/8x27AjzLE8dOkgglWMaSjaE4unb.jpg",
               "id": 163555,
               "department": "Writing",
               "job": "Book"
            },
            {
               "gender": 2,
               "credit_id": "564523d3c3a36870d6006d7a",
               "name": "Tony Pierce-Roberts",
               "profile_path": null,
               "id": 3960,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5645255ac3a36870e3007311",
               "name": "Richard Robbins",
               "profile_path": null,
               "id": 54449,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5645259cc3a36870ec00683b",
               "name": "Celestia Fox",
               "profile_path": null,
               "id": 970,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56452732c3a36870ef006d38",
               "name": "Paul Bradley",
               "profile_path": null,
               "id": 1080783,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5645279e9251410a3f006ae0",
               "name": "Donald Rosenfeld",
               "profile_path": null,
               "id": 1043954,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "564527afc3a36870db00708d",
               "name": "Annette Kudrak",
               "profile_path": null,
               "id": 1427381,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 1,
               "credit_id": "564527c79251410a4400705c",
               "name": "Anna Worley",
               "profile_path": null,
               "id": 1389548,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "564527e79251410a47006c9a",
               "name": "Luciana Arrighi",
               "profile_path": null,
               "id": 17165,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "56452816c3a36870db007098",
               "name": "Carol Ramsey",
               "profile_path": null,
               "id": 10397,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56452840c3a36870ef006d67",
               "name": "Seth Rubin",
               "profile_path": null,
               "id": 1535091,
               "department": "Camera",
               "job": "Still Photographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.452337,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41843,
      "vote_count": 28,
      "budget": 16000000,
      "overview": "The passionate Merchant-Ivory drama tells the story of Francoise Gilot, the only lover of Pablo Picasso who was strong enough to withstand his ferocious cruelty and move on with her life.",
      "similar": [
         283227,
         1278,
         116,
         194,
         28468,
         59436,
         306819,
         244772,
         258,
         27066,
         36630,
         1628,
         713,
         339397,
         166,
         4507,
         303991,
         95610,
         255,
         1259
      ],
      "original_title": "Surviving Picasso",
      "runtime": 125,
      "poster_path": "/sarfAhGM1DH52BMPj4NosF7VnE0.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Merchant Ivory Productions",
         "id": 20740,
         "origin_country": ""
      }],
      "release_date": "1996-09-04",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Only his passion for women could rival his passion for painting.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James Ivory"],
      "runtime": 125,
      "synopsis": null,
      "writers": [
         "Arianna Huffington",
         "Ruth Prawer Jhabvala"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117791/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NTI4MTMwMV5BMl5BanBnXkFtZTcwMjE4ODcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anthony Hopkins, Natascha McElhone, Julianne Moore | See full cast and crew »"],
      "reviews": [
         "It's a pity that many of the user comments on this movie are simply a vehicle for people's dislike of Picasso, and that they treat the film as though it were a documentary. Picasso may have been as sex-mad, egocentric, paranoid and capricious as any Hollywood star (think Chaplin); but first and foremost he was a prodigious artist, who transformed our view of visual art, and dealt with some of the great themes of western culture. And presumably it was those latter qualities which drew women to him, in the same way that women have been drawn to successful, powerful men of dubious character since the dawn of time. The movie and Hopkins' performance are certainly successful in displaying Picasso's human weaknesses; but there is a failure to adequately convey Picasso's enormous creative power, a weakness compounded by the fact that the makers were not allowed to use much of his work in the film. I see the film as a well made, excellently acted, but partial (in both senses of the word) portrait of the artist. Its real focus is the women in his life, especially Francoise Gilot, and on the two-way exploitative nature of the relationship between a man of this kind and his mistresses/wives.",
         "The movie is about Francoise Gilot, not about Picasso. It is not intended to tell Picasso's story. Picasso was brilliant, spectacular, the living center of the world of art and a sexual magnet. Women wanted him and, king that he was, Picasso viewed their adoration as no more than his due. Francoise Gilot, a talented painter in her own right - but no Picasso - lives for ten years a life which for her is absolutely worth the pain. And when the pain is so grave that she will surely be overwhelmed, she stands up and leaves. The pain doesn't go away instantly, but it does go away, in time. In one memorable scene, Gilot, at home with the baby, questions Picasso's absences, his obvious womanizing. He tells her in no uncertain terms that he will do as he chooses, that his life outside their home is none of her business. She has no right to question him. He doesn't say, \"Take it or leave it,\" but that is the unmistakable message. She takes it, for a few more years, and another child. It would be interesting to know whether Gilot, who was born in 1921 and is apparently still with us, harbors regret. I cannot imagine that she does. Of course she would have enjoyed that ten years better if Picasso had been able to love, in some recognizable way. But would she trade that life for one less magnificent? For one that would not be a good movie? Hardly. The acting is of course perfect. Anthony Hopkins becomes the man Picasso. Natascha McElhone, Julianne Moore and Susanna Harker tell us the truth. Well paced, finely directed, this movie tells a riveting story. It is very, very good. It is perhaps worthy of note that many of the negative reviews of this movie are written by men. Picasso was not just difficult; he was a Difficult Man.",
         "I recognize James Ivory's talent, but except for this movie, never watch any of his movies for the second time, and this because his taste for stretched, out-of-date, heavy, static movies(see \"Howard's End\"). His predilection for adaptations for the big screen of a novel usually set in a time period when social standing was more of an issue than today, combined with his obvious taste for older actors, and not at last, his age, which unavoidably sets the pace of the movies he directs, makes him a favorite for an older audience. This is not the case here, where Ivory uses all his resources to the full extent, without sacrificing on freshness. The point of view is quite interesting placed as Françoise Gilot, a subjective, yet well informed observer, this imprinting a fresh and personal point of view to the account. Françoise has the right, and judges Picasso(although she knew what she was getting into), who clearly was a difficult man, but also, like all powerful personalities, was a much misunderstood man. In a sense it's an account of a meeting between an artistic genius with a common person, who unavoidably perceives him as an oddity; but how can one expect a man like Picasso to behave like a common man, when he was not one? Anthony Hopkins undergoes a complete transformation, and becomes the man Picasso, this only coming as further proof that a great artist can only be understood by another great artist, and the rest of us are just lucky spectators.",
         "I liked this movie quite a bit. It is not a very flattering portrait of the master, but it gives one insight into his art. Anthony Hopkins gives a convincing portrayal of the bad and the good qualities of the man. He had a charming playfulness about him which the women in his life fell for despite themselves and the knowledge of his reputation. Of course, his dark side was his maniacal desire for control of his women's lives, even after the romantic sides of their relationship had long since died. My question about those women is why they went out of their way to get into a relationship with him, knowing he had already ruined the lives of others. Francoise, the main character, thought herself strong enough to stave off any emotional harm he could do her, but when you get into a romantic relationship with someone, your reason disappears. Nobody's strong enough to not be hurt by someone they are emotionally involved with. The trick is to meet only the people who you feel reasonably sure will not do you harm. One would think an intelligent woman like Francoise would know that. If this were a piece of fiction, I would find it hard to believe, but given that the movie is based on fact.... This knowledge added a great deal to the intrigue of the movie, and a great deal of depth to the characters. The acting is first-rate. I've seen a few of the other movies in which Natascha McElHone has acted, but those parts were not large enough to show her range. I was extremely impressed. She has a very expressive face, capable of portraying an entire pallet of emotions, and, most importantly, she is obviously an intelligent woman, capable of convincingly playing an intellectual. Of course, the fact that she is elegantly drop-dead gorgeous has not colored my emotions about her performance one bit. Hopkins as usual does a brilliant job. I have never seen him express ebullience as he does here. He does a good job of showing how charming Picasso could be, supplying some motivation for why women fell for him, knowing his infamous past. Seeing this movie lent new meaning to some of his paintings which I have seen recently. There is a portrait of Dorra Marr (sp?) in the Belissario Hotel in Las Vegas. One half of it portrays a happy woman, the other half is tinged with sadness. I now know the story behind this painting, making it all the more memorable. Like the first reviewer, I'm not a big fan of Picasso, but knowing what lies behind some of his paintings will add interest in the future.",
         "Pablo Picasso portrayed by the only woman to have survived his narcissistic, manipulative, patronizing and womanizing tendencies and come out of the minotaur's labyrinth, his studio, before he shatters her. A great performance of the master painter and sculptor genius by Anthony Hopkins who is a master actor himself adequately next to his young co-stars. I am a great admirer of Picasso myself and I really appreciated all the research to fit every detail in its place to make this kind of biographical film. I'm very fond of the relationship Picasso had with Henry Matisse despite their differences and the competitiveness between them.",
         "A bio-pic on the life of artist Pablo Picasso focusing on his wilder side \u0096 his rampant relationships with his many women, as seen from the perspective and understanding of the mother of many of his children \u0096 Françoise Gilot.. We pick up the story where Gilot meets Picasso with the intention of becoming his student. I was slightly interested in this film as it seemed to have a high quality cast. I must admit that I have little interest in art and have a very limited knowledge of the work and life of Picasso. However I was open to learning and I hoped this film would enlighten me in some way \u0096 either in his work or his life. The film's focus is Picasso's private life rather than his work, this was an odd decision not to weave any of his work into the film in a significant way but it didn't put me off. What DID put me off was the fact that the film didn't involve me to the degree I had hoped it would. I'm not a consistent fan of Merchant & Ivory films simply because, unless they get it bang on (Remains of the Day) then they do leave me feeling a bit cold. Here that detached feeling was what I had the whole way through \u0096 I never felt for any of the characters or situations and never really got involved in the film, it was simply on in the same room as I was sitting more than me watching it. It's a shame because the film is beautifully made \u0096 for all their faults, Merchant & Ivory films usually get that right. The sets and locations add to the film and are well shot. The cast is the main reason for watching this. Hopkins does very well in the lead and is running free for much of it. It confused me that I couldn't manage to link to his character \u0096 maybe I was watching Hopkins act as opposed to seeing the character. It's ironic that his best performance for Merchant & Ivory was the total opposite of this in Remains of the Day (controlled, low key, subtle). McElhone is partly responsible for me not feeling involved in the film. I felt she was too cold, too emotionless and not expressive enough in the lead female role. Good support is given by Moore and others, and Ackland is good as Henri Matisse. Overall this is not as awful or boring as some would have you believe \u0096 Hopkins performance saves it from being that. But it did not involve me at all \u0096 I was left quite cold to it even though the passion in Hopkins' performance made me think I was missing something. It's hard to put into words but this film doesn't manage to hold the interest \u0096 not because of the subject, but more likely in the way it has been delivered.",
         "The first time I watched this, I didn't really get what was going on. All the plots about Picasso's various wives seemed mixed up and uninvolving. However, now that I am studying Picasso and his women for an AS art module, I can watch the film and feel very satisfied because it breathes a lot of life into the subject. For this reason it is worth having some fore-knowledge or a framework of Picasso's life prior to viewing it, which I guess restrains the target audience somewhat. Hopkins was superb and became Picasso completely in behaviour and physique - even to the extent of shaving his head and wearing brown contact lenses. His accent took a while to take hold though, which I thought was odd, as the early scenes felt very cold and welsh simply because he hadn't quite shaken off his normal speech. This didn't matter after a while though, because his entire manner was actually very well done and really brought out the macho and possessive ego of this wild artist. One major flaw however: Nazi stormtroopers would never march as sloppily as portrayed in this picture.",
         "As far as context goes, I had already known most of the material from biographies in other sources. There were only a couple new aspects to this one. The acting was superb. Anthony Hopkins and Natascha McElhone were passionate and believable. It portrays Picasso's nature as narrated by one of his former lovers. It's NOT a fluff piece, but you shouldn't end up hating him unless you did already.",
         "Magnificently crafted exploration of the question, how does a seeming despot generate such passion and devotion from the women around him. The high points are many but what makes the greatest mark is the flawless timing, throughout; then, of course, Hopkins completely lives the lead while McElhone preserves the central conundrum, the impossibility of the relationship(s). Forget the Picasso figure - apart from forming a setting and contributing the element of fame (I almost added \"genius\" but that's absolutely irrelevant, too), any similar figure would do, quite irrelevant to the point of the story which is to amplify the tension to be found in varying degrees in every one of our relationships. Extremely stimulating and provoking - not a must-see for 80s feminists.",
         "I saw this film initially in 1996. I remember having to work in the morning and had a few hours to kill in the afternoon. I decided to give it a try, because it starred Anthony Hopkins and I'm a fan. Being a Merchant Ivory film I thought it was going to be boring. It wasn't. It held my interest until the ending credits. I sat amazed when it was finished....just processing what I had just witnessed. Pablo Picasso has to be one of the most complex of human beings ever. Surviving Picasso chronicles his love affair with Françoise Gilot. He spent from 1944 to 1953 with her, and fathered two of her children, but wouldn't marry her. Gilot is realistically played by Natascha McElhone. We get to see how difficult Picasso was to live with. Anthony Hopkins plays an emotionally weak, yet tyrannical genius. Literally, holding this young woman hostage. He was the father of her children, but never gave her any monetary compensation to raise those kids. She had to depend upon the kindness of her grandmother. Of all of his women, we start to see that she alone understood his weaknesses. I got the impression that out of all of the women he was involved with, she probably loved him the most. He knew this and used this to hold her his emotional prisoner. Surviving Picasso is not an easy film to sit through. You begin to hate Picasso for manipulating everyone he comes in contact with. My thought was that he was a spoiled child that never grew up. He relished when his women fought over him, pined over him, and even did desperate things to show him how much they loved him. Yet, he didn't seem to appreciate any of their efforts. I was totally drawn into this film and think one needs to give it a chance. It's a thinking person's film. The character development is complex, but you begin to have sympathy for the victims of this madman."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Merchant Ivory Productions",
         "David L. Wolper Productions"
      ],
      "summaries": [
         "In 1943, a young painter, Françoise Gilot (1921- ) meets Pablo Picasso (1881-1973), already the most celebrated artist in the world. For the next ten years, she is his mistress, bears him two children, is his muse, and paints within his element. She also learns slowly about the other women who have been or still are in his life: Dora Maar, Marie- Thérèse (whose daughter is Picasso's), and Olga Koklowa, each of whom seems deeply scarred by their life with Picasso. Gilot's response is to bring each into her relationship with Picasso. How does one survive Picasso? She keeps painting, and she keeps her good humor and her independence. When the time comes, she has the strength to leave.",
         "The passionate Merchant-Ivory drama tells the story of Francoise Gilot, the only lover of Pablo Picasso who was strong enough to withstand his ferocious cruelty and move on with her life."
      ],
      "budget": 16000000
   },
   "movielensId": 1044,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1996-09-04",
      "dvdReleaseDate": null,
      "directors": ["James Ivory"],
      "runtime": 125,
      "movieId": 1044,
      "title": "Surviving Picasso",
      "mpaa": "R",
      "actors": [
         "Anthony Hopkins",
         "Natascha McElhone",
         "Julianne Moore",
         "Joss Ackland",
         "Joan Plowright"
      ],
      "imdbMovieId": "0117791",
      "originalTitle": "Surviving Picasso",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["eGLZtHk2oNQ"],
      "plotSummary": "The passionate Merchant-Ivory drama tells the story of Francoise Gilot, the only lover of Pablo Picasso who was strong enough to withstand his ferocious cruelty and move on with her life.",
      "tmdbMovieId": 41843,
      "avgRating": 3.3271,
      "releaseYear": "1996",
      "numRatings": 535,
      "posterPath": "/sarfAhGM1DH52BMPj4NosF7VnE0.jpg"
   }
}