{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italian american",
            "id": 700
         },
         {
            "name": "restaurant",
            "id": 1946
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0116928",
      "video": false,
      "title": "Love Is All There Is",
      "recommendations": [],
      "backdrop_path": "/wu9dgeJvIi7I4DdBkRdHVcHuapa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gina Malacici",
               "gender": 1,
               "credit_id": "52fe48b9c3a36847f8176185",
               "name": "Angelina Jolie",
               "profile_path": "/6tocswK39SrSjZIRDaTpVyPxDz8.jpg",
               "id": 11701,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sadie Capomezzo",
               "gender": 1,
               "credit_id": "52fe48b9c3a36847f8176189",
               "name": "Lainie Kazan",
               "profile_path": "/qI20obSkCyWbo13xh20rWeUuMXp.jpg",
               "id": 53647,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Piero Malacici",
               "gender": 2,
               "credit_id": "52fe48b9c3a36847f817618d",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Miss Deluca",
               "gender": 2,
               "credit_id": "52fe48b9c3a36847f8176191",
               "name": "Connie Stevens",
               "profile_path": "/nhVnIonVhPmN7EBJGm8XBOXL0O2.jpg",
               "id": 95476,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rudy",
               "gender": 2,
               "credit_id": "52fe48b9c3a36847f8176195",
               "name": "Abe Vigoda",
               "profile_path": "/luWKPNb58IgJ2ovrtgPAzHGLLYL.jpg",
               "id": 3093,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe48b9c3a36847f8176199",
               "name": "Joy Behar",
               "profile_path": "/uiST4ZJPBDFb19fcsNaNovhTDrS.jpg",
               "id": 166772,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Monsignor",
               "gender": 2,
               "credit_id": "52fe48b9c3a36847f817619d",
               "name": "William Hickey",
               "profile_path": "/zr7UJxP5MdEksn6ZaxeHbwr6o5Z.jpg",
               "id": 21282,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mona",
               "gender": 0,
               "credit_id": "52fe48b9c3a36847f81761a1",
               "name": "Renée Taylor",
               "profile_path": "/3WYu7Je7lT47KtayiavBL5kAQLA.jpg",
               "id": 56105,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Mike Capomezzo",
               "gender": 2,
               "credit_id": "5468d38522136e68d5000f46",
               "name": "Joseph Bologna",
               "profile_path": "/yhknyDtNpyDo2kbvkR1gP0Ud5B3.jpg",
               "id": 46946,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Maria Malacici",
               "gender": 1,
               "credit_id": "5468d396eaeb816b4600101b",
               "name": "Barbara Carrera",
               "profile_path": "/zmuNNytZ5w3ewWC6ShWeqFZl49c.jpg",
               "id": 10938,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Dr. Rodino",
               "gender": 2,
               "credit_id": "5468d3a8eaeb816b55001078",
               "name": "Dick Van Patten",
               "profile_path": "/mAYJ9Psvz3JQAvHXDwdcegO3Wok.jpg",
               "id": 14671,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Rosario Capomezzo",
               "gender": 2,
               "credit_id": "5468d3c2eaeb816b46001022",
               "name": "Nathaniel Marston",
               "profile_path": "/q9r3UyrRKWdHTkx8WzO5BT0fS8S.jpg",
               "id": 211998,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Mr. Federico",
               "gender": 2,
               "credit_id": "59c63bdf9251415b6e03dbf2",
               "name": "Ronald Maccone",
               "profile_path": "/ffEKUmCHFYhYFIGknT4snW8mqRX.jpg",
               "id": 233121,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Party Guest (uncredited)",
               "gender": 0,
               "credit_id": "59ebb517c3a3685d1d01628f",
               "name": "Emanuele Secci",
               "profile_path": "/k7sPSrNKZXdS5mNl4ualvyAmEEr.jpg",
               "id": 1091567,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48b9c3a36847f8176181",
               "name": "Joseph Bologna",
               "profile_path": "/yhknyDtNpyDo2kbvkR1gP0Ud5B3.jpg",
               "id": 46946,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5468d34422136e68d2000f94",
               "name": "Gabriel Bologna",
               "profile_path": null,
               "id": 92029,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5468d34feaeb816b58000e98",
               "name": "Joseph Bologna",
               "profile_path": "/yhknyDtNpyDo2kbvkR1gP0Ud5B3.jpg",
               "id": 46946,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5468d35922136e68c90011e3",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "5468d36622136e68da000e95",
               "name": "Erik Shapiro",
               "profile_path": null,
               "id": 1214815,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5468d37122136e68c90011e9",
               "name": "Renée Taylor",
               "profile_path": "/3WYu7Je7lT47KtayiavBL5kAQLA.jpg",
               "id": 56105,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.009344,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 55058,
      "vote_count": 2,
      "budget": 0,
      "overview": "This fast-paced and funny twist on Romeo And Juliet is an \"extremely funny film\" (WBAI Radio)! Oscar winner Angelina Jolie (Lara Croft: Tomb Raider) and Lainie Kazan (My Big Fat Greek Wedding) star in this tale of rival Italian catering families that serves up laughs, love and \"a touching slice of home cooking\" (Variety)!",
      "similar": [
         1259,
         8067,
         24420,
         13,
         696,
         1643,
         316021,
         413471,
         72207,
         3134,
         109689,
         10995,
         8012,
         17612,
         1024,
         979,
         627,
         769,
         4771,
         562
      ],
      "original_title": "Love Is All There Is",
      "runtime": 105,
      "poster_path": "/g0jawVk80QDN85kYMQl9idK1Rfh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cinema 7",
         "id": 38555,
         "origin_country": ""
      }],
      "release_date": "1996-05-10",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "...a comedy of pasta, passion and parents.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Joseph Bologna",
         "Renée Taylor"
      ],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Gabriel Bologna",
         "Joseph Bologna"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116928/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1ODEyMTg3M15BMl5BanBnXkFtZTcwNzgzNzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lainie Kazan, Joseph Bologna, Barbara Carrera | See full cast and crew »"],
      "reviews": [
         "A delightfully unpretentious send up of Romeo and Juliet. Approach with no expectations other than having a good time and you will enjoy this one. A talented group of comic actors let go and have a riot in this light-hearted performers' vehicle. Bad reviews were due to a snobbishness about treatments of Shakespeare. Some people feel that all film must be \"important\" ---If you share those views, don't bother. The credits read \"introducing\" Angelina Jolie, which is not even close to being true, but she is astoundingly beautiful as the Juliet character, and, as always, her acting is wonderful--- and, considering her age at the time, even her dialect is pretty good. Recreating this classic tale with feuding Italian families in the catering business in New York results in great fun. See it in the right frame of mind and you will laugh out loud.",
         "Love Is All There is a funny movie. It's basically an adaptation of Romeo and Juliet, Italian-American style. Two teenagers fall in love, much to the disgust of their feuding parents who own competing catering companies. Lanie Kazan is Rosarios (aka Romeo's) mother who is always going to this nutty psychic-type lady who gives her some obscure clues that her dear son is going to fall in love with someone and forget all about his mother. It turns out that the girl is Gina (aka Juliet) played by Angelina Jolie. So the feuding parents go all out to stop the two from falling in love, and ridiculously enough, the 16 year-olds want to get married at the end. The movie is hilarious, though some of the other comments posted by other views would probably discourage people from viewing the movie. Sure, the entire love affair between the son and daughter is so stupid. But, I guess that's to be expected since they're just supposed to be dumb teenagers in love. In fact, the real gems of the movie are the parents, particularly Lanie Kazan's role, and the wacky psychich (Joe Bologna's real life wife) because they are just totally wacko people, so it turns out to be a totally wacky comedy. One that I sure enjoyed. I think it's worth a shot.",
         "A sweet story of first love, emoting Romeo and Juliet in a modern American setting. The whole thing is played as a farce, as between the grownups who are trying to (over)protect their children. Angelina Jolie gives a totally charming performance, that resonates with one's romantic side (if one has that). If you like the actress, you have to have this movie. A fun movie without any message other than, that love is all there is. If it was available on DVD I would buy it in a minute!",
         "I, too, stumbled upon this movie late one night on cable, and woke my husband up laughing and punching him in the ribs! Renee Taylor and Joe Bologna are funny, funny people (loved him in \"Blame It On Rio\") Lainie Kazan was perfect as his wife, and Paul Sorvino is just a GREAT actor. Didn't realize till later that this must also have been one of Angelina Jolie's first roles. As a participant/guest/victim of many Italian wedding extravaganzas, I loved it. A New Yawk version of \"Blazing Saddles\". Four out of five stars from me!",
         "Never saw this film until it was on late-nite TV. My husband still has bruises from my pounding on him to wake up! I laughed until I cried! The cast...goes without saying...magnificent. Bravura performances by all. Being brought up in an old-fashioned Italian neighborhood, I was able to identify with so many of the \"grownups\" in my past. If you're really bummed, your checking account balance is in red, the IRS is after you, and your sinus headache is keeping you awake, find this film. It will cure all that and smooth out your hangnails, too!",
         "First off, let me say I have wanted to see this movie for about a year now because I knew Angelina Jolie was in it and I love her. But my love for her has nothing to do with my opinion of the movie. Anyhow, no video stores carried it but low and behold the local library did. I watched it and absolutely loved it. Yes there were Italian stereotypes but it was done well and funny. It was not degrading in any way. Every actor and actress did a superb job. I laughed very hard at the sexual humor. Overall, I think this movie is well worth seeing if you can find it. It is adorable and just plain fun to watch. I rarely rank movies as a 10 but I give this one a 10!!! Go find it and watch it!",
         "***SPOILERS*** ***SPOILERS*** This Italian-American farce is one of those intentionally \"so bad it's good\" sorts of movies. It's a decidedly B movie, but it's campy fun. She radiantly plays an angelicly pure but smoldering 16 year old princess, more than ready to pop the cork on her sexuality, previously successfully guarded by her parents. Phew!!! It's her youngest soft, romantic type role. \"I'm crazy in love with you Rosario\". \"My parent's don't like any man for me. Especially they don't like you. Because you are sexy, and dangerous.\" \"Be tender with me Rosario. I'm a virgin.\" In what other movie will you get to see Anglina lose her innocence??? (Well, maybe in Cyborg 2. There she's a kick boxing sex assassin robot though, so perhaps it doesn't count.) Of course \"Love is All There Is\" fully intends to be campy. It's a broad humor romp though 60's or 70's Italian working class bad taste, mixed with endearingly warm personalities and high sex drives. It's plot is a reprise of the Romeo and Juliette story, played with an in your face lack of subtlety. The unlikely 16 year old couple are the children of two rival NYC Bronx (City Island) catering families, brought together by their roles in a community play. It's staged by Gina's (Jolie) parents to attract the goodwill of the bedrock S. Italian working class (culturally, if not necessarily economically) community, which is crucial for their business success. They are titled Florentines, but economically reduced enough to be trying to make a big success in the same business and community where Rosario's (the Romeo) parents are better established, in a down scale sort of way. Rosario's parents' have decidedly working class S. Italian roots (like most of New York's, and America's, Italian community) and working class taste, although they have made good, if precariously, in the local wedding banquet business. Of course the stage kisses that really bring this couple together become vastly overheated by their ripe sexuality and first love passion. Jolie's father is horrified, and the onlooking S. Italian women from grandmothers to teenagers become overheated in sympathetic excitement. Their impetuous, reckless romance then proceeds at a galloping pace in their real lives, while the two families try to keep the two apart for their class different but essentially similar reasons. The humor is often too broad to feel just right, though it nearly always scores some sort of hit. You tend to wince through some of it. You also can't help but chuckle or laugh at other parts. There is no doubt that the direction in this movie was always to overact, to make characatures of all the parts, and that's just what the actors do. Paul Sorvino was at the time the big name here and is only so-so, but Barbara Carrera, who though stunning is usually a poor actress given limited eye candy sorts of parts, is actually very good here as a haughty aristocrat. (She's most famous as Fatima Blush in some Bond films.) Anglina Jolie is one of the few who doesn't overact -- though the others no doubt do so by design. She's absolutely radiant as a previously virginal but precociously sexually overflowing 16 year old. It's easy to suppose the whole farce was structured around her -- though at the time she was a little known fledgling actress. The conflict between Northern and Southern Italian culture, often symbolized by the cuisine of these feuding catering families, is a running joke -- sort of. Jolie is seen holed up in her room at one point, with a plate of elegant N.Italian butterfly pasta, with a thin white sauce, left untouched. (It looks right out of countless Manhattan northern Italian restaurants.) Meanwhile Rosario's parents are given to roccoco four food wedding cakes, to impress their mostly seriously overstuffed clients. Their house is filled with elaborately awful 'sculpted' plastic objects, and the like. In one hilarious scene, Rosario and his buddies make good on their scheme to snatch Gina from her parents by staging a chaotic diversion at their northern Italian style catering hall. They sabotage the pale pink pasta sauce warming in a huge sliver serving dish by -- horror of horrors -- pouring in a huge cooking pot's worth of dark red tomato sauce!! The guests start gaging at the results, of course. Well, it's all worth it for the still virtually teenage, way beyond luscious, Angelina.",
         "Angelina Jolie in a role showing a charming sweetness to an even higher degree than in 'Playing by Heart'. The courtship plays out against a somewhat contrived background of Italian family rivalry, somewhat reminiscent of Romeo and Juliet, but with a Hollywood happy end, even though with heavy handed ethnicity thrown in. If this movie was available on DVD I would buy it in a New York minute ;-). Fun entertainment for the whole family. No doubt I am prejudiced since I really like Angelina, but then what's not to like about her (forget about her personal life)? Charming.",
         "Class. This film ain't got it. Laughs. This film has. This is a wacky sort of low class version of \"Romeo And Juliet\", and I imagine Shakespeare is rolling over in his grave every time it's shown on cable. But I laughed. Out loud. It's a remarkably good cast. Lainie Kazan -- one of America's most underrated performers -- is great here as a klitzy Italian mother. Joseph Bologna is fine as her husband...together they own a very pedestrian Italian restaurant. Paul Sorvino is genuinely funny as another Italian restaurateur...but a classy one. Barbara Carrera, as his wife, did not impress me. Not everyone impresses here. I never got the attraction to William Hickey, who here plays a priest (which is ironic, as the priest in my home town when I was growing up was Father William Hickey). Dick Van Patten is fine...he has virtually no speaking part. Abe Vigoda is wasted, and has little more than a few lines here and there. Connie Stevens...why? Interesting to see an appearance by Joy Behar. The two lovers? Well, buckle your seat belts. Angelina Jolie is rather unattractive and demonstrates little acting ability...in a performance I'm sure embarrasses her today. On th other hand, Nathaniel Marston is perfect as the boy. Want a few belly laughs? Like ethnic humor? Then you'll probably enjoy this goofy film. I did.",
         "I love the cast of this film which reads like a great party. Real-life couple Renee Taylor and Joseph Bologna adapts Romeo and Juliet to contemporary Italian families living on City Island in the Bronx. They filmed this film mostly on location. It's worth noting that Angelina Jolie makes her debut as well. Taylor plays a psychic while Bologna plays the Rosario's father who runs a wedding hall on the island. His wife is played by the wonderful Lainie Kazan who seeks spiritual assistance with Mona played by Taylor. Joy Behar also has a small role in this film as one of the Italian wives and mothers. The movie is set around July 4 where the local play is Romeo and Juliet. A mishap causes the original Juliet to lose the role. Then comes Jolie's Regina into the role. Regina and Rosario fall in love as quickly as Romeo and Juliet but it doesn't end badly. Paul Sorvino and Barbara Carrera play Regina's parents who also own a wedding hall."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Cinema 7"],
      "summaries": [
         "The Capomezzo's and the Malacici's are Italian-American families who are also rivals in the catering and restaurant business. Things come to a head when the Capomezzo's son and the Malacici's daughter get thrown together for the leads in a Romeo & Juliet community play. As the parents continue butting heads, the children fall in love and hilarity ensues.",
         "Romeo & Juliet gets transplanted to the Bronx."
      ],
      "budget": 0
   },
   "movielensId": 1045,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-10",
      "dvdReleaseDate": "2004-01-13",
      "directors": ["Joseph Bologna"],
      "runtime": 105,
      "movieId": 1045,
      "title": "Love Is All There Is",
      "mpaa": "R",
      "actors": [
         "Angelina Jolie",
         "Lainie Kazan",
         "Paul Sorvino",
         "Connie Stevens",
         "Abe Vigoda",
         "Joy Behar",
         "William Hickey",
         "Renée Taylor",
         "Joseph Bologna",
         "Barbara Carrera",
         "Dick Van Patten",
         "Nathaniel Marston",
         "Ronald Maccone",
         "Emanuele Secci"
      ],
      "imdbMovieId": "0116928",
      "originalTitle": "Love Is All There Is",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["yZXapOBN--0"],
      "plotSummary": "This fast-paced and funny twist on Romeo And Juliet is an \"extremely funny film\" (WBAI Radio)! Oscar winner Angelina Jolie (Lara Croft: Tomb Raider) and Lainie Kazan (My Big Fat Greek Wedding) star in this tale of rival Italian catering families that serves up laughs, love and \"a touching slice of home cooking\" (Variety)!",
      "tmdbMovieId": 55058,
      "avgRating": 3.02941,
      "releaseYear": "1996",
      "numRatings": 51,
      "posterPath": "/g0jawVk80QDN85kYMQl9idK1Rfh.jpg"
   }
}