{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "summer",
            "id": 13088
         },
         {
            "name": "gay man",
            "id": 33458
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0115640",
      "video": false,
      "title": "Beautiful Thing",
      "recommendations": [
         15708,
         24584,
         342,
         19375,
         17483,
         4927,
         26032,
         27215,
         17614,
         4369,
         15179,
         15728,
         12839,
         39517,
         18923,
         44282,
         26630,
         14681,
         26823,
         8463
      ],
      "backdrop_path": "/4bAOF4GDuanIiUjRinlfzk1sjaD.jpg",
      "revenue": 1500000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sandra Gangel",
               "gender": 1,
               "credit_id": "52fe43d59251416c7501fdf3",
               "name": "Linda Henry",
               "profile_path": "/xbtqT2eys23IiIljoC6mJzxQHz3.jpg",
               "id": 42582,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jamie Gangel",
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fdfb",
               "name": "Glen Berry",
               "profile_path": null,
               "id": 67568,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Ste Pearce",
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fe33",
               "name": "Scott Neal",
               "profile_path": null,
               "id": 218689,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "Leah",
               "gender": 1,
               "credit_id": "52fe43d59251416c7501fe43",
               "name": "Tameka Empson",
               "profile_path": "/YJyKLKoNWgtFEL1W56F5yEVHQp.jpg",
               "id": 97434,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Tony",
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe47",
               "name": "Ben Daniels",
               "profile_path": "/x6MI4Fdz1XbERbNbXYoxTK6NAgv.jpg",
               "id": 27632,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Miss Chauhan",
               "gender": 1,
               "credit_id": "52fe43d59251416c7501fdf7",
               "name": "Meera Syal",
               "profile_path": "/1B8uEf17DUJwbvVvSQNI0nExNuh.jpg",
               "id": 6975,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Ronnie Pearce",
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fdff",
               "name": "Garry Cooper",
               "profile_path": null,
               "id": 27323,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Jayson",
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe37",
               "name": "Andrew Fraser",
               "profile_path": null,
               "id": 214356,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Lenny",
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fe3b",
               "name": "John Savage",
               "profile_path": "/4cNKdr2E2gAvAjjydcwJGscoBsD.jpg",
               "id": 47879,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Rose",
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe3f",
               "name": "Jeillo Edwards",
               "profile_path": null,
               "id": 162488,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Kevin",
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe4b",
               "name": "Terry Duggan",
               "profile_path": null,
               "id": 210166,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Marlene",
               "gender": 1,
               "credit_id": "5891135f92514103fa00b161",
               "name": "Anna Karen",
               "profile_path": "/syHvianeYumBsaqWYRQZUcoENfr.jpg",
               "id": 84360,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Gina",
               "gender": 0,
               "credit_id": "5891138292514103f300bf9b",
               "name": "Julia Lee Smith",
               "profile_path": null,
               "id": 63271,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Trevor",
               "gender": 0,
               "credit_id": "58911398c3a36838ff0009d9",
               "name": "Daniel Bowers",
               "profile_path": null,
               "id": 1748280,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Mr Bennett",
               "gender": 0,
               "credit_id": "589113ad92514103fd00b6b4",
               "name": "Martin Walsh",
               "profile_path": null,
               "id": 1462325,
               "order": 14
            },
            {
               "cast_id": 29,
               "character": "Petra",
               "gender": 0,
               "credit_id": "589113b9c3a368701700c257",
               "name": "Jonathan Harvey",
               "profile_path": null,
               "id": 67572,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe05",
               "name": "Hettie MacDonald",
               "profile_path": "/ryO5yz8GOodefNXLMWa8ECahNPm.jpg",
               "id": 67570,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fe0b",
               "name": "Jonathan Harvey",
               "profile_path": null,
               "id": 67571,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe11",
               "name": "Jonathan Harvey",
               "profile_path": null,
               "id": 67572,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fe17",
               "name": "Tony Garnett",
               "profile_path": "/f94R5eMigA3QMjlSvX5t6Ayl8Sf.jpg",
               "id": 21841,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe1d",
               "name": "Bill Shapter",
               "profile_path": null,
               "id": 67573,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fe23",
               "name": "John Altman",
               "profile_path": null,
               "id": 32347,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d59251416c7501fe29",
               "name": "Chris Seager",
               "profile_path": null,
               "id": 34004,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d59251416c7501fe2f",
               "name": "Don Fairservice",
               "profile_path": null,
               "id": 67574,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.653043,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 10938,
      "vote_count": 99,
      "budget": 0,
      "overview": "A pair of teenage boys growing up in a working-class neighbourhood of Thamesmead, in south-east London, become aware of their homosexuality. While both were vaguely aware they might be gay, neither had ever acted on their impulses. Once they decide that they're attracted to each other, neither is sure just what to do.",
      "similar": [
         449176,
         184352,
         26280,
         338189,
         413666,
         380874,
         47643,
         322127,
         160165,
         26933,
         383526,
         258034,
         26371,
         376867,
         398818,
         4927,
         425193,
         428493,
         383559,
         52799
      ],
      "original_title": "Beautiful Thing",
      "runtime": 90,
      "poster_path": "/8z1ZkZoznIGLyx4xHEaQNZqG63D.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "World Productions",
            "id": 10532,
            "origin_country": ""
         }
      ],
      "release_date": "1996-06-21",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hettie Macdonald"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Jonathan Harvey",
         "Jonathan Harvey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NTkyNjQ2NF5BMl5BanBnXkFtZTYwODU4Mjg5._V1_.jpg",
      "actors": ["Stars: Glen Berry, Linda Henry, Meera Syal | See full cast and crew »"],
      "reviews": [
         "This is one of those great British dramas set in a typically grim environment but shot with positivity throughout. Having grown up around the area in the film and being only a few years older than the featured boys, it was a joy to see life there depicted in the film. I agree with all previous comments about the actors and how true-to-life it feels. Although slightly exaggerated in places, this film is a great comment on London working class life as well as being focused around a gay-based storyline. However, I wanted to add that this film also comments on the complex class system in the UK which explains why Tony was dropped by Sandra. Many non-British viewers may not have picked up on this. Thoughout, Tony is shown as a middle class character who doesn't really fit into the working class environment. He uses different slang words to the others, has a 'posher' accent and has slightly different attitudes to all the other characters. He and Sandra come from different worlds. As Sandra says, she has been fighting all her life, whereas he has had evertyhing given to him on a plate. Ultimately, this relationship was never going to last. Life in London (and the UK) is still spilt into different social classes, although they do mix a little more than they used to. But you can often tell where someone is from by their accent and their choice of words. This was used to great affect in the film. Overall, a light-hearted look at life on a London council Estate with some great performances... one of my favourite films.",
         "Gay or straight, this is one of the finest movies ever made about self discovery and teenage love. Albeit the end is a little wishful and optimistic, the characters and situations are perfectly developed and realized, ringing true in almost every scene. This movie makes me smile on every level...from the way the two boys discover their affection for one another, the wonderful comedy relief from the next door neighbor Leah (and her relationship with the entire tenement population), and the perfect choice of soundtrack music from Mama Cass that, at times, seems written specifically for certain scenes and works on both a nostalgic and familiarity level. This movie gets better with every viewing...and I'd love to see what happened to each of the characters in a sequal. This movie is, without a doubt, very personal to all gay men and women who came out during their youth and a favorite of all of my friends, both gay and straight.",
         "Glad to be gay - that's what this movie made me feel. I came out of the cinema feeling ecstatic. At last, they let us have a movie with a happy ending!! One where we weren't crippled by prejudice or dying of AIDS or mincing around in a feather boa. Awesome! It's not realistic - lets be honest. And this despite its gritty setting and ripe dialog. But who cares. After 100 years of cinema we deserved a \"Hollywood\" ending. I hope straights get as much out of this as I do from a great \"straight\" romance movie. No reason why they shouldn't. We've been watching their stuff quite happily for years. Oh, and a quick nod in the direction of Mama Cass Elliot. Her musical legacy - one that had been largely neglected prior to the movie's release - provided the film with its awesome soundtrack. I bought the movie and CD. Her voice is enough to brighten up the dullest of days.",
         "It seems when it comes to gay-themed movies, the Brits outdo us Americans hands down. This movie is another example of this fact. This movie rates as one of the best in this genre. Get Real comes a close second. The young actors that play Jamie and Ste do an extraordinary job sometimes forgetting how well they pull off such complex characters throughout the movie. I think any gay man growing up can relate to Jamie. He doesn't excel in sports, and almost too smart for his own mother. He is comfortable with his sexuality, and he doesn't give a damn what the world thinks of him. Ste, on the other hand, fears his older brother, and his father made his life miserable. As he states in the film, \"they made me ugly\". Ste is not all ugly, and Jamie realizes this, and is attracted to his brash, manly demeanor. Unfortunately, Ste's own demons and his insecurities are present throughout the film. At one point, Ste ashamed of rumors of his questionable sexuality, denies it to a heartbroken Jamie. Obviously, I enjoyed this movie. The scenes between Jamie and his mother and likewise, between Jamie and Ste, are perhaps the best parts of the movie. I understand having Leah in the movie to provide the supporting role of comic relief was a necessity in most film requirements, but in this one, it distracted the viewer to an extent. I was so glad when it came out on DVD, so I can put my last VHS tape to rest, but disappointed that there were no cast interviews or extras at the end. Granted, the movie was made six years or so after the DVD came out, but you might think the film makers would find something of interest. So England what will be the next great gay movie ?",
         "A wonderful story of gay teenagers that is ideal for parents to show their children; so that they understand that gay people may be different, but not bad. Faithful to the play, great music score and gives a real feeling of English tenements.",
         "Never have I seen such a simple film that was so satisfying. The screenwriter dealt with the issue of homosexuality among teenagers in a realistic and smart manner. Every time the film becomes a little too dramatic, the director has something funny happen to lighten the atmosphere, which makes for a sweet and touching film. Also, all the characters are complex, so that bad characters do good things and good characters do bad things. Nobody is perfect and nobody is all bad, which makes the film even more realistic. It's similar to the more recent Get Real, but Beautiful Thing is definitely better. This is without a doubt my favorite gay film. Only the British can make a film this good!",
         "A Truly Beautiful Thing to watch. The whole film is fantastic, for all areas, the hard-working, loving, caring single mother, the shy, nervous, unsure child, the popular but insecure, frightened, abused boy, the crazy neighbours, everything! The film has some amazing scenes in it, especially the scene in the woods with the music - makes me cry and smile every time, the two young lovers are just wrapped up in themselves with no care in the world and it really shows through the acting and reactions of the actors, who obviously have such chemistry about them - and the music as well was fabulous and so poignant. This is probably my second ranking film of this genre (possible my second favourite in all) the first goes to Get Real that applied more to me than this film did, though the film affected me in a similar way to Get Real. Get Real changed my life, Beautiful Thing helped it along. I give this film a very good 9/10 (I never give 10 it may prevent others from trying to match or better it!)",
         "BEAUTIFUL THING is a unique drama - presenting an adolescent gay couple as complex individuals, within a greater setting (an English housing project) that also captures a bit of a slice-of-life feel. I like the working-class setting, and wasn't bothered by the accents - as an American it required me to pay attention - a good thing as there are many subtle details that make this a very rich drama. It does tug at the heartstrings a bit, and it lays on the cuteness a bit more than it should, but I loved the characters anyway, and the setting and context (very nicely detailed film-making) keeps those minor gripes minor. There have been so many cynical or clichéd gay dramas released during the last decade or two, especially in the US (gay film from elsewhere in the world often seems so much more fresh and lifelike) - in many ways this film was (and remains) a real breath of fresh air.",
         "Once again, I am overwhelmed by the excellence of British film-making & acting. I truly bow to the British honing of the craft of acting, which is brilliantly presented in this film. Storyline aside, the acting of the mother \"Sandra\" is superb; you feel every emotion on her face as she struggles to make a better life for herself and her son, as well as accept her son's growing awareness of his own sexuality. Remarkably, she is my favourite character in this film, notwithstanding the performances of the 2 boys, who are superb. The boyfriend, Tony, is also wonderful as a supporting character. My favourite scenes are actually sequential: first, the shot of Sandra following the boys in a cab, as the shock & turmoil of her emotions is beautifully portrayed during this scene; second, the followup scene with the boys in the park, probably, for me, the most wonderfully innocent, beautiful and intimate scene in the film. I'm probably being silly; every scene in this beautiful film is a treasure and at triumph, for anyone who's ever been in love. I know I will treasure this film always.",
         "This is an \"excellent\" romantic love story concerning two coming of age boys in gay accepting England. We found the movie to be both entertaining and moving. We own the movie on both VHS & DVD, that's how much we enjoy it. I would like to have seen a sequel to \"Beautiful Thing\", merely to have had the writer pick up the story after Sandra & Jamie moved to Sandra's Pub. The reason being, the movie ends giving the impression that Sandra took Ste along with her & Jamie, to live with them at Pub. I feel a sequel would carry on further with this point, along with how the boys relationship grew with time. Gays need a positive light, as \"Beautiful Thing\" portrays. I was wondering if anyone else feels the same way concerning Ste moving with Sandra & Jamie. I can \"HIGHLY\" recommend this movie, as it is well done, and a touching story. Lea, adds much to the movie also. We loved how at the end of the movie she becomes a friend to both Ste & Jamie. But than again, you could almost tell it would happen. Lea was a free spirit who did a she felt."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "World Productions"
      ],
      "summaries": [
         "A tender love story set during a hot summer on a South-East London housing estate. Jamie, a relatively unpopular lad who bunks off school to avoid football, lives next door to Ste, a more popular athletic lad but who is frequently beaten up by his father and older brother. Such an episode of violence brings Jamie and Ste together: Sandra (Jamie's mum) offers refugee to Ste, who has to 'top-and-tail' with Jamie. Hence, the story tells of their growing attraction for one another, from initial lingering glances to their irrefutable love, which so magnificently illustrated at the end of the film. In deals with the tribulations of coming to terms with their sexuality and of others finding out, in light of Sandra's unwavering loyalty and defence of Jamie and the fear of repercussion should Ste's family find out. The plot is set against sub-texts of Sandra's desire to manage her own pub, and thus escape the estate, and of her new relationship with her hippy boyfriend Tony; and of Leah, the brassy girl next door who has been expelled from school and spends her time listening to Mama Cass records and tripping on a variety of drugs.",
         "In a suburb of London, young Jamie is escaping sport hours, to avoid being the victim of his comrades. Young Ste, his neighbor, is beaten by his father, and comes to sleep overnight. They discover new feelings, sleeping in the same bed."
      ],
      "budget": 0
   },
   "movielensId": 1046,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-06-21",
      "dvdReleaseDate": "2003-05-20",
      "directors": ["Hettie MacDonald"],
      "runtime": 90,
      "movieId": 1046,
      "title": "Beautiful Thing",
      "mpaa": "R",
      "actors": [
         "Linda Henry",
         "Glen Berry",
         "Scott Neal",
         "Tameka Empson",
         "Ben Daniels",
         "Meera Syal",
         "Garry Cooper",
         "Andrew Fraser",
         "John Savage",
         "Jeillo Edwards",
         "Terry Duggan",
         "Anna Karen",
         "Julia Lee Smith",
         "Daniel Bowers",
         "Martin Walsh",
         "Jonathan Harvey"
      ],
      "imdbMovieId": "0115640",
      "originalTitle": "Beautiful Thing",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["3jRl-xZxyvQ"],
      "plotSummary": "A pair of teenage boys growing up in a working-class neighbourhood of Thamesmead, in south-east London, become aware of their homosexuality. While both were vaguely aware they might be gay, neither had ever acted on their impulses. Once they decide that they're attracted to each other, neither is sure just what to do.",
      "tmdbMovieId": 10938,
      "avgRating": 3.9696,
      "releaseYear": "1996",
      "numRatings": 1431,
      "posterPath": "/8z1ZkZoznIGLyx4xHEaQNZqG63D.jpg"
   }
}