{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "lion",
            "id": 2043
         },
         {
            "name": "bridge",
            "id": 3450
         },
         {
            "name": "animal attack",
            "id": 5160
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "kenya",
            "id": 9895
         },
         {
            "name": "lion attack",
            "id": 158215
         },
         {
            "name": "colonialism",
            "id": 158217
         },
         {
            "name": "swahili",
            "id": 158219
         }
      ],
      "imdb_id": "tt0116409",
      "video": false,
      "title": "The Ghost and the Darkness",
      "recommendations": [
         10003,
         2320,
         4105,
         12395,
         10859,
         10329,
         9208,
         11780,
         9433,
         2163,
         1727,
         11412,
         10303,
         9292,
         8870,
         9425,
         10479,
         10395,
         9972,
         10538
      ],
      "backdrop_path": "/6WnOmyB03Wqwssms5Wc89SBDN02.jpg",
      "revenue": 38619405,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Charles Remington",
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c7f",
               "name": "Michael Douglas",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Col. John Henry Patterson",
               "gender": 2,
               "credit_id": "52fe438d9251416c75014c83",
               "name": "Val Kilmer",
               "profile_path": "/AlhPeiH8R4reMNGNQ9ag1FPbuW9.jpg",
               "id": 5576,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Robert Beaumont",
               "gender": 2,
               "credit_id": "52fe438d9251416c75014c87",
               "name": "Tom Wilkinson",
               "profile_path": "/4mxZKgdem0sQ8hJd0Y7TREwq7TJ.jpg",
               "id": 207,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Samuel",
               "gender": 2,
               "credit_id": "52fe438d9251416c75014c8b",
               "name": "John Kani",
               "profile_path": "/iOKWcdeCNbEREAWMWIZBy6p805j.jpg",
               "id": 51878,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Helena Patterson",
               "gender": 1,
               "credit_id": "52fe438d9251416c75014c95",
               "name": "Emily Mortimer",
               "profile_path": "/jSw6VNNFXCc0cEAbGHafiWOWRKU.jpg",
               "id": 1246,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Dr. David Hawthorne",
               "gender": 2,
               "credit_id": "52fe438d9251416c75014c99",
               "name": "Bernard Hill",
               "profile_path": "/fX9ggRFAZM7J8vPBdTWQphUNiRt.jpg",
               "id": 1369,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Angus Starling",
               "gender": 2,
               "credit_id": "52fe438d9251416c75014c9d",
               "name": "Brian McCardie",
               "profile_path": "/msf0lYDkVFnB0smdSipK4koh9JM.jpg",
               "id": 18280,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Abdullah",
               "gender": 2,
               "credit_id": "52fe438d9251416c75014ca1",
               "name": "Om Puri",
               "profile_path": "/xjkp1S0XxDBJrjHL8Kq0JD2uvz5.jpg",
               "id": 11851,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Mahina",
               "gender": 0,
               "credit_id": "5685495e9251417e6300371e",
               "name": "Henry Cele",
               "profile_path": "/4gc6a35yWjmdKeTrY8sCkohnZl0.jpg",
               "id": 143476,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Indian Victim",
               "gender": 2,
               "credit_id": "568549739251417e63003727",
               "name": "Kurt Egelhof",
               "profile_path": "/lCg77Q01Teyt9UE6OPB0D81M3Qi.jpg",
               "id": 667748,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Worker",
               "gender": 0,
               "credit_id": "56854987c3a36828f5011d4e",
               "name": "Satchu Annamalai",
               "profile_path": null,
               "id": 1556203,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Worker",
               "gender": 0,
               "credit_id": "5685499d9251412e5201a602",
               "name": "Teddy Reddy",
               "profile_path": null,
               "id": 1556204,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Worker",
               "gender": 0,
               "credit_id": "568549adc3a36828f5011d57",
               "name": "Raheem Khan",
               "profile_path": null,
               "id": 1556205,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Nervous Sikh Orderly",
               "gender": 0,
               "credit_id": "568549c09251411334012f6d",
               "name": "Jack Devnarain",
               "profile_path": null,
               "id": 1156168,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Orderly",
               "gender": 0,
               "credit_id": "568549d6c3a368607501af4c",
               "name": "Glen Gabela",
               "profile_path": null,
               "id": 541462,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c45",
               "name": "Stephen Hopkins",
               "profile_path": "/9htj3BqGWBJGEdsEqQ9YoC3Teq4.jpg",
               "id": 2042,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c4b",
               "name": "William Goldman",
               "profile_path": "/7eBlS4cj4WAGzI38ef3EXAIKmOg.jpg",
               "id": 348,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c51",
               "name": "A. Kitman Ho",
               "profile_path": null,
               "id": 2621,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe438c9251416c75014c57",
               "name": "Gale Anne Hurd",
               "profile_path": "/oRWGpXdIm2lu870aaKpgO3wy19n.jpg",
               "id": 869,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c5d",
               "name": "Paul B. Radin",
               "profile_path": null,
               "id": 65685,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c63",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c69",
               "name": "Vilmos Zsigmond",
               "profile_path": "/zItpdF2B0mohQSFs40E7eUg3nkL.jpg",
               "id": 12235,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c6f",
               "name": "Roger Bondelli",
               "profile_path": null,
               "id": 17164,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c75",
               "name": "Robert Brown",
               "profile_path": null,
               "id": 14339,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c7b",
               "name": "Steve Mirkovich",
               "profile_path": null,
               "id": 8751,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe438d9251416c75014c91",
               "name": "John Henry Patterson",
               "profile_path": null,
               "id": 65687,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 6.985161,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 10586,
      "vote_count": 298,
      "budget": 50000000,
      "overview": "Sir Robert Beaumont is behind schedule on a railroad in Africa. Enlisting noted engineer John Henry Patterson to right the ship, Beaumont expects results. Everything seems great until the crew discovers the mutilated corpse of the project's foreman, seemingly killed by a lion. After several more attacks, Patterson calls in famed hunter Charles Remington, who has finally met his match in the bloodthirsty lions.",
      "similar": [
         14211,
         9732,
         258489,
         10527,
         11430,
         313943,
         606,
         7350,
         10603,
         9904,
         28761,
         57586,
         15587,
         11385,
         161143,
         18994,
         46207,
         25009,
         2989,
         38198
      ],
      "original_title": "The Ghost and the Darkness",
      "runtime": 109,
      "poster_path": "/3KEPs6RKlin9pT9fqjtW7MSLC8H.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Constellation Films",
            "id": 457,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-10-11",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Prey For The Hunters",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Hopkins"],
      "runtime": 109,
      "synopsis": "Sir Robert Beaumont, the primary financier of the railroad project, is furious because his railroad is not being completed on schedule. He has sought out the expertise of Patterson, a military engineer, to get the project back on track. Beaumont tells Patterson that if he doesn't get the bridge built on time, Beaumont will use all of his power and influence to destroy Patterson's reputation as an engineer. Patterson travels by train to the outpost station, where he is enthusiastically greeted by camp supervisor Angus Starling. When they arrive in Tsavo, Starling introduces Patterson to the first team supervisor, Samuel (the movie's narrator). Samuel is one of the few men at the work site who is respected and trusted by everyone. Patterson also meets the camp's doctor, David Hawthorne, who tells the colonel that he's brought bad luck with him. The doctor shows him a man who was attacked by a lion. The colonel assures the doctor that he will \"sort it out\". That night, Patterson kills a lion using only one shot from his .303 Enfield rifle. This raises the camp's morale. However, not long afterwards Mahina, the construction foreman, is dragged from his tent in the middle of the night. His half-eaten body is found the next morning. Patterson then attempts a second night-time lion hunt, but the next morning another worker is found dead at the opposite end of the camp from Patterson's position. Later, a huge male lion attacks the camp, creating panic among the workers and capturing one of them. Patterson, Starling, and Samuel run down the lion and find it feeding on the dead worker. Patterson is about to shoot it when a second lion attacks them and kills Starling. Both lions escape. Shortly afterwards, Beaumont, who has come to Africa to find out why the railroad is not making any progress, says he will contact a big game hunter known as Remington to get the job done. That evening Patterson attempts to trap the lions in a modified box car, but the workers who are supposed to kill the lions are too scared to do it properly. Remington arrives, bringing with him some skilled Maasai warriors to help hunt the lions. The men spend all night preparing themselves for the hunt. The hunt goes badly when a rifle Patterson has borrowed from Dr. Hawthorne misfires, almost resulting in his death. Believing the lions are supernatural, the Maasai warriors abandon Remington to hunt the lions on their own. That evening Remington and Patterson take up a watch in the camp's old hospital which they have cleared of patients and doused with blood in an effort to lure the lions. However, the lions attack the new hospital and kill both the patients and Dr. Hawthorne. The entire population of workers evacuate the camp the next day, leaving Patterson, Remington and Samuel behind to deal with the lions. Patterson and Remington set off towards the mountains and at last successfully locate the lions' den, which they find filled with piles of human and animal remains. Horrified, they conclude that the lions are killing people for \"the pleasure\" of it and hoarding the skeletons as trophies. The next evening, Patterson waits on a high wooden platform in a clearing, hoping to attract the lions with a captive baboon tethered to a pole on the ground, while Remington and Samuel keep watch from positions around the edge of the clearing. Remington succeeds in killing one lion, and the three men celebrate by getting drunk. Awakening the next morning, Patterson and Samuel discover that Remington has apparently been dragged from his tent and killed by the remaining lion during the night. Grief stricken over Remington's death and now desperate to end the bloodshed, Patterson decides to burn the tall grass surrounding the camp in order to drive the lion towards the camp where he hopes to ambush it. Patterson and Samuel are soon attacked by the beast on the partially constructed bridge. Patterson shoots and wounds the lion with a howdah pistol. But the lion quickly retaliates, knocking Patterson's weapons away and chasing him off the bridge. Patterson and Samuel manage to climb into two separate trees, but when Patterson looks down he is shocked to see the lion climbing up the tree after him. Samuel tries to throw Patterson his own rifle but it falls to the ground. Patterson jumps from the tree and retrieves the rifle just in time to shoot the lion as it leaps down to kill him. At the end of the film, Patterson greets his wife and son at the Tsavo station. The final moments of the film have Samuel explaining that the lions are now on display at the Field Museum in Chicago, Illinois and that even today \"if you dare lock eyes with them, you will be afraid.\"",
      "writers": ["William Goldman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116409/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNTcwMDc1OV5BMl5BanBnXkFtZTcwMDYyMzMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Douglas, Val Kilmer, Tom Wilkinson | See full cast and crew »"],
      "reviews": [
         "I always found this to be an outstanding based-on a true story adventure film which holds your interest throughout. It features some great suspense and the story is fascinating. It's always been ranked among my top 50 movies. A good surround system doesn't hurt here, either. Stan Winston, one of the best special-effects men in the business, lent his talents to this film while Val Kilmer and Michael Douglas are more than adequate in the starring roles and the African with the freckles (sorry, I don't have his name) is really a likeble fellow. Except for the first one, the lion attack scenes are not gruesome and the filmmakers did a nice job a having just the right amount of action and lulls. Neither is overdone. This film has never been given much due but I've never shown it to anyone who didn't thoroughly enjoy it. This movie scared me so much I stopped hunting lions. It's just not fun anymore.",
         "It is 1898 and charming, cretinous Captain of Industry Beaumont has hired Col. John Patterson,eminent engineer/bridge builder to complete a bridge spanning the river by Tsavo, Africa. Arriving in the continent he has dreamed of forever, Patterson meets his project. There are problems with it: Competing French and German rivals, Ethnic hatred among the crews and, on Patterson's first day there, a worker is attacked by a lion. He goes to \"sort it out\" by shooting the beast with one shot; gaining the admiration of his crews, lifting spirits, adding motivation to complete the bridge, and unleashing a nightmare Only weeks after the shooting the camp is suddenly besieged by a pair of giant man-eating lions. Their first \"kill\" is Mahina (Henry Cele), considered the strongest man in the camp. This serves to unnerve every man on the project, including Indian rabble-rouser Abdullah, who doesn't like Patterson from the start. Nerves jangle and fray as the lions repeatedly and relentlessly attack and attack and attack! They strike under the cover of night AND during the heat of day; They kill not for hunger, not for sport, but simply because they like it. Men are dragged from their beds and mauled to death in the tall grasses; the hospital becomes a blood-bathe; Laborers aren't safe as the beasts leap out and snatch them from their work. Everything is falling apart and Patterson is at his wit's end as Beaumont arrives to make matters worse. And still the lions attack and attack and attack. Enter Big Game Hunter Charles Remington who is as determined to destroy the lions as the lions seem determined to eat every man in camp. This is an under-appreciated, well made, well scripted nail biting adventure. It boasts solid artists on both sides of the lens: William Goldman penned the script, Gail Anne Hurd and H. Kitman Ho are two of the producers who know how to spend the budget wisely, the great Vilmos Zigmond is responsible for the mesmerizing African cinematography. Stephen Hopkins directs with great vision and skill and the actors are uniformly solid and believable in their roles. Val Kilmer plays Patterson with an understated, simple and elegant performance; Tom Wilkerson is the charming snake of a boss Beaumont, Brian McCardie gains the viewers sympathy as a youthful, innocent, and doomed Angus Starling, John Jani is the stalwart Project Manager Samuel, Bernard Hill the irritable/irritating Dr. Hawthorne, Om Puri is the creepy, sarcastic Abdullah (\"You are white. You can do anything.\") and Michael Douglas, also an Executive Producer \u0096 he got the money \u0096 plays hunter Charles Remington, removing the sweet edges of his Romancing the Stone role to create our renown hunter. Hopkins not only knows how to build tension, suspense, and terror, but when to let us relax and how to fill that time. The quiet moments are never dull. They let us empathize with these men, their characters get to develop and we bond with them and their nightmare. Zigmond (Close Encounter of the Third Kind) uses deep oranges and blacks for the African locale, except during a daylight lion hunt and cave exploration when he switches to bright sunlight, vibrant greens and sharp browns as if to show us that even a travelogue holds a nightmare. It is near Hitchcockian. Rolling underneath the film like summer thunder (or the breathy growl and snarling of our killer lions) is Jerry Goldsmith's pounding, tribal driven score, which accents the mood and gives further dimension to the narrative. Listen closely, you can hear him using tonal motifs he developed for Star Trek: The Motion Picture. As the hysteria builds and the men frenzy, many explanations are offered for the appearance of these animals: Are they the spirits of medicine men come to exact revenge; Or demons sent by the devil to keep Africa unsoiled; Or have they come to claim John Patterson? Is it to helplessly watch as they strip away the layers of security around him until he is exposed and defenseless against their teeth and claws? It is no coincidence that Kilmer is photographed at times slack- faced and full on and LOOKS like a lion himself. Once this film starts, I can guarantee you that you won't be able to take a snack break, bathroom break, or even think about dozing off. It is that good. And remember this: You can see the preserved bodies of these two giant man-eaters at the Field Museum in Chicago, Illinois because this incredible story is TRUE.",
         "\"The Ghost and the Darkness\" is a marvellous movie, in the literal sense: the lions come out of the long grass in the daylight or the groundfog in the darkness like the devils they are thought to be. No true motives are ascribed to them, as how could they be?, and that actually serves to make them more demonically terrifying. But whether they are the devils come to prevent Val Kilmer's Patterson from building his bridge, or merely (!) animals hunting for the pleasure of it, they provide more suspense, more terror, and more death than most high-tech cgi aliens. Michael Douglas's Remington, dispossessed of home and family in the American civil war, is an interesting character, but it's Kilmer's British bridge-builder in a time where engineers had to know how to shoot tigers and manage Hindu-Muslim conflicts fully as much as how to put up their structures, who is the focus of the film, and rightly so. Kilmer's performance is quiet, almost understated, but one of the best I've seen him give; he's fully convincing, especially as he fights the belief that the lions are, in fact, out to get him personally. \"They are just lions,\" he says halfway through the movie, and you can hear how much he wants to believe it. John Kani also gives a good performance, contained mostly in small moments that are so true they almost hurt. The cinematography is beautiful, especially the of the lion attacks and their passages through the grass. Again, no cgi effects could convey so much beauty and lurking menace. This movie is beautiful, intense, and dramatic; I highly recommend it.",
         "The Ghost and the Darkness is an excellent film. It has the ingredients of a landmark movie. The story is based on fact. There was a bridge being built in Tsavo in 1898. There were two man-eating lions there who killed 130 people for no reason. And I believe there was something more behind the intentions of these lions. Evil can and does exist anywhere. Undoubtedly in humans, and, probably more than we'll ever know, in animals. The Ghost and the Darkness is a reminder how vulnerable we are to nature's fury, and that we should never under-estimate the potential of any animal. In closing, I'll say that this movie is perfectly directed, superbly scored, and beautifully filmed, and to the adventurous and open-minded viewer, a movie with lasting satisfying and chilling effects.",
         "...Well according to Hollywood anyway, since \"The Ghost and the Darkness\" actually takes lots of liberties with its story, about the two man-eating lions of Tsavo. Quite odd since it presses in the beginning that everything you're about to see in this movie, no matter how unbelievable it seems, has truly occurred. Oh well, just a good and clever marketing trick, lets leave it to that. No way they can pull off a trick like this now days in the days of Internet, were with only a few clicks you can look up an historical event. Of course the biggest difference between the truth and fiction is the Remington (Michael Douglas) character, who never existed in real life and also the looks of the lions, who in real life were not maned. But oh well, are these movie changes bad or not believable? No, it strengthens the story and makes it all even more interesting to watch. I've always loved watching \"The Ghost and the Darkness\". It's a great adventurous movie with action in it and some good characters, all set in a beautiful environment. The story is perfectly adventurous and action filled. It's all the more amazing knowing that the story has actually occurred in real life, over an hundred years ago already. The movie and its story is kept simple and allows its images and characters to tell the story. What I like about the movie is that it fully treats the 'Ghost' and the 'Darkness' (the nicknames of the two man-eating lions) as movie characters. It shows them as smart thinking creatures and not simply just as 'monsters', even though they kill for pleasure (at least in the movie they do). The movie is definitely helped by its environment and atmosphere. The beautiful African land serves as a perfect backdrop for the movie and also works quite claustrophobic, since the movie is for most part set at just this one location (the railroad and bridge building-site). Also the great Jerry Goldsmith musical score suits the environment and perfectly adds to the atmosphere of the entire movie, as does the cinematography from Vilmos Zsigmond. Michael Douglas plays a good role and actually shows with this movie how versatile he is as an actor, though his role is definitely smaller than he is credited for in the movie. As also the producer of this movie he obviously claimed to become the top-billing actor of the movie as well. In fact the main part of the movie is being played by Val Kilmer, who plays his character in a way like we're used of him; a humble way and he doesn't try too hard to impress in his role, which also leaves room for the other actors to shine and of course allows the story to be told best. Surprising to see that the movie also had actors in it, that would later turn into big well known names such as Bernard Hill and Tom Wilkinson, in some good roles. Also Om Puri gives a nice performance. A perfectly fun and simple adventurous action movie. This is high quality entertainment. 8/10 http://bobafett1138.blogspot.com/",
         "\"The Ghost & the Darkness\" is a very good adventure flick set in Africa in the late 19th century, and is based on a true incident. Kilmer plays an engineer sent to build a railroad bridge over the Tsavo river. Work is halted by attacks from two man-eating lions which terrorize the workers. Seems these lions are exhibiting behavior not seen in lions before, i.e. they appear to be hunting for sport ('the Ghost' and 'the Darkness' are the names given to the 2 lions by the native workers). Douglas plays a famous renegade American hunter, a tragically scarred Civil War veteran, hired by the railroad to kill the lions. Good adventure, well-paced, with stunning photography of the African countryside. The movie has an \"R\" rating which I can't figure out; perhaps because of the bloodiness of the lion dinner scenes (and lunch, and breakfast, and between-meal snacks....). I have seen many PG13's which have more blood & guts than this. I give it a straight A; my 10-year old son gave it an enthusiastic thumbs-up also).",
         "\"The Ghost and the Darkness\" is based on an episode from the jungles of 1896 East Africa. Various European countries are engaged in the process of establishing colonies in the wealthy lands of East Africa, and chief among those is Great Britain. Val Kilmer has been given a task--to build a bridge over a river in one of the British colonial ventures in East Africa. When he arrives at the site, he learns that the task has been brought to a total halt by the presence of two man-eating lions the natives refer to as The Ghost and The Darkness. These lions hunt as a team, and seem to have no fear of any outside force. What's more, efforts to hunt them down have all ended in failure. Kilmer enrolls the aid of an ardent big-game hunter, Remington, played by Michael Douglas. Together, the two men set out to end the killing spree and thus allow the bridge to be built. The story is marked with violence, may be a bit squeamish for some, but the scenery and photography, coupled with a good story, makes it all worth while. There is also a very unusual musical score, which adds to the background of the entire film. On my own scale, a 9 out of 10",
         "When I was in high school, my English teacher made us document all the differences we could spot between the Ronald Coleman movie version of \"A Tale of Two Cities\" and Dicken's novel. It's an exercise I find myself doing every time a movie comes out - especially when the movie is supposedly based on fact. When I saw \"The Ghost and the Darkness,\" I had already read \"the Man-Eating Lions of Tsavo\" and already seen the lions in the Field Museum. There really were two lions that killed well over 40 workers during the construction of a railroad in Africa in Tsavo, Kenya in the late 1800s. National Geographic also did an article about the aggressive Tsavo lions in 2002. I found the real story fascinating, and was really looking forward to the movie. I understand that the normally maneless lions found in Tsavo don't look quite right for us ignorant viewers (could have just explained it with a one liner from a native, but oh well), so they used lions with manes. I also realize that we as an audience today are too politically correct to cope with the way the white man treated natives back then, so the movie has been historically sanitized, with a few remarks sprinkled throughout on religious reformation from the doctor. I suppose we must continue to pretend certain behaviors in history didn't happen. Yet another key change: I'm not clear why we needed another mighty hunter in the story. Patterson had the help of a district manager from time to time, but not another great white hunter. In Africa in that period, getting messages and arranging encounters wasn't easy - strangers of European race were apt to consider each other friends just because they were the same color upon encounter in that era - something the movie fails to get across - it's unlikely that another hunter could be reached easily. And certainly great star/hunter Val could carry a movie on his own. Fortunately the character Michael Douglas plays does not detract from the movie, and there is that extra emphasis on the Ghost/Darkness nomenclature from the (again, additional characters) Masai. Michael Douglas and Val Kilmer did play off each other well, although neither seemed able to fully adopt Southern/Irish (? did we need those?) accents respectively. I do think the hunting scenes in the movie captured well the constant effort to see something, staring into the darkness at nothing, that hunting at night can be like. Not to mention the cold sweat, stark fear, blinding pain, and sudden calm and desperation that a near death experience is. Which is why, in spite of the factual inconsistencies, I gave the movie the rating I did. Worth the watch, if only for that. If you really want to know about the Lions of Tsavo, read the story by Patterson - it's pamphlet #7, published in 1925 from the Field Museum in Chicago.",
         "(Some Spoilers) True story of the Tasvo Man-eaters who terrorized the workers working on the Kenya Ungandan Railway back in 1898 killing and devouring almost 140 of them in nine, March-December 1898, months. It's during that reign of terror the Tasvo Lions, weighing some 500 pounds each, lived or dined almost exclusively on human flesh. The film starts with Irish engineer Col. John Patterson, Val Kilmar, sent to Kenya by his British overseer, or boss, the pompous and all full of himself the future Sir, hoping that he'll be knighted by the Queen, Robert Beaumont, Tom Wilkerson. As soon as Col.Patterson arrives on the Dark Continent he's faced with a revolt by those workers that he's in charged of with them afraid to go out and build a bridge over the Tasvo River. These two man-eating lions have been snatching and devouring workers at will and it thought that they, the killer cats, aren't even lions but evil and murderous spirits preventing the bridge, that's being erected on sacred native ground, from being built. The killings go on unabated and it's when one of the local native leaders Mahina, Danny Cele, is dragged out of his tent and eaten by the lions the rail workers just refused to go back out and lay tracks, to build the bridge, over the Tasvo River. Being like phantoms more then lions the killer cats are immune to anything that Col. Patterson and his native guide Samuel, John Kani, can come up with in both trapping and killing the two giant felines. It's then out of sheer desperation that the \"I've never been wrong in all my life\" Robert Beaumont, it must have taken a lot out of his giant ego, hires big game hunter Charles Remington, Michael Douglas, to do the job, kill the Tasvo Man-eaters, that nobody including Col. Patterson can seem to do. ***SPOILER*** Remington who after failing to put down the killer cats with both Col. Patterson and Samuels' help goes out on his own, without Col. Patterson's knowledge, only to end up becoming the Tasvo Man-eaters next victim and meal. Far better then many of it's critics and detractors say it is \"Ghost and the Darkness\" does have it's share of shocks and thrills despite not having the benefit, like similar movies like \"Jaws\", of having any real and state of the art special effects. There's only one scene where there's a mechanical or fake lion, like the shark in \"Jaws\", in the movie and that was about the most ineffective scene in which the killer cats attacked in the entire film. The lions are seen mostly in close up when they do most of their damage, attacking and killing the rail workers. But the few scenes where the lions do fully expose themselves, like the dream-like attack on Col. Patterson's wife and son, are truly heart-stopping and as good as anything you'd see a like-wise animal attack film. P.S The notorious Tasvo Lions have been said to have become man-eaters because of an epidemic that killed off most of their food, gazelles zebra and wildebeests, in the area or their hunting grounds. This forced them to go for humans as prey since human beings were the only source of food, with all their normal prey dying out, left open to them. A far more interesting clue, in later checking out their skeletal remains, to the man-eating Tasvo Lions turning to prey on humans has to do with them having abscesses and infections in their teeth and gums. This had the lions suffer extreme and excruciation pain when they had to bite into the extremely thick and tough hides of their normal prey in order to kill and eat them. They turned to hunt kill and eat human beings only because their skin or hides weren't as tough and thus easier to penetrate and not cause the Tasvo Lions any terrible pains in doing so.",
         "Be afraid. Be very afraid. The 'Ghost' and the 'Darkness' were two cunning man-eating lions in 1898 (I even had a child's encyclopaedia that mentioned them). This is their story. We first meet Col. John Patterson (Val Kilmer), a bridge-building engineer-cum-adventurer, as he discovers that his new boss, the obnoxious Robert Beaumont (Tom Wilkinson from the Full Monty) is a ruthless, self-styled `monster'. `You build bridges, John. You have to go where the rivers are', his enormously understanding pregnant wife tells him, but Patterson's maturity and political nous worries and saddens him over his coming separation with Helena (Emily Mortimer) during her pregnancy; so he's determined to return to her before the birth. What a good husband. But what I like most about this film is its multicultural POV. Clearly the international bridge-building effort (much like Australia's famous Snowy Mountains hydro-electric scheme of the 1950s) provided a modern setting for a very accessible 1990s screenplay. Samuel (John Kani, in beautiful African garb), the camp's liaison officer and `the only man everyone trusts', gives the newly arriving Patterson a succinct overview of the culture clashes in the camp. Abdullah (Om Puri) is the recalcitrant/recidivist Indian foreman. I am disappointed in him for his awful line `Of course; you can do anything because you're white' (such defeatist sarcasm conversely also means that anyone who isn't white is incompetent). Thanks Abdullah-your racist attitudes are bad news for EVERYONE. David Hawthorne (Bernard Hill) is entertaining as the put-upon surgeon. He's coping with an outbreak of malaria, but also an evangelizing lackey of Beaumont's, Angus Starling (Brian McCardie), who is constantly trying to convert everyone to Christianity. The surgeon regularly loses patience with him, for Starling's habitual pestering of the sick (me too! I long for the day when there will be ethical and legal controls on evangelists). Hawthorne is cynical about the whole bridge-building exercise too: `This is a sham, who needs it? ...It's only being built to protect the ivory trade'. Realistic thrillers are always more frightening than schlocky rubbish. The chills are begun in earnest by Samuel's accented narration (the accent hints at the added stressor of confusion). Our foreboding of dread is soon represented by waves of African grass, which may serve to hide a stalking lion. At 27mins we see our first devastating lion attack, upon the robust, well-respected African foreman Mahina (Henry Cele). Please steel yourself for the sudden strike as the men sleep in the tent. The scene never fails to shock me; and the terror just gets worse. Samuel's narration deepens our fear, giving us a hint of what the men working on that railroad in 1898 must have felt. Of course, Abdullah The B*st*rd tries to incite a riot, but he is revealed as a liar when, with a gun finally to his own head, he claims `I am a man of peace'. Ha, you're joking, right? Look, I don't mind the workers being fearful; in 3months the lions (the man-eaters don't behave/hunt like any other lions) have killed about 30 men. What I DO mind is some dullard whipping up prejudice and superstition, no doubt, NO DOUBT, for personal gain (whipping up prejudice has ALWAYS been the tool of megalomaniacs, to rally forces behind themselves at the front. You BET it's for personal gain). People like Abdullah belong in jail (what's the bet he already HAD a rap sheet as long as your arm?) ...Anyway, the man who has so cleverly diagnosed the problem is big-game hunter-for-hire, Remington (Michael Douglas). However, Douglas' establishing scene is highly self-serving, as usual: the screenplay has him gaining our acceptance at the cost of the doctor's intelligence. Come on, EVERY African surgeon would know all too well the dangers of hospital decay as an irresistible attraction to lions. Those lines were written only for our foreigners', and Douglas' benefits- he was also Co-Exec Producer. Remington's been hired by the big boss to contain and quell any rumours of delay on the railroad. Remington is a pretty good hunter. He's wise enough to employ a rolling band of Masai warriors, and together, they act as the `fixers' of Africa. It's very exciting; I've never seen such a thing before. Unfortunately, every trap they set for the lions fails. When Patterson himself finally freezes during a head-to-head confrontation with one of them, even the Masai decide to leave because they have glimpsed the animals' intelligence, and declared them not lions, but `The Ghost' and `The Darkness'. So Remington and Patterson go out alone, tracking the lions back to their den. Foolishly entering a highly dangerous, enclosed situation, they discover an astonishing sight: the lions' den is littered with dozens of old human skeletons. Upon seeing them, Remington declares that these lions hunt for `pleasure'. Well, actually, I say the lions killed people to make them dead, which is just domination. The lions are clever; they've figured out that they need to get rid of the people taking over what used to be theirs, the lions' territory. It's an interspecies pi**ing contest; and Remington is best when he doesn't underestimate his enemy. He likens the lions to two bullies of his childhood, who separately seemed beatable, `but together were lethal'. I agree; it's no good demonizing the animals. Sure, they were not to be underestimated, but had Remington and Patterson agreed with the Masai that `there was not enough blood in all the world that would make these demons stop drinking', they couldn't've stood up to the bullies. And I think that's always true between humans, too. I have to again commend Kilmer for his emotional range in the scene with his wife. I truly felt his elation and humility. He kisses her repeatedly for being clean and untouched by the vicious ugliness that's been his life since he entered Africa. His nightmare(s) about lions stalking his family will no doubt haunt him for a long, long time. I can't fault this movie. 10/10."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Constellation Entertainment",
         "Douglas/Reuther Productions"
      ],
      "summaries": [
         "Set in 1898, this movie is based on the true story of two lions in Africa that killed 35 people over a nine month period, while a bridge engineer and an experienced old hunter tried to kill them.",
         "In 1896 Lt. Col. John Paterson was sent to East Africa to build a railway bridge. He had a deadline to meet but was confident he and his large workforce of Africans and Indians can get the job done in time. John's was a man of his word and got things done - which he demonstrated on his first day by killing a lion that had been pestering the workforce. This earned John respect, but it didn't last very long because a few weeks later 2 new lions began visiting and they're man-eaters. The film is based on a true story and during the construction of the bridge, the lions would enter the workers camp to kill. Believing them not to be real lions, the locals name them 'The Ghost' and 'The Darkness'. After losing dozens of workers to the lions, the railroad company brought in Remington, an American 'great white hunter', to kill them, but even his reputation for being the best could not prevent yet more carnage. It is believed that over 130 people were killed by the two lions in just a few months.",
         "In 1896, a construction engineer from the British Army, J.H. Patterson is sent to build a railway bridge across Kenya's Tsavo River for the British East African Railway. Soon after he arrives, workmen begin to disappear at night from their tents - never to be seen alive again. The engineer soon discovers that a pair of man-eating lions are stalking around the bridge and campsites, killing the workmen for food. He tries a number of different methods to get rid of them, but the beasts always seem to know what Patterson is doing and avoid being shot. After 30 men have been killed Patterson's boss recruits a hunter, Charles Remington to hunt down and destroy the lions. But the lions continue killing the workmen until they flee the camps, jumping onto the train as it rolls through Tsavo. Now Remington, Patterson and his aide must face these brilliant yet frightening monsters alone."
      ],
      "budget": 55000000
   },
   "movielensId": 1049,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-11",
      "dvdReleaseDate": "1998-12-01",
      "directors": ["Stephen Hopkins"],
      "runtime": 109,
      "movieId": 1049,
      "title": "The Ghost and the Darkness",
      "mpaa": "R",
      "actors": [
         "Michael Douglas",
         "Val Kilmer",
         "Tom Wilkinson",
         "John Kani",
         "Emily Mortimer",
         "Bernard Hill",
         "Brian McCardie",
         "Om Puri",
         "Henry Cele",
         "Kurt Egelhof",
         "Satchu Annamalai",
         "Teddy Reddy",
         "Raheem Khan",
         "Jack Devnarain",
         "Glen Gabela"
      ],
      "imdbMovieId": "0116409",
      "originalTitle": "The Ghost and the Darkness",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["ufYQA6_osOY"],
      "plotSummary": "Sir Robert Beaumont is behind schedule on a railroad in Africa. Enlisting noted engineer John Henry Patterson to right the ship, Beaumont expects results. Everything seems great until the crew discovers the mutilated corpse of the project's foreman, seemingly killed by a lion. After several more attacks, Patterson calls in famed hunter Charles Remington, who has finally met his match in the bloodthirsty lions.",
      "tmdbMovieId": 10586,
      "avgRating": 3.40611,
      "releaseYear": "1996",
      "numRatings": 5613,
      "posterPath": "/yxSwciZCU5dUUNVtSgDoEMrxGyy.jpg"
   }
}