{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117400",
      "video": false,
      "title": "The Proprietor",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Adrienne Mark",
               "gender": 1,
               "credit_id": "52fe4a99c3a36847f81d7519",
               "name": "Jeanne Moreau",
               "profile_path": "/5T4FjqcFiStJVZvlaNkzFFPslw2.jpg",
               "id": 14812,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Virginia Kelly",
               "gender": 1,
               "credit_id": "52fe4a99c3a36847f81d751d",
               "name": "Sean Young",
               "profile_path": "/4zgkRFQruIlaJ4JakNZLoKJ70fH.jpg",
               "id": 586,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Harry Bancroft",
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d7521",
               "name": "Sam Waterston",
               "profile_path": "/fKmtS6OdDWPiAdxZflbJGz1eWml.jpg",
               "id": 8975,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Elliott Spencer",
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d7525",
               "name": "Christopher Cazenove",
               "profile_path": "/sck3PP8PepiasZ4gZ19PE5FBXQZ.jpg",
               "id": 67567,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Millie Jackson",
               "gender": 1,
               "credit_id": "52fe4a99c3a36847f81d7529",
               "name": "Nell Carter",
               "profile_path": "/sAuomv05KmeVXP9JDQL2yd46Yol.jpg",
               "id": 80866,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Franz Legendre",
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d752d",
               "name": "Jean-Pierre Aumont",
               "profile_path": "/zmH3P6Wr5hkiRo8Rx060nhvAEdX.jpg",
               "id": 18766,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Willy Kunst",
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d7531",
               "name": "Austin Pendleton",
               "profile_path": "/pxcdhd4oAsnhvUg0BalmiiKJyXg.jpg",
               "id": 6168,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Judith Mark",
               "gender": 1,
               "credit_id": "52fe4a99c3a36847f81d7535",
               "name": "Charlotte de Turckheim",
               "profile_path": "/he3y0MpYNo6RRjylYfTlUGzSVgg.jpg",
               "id": 258942,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Raymond T.K",
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d7539",
               "name": "Pierre Vaneck",
               "profile_path": "/1VYytOUrkCybWzL0qliGTXqNfNp.jpg",
               "id": 4289,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Patrice Legendre",
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d753d",
               "name": "Marc Tissot",
               "profile_path": null,
               "id": 191111,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d74e5",
               "name": "Ismail Merchant",
               "profile_path": null,
               "id": 54448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d74eb",
               "name": "Jean-Marie Besset",
               "profile_path": null,
               "id": 38858,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d74f1",
               "name": "George W.S. Trow",
               "profile_path": null,
               "id": 1043952,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d74f7",
               "name": "Andrew Litvack",
               "profile_path": null,
               "id": 127331,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d74fd",
               "name": "Humbert Balsan",
               "profile_path": null,
               "id": 35524,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a99c3a36847f81d7503",
               "name": "Richard Robbins",
               "profile_path": null,
               "id": 54449,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d7509",
               "name": "Larry Pizer",
               "profile_path": null,
               "id": 1043953,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d750f",
               "name": "Frédérique Moidon",
               "profile_path": null,
               "id": 36525,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d7515",
               "name": "Donald Rosenfeld",
               "profile_path": null,
               "id": 1043954,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a99c3a36847f81d7543",
               "name": "William Webb",
               "profile_path": null,
               "id": 1267869,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.008855,
      "production_countries": [],
      "id": 108365,
      "vote_count": 0,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "The Proprietor",
      "runtime": null,
      "poster_path": "/rxu3LfhWhPpaN4yHWnsW3y9tPw9.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "1996-09-09",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ismail Merchant"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Jean-Marie Besset",
         "George W.S. Trow"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117400/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4NDQ5NjE1NV5BMl5BanBnXkFtZTcwMzk0MTcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeanne Moreau, Sean Young, Sam Waterston | See full cast and crew »"],
      "reviews": [
         "I saw this at the Chicago International Film Festival the autumn of its release. Before the film started, the producers and Madame Moreau made an appearance at the theatre and came to talk a few moments. There were about 25 people in the audience. What an embarrassment that this great lady's appearance would have so few people in attendance! I did what I could to make it celebritous, stood and applauded, and Madame very shyly bowed to us. The film itself is best described as imperfect jewels - romantic, beautiful scenes and decors, and a capable cast. For some reason it doesn't completely come together as it should. I would still like a DVD version, for no other reason than posterity.",
         "The mature and beautiful Jeanne Moreau makes this film worth more than a footnote or a curiosity in her filmography. The interplay between Moreau and Nell Carter is funny and moving. While there are transitions that are not as smooth or well written as they could be, this movie resonates with those of us who have reached \"a certain age.\" Though not all of us have the opportunity to revisit our pasts, we each manufacture the imagery that we carry with us for our lifetimes. Those of us who are lucky enough to get a chance to revisit our youth are often rudely awakened to the reality that the imagery we have carried with us is not necessarily reality. This touching story involves a successful novelist, Moreau, who late in life decides to return to her Parisian roots. It is about her departure from New York, where she has been living since the war (WWII) and her return to Paris after 50 years. It is in the remembrance of her mother and the realizations of what actually happened to her as a child during the war that are the heart of this movie. While there are unnecessary sub-plots, even these diversions give the director, Ismael Merchant, an opportunity to cinematically present Paris at its most lovely. I consider this a very good movie with yet another brilliant and controlled performance by the incomparable Moreau. There are some very interesting character roles including Jean Pierre Aumont. The cinematography is lovely!",
         "If you see this film as a tv movie chances are the broadcaster's watermark will wipe out the subtitles, another reason to buy the video. When I saw this film for the first time I thought it was another American made girl flick so I occupied myself with other things(heh heh). The closing credits intrigued me however(Sean Young, Nell Carter, Aumont, Moreau) so I rented the video. I suppose I rated this a ten because I find most European films worthy of artistic praise, which is what this is, although it is obviously trying to serve an American audience. The French, in particular, have a way with invention that sidesteps stereotyping. Older people don't appear as saints or fools. Americans don't appear as total idiots. Youth isn't always blunt and naive. And life isn't telegraphed. So an otherwise boring girl flick turns into something worth watching.",
         "First, I have to say I actually enjoyed this movie, and I would have given it 9/10. What problem I have with it is Sean Young. I love Jeanne Moreau, and have many of her movies. I just feel that this movie would have had better appeal if they had picked someone else for Sean Young's character. The premise of the film was good, and the other supporting cast members weren't too bad, but it seemed that Ms. Moreau had to try and carry most of the film on her own. Not an easy task, even from someone as talented as Ms. Moreau. The sad part is that Ms. Moreau's films take so long to come to DVD in the US. I have been a fan of french, and foreign, films for quite some time, and it is too bad that we don't have better support for foreign films in this country, so that they get released here. We are missing out on some great movies and actors. This film is worth seeing. Just don't judge the rest of the movie based on Ms. Young's performance. I hope it comes to DVD in the US some time soon.",
         "I had seen previews for this film for several years before I could find it in the local Blockbuster and waiting was worth it. The story is tender, without being overdone. All of the characters are connected in meaningful ways, although I have to say casting Sam Waterson as an art auctioner may appear to be an odd role for him, he handled it well.Jeanne Moreau was delightful in the lead. The triumph of the film is her ability to move in and out of the visions with her mother and her lover. While some viewers may have found this far-fetched, just remember that grief creates many levels of reality. The friendship that developed with Josh Hamilton's character (William O'Hara) is great. Despite the fact Moreau finds him a total bore when they first meet, and they then become friends becomes the universal message of this story. Throw in the reconcilation of a marriage gone bad, and the young couple overcoming their cultural differences, and the story comes full circle. The scenes of racial problems in Frances brought the issue to light. Few Americans see this side of France. I give the movie an eight.",
         "I saw this film in the Carnegie Hall movie theater. I heard it was from Merchant-Ivory and I love Jeanne Moreau, so this pick was a no-brainer, or so I thought. I knew I was in trouble when James Ivory was the producer and not the director. Ismael Merchant didn't know what he was doing. About a third of the shots had the boom mike hanging into the frame. Ridiculous.",
         "Virtually unwatchable. Normally Merchant produces and Ivory directs. When they switch rôles, bad things happen."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Merchant Ivory Productions",
         "Ognon Pictures",
         "Fez Production Filmcilik"
      ],
      "summaries": ["An expatriated French novelist (Jeanne Moreau) returns to Paris when she learns that her childhood home is being placed on the auction block. What she doesn't count on is that she has to confront many old issues dating back to her childhood and bringing herself full circle to her present day life."],
      "budget": 0
   },
   "movielensId": 1052,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1996-09-09",
      "dvdReleaseDate": null,
      "directors": ["Ismail Merchant"],
      "runtime": 0,
      "movieId": 1052,
      "title": "The Proprietor",
      "mpaa": "",
      "actors": [
         "Jeanne Moreau",
         "Sean Young",
         "Sam Waterston",
         "Christopher Cazenove",
         "Nell Carter",
         "Jean-Pierre Aumont",
         "Austin Pendleton",
         "Charlotte de Turckheim",
         "Pierre Vaneck",
         "Marc Tissot"
      ],
      "imdbMovieId": "0117400",
      "originalTitle": "The Proprietor",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["pP6qc3sc4II"],
      "plotSummary": "",
      "tmdbMovieId": 108365,
      "avgRating": 3.38776,
      "releaseYear": "1996",
      "numRatings": 49,
      "posterPath": "/rxu3LfhWhPpaN4yHWnsW3y9tPw9.jpg"
   }
}