{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "bank",
            "id": 974
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "murder",
            "id": 9826
         }
      ],
      "imdb_id": "tt0117202",
      "video": false,
      "title": "Normal Life",
      "recommendations": [28735],
      "backdrop_path": "/ayXVe2zyUfeA9OU8uMPKcqXiCwK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Pam Anderson",
               "gender": 1,
               "credit_id": "52fe4463c3a368484e0201a9",
               "name": "Ashley Judd",
               "profile_path": "/3bgmRDt02iGFVjhqCqstVyEeiwG.jpg",
               "id": 15852,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chris Anderson",
               "gender": 2,
               "credit_id": "52fe4463c3a368484e0201ad",
               "name": "Luke Perry",
               "profile_path": "/78TAr0wLoRHyubnYxjyHNCt70V2.jpg",
               "id": 8395,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Agent Parker",
               "gender": 0,
               "credit_id": "52fe4463c3a368484e0201b1",
               "name": "Bruce A. Young",
               "profile_path": "/ty2NwUAAwnn356eTAu7RuSsQlhT.jpg",
               "id": 4943,
               "order": 2
            },
            {
               "cast_id": 23,
               "character": "Mike Anderson",
               "gender": 2,
               "credit_id": "5322f71e9251411f8c0047cf",
               "name": "Jim True-Frost",
               "profile_path": "/uogcBGpiG8ZAo1hGdaERsUlAUG7.jpg",
               "id": 108717,
               "order": 3
            },
            {
               "cast_id": 24,
               "character": "Darren",
               "gender": 0,
               "credit_id": "5322f7469251411f8900494c",
               "name": "Edmund Wyson",
               "profile_path": null,
               "id": 1005056,
               "order": 4
            },
            {
               "cast_id": 25,
               "character": "Officer Swift",
               "gender": 0,
               "credit_id": "5322f75c9251411f7e0049a1",
               "name": "Michael Skewes",
               "profile_path": null,
               "id": 182372,
               "order": 5
            },
            {
               "cast_id": 26,
               "character": "Hank Chilton",
               "gender": 2,
               "credit_id": "5322f7739251411f8c0047d5",
               "name": "Scott Cummins",
               "profile_path": null,
               "id": 1053980,
               "order": 6
            },
            {
               "cast_id": 27,
               "character": "Homeowner",
               "gender": 2,
               "credit_id": "5322f7869251411f7a004950",
               "name": "Kevin Mukherji",
               "profile_path": null,
               "id": 976444,
               "order": 7
            },
            {
               "cast_id": 28,
               "character": "Cindy Anderson",
               "gender": 1,
               "credit_id": "5322f79a9251411f77004a2a",
               "name": "Kate Walsh",
               "profile_path": "/xKy0PNB5xLSwm6yyL3zZ5zUNvQZ.jpg",
               "id": 61114,
               "order": 8
            },
            {
               "cast_id": 29,
               "character": "Frank Anderson",
               "gender": 2,
               "credit_id": "5322f7b09251411f7e0049ae",
               "name": "Tom Towles",
               "profile_path": "/nqcpMGjjJkz8IMdDyrObZulUFKg.jpg",
               "id": 27736,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Adele Anderson",
               "gender": 1,
               "credit_id": "5322f7c69251411f85004ab3",
               "name": "Penelope Milford",
               "profile_path": "/zb2EsGdtioS7krQR4LAfH1xkA5V.jpg",
               "id": 27566,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4463c3a368484e0201b7",
               "name": "John McNaughton",
               "profile_path": "/4EoxmVdvj7ZKNOAytTdIijn32Wl.jpg",
               "id": 9200,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5322f6479251411f7a004939",
               "name": "Nancy S. Fallace",
               "profile_path": null,
               "id": 1280434,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5322f59b9251411f7e004986",
               "name": "Peg Haller",
               "profile_path": null,
               "id": 190112,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5322f5ad9251411f89004924",
               "name": "Bob Schneider",
               "profile_path": null,
               "id": 214806,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5322f5c09251411f8c0047b5",
               "name": "Ken Hale",
               "profile_path": null,
               "id": 1300920,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5322f5cf9251411f85004a85",
               "name": "Robert McNaughton",
               "profile_path": null,
               "id": 1072476,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5322f5fa9251411f8f00489e",
               "name": "Elena Maganini",
               "profile_path": null,
               "id": 3121,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5322f60c9251411f8f0048a0",
               "name": "Nan Charbonneau",
               "profile_path": null,
               "id": 1148475,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5322f61b9251411f85004a8b",
               "name": "Richard S. Kordos",
               "profile_path": null,
               "id": 1300921,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5322f6319251411f7a004937",
               "name": "Rick Paul",
               "profile_path": null,
               "id": 1074839,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5322f65a9251411f810048ed",
               "name": "Jacqueline Saint Anne",
               "profile_path": null,
               "id": 137193,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5322f6749251411f89004930",
               "name": "Jamie Sue Weiss",
               "profile_path": null,
               "id": 1062467,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5322f6889251411f77004a0b",
               "name": "Deborah K. Dee",
               "profile_path": null,
               "id": 1300922,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5322f6979251411f8f0048a5",
               "name": "Mary 'Dugan' Buono",
               "profile_path": null,
               "id": 1300923,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "5322f6ba9251411f7a00493f",
               "name": "Steven A. Jones",
               "profile_path": null,
               "id": 9202,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5322f6d09251411f8f0048aa",
               "name": "Richard Maynard",
               "profile_path": null,
               "id": 1104915,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5322f6e59251411f8f0048ad",
               "name": "Bonita Money",
               "profile_path": null,
               "id": 138676,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5322f6f89251411f85004aa1",
               "name": "John Saviano",
               "profile_path": null,
               "id": 982461,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "557300f0c3a3686f58001929",
               "name": "Jean de Segonzac",
               "profile_path": "/nxsm8cisIMLw3tM0F6m0c44AnkZ.jpg",
               "id": 36185,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.554137,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23223,
      "vote_count": 9,
      "budget": 0,
      "overview": "Chris Anderson and his wife Pam live a fairly normal life until Chris loses his job on the police force and secretly turns to robbing banks to make his wife's dreams come true. Upon discovering his secret, she joins his deadly crime wave and together they terrorize an unsuspecting suburban town.",
      "similar": [
         4771,
         984,
         15069,
         979,
         96,
         949,
         807,
         75780,
         49524,
         357096,
         445954,
         21484,
         8292,
         10651,
         11423,
         2749,
         359412,
         18587,
         4639,
         26390
      ],
      "original_title": "Normal Life",
      "runtime": 101,
      "poster_path": "/ib495WLg26wBxvgx44qN41ypDSx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Normal Life Productions",
            "id": 20809,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Spelling Entertainment",
            "id": 272,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-26",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "They found the American Dream ... One bullet at a time!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John McNaughton"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Peg Haller",
         "Bob Schneider"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117202/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MTg5MjA2NV5BMl5BanBnXkFtZTcwODI4NTcyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Ashley Judd, Luke Perry, Bruce A. Young | See full cast and crew »"],
      "reviews": [
         "Normal Life is simply about the illogical love Chris (Luke Perry) has for Pam (Ashley Judd). From the love-at-first-sight moment you know his attraction is there but, other than the physical appeal, you can't understand why. The first time he sees her, she's drunk and having a fight with what seems to be her boyfriend. She smashes a glass and cuts her hand. She's definitely attractive (Judd always is) so Chris overlooks her odd behavior and plays the knight in shining armor role as he tends to her cut. The attraction is immediately so strong that he tracks her down at her workplace to see her again. He's a cop. When he sees her the second time she's sitting in her car outside her job smoking pot. He overlooks this as well and they go to an isolated area to lie in the grass and look at the stars. She's heavy into astronomy. She initiates sex with him and, during the intercourse, he innocently says she's \"crazy.\" She goes berserk, breaks off the copulation, runs screaming to her car and very nearly runs him over. He explains that he meant nothing bad by the comment and, once again, accepts her behavior. This is the theme that continues. No matter what Pam does, Chris loves her. He's not blind. He recognizes Pam's attitudinal deficiencies and points them out to her. He struggles to help her change and become a better person. But when she doesn't change he must either leave her or change himself to fit her life. He does the latter. Chris is not only a cop when the movie begins but also a straight arrow. He does not condone cutting corners, or police brutality. However he ignores his strict code of ethics when he finds Pam smoking pot the first time. That lets us know right away that, while he will try to change her, he is willing to sacrifice all of his personal standards to be with her. By the end of the movie he is a bank robber and a murderer. Normal Life is a neat snapshot of what folks like Chris go through when they allow another person to become the end-all, be-all of their life. They begin to define their own life by the other person. They do not have the strength to let go. Some glimpses of Chris' parents are given but it is incomplete. We do not know if the family is truly dysfunctional or if there are difficulties exacerbated by his father's illness. Perry was enjoyable as Chris. He played the character with a realistic edge. Chris was typically reserved and soft-spoken but Perry made it clear that there was high tension underneath. Judd (one of my favorite actresses) was not so adept with Pam. In order to portray hysteria I think you have to go there, otherwise the acting is painfully obvious. That's what I saw here. In other scenes she did fine as she took Pam along the edge of a normal life. When Pam needed to turn on the charm, Judd excelled. The further Pam went the other direction, the more the performance suffered.",
         "The film starts with the FBI arresting Luke Perry during a car robbery and tracks back to two years prior. It is at this point that Perry first meets Ashley Judd and his life begins to change. Essentially he becomes trapped by his love with a woman that is clearly no good for him - leading to fights, crime and his eventual capture. Perry takes a huge leap away from his 90210 posterboy image with a good haunted performance as the man forced to live outside his small-town \"normal life\" by Judd's desire for more excitement than a small town can give. Ashley Judd is excellent as Pam, constantly riddled with suffering and inconsistency as she flies around emotionally, cuts herself with knives and puts guns to her head and only finds peace when taking drugs, spending money or stealing. The only criticism is that she is required to be nude almost once every ten minutes - this doesn't develop her character and made me think that the director wanted to have it there to satisfy the men in the audience, it almost like she was being exploited. Overall the film is well plotted and makes Perry's change almost believable - however his final change doesn't totally make sense. That said it's a pretty emotional ride that doesn't let you get bored at any point, is well acted and well scripted. All through the film you can't help but feel sad for Perry as he is henpecked, corrupted and ultimately tormented by Judd's childish alluring Pam.",
         "When the honest and idealistic policeman Chris Anderson (Luke Perry) meets the gorgeous and sexy, but alcoholic and drug addicted Pam (Ashley Judd) in a bar, they date and have great sex. Chris immediately falls in love for Pam and marries her, but the reckless and emotionally unbalanced wife brings troubles to his relationship with his family and spends her credit card in futilities, leading the couple to financial problems. When Chris loses his job in the police department, he concludes that they are insolvent and decides to heist banks to resolve their financial issues. I have just watched \"Normal Life\" for the second time and my opinion remains the same: it is a great movie, but could be better with a simple modification in the screenplay. In the beginning of the story, the fate of Chris and Pam is unnecessarily disclosed, and the viewer watches the film knowing that the FBI and the police arrest Chris and chase Pam and consequently breaking the tension or the imagination of the viewer. Ashley Judd astonishingly sexy and Luke Perry have great performances and chemistry in this modern Bonnie and Clyde story apparently based on true events. My vote is seven. Title (Brazil): \"Fronteiras do Crime\" (\"Borders of the Crime\")",
         "An incompatible couple try to find a normal life. Differences of opinion constantly lead to outbursts of anger and threats of ending the partnership. Pam (Ashley Judd) is an irresponsible woman who makes up for the lack of excitement in her life by indulging in drugs and alcohol. She is certainly not content to be a housewife. Policeman Chris (Luke Perry) on the other hand is a level-headed husband who pampers her in every material way. He is soon in dreadful debt. The turbulent life-style of these two main characters occupy the screen most of the time and we feel there is no hope for either of them. Indeed their incompatibility is enough to put one totally off marriage. Their shouting matches are quite savage and somewhat depressing. When Chris resigns from the police force and discovers a new way to riches and living life to the full, excitement takes over and the characters are fired with a new enthusiasm. Pam insists she be a part of this new game and for a time she becomes a new woman. The characters are well drawn, the car chases quite exciting. This change of mood spices up their sex lives clearly depicted in a series of bedroom scenes. The final sequences are dramatic and exciting so stay with the film to the end. The old saying that \"Crime does not pay\" is clearly delivered and understood.",
         "I must admit that seeing 90210's Luke Perry in Normal Life's leading role did not inspire me, but after watching this film I was pleasantly surprised. The foreshadowing scene at the very start of the film gives a sense of foreboding doom that pervades the rest of the story. Pam (Ashley Judd) is a woman torn between living on the edge and having a normal, storybook life. Chris (Luke Perry) longs for such a life, but also seems to be excited by Pam's wild side. He goes from cop to bank robber in a first successful, but then futile attempt to make things right, which only seems to excite Pam more. Eventually their luck runs out, and the inevitable ensues. The last 15 minutes of this film are the best part with some surprising twists right near the end.",
         "This was surprisingly good (based on a true story) about a young couple who get in over their heads. Luke Perry (who I've never liked as an actor) is believable as the cop-husband who loses track. Ashley Judd, a lovely and talented actress who makes too many bad films, is edgy, sardonic, and nihilistic in a beautiful and frightening way. She cooks the space surrounding her and it's a joy to see. A 7 out of 10. Best performance = Ashley Judd. If Ms. Judd made more films like this, she would be respected more instead of being lusted after quite so much. She needs better advisers when it comes to her film choices (just my opinion; I think she's great). This film probably did no business, but it's worth your time and very human.",
         "I thought this was a great movie. Regardless of Luke Perry looking like he isn't much of a tough guy in most of his roles, he's still a pretty good actor. Ashley Judd is a phenomenal actress and was perfect, as usual, in her role. For being a fact-based story, I was glad to see that it wasn't Hollywood-ed up, for lack of a better word. I just wish that when they make movies like this, they get more detailed about it so that the viewers can understand how being in love could drive someone to do what these two people did. Anyway, I think people will enjoy this, if only for the fact that Mrs. Judd is unclothed through much of the movie...lol",
         "\"Normal Life\" was barely given a theatrical release by its studio, Fine Line. That's a shame, because there is a lot that is worthy in this movie. John McNaughton was a good choice to direct this movie, because in \"Henry: Portrait Of A Serial Killer\", he showed he had a talent for showing those in lower class positions with low self esteem - just like the two main characters in this movie. These characters have high ambitions and try to do better (at least initially), but they are shot down by themselves and their surrounding society. They want, but don't get, respect. The movie is focused on their insides, not much on what surrounds them like their jobs. They are drawn together because they are two lost souls - they at least have that to share. The two actors are excellent in their roles (Luke Perry sheds his pretty-boy image completely here.) The movie is not perfect - there are a few details that are not explained (like what exactly is used to justify Perry's character's firing from his job.) Also, the movie is a bit too long, more noticeably in the first half of the movie - cutting fifteen or so minutes from the movie would have helped. But despite these faults, the movie is still well worth seeking out.",
         "Both films were based on characters and the budgets were many millions of dollars apart in spite of the fact, in B and C we NEVER get to know either of the characters and what today is so outdated, is made up by the incredible performance of Ashley Judd, who employs no clichés of a a wild drunk and does not reveal herself as a clearly bipolar,drugged out mess. Later, to his credit the script writer does not delve into her childhood past beyond one scene,thus throwing pity at her.This is way truer than fashion icon Bonnie whose famous line \"we rob banks\" thrilled people and made heroes out of them and Theodora Van Runkle.Most surprising is Luke Perry (with bad mustache created to make him not so baby faced)who is really good and we get a glimpse of how honorable a man is who falls for a gorgeous unpredictable girl/woman whose heroes and myths lie in astronomy and chaos and lack of fear.I have known two women like them and been in love with them who were equally beautiful and could be so appealing and sexy one minute and the next out of their minds. In their case it was a lot of speed when it was legal,and they fascinated a lot of guys whose lives they messed up before dumping them prior to me. I had to leave them because they had such power. One married 5 times to millionaires and institutionalized while the other is now the most normal mother who looks great and goes to PTA meetings.She was exactly like the Judd character while the other drove around Hollywood with shotguns her classic sports cars and a Bentleys drinking champagne.Exactly like Judd's character. This film is far more real and explains the unexplainable but it usually has to do with drugs and booze while in B and C it was fashionable to love the underdog during the depression and feel compassion for them. Ashley Judd, again is a genuinely intelligent and gorgeous actress with an educational b.g. which is astonishing and may have influenced the director/writer to involve her in the astronomy which was a masterful quirky touch.The dialogue rings true and again Perry and her amaze.",
         "Not a terrible movie. The title is ironic. Luke Perry and wife Ashley Judd lead anything but a normal life. He's a diligent cop and she works in some sort of electronic assembly plant. The problem is that she becomes erratic. She starts boozing it up and taking drugs. She gets moody. She goes on wild spending sprees and gets them into terrible debt, while the distracted Luke Perry is so absorbed by her that he alienates his partners and is finally fired. She shows up late at work and is truculent with her boss and after a period in rehab she's cashiered as well. Perry and Judd have furious arguments over expenses in their modest apartment. What they have going for them is her occasional lucid periods and a tendency to rut like two chimpanzees in heat. In the print I just saw, some of the more lurid glandular encounters were cut, as were some scenes of self mutilation, and that's too bad because here the nature of the sex actually plays a part in the story. Well, they have individual interests as well. Judd is a feverishly rapt amateur astronomer and Perry would just love to open his own book store. Perry has a bearded friend with whom he takes friendly motorcycle rides, and Judd has a lesbian friend from work. That's about it for this unhappy couple. In order to get them out of debt and to keep them together, Perry takes to holding up banks. As an ex-cop he knows how to do it. He fibs to Judd and tells her that he's putting in overtime as a security guard. When she improbably discovers his real source of income, she's not at all shocked. She finds it exciting. She's overjoyed and is finally able to achieve orgasm with Perry. At her insistence, Perry takes her along on his next heist, but she's so elated she shoots a row of holes in the ceiling before he manages to yank her through the bank's door. By this time it's clear that Judd is a Class A bipolar. She's right out of DSM IV-R. She's glum and given to cutting herself all over. The next minute she's wildly gleeful or sometimes irritable over nothing. Her judgment is impaired. Compared to Luke Perry, though, she's a chrome dome. He's one of the stupidest men who ever walked the earth. At one point she leaves him to live with her lesbian friend. When he begs her to come back home, she lays everything out for him in plain language, but it all bounces off him. Her truths are as ping pong balls. It's not an unintelligent plot, reminiscent of a classic cheap noir called \"Gun Crazy\" with John Dahl and Sparkle Annie or whatever her name was. (I'm too lazy to look it up.) It's the kind of crazy story that might really happen to two screwballs. Ashley Judd does a good job. She was superb in another crime drama, \"Heat,\" as Val Kilmer's wife. She's demonstrated the limits of her range as an actress elsewhere but in this film her performance is unimpeachable. Luke Perry is another matter. He seems to be a nice enough guy but as an actor he's sufficiently lightweight that he should stick to the small screen where \"presence\" matters less. He had the same problem that David Caruso had, but I can't put a name to it. Judd's oddness is accurately shown. When the couple visit some relatives for a barbecue, instead of sitting at the table and drinking a beer with the adults, she immediately wanders off and kicks a ball back and forth with the family's child, ignoring the usual rules. Nothing dramatic, just askew. But otherwise the direction is flat and uninspired. (When Judd speaks at a group therapy session, she's shot from a high angle for no discernible reason.) It's kind of disappointing, coming as it does from the director of \"Henry: Portrait of a Serial Killer.\""
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Fine Line Features",
         "New Line Cinema",
         "Normal Life Productions"
      ],
      "summaries": [
         "Chris is young idealistic cop who falls in love and gets married to Pam, a beautiful but emotionally unstable woman who suffers from alcoholism and drug addiction. While Chris is trying hard to have a normal life and some money, Pam is big spender and their marriage is constantly troublesome with the financial situation getting worse and worse. The biggest blow comes after Chris loses his job. In the desperate situation Chris decides to use his police skills to rob banks.",
         "When the honest and idealistic policeman Chris Anderson meets the gorgeous and sexy, but alcoholic and drug addicted Pam in a bar, they date and have great sex. Chris immediately falls in love for Pam and marries her, but the reckless and emotionally unbalanced wife brings troubles to his relationship with his family and spends her credit card in futilities, leading the couple to financial problems. When Chris loses his job in the police department, he concludes that they are insolvent and decides to heist banks to resolve their financial issues."
      ],
      "budget": 0
   },
   "movielensId": 1053,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-26",
      "dvdReleaseDate": "2005-02-15",
      "directors": ["John McNaughton"],
      "runtime": 101,
      "movieId": 1053,
      "title": "Normal Life",
      "mpaa": "R",
      "actors": [
         "Ashley Judd",
         "Luke Perry",
         "Bruce A. Young",
         "Jim True-Frost",
         "Edmund Wyson",
         "Michael Skewes",
         "Scott Cummins",
         "Kevin Mukherji",
         "Kate Walsh",
         "Tom Towles",
         "Penelope Milford"
      ],
      "imdbMovieId": "0117202",
      "originalTitle": "Normal Life",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["eZB90dRD79w"],
      "plotSummary": "Chris Anderson and his wife Pam live a fairly normal life until Chris loses his job on the police force and secretly turns to robbing banks to make his wife's dreams come true. Upon discovering his secret, she joins his deadly crime wave and together they terrorize an unsuspecting suburban town.",
      "tmdbMovieId": 23223,
      "avgRating": 3.04091,
      "releaseYear": "1996",
      "numRatings": 220,
      "posterPath": "/ib495WLg26wBxvgx44qN41ypDSx.jpg"
   }
}