{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "washington d.c.",
            "id": 521
         },
         {
            "name": "bus",
            "id": 992
         },
         {
            "name": "march",
            "id": 165461
         }
      ],
      "imdb_id": "tt0116404",
      "video": false,
      "title": "Get on the Bus",
      "recommendations": [
         15665,
         34152,
         47044,
         28216,
         53862,
         36739,
         41480,
         25099,
         35664,
         24664,
         114740,
         127509,
         15059,
         47898,
         41613,
         27995,
         17923,
         39310,
         21295,
         19317
      ],
      "backdrop_path": "/vG7EBc8csI95HCjh5GaOWTKpndq.jpg",
      "revenue": 5731103,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jeremiah",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dc79",
               "name": "Ossie Davis",
               "profile_path": "/9oVewASbQrzqENeKJX5CGLVzq3U.jpg",
               "id": 15531,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dc7d",
               "name": "Charles S. Dutton",
               "profile_path": "/ajXBoMz8xGgDDcn8xpRi8LmXKKa.jpg",
               "id": 17764,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Flip",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dc81",
               "name": "Andre Braugher",
               "profile_path": "/9VtD8RlQ0urgDKS7B8tR456dW50.jpg",
               "id": 6861,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rick",
               "gender": 2,
               "credit_id": "546787ffeaeb8118b7000322",
               "name": "Richard Belzer",
               "profile_path": "/r9X9FzyYlYt20rfl0wUmgRAl5gg.jpg",
               "id": 32396,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Junior, aka 'Smooth'",
               "gender": 2,
               "credit_id": "54678810eaeb8118b4000328",
               "name": "De'Aundre Bonds",
               "profile_path": "/3zCQRZ6bkUNA9JKW6CDpjz1whrK.jpg",
               "id": 93538,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Evan Thomas Sr.",
               "gender": 2,
               "credit_id": "5467881e22136e1e10000376",
               "name": "Thomas Jefferson Byrd",
               "profile_path": "/pFmHmzQ3rS9ZD8A2eDXzk6wkHT6.jpg",
               "id": 98889,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Kyle",
               "gender": 2,
               "credit_id": "5467882f22136e1e17000307",
               "name": "Isaiah Washington",
               "profile_path": "/kK4nEwvY0MFwCsQ17E0w0El7G9P.jpg",
               "id": 21353,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Jay",
               "gender": 2,
               "credit_id": "5467883b22136e1e1c00035b",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Wendell",
               "gender": 2,
               "credit_id": "5467884beaeb8118b4000331",
               "name": "Wendell Pierce",
               "profile_path": "/uOsldo9Pkl0E79UbIXX5tZZmC8F.jpg",
               "id": 17859,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Randall",
               "gender": 2,
               "credit_id": "568b5c8fc3a36860e902d83f",
               "name": "Harry Lennix",
               "profile_path": "/uwpRytLjzz1IvjNanYNlplPVal9.jpg",
               "id": 9464,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Gary",
               "gender": 2,
               "credit_id": "568b5ca0c3a3685f890170ea",
               "name": "Roger Guenveur Smith",
               "profile_path": "/c6yUnUcbNxCUKAjucLlh6VHzmCd.jpg",
               "id": 40377,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Xavier",
               "gender": 2,
               "credit_id": "568b5caf9251410ffb001b46",
               "name": "Hill Harper",
               "profile_path": "/6Dz2mV1Jdfnv0789JTFY8G08ju2.jpg",
               "id": 57686,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Jamal",
               "gender": 2,
               "credit_id": "568b5cbfc3a368607502d6b3",
               "name": "Gabriel Casseus",
               "profile_path": "/hq47yaZk40VSv0rbdtrrj5J5zzL.jpg",
               "id": 18272,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Mike",
               "gender": 2,
               "credit_id": "568b5cca9251412e5202b9c0",
               "name": "Steve White",
               "profile_path": "/sxOUPWrGPWszcAe6h5OVIzDi3mL.jpg",
               "id": 15536,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Craig",
               "gender": 2,
               "credit_id": "568b5cd5c3a3685f890170f2",
               "name": "Albert Hall",
               "profile_path": "/yHGN2pIdBcBk19sAu0EchOxfYMY.jpg",
               "id": 8354,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Shelly Maxwell",
               "gender": 1,
               "credit_id": "568b5cf3c3a368607502d6bb",
               "name": "Kristen Wilson",
               "profile_path": "/c1OmYimnJkLyRYNBHyieRpJXa4J.jpg",
               "id": 31029,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Jamilia",
               "gender": 1,
               "credit_id": "568b5cffc3a3684bcc02f467",
               "name": "Paula Jai Parker",
               "profile_path": "/hCFVh90DDs7bhv6qEhepXeJvFtY.jpg",
               "id": 45245,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Jindal",
               "gender": 1,
               "credit_id": "568b5d109251414ecb01ea6d",
               "name": "Joie Lee",
               "profile_path": "/oWREZ1vjXxycfdwV5wlDwqZnODo.jpg",
               "id": 13602,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dc6f",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dc75",
               "name": "Reggie Rock Bythewood",
               "profile_path": "/lWvvnBHYsbMrvCR1CXRU2ycijDL.jpg",
               "id": 71943,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.288003,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49471,
      "vote_count": 15,
      "budget": 2400000,
      "overview": "Get On the Bus follows several Black men on a cross country bus trip to the Million Man March. On the bus are an eclectic set of characters including a laid off aircraft worker, a former Gang Banger, a Hollywood actor, a cop who is of mixed racial background, and a White bus driver, all make the trek discussing issues surrounding the march, manhood, religion, politics, and race.",
      "similar": [
         9798,
         11679,
         13,
         1402,
         9437,
         1571,
         100402,
         19908,
         180,
         238636,
         267,
         66,
         586,
         10216,
         1637,
         13027,
         574,
         205220,
         37137,
         6538
      ],
      "original_title": "Get on the Bus",
      "runtime": 120,
      "poster_path": "/khxusCDdO5JKZ2MBE1xKA52Y5Rq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "40 Acres & A Mule Filmworks",
            "id": 4319,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-10-16",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "On October 16, 1996, the one year anniversary of the Million Man March, Spike Lee invites you to lift your head, raise your voice, and...get on the bus.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Spike Lee"],
      "runtime": 120,
      "synopsis": "Twelve black men, with nothing in common, except their race and destination, board a Spotted Owl Bus in Los Angeles headed for the Million Man March in Washington DC. The men are: George (Charles S. Dutton), the trip organizer; Jeremiah aka \"Pop\" (Ossie Davis), a downsized 80-year-old senior citizen who is an expert on African-American history; Evan & Evan Jr. aka \"Smooth\" (Thomas Jefferson Byrd and De'Aundre Bonds), an estranged father and teenage son who are court ordered to be shackled together for 72 hours after Junior's arrest for petty theft; Kyle & Randall (Isaiah Washington and Harry J. Lennix), a gay couple in the midst of breaking up; Flip (Andre Braugher), a narcissistic actor; Gary (Roger Guenveur Smith), a LAPD officer who is half black and half white; Xavier (Hill Harper), a UCLA Film School student who is making a documentary; Jamal (Gabriel Casseus), a former gangster turned Muslim seeking redemption; Jay (Bernie Mac), a bubble gum company owner; Mike (Steve White), a conspiracy theorist who thinks the march is a plot to gather one million black men in one place for mass extermination. And then there is Craig (Albert Hall), the bus driver who is dealing with his teenage daughter's pregnancy. Note: three additional bus passengers are shown observing the action. They are credited but are not introduced nor are they given dialogue. They are Ja-Dee (Jadi McCurdy), a young man with dreadlocks; Doc (Hosea Brown III), a medical doctor; and Kahlid (Guy Margo), a member of the Nation of Islam. Along the way, the men get to know each other and discuss various topics including their personal lives, their political beliefs and even the recent O.J. Simpson murder case. In one of the few things that all of them have in common is their belief that even if Simpson was indeed guilty of killing his \"white ex-wife and a Jewish white man\" (which they continue to maintain that he didn't), it was right of him to be acquitted as \"payback\" for social racism against black people in America. The elderly Jeremiah (whom the men nickname \"Pop\") later reveals that after he lost his job, he became an alcoholic and eventually lost his family. He hopes the March will revitalize him and inspire him to turn his life around. Evan Jr., who fancies himself as a gangster rap artist named 'Smooth', manages to escape from his father (Thomas Jefferson Byrd) at one point. Evan Sr. finds Junior and realizes that Junior's criminal behavior was an attempt to gain his attention after he became neglectful. He expresses regret and promises to make a sincere effort to be there for Junior. Xavier (Hill Harper), who refers to himself as \"X\", begins interviewing the passengers with his video camera, a narrative device which allows each of the passengers to reveal information about their lives and how they perceive themselves and the March. Xavier captures as much as he can on his camcorder but the group often dismisses the earnest amateur filmmaker as \"Spike Lee Jr.\" Tensions rise after Xavier's interview with Flip, who spends most of his time bragging about his own sexual prowess, and who seems more concerned with getting a film role opposite Denzel Washington than the purpose of the March. Flip reveals himself to be a bigot, homophobic and racist, provoking the gay couple Kyle and Randall for being homosexuals and Gary for being biracial. This leads to further conflict when Gary reveals that he is a police officer working a beat in South Central Los Angeles, two things for which he has faced criticism and ostracism from other African Americans his entire life. Gary proudly recalls his father, a black policeman who was gunned down in the line of duty by black street gang members; an incident that Gary credits with his decision to become a police officer. Gary's revelations about his life and career spur Jamal to reveal that he is an ex-Crip gang member who converted to Islam and began work with a community outreach program that works with children to discourage them from becoming involved in gang activity. In a tense conversation, the two debate over the causes of gang violence and the limits of repentance and forgiveness: Jamal confesses that, while he was a Crip, he committed murder and rape, crimes for which he was never arrested or punished. Following Jamal's confession, Gary informs him that he will be arrested upon their return to California. Next, Kyle reveals that he is a 1991 Gulf War veteran who was purposely shot by his own platoon because of his race and sexual orientation. Being gay, African-American and Republican, he feels persecution from all sides, which has made him bitter. Although they are having problems in their relationship, Randall, tries to comfort his lover but makes a point of outing Kyle when he refuses to talk. Kyle is harassed further by the homophobic Flip who mocks him claiming \"Oh my God, a gay black Republican, now I have seen everything!\" with additional homophobic statements rants. Flip also picks on Randall for his effete gay mannerisms following Kyle's outing. A heated argument between Flip and Kyle turns violent when Flip punches Kyle. In the resulting fistfight, Kyle is victorious and Flip is embarrassed. During the trip the bus breaks down and the group boards a new bus. Craig runs off to return to Los Angeles after being contacted by his daughter who has gone into labor. The new bus driver is Rick (Richard Belzer), a black man who is ethnically Jewish. Eventually, he feels the need to speak out against Louis Farrakhan's Anti-Semitic statements that Jews are a \"gutter\" people and that not all Jewish people are white. Being a Black Jew, Rick talks about his parents' and other Jews' participation in the 1960s Civil Rights Movement, but George, along with some members of the group fight back using Jewish stereotypes. At a rest stop, Rick quits the trip in protest telling George: \"I wouldn't expect you to drive the bus to a Ku Klux Klan meeting!\" George becomes confrontational and angrily accuses Rick of being a racist for not supporting the march in spite of Farrakhan's own racist remarks against both white and Jewish people (while at the same time refusing to acknowledge that Farrakhan ever made them). Although Rick maintains that he is not a racist, George refuses to accept this. George begrudgingly agrees to disagree with Rick and lets him depart, although he refuses to look at Rick when Rick wants to shake his hand before he leaves. George drives the bus for the rest of the trip, with help from Evan Sr. who, while not licensed a bus driver, has experience driving trucks. The group meet various people at rest stops including fellow travelers, White American Southerners (who, to the group's surprise, are friendly) and women (both black and white with whom Flip tries to flirt). At a diner, the group meets Wendell (Wendell Pierce), a Lexus salesman who bribes his way onto the bus despite pleas from George to travel to the March on his own, since taking on board a passenger without a ticket could potentially jeopardize his job. On the route, Wendell reveals that he is a Republican and his reason for going to the March is to sell cars. He decries liberal blacks such as Jesse Jackson who believe that it is the government's responsibility to make their lives better, using successful and conservative blacks such as Colin Powell as examples that black men can \"make it\" in society. His rhetoric quickly comes to be accused as racist from the others, even Kyle however, as he disparages several people on the bus as being \"niggers,\" after which the other passengers literally throw him out of the bus. While driving through Knoxville, Tennessee, the bus is pulled over by Tennessee state troopers (one of whom is played by Randy Quaid in an uncredited cameo). They are stopped on suspicion of drug trafficking and searched with drug-sniffing dogs despite the pleas of Gary who shows his LAPD badge to the troopers. The troopers ignore Gary and continue with the search, however they do not find anything illegal and permit the bus to continue on its way. As the bus approaches Washington, D.C., Xavier discovers Jeremiah slumped over and unconscious in his seat. They rush him to a hospital and watch the beginning of March on television as they await word on Jeremiah. A doctor later informs the group that Jeremiah has died of heart disease. The men are shocked and saddened by Jeremiah's death. They end up watching the rest of the March from the hospital... never making it to Washington to partake in the March. George tells the men that the March should be seen as merely the beginning of a larger movement. In the final scene, in front of the Lincoln Memorial, George leads the men in a prayer that Jeremiah wrote before his death.",
      "writers": ["Reggie Rock Bythewood"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116404/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMjA5NjQ0Nl5BMl5BanBnXkFtZTcwMjgwMzYxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Ossie Davis, Charles S. Dutton, Andre Braugher | See full cast and crew »"],
      "reviews": [
         "Armed with 16mm cameras, a miniscule budget financed independently by 15 different black businessmen, and a wonderful script, Spike shot \"Get On The Bus\" and released it to commemorate the one-year anniversary of the 1995 Million Man March. Set on a bus bound for Washington D.C., this film examines the problems and opinions of various of black men on racial issues in the 90's. Family, misogyny, homosexuality, religion, violence, education, and economics are all addressed here as well as other issues. Spike does not only shed light on issues that pertain to black peoples involvement in White America, but the film also attacks color-consciousness among light-skinned and dark-skinned blacks (as he did in \"School Daze\"). Like \"School Daze,\" this may be the only other Spike Lee film that seems to be aimed directly at Black America, and Spike shows the varying degrees of complexity with his cast of characters. There is a rage-filled actor, a homosexual couple in the midst of separating (one out-and-proud, the other closeted), a sensitive cop, a level-headed family man, a gangbanger turned Sunni Muslim, a naive filmmaker, and a tired, defeated elderly man. There is also an estranged father who sees the March as an opportunity to re-connect with his resentful, bound-for-crime teenage son. His son has been recently convicted of burglary and has been ordered to remain \"chained\" to his father for 48 hours, the irony of which does not escape the other members on the bus. Given the film is almost set entirely on a bus, Spike restrains himself in dispensing out his evolving camera and editing styles, using only a brief sequence set in a desert to bleach the screen with a heavy yellow tint. Many Spike Lee regulars are in the film, like Ossie Davis and Isaiah Washington who give sound performances (Davis' \"I lost everything\" monologue is especially moving). The real notable acting is provided by Andre Braugher as an angry, egocentric actor whose rage is fortunately balanced for him with a healthy dose of articulated intelligence and Roger Guenever Smith as a sensitive, bi-racial cop who works in South Central Los Angeles. Those two really are the stand-outs in this film. The dialogue is so flowing and casual in this film despite its topic matter, that you could listen to this film instead of watch it! I can't recommend this film enough for fans of Spike Lee or fans of great dialogue. As a Spike Lee worshipper, I rank this film in his top 5. Potent.",
         "I just got done watching Spike Lee's \"Get on the Bus\" for the first time in about a year. The movie is done in a manner, I can't really describe it, that is very different from previous efforts by Spike Lee. The film follows a bus of about twenty men, all African-American, on a trip to Washington, D.C. to attend the Million March that was held there in 1995, about a year before this movie was made. We follow each of the men, including a father and son who have tethered together on a court order; a homophobic actor, who takes an immediate disliking to two homosexual men; a cop whose father was killed in the line of duty; a former gang member who is now a social services worker for troubled kids who he's trying to keep from living a life in gangs; an up and coming film student, who is video taping the event so he can show it to his future children; and an open-hearted elderly man who is going to the Million Man March simply because he wants to. \"Get on the Bus\" is in my opinion, one of Spike Lee's best films. Each of the characters are unique in one a way or another. A film that is not to be missed.",
         "Get On The Bus is probably one greatest movies people do NOT know about. This movie places men of all ages and different backgrounds together headed to The Million Man March. Although many may not relate to Farrakhan and his beliefs, they will, however, be educated on issues of race, unity, and respect. Regardless of skin color or ethnic background, people can easily relate to the characters on-screen. If anything, Get On The Bus will teach anyone to have a deeper love and appreciation of our fellow man.",
         "NO SPOILERS A real stunner from Spike Lee using his characteristic mental conundrums to mix a wide spectrum of all black male \"individual\" characters on the way to a march/event in Washington; a Gay couple, a truculent/homophobic guy/LAPD Cop/an Elder/a young Gang Member chained to his Father on a Judge's release understanding and many other interesting guys you would pass on the street - maybe without a second glance - until you see this film. For me, a single white guy, I felt the film successfully served to strip away more than the fair share of stereotypical notions maintained in the collective consciousness of both black and white - \"GET ON THE BUS\" hits the spot over and over, and held my attention from start to finish. The 'journey' travels along with the interaction of the characters, split into scenes by a great and meaningful soundtrack - the road is but a short journey but a longer way through the soul to give understanding. Whilst the conclusion/end of the film was probably one of the most powerful messages, I did feel a little disappointment - but as I write, instead of me whining for a better ending, my mind has traversed across millions of attitudes and set free many images that had been lodged in my simple mind. This may not sound like a riveting review - but you'll need to watch it - you'll be nourished.",
         "Get on the bus is a superb film in every way. The acting , the story ,the photography and the sound track are a joy to behold. Spike Lee should be praised for his unbiased view on the struggle for black rights in America. You may not always agree with some of the sentements of the film but you cant help be captivated. Dont miss it! 8 out of 10",
         "I can't forget about the extraordinary Do The Right Thing though. Get On The Bus follows the bus trip of a group of brothers on their way to the Million Man March. The acting is top of the line. The actor playing Evan Junior is a perfect match for his character. He turns in one of the greatest performances. The script is perfect and it only proves to be stronger when you remember that the film was shot in sequence. Which leads me to another point. Anyone with even a small amount of film-making understanding knows that it would have been hell to shoot this film in 35mm, so Spike Lee recorded in a smaller print and had it blown up. The result is a film that's almost documentary style but works perfectly. Throughout the course of the film, Spike Lee introduces us to various personifications of the black man. Notice I used the word personifications, not stereotypes. We have a self hating brother, who is picked up halfway through the trip, who puts down on black schools and colleges. We have a highly homophobic brother who's loud and arrogant at the same time. We have a Muslim brother who has no lines but is integral even without lines. There are black republicans along on the trip. Two black homosexuals. And to top it off it's filmed entirely on a bus trip except for a few scenes which Spike Lee stated were on a sound stage. Great film. 9/10",
         "I'm not a black man in America, but I've loved all of Spike's films and quite frankly, I wish people (not, by and large, the commenters on this film, refreshingly) would attempt to make films \"black\" or \"white\" or \"Latino\" or any other social or political or religious demeaner. This is a wonderful film and all people should be able to appreciate it. I would like to respond to those who think this is a \"white-berating\" movie or something. One word: please. The vast majority of the dialogue in this film is African-American focused and there is very little criticism of The White Man. Those of you who claim otherwise, well, to quote Shakespeare, \"I think thou doth protest too much.\" Lee has given the black man, as they like to say in liberal arts grad school programs, agency. He has presented the wide range of black circumstances. These are not victims of drive-by shootings, gang-bangers, or basketball players. I did find the characters a bit stock in their very attempts to convey such distinctly different elements of the black experience. It was as though Spike ticked off boxes saying, OK, we have a conservative black man, we have a struggling middle-class black man, we have an egomaniacal black man..but having said that, it is only possible for that to be a criticism because as viewers, we are so unused to seeing black men depicted in complex ways. As a white guy who's worked in largely minority schools for a decade and was The White Guy who'd attend all the functions of the minority student association events in college-that is to say, I enjoyed learning about all manner of racial diversity, I don't think, that as a white person, it's appropriate to judge the fitness of folks of another ethnicity to use words which might seem a little coarse. If people want to use those words, when they do not refer to me, what is it to me? If white folks hadn't been using those words back in the day, the use of those words would not even be an issue now. Anyway, I'm rambling, but it seems that this film was made, essentially, as one of those rare vehicles which allows people (not that many people saw this film, of course.....) to see black men as humans. We see an egomaniacal, sexually-insecure man named Smooth (the fantastic Andre Braugher). We see a light-skinned African American (the very talented Roger Guenver Smith) who must answer barbed criticisms from Smooth about his claim to a legitimate place in the African-American community, Charles Dutton, criminally underemployed in modern movies as the organizer of the bus journey to the Million Man March and the glue who holds (as best he can) the trip together. We see two gay men (Isaiah Washington (ya really think the man is homophobic?)) and Henry Lennix as Randall (also excellent) whose relationship is challenged by Randall's insecurity about it. Ossie Davis is brilliant as an older man who largely keeps his counsel but when needed to keep the train from coming off the tracks, seems to know just how to calm the storm. A hard-working middle-class man named Evan (the reliable Thomas Byrd Jr., a regular in Lee's movies) is struggling with how best to raise his son. His heart is in the right place but the job is not easy. His son, Jamal (Gabriel Casseus giving a nuanced performance communicating all range of depth and yet at the same time, the simplicity which only a young person can convey). The black man who turns out to be self-hating, and who joins the bus (for a short time, in Memphis), Wendell, is amusingly and with a great deal of satisfaction, I would imagine, to all positive and forward-thinking blacks (and folks of other colors) dealt with quite appropriately. His behavior is quite disgraceful and as I watched him I hoped that he would get the harsh comeuppance which he did indeed receive. The cinematography of the bus travelling through the American west is bleached out in order to convey the starkness of the landscape and in order that the focus remains on these rich, wonderfully human characters. Lee does a fantastic job directing. I'm not willing to say this is his best film when the man has directed \"Do The Right Thing\", and \"When the Levees Break\" which is all you need to know about Hurricane Katrina. But saying this film is worse than those two is not saying anything bad about this film. It is excellent and it is a tribute to black men which more people should see so that in America more people understand that black men are as diverse as there are grains of sand on the ocean.",
         "We join the bus ride with a group of Black Americans as they journey to the Million Man March. During this journey, the camera enters the soul and beliefs of each character that represents a whole spectrum of the Black community. Their conversations range from the politics to the religions and beyond their inner-self . Each one finding new meaning to their life and destiny. Reggie's preachy but fascinating script is handled masterfully by the genius Spike Lee.",
         "Let me begin by letting you know I am neither black or white. I say this so you don't think I speak from a particular bias. I firmly believe that Spike Lee captured the central epic struggle within the black community and its overall effect on the American landscape as a whole. I was happy to see that ALL aspects of the society were equally represented in this film without reinforcing dated stereotypes. This is clearly Lee's greatest work. EVERYONE SHOULD SEE THIS MOVIE ONCE.",
         "I always intended to watch this movie for a long time but I kept putting it off. I was really surprised at how excellent and well-written this movie actually was. If you enjoy films where a group of diverse people are put into a situation and then left to deal with each other (eg \"Twelve Angry Men\"), then you must see this movie. This film was also very intelligent. I think too many people believe that if you get a group of black men together for anything, they'll soon be calling each other \"nigga\" and violence will erupt, not necessarily in that order. About halfway through the movie, I told my wife that the n-word had not been used at all, and no punches had been thrown. But I was wrong. What made it even more interesting was the way the men responded to the person who called everyone \"nigga,\" and there was a fight, which occurred between a homosexual and an arrogant, big-mouthed guy who kept calling him \"faggot.\" I don't condone violence, but the gay guy knocked him down a peg or two, and he certainly had it coming. This film also solidifies Andre Braugher as an incredible actor. He has taken on such diverse roles and here, he was outstanding. So many of these actors were. Almost every scenario and discussion is covered in two hours well spent."
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Columbia Pictures",
         "15 Black Men",
         "40 Acres & A Mule Filmworks"
      ],
      "summaries": [
         "Get on the Bus follows several Black men on a cross country bus trip to the Million Man March. On the bus are an eclectic set of characters including a laid off aircraft worker, a former Gang Banger, a Hollywood actor, a cop who is of mixed racial background, and a White bus driver, all make the trek discussing issues surrounding the march, manhood, religion, politics, and race.",
         "A disparate group of African-American men travel by bus to Washington, DC for the Million Man March."
      ],
      "budget": 2400000
   },
   "movielensId": 1054,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-16",
      "dvdReleaseDate": "2001-01-30",
      "directors": ["Spike Lee"],
      "runtime": 120,
      "movieId": 1054,
      "title": "Get on the Bus",
      "mpaa": "R",
      "actors": [
         "Ossie Davis",
         "Charles S. Dutton",
         "Andre Braugher",
         "Richard Belzer",
         "De'Aundre Bonds",
         "Thomas Jefferson Byrd",
         "Isaiah Washington",
         "Bernie Mac",
         "Wendell Pierce",
         "Harry Lennix",
         "Roger Guenveur Smith",
         "Hill Harper",
         "Gabriel Casseus",
         "Steve White",
         "Albert Hall",
         "Kristen Wilson",
         "Paula Jai Parker",
         "Joie Lee"
      ],
      "imdbMovieId": "0116404",
      "originalTitle": "Get on the Bus",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["gHHiYMOx_M8"],
      "plotSummary": "Get On the Bus follows several Black men on a cross country bus trip to the Million Man March. On the bus are an eclectic set of characters including a laid off aircraft worker, a former Gang Banger, a Hollywood actor, a cop who is of mixed racial background, and a White bus driver, all make the trek discussing issues surrounding the march, manhood, religion, politics, and race.",
      "tmdbMovieId": 49471,
      "avgRating": 3.48468,
      "releaseYear": "1996",
      "numRatings": 816,
      "posterPath": "/khxusCDdO5JKZ2MBE1xKA52Y5Rq.jpg"
   }
}