{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120107",
      "video": false,
      "title": "Shadow Conspiracy",
      "recommendations": [
         50116,
         219575,
         124873,
         15866,
         45712,
         36141,
         70877,
         39140,
         32077,
         46063,
         23303,
         10990,
         143928,
         64832,
         79190,
         191094,
         32029,
         58729,
         10551,
         9057
      ],
      "backdrop_path": "/evhH1zH9qxkgGjGZBtPraukwMbL.jpg",
      "revenue": 2154540,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Bobby Bishop",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059a97",
               "name": "Charlie Sheen",
               "profile_path": "/g4e1QpcNTpmq2uPr5GDNuMvjRuU.jpg",
               "id": 6952,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Jacob Conrad",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059a9b",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Amanda Givens",
               "gender": 1,
               "credit_id": "52fe469a9251416c91059a9f",
               "name": "Linda Hamilton",
               "profile_path": "/fcRpgjonpH3WmPs0V63g7iP7Dbm.jpg",
               "id": 2713,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "The Agent",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059aa3",
               "name": "Stephen Lang",
               "profile_path": "/tqF6ibURpLvRPlgvLRvjCQqWaa2.jpg",
               "id": 32747,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Grasso",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059aa7",
               "name": "Nicholas Turturro",
               "profile_path": "/i9m7ox3KoSkqeKvyGqLHZovUN5Q.jpg",
               "id": 32897,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Toyanbee",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059aab",
               "name": "Stanley Anderson",
               "profile_path": "/xZg3C31ElqV54dXC6fc6Akf6K1z.jpg",
               "id": 15253,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Prof. Yuri Pochenko",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059aaf",
               "name": "Theodore Bikel",
               "profile_path": "/haW3rcL6VM0EtwF7kZFSLgWfdys.jpg",
               "id": 6609,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "General Blackburn",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059ab3",
               "name": "Charles Cioffi",
               "profile_path": "/1AfKCCW4AJXOjwKbiccYpYvyatL.jpg",
               "id": 6354,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Blythe",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059ab7",
               "name": "Paul Gleason",
               "profile_path": "/TKFcITuV9vyTSZe55B8klclPor.jpg",
               "id": 7675,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Frank Ridell",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059abb",
               "name": "Terry O'Quinn",
               "profile_path": "/o6zGsvhx8klAofq8No6f3jByR42.jpg",
               "id": 12646,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "The President",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059abf",
               "name": "Sam Waterston",
               "profile_path": "/fKmtS6OdDWPiAdxZflbJGz1eWml.jpg",
               "id": 8975,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Vicepresident Saxon",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059ac3",
               "name": "Ben Gazzara",
               "profile_path": "/dbmfyjTC3PSBvHOjlAMI0I0eZ6T.jpg",
               "id": 856,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Page",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059ac7",
               "name": "Gore Vidal",
               "profile_path": "/vHIIjpltpM9StRYmjjM7liAObuZ.jpg",
               "id": 11626,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Murphy",
               "gender": 2,
               "credit_id": "52fe469a9251416c91059acb",
               "name": "Henry Strozier",
               "profile_path": "/wfnHPBfsQ1C1a1DZCzIEegreIMx.jpg",
               "id": 131120,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Janet",
               "gender": 0,
               "credit_id": "52fe469a9251416c91059acf",
               "name": "Dey Young",
               "profile_path": "/gJuNn1Iw7UKopsDrhbfiDCV9XJS.jpg",
               "id": 39568,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe469a9251416c91059a87",
               "name": "George P. Cosmatos",
               "profile_path": "/6DIKPjnDvr7oHgTPHTXM5te45Qt.jpg",
               "id": 16566,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe469a9251416c91059a8d",
               "name": "Adi Hasak",
               "profile_path": null,
               "id": 95322,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469a9251416c91059a93",
               "name": "Adi Hasak",
               "profile_path": null,
               "id": 95322,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.578077,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38153,
      "vote_count": 18,
      "budget": 45000000,
      "overview": "Bobby Bishop (Sheen) is a special assistant to the President of the United States. Accidentally, he meets his friend professor Pochenko on the street. Pochenko has time to tell Bishop about some conspiracy in the White House but then immediately gets killed by an assassin. Now bad guys are after Bobby as the only man who knows about a plot. Bishop must now not only survive, but to stop the conspirators from achieving their goal. And he doesn't know whom to trust.",
      "similar": [],
      "original_title": "Shadow Conspiracy",
      "runtime": 103,
      "poster_path": "/w1MCRsbCAIdOTobSmoU9KIEvZKF.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinergi Pictures Entertainment",
            "id": 1504,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-31",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George P. Cosmatos"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Adi Hasak",
         "Ric Gibbs"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120107/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0MDUwODYwOV5BMl5BanBnXkFtZTcwNjY5ODUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Charlie Sheen, Donald Sutherland, Linda Hamilton | See full cast and crew »"],
      "reviews": [
         "MST3K fodder. It's so bad it's actually worth seeing just for that reason. There are some hilarious things in it, such as the mysterious device the bad guy is seen working on for the whole movie, that turns out to be this tiny helicopter that flutters around carrying and firing a machine gun without so much as a wobble, but is brought down by a bag of balloons (the kind they release at political conventions). Many other wonderful touches of that sort. Stars Charlie Sheen. There's one scene where he spends five minutes recording a conversation, only to drop the microcassette in the Potomac River by accident. If they'd cast Emilio Estevez in the part that never would've happened.",
         "I just saw this on a local independent station in the New York City area. The cast showed promise but when I saw the director, George Cosmotos, I became suspicious. And sure enough, it was every bit as bad, every bit as pointless and stupid as every George Cosmotos movie I ever saw. He's like a stupid man's Michael Bey--with all the awfulness that accolade promises. There's no point to the conspiracy, no burning issues that urge the conspirators on. We are left to ourselves to connect the dots from one bit of graffiti on various walls in the film to the next. Thus, the current budget crisis, the war in Iraq, Islamic extremism, the fate of social security, 47 million Americans without health care, stagnating wages, and the death of the middle class are all subsumed by the sheer terror of graffiti. A truly, stunningly idiotic film.",
         "One wonders how did this screen play got to be made into a thriller movie. The writers had no clue into the many holes they were creating in a story so predictable as this. At the same time, one has to question the studio as to why this movie was approved. The director George Cosmatos must have a more clout among the Hollywood bigwigs than we can think. I never saw this film when it had a commercial run. It was recently shown on cable, and not having anything better to watch, decided to take a chance. Wow, it's that bad. The film could have used a more likable hero than Bobby Bishop, blandly played by Charlie Sheen, who whispers his lines incomprehensibly. The pairing of Linda Hamilton with Sheen doesn't add anything to the movie. Donald Sutherland must have a lot to explain to his friends in how he accepted to appear in this picture.",
         "What's all the fuzz ? This is just a really good movie. This movie is the real evidence what a good movie should be for all who like political thrillers. Watch and relax. Don't bother the negativity's. For me a movie is good when it keeps me awake. I can assure you that , in this case it isn't any problem. There is no annoying minute in it. The camera movements are superb. The music score very functional. The acting of the protagonists can't be better. I don't understand why so much comments are negative. Perhaps those people don't like to give positive comments ? Anyway. I only want to give my comment and that's what counts for me. Every review is subjective.",
         "When political aide Bobby Bishop is warned by an old friend of a high level Government conspiracy before witnessing his murder he finds his life turned upside down and pursued by a trained killer. Unsure of who to trust Bishop teams up with journalist Amanda Givens in a race to uncover the conspiracy and clear his name, but who can he trust as the stakes are raised. This is ultimately a chase movie, the political conspiracy is nothing more than an assassination plot that is wheeled out at the end. Most of the film is Bishop escaping from the killer and trying to uncover the truth. The conspiracy is pretty thin and you can guess who is involved from the first 20 minutes. The way that Bishop manages to uncover this great conspiracy is far too easy and it makes it all feel too lazy. And the assassination attempt is worth seeing just to laugh at how ridiculous it is - I won't spoilt it for you but trust me, it's totally absurd. That leaves the chase element which is quite dull and gets repetitive. Sheen is not great here - often he can do well in poor films, such as Terminal Velocity, by giving a fun performance. Here he is serious and hunted and must \"do\" serious throughout. In fact the cast is actually really good on paper - lots of famous faces, Linda Hamilton, Sutherland, Turturro, Paul Gleason, Sam Waterston and Gore Vidal. Gore Vidal for God's sake! How all these people manage to not see that this was going to be a turkey is beyond me. Hamilton is unbelievable and seems content with the fact that it's not just a TVM. Sutherland does his usual stuff and is quite good. But should a poor film like this deserve a cast this deep? Overall a poor film that relies on lazy plotting to move it's action along. The conspiracy is easily uncovered and the killer is easily avoided. When even Charlie Sheen describes this as \"a piece of s***\" then you know it's not going to be good. Avoid this - an alternative is Enemy of the State which has similar themes but is much, much better.",
         "Bobby Bishop's role in the White House was never made clear, but when they needed him, they sent a helicopter, and he arrived in a conference room full of suits still wearing his sweaty Princeton sweatshirt. Once he cleaned up and put on his own suit, Bishop went before the press to clear up a public relations problem--after reminding a certain congressman what could happen if said congressman didn't help. A secret meeting with Prof. Pochenko promised to reveal something not quite kosher in the White House. But a man with a gun wanted the information to stay secret. So Bishop spent the rest of the movie on the run and trying to uncover secrets with the help of Washington Herald reporter Amanda Givens. Meanwhile, someone was capable of monitoring pretty much every phone call that took place in the movie. I like Charlie Sheen better as a womanizing jerk, but he was just fine here. Both Sheen characters know how to scheme and lie and otherwise be quite charming to get what they want. Donald Sutherland did a credible job as the White House Chief of Staff who didn't have faith in the President's ability. And Sam Waterston didn't exactly inspire confidence as the President. Linda Hamilton was good as Amanda. This wasn't a great action thriller, but it was good nevertheless. Too violent for my taste (and there was a stern warning on the TV station I watched, even after the movie was cleaned up for TV), but I enjoyed the chases and the occasional comedy.",
         "I don't know what is so bad about this movie.The cast performing well and being Charlie Sheen,Donald Sutherland,Linda Hamilton,Stephen Lang,Nicholas Turturro,Ben Gazzara,and the film having tons of action and a great score by Bruce Broughton and being directed by George P. Cosmatos how in the wide,wide world can you go wrong?Lang was really the ultimate villain!I really loved his role and performed neatly and perfectly!If there is a movie with at least one of these great actors its a must see or at least it is with Me!If you are looking for a good action packed conspiracy movie with the above mention cast then check this one out as I recommend it very much!",
         "They make everything too easy in this film. It sort of reminded me of Indiana Jones where he hides on the outside of a submarine during an ocean crossing. Everybody knows everything that's going on, it's just real easy to get anyplace you want in the White House. I don't even know why I watched half of it. Because I like Charlie Sheen and Donald Sutherland. I expect the usual ability to dodge bullets from every angle, and be able to run faster than a motorcycle (usually it's faster than a car in a garage or a allyway). It was silly, mostly, and I didn't even know then had a ten-story elevator in the White House. Anyway, anything conspiratorial is always interesting.",
         "This is one of those movies whose cast and trailer sound promising, only to drop the ball altogether when you watch it. It is no surprise it bombed miserably on the ticket booth. It was yet another conspiracy movie of they stream that peaked with Enemy of State in the mid-1990s. The Soviets and communists used to offer an easy, credible enemy to write a thriller movie about, so \"average\" plots could fit well on the screen. Without Soviets around, it became tricky to explore other enemies, and many movies were shot around that time with internal conspiracies within the US government. The cast is not bad at all, on the contrary, it is quite respectful. Photography is lackluster, though, and the characters are just not credible. The first 5 minutes are definitively the only salvageable part of the movie. As usual in this type of movie, the real intentions and objectives of characters are not clear from the beginning and there are some twists. Again, unfortunately those twists happen without any explanation or any crescendo that leads to them. It gives the viewer the impression that they needed to turn a \"good guy\" into a \"bad guy\" and just did it in a frustrating way. Were the cast not a A- cast as this is, it would have been a trash movie. The cast, indeed, did a good job on containing damage and ameliorating the failure this movie is.",
         "1st watched 2/25/2002 - 4 out of 10(Dir-George P. Cosmatos): Predictable action thriller where any frequent movie goer could guess what was coming next. Charlie Sheen is the good old boy to the President who just happens to be not liked by the rest of the presidential staff. Of course, he gets involved in a situation where he's framed over and over again and he has one friend in the White House, played by Sutherland, who naturally doesn't stay that way for very long. His other friend is a reporter played by Linda Hamilton(who has very little to do or say in this meaningless role), and of course his biggest and bestest friend is the President himself(Sam Waterston) who stays his pal till the end despite everyone else being killed around him. Brainless yet action-packed meaningless trife despite loads and loads of acting talent(all pretty much wasted.)"
      ],
      "genres": [
         "Action",
         "Thriller"
      ],
      "productionCompanies": [
         "Cinergi Pictures Entertainment",
         "Hollywood Pictures"
      ],
      "summaries": [
         "Bobby Bishop (Sheen) is a special assistant to the President of the United States. Accidentally, he meets his friend professor Pochenko on the street. Pochenko has time to tell Bishop about some conspiracy in the White House but then immediately gets killed by an assassin. Now bad guys are after Bobby as the only man who knows about a plot. Bishop must now not only survive, but to stop the conspirators from achieving their goal. And he doesn't know whom to trust.",
         "Charlie Sheen plays Bobby Bishop, a Presidential advisor and political Spokesperson. When a well-known college professor accosts Bishop on the street, warning of a conspiracy within the Federal government that he's discovered, the professor is assassinated before he can tell the details and dies in Bishop's arms. Thereafter, Bishop becomes a target of those responsible. Pursued by federal and local police, and the conspirators, there's no one left for Bishop to trust, except a local newspaper reporter. Together, the unlikely duo have to figure out what's happening and who's responsible before the conspirators can fully enact their plan."
      ],
      "budget": 45000000
   },
   "movielensId": 1055,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1997-01-31",
      "dvdReleaseDate": null,
      "directors": ["George P. Cosmatos"],
      "runtime": 103,
      "movieId": 1055,
      "title": "Shadow Conspiracy",
      "mpaa": "R",
      "actors": [
         "Charlie Sheen",
         "Donald Sutherland",
         "Linda Hamilton",
         "Stephen Lang",
         "Nicholas Turturro",
         "Stanley Anderson",
         "Theodore Bikel",
         "Charles Cioffi",
         "Paul Gleason",
         "Terry O'Quinn",
         "Sam Waterston",
         "Ben Gazzara",
         "Gore Vidal",
         "Henry Strozier",
         "Dey Young"
      ],
      "imdbMovieId": "0120107",
      "originalTitle": "Shadow Conspiracy",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["SFLhQhNuXnw"],
      "plotSummary": "Bobby Bishop (Sheen) is a special assistant to the President of the United States. Accidentally, he meets his friend professor Pochenko on the street. Pochenko has time to tell Bishop about some conspiracy in the White House but then immediately gets killed by an assassin. Now bad guys are after Bobby as the only man who knows about a plot. Bishop must now not only survive, but to stop the conspirators from achieving their goal. And he doesn't know whom to trust.",
      "tmdbMovieId": 38153,
      "avgRating": 2.77762,
      "releaseYear": "1997",
      "numRatings": 362,
      "posterPath": "/w1MCRsbCAIdOTobSmoU9KIEvZKF.jpg"
   }
}