{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "cuba",
            "id": 701
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "revolution",
            "id": 2020
         },
         {
            "name": "communist",
            "id": 2109
         },
         {
            "name": "havanna",
            "id": 9395
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "interrogation",
            "id": 15271
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "flashback",
            "id": 187844
         }
      ],
      "imdb_id": "tt0115600",
      "video": false,
      "title": "Bitter Sugar",
      "recommendations": [],
      "backdrop_path": "/etR6LDI6xvQFUmBc3MllhGk1xw8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Gustavo",
               "gender": 2,
               "credit_id": "532c947ac3a3685fcb0001c8",
               "name": "René Lavan",
               "profile_path": "/hYQyLcRlzuFK6CR0UVGmtf7a2Fx.jpg",
               "id": 426570,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Yolanda",
               "gender": 0,
               "credit_id": "532c9495c3a3685fd30001fe",
               "name": "Mayte Vilán",
               "profile_path": null,
               "id": 1303109,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Dr tomas valdez",
               "gender": 2,
               "credit_id": "532c94afc3a3685fac0001d8",
               "name": "Miguel Gutierrez",
               "profile_path": null,
               "id": 975012,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Bobby",
               "gender": 0,
               "credit_id": "532c94c9c3a3685fdb0001d4",
               "name": "Larry Villanueva",
               "profile_path": null,
               "id": 1303110,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Prof. Garcia",
               "gender": 2,
               "credit_id": "532c94edc3a3685fdb0001dd",
               "name": "Luís Celeiro",
               "profile_path": null,
               "id": 975013,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Belkis",
               "gender": 0,
               "credit_id": "532c9501c3a3685fdb0001df",
               "name": "Teresa Maria Rojas",
               "profile_path": null,
               "id": 536003,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Claudio",
               "gender": 2,
               "credit_id": "532c951cc3a3685fbb0001d8",
               "name": "Orestes Matacena",
               "profile_path": "/1HhuYbx3DlFpjfwdwTfG1z1aRC4.jpg",
               "id": 53403,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Yiyo",
               "gender": 0,
               "credit_id": "532c9538c3a3685fbb0001dc",
               "name": "Jorge Pupo",
               "profile_path": "/qU8D9uQSVijdH78iJOjuZFNIkcj.jpg",
               "id": 206904,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "532c9564c3a3685fac0001ea",
               "name": "Leon Ichaso",
               "profile_path": "/wd80CkIJ9GKQpVQLvWpOw1Xwucw.jpg",
               "id": 78997,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "532c9599c3a3685fc30001f4",
               "name": "Pelayo García",
               "profile_path": null,
               "id": 1303111,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "532c95aac3a3685fbb0001e3",
               "name": "Leon Ichaso",
               "profile_path": "/wd80CkIJ9GKQpVQLvWpOw1Xwucw.jpg",
               "id": 78997,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a9997c392514128be00ce17",
               "name": "Claudio Chea",
               "profile_path": null,
               "id": 76804,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a999c220e0a26064900e757",
               "name": "Yvette Piñeyro",
               "profile_path": null,
               "id": 1989055,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a999c2c0e0a2605c600d5bd",
               "name": "David Tedeschi",
               "profile_path": null,
               "id": 53395,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a999c33925141284200cbad",
               "name": "Esteban Alvarez",
               "profile_path": null,
               "id": 1989057,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5a999c3c0e0a2605d500e3d7",
               "name": "Liliana Soto",
               "profile_path": null,
               "id": 1989058,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a999c4cc3a3680bb900cba4",
               "name": "Jaime Gonzales",
               "profile_path": null,
               "id": 1989060,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a999c560e0a2605d500e3f6",
               "name": "Victor Dume",
               "profile_path": null,
               "id": 1989041,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.522017,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "DO",
            "name": "Dominican Republic"
         }
      ],
      "id": 43777,
      "vote_count": 3,
      "budget": 0,
      "overview": "A patriot (René Lavan) with a rebellious brother falls in love with a dissident's daughter (Mayte Vilán) in Castro's Cuba.",
      "similar": [
         4771,
         205,
         339692,
         979,
         2503,
         8834,
         74997,
         59967,
         238636,
         9093,
         2149,
         6075,
         109421,
         106646,
         4995,
         101,
         122081,
         281957,
         281,
         186
      ],
      "original_title": "Azúcar amarga",
      "runtime": 102,
      "poster_path": "/r8t3br5OGnvyILuzEWIgvbWwqkc.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Overseas FilmGroup",
            "id": 888,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Azucar Films",
            "id": 40945,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-10",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Cuba today... somewhere between lov and dispair.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Dominican Republic",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Leon Ichaso"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Pelayo García",
         "Leon Ichaso"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0115600/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNDI0ODM5MV5BMl5BanBnXkFtZTcwMTk1MzIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: René Lavan, Mayte Vilán, Miguel Gutiérrez | See full cast and crew »"],
      "reviews": [
         "Leon Ichaso's \"Azucar Amarga\" came and went without much fanfare. This was a film made with little money and without any big distributor to give it more exposure in the American market. The film is critical of the way Cuba, as a society, started the current trend after the loss of patronage of the old Soviet Union in the late eighties. In order to get the badly needed hard currency, Cuba opened its doors to a massive invasion of international tourism, mainly from Europe and South America. With that, the US dollar was legalized. The results can be seen in this film that examines that society. First of all, for those that have expressed their skepticism about the young people injecting themselves with AIDS infected blood, obviously, they haven't read the accounts by different world newspapers, and the New York Times, locally. This is a phenomenon that desperate people will resort to in order to escape the fact they are looked down in their own society for daring to be different. The other aspect one sees in the film is the prostitution being practiced among young women with college education as a way to make ends meet. This kind of sex tourism is being practiced in the island. European men flock to Cuba in search of beautiful women they couldn't otherwise afford in their own countries. Yolanda, the beautiful woman in the film, turns to the Italian Claudio as a way to have things she couldn't have otherwise. Another issue in the film involves the equality the revolution promised. When Gustavo and Yolanda go to the beach bar to get a cold drink, they are turned away. Since everything must be paid in dollars, it's clear the two young lovers don't belong. The hotels are basically for tourists that can pay and not the poor locals. Gustavo's father is another typical example of how some professionals, trying to get access to dollars, go into tourist oriented jobs like playing piano in hotel lounges. Thomas, is a psychiatrist whose job in the local currency equals about a few dollars a month! Leon Ichaso and his collaborators clearly know what they are talking about. The result is a film that is an eye opener about what the reality is in that unfortunate land. The revolution might have started with good intentions, but after more than forty years the only way to make it out of there is either to marry a foreigner, or take to the open seas and hope they make it to either Miami, or Central America, if the sharks don't get to them first. Claudio Chea's black and white cinematography works well in the film. The music score is pleasant. Rene Lavan, Mayte Villain, Miguel Gutierrez and the rest of the cast respond well to the direction Mr. Ichaso gave them. This is a film that tries to make sense of what's going on in that country.",
         "It is amazing how many people are ready to criticize this movie when they have NO direct knowledge of Cuba or its sociopolitical situation. Myself, I have been to Cuba, traveled its highways, walked many of its cities and towns' streets, and had long conversations with the common people as well as government officials. As a result, I can tell everyone reading this that in no uncertain terms that the problems portrayed in Azucar Amarga are very real. The prostitution, tourist aparteid, and growing dispair shown in this film are completely accurate. Cuba is a country coming apart at the seams due to its contridictory existence as a communist state embracing the capitalist tourism industry to survive. Those Cuban with access to tourist dollars are surviving and those without access now beg in the streets. It is heart-wrenching but true. Please avoid snap judgements of this film's accuracy until you too have spent weeks living the Cuban experience. Until then, you know nothing.",
         "I have seen this film on numerous occasions. It brings back memories of the suffering of Cuba under communism, while the world remains silence. The performance of every single actor in my opinion is superior. Many people, probably does not know that Rene Lavan came to USA during the Mariel boat lift, as a child and grew up in Miami. Mr. Ichaso theme is accurate and to the point. I never understood, why it did not stay longer in the movies. The musical score is fabulous. If this was a foreign film, why it was not considered as such. This film should have competed with foreign productions. It was done by foreigners in the land of the freedom",
         "\"Azucar Amarga\" (translated \"Bitter Sugar\") was a totally ignored foreign language film gem that never really found an audience when it was initially released in 1996. It is modern-day Cuba and two young adults (Rene Lavan and Matye Vilan) seem to be finding love with one another. Lavan believes in Castro's Cuba and the Revolution. He also dreams of going to university in Prague to become an aeronautical engineer. He quickly falls in love with Vilan, but her life and opportunities do not seem near as bright. She realizes that Cuba is not the place for her and that the United States (namely Miami) is the key to her overall survival. Lavan just dismisses what he feels are distorted views from Vilan until he becomes an enemy in the Cuban machine due to his younger brother's wild antics (played superbly by scene-stealer Larry Villanueva). Villanueva is disenchanted by the fact that he is unable to play the music he loves in his band and also the fact that he (and no one in the country for that matter) has any say in turbulent Cuba. He takes drastic measures (intentionally infecting himself with AIDS via blood from a syringe) to get his message across to the peoples of his homeland. And of course later on Vilan becomes little more than a glorified prostitute to foreigners at a high-class Cuban resort that does not allow Lavan in. In the end, all will make life-altering decisions to escape their lives in Cuba. \"Bitter Sugar\" is one of those raw foreign films that works because of outstanding writing and solid direction. The performers are all perfect as well. Vilan is illuminating in a film of darkness. Her amazing beauty and versatility makes a lasting impression. She is the most memorable part in a film full of solid memories. Shot entirely in black-and-white, the production creates a tone that makes the audience feel the hopelessness and depression of a country that has somewhat found itself in limbo since Castro's takeover on December 31, 1959. 5 stars out of 5.",
         "It disgusts me to see how many people dare to say that this film does not reflect Cuba's reality. Well, I can tell you from first hand as a 16 year old Cuban who lived JUST about ENOUGH of that regime at the age of 11, and I can tell you this is not HALF of what goes on in Cuba, this movie made me cry my eyes out because it breaks my heart to see what people are willing to do in order to free themselves of what a man's greed put us through and who ever doesn't believe me I challenge them to try to survive a month in Cuba with in the same career you have here, just the amount a Cuban would get paid and then we'll talk. Nurses make: $14.00 a month and neurosurgeons: $27.00 a month, I think I have said enough with that. It's a heart wrecking reality that affects anyone who understands it, but if you are not experienced enough to understand it like I do because although I might be short of age I have lived many things that many people haven't. I beg you to not insult the grief my country and my people suffer, and consider how painful it is to see your country falling apart and tearing down moral values with it. People willing to risk their lives looking for a better horizon like my mother who was lucky and blessed to have made it through, but please don't forget all those grave less souls whose bodies lay at the bottom of the ocean or in a sharks belly, or simply in a Cuban cell... This movie is simply a mirror of a few yet horrifying truth that the Cuban society faces today, and 50 years ago.",
         "Azúcar Armarga is a very interesting film to see now. With the focus on Elian and Cuba, this film portrays the importance of socialism and neo-liberalism economics that currently effects conditions in Cuba. It represents the conflict of the Cuban people between their heritage and a better life.",
         "I saw this awful film three years ago, here, in Madrid. It was at the Universidad Complutense de Madrid, and I was studying journalism then. I know a lot of Cuban people (here in Spain there is a lot of Cuban population), and all of them said that it was \"a very disgusting leaflet perpetrated by the exiled Cuban from Miami\". It was quite surprising, ´cause they all were firmly disparaging about Castro´s regime, but they explained me that the film only tried to impact the theatre, without showing the real problems people have in Cuba. Now, I work as a journalist, and I continue believing the same. In the news agency where I work we have Cuban´s correspondents who tell us about how they live, about how they are... Today, the English band 'Manic Street Preachers' are going to perform in the Karl Marx theatre, in Cuba (uauh!). Rock is not dead, even there. I can´t believe that 36 people really thought this film deserves a 10. Maybe there are a lot of Ichaso´s friends at the web.",
         "Just OK drama here exploring the hardships of living in Cuba. Gustavo tries to eak out a living in Havana while waiting to go abroad with a scholarship, his dad gets a job at a swanky tourist resort because his psychiatrist job doesn't pay enough and his brother seems to do nothing but protest all day long. Meanwhile, Gustavo has his eye on a cute little brunette, but even, yes, she has some secrets. While it's intentions are certainly genuine, I think this was a wee bit too much politics to cram into one movie. Gustavo's problems are interesting, but his brother's are just a bit unnecessary, distracting and, quite frankly, over the top to be in this movie. The cinematography is excellent and whatnot but the story could have used a little simmering down.",
         "A heartwrenching drama, and touching film for a political disaster at the doorstep of the U.S...this film is a must for anyone interested in using the cinema to know today's Cuba through an extremely tragic but realistic story",
         "This is a beautiful and provoking movie. I enjoyed both the passion and the look of the film, which oozes sensuality and a deep feeling for \"country\" and \"justice\". It is the true story of what happens with dictatorial regimes attempt to shape the lives of human beings. Great!!"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Azucar Films",
         "Overseas FilmGroup"
      ],
      "summaries": ["Gustavo is a young Havana Communist who believes in the revolution; he hopes for a scholarship to study aeronautical engineering in Prague. But his faith in the new Cuba is tested: his father, a psychiatrist, can make four times as much playing piano at a hotel for foreigners; his sweetheart, Yolanda, wants a career as a dancer and longs for the riches of Miami; his younger brother Bobby simply wants to play rock music, and as a result is in constant trouble with the authorities. When Bobby takes a shocking step of revolt and Gustavo is refused service at a foreigners-only bar, the contradictions in his resolve to become a \"new man\" push him to the breaking point."],
      "budget": 0
   },
   "movielensId": 1058,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1996-02-10",
      "dvdReleaseDate": "2001-03-13",
      "directors": ["Leon Ichaso"],
      "runtime": 102,
      "movieId": 1058,
      "title": "Bitter Sugar",
      "mpaa": "",
      "actors": [
         "René Lavan",
         "Mayte Vilán",
         "Miguel Gutierrez",
         "Larry Villanueva",
         "Luís Celeiro",
         "Teresa Maria Rojas",
         "Orestes Matacena",
         "Jorge Pupo"
      ],
      "imdbMovieId": "0115600",
      "originalTitle": "Azúcar amarga",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["7gnBatEfLds"],
      "plotSummary": "A patriot (René Lavan) with a rebellious brother falls in love with a dissident's daughter (Mayte Vilán) in Castro's Cuba.",
      "tmdbMovieId": 43777,
      "avgRating": 3.29137,
      "releaseYear": "1996",
      "numRatings": 139,
      "posterPath": "/r8t3br5OGnvyILuzEWIgvbWwqkc.jpg"
   }
}