{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "prophecy",
            "id": 530
         },
         {
            "name": "voodoo",
            "id": 3392
         },
         {
            "name": "single",
            "id": 9457
         },
         {
            "name": "falling in love",
            "id": 13072
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "rich man",
            "id": 196682
         }
      ],
      "imdb_id": "tt0110251",
      "video": false,
      "title": "Nobody Loves Me",
      "recommendations": [
         129378,
         108512,
         198458,
         350873,
         165658,
         200482,
         271795,
         265342,
         129713,
         73138,
         223478,
         335385,
         184244,
         131964,
         60971,
         245382,
         18855,
         98636,
         42720
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fanny Fink",
               "gender": 1,
               "credit_id": "52fe449f9251416c7503b35f",
               "name": "Maria Schrader",
               "profile_path": "/jibfi4qY9DilRl4HHSYTIPmNSDl.jpg",
               "id": 22686,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Orfeo de Altamar",
               "gender": 0,
               "credit_id": "52fe449f9251416c7503b363",
               "name": "Pierre Sanoussi-Bliss",
               "profile_path": "/1qm6gP0jHvgQDDMfnX3lyLMBMpV.jpg",
               "id": 70887,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lothar Sticker",
               "gender": 0,
               "credit_id": "52fe449f9251416c7503b367",
               "name": "Michael von Au",
               "profile_path": "/lhH8aLeV0l1OVT9geaU3Og0NNeP.jpg",
               "id": 70888,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Madeleine",
               "gender": 1,
               "credit_id": "52fe449f9251416c7503b36b",
               "name": "Elisabeth Trissenaar",
               "profile_path": "/1VHfzvBqT80cn4VCXzzbuo4aHkA.jpg",
               "id": 9931,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Anton",
               "gender": 2,
               "credit_id": "582a4c8ec3a368360f03f782",
               "name": "Joachim Król",
               "profile_path": "/swED4GruvGgMdqpbshKKdzLIm1e.jpg",
               "id": 1084,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Lasse Laengsfeld",
               "gender": 2,
               "credit_id": "582a4ca29251417b2c03c8d6",
               "name": "Ingo Naujoks",
               "profile_path": "/5FLegxHQ478vJSx0D8w20D0Cim2.jpg",
               "id": 34297,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Frau Radebrecht",
               "gender": 1,
               "credit_id": "5aae9cbfc3a36846ba029eec",
               "name": "Peggy Parnass",
               "profile_path": null,
               "id": 24110,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Herr Froh",
               "gender": 2,
               "credit_id": "5aae9d680e0a265e1f0146e7",
               "name": "Oliver Nägele",
               "profile_path": null,
               "id": 43452,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe449f9251416c7503b371",
               "name": "Doris Dörrie",
               "profile_path": "/2v1I1odswHZGMJYfSYmehJ3p4Ra.jpg",
               "id": 18969,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe449f9251416c7503b377",
               "name": "Doris Dörrie",
               "profile_path": "/2v1I1odswHZGMJYfSYmehJ3p4Ra.jpg",
               "id": 18969,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe449f9251416c7503b37d",
               "name": "Gerd Huber",
               "profile_path": null,
               "id": 38546,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe449f9251416c7503b383",
               "name": "Renate Seefeldt",
               "profile_path": null,
               "id": 70889,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe449f9251416c7503b389",
               "name": "Niki Reiser",
               "profile_path": null,
               "id": 4524,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe449f9251416c7503b38f",
               "name": "Helge Weindler",
               "profile_path": null,
               "id": 24635,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe449f9251416c7503b395",
               "name": "Inez Regnier",
               "profile_path": null,
               "id": 5641,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.684015,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 11907,
      "vote_count": 5,
      "budget": 0,
      "overview": "No overview found.",
      "similar": [
         2288,
         11631,
         858,
         1547,
         112160,
         141,
         634,
         93456,
         137106,
         437557,
         242224,
         2539,
         806,
         43923,
         5951,
         9685,
         392,
         297762,
         9722,
         27586
      ],
      "original_title": "Keiner liebt mich",
      "runtime": 104,
      "poster_path": "/lnfMQ6K2EgJpn2JZTadnaufiwiR.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [],
      "release_date": "1994-11-07",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Doris Dörrie"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Doris Dörrie",
         "Doris Dörrie"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0110251/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1NzQ2NjQ3Ml5BMl5BanBnXkFtZTcwNzg5NjYxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Maria Schrader, Pierre Sanoussi-Bliss, Michael von Au | See full cast and crew »"],
      "reviews": [
         "Is it a romance? Is it a sci-fi thriller? This movie keeps you guessing all the way through, while we watch a distraught and morbid Fanny Fink bloom via the bumbling shenanigans of the next door palm reader. Will the space ship return? Is there a space ship? Will Fanny Fink find love? This may be all in German, but the subtitles are extremely accurate in meaning and mood, and the movie flows with humor and grace. And after the movie, you can go have a \"Tasse Kaffee\" with that person you've been meaning to get to know. A flat out wonderful movie, that will give you pause to cogitate afterward on life, death and ET.",
         "Pierre Sanousi-Bliss, the actor who plays Orfeo in Keiner Liebt Mich, said of his role that he thought it was symbolic of pre-Wende years, when \"East Germans lived alone in a world they had created.\" Orfeo, enigmatic psychic and gay Black tenant, is five months behind on his rent, and facing eviction. He spends his days telling fortunes on the street, or alternately, asking for money to get \"back to Africa\" and his nights as a drag queen in a bar, where his white businessman boyfriend smugly watches him. It is not difficult to make a convincing case in Sanousi-Bliss' favor, as Orfeo definitely exists in his own world, steadfastly creating a space in which he alone can exist, both by nurturing himself and pushing others away. When his apartment is repossessed and he begins to cohabit with Fanny, his mysteries unearth themselves and the two learn to share and depend on one another, approaching deeper issues of bonding and appreciating the present time. Dorris Dorrie, the writer and director of the film, said that it addresses the way \"Germans seem unable to be happy with what they have.\" When Orfeo compares his state of living to Fanny's it is painfully evident how much she has that he does not, including job, house, and the \"right skin color.\" Within this visual difference of race however, is a more probing study of German sentiment. Indeed, Orfeo is discriminated against in Germany: his fellow tenants don't want him living there, and passersby are more likely to give him money to leave the country than to read their palm. But Dorrie is not simply addressing racial tensions through the character of Orfeo, but as noted above, he is symbolic of a greater struggle in the German people. This struggle is the same one that Fanny faces in a more direct way, to rectify her existence with her imaginary ideal life, and to learn to appreciate what is real and surrounds her. In their final moments together before Orfeo 'dies,' he shares with her the secret of never wearing a watch, because it is always the same time, Now. Interesting then, that several years later Maria Schrader, who plays Fanny, is playing a lesbian woman in the midst of WWII in Aimee & Jaguar. And her final words in that film? That she wants plenty of Now's. Not memories, not futures, but now, and now, and now. It seems there is some form of spiritual integrity emerging through the minds of German directors. For in the final cathartic moments of German films, the feel-good lines are telling us what Eastern religions of meditation and mindfulness have preached for thousands of years. I recently attended a lecture by Professor Muhammad Bamyeh about post-nationalism, which interestingly enough, made some similar conjectures about the emerging solidarities throughout the world. One of the four noted was the spiritual, in which seemingly disparate peoples are actually approaching similar coping mechanisms, reaction and movements to the trends of post-national identities and globalization. It is possible that in this small word, \"now,\" is the seed of cross-cultural understanding. An American may see Fanny Fink's plight and view it only in terms of the desires and unrequited loves, a German may see the representation of her culture. But both can comprehend the immediacy of understanding the moment, regardless if the moment is one person's or one people's. In the ongoing spiritual dialogue of the film we are given two disparate approaches: Fanny practices 'conscious dying' while Orfeo is arguably more busy with consciously living, at least in the time he's got. But when these two meet, their common points are made stronger, drawing from the other and reaffirming the other as well.",
         "I love this movie. I first saw in in a very urban hotspot that offered bagels and coffee at 10 AM to those who love to view fine cinema on Wednesdays. The miserable Fanny, the off the wall Orfeo... the fact that everyone has that crucial bottle of champagne in the refrigerator. A must see only because we are all odd people, whether we feel lucky or not doesn't figure into the equation. Lonely, desperate, or just finding out why we tick and what we tick for. If you can, see it, please!",
         "It's hard to pinpoint exactly what makes this movie stand out, but stand out it does. Maria Schrader is very charming, but of course we already knew that. The same goes for Ingo Naujocks in the part of a budding painter with a death wish. Interesting take, by Pierre Sanoussi-Bliss, on the prototypical part of the sad clown. But most importantly, \"Nobody loves me\" is a very spiritual movie, and Maria Schrader's character Fanny is a very spiritual girl. She is what you might call an equal opportunity believer: ossified Christian saints, morbid new-age workshop gurus, and voodoo priests all get a chance to help her find prince charming. Eventually, the spell of loneliness is lifted by her shaman-in-residence. As soon as his mission is accomplished, he is promptly removed to heaven (Old Testament style) with a gold ingot in hand (New Testament style) to pay his space alien ferrymen (Greek-mythology-meets-Roswell-conspiracy style). The way writer-director Doris Dörrie makes the supernatural seem a natural part of everyday life will stay with you until well after the final curtain.",
         "\"Keiner Liebt Mich\" 1994 Is it fantasy, or romance? It is die deutsche Romantik. A mixture of both fantasy and romance; with humor, pathos, and a flawless cast of misfits. I can't recommend this movie highly enough. Shown as \"Nobody Loves Me\" on cable in my area, it is easily missed. But that would be your loss. Watch Fraeulein Fink's cynicism melt before your eyes, as she melts your heart. If I were only 20 years younger, I'd jump at the chance to offer her \"eine Tasse Kaffee.\"",
         "It's been years since i saw this film, but it left a lasting impression on me. It is so funny and cool. I really hope they release it on DVD with English subtitles because i don't understand German sadly.... I am (almost) willing to learn German just so that i can enjoy this film on DVD. It's that good :) The film is about this girl who is afraid to die, so she's taking a course preparing her for her death, and some strange vodoo man moves into her building. And if i remember correctly she's having an affair with her boss, or at least with someone who works with her, and it's a disaster... Her desperation and loneliness is easy to identify with, as well as her struggle for love and direction in her life."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cobra Film GmbH",
         "Zweites Deutsches Fernsehen (ZDF)"
      ],
      "summaries": ["On the brink of her 30th birthday, Fanny feels the door to marital happiness closing up on her. She is obsessed with death, even visits evening classes on dying and so it seems fitting, that she encounters a skeleton in the malfunctioning elevator of her apartment building. The skeleton is her neighbour Orfeo, a black, gay self-declared psychic, who convinces her that she is about to meet \"him\". But is it really Lothar, the new yuppie apartment manager ...?"],
      "budget": 0
   },
   "movielensId": 106,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1994-11-07",
      "dvdReleaseDate": null,
      "directors": ["Doris Dörrie"],
      "runtime": 104,
      "movieId": 106,
      "title": "Nobody Loves Me",
      "mpaa": "",
      "actors": [
         "Maria Schrader",
         "Pierre Sanoussi-Bliss",
         "Michael von Au",
         "Elisabeth Trissenaar",
         "Joachim Król",
         "Ingo Naujoks"
      ],
      "imdbMovieId": "0110251",
      "originalTitle": "Keiner liebt mich",
      "genres": [
         "Drama",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "No overview found.",
      "tmdbMovieId": 11907,
      "avgRating": 3.40714,
      "releaseYear": "1994",
      "numRatings": 140,
      "posterPath": "/lnfMQ6K2EgJpn2JZTadnaufiwiR.jpg"
   }
}