{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "navajo",
            "id": 9524
         },
         {
            "name": "oncologist",
            "id": 18305
         }
      ],
      "imdb_id": "tt0117781",
      "video": false,
      "title": "The Sunchaser",
      "recommendations": [
         86233,
         268159,
         76171,
         58891,
         40562,
         102947
      ],
      "backdrop_path": "/caUIynt6UdmlChWGow5PSxdh1g1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Dr. Michael Reynolds",
               "gender": 2,
               "credit_id": "52fe469d9251416c9105a11d",
               "name": "Woody Harrelson",
               "profile_path": "/tFAngknlbFZebWVMaFFLFIsFvLE.jpg",
               "id": 57755,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Navajo Woman",
               "gender": 1,
               "credit_id": "52fe469d9251416c9105a121",
               "name": "Talisa Soto",
               "profile_path": "/3VWf8501ubov43OfPJEGMZH8LJ5.jpg",
               "id": 10680,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Dr. Renata Baumbauer",
               "gender": 1,
               "credit_id": "52fe469d9251416c9105a125",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Brandon 'Blue' Monroe",
               "gender": 2,
               "credit_id": "52fe469d9251416c9105a135",
               "name": "Jon Seda",
               "profile_path": "/zYDXb5F4IyzuODWSuGa2mLU8HMz.jpg",
               "id": 288,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Victoria Reynolds",
               "gender": 1,
               "credit_id": "52fe469d9251416c9105a139",
               "name": "Alexandra Tydings",
               "profile_path": null,
               "id": 42703,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe469d9251416c9105a12b",
               "name": "Michael Cimino",
               "profile_path": "/pJZY5Ls2l7NihaMkMjHn4Wt1soE.jpg",
               "id": 12114,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe469d9251416c9105a131",
               "name": "Charles Leavitt",
               "profile_path": null,
               "id": 1997,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "595023ef9251413155053e8a",
               "name": "Wendy M. Craig",
               "profile_path": null,
               "id": 1327146,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.893616,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38191,
      "vote_count": 11,
      "budget": 0,
      "overview": "A young half-Navajo convict (Jon Seda) dying of cancer forces a yuppie (Woody Harrelson) doctor to drive him to a magic healing lake.",
      "similar": [
         275,
         8067,
         2163,
         562,
         4771,
         446791,
         270487,
         8834,
         1571,
         14869,
         193893,
         25376,
         9039,
         2320,
         507,
         1523,
         1538,
         8271,
         9509,
         612
      ],
      "original_title": "The Sunchaser",
      "runtime": 122,
      "poster_path": "/8b7rrZx50M0mhmRFlY2zXl6Kk7N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-05-29",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "It began as a kidnapping. It became a journey of hope.",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Michael Cimino"],
      "runtime": 122,
      "synopsis": null,
      "writers": ["Charles Leavitt"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117781/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NjE2MzU1OF5BMl5BanBnXkFtZTcwNTg3NjUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Woody Harrelson, Jon Seda, Anne Bancroft | See full cast and crew »"],
      "reviews": [
         "I just caught this on my TV. It is a slice of classic road trip perfection. Woody Harrleson and Anne Bancroft add weight as big names and the script and classy camera work does the rest. the script is top shelf realism with grit and it doesn;t shy away from ripping out the brutality and venom of urban society. The young man playing 'blue' the 17 year old put away for killing his father is professional and it's a shame I haven't seen him in further films, maybe someone should offer him some work. The road trip element is great and the freeways and highways are breath taking in beauty and well used for cinematography and as a tool to push along the dialogue throughout. The urban-dust plains contrast is well thought out and the story darts form one tense setting to another. The biggest surprise with this excellent 'gem that got away' is the humour in the most unbelieve-able circumstances. I personally loved the banter between Harrleson's doc and the young guy's tough insider. Casting is credible and the addition of a heart warming, touching and spiritual story line adds visual and though-provoking undertones. The magic side story increases interest and plays with the audiences take on if this roomer is truth or a legend. The under dog 'on-the-run' plot is gripping and apart from the use of the f word and graphic scenes of shootings this could have been a successful family film. I wonder if this movie gained any awards or acclaim as it definitely deserves some (if there is any justice). This is a buried treasure in the dust of forgotten film. Nice work by all creates a thought-provoking drama with some excellent landscapes of rock formations and dusty plains. Catch it if you get a chance.",
         "SunChaser is a kind of movie you like or you dislike. Its about a criminal boy who has nothing to lose because he will die in a few weeks. So he kidnaps his doctor to find an Indian cure. This doctor realizes that his life is at a point that he has everything to lose but his soul. So he has to find a cure as well. I really loved Sunchaser. The atmosphere off the story breaths hope. It is not to late to learn to live untill your last breath. So if you have 2 hours to spare, and you don't want to rent an Adam Sandler or Jerry Bruckheimer video, rent this one. You won't be disappointed.",
         "Have to say I'm a massive fan of the road movie genre, films like Duel, Breakdown, Roadkill and Wolf Creek. This film was really quite different. There's a kind of spiritual theme to it all. Towards the latter stages of the picture, the audience get a sense of the character development and how the Doctor (Woody Harrelson), who incidentally excels in this, builds a sort of relationship with the kidnapper and cancer sufferer (Jon Seda), who really shows what he can do as a teenage convict - pure genius, a magnificent performance. So here goes. While being transferred, Seda manages to escape the police escort and when Harrelson comes over to take a look, Seda takes him hostage and a whole road movie starts. What's great is the fact that the audience often underestimate the character of Blue. He actually shows he's got levels of intelligence when he explains to the Doctor (who thinks he will die) after a rattlesnake bite, that using electricity works wonders, so using the car, Seda puts his magic to the test. We see that as well as the foul-mouthed fool that Reynolds believes he is, Blue is actually a believer and has faith, hence his journey to the sacred lake that supposedly has healing powers \"May beauty be behind me, in front of me, above me, below me and aaalll around me\". Very emotional as it nears its climax and one heck of a movie. Just cannot praise it enough + I would love to see Seda back in action on the big screen, this time in some more prominent pictures.",
         "Brandon 'Blue' Monroe is only 16, but he is in a juvenile facility after being convicted of murder, and because of an incurable tumor, he has only a month or so to live. Figuring he has nothing to lose, he takes Dr. Michael Reynolds hostage and demands that Dr. Reynolds take him to a 'sacred mountain' in Arizona, where a medicine man he knew as a boy might be able to heal him. At first no one knows what has happened to Dr. Reynolds. Later, he is suspected of having helped Blue because he was the one who recommended that Blue be transported to another hospital for treatment, and it was while he was being moved that he escaped. Dr. Reynolds did not go voluntarily, but later hostage and kidnapper begin to form a bond, and to understand each other. For example, Dr. Reynolds believes only in Western medicine, while Blue, who is half Navajo, trusts the ways of the Native American. Renata, who picks them up in the desert, also tries to convince Dr. Reynolds that her people know about healing and that white people just push poison. The title of the movie refers to a healer with special powers. As we hear Blue tell the Sunchaser story, we see (in black and white) scenes of young Michael and his brother Jimmy, who died of cancer when he was young. Jimmy was on life support when he gave Michael a ring, and Michael will not give up the ring to Blue even when being threatened with death. Jon Seda gave a great performance. Blue was unflinching and tough but also tender and even spiritual. This was not exactly Woody Harrelson's best work, but he had his good moments, such as when he first met Blue, and when he told Blue about Jimmy. Harrelson got better in the movie's second half. Talisa Soto did a good job as the tough, independent granddaughter of a Navajo medicine man. There were some funny moments, such as when Dr. Reynolds tried to talk to Navajos he did not believe spoke English (but they did). A woman who might have been Dixie Carter is told at a gas station that she looks just like the woman on 'Designing Women', but she says she does not even watch television. I was hoping for better car chases, but there were some exciting scenes involving Blue and Dr. Reynolds driving too fast (Dr. Reynolds was behind the wheel, but Blue put his foot on the accelerator), whether they were being pursued or not. The Arizona scenery, meanwhile, was magnificent. In between the fast-paced scenes, there were deep discussions about spiritual and medical matters. This movie was no masterpiece, but it was often intelligent. POSSIBLE SPOILERS: I found the ending satisfying, though one might have hoped for a 'miracle cure'. To consider the ending to be happy, it is necessary to think on a spiritual level rather than hoping for life on this Earth to continue. Dr. Reynolds was so uptight that after getting tired and dirty climbing mountains and crossing streams, he was still wearing a tie and he hadn't even loosened it!",
         "i think this film is really emotional to watch because it shows hurt, pain, hope and excitement all in one film. Jon Seda who plays blue gives an excellent performance in this film and i reckon deserves an Oscar!. i believe this film should be an example of the desperation of some people in the world, who go to any lengths to save their lives or what they believe in. Woody Harrelson also gives what i reckon is one of his best ever performances. he seems to be able to use his character as a doctor to his full advantage, and yet show an understanding side to blue. I really would recommend anybody to watch this film, because it is such an eye opener.",
         "Michael Cimino's \"The Sunchaser\", as was shown the other night on a cable station, looked faded. Working on a screen play by Charles Leavitt, Mr. Cimino doesn't add anything new to this genre. If you haven't seen the movie, please stop reading now. The choice of Woody Harrelson to play Dr. Michael Reynolds, seems to have been the wrong decision. Mr. Harrelson, a good actor, otherwise, appears out of his league and sometimes out of character. Dr. Reynolds is, at the beginning of the film, a man more interested in going to higher and better places, rather than treating some of the patients he's assigned to see. He has all the accoutrements that go with his position as a rising oncologist, including his brand new red Porsche, the status symbol of Angelinos. When he is made to go along with the sick prisoner Blue, he gets a taste of what the ghetto is like. He has no choice but to go along for a ride with this disturbed young man. Blue is a Navajo by birth, but he's been away from his roots in a while. Along the way to the Navajo sacred mountain, this odd couple experience quite a lot. Dr. Reynolds doesn't warm up to Blue at all. When a kind soul, Dr. Baumbauer, gives the pair a lift, Reynolds voices his prejudices loudly. After all, he's a man that has been trained professionally, therefore, he doesn't have time for these New Age charlatans who think the same way as Blue. The ending is predictable. Woody Harrelson is miscast in the movie. Jon Seda, as the fugitive Blue, gives an uneven performance. The only one that fares better is Anne Bancroft, in her small role of a wise doctor Reynolds and Blue meet on the road. Just out of curiosity, I watched the credits to see if the production company would have clarified that \"No Porsche was damaged during the filming process\".....",
         "I loved this film. It is a profoundly deep and moving. This is a film that I don't get tired of watching. It touches the cores of your heart. The story involved a dying man (played by Seda) who kidnaps a self absorbed doctor (played by Harrelson)and along the way they both go through this journey of self discovery. I get emotional toward the end of this film and I think that it is beautifully acted and not well filmed, but sometimes you have to look pass that and see the overall message of the film, which the director was able to put forth. I highly recommend this film. I think this is one Harrelson best film that I have seen him in and Jon Seda shows that he has potential to be a great actor due to his fine acting in this film.",
         "I read some of the other reviews and I guess this movie has an emotional element to it, but I'm not wired that way. The thing that ruined the movie for me was the logic. In it, the main characters make one illogical choice after enough. One must suspend logic and believe that these characters would actually make the choices that they made and that was the painful part for me that ruined it. That and the tiring tiring stereotypes portrayed about minorities, urban life, small desert towns, (non-)religious folk, etc., etc. In the end it's a 2-hour movie, and the conclusion is so predictable and disappointing as to serve no justification for having labored through its poor plot/writing. **",
         "A highly underrated movie. I absolutely loved it. I would have given it a ten, but I didn't care for the cringe-worthy, moaning song at the end, although I do understand the intent. Jon Seda is the lost boy, a rough survivor. life hasn't been kind to him. Woody Harrelson, is the all knowing, polished, college educated doctor, who has his own secret. Two different worlds come together. Each learn something from each other, and come to respect one another. I also enjoyed the reference to Tupac's Keep Ya Head Up. The movie contains a message for today's youth, and for the adults, for people of different races, from different socio-economic backgrounds, and different points-of-view. After the good doctor spent a whole day with this kid from hell, the doctor came to face some of his own devils. It's personal and soul searching depth may make some uncomfortable. Not everyone wants to look own into the depths of their own soul.",
         "For the first time I saw this movie 15 years ago. Over the years, I have looked through a lot of films, from cult to mediocre, from comedic to dramatic. But this film is still one of my dearly loved, and as far as I know, not just me. If this film is not a bomb, then at least the grenade)) Producer's work - it's just brilliant, the envy of many others. Casting - could not be better. The film draws from the first minute and did not let go until the very end of the two hours fly by. And the innuendo in the end of the film leaves food for thought. Seda played the role perfectly, personally I just admired his game. Harrelson - as always inimitable! \"Sunchaser\" - this film is not for everyone, because not everyone will understand its depth and drama. But, in my opinion, the film turned out!"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Appledown Films Inc.",
         "Joseph S. Vecchio Entertainment",
         "Monarchy Enterprises B.V."
      ],
      "summaries": ["Michael Reynolds is a rich oncologist who has a $175,000 sports car, a multi-million dollar home, and a new boost in his career. Brandon 'Blue' Monroe is a dying patient who kidnaps Reynolds. They are going to a legendary Navajo healing place while manhunt closes in. Soon the men get closer in understanding and to the place that may save them both."],
      "budget": 0
   },
   "movielensId": 1062,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-29",
      "dvdReleaseDate": null,
      "directors": ["Michael Cimino"],
      "runtime": 122,
      "movieId": 1062,
      "title": "The Sunchaser",
      "mpaa": "",
      "actors": [
         "Woody Harrelson",
         "Talisa Soto",
         "Anne Bancroft",
         "Jon Seda",
         "Alexandra Tydings"
      ],
      "imdbMovieId": "0117781",
      "originalTitle": "The Sunchaser",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["4Wf_o24AdOc"],
      "plotSummary": "A young half-Navajo convict (Jon Seda) dying of cancer forces a yuppie (Woody Harrelson) doctor to drive him to a magic healing lake.",
      "tmdbMovieId": 38191,
      "avgRating": 3.04321,
      "releaseYear": "1996",
      "numRatings": 81,
      "posterPath": "/8b7rrZx50M0mhmRFlY2zXl6Kk7N.jpg"
   }
}