{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "prostitution",
            "id": 13059
         }
      ],
      "imdb_id": "tt0116714",
      "video": false,
      "title": "Johns",
      "recommendations": [
         41189,
         44783,
         38981,
         53151,
         50071,
         13432,
         173911,
         54752,
         82624,
         7015,
         19958,
         30779,
         28320,
         72996,
         88448,
         91217,
         192142,
         52117,
         32855,
         35711
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe4915c3a36847f81883d1",
               "name": "David Arquette",
               "profile_path": "/p5l4pnL9xhbHiKSipcdsCekoD52.jpg",
               "id": 15234,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Donner",
               "gender": 2,
               "credit_id": "52fe4915c3a36847f81883d5",
               "name": "Lukas Haas",
               "profile_path": "/1n1CTF6fi52BF407iQU6aMMKWFU.jpg",
               "id": 526,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Danny Cohen",
               "gender": 2,
               "credit_id": "58c2fdd5c3a36850e1000db9",
               "name": "John C. McGinley",
               "profile_path": "/6AJL0ylRtJ9vcR57yEenhWHXHFt.jpg",
               "id": 11885,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Homeless John",
               "gender": 2,
               "credit_id": "58c2fdfb92514129e8000ef8",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mikey",
               "gender": 2,
               "credit_id": "58c2fe0c92514129f5000fcf",
               "name": "Wilson Cruz",
               "profile_path": "/3LeVIilQnq53TYpxhBqAEpUJfuw.jpg",
               "id": 54453,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Santa Claus",
               "gender": 2,
               "credit_id": "58c2fe2292514129f5001007",
               "name": "Tony Epper",
               "profile_path": null,
               "id": 161285,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "5a80732d925141410d01e08b",
               "name": "Richard T. Jones",
               "profile_path": "/ccELAB9yHvG4OxG8dURdUXznwJ8.jpg",
               "id": 55755,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Nikki",
               "gender": 1,
               "credit_id": "5a807374925141410401e9ff",
               "name": "Alanna Ubach",
               "profile_path": "/g0GOzbSDAzhMxoCBNofiMxHIJJj.jpg",
               "id": 10402,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Junkie",
               "gender": 1,
               "credit_id": "5a80737fc3a36818ac01dba1",
               "name": "N'Bushe Wright",
               "profile_path": "/3OpD0lvYcqEAwFL3JKEpal7JemR.jpg",
               "id": 10824,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "5a8073a1925141410401ea21",
               "name": "Elliott Gould",
               "profile_path": "/bo5jSwWyFRsKVAkELT9n7AKQqMk.jpg",
               "id": 827,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Jimmy the Warlock",
               "gender": 2,
               "credit_id": "5a8073ba925141410401ea36",
               "name": "Terrence Howard",
               "profile_path": "/MZeLxOH0PgL7xcvt865WVBvQDw.jpg",
               "id": 18288,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "John Cardoza",
               "gender": 2,
               "credit_id": "5a8073d30e0a262ab2021dc5",
               "name": "Arliss Howard",
               "profile_path": "/zDBEVA7Skrje3A8bmR2VOJRwkZc.jpg",
               "id": 3229,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Mix",
               "gender": 2,
               "credit_id": "5a8073e5925141410d01e136",
               "name": "Nicky Katt",
               "profile_path": "/dbAeUQXzyf2HDFYtifWkHfE3SNW.jpg",
               "id": 18070,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Prostitute",
               "gender": 1,
               "credit_id": "5a8073fec3a36818a70215a9",
               "name": "Nina Siemaszko",
               "profile_path": "/htNzOMMh4Hys3EhTDWdJOlbtKpL.jpg",
               "id": 42133,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4915c3a36847f81883c7",
               "name": "Scott Silver",
               "profile_path": "/vRblvymfxaMd7Lsqs4ypVAfnJK.jpg",
               "id": 324,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4915c3a36847f81883cd",
               "name": "Scott Silver",
               "profile_path": "/vRblvymfxaMd7Lsqs4ypVAfnJK.jpg",
               "id": 324,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a807429c3a3681893022647",
               "name": "Anthony B. Richmond",
               "profile_path": null,
               "id": 14139,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.798195,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 56830,
      "vote_count": 7,
      "budget": 0,
      "overview": "It's the day before Christmas, the day before John's 21st birthday. He's a prostitute on Santa Monica Blvd in L.A., and he wants to spend that night and the next day at the posh Park Plaza Hotel. He's ripped off a local drug dealer to pay the bill, but as he's sleeping that morning, someone steals his shoes right off his feet, with the money in them. Meanwhile, Donner, a lad new to the streets, wants John to leave the city with him for Camelot, a theme park in Branson, MO, where they'll work as lifeguards. John spends the day trying to hustle the money for the hotel, avoid Jimmy the Warlock, keep his girl friend placated, and figure out how to deal with Donner's friendship.",
      "similar": [
         507,
         22323,
         979,
         281,
         12994,
         11826,
         627,
         949,
         4771,
         339692,
         9540,
         4997,
         39927,
         2142,
         12093,
         1266,
         3134,
         49950,
         948,
         8810
      ],
      "original_title": "Johns",
      "runtime": 96,
      "poster_path": "/dIiAsjLNB0ud1MiwXxv1GEuuuXS.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "First Look Pictures",
         "id": 13534,
         "origin_country": ""
      }],
      "release_date": "1996-12-10",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "This ain't no 90210",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Silver"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Scott Silver"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116714/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxNTU3NTc4MV5BMl5BanBnXkFtZTcwMjgyNDAzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: David Arquette, Lukas Haas, Tony Epper | See full cast and crew »"],
      "reviews": [
         "It's Christmas Eve and Arquette a Male Prostitute has a plan in mind for Christmas day; his plan involves luxury and fantasy. This means he has to catch a few extra punters and be a little more daring than usual to achieve his goal - which is quite simple - unless you have the life of Arquette. Most of the film is set on one boulevard befamed for 'pick ups'. It may help a little if you are gay or know of the gay culture. But having said that whatever your persuasion you can't help but like Arquette as he trys to get enough dollars together for his plan. Throughout the film we meet his clients, his friends, his enemies, and we are a voyeur to the problems he faces in his line of work. He's a likeable chap, and as someone has already mentioned it's almost played out as a Shakespearian Tragedy - especially as we frequently return to the 'set' and more or less get to know our way around. At one point he gets it together, but tragedy strikes, in a weird kind of way, at some points of the film you really feel like sending him the extra dollars he needs, as his dream is so innocent and quite pure. In parts, the film is quite deep as it explores a couple of the characters he interacts with, and although he's naturally streetwise, there's a vulnerablility that keeps you on his side, and you really do feel like fighting for him, but the character John (Arquette)is strangely proud, and his pride is built from street level up, with a coating of fantasy and imagination. There's also a guy looking for him to settle a debt, which turns a bit sour - with the help of a well-meaning friend. The day is sooooo long in the film, yet John's shortage of the stuff keeps up the tension and sympathy, especially as he allows himself to take bigger risks, and the viewer knows it, as the camera indicates visual clues as to his possible next chapter in the day. Although fairly old (in terms of rent boy/prostitute, he carries it off very well, as he goes through the usual motions of the belly rub and boyish stance. There's lots of comedy in the film, but you don't really want to add to his troubles, making the direction manipulative and 'classic' in terms of human tragedy. Meet John and his friends and foes alike, and you'll find that empathy is drawn from you as you watch this unique, almost surreal film unfold. If you find yourself alone over Christmas, it may be worth a look at somebody who's got it a bit worse than you, with just a few more complications.",
         "This is a metaphorical story about people's dreams as they search for themselves and some meaning to life. There are interesting symbols throughout the movie: Camelot as a mythical, far-away perfect place; Christmas as a time of birth and rebirth; the painted mural of the 10 Commandments as the \"writing on the wall\"; looking for a room at the inn (the hotel); the wounds and the tattoos of a tear and a heart; and the gaining and loss of time (watches). The performances are convincing and powerful. The theme seems to be in the song that Homeless John sings towards the end about how the \"world treats you mean\" but there is hope in rebirth. The movie is an odd use of all the symbolism to give a sad picture of street hustlers who, like all people, seem lonely and in search of something more meaningful in life.",
         "Chances are if you're reading this,that you've seen the film.Therefore you will know that it is not a movie about toilets.It's not a film that you stumble across,its one that gets recommended to you by a mate. Obviously a mate with good taste.It has a number of things to recommend it,including an early performance from Arquette,which is very good,a directorial debut from the soon-to-be-massive Silver,and Elliot Gould being gay.If you like that kind of thing.Johns is not a pleasant film,it does not re-affirm your faith,but then why should a film about homeless L.A male prostitutes be life affirming ? At times it shocks(Arquette with a condom round his mouth,ready to earn his breakfast)and is commonly unpleasant,but it still finds room for a sensitive humour,particuarly the deranged ramblings of fellow hooker Eli.John has a dream,to spend the first night of his 21st life in a local hotel,and while this dream may seem within easy grasp for the rest of us,for a homeless gigolo,it means putting himself through potentially dangerous situations with his clientele. Watch Johns if you can find a copy,its the one that got away.",
         "I just saw the movie as part of a gay and lesbian film festival and I found it extremely intense, very authentic and genuine. There is great cinematography, great acting and a story that lets you see just how hard hustling in Los Angeles is. You get a chance to empathize with the main characters and see things from their point of view. It's not a funny movie (although it has funny moments) but rather one to watch and reflect about. David Arquette and Lukas Haas deserve great praise for doing this movie, as does the director. It's not a feel-good movie, but it's definitely worth seeing.",
         "The film is rough and gritty, yes, but also a little corny and cliched. The best reason to see it is for the acting. Lukas Haas is great, as usual. But David Arquette is downright brilliant. When I first saw this film, I felt like I was watching a young Marlon Brando. I was convinced Arquette was going to be the Next Big Thing in Hollywood. Then he yucked it up in the wonderful \"Scream\" films, making a bigger splash as a comic charicature. And then came his 1-800 AT&T commercials, and all his talk show appearances in oversized zoot suits, and his marriage to Courtney \"Friends\" Cox. The poor guy may be Hollywood's biggest untapped talent! Check out \"Johns\" if you want to see a side of David Arquette you've never seen. (I just hope his performance isn't ruined by your memories of those phone commercials.)",
         "Johns quite accurately portrays the nightmarish life of \"kids\" on the streets of Hollywood. There are indeed bright spots in life for these social outcasts, rare people like the angelic \"Homeless John\" or Richard Kind's \"Paul,\" the gentlemanly concierge, but the recurring theme of mistrust is \"on the money,\" as we say. Having lived and/or worked in the Hollywood area for decades, everyone here can also solemnly assure people who do not live in Southern California, that, yes, it CAN be blindingly bright, hot and sunny in December in Hollywood, and yes, that bright glare off of the white stucco walls REALLY occurs, and yes, it IS depressing! Our reviewer has compared the Los Angeles of johns to Oran in The Plague by Camus; visually, the comparison is apt. Morally and spiritually it is perhaps even more apt.",
         "There is much to recommend in this small, well made and excellently acted movie. David Arquette gives a wonderfully charismatic performance though at times almost parodying a young Robert De Niro. The film resembles \"Midnight Cowboy\" in its portrayal of friendship and support in the harsh world of street hustling and the dream of escaping to a better place. Director Scott Silver elicits fine performance from all and manages to convey the atmosphere of Los Angeles street life. There are lapses here and there, but the overall effect makes this a film well worth watching.",
         "I like to think of it as \"the Goofy effect.\" It is when all the characters in a movie seem to talk and sound and act alike, like in the old Disney cartoons where Goofy played every single character. Even when it is done well, like in a Robert Altman movie where everyone usually natters in a similar semi-low voiced chatter about trivial things or in a Woody Allen movie where everyone tends to expound with the sophisticated cynical wit of a \"New Yorker\" arts review, it can get to be just a little bit annoying. It's not so bad in those films, because it usually underscores the comic intent of the dialogue. However, too often it is used to reinforce a cultural stereotype (southern bigots, poor blacks, middle-class Jews, etc.) even when such a stereotype isn't necessarily real. In JOHNS, a film about street level male prostitutes, everyone speaks with a \"Hey man, how's it hangin', man? What the f---'s happen, you m.....f....., man?\" And so on. Well, some of them add a little bit of swishy oh-so homosexual lisp to the pronunciation, but basically it is as though all the hustlers took the same Berlitz course on how to sound like you are savvy to the sounds of the lean streets of Los Angeles. It would seem to me that the story would be better told by stressing just how different these guys are. Instead, the point of the film seems to be that they are awfully alike. Even the man character played by David Arquette is named John and he keeps running into other characters named John, some of whom are his johns. Other than to deny the characters any sort of complexity, it is difficult to see just what the point of JOHNS is. I can't say the film has any great sympathy for the characters, even as it rather smugly traps them all in an atmosphere of impending doom. Resolutely downbeat, JOHNS not-so-subtly makes it clear that someone is going to die by the end of the film and the only suspense springs from trying to guess who. Is it Arquette as the optimistically foolish John or Lukas Haas as his foolishly optimistic friend, Donner? Let's just say that as soon as one of the characters starts talking about scoring one last john before he retires from prostitution forever, he might as well just crawl into a body bag because his fate is sealed. Arquette's John spends Christmas Eve trying to hustle up or steal enough money to pay back $300 he has stolen from a drug dealer and to get quite a bit more so that he can spend Christmas Day, his birthday, in a luxury hotel. The Christmas angle and the suggestion that John is some sort of a Jesus figure hangs uneasily over the story like the pretentious subtext of a bad play. Indeed, the film's theatrical nature never quite jibes with its desire to seem street wise, leaving it all seemingly artificial and empty. And despite the milieu, the film isn't explicit on any level, having no nudity, only implied sex and even the violence is off screen. It is a remarkably timid film about a remarkably lurid subject. As dull wittedly predictable as the film is, it is worth seeing just for the actors. Elliott Gould, John C. McGinley and Arliss Howard have their moments as various customers who pass through, and Haas' geeky charm serves him well as a teen whose been kicked out by his father for announcing that he is gay. But it is Arquette's film and, though he gives a very good performance, he isn't helped much by a shallow script by writer/director Scott Silver. Though he is the central character, we learn very little about John, other than that he is homeless, he identifies himself as being straight, he's not too bright and, well, that's about it. John is less a reality than a generic example. It says something when a filmmaker resorts to generic labels to identify his film and his characters. This John doesn't get a lot of respect, least of all from the film itself.",
         "I'm actually a big fan of this movie and consider it to be quite underrated. By now anyone who bothers to read these reviews knows the plot, so I won't waste your time with yet another synopsis. Instead, I'll just explain certain aspects of this film which make it in my book a genuinely solid and touching picture. First off, the emotional rapport between David Arquette and Lukas Haas is just lovely: loose, natural and totally unaffected, the chemistry between these two is very credible and engaging. Moreover, the supporting cast all turn in bang-up performances. Elliott Gould was extraordinary in his brief, yet startling appearance as an in-the-closet married gay man with a wife and kids. You don't know whether to laugh or cry at the sight of this pathetic guy; it's this peculiar complexity Gould projects which makes his cameo so striking and unforgettable. Richard Kind as a compassionate hotel clerk brings a truly sweet and appealing warmth to his part. But the real revelation here is Keith David as a kindly and protective \"angelic\" homeless man. Usually cast in intimidating tough guy parts, David gets a rare chance to show a more soft and sensitive side that I especially enjoyed seeing. And to hear David sing a forlorn gospel song in that magnificent liquid bass during the ending credits constitutes as a substantial extra treat! Arliss Howard turns in a thoroughly creepy and compelling characterization as a man whose severely repressed homosexuality manifests itself as pure psychotic rage. The other thing in the movie that warrants additional kudos is the stupendous blues score by noted blues musician Charles Brown; it perfectly captures the downbeat tone of film and exudes a sense of bleakness and despair that's in itself very powerful. The gritty, no-frills, washed-out cinematography likewise accurately pegs a deep-seated feeling of grungy sordidness and hopelessness as well, although those constant fades to black struck me as a rather annoying stylistic flourish that's jarringly at odds with the basic gritty realism. The somewhat telegraphed ending may be predictable, but it's still very devastating. Furthermore, I give the film bonus points for having the strength of its own bitter convictions; there's no fake \"everything works out\" Hollywood happy ending. And the occasional moments of darkly funny humor are neatly incorporated into the overall film; they add some much-needed levity and stop the movie from becoming too unbearably depressing. All in all, \"Johns\" sizes up as a sound indie picture that warrants a second look and reappraisal.",
         "JOHNS offers little in the way of comfort for the viewer. Unlike other films that skirt around the subject of child and male prostitution(WHERE THE DAY TAKES YOU)or couch the subject in arty symbolism and metaphor(MY OWN PRIVATE IDAHO)JOHNS gives an unflinching portrait of these boys and the clients who exploit them. David Arquette is John, a seasoned street hustler who reluctantly takes under his wing Donner(Lukas Haas)a runaway and novice prostitute. Despite his flaky demeanor, Arquette turns in a studied performance, and Haas does what he seems to do best, stand around looking sad and introspective. It's a world where violence can and does erupt at any moment and the hustlers count a successful day as one in which they've managed to live through. Moving without any sentimentality. Try it."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Bandeira Entertainment"],
      "summaries": ["It's the day before Christmas, the day before John's 21st birthday. He's a prostitute on Santa Monica Blvd in L.A., and he wants to spend that night and the next day at the posh Park Plaza Hotel. He's ripped off a local drug dealer to pay the bill, but as he's sleeping that morning, someone steals his shoes right off his feet, with the money in them. Meanwhile, Donner, a lad new to the streets, wants John to leave the city with him for Camelot, a theme park in Branson, MO, where they'll work as lifeguards. John spends the day trying to hustle the money for the hotel, avoid Jimmy the Warlock, keep his girl friend placated, and figure out how to deal with Donner's friendship."],
      "budget": 0
   },
   "movielensId": 1063,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-12-10",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Scott Silver"],
      "runtime": 96,
      "movieId": 1063,
      "title": "Johns",
      "mpaa": null,
      "actors": [
         "David Arquette",
         "Lukas Haas",
         "John C. McGinley",
         "Keith David",
         "Wilson Cruz",
         "Tony Epper",
         "Richard T. Jones",
         "Alanna Ubach",
         "N'Bushe Wright",
         "Elliott Gould",
         "Terrence Howard",
         "Arliss Howard",
         "Nicky Katt",
         "Nina Siemaszko"
      ],
      "imdbMovieId": "0116714",
      "originalTitle": "Johns",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "It's the day before Christmas, the day before John's 21st birthday. He's a prostitute on Santa Monica Blvd in L.A., and he wants to spend that night and the next day at the posh Park Plaza Hotel. He's ripped off a local drug dealer to pay the bill, but as he's sleeping that morning, someone steals his shoes right off his feet, with the money in them. Meanwhile, Donner, a lad new to the streets, wants John to leave the city with him for Camelot, a theme park in Branson, MO, where they'll work as lifeguards. John spends the day trying to hustle the money for the hotel, avoid Jimmy the Warlock, keep his girl friend placated, and figure out how to deal with Donner's friendship.",
      "tmdbMovieId": 56830,
      "avgRating": 3.30838,
      "releaseYear": "1996",
      "numRatings": 167,
      "posterPath": "/dIiAsjLNB0ud1MiwXxv1GEuuuXS.jpg"
   }
}