{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "secretary",
            "id": 11677
         },
         {
            "name": "class differences",
            "id": 14514
         },
         {
            "name": "aristocrat",
            "id": 155697
         }
      ],
      "imdb_id": "tt0028757",
      "video": false,
      "title": "A Damsel in Distress",
      "recommendations": [
         78078,
         39318,
         49863,
         28292,
         4269,
         18651
      ],
      "backdrop_path": "/9HmYxcVq6gKzjujeuTs06NjbKol.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jerry Halliday",
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcaf7",
               "name": "Fred Astaire",
               "profile_path": "/tFdgseH9plbGN8XBhBcG9lscfaY.jpg",
               "id": 30181,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcafb",
               "name": "George Burns",
               "profile_path": "/4Uw1GXgr21eSMWDZiAQkIXg5axL.jpg",
               "id": 80625,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gracie",
               "gender": 0,
               "credit_id": "52fe473fc3a368484e0bcaff",
               "name": "Gracie Allen",
               "profile_path": "/obRJIzDzeBEu8izy9E2mpVNO4Mw.jpg",
               "id": 109896,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lady Alyce Marshmorton",
               "gender": 1,
               "credit_id": "52fe473fc3a368484e0bcb03",
               "name": "Joan Fontaine",
               "profile_path": "/8C0nIt3pQCMj999lFLhsSnyE2ZY.jpg",
               "id": 3360,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Keggs",
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcb07",
               "name": "Reginald Gardiner",
               "profile_path": "/97xWD5zL5UP7sTy3yAHMKgCxOiC.jpg",
               "id": 14029,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Reggie",
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcb0b",
               "name": "Ray Noble",
               "profile_path": null,
               "id": 544970,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Lady Caroline",
               "gender": 1,
               "credit_id": "52fe473fc3a368484e0bcb0f",
               "name": "Constance Collier",
               "profile_path": "/zgRvb7EpW4K6lsDEkxcRBDEQUkS.jpg",
               "id": 17660,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lord John Marshmorton",
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcb13",
               "name": "Montagu Love",
               "profile_path": "/j4lOtL9TTR60lblXCK6McgdIcXe.jpg",
               "id": 92907,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Albert",
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcb17",
               "name": "Harry Watson",
               "profile_path": null,
               "id": 30221,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Miss Ruggles",
               "gender": 0,
               "credit_id": "52fe473fc3a368484e0bcb1b",
               "name": "Jan Duggan",
               "profile_path": "/ApgsfI5OCOL8LGMSrbYabs7n2L5.jpg",
               "id": 544971,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcb21",
               "name": "George Stevens",
               "profile_path": "/vKuUtXcGyuiwpznUMc1hwLMsKoq.jpg",
               "id": 18738,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe473fc3a368484e0bcb27",
               "name": "P.G. Wodehouse",
               "profile_path": null,
               "id": 1279068,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe473fc3a368484e0bcb2d",
               "name": "Ernest Pagano",
               "profile_path": null,
               "id": 108795,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe473fc3a368484e0bcb33",
               "name": "S.K. Lauren",
               "profile_path": null,
               "id": 117851,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "556591b1c3a3687ac5001705",
               "name": "P.G. Wodehouse",
               "profile_path": null,
               "id": 1279068,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "573f68fcc3a368277b000700",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "58d3a539c3a36812890126af",
               "name": "Pandro S. Berman",
               "profile_path": "/pOB0fbkzzKPUs5w9wd7aeFjjpuI.jpg",
               "id": 30174,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58d62ab39251411faa03b1d9",
               "name": "Henry Berman",
               "profile_path": null,
               "id": 1174596,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58d62b2d92514103d2025a10",
               "name": "Van Nest Polglase",
               "profile_path": "/11wRR3ofmyXu33rjhlrwg74zpnJ.jpg",
               "id": 11036,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "58d62b6ac3a368128903b992",
               "name": "Vernon L. Walker",
               "profile_path": null,
               "id": 3252,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.877845,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 66473,
      "vote_count": 5,
      "budget": 0,
      "overview": "Lady Alyce Marshmorton must marry soon, and the staff of Tottney Castle have laid bets on who she'll choose, with young Albert wagering on \"Mr. X.\" After Alyce goes to London to meet a beau (bumping into dancer Jerry Halliday, instead), she is restricted to the castle to curb her scandalous behavior. Albert then summons Jerry to Alyce's aid in order to \"protect his investment.\"",
      "similar": [
         11113,
         11224,
         872,
         224141,
         14128,
         16119,
         824,
         3933,
         11631,
         134,
         10882,
         18947,
         46195,
         77338,
         194662,
         196867,
         15969,
         11970,
         10020,
         88
      ],
      "original_title": "A Damsel in Distress",
      "runtime": 101,
      "poster_path": "/woERgwsyAb318gMMnvaoUKs3L3I.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1937-11-19",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["George Stevens"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "P.G. Wodehouse",
         "Ernest Pagano"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028757/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NjIxMjg0N15BMl5BanBnXkFtZTgwMTEyMDkwMzE@._V1._CR26,52,296,441_SX214_AL_.jpg",
      "actors": ["Stars: Fred Astaire, George Burns, Gracie Allen | See full cast and crew »"],
      "reviews": [
         "Rarely does a novelist have the opportunity to participate in the adaptation of one of his own stories for the screen, but such was the case with Pelham Grenville Wodehouse (1881-1975). The 1937 movie, A DAMSEL IN DISTRESS, was the first and only time he assisted in transposing his prose to film. A Damsel in Distress had initially been filmed back in 1919, at the time of its original publication, in a version faithful to the novel. In 1928 Wodehouse had collaborated on a stage version with Ian Hay, which had condensed and rearranged some scenes for the limitations of the proscenium, while retaining the highlights of the book. On the advice of George Gershwin, RKO producer Pandro Berman bought the screen rights to A Damsel in Distress in November 1936. Gershwin had collaborated in the theater with Wodehouse before he wrote the novel, and Gershwin believed that the character of the music writer named George Bevan in A Damsel in Distress was based on him. Gershwin's nine songs for the film were composed before the script was written, and he actually died during production of the movie. A DAMSEL IN DISTRESS had an unusual follow-up: in 1998, the score of the film, along with several songs Gershwin had written but which were not used in the picture, were included in a new stage musical of the Wodehouse novel, this time entitled A Foggy Day for one of the songs. RKO was interested in filming A Damsel in Distress because the novel's romantic lead was a musical comedy composer, allowing a singer and dancer to be cast in the role--and RKO needed a Fred Astaire vehicle. Scripting was already well underway when Wodehouse was asked to assist in May 1937, and shooting took place from July 22 to October 16, while work on the script continued until September 25 (Wodehouse left on August 14). The recurring gag of everyone infectiously saying \"Right-ho\" to one another seems a nod to Wodehouse's presence on the movie. Similarly, the song \"Stiff Upper Lip\" is the most colloquial in its wording, and reminiscent of the Wodehouse prose in its lyrics. Like the Ian Hay stage version, A DAMSEL IN DISTRESS retained the basic plot outline of the novel, but unlike the play, the movie also deleted and merged a number of the characters, and added others, becoming a second, separate Wodehouse variation on the novel. Ideas from the novel are used, but combined with fresh material, as the movie increasingly strays from the source. To add box-office insurance, George Burns and Gracie Allen were brought in from Paramount to partner Astaire in gags and dance routines. Burns and Allen play Jerry's press agent and his secretary, using their own names as they did in most of their movies of this time. While their participation was definitely outside the original, and the humor different from the Wodehouse style, Burns and Allen provide the movie with additional amusement. Joan Fontaine was cast opposite Astaire. She had just been placed under contract to RKO, and was only then emerging from low-budget films; her first successful starring role would not be until1940 with REBECCA. The casting of Burns and Allen was partly to compensate for the risk associated with placing a relative unknown as the love interest. Whereas previous Astaire films had emphasized a partnership, and the grace of the romantic dancing duet with Ginger Rogers, A DAMSEL IN DISTRESS placed Astaire front and center, emphasizing the solitary aspect of his performance. Fontaine and Astaire have only one brief number together, simultaneously inviting comparison with Rogers yet demonstrating that she was unable to dance adequately opposite Astaire. Only the presence of Burns and Allen keep the entire picture from pivoting entirely on Astaire. The expectations of a romantic musical comedy usually call for a couple at the center, but A DAMSEL IN DISTRESS opts for a solitary lead, or at most a trio (when Burns and Allen are also on screen)-an inherent imbalance in the genre. Fontaine believed that the movie actually set her career back several years. Reginald Gardiner had played the role of Percy, the antagonist in the romances, in the Hay version on the London stage. In the movie, by contrast, the character of Percy is eliminated, and Gardiner is cast as Keggs the butler, who becomes a much more sprightly and unlikely character than in the novel. Gardiner was an ideal choice, an English comedian in the same tradition as Wodehouse. A major screen credit seemed to open up the possibility of a new career for Wodehouse, but when A DAMSEL IN DISTRESS was released on November 19, it proved to be the first Astaire picture to lose money at the box office. This was probably inevitable; after seven vehicles together, audiences had grown accustomed to seeing Astaire paired with Ginger Rogers, and reviewers inevitably compared Fontaine unfavorably. The failure of A DAMSEL IN DISTRESS would compel Astaire to make two more movies with Rogers, although their reunion in CAREFREE (1938) also met with a lukewarm box office reception. Hence, the reaction to A DAMSEL IN DISTRESS was hardly unique for an Astaire picture at this point in his career. However, the disappointing box-office results must have stung Wodehouse, not only because of his involvement in its creation, but because his name had become a more prominent part of advertising and promotion than on any of the previous films from his novels. Subsequently, few movies were made from Wodehouse sources, although in decades to come he would be far more successfully adapted for television.",
         "A DAMSEL IN DISTRESS (RKO Radio, 1937), directed by George Stevens, stars Fred Astaire in his first starring musical without his famous and most frequent co-star, Ginger Rogers. From a story by P.G. Wodehouse, which was originally filmed in the silent era of 1919, this update, with song and dance in the Astaire tradition, reportedly failed at the box office. Even for a flop, the film benefits highly for its grand tunes by George and Ira Gershwin; Hermes Pan's well deserved Academy Award winning dance direction for \"The Fun House Number,\" and fine comedy support by George Burns and Gracie Allen, then on loan-out assignment from Paramount. Who's got the last laugh now? The plot revolves around Jerry Halliday (Fred Astaire), an American entertainer vacationing in England accompanied by his publicity agent, George Burns (George Burns) and stenographer, Gracie Allen (Gracie Allen). Then there's Lady Alyce Marshmorton (Joan Fontaine) of Totley Castle, on her way to London for a secret rendezvous with Geoffrey, a young American she met in Switzerland a year ago. To lose the following Kegs (Reginald Gardiner), her family butler, and Albert (Harry Watson), the page boy, Alyce hides inside the backseat a cab where she encounters its passenger, Jerry. Misunderstanding occur when both Kegs and Albert mistake Jerry for Alyce's Mr. X. As for Jerry, he comes to the conclusion the young lady's in distress. Upon Alyce's return home, her Aunt Caroline (Constance Collier) confines her to the suburban estate, while her easy-going father, Sir John (Montagu Love), who's habit is gardening, feels his daughter should follow her own impulse. As Jerry cancels his upcoming trip to Paris, he, along with George and Gracie, rent out a nearby cottage by the castle to see what he can do to help this damsel in distress. Other members in the castle are Ray Noble as Reggie, Aunt Caroline's stepson, trumpet player and orchestra leader, gets his share of Gracie antics, (\"Right-o\"), and Jan Duggan billed as Miss Ruggles, one of the Madrigalist singers of \"The Jolly Tar and the Milkmaid.\" Song interludes include: \"I Can't Be Bothered Now\" (sung by Fred Astaire); \"The Jolly Tar and the Milkmaid,\" \"Put Me to the Test\" (instrumental dance with Astaire, Burns and Allen); \"Stiff Upper Lip\" (sung by Gracie Allen/danced by Astaire, Burns and Allen); \"Things Are Looking Up\" (sung by Astaire/danced by Astaire and Fontaine); \"Nice Work If You Can Get It,\" \"Ah Chi A Uoi Perdini Iddio\" from the opera MARTA (performed/voice dubbed by Reginald Gardiner), and \"Nice Work If You Can Get It\" (reprise, drum solo/ dance by Astaire). Fascinating Rhythm. For an Astaire musical, there isn't much dancing, but when there is, it makes up for some dull spots. Aside from brief dance solo by Astaire on the foggy London streets, and another with drums, his two with George and Gracie comes as a surprise for anyone familiar with Burns and Allen as a comedy team - for that they can dance, too. Their first is a comedy dance segment involving a suit of armor. The next comes shortly after-wards at an amusement park that leads into the now classic ten minute \"Fun House\" number with Gracie singing pleasingly without stepping out of character. This segment alone is worth the price of admission which indicates Gracie more than just the scatterbrained partner to straight man George Burns. In every Astaire musical, his female co-star gets to have at least one dance with him. Joan Fontaine does just that, only slightly for the film's best song, \"Things Are Looking Up.\" It's no threat to the classic dance numbers Astaire did with Rogers, but this one with Fontaine waltzing through the estate to soothing score is quite satisfactory. Shall we dance? As with 1937 theater goers, I didn't particularly care for A DAMSEL IN DISTRESS when I first watched this on commercial television (New York City's WOR-TV, Channel 9, during its weekly Sunday night showcase, \"When Movies Were Movies\" hosted by Joe Franklin) in November 1970. After watching Astaire and Rogers in THE GAY Divorcée (1934) and TOP HAT (1935) earlier that year, I was expecting more of the same with climatic song and dance finish. Though the mistaken identity plot gets some replay, I couldn't help but feel strange it was watching Astaire with a different leading lady, how annoying little Albert can be at times, especially with his phony crying outbursts for one scene. After repeated viewing, however, I have grown to enjoy this one. Looking more like a throwback to those reproduced filmed Broadway musicals of the early talkie era, with leading man and pretty co-star, accompanied by secondary couple for comedy relief purposes, the scoring at times has that 1940s feel to it of swing, and slow tempo scoring of the big band era. Though Astaire reunited himself with Rogers in two additional musicals for RKO, he proved himself acceptable opposite different leading ladies for years to come, while both Rogers and Fontaine would win Academy Awards in 1940 and 41 respectively for their dramatic performances. Things are looking up. When presented on American Movie Classics prior to 2001, audio for A DAMSEL IN DISTRESS was in desperate need of restoration. However, current prints shown on Turner Classic Movies is much better in both visuals and audio. Distributed to home video in the 1980s from Nostalgia Merchant, A DAMSEL IN DISTRESS is also available on DVD. And be sure not to miss Astaire's attempt in duplicating Leonard's Leap. Nice work if you can get it. (***1/2)",
         "When the supporting actors in any film garner more attention and get more screen time than the leading lady there are sure to be problems. This is exactly what happens to poor Joan Fontaine, at the very start of her career, in a part that requires her to, well, carry the film as a second lead to Fred Astaire. She plays Lady Alyce Marshmorton, a woman whom Fred Astaire's character is supposed to woo out of an arranged marriage, and frankly, her colorlessness is painfully evident. Probably it's that she was at the beginning of her career and would only after 1939 come into her own as a respected actress and go on to win an Oscar for SUSPICION, but whatever she would have just doesn't show here, not to mention she can't dance at all. Then you have the two supporting characters played by George Burns and Gracie Allen -- essentially playing what would be their signature routine, here extended for an entire film -- and whenever they're on screen the movie first comes to a halt, but a good halt. Their exchanges at the start of the movie can crack anyone up and a sequence in a carnival which seems to go on forever, while adding zero to the flimsy story, has a humor all its own especially whenever Gracie Allen is on screen throwing her zingers left and right and playing ditsy to perfection. Then you have some pat scenes with Constance Collier which are pretty funny; she had her Britishness down pat. If it weren't for the supporting actors, A DAMSEL IN DISTRESS would be a much worse movie, and because of them it's watchable but forgettable, routine fluff from the movie factory.",
         "Disregard the plot and enjoy Fred Astaire doing A Foggy Day and several other dances, one a duo with a hapless Joan Fontaine. Here we see Astaire doing what are essentially \"stage\" dances in a purer form than in his films with Ginger Rogers, and before he learned how to take full advantage of the potential of film. Best of all: the fact that we see Burns and Allen before their radio/TV husband-wife comedy career, doing the kind of dancing they must have done in vaudeville and did not have a chance to do in their Paramount college films from the 30s. (George was once a tap dance instructor). Their two numbers with Fred are high points of the film, and worth waiting for. The first soft shoe trio is a warm-up for the \"Chin up\" exhilarating carnival number, in which the three of them sing and dance through the rides and other attractions. It almost seems spontaneous. Fan of Fred Astaire and Burns & Allen will find it worth bearing up under the \"plot\". I've seen this one 4 or 5 times, and find the fast forward button helpful.",
         "First of all, in defense of JOAN FONTAINE, it must be said that Ginger Rogers would have been terribly miscast as Alyce, the young British lady who has the title role. Fontaine makes a fetching picture as the heroine here, but her acting inexperience shows badly and her dancing is better left unmentioned. Fortunately, she went on to better things. But here it's FRED ASTAIRE, GEORGE BURNS and GRACIE ALLEN who get the top billing--and they are excellent. Fans of Burns & Allen will be surprised at how easily they fit into Astaire's dance routines. Especially interesting is the big fun house routine that won choreographer Hermes Pans an Oscar. They join Astaire in what has to be the film's most inventive highlight. Unfortunately, not much can be said for the slow pacing of the story--nor some of the stale situations which call for a lot of patience from the viewer. It must be said that some of the humor falls flat and the usual romantic misunderstandings that occur in any Fred Astaire film of this period are given conventional treatment. Only the musical interludes give the story the lift it needs. Some pleasant Gershwin tunes pop up once in awhile but not all of them get the treatment they deserve. The nice supporting cast includes Reginald Gardiner, at his best in a polished comic performance as a conniving servant, Constance Collier and Montagu Love (as Joan's father mistaken as a gardener by Astaire). It's a lighthearted romp whenever Burns & Allen are around to remind us how funny they were in their radio and television days. Both of them are surprisingly adept in keeping up with Astaire's footwork. Director George Stevens makes sure that Joan Fontaine's hillside dance number with Fred is filmed at a discreet distance but clever camera-work cannot disguise the fact that she is out of her element as Astaire's dance partner, something she seems painfully aware of.",
         "Back when musicals weren't showcases for choreographers, we had wonderful movies such as this one. Being a big fan of both Wodehouse and Fred Astaire I was delighted to finally see this movie. Not quite a blend of Wodehouse and Hollywood, but close enough. Some of the American vaudeville humour, the slapstick not the witty banter, clash with Wodehouse's British sense of humour. But on the whole, the American style banter makes the American characters seem real rather than cardboard caricatures. Some inventive staging for the dance numbers, including the wonderful fairground with revolving floors and funhouse mirrors, more than make up for the lack of a Busby Berkley over the top dance number. They seem a lot more realistic, if you could ever imagine people starting to sing and dance as realistic. The lack of Ginger Rogers and Eric Blore don't hurt the movie, instead they allow different character dynamics to emerge. It's also nice not to have a wise cracking, headstrong love interest. Instead we have a gentle headstrong love interest, far more in keeping with Wodehouses' young aristocratic females.",
         "I couldn't wait to get my hands on this one, when I read about Fred Astaire teaming up with George Burns & Gracie Allen in a movie with a script by P.G. Wodehouse and music by the Gershwins. It is definitely worth seeing, but lacks the cohesive quality of the Fred & Ginger movies. The story would probably be better to read in a Wodehouse book, where the humor comes across better. Some of the acting is downright painful to watch (notably the young boy and the damsel). But...! The funhouse dance is worth more than most movies. I never knew that Gracie Allen could dance, but boy does she in this movie. Have you ever tried to remain standing on one of those spinning discs in a funhouse? Imagine tapdancing on one in high heels! She keeps up wonderfully with Astaire and adds greatly to the overall quality of the picture. Several nice songs, particularly fun are Nice Work if you Can Get It and Stiff Upper Lip. Recommended for fans of Astaire, Burns & Allen. I had to go back and re-watch the funhouse dance as soon as the credits rolled.",
         "There's a perfectly good reason why Fred Astaire and Ginger Rogers made nine films together between 1933 and 1939 \u0096 the pairing worked! Astaire's toe-tappin' class was complemented perfectly by the light-hearted comedic charms of his female co-star, and that he and Rogers never overshadowed each other was crucial to the success of their collaborations. 'A Damsel in Distress (1937)' sees Astaire, for the first time since his debut, momentarily set adrift from this celebrated partnership. It's a pleasant and enjoyable musical comedy, but it doesn't entirely work because Fred is clearly the main attraction, creating an imbalance of tone that feels somehow unsatisfying. Joan Fontaine, in an early role, fills in as the primary romantic interest; she's not particularly convincing here \u0096 but, geez, she's gorgeous! \u0096 and her charms would carry her along sufficiently until her superb star-making performance in Alfred Hitchcock's 'Rebecca (1940).' Husband-and-wife vaudeville duo George Burns and Gracie Allen provide most of the welcome comic relief, which is basically an extension of their popular stage act. 'A Damsel in Distress' was directed by George Stevens {who had previously worked with Astaire in 'Swing Time (1936)} and adapted by P.G. Wodehouse from his own 1919 novel. Jerry Halliday (Astaire) is a famous American dancer, frustrated by all his publicity, who falls in love with the beautiful Lady Alyce Marshmorton (Fontaine), whom he believes has inexplicably fallen in love with him. What Jerry doesn't realise is that Lady Alyce has actually fallen in love with a different (unseen) American, and that he is being misled by the staff at Tottney Castle, who have placed bets on who their mistress will eventually marry. Reginald Gardiner hilariously hams it up as Keggs, the scheming butler who apparently can't resist belting out an opera when the appropriate music starts playing. Burns and Allen provide the necessary supporting back-up (even matching Astaire step-for-step in the \"Fun House\" musical number), with the latter playing the ditsy eccentric with perfect composure, utilising more cringeworthy puns than Groucho Marx in 'Duck Soup (1933).' George Gershwin played a significant role in getting Stevens' film made in the first place, and his songs were completed before script-work actually began. Tragically, the composer died from a brain tumour before production was completed. There were not quite as many musical numbers as I had expected, and very few stood out in my memory like Astaire's greatest tunes. Nevertheless, the \"Fun House\" number was an elaborate, precisely-orchestrated dance sequence, making superb use of reflections, moving sets and confined spaces. Most memorable of all was Astaire's rendition of \"A Foggy Day (In London Town),\" performed as the actor traipses gracefully through a fog-ridden forest. Joan Fontaine was the first actress to admit her insufficient capacity to play a convincing terpsichorean, and so she only attempts it once, and, all things considered, she doesn't embarrass herself all that much. She is, of course, always a joy to watch, but her character's \"I love you\u0085 now I hate you\u0085 no, wait, I love you again\" routine is overdone and unpersuasive.",
         "In a famous essay he wrote about Charles Dickens, George Orwell points out that many readers always regretted that Dickens never continued writing like he did in PICKWICK PAPERS: that is, he did not stick to writing funny episodic novels for the rest of his career. This would not have been too difficult for Dickens. His contemporary Robert Surtees did precisely that, only concentrating on the misadventures of the fox hunting set (MR. FANCY ROMFORD'S HOUNDS is a title of one of his novels). Among hunters and horse lovers Surtees still has a following but most people find his novels unreadable. Dickens was determined to show he was more than a funny man (and don't forget, his first book, SKETCHES BY BOZ, was also a funny book). So Dickens third book is OLIVER TWIST (which got pretty grim at points). Orwell says that for any author to grow they have to change the style of their books. Dickens would definitely (and successfully) have agreed to that. But Orwell overlooked the genre writer who transcends his fellows. Surtees, as I said, is a genre writer concentrating on hunting - but not everyone is interested in hunting. But P.G.Wodehouse saw himself as an entertainer, poking fun at the upper reaches of the British social system. His Earl of Emsworth is prouder of raising the finest pig in England than being...well Earl of Emsworth! His Psmith is always prepared to counterattack when he is supposed to be submissive to an unfair superior. His Stanley Uckridge will always have a \"perfect\" scheme that should net a huge profit (but always manages to come apart at the end). And best of all, his Jeeves will always put his brilliant brain to work rescuing the inept Bertie Wooster, his boss. Since Wodehouse had a limited view of his mission as a writer - he was there to do cartoon figures of fun for the entertainment of the world - his books never lost their glow. They served (and still serve) their purposes. In fact, compare Wodehouse with his far more serious contemporary Evelyn Waugh (who also wrote funny books but of a more intellectual type). The best of Waugh remains among the high points of 20th Century British literature: BRIDESHEAD REVISITED, DECLINE AND FALL, and the rest. But in his determination to make his points, if his points failed to interest the reader the book frequently collapsed. For every VILE BODIES there was some failure late in his career like THE ORDEAL OF GILBERT PINFOLD. While Wodehouse could do lesser hack work too, his falling did not go as far as Waugh's did. Wodehouse also was a gifted lyricist (when you hear \"Bill\" in the score of SHOWBOAT, it is not Kern and Hammerstein's tune, but Kern and Wodehouse's tune transposed from \"Oh Lady, Lady\" a dozen years earlier). He was a handy dramatist too. So it is pleasing to see that he took his novel A DAMSEL IN DISTRESS and turned it into the screenplay here. It has the normal Wodehouse touches. That perfect butler Keggs (Reginald Gardiner in a wonderful performance) is a scoundrel in rigging a \"friendly\" gambling game of chance among the staff of the stately home he heads. He is also unable to refrain, occasionally, from singing Italian opera - despite Constance Collier's attempts to control his impulse. This is typical Wodehouse characterization. So is the way the love affair between Lady Alyce and Jerry keeps going well and going down due to the antics of Keggs and young Albert, both of whom want to win that game of chance pot of cash. Wodehouse always does that type of plot switch, with antagonists switching their point of view depending on their present state of interest. Wodehouse was also lucky here to have Burns and Allan to work with. It is generally considered that of all the films they made as supporting actors together (such as SIX OF A KIND and WE'RE NOT DRESSING) George and Gracie did their best support with Fred Astaire. The Fun House sequence, which includes the song \"Stiff Upper Lip\", is wonderful, as is an earlier sequence where the three do a \"whisk broom\" dance (that Astaire learned from Burns). But Gracie's marvelous illogical logic is used by Wodehouse in scenes with Gardiner (see how she manages to confuse him into giving her more money than her change deserves to be - only Albert happens to notice Keggs/Gardiner's mistake, and looks at Gardiner as though he's either stupid or mad). Her dialog with Lady Caroline (Collier)'s son Reggie (Ray Noble, the British band leader)leading him to imagine that he will marry her, but saying goodbye to Gracie as she drives off with George to get married is wonderful too. The film supposedly failed at the box office because of the lack of Ginger Rogers in it, and the weakness of Joan Fontaine. Fontaine is not doing a remarkable job in the role, but the flaw is really Wodehouse's - he didn't make the character very interesting. But the film can stand without that, given the other performers and their characters, Gershwin's music, and Wodehouse's marvelous sense of fun.",
         "One thing that you got a lot in the late 30s, when many of the franchises that had kept the industry going were now starting to lose appeal, was the studios putting together meaty packages of all the popular elements they had at their disposal in the hope of creating a sure-fire hit. 1937's Damsel in Distress gives us the dancing of Fred Astaire, the music of Gershwin, the writing of PG Wodehouse, plus a bevy of comedy supporting players. How could it fail? Well\u0085 Fred Astaire's pairings with Ginger Rogers were beginning to lose money, and were perhaps being perceived as repetitive. Damsel in Distress seems to be an attempt to revive flagging box office takings by sending one half of the duo out on his own and putting him in a new environment with a new leading lady. While Joan Fontaine was a great actress, she was neither a singer nor a dancer, and what made the previous musicals work was the way Fred and Ginger clicked through dance \u0096 when their two characters danced together, you knew they were made for each other. You would later get the same thing when Astaire was teamed with Cyd Charisse. You're not going to get it with Fontaine. And it's not just Ginger who's missing; it seems to have been RKO's deliberate intention to remove all the familiar faces from the supporting cast \u0096 no Eric Blore, no Erik Rhodes and not even Edward Everett-Horton. Those jokers were half the fun! Instead, we get \"cockney\" lad Harry Watson, who presumably grew up to become Dick van Dyke's dialogue coach, and comedy couple George Burns and Gracie Allen, who are about as funny as cancer. Of course the Gershwins were always good, and Damsel in Distress contains some of their best songs. The choreography of Hermes Pan plays nicely off the lively tunes as well. However, like most musicals of the period, the song and dance numbers are simply showpieces for which the narrative must take a break. The Fun House routine, for which the picture won its only Oscar, is very amusing, although it shows how Hermes Pan was now more interested in props and elaboration than showcasing the talent of Fred. The simple flow of \"Things are Looking Up\" is actually more satisfying and sits better with the rest of the picture. Director George Stevens was someone who could always be relied upon to treat even the silliest of stories with grace and tenderness. The slow, measured pace he encourages from his actors, often with long moments between the dialogue in which the characters emote wordlessly, give great weight to the romantic scenes. The best \"Stevens\" moment from Damsel in Distress has to be when Fontaine confesses her feelings to Astaire at the cottage. As in many such scenes, we gradually move in from mid-shot to close-up, but Stevens begins that first close-up of Fontaine with her face moving into the frame, giving the moment that little bit more intensity. The steady pace of a George Stevens picture also often brought out the best in the comedy, although unfortunately there is not enough raw material here. As for poor old PG Wodehouse, you can just about see traces of his style, the basic plot being a typical Wodehouse blend of warm romance and gentle satire with an emphasis on the interplay between aristocrats and their servants. Someone probably thought this would go well with sassy sophistication and stuffy vs. modern dynamic of Astaire's musical comedies, but it clashes horribly. Few of the cast, with the exception of Reginald Gardiner and Montagu Love, look like they belong here. Incidentally the aforementioned Messrs. Blore, Rhodes and Everett-Horton would all fit very nicely into Wodehouse world. The trouble then with Damsel in Distress is that it throws together all its (mostly) worthy elements without any consideration of how they might work together. Bits and pieces of it are nice, and the songs are excellent, but overall it's a rather bland affair. The picture was predictably a great mistake that did no favours for Astaire's falling star, or Fontaine's rising one."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": ["Lady Alyce Marshmorton must marry soon, and the staff of Tottney Castle have laid bets on who she'll choose, with young Albert wagering on \"Mr. X.\" After Alyce goes to London to meet a beau (bumping into dancer Jerry Halliday, instead), she is restricted to the castle to curb her scandalous behavior. Albert then summons Jerry to Alyce's aid in order to \"protect his investment.\""],
      "budget": 1035000
   },
   "movielensId": 1067,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1937-11-19",
      "dvdReleaseDate": null,
      "directors": ["George Stevens"],
      "runtime": 101,
      "movieId": 1067,
      "title": "A Damsel in Distress",
      "mpaa": "",
      "actors": [
         "Fred Astaire",
         "George Burns",
         "Gracie Allen",
         "Joan Fontaine",
         "Reginald Gardiner",
         "Ray Noble",
         "Constance Collier",
         "Montagu Love",
         "Harry Watson",
         "Jan Duggan"
      ],
      "imdbMovieId": "0028757",
      "originalTitle": "A Damsel in Distress",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Lady Alyce Marshmorton must marry soon, and the staff of Tottney Castle have laid bets on who she'll choose, with young Albert wagering on \"Mr. X.\" After Alyce goes to London to meet a beau (bumping into dancer Jerry Halliday, instead), she is restricted to the castle to curb her scandalous behavior. Albert then summons Jerry to Alyce's aid in order to \"protect his investment.\"",
      "tmdbMovieId": 66473,
      "avgRating": 3.40397,
      "releaseYear": "1937",
      "numRatings": 151,
      "posterPath": "/woERgwsyAb318gMMnvaoUKs3L3I.jpg"
   }
}