{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "army",
            "id": 6092
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "anti semitism",
            "id": 10144
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0039286",
      "video": false,
      "title": "Crossfire",
      "recommendations": [
         19998,
         36814,
         21454,
         31713,
         25876,
         19169,
         20298,
         179246,
         14638,
         59087,
         17645,
         26174,
         26167,
         26530,
         29740,
         16090,
         31152,
         26744,
         43461,
         26654
      ],
      "backdrop_path": "/wYHTUAmtSmjjsFeXNdN2WwkvHPn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Finlay",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db35",
               "name": "Robert Young",
               "profile_path": "/yD74ANflpVXQPci4cihAg63BfK7.jpg",
               "id": 14868,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Keeley",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db39",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Montgomery",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db3d",
               "name": "Robert Ryan",
               "profile_path": "/xBAWG79UGCkchPPTbONycJiKW2g.jpg",
               "id": 8253,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Ginny",
               "gender": 1,
               "credit_id": "52fe457ac3a368484e05db41",
               "name": "Gloria Grahame",
               "profile_path": "/f4Y0WcGs4UDwRVFD9XYoDg5pclS.jpg",
               "id": 77081,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "The Man",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db45",
               "name": "Paul Kelly",
               "profile_path": "/rjgY0UF0a7fD47dd4xuVC8dDNAb.jpg",
               "id": 82348,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Samuels",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db49",
               "name": "Sam Levene",
               "profile_path": "/z2QtVul6HSSvX9bJKUEPhltMQdA.jpg",
               "id": 14574,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mary Mitchell",
               "gender": 1,
               "credit_id": "52fe457ac3a368484e05db4d",
               "name": "Jacqueline White",
               "profile_path": "/3GXIAONQ5ymv1em4IeXWtTiqrON.jpg",
               "id": 99752,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Floyd",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db51",
               "name": "Steve Brodie",
               "profile_path": "/iMpMJ1PFULRsVvGAw8ZT7cpgfgJ.jpg",
               "id": 10162,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mitchell",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db55",
               "name": "George Cooper",
               "profile_path": null,
               "id": 99753,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db59",
               "name": "Richard Benedict",
               "profile_path": "/eEXhzpiIDoZl4QrSYWoyWvRXbJX.jpg",
               "id": 93623,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Detective",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db5d",
               "name": "Tom Keene",
               "profile_path": "/kCzELnYTY6j3edahwonspDke0P9.jpg",
               "id": 65500,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Leroy",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db61",
               "name": "William Phipps",
               "profile_path": "/hqN5f8MxRYfFLRA3hZfF2HVTHZa.jpg",
               "id": 99754,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db65",
               "name": "Lex Barker",
               "profile_path": "/zDbNsktl4Wz3chDweYn17v4fUUG.jpg",
               "id": 6102,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Miss Lewis",
               "gender": 0,
               "credit_id": "52fe457ac3a368484e05db69",
               "name": "Marlo Dwyer",
               "profile_path": "/rhTyysjhwlN31easDI7IJcA5adb.jpg",
               "id": 99755,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe457ac3a368484e05db13",
               "name": "Edward Dmytryk",
               "profile_path": "/s7E1zzpOeg7VBmLjA9MBgl2jizD.jpg",
               "id": 64114,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db19",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ac3a368484e05db1f",
               "name": "Adrian Scott",
               "profile_path": null,
               "id": 19322,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db25",
               "name": "Roy Webb",
               "profile_path": null,
               "id": 4345,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db2b",
               "name": "J. Roy Hunt",
               "profile_path": null,
               "id": 97048,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ac3a368484e05db31",
               "name": "Harry W. Gerstad",
               "profile_path": null,
               "id": 4167,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ac3a368484e05db6f",
               "name": "John Paxton",
               "profile_path": null,
               "id": 132577,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.243101,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28120,
      "vote_count": 30,
      "budget": 0,
      "overview": "A man is murdered, apparently by one of a group of soldiers just out of the army. But which one? And why?",
      "similar": [
         910,
         996,
         1939,
         12162,
         949,
         189,
         336843,
         1073,
         14638,
         654,
         8834,
         3112,
         3766,
         563,
         4421,
         845,
         9272,
         1923,
         2163,
         223
      ],
      "original_title": "Crossfire",
      "runtime": 86,
      "poster_path": "/bF2FY0FiUf3daJxuowDKtimN1P9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1947-07-22",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Hate is like a loaded gun!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edward Dmytryk"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "John Paxton",
         "Richard Brooks"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039286/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODI3NzI5ODMwM15BMl5BanBnXkFtZTgwMzg1MDkxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Young, Robert Mitchum, Robert Ryan | See full cast and crew »"],
      "reviews": [
         "RKO's \"Out Of The Past\" (1947) is regarded by many as the finest Noir ever to come out of Hollywood. But CROSSFIRE, made just prior to it the same year, was a fair contender for that coveted title. Produced by Adrain Scott for RKO, the recognized home of Noir, it was magically photographed in beautifully defined black and white by J.Roy Hunt. Written for the screen by John Paxton from a novel by Richard Brooks it was stylishly directed by Edward Dmytryk and was fleshed out with an imaginative cast headed by the three Roberts - Young, Mitchum and Ryan plus Gloria Grahame, Sam Levene and Paul Kelly. A Jew (Levene) is murdered in a hotel room by anti-Semitic GI Montgomery (Robert Ryan) leading to pipe smoking detective Robert Young investigating three soldiers who are suspects. Interestingly, in the original novel it is a homosexual that is murdered, but in 1947 homosexuality was very much a taboo subject to put on the screen so the murder victim was changed to be Jewish. The change had little effect on the story's impact for it is still a dynamic and potent drama. CROSSFIRE is not only a fascinating well produced motion picture but it also has a fascinating look to it. Taking place entirely at night the deserted dark wet streets, filmed with a bug-eyed lens, together with the shadow filled interiors make for some of the most startling and vibrantly shot sequences ever seen in pictures. Also, though it is sparsely scored by RKO's resident Noir composer Roy Webb there is a thundering and punchy Main Title and a reflective love theme. Webb must have been saving himself for his masterpiece \"Out Of The Past\" which would come later that year. Also heard in the night club scenes in CROSSFIRE is the great New Orleans trombonist Kid Ory (1886/1973) And His Creole Jazz Band (uncredited) playing some wonderful jazz numbers. And later in Grahame's apartment Ory can be heard again on the radio playing the marvellous Jelly Roll Morton composition \"Whinin' Boy Blues\" which lends a persuasive atmosphere to the drab surroundings. Performances are generally good! Robert Young is excellent in what is probably his best remembered role as the detective. But disappointing and wasted is Robert Mitchum! He doesn't really have very much to do in what amounts to nothing more than being cast in a sombre and subdued role. The acting honours however must go to Robert Ryan's blistering performance as Montgomery the violent Jew hating GI. His sneaky and scary portrayal deservedly earned him an Acadamy Award nomination. Also effective is Sam Levene as Samuels the ill-fated Jew and Gloria Grahame as the girl in the night club who picks up the naive George Cooper. And watch out too for a young Lex Barker in one of his first film appearances. Not as good as the magnificent \"Out Of The Past\" that came later that year but still an engrossing and tight little thriller from that once great RKO studio in Hollywood who produced exceptional movies that we can never forget and which now, sadly, Hollywood itself seems to have forgotten.",
         "SPOILERS Not only does this movie boasts three Roberts,but it also possesses all that makes a film noir great:a murky sticky atmosphere, a fine supporting cast , a lot of characters we remember even if they appear on the screen barely fifteen minutes(Gloria Grahame and her husband for instance).The first scene sets the tone:a murder ;we can only see the shadows on the wall. Edward Dmytryk,whose career would dismally end (the likes of \"Shalako\") ,was here at the height of his powers:he films his story with a stunning virtuosity and there are unforgettable moments:the scene in the Jew's apartment seen thru the eyes of the drunken soldier;the way the director films brilliant Robert Ryan ,using dizzying high and low angle shots.He's arguably the stand-out and his performance is really spooky;the conversation during which you can only see Ryan's face in a mirror;all these stairs which seem to be death traps. It seems that these soldiers can only survive in the dark:in the nightclubs,in Grahame's seedy apartment,in a movie theater.They are just about at breaking point,as if they had come from hell to wind up in another one.But one should notice that ,at least in the first half of the movie,their camaraderie,their solidarity remain intact:brothers in arms indeed;the police are the enemy. Robert Young's cop is a thousand miles above your usual detective routine:the scenarists achieves the feat of including his own story (actually his grandfather)in this murder mystery.He really pleads for the right to difference:today the Jews,tomorrow the hillbillies from Tennessee ,then the guys with striped ties...His words have a contemporary feel:it's because they don't know the Jews,the fags (check the novel)that some people use them as scapegoats. Robert Ryan's portrayal is one of the most frightening of all the film noir genre.It's interesting to compare his part with the one he plays in Robert Wise's \"odds against tomorrow\"(1959).In both movies ,his character is a racist or anti-Semite;in both movies no explanation.Ryan was known for his very liberal ideas,what a clever actor he was!",
         "Taut and organically gripping, Edward Dmytryk's Crossfire is a distinctive suspense thriller, an unlikely \"message\" movie using the look and devices of the noir cycle. Bivouacked in Washington, DC, a company of soldiers cope with their restlessness by hanging out in bars. Three of them end up at a stranger's apartment where Robert Ryan, drunk and belligerent, beats their host (Sam Levene) to death because he happens to be Jewish. Police detective Robert Young investigates with the help of Robert Mitchum, who's assigned to Ryan's outfit. Suspicion falls on the second of the three (George Cooper), who has vanished. Ryan slays the third buddy (Steve Brodie) to insure his silence before Young closes in. Abetted by a superior script by John Paxton, Dmytryk draws precise performances from his three starring Bobs. Ryan, naturally, does his prototypical Angry White Male (and to the hilt), while Mitchum underplays with his characteristic alert nonchalance (his role, however, is not central); Young may never have been better. Gloria Grahame gives her first fully-fledged rendition of the smart-mouthed, vulnerable tramp, and, as a sad sack who's leeched into her life, Paul Kelly haunts us in a small, peripheral role that he makes memorable. The politically engaged Dmytryk perhaps inevitably succumbs to sermonizing, but it's pretty much confined to Young's reminiscence of how his Irish grandfather died at the hands of bigots a century earlier (thus, incidentally, stretching chronology to the limit). At least there's no attempt to render an explanation, however glib, of why Ryan hates Jews (and hillbillies and...). Curiously, Crossfire survives even the major change wrought upon it -- the novel it's based on (Richard Brooks' The Brick Foxhole) dealt with a gay-bashing murder. But homosexuality in 1947 was still Beyond The Pale. News of the Holocaust had, however, begun to emerge from the ashes of Europe, so Hollywood felt emboldened to register its protest against anti-Semitism (the studios always quaked at the prospect of offending any potential ticket buyer). But while the change from homophobia to anti-Semitism works in general, the specifics don't fit so smoothly. The victim's chatting up a lonesome, drunk young soldier then inviting him back home looks odd, even though (or especially since) there's a girlfriend in tow. It raises the question whether this scenario was retained inadvertently or left in as a discreet tip-off to the original engine generating Ryan's murderous rage.",
         "Definitely a \"must see\" for all fans of film noir. Thanks to a fine script and crisp, razor sharp direction, a top cast comes together and works like a well oiled clock to produce a crackerjack psychological thriller. Wonderful characterizations articulate the movie's powerful message about the dangers of racial and religious intolerance. It's difficult and almost unjust to single out any one, particular performance because there isn't a weak link in the entire company. But Robert Ryan as the hateful and violent white supremacist is truly spine chilling. Making this film in the 1940s would have taken a lot of courage. Now,all these years later, at a time when contemporary movies are dominated by a ridiculous over abundance of foul language, bare breasts, crummy acting and deafening soundtracks, it's refreshing to get back to the basics of quality film making with a viewing treat like \"Crossfire\". Another low budget gem from the Hollywood archives .",
         "'Crossfire' is a very interesting movie. It begins like a murder mystery, but it becomes obvious very quickly who the murderer is, and the plot becomes more concerned with his motive. And it is his motive which makes the movie so interesting. 'Crossfire' is a \"message\" movie but it is also a cracking good drama, and that's what I enjoyed about it. Plus the cast is dynamite - Roberts Preston, Mitchum and Ryan, and the beautiful Gloria Grahame ('In A Lonely Place'). Mitchum doesn't have a big a role as you might expect (the movie was released the same year as 'Out Of The Past' in which he gives a much more substantial performance), but he's always great to watch, and Robert Ryan ('The Wild Bunch') steals the movie as a very nasty piece of work. I find many 1940s romance and comedy movies to be too corny for my taste, but the crime movies are much more to my liking. They are usually grittier and more realistic, and 'Crossfire' is a great example of this. Highly recommended.",
         "'Film Noir' is a much-used (and misused), catch phrase, coined to describe Hollywood films of the forties and fifties. These films were invariable in black and white (hence the paucity of such films on Australian commercial TV), and shot on tiny budgets in a matter of a few weeks. The plots are generally formulaic. Someone is murdered, someone else will be framed for that murder, and a 'dame' figures somewhere in the proceedings. \"Crossfire\" is low budget, and shot in black & white: admirably so by J. Roy Hunt. And yes, there's a 'dame' involved. What sets \"Crossfire\" apart from most of the other films of that era, is that it's not just another murder mystery, however well executed. This is a film about religious intolerance. That people are killed is but the flesh on the bones of a film about (without preaching), racial vilification. The director, Edward Dmytryk was a fine, and now, a sadly neglected director. He knew how to work within the confines of the studio system, and turn out a quality film like \"Crossfire\" The original thrust of the films' message, was, apparently, about homophobia. This upset the Hays Office. and religious persecution was substituted instead. There is not a wasted frame in this picture. It runs a taught 86 minutes. For my money, Robert Young, who plays the detective charged with solving who murdered whom, and why, is a standout. This in face of an understated Robert Mitcham, and a powerful performance by Robert Ryan as the psychotic Montgomery - think of his role as Claggart, in the film \"Billy Budd\". Believe me when I say that it was truly refreshing to see a film (thank god for late night TV), where the actors can act, the dialogue is intelligent, and where computer graphics and special effects were not used as a substitute for plot",
         "I first saw CROSSFIRE as a 10-year-old kid in his favorite neighborhood theater in Philadelphia one hot Saturday afternoon. Did I understand it? No, not completely, but one message DID ring through clearly ... that of anti-Semitism, which was alive and well during those years following WWII. But, as I matured, I happened to catch it on not less than three additional occasions, and came out each time with a totally different perspective. Today, at age 67, and having been around the block a few times, I can safely say that there is no room for anti-Semitism today, nor was there in 1947. Of course, to love thy brother is THE way toward a more sensible coexistence... especially in times when the security of ALL is threatened. As for the performances in CROSSFIRE, you couldn't have in any better: Robert Mitchum was superb as a placid veteran in the company of Robert Ryan, who was dynamite as his psychotic counterpart who killed Sam Levene just because he was a Jew. Robert Montgomery did quite well as the detective trying to get to the bottom of an apparently senseless crime. This is TRUE film noire, in \"glorious black and white,\" short, sweet, and very much to the point. GOD! I LOVE those films from the late-'40s and early-50s! Happy viewing everyone!",
         "Edward Dmytryk directed this shadowy movie about a murder investigation involving demobilized military personnel. Robert Young gets to lecture us about hatred, Robert Mitchum walks through most of this picture, and Gloria Grahame revisits the feistiness she exhibited in \"It's A Wonderful Life.\" It's Robert Ryan who gets at the heart of the matter: anti-semiticism. He goes so deep into his role as Monty Montgomery (Imagine parents named Lawrence calling their son Larry!), that the drama sits squarely on his shoulders, and he is more than up to the challenge. Without him, the movie would be commonplace. Ryan has played a number of memorable villains in his day (\"Bad Day at Black Rock;\" \"Billy Budd\"), but this performance put him on the map. With Sam Levene as the murder victim.",
         "As a rule, there are few things more dispiriting than Hollywood's attempts to be courageous. Mixing caution with heavy-handedness, \"message movies\" pat themselves loudly on the back for daring to tackle major problems. CROSSFIRE is not entirely free from this taint; it includes a sermon on the nature of senseless hatred that is embarrassingly obvious, assuming a level of naivity in its audience that's depressing to contemplate. As late as 1947, it was a big deal for a movie to announce that anti-Semitism existed, and that it was bad. (It was unthinkable, of course, for Hollywood to address the real subject of the book on which the movie was based\u0097its victim was a homosexual.) Nevertheless, thanks to good writing and excellent acting, CROSSFIRE remains a persuasive examination of what we would now call a hate crime. Postwar malaise was one of the major components of film noir, and CROSSFIRE addresses it directly. The film is set in Washington, D.C. among soldiers still in uniform but idle, spending their days playing poker and bar-crawling. Joseph Samuels (Sam Levene), an intelligent and kindly Jew, explains that the end of the war has created a void: all the energy that went into hating and fighting the enemy is now unfocused and bottled up. Samuels meets three soldiers in a bar: the sensitive Mitchell, who is close to a nervous breakdown, the weak-willed Floyd Bowers, and Montgomery, a tall, overbearing bully who nastily belittles a young soldier from Tennessee as a stupid hillbilly. The three soldiers wind up at Samuels' apartment, where the drunken Monty becomes increasingly abusive, calling his host \"Jew-boy.\" Samuels is beaten to death, and Mitchell disappears, making himself the prime suspect for the killing. Unraveling the crime are Detective Finlay (Robert Young), dry and by-the-book, and Sergeant Keeley (Robert Mitchum), a thoughtful and experienced friend who knows Mitchell is incapable of murder. Among the pieces of the puzzle are Ginny (Gloria Grahame), a nightclub hostess who met Mitchell and gave him her apartment key, and Floyd (Steve Brodie), who as a witness to the crime holes up terrified in a seedy rooming house. While there is no real \"whodunit\" suspense, the story remains gripping, and the trap laid for the killer is extremely clever. The strong noir atmosphere saves the movie from feeling didactic or sanctimonious. The cinematography is a striking shadow-play, with inky darks and harsh lights, rooms often lit by a single lamp filtered by cigarette smoke. World-weariness is as pervasive as noir lighting. \"Nothing interests me,\" Finlay says quietly; \"To nothing,\" is Ginny's toast in the nightclub. Gloria Grahame, the paragon of noir femininity, nearly steals the movie with her two scenes. Platinum-blonde, jaded and caustic, she's the quintessential B-girl, poisoned by the \"stinking gin mill\" where she works (\"for laughs,\" she says bitterly), her sweet face curdling when Mitchell tells her that she reminds him of his wife. Now and then a wistful kindness peeks through her defensive shell, as when she dances with Mitchell in a deserted courtyard, then offers to cook him spaghetti at her apartment. When he goes there, he meets a weasely, crumple-faced man (Paul Kelly) who seems to sponge off Ginny, and whose conversation is a dense layering of lies and false confessions. Gloria blows Mitchell's good-girl wife off the screen in a scene where she's asked to give Mitchell an alibi. Slim and frail in her bathrobe, with her girlish lisp, she lets us see just how often Ginny has been insulted and dismissed as a tramp. Robert Young is a nondescript actor, and he stands no chance against Mitchum's charisma, but he does a good job of keeping his pipe-smoking character, saddled with delivering the movie's earnest message, this side of pompousness. Mitchum, meanwhile, gets some cool dialogue, but not nearly enough to do; still, even when he's doing nothing but lounging in a corner you can't take your eyes off him. The third Robert, Ryan, creates a fully shaded and frighteningly convincing portrait of an ignorant, unstable bigot; we see his phony geniality, his bullying, his resentment of anyone with advantages, his \"Am I right or am I right?\" smugness; how easily he slaps labels on people and what satisfaction he gets from despising them. CROSSFIRE's message seems cautious and dated now, though not nearly so much as the same year's A GENTLEMAN'S AGREEMENT. Finlay's speech about bigotry cops out by reaching back a hundred years for an instance of white victimhood, reminding us that Irish Catholics were once persecuted; next it could be people from Tennessee, he says, or men who wear striped neckties. Or maybe blacks, or Japanese, or homosexuals, or communists? The script seems afraid to mention any real contemporary problems. It sweetens its message by making the Jewish victim saintly, as though his innocence were not sufficient; and it takes care to exonerate the military, having a superior officer declare that the army is ashamed of men like Montgomery, and stressing that Samuels served honorably in the war. Still, it did take some guts to depict, immediately after World War II, an American who might have been happier in the Nazi army, and the movie's basic premise is still valid. If Monty were alive today, he would have gone out on September 12, 2001, and beat up a Sikh.",
         "A bigoted soldier kills a man for being Jewish and tries to pin it on a fellow soldier. Not as good as the novel it was based on (\"The Brick Foxhole\") in which it was a gay man who was killed...but Hollywood wouldn't touch that in 1947. That said, it's still a very good film. The anti-Semitism is handled very well, but it's hammered into the audience that bigotry is bad...well duh! But this was 1947. The picture is well-acted by the entire cast (especially Robert Young and Robert Ryan) and the tone is very dark...as it should be. Very atmospheric too. A deserved big hit in its day...well worth seeing."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Mystery"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "Homicide Capt. Finlay finds evidence that one or more of a group of demobilized soldiers is involved in the death of Joseph Samuels. In flashbacks, we see the night's events from different viewpoints as Sergeant Keeley investigates on his own, trying to clear his friend Mitchell, to whom circumstantial evidence points. Then the real, ugly motive for the killing begins to dawn on both Finlay and Keeley...",
         "Joseph \"Sammy\" Samuels is found beaten to death in his Washington D.C. apartment by his girlfriend, Miss Lewis. Cpt. Finlay of the police department is the lead investigator into the murder, which seemingly has to do with a group of four military men - most recently decommissioned - that Sammy and Miss Lewis had drinks with earlier that evening in a bar. Those four are \"Monty\" Montgomery, Arthur \"Mitch\" Mitchell, Floyd Bowers, and Floyd's friend Leroy. Indeed, Monty, who is questioned first by Finlay as he wanders by Sammy's apartment during the investigation, confirms that he, Floyd and Mitch were even in Sammy's apartment later having drinks with Sammy, which explains why Finlay found Mitch's wallet in the apartment. On the surface, Mitch seems to be the most likely candidate as the murderer based on Monty's story that Mitch was drunk and out of sorts. A fifth decommissioned military man, Peter Keely - Mitch's roommate - confirms Mitch's tenuous mental state over his uncertain future especially with his wife back in Chicago, but knows sensitive Mitch is not the type of person who could be a murderer. Keely himself tries to find the missing Mitch to get his story and hopefully a confirmable alibi for the time of the murder. Keely and Finlay at times seem to be working on cross purposes, but both come to the realization of the identity of the murderer about the same time. Without hard evidence or a witness, Finlay believes the key to conviction lies with Leroy.",
         "After a man by the name of Samuels is found strangled in his apartment, police Captain Finlay focuses on a group of soldiers who had been in the same bar with the victim earlier that day. One of them, Mitchell, had left the bar with Samuels and a girl. Another soldier, Montgomery, had seen Mitchell in Samuels' apartment but he ran off with Samuels still alive. Sgt. Peter Keely doesn't believe for one minute that the mild-mannered Mitchell could kill anyone. He finds Mitchell who tells him he'd agreed to go out to dinner with Samuels but wasn't feeling well and left. The next thing he remembers is sitting in a club with a girl named Ginny. Finlay thinks it's a hate crime and that Samuels was killed because he was Jewish. The real killer is prepared to do whatever is necessary to ensure he gets away with Samuels' murder.",
         "In the Post WWII, Police Captain Finlay investigates the murder of the Jewish Joseph \"Sammy\" Samuels in his apartment after a beating with his team. Out of the blue, soldier Montgomery \"Monty\" comes to the apartment and tells that three soldiers - Corporal Arthur \"Mitch\" Mitchell, soldier Floyd Bowers and himself - had been in the apartment drinking with Sammy, and Mitch would have been the last one to leave the place. Finlay finds Mitch's wallet on the couch and he becomes the prime suspect. Finlay visits Sergeant Peter Keeley and he tells that his friend Mitch is a sensitive artist incapable to kill a man. Keeley decides to investigate the case to protect and clear the name of his friend. When Keeley discuss the evidences with Finlay, the captain concludes that Mitch did not have the motive to kill Sammy, who was a stranger that he met in a bar. Now Captain Finlay has another suspect and he decides to plot a scheme to expose the assassin.",
         "A man is murdered, apparently by one of a group of soldiers just out of the army. But which one? And why?"
      ],
      "budget": 250000
   },
   "movielensId": 1068,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-07-22",
      "dvdReleaseDate": "2005-07-05",
      "directors": ["Edward Dmytryk"],
      "runtime": 86,
      "movieId": 1068,
      "title": "Crossfire",
      "mpaa": "",
      "actors": [
         "Robert Young",
         "Robert Mitchum",
         "Robert Ryan",
         "Gloria Grahame",
         "Paul Kelly",
         "Sam Levene",
         "Jacqueline White",
         "Steve Brodie",
         "George Cooper",
         "Richard Benedict",
         "Tom Keene",
         "William Phipps",
         "Lex Barker",
         "Marlo Dwyer"
      ],
      "imdbMovieId": "0039286",
      "originalTitle": "Crossfire",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "y0E65ANqbO0",
         "Qf_tJx9SwMk"
      ],
      "plotSummary": "A man is murdered, apparently by one of a group of soldiers just out of the army. But which one? And why?",
      "tmdbMovieId": 28120,
      "avgRating": 3.66066,
      "releaseYear": "1947",
      "numRatings": 361,
      "posterPath": "/bF2FY0FiUf3daJxuowDKtimN1P9.jpg"
   }
}