{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "lover (female)",
            "id": 1808
         },
         {
            "name": "planned murder",
            "id": 3152
         },
         {
            "name": "femme fatale",
            "id": 9016
         },
         {
            "name": "hallucinogenic drug",
            "id": 11528
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "beach house",
            "id": 34145
         },
         {
            "name": "private detective",
            "id": 155790
         },
         {
            "name": "philip marlowe",
            "id": 155860
         },
         {
            "name": "film noir",
            "id": 195402
         },
         {
            "name": "sedation",
            "id": 213815
         },
         {
            "name": "search for truth",
            "id": 222476
         },
         {
            "name": "unfaithful wife",
            "id": 230960
         },
         {
            "name": "tiki culture",
            "id": 234849
         }
      ],
      "imdb_id": "tt0037101",
      "video": false,
      "title": "Murder, My Sweet",
      "recommendations": [
         678,
         25955,
         37992,
         19119,
         26744,
         14638,
         20367,
         21454,
         28120,
         22112,
         14580,
         20482,
         18671,
         43461,
         17645,
         17221,
         1841,
         16703,
         32961,
         19974
      ],
      "backdrop_path": "/fH4mbyzwDi9xDkriECC94tshpUV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Philip Marlowe",
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a067",
               "name": "Dick Powell",
               "profile_path": "/iVJ0rGS0hSfkMmj26jbdLFcgbsN.jpg",
               "id": 19328,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Helen Grayle/Velma Valento",
               "gender": 1,
               "credit_id": "52fe4319c3a36847f803a05f",
               "name": "Claire Trevor",
               "profile_path": "/6RMb6vmgxfTpSWF7fggD0kYnP19.jpg",
               "id": 14965,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Ann Grayle",
               "gender": 1,
               "credit_id": "52fe4319c3a36847f803a063",
               "name": "Anne Shirley",
               "profile_path": "/vqwHzjBgV8wlWUi1cATSXCHV0bA.jpg",
               "id": 19327,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Moose Malloy",
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a077",
               "name": "Mike Mazurki",
               "profile_path": "/s1alibwL5JiBhBNZQGiN91Hccc3.jpg",
               "id": 84229,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Mr. Grayle",
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a06b",
               "name": "Miles Mander",
               "profile_path": "/bdpwtvVZjOgkaOXXA38tfYuiBT5.jpg",
               "id": 19329,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Jules Amthor",
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a073",
               "name": "Otto Kruger",
               "profile_path": "/i7S1SCl57AapOJ70S24HOjkHarZ.jpg",
               "id": 4071,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Lindsay Marriott",
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a06f",
               "name": "Douglas Walton",
               "profile_path": "/tRk01D9crSmSeqnP0DK7G9blRB5.jpg",
               "id": 2928,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Police Lt. Randall",
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a07b",
               "name": "Donald Douglas",
               "profile_path": "/wD8T5t6cICiWHNkKe3sbXGBbX8G.jpg",
               "id": 96257,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Jesse Florian",
               "gender": 1,
               "credit_id": "5699b5c19251412b0900007b",
               "name": "Esther Howard",
               "profile_path": "/v57CDLl7wDvTCtbXph6XjrysMxU.jpg",
               "id": 85997,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4319c3a36847f803a03d",
               "name": "Adrian Scott",
               "profile_path": null,
               "id": 19322,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a049",
               "name": "Raymond Chandler",
               "profile_path": "/7YEDJ0u0JVcA2XETAtLHDbme2rf.jpg",
               "id": 12493,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a04f",
               "name": "Harry J. Wild",
               "profile_path": null,
               "id": 11442,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a055",
               "name": "Roy Webb",
               "profile_path": null,
               "id": 4345,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a05b",
               "name": "Joseph Noriega",
               "profile_path": null,
               "id": 19325,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4319c3a36847f803a081",
               "name": "Edward Dmytryk",
               "profile_path": "/s7E1zzpOeg7VBmLjA9MBgl2jizD.jpg",
               "id": 64114,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4319c3a36847f803a087",
               "name": "John Paxton",
               "profile_path": null,
               "id": 132577,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "573e57c5c3a3687ae600047c",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "5a9562260e0a260872008878",
               "name": "Sid Rogell",
               "profile_path": null,
               "id": 98968,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a9562419251413273008505",
               "name": "Carroll Clark",
               "profile_path": null,
               "id": 3255,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5a95624dc3a368120800914a",
               "name": "Albert S. D'Agostino",
               "profile_path": null,
               "id": 4349,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a9562570e0a26086c008695",
               "name": "Michael Ohrenbach",
               "profile_path": null,
               "id": 1339511,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5a956261925141326c008186",
               "name": "Darrell Silvera",
               "profile_path": null,
               "id": 7338,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5a95626c0e0a26087500976b",
               "name": "Edward Stevenson",
               "profile_path": null,
               "id": 10153,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a95627fc3a3684868004b8d",
               "name": "Bailey Fesler",
               "profile_path": null,
               "id": 14512,
               "department": "Sound",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "5a95628ec3a368120200836f",
               "name": "James G. Stewart",
               "profile_path": null,
               "id": 14513,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "5a956299c3a368124900864a",
               "name": "Vernon L. Walker",
               "profile_path": null,
               "id": 3252,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.713254,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1834,
      "vote_count": 59,
      "budget": 0,
      "overview": "Detective Philip Marlowe is hired by hulking Moose Malloy to locate his old girlfriend that he lost track of while serving time in prison. With each lead he follows, Marlowe encounters lies, larceny, perjury, theft and a beautiful femme fatale. Based on Raymond Chandler's novel \"Farewell My Lovely\", which was also the film's title in the United Kingdom.",
      "similar": [
         910,
         996,
         963,
         14638,
         949,
         320,
         281,
         513285,
         1939,
         2768,
         8512,
         678,
         5236,
         4771,
         829,
         1586,
         37094,
         402,
         189,
         10528
      ],
      "original_title": "Murder, My Sweet",
      "runtime": 95,
      "poster_path": "/7zWUcJejShfLvj9CsfvtSUJuINB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1944-12-09",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "An Original Philip Marlowe Mystery",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edward Dmytryk"],
      "runtime": 90,
      "synopsis": "Marlowe is in a police station, a bandage over his eyes. He explains what happened in a flashback. Moose Malloy comes in to Marlowe's office. He's just got out of prison and wants Marlowe to find his ex-girlfriend, who he's not seen in eight years. Malloy takes him to a place called Florian's, where his ex used to work. They go into the bar. The bar goes quiet as they walk in. The boss comes over and warns them that he wants no trouble. Malloy walks over to a girl in the bar but the boss warns him not to bother the customers. The man throws the boss across the room. Marlowe tries to intervene, but Moose doesn't remember him. The take a couple of bottles from the bar and leave. Malloy tells Marlowe that they were to be married. Her name was Velma Valento. Marlowe traces the wife of the previous owner of Florian's. She appears to be very drunk. She gives him a file of clippings but tries to hide a picture of Valento. Marlowe takes it. Mrs. Florian tells him she's never heard of Moose Malloy and demands that he leave. He does, but then watches her through the window as she makes a phone call, apparently not as drunk as she seemed. Marlowe returns to his office to find Lindsay Marriott waiting in his office. He hires Marlowe to accompany him to a rendezvous to make a business transaction, exchanging a jade necklace for cash. Arriving at the spot, Marlowe gets out to look around. Gun drawn, he walks some distance into the bushes. Finding nothing but a deer, he returns to the car, where he is coldcocked by a blackjack. When he awakens, a woman asks if he is all right, then, apparently recognizing him, runs. Marriott has been killed and dumped in the back seat. Cut to a police station where Marlowe is being interrogated about the murder. They argue and then Marlowe is released, but tell Marlowe they think Jules Amthor is mixed up in this. This time, returning to his office, a woman is waiting. She tells him her name is Miss Allison, but he grabs her purse and finds she is actually Ann Grayle. She tries to storm out but he's locked the door. She tells him the jade belonged to her father. They go to visit her father in a palatial mansion. His wife, a stunning blonde, is also there. He explains that the necklace had been taken from his wife at gunpoint, and retires. Mrs. Gayle tells Marlowe that Marriot had been assigned to buy it back. As they talk, Amthor is shown in. They arrange an interview. Cut to Marlowe's home. Mrs. Grayle walks in behind a laundry boy and gives him a retainer. They go to a nightclub. Miss Grayle is there and talks to Marlowe privately. She offers him more money to make him go away. Moose is there too. He asks Marlowe to come and meet someone, and Miss Grayle disappears before he can make excuses. Moose takes him to a highrise and takes his gun. The person he is meeting turns out to be Amthor. He claims to be a psychic healer that the police are after. Marlowe accuses him of blackmailing women. Amthor thinks Marlowe has the necklace, which he wants. Moose causes a ruckus, wanting Marlowe to tell him where Velma is. They fight and Marlowe is kncked out and drugged, causing hallucinations. He wakes up on a cot. After shaking off the effects of the drug, he escapes, and confronts a doctor, who tells him he's been out for three days. Moose finds him and gets him a cab. Marlowe goes to see Ann. She asks him what happened, and he remembers that she was the girl at the rendezvous.The police come in and Marlowe gives them the story. Marlowe and Ann go back to the mansion and talk to her father. The police have been there, interested in his beach house. Mr. Grayle asks Marlowe to drop the case for money. Marlowe agrees, but tells Ann he's going to the beach house anyway. At the beach house, they find Mrs. Grayle. Ann, angry, leaves to tell her father. Marlowe accuses Mrs. Grayle of having Amthor shake him down for the necklace. She tells him Amthor is blackmailing her after she went to him for treatment. She was supposed to give him the jade, but it was stolen before she could give it to him. She thinks it was Marriot. She asks him to help her kill Amthor to stop him from blackmailing her further, and Marlowe agrees. They plan to lure Amthor to the beach house where Mrs. Gayle will shoot him. Marlowe goes to Amthor's place to set up the plot, but finds Amthor dead with his neck snapped, obviously by Moose. He returns to the office, where Moose finds him. Marlowe tells him the picture was a fake, but that he can take Moose to her. They agree to meet the next day. Marlowe takes him to the beach house and tells him to wait outside for a signal. He goes in to meet Mrs. Gayle, who still thinks the original plan is in place. She gives Marlowe the jade necklace, which she has had all along. She had told Marriot it had been stolen to throw them off the trail. Marlowe accuses her of killing Marriot, and tells her that Moose is waiting outside. She is actually Velma Valento. She had been supporting Marriott, Amthor, and Mrs. Florian with her blackmail money, but Moose's return had fouled the plan, and they were attempting to get rid of Marlowe before he could discover the plot. Mrs. Gayle pulls a gun on him. Ann and her father show up. Mrs. Gayle tells Mr. Gayle to take the gun. He does, but then shoots her. Moose hears the shot and comes upstairs, to see Velma's dead body. He attacks Mr. Gayle. Marlowe dives for Grayle's gun just as he fires, is blinded by the powder, and blacks out. Cut to the police station. Marlowe is wearing a bandage over his eyes. They explain that Gayle and Moose killed each other struggling for the gun. An officer leads him to a cab and he talks about Ann the whole way, without realizing that Ann was there all along. She gets in the cab with him and he realizes it's her. The end.",
      "writers": [
         "John Paxton",
         "Raymond Chandler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037101/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzODQ0NDExN15BMl5BanBnXkFtZTcwNDk4NjIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dick Powell, Claire Trevor, Anne Shirley | See full cast and crew »"],
      "reviews": [
         "\"I caught the blackjack right behind my ear. A black pool opened up at my feet. I dived in; it had no bottom.\"- Phillip Marlowe in MURDER, MY SWEET. There are plenty of bottomless pools in MURDER, MY SWEET, Edward Dmytryk's outstanding noir. Tapping into a direct line to the dark places of the human psyche, the film raises the curtain on one shadowy scene after another. It leads the viewer on a convoluted trip through a very gloomy and treacherous labyrinth where oily con men, pesky cops, scheming ladies, and at least one gargantuan lovesick Romeo put the down-at-heels private investigator through the wringer. Moose Malloy's vanished girlfriend (and a tidy retainer) occupies Marlowe at first. Then, when an expensive jade necklace needs retrieving (with another fat fee offered), Marlowe bites again. But suddenly those too deep pools begin to appear. John Paxton's screenplay has the cast of characters thinking out loud a lot, which helps occasionally. But just as in Raymond Chandler's other overly schematic crime story, THE BIG SLEEP, strict attention must be paid. Yet even if you become confused, you can still revel in Harry J. Wilde's sterling cinematography. (As mentioned in another review, Wilde, along with a slew of other people, including Orson Welles, shot additional scenes for THE MAGNIFICENT AMBERSONS for which he and the others received no credit. As Welles himself intones rather solemnly at that film's conclusion: \"Stanley Cortez was the photographer\"). The really big draw in MURDER is Dick Powell, not just delivering a career-changing performance (and being the first actor to play Marlowe) but also giving the best interpretation of Marlowe on film- and that includes Bogart's fine outing in Hawks' THE BIG SLEEP(1946), Robert Mitchum's two disappointing films, and Elliot Gould's daring 1973 performance in Altman's THE LONG GOODBYE. Powell projects the detective's weary cynicism and dogged determination without any hint of showy mannerism or overplayed toughness. His presence is completely natural and convincing, far from any Hollywood ham acting. In addition, MURDER, MY SWEET presents the polished villainy of Otto Kruger, slithering around Powell with his characteristic reptilian menace; Anne Shirley as a spunky good girl who brightens the gloom somewhat; and, on the femme fatale side, the high voltage glare of Claire Trevor, laminated in heavy make-up like a pricey, megawatt doxy. Literally towering over everything is Mike Mazurki's Moose (far more effective than Jack O'Halloran's catatonic trance in Mitchum's FAREWELL, MY LOVELY). Mazurki's silent entrance into Marlowe's office at the beginning sets the uneasy mood where huge, powerful forces stir and then emerge from the darkness.",
         "This is the movie that hooked me on \"Film Noir.\" I first saw this on the late show while suffering a killer flu. Even through local TV editing and enough medicine to tranquilize a circus tent, it had me sitting at attention from start to finish. It wasn't until several years later that I got to see it uncut on cable that I got the full effect. Having grown up with Bogart's hard-boiled private eye archetype, Dick Powell was a complete revelation to me. If you double-bill this with Bogart's \"Big Sleep,\" you see at once that Powell truly IS Phillip Marlowe (even Raymond Chandler thought so), and Bogart is much better suited to portray Hammet's colder, meaner Sam Spade. Powell gives Marlowe a vulnerable cynicism as well as a touch of the \"everyman,\" that Bogart wouldn't be able to pull off until later in his career. Powell's background in romantic musicals gives him access to a far deeper emotional range, needed to play the complex and conflicted Marlowe; his cynicism, his humour, his loyalty to his code...it's all there. Powell manages to give extra resonance to some of Chandler's throw-away similes! No wonder he claimed this as his favorite role! The direction by Edward Dmytryk and cinematography by Harry Wild are perfect, giving the film a tight, economical yet alluring vintage \"feel\". Working on a tight budget, they manage to infuse it with all the seedy, chaotic topography that would serve as the touchstones for every film of this type from \"Night of the Hunter\" to \"Blade Runner.\" While this isn't the first Noir film, it may well be the best.",
         "This 1944 adaptation of Raymond Chandler's Farewell, My Lovely, had its title changed so that audiences wouldn't mistake it for a musical! One might think that this would mean that the movie was off to a bad start, especially since the chief reason for the title change was that the actor who was cast in the hard-boiled lead, Dick Powell, was best known as a singer. As things turned out, the film was a huge hit and Powell changed his screen image forever, from crooner to tough guy, and enjoyed an upturn in his career as a result. Producer Adrian Scott, director Edward Dmytryk and screenwriter John Paxton also saw their fortunes rise, but in their case the success was short-lived, as they all suffered during the Hollywood blacklist. As to the movie itself, it has become for many the definitive film noir. Produced on a tight budget on the RKO lot, it was made at the right place, the right time, at the right studio, and with the right people. This is a movie for night owls, maybe the ultimate night owl movie, since there's scarcely any daylight in it, and when there is, the action moves sensibly indoors almost immediately, as if to avoid the glare of the sun. Night-time L.A. has never looked more seductive than here, with every bar, office, nightclub and bungalow seemingly shrouded in mystery, as if harboring secrets it's loath to reveal. Harry Wild's photography is brilliant, and while he and director Dmytryk often go for flashy, arty effects, they're always appropriate, and seem at all times the way detective Philip Marlow, who narrates the story, would want it to be told, as he's a rather glib fellow with an offbeat sense of humor. The dialogue, much of it lifted from Chandler's novel, is excellent and at times quite funny, though some of the author's best lines (such as his description of Moose Malloy as at at one point being \"about as inconspicuous as a tarantula on a slice of angel food\") are absent. The plot, concerning the attempt of the aforementioned, hulking giant, Moose Malloy, to find his old girl-friend, having just served a stretch in prison, is convoluted and hard to follow. But the tale matters less than the telling, and the way it's told is what makes the movie so effective. Chandler was not a great one for plots, as one reads his books primarily for the writing, not the stories, and Dmytryk and his associates wisely follow this aesthetic, emphasizing odd bits of business, visual and verbal, often taking the movie in strange directions, making what one normally thinks of secondary aspects of a film the main event. There's a confidence in this approach, every step of the way, as the men behind the cameras knew just what they were doing. My only serious complaint has to do with the way the character of quack psychologist Jules Amthor is written (\"I'm a quack\"), which ought to have been more subtle, especially with such a sterling actor as Otto Kruger playing the role. Murder, My Sweet is not without its flaws, but it wholly succeeds where it counts: making nocturnal L.A. and its inhabitants both larger than life and dream-like. The confrontation at the beach-house near the end has a dream logic to it, with Malloy, whom we had almost forgotten about, turning up, rounding out the story with a kind of poetic justice, or rather injustice, that is devastatingly effective. Dick Powell is as far as I'm concerned the best Marlow of all, as he nicely turns his musical comedy slickness into a smart-alecky private eye. That Powell is always \"on\", in a way that, say, the more sincere Bogart or Ladd wouldn't be, works in the movie's favor, and while I wouldn't say that he sings his lines exactly he delivers them with a singer's precision and sense of timing. Claire Trevor's femme fatale is as good as anything Stanwyck ever did. I like the affected, upper class accent she uses, especially early on. Anne Shirley is okay as her stepdaughter. Mike Mazurki's Moose, who sets the story in motion, is a forbidding figure, turning up when one least expects him, his presence can be felt even when when he isn't there, as he spurs Marlow, and the film, on, like an ugly god.",
         "Private dick Phil Marlowe is hired by a \"paltry, foppish man\" to accompany him on a midnight assignation. What follows is a glorious piece of Chandleriana, a ganglion of a plot involving a jade necklace, a jailbird who carries a torch for a showgirl, a \"big-league blonde\" with a rich old husband and an eye for private eyes, and more narrative twists and turns than a Restoration comedy on acid. Will Moose be reunited with Velma? Who's the brunette in the gulch? What is Anthor's precise relationship with Marriott? How many more times can Marlowe get slugged from behind without having his skull disintegrate? Golden tenor Dick Powell may not be the obvious choice to play Marlowe, but in fact he turns in THE definitive performance. Chandler once defined the ideal hero in one of his essays as a special man, but at the same time a man of the people. Not amazingly bright, subject to bouts of confusion and wrong-headed wilfulness, but for all that a tough, decent, dry-humoured guy who just happens to be as sexy as hell. Powell delivers. Watch out for a remarkable dream sequence after Marlowe is forcibly injected with heroin (yes, heroin). Expressionist cinema was never as evocative as here! All in all, the film is an example of a genre captured at its apex - \"like lighting a stick of dynamite, and telling it not to go off\"!",
         "When I was a lad back in the 1950s I saw one of those Warner Brothers Busby Berkeley items on television and my father remarked that was Dick Powell. I thought he was pulling my leg, that sappy tenor singing those love songs, Dick Powell? I was used to the Powell who hosted Four Star Playhouse and acted in them every so often. My reaction was the reverse of what the movie going public must have thought back in 1944 when Murder My Sweet was released. Here was Dick Powell, no make up, a five o'clock shadow, and a voice down an octave and very cynical and jaded as Philip Marlowe. Raymond Chandler's private detective has been hired by two people, Gargantuan Mike Mazurki to find his missing girl friend and lovely Claire Trevor to locate a stolen jade necklace. The coincidences keep piling up and it's obvious the two cases are related, but how. That you have to watch the movie for. Powell was some revelation as Philip Marlowe. He considered himself very lucky to finally escape typecasting as so very few in Hollywood do. It would have been nice to have been in the Oscar sweepstakes, but in 1944 no one was going to beat Bing Crosby out that year for Going My Way. Another singer/actor who escaped from musicals and lengthened his career was John Payne. I can't think of any others. Claire Trevor also broke some casting mold here. Usually she played good time girls, but with a heart of gold. From Stagecoach, Key Largo, Honky Tonk and Man Without a Star, those were usually her type role. Here she's unredeemably bad, but she has a whole lot of men jumping through hoops for her. I don't think she was ever this bad on the screen ever again. The mores of 1944 dictated that the film not get to specific on certain items. There were references to gay males and lesbians quite explicit that later did appear in Robert Mitchum's version in the 1970s that were exorcised here. But the spirit of Chandler's novel comes through. I'm not sure Dick Powell is the best Philip Marlowe ever on the big and small screen. But he certainly has his champions and I wouldn't want to take sides in that debate. He's just very very good. So good in fact that in the 1950s lots of fans were remarking, was he really ever in musicals?",
         "'Murder, My Sweet' is based on Raymond Chandler's classic detective novel 'Farewell, My Lovely'. The book was later filmed in the 1970s under its original title starring Robert Mitchum. The Mitchum version is actually more faithful, but for some reason nowhere near as entertaining. 'Murder, My Sweet' tones down some of the racial and sexual aspects of the original story (which are included in the 1970s remake), and I'm might be mistaken (it's been a while since I read it), but the Anne Shirley character appears to have been created as a potential love interest for Dick Powell. She seems to have been inspired by a similar character in 'Double Indemnity' (written by James M. Cain and filmed the same year with the help of Chandler). Dick Powell was originally a crooner and casting him as Philip Marlowe was a very strange choice at the time, but it certainly works. Personally I would have preferred to see Robert Mitchum playing Marlowe in this version, but by the 1970s he was too old for the part, and comparing the two versions Powell definitely wins. Claire Trevor is also excellent as one of the definitive noir femme fatales, and her scenes with Powell are compelling. The drug sequence is also very memorable. 'Murder, My Sweet' is one of the most entertaining detective thrillers ever made, and along with 'Double Indemnity' and 'Out Of The Past' one of the very best crime movies of the 1940s.",
         "There were many attempts to recreate on the screen Raymond Chandler's immortal character, Philip Marlowe, and probably the first serious effort was in 1944, with Edward Dmytryk directing\u0085 The film was called \"Farewell My Lovely\" in Britain and \"Murder, My Sweet\" in the United States\u0085 The plot, as always with this genre, mattered far less than the characters and the action: it was sparked when Marlowe was hired to find an ex-convict's girl friend\u0085 This Marlowe was played by Dick Powell\u0085 He made a daring, successful effort to drop his all-singing, all-dancing image, and he was tough enough; but he was a little too charming, a shade too superficial, to suggest the depths and the strengths of the real Marlowe\u0085 Humphrey Bogart was the man to do this above all others\u0085 And he did it superb1y in Howard Hawks' \"The Big Sleep\" in 1946\u0085 \"Murder My Sweet\" is a complex thriller which seemed at the time to demonstrate all manner of strikingly new techniques in a film noir mood, and certainly marked an astonishing transformation in its star... Thirty years later, the second half has a jaded look...",
         "Phillip Marlowe is tired and resting in his office when Moose Malloy comes to visit him and hire him as a private detective to investigate his former lover, Velma, who has gone missing in the past 8 years that Moose has been in jail. Without a great deal of luck early on, Marlowe takes another case, escorting a Mr Marriott. When Marlowe is knocked out and Marriott murdered, things begin to get more confusing. With the police suspecting him of being involved more than he is letting on, Marlowe investigates further, getting involved in other jobs for clients who want to find Moose Malloy for some reason. Murder follows murder as Marlowe finds himself right in the middle of it with only his link to Moose keeping him alive. Having recently seen a strange telling of this story in 'The Falcon Takes Over' I decided to go back and see the most famous version. Of course this actually involves going forward in time (the Falcon did it first by almost two years) but it is certainly a step up in quality as this version is much, much better since in the first version it was used as plot fodder within an existing formula. I have not read the book but for me everything works really well here with the right mix of plot, character and atmosphere. As I have admitted before, I'm not the smartest of men on this earth and, as a result, I do get confused by some of this type of film where the twisty plot is not that well explained (The Big Sleep always has me a bit spun) and here at times I was a bit unsure of who was what, but this comes good by the end and is clear with a satisfying ending to the piece. The atmosphere is tough considering the period and is more effective for being built tough on the characters and not by just writing lots of F words into the script. Dmytryk directs really well with the time honoured shadow and use of music, the camera also moves well even if some of the shots look a bit dated (well \u0096 it has been sixty years this year you know). The characters are well-written and convincing. Marlowe is a dead beat \u0096 cool but not so tough and together that it takes away from his status as being a downbeat. Powell is not someone who leaps to mind when I think about the noir genre but he is very good here and gets the character really spot on. Mazurki makes Malloy his own with a firm performance that shows Moose to be strong but also manipulated by the love he totally believes in. Trevor is very good, as are Shirley and Kruger. The dialogue is sharp and tough and all of them do really well with the lines and the characters they have (making them more than pigeon-holed genre clichés) but the film mostly belongs to Powell. Overall this is a very good film and is miles better than the first filmed version of this story. The film is atmospheric and looks great; the story is not afraid to risk losing the audience and is smart but pulls it all together and didn't lose me totally at any point. The dialogue is tough and quotable and is delivered by a collection of actors giving good performances, headed up by Dick Powell, doing his best to make us think of him first when we think of this story and the character of Marlowe.",
         "One of the early film noir masterpieces! As a major fan of Chandler novels, some of the lousy filmings (e.g. Marlowe, The Long Goodbye)are of a more recent vintage. But they had hit the jackpot with this one. I do not see how those reviewing this film could fail to appreciate it - they are reviewing a film through a post-2000 prism. Set in 1944, censorship was the rule, even the novel had to be careful. Edward Dymtryk, his cast and crew, with a low budget (which helped create the necessary mood!) have done a sensational job transferring the book to the screen. And gambling on crooner Dick Powell is akin today to putting Sean Penn in a musical --- to me he met the challenge brilliantly (although I still hear Robert Mitchum when I read Chandler). Wonderful supporting roles, as with the 1941 daddy of them all, The Maltese Falcon. Best of all, Claire Trevor, her voice, her manner, her style. Bravo lady! Easily 10 of 10.",
         "This is considered one of the classic film noirs ever made and some think THE film noir. In recognizing that before I had seen it, perhaps I was disappointed because I expected more. What I found was a very confusing film, at least in the last third of the movie as everything started to be explained. It almost got ridiculous in the last 10 minutes when Dick Powell (\"Philip Marlowe\") explained the whole story. He talked too fast and it was next to impossible to follow. I guess I will have to view this more often to understand it better, or find someone who can explain it for my feeble brain. The best part of the film was the cinematography, which really comes to life on the DVD. Someone did a very nice job restoring this film. That, and the general dialog by Powell, were fascinating. You could make a short book with all the wise-guy remarks made by \"Marlowe\" in this film - a lot of great stuff. I just wish they had made a simpler story and made it easier for the viewer to digest all the facts at the end."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "This adaptation of the Raymond Chandler novel 'Farewell, My Lovely', renamed for the American market to prevent filmgoers mistaking it for a musical (for which Powell was already famous) has private eye Philip Marlowe hired by Moose Malloy, a petty crook just out of prison after a seven year stretch, to look for his former girlfriend, Velma, who has not been seen for the last six years. The case is tougher than Marlowe expected as his initially promising enquiries lead to a complex web of deceit involving bribery, perjury and theft, and where no one's motivation is obvious, least of all Marlowe's.",
         "In police custody and facing a possible murder charge, private investigator Philip Marlowe tells them his story. He was hired by Moose Malloy, who's been in prison for a number years, to find his girl Velma Valento. Soon after, Lindsay Marriott hires him for protection when he's to meet someone in a secluded area to buy back a lady's jewelry. It doesn't go well and the trouble really starts when Marriott is killed. Ann Grayle is next in line claiming that the missing jewelry belonged to her father and her stepmother Helen. The trail leads him to Jules Amthor - Moose works for him - someone well-known to the police who specializes in putting women in precarious situations and then blackmailing them. Helen Grayle appears to have been his latest victim. Not all is as it seems however.",
         "Malloy, ex detenuto e grosso energumeno, cerca Velma, la propria ragazza. Ingaggia perciò il detective Marlowe. Questi accetta l'incarico e si mette alla ricerca della ragazza, ma si trova in un groviglio di guai. Velma ha sposato un uomo influente, ma è ricattata da Marriot, che, intanto, incarica Marlowe di recuperare una preziosa collana scomparsa. Con l'aiuto di Ann, figlia di Grayle, il detective riesce a ricomporre le fila della intricata trama. Ma non riesce ad evitare la tragedia finale.",
         "After being hired to find an ex-con's former girlfriend, Philip Marlowe is drawn into a deeply complex web of mystery and deceit."
      ],
      "budget": 400000
   },
   "movielensId": 1069,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-12-09",
      "dvdReleaseDate": "2004-07-06",
      "directors": ["Edward Dmytryk"],
      "runtime": 95,
      "movieId": 1069,
      "title": "Murder, My Sweet",
      "mpaa": "",
      "actors": [
         "Dick Powell",
         "Claire Trevor",
         "Anne Shirley",
         "Mike Mazurki",
         "Miles Mander",
         "Otto Kruger",
         "Douglas Walton",
         "Donald Douglas",
         "Esther Howard"
      ],
      "imdbMovieId": "0037101",
      "originalTitle": "Murder, My Sweet",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["CvT-mLR8Eds"],
      "plotSummary": "Detective Philip Marlowe is hired by hulking Moose Malloy to locate his old girlfriend that he lost track of while serving time in prison. With each lead he follows, Marlowe encounters lies, larceny, perjury, theft and a beautiful femme fatale. Based on Raymond Chandler's novel \"Farewell My Lovely\", which was also the film's title in the United Kingdom.",
      "tmdbMovieId": 1834,
      "avgRating": 3.94185,
      "releaseYear": "1944",
      "numRatings": 834,
      "posterPath": "/7zWUcJejShfLvj9CsfvtSUJuINB.jpg"
   }
}