{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "pirate gang",
            "id": 4418
         },
         {
            "name": "puppet",
            "id": 6300
         },
         {
            "name": "treasure hunt",
            "id": 6956
         }
      ],
      "imdb_id": "tt0117110",
      "video": false,
      "title": "Muppet Treasure Island",
      "recommendations": [
         10208,
         14900,
         11899,
         11176,
         10437,
         20910,
         17009,
         11639,
         11164,
         10414,
         26386,
         15739,
         9275,
         19933,
         13353,
         15300,
         10442,
         11933,
         24795,
         22466
      ],
      "backdrop_path": "/op3mNFDlXLZBgLDyxTiM9fU1neo.jpg",
      "revenue": 34327391,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Long John Silver",
               "gender": 2,
               "credit_id": "52fe43c89251416c7501dea1",
               "name": "Tim Curry",
               "profile_path": "/hPyCIUATIvrzPx8ZbsIJ15l5u8u.jpg",
               "id": 13472,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jim Hawkins",
               "gender": 2,
               "credit_id": "52fe43c89251416c7501dea5",
               "name": "Kevin Bishop",
               "profile_path": "/uiRRSgBK05xrjzGecbp2Oz8SYN8.jpg",
               "id": 19996,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mrs. Bluveridge",
               "gender": 1,
               "credit_id": "52fe43c89251416c7501dea9",
               "name": "Jennifer Saunders",
               "profile_path": "/c1qRVTYqUhWd7y2ws426zdyqhln.jpg",
               "id": 12094,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Billy Bones",
               "gender": 0,
               "credit_id": "52fe43c89251416c7501dead",
               "name": "Billy Connolly",
               "profile_path": "/7e1rVdJah2r0DaMpovrhbR2dHPS.jpg",
               "id": 9188,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "533145589251410b48000fdd",
               "name": "Dave Goelz",
               "profile_path": "/hVfv7gsUPDRDFxUk7fyCktIL7Ar.jpg",
               "id": 64181,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Miss Piggy / Fozzie Bear / Sam the Eagle / Animal (voice)",
               "gender": 2,
               "credit_id": "5920e2e99251414ab104bc9f",
               "name": "Frank Oz",
               "profile_path": "/aLH5bYwMIlVxCe4rIDaEsVJqDKn.jpg",
               "id": 7908,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Kermit the Frog / Rizzo the Rat / Beaker (voice)",
               "gender": 2,
               "credit_id": "5920e2fe925141485e0513d1",
               "name": "Steve Whitmire",
               "profile_path": "/47ovNnEHh2fMYjTPH7A3MEAuKdW.jpg",
               "id": 64180,
               "order": 6
            },
            {
               "cast_id": 25,
               "character": "Captain Flint",
               "gender": 2,
               "credit_id": "5abfc6b40e0a264a600322f5",
               "name": "David Nicholls",
               "profile_path": null,
               "id": 1760088,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Calico Jerry",
               "gender": 0,
               "credit_id": "5974ef7dc3a3685e0101aade",
               "name": "Frederick Warder",
               "profile_path": null,
               "id": 1705493,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Easy Pete",
               "gender": 0,
               "credit_id": "5974ef88925141580601aae1",
               "name": "Harry Jones",
               "profile_path": null,
               "id": 121112,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Black Eyed Pea",
               "gender": 0,
               "credit_id": "5974ef96c3a3685da401a998",
               "name": "Peter Geeves",
               "profile_path": null,
               "id": 1220350,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Big-Fat-Ugly-Bug-Faced-Baby-Eating O'Brien",
               "gender": 0,
               "credit_id": "5974efb592514106a8012c91",
               "name": "Jessica Hamilton",
               "profile_path": null,
               "id": 1314585,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Captain Smollet (uncredited)",
               "gender": 2,
               "credit_id": "5a6ac87e9251413b7c000c9d",
               "name": "Kermit the Frog",
               "profile_path": "/g7WvscEncFatDx5dzDcsmZgypah.jpg",
               "id": 1930286,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501deb3",
               "name": "Brian Henson",
               "profile_path": "/m2Bczi1gvhnIYCGp8Fhg2QCPuNf.jpg",
               "id": 65298,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501deb9",
               "name": "Frank Oz",
               "profile_path": "/aLH5bYwMIlVxCe4rIDaEsVJqDKn.jpg",
               "id": 7908,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501debf",
               "name": "Brian Henson",
               "profile_path": "/m2Bczi1gvhnIYCGp8Fhg2QCPuNf.jpg",
               "id": 65298,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501dec5",
               "name": "Jerry Juhl",
               "profile_path": "/cgNumNNGSb5MeN0WIXkkhY0iXGV.jpg",
               "id": 64184,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501decb",
               "name": "Robert Louis Stevenson",
               "profile_path": "/fGEGp5kpR2mhX89XqAJoJQFGeuG.jpg",
               "id": 29533,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501ded1",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501ded7",
               "name": "Michael Jablow",
               "profile_path": null,
               "id": 12940,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "546892b422136e68d50007c5",
               "name": "John Fenner",
               "profile_path": null,
               "id": 1385880,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a4925fcc3a36805d40004e6",
               "name": "Kirk R. Thatcher",
               "profile_path": "/sgljYfPZafNBblpXu7hcUMZk65b.jpg",
               "id": 145446,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a49261a0e0a262db9000583",
               "name": "James V. Hart",
               "profile_path": "/uwRqqSLT3qY2tYJET0uDFUbyiHK.jpg",
               "id": 10295,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 6.887227,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10874,
      "vote_count": 111,
      "budget": 0,
      "overview": "After telling the story of Flint's last journey to young Jim Hawkins, Billy Bones has a heart attack and dies just as Jim and his friends are attacked by pirates. The gang escapes into the town where they hire out a boat and crew to find the hidden treasure, which was revealed by Bones before he died. On their voyage across the seas, they soon find out that not everyone on board can be trusted.",
      "similar": [
         85,
         87,
         89,
         1996,
         2059,
         6637,
         217,
         9326,
         9838,
         10303,
         1995,
         9710,
         17578,
         810,
         9016,
         6646,
         18444,
         564,
         285,
         667
      ],
      "original_title": "Muppet Treasure Island",
      "runtime": 100,
      "poster_path": "/5A8gKzOrF9Z7tSUX6xd5dEx4NXf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Jim Henson Productions",
            "id": 2504,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jim Henson Company, The",
            "id": 6254,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-16",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/1AWd3MM90G47mxtD112gRDxSXY9.jpg",
         "name": "The Muppet Collection",
         "id": 256377,
         "poster_path": "/8Y9fj5XqveOwBqThbwFBPPCF11T.jpg"
      },
      "tagline": "Set sail for Muppet mayhem!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian Henson"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Robert Louis Stevenson",
         "Jerry Juhl"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117110/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0NDU1MDYxMl5BMl5BanBnXkFtZTcwNjgyMTEzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Tim Curry, Billy Connolly, Jennifer Saunders | See full cast and crew »"],
      "reviews": [
         "Although this film has taken quite a beating since its release, I fail to understand why. The songs are catchy, the script is hilarious, and the performances are stellar. Let's start with the music. Whether it's the wonderfully fun \"Cabin Fever,\" the touching \"Love Led Us Here,\" or another one of the wide array of tunes, nobody can say that they are inferior to any other Muppets melodies. The script is full of one liners and clever dialogue that never grows old, delivered by a cast and vocal talents who are incredibly talented. Tim Curry, sinister and wonderful as ever, plays Long John Silver to perfection. Billy Connolly is also worth mentioning, despite his brief appearance in the film. And young Jim Hawkins is just as he should be, albeit surrounded by a crew of muppet pirates. This is my favorite Muppet film, and I think everybody should give it a try and embrace a different sort of humor-filled extravaganza.",
         "Awsome Muppet Adventure. I don't care how many people hate this movie, I still think it's smart, funny, and amazing. The muppets still have it. Though I agree by most by saying it's not the best Muppet movie, it sure beats the hell outta \"The great muppet caper\" (How slow was that movie?!). Tim Curry, the greatest and most under rated musical preformer alive, is at his element here. The music is awsome and his one song (\"Upstage Lads, this is me only number!\") is awsome. This is a good movie. For a pirate movie, and a muppet movie.",
         "Sometimes when you watch a movie you get the feeling that the cast and crew had a fantastic time making it, which makes the movie even better. I got that feeling during Muppet Treasure Island, and as a result it is one of my favorite movies. I thoroughly enjoyed Kevin Bishop's (Jim Hawkins) performance: since I usually find young/child actors to be very grating, that's saying something. The Muppets were, as usual, all very funny. The jokes and asides were too, too funny (like Gonzo finding Henry Kissinger's book Diplomacy' in Captain Billy Bones' trunk), the songs were fun and catchy, and the pace was brisk and exciting. Tim Curry looked like he was having the time of his life playing Long John Silver amidst a sea of Muppets. I had great fun watching his performance. Go watch this movie if there's even a spark of kid in you. You won't regret it.",
         "Wow. Seems like people fall totally on one side or the other when considering this movie. All I can say is that this is my favourite Muppet film (I'm in my 30's). It even edges out the Muppet Movie (just barely). I've found every other film to be annoying and forgettable, but not this one. I've watched it about 30 or 40 times (the joy of having a young child who is hooked on one show :-) I don't get tired of it. Fun songs, Tim Curry is enough to watch the film anyway, good plot. Where else will you hear a name like 'big fat baby-eating O'Brian' ???",
         "I keep thinking these \"Muppet Movies\" are going to be just for little kids but I am usually pleasantly surprised that I enjoy most of them, too. In this one, there were a lot of modern-day expressions and referrals to things that only adults would appreciate. Meanwhile, the special-effects with the puppets is the normal high-quality. Actually, this was my first look at a Muppet film, although I've reviewed several others, so I was downright amazed at what I saw. After I had seen others, and then viewed this one again, it wasn't as appealing. It was okay, but I liked a few others better. As I found with subsequent episodes, Rizzo The Rat and The Great Gonzo had the best lines even though Kermit and Miss Piggy have always been the best-known of these puppet characters. I've never been a fan of Miss Piggy so I was glad to see her with a minor role here. Tim Curry played \"Long John Silver\" and he was entertaining, as was young Kevin Bishop as \"Jim Hawkins.\" The songs were okay: not outstanding, but not bad. There weren't that many and they were brief enough not to interrupt the flow of the story. The movie is a little loud the first 20 minutes but settles down after that.",
         "I'll admit it, the first time I saw this movie, I wasn't impressed. But as I watched it again, it grew on me. \"Muppet Treasure Island\" is a film that grows on you over time. Props go to Tim Curry for his fine job as Long John Silver, and to the entire cast of puppeteers, without who this film would not be possible. The relationship between Silver and Jim is also well-developed, as it is difficult to watch them part at the end. The songs are fun, the ending touching..and of course, humorous! Give this movie another try.",
         "Muppet Treasure Island is a funny spoof of the classic story. Tim Curry stands out, and plays the part of Long John Silver very well. Using the Muppets to play the parts of the classic characters makes it all the more fun. Muppet Treasure Island is by far not the best Muppet film ever, but it is good and enjoyable.",
         "The Muppets, we just got to love them ! Unfortunely, the same can´t be said about many of their movie adventures. Most of them were nothing more than a parade of has been actors and ex-television stars, mixed with a couple of Muppet jokes, singing moments and uninteresting plots. Somehow the idea of mixing the Muppets with real locations and images never worked that great, and so. to me at least, most of the movies got always to a point when i was just bored of watching them. I always found them a bit too long. Even when i was a kid i thought like that. I still love the Muppets on tv, that backstage setting was a brilliant creation and the perfect home to those characters and situations. Even the new television series are good. So i always wished for some good movies with the Muppets, but that never seemed to happen. Untill a couple of years ago, a new one came out. That Christmas one, about the classical story of the Ghosts of Christmas Past and the old Scrooge. This movie restored my faith on the Muppets. I loved it, and this time i thought it was too small. I wanted more ! And i loved that cute sad little bunny hero ! Anyway, then i bought this new one, MUPPETS TREASURE ISLAND, and i think it´s an absolute masterpiece, on what Muppets are concerned. All the \"problems\" the other movies had are gone, and this finaly looks like a great Muppets movie. No more dull scenes, no more boring guests, now it´s got a great storytelling rithm and the perfect pace of a real movie. Funny story, great gags particulary the ones with the rats, fantastic landscapes and scenery, cool songs, and good special effects. It even has Tim Curry in it and a great actor always come in handy. No one plays a fun villain like him. Oh, and it has Miss Piggy, of course. (Sorry Miss, it won´t happen again i almost forgot about you... SPLAP ! Ouch !....) :-) So im glad this movie was made, and i can´t wait to see the next one. So to all of you who think the Muppet movieas are boring to follow, go and see this and forever change your mind. And you so called cool guys, let go of that macho crap atitude, and don´t be afraid to watch a movie filled with puppets. Don´t worry, this is nothing like Sesame Street. (thank god !) :-) A great family movie if ever there was one. A great movie. I want more !",
         "Muppet Treasure Island relies heavily on incongruity, and the contrast between the Muppet world and reality. The directing and music are pure swashbuckler -- the opening sequence is brilliant, with a dark pirate song with sprinklings of straight-faced jest, setting the mood for the film. Many of the gags are cheap shots -- roll is called for Old Tom, Real Old Tom, and Dead Tom, along with Headless Bill (yes, he's headless) and Big Fat Ugly Bug-Faced Baby-Eating O'Brien (a Geena Davis look-alike who barks \"Aye\" in a rough bass). Others are character humor, such as the exchange in which Rizzo laments that they are \"captured by crazed wild pigs and about to be sacrificed hideously on a pagan altar,\" to which Gonzo breathlessly adds, \"Are we lucky or what?!\" Anachronisms abound, such as when Miss Piggy reflects on her dalliances with the murderous Captain Flint and her most recent beau, Long John Silver, who has tied her by the feet and left her dangling at the edge of a cliff. \"You know,\" she muses, \"I'm beginning to see a pattern in the men I date.\" A Greek chorus of tourist rats adds a surrealistic touch of The Love Boat. For all the silliness, characters are still able to develop. Jim's love for Long John Silver is real, and the betrayal cuts to the quick. Their parting scene is heart rending but not overdone. Jim simply chokes out, \"Now take your oars and row away. I don't want to see you again, ever.\" Brian Henson has done his father proud.",
         "Probably the most underrated movie of the last CENTURY, \"Muppet Treasure Island\" is a must see for everyone. Kermit the Frog has a sword fight, for Pete's sake! What fun. The Muppets are hilarious and touching, as usual, the music is catchy, and Kevin Bishop and Tim Curry act and sing beautifully. I especially enjoy the mix of human and Muppet pirates, and the scene with the \"visually challenged fiend.\""
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Family",
         "Musical"
      ],
      "productionCompanies": [
         "Jim Henson Company, The",
         "Jim Henson Productions",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "The Muppets are back into action in another movie based on a novel written by Robert Louis Stevenson. Kermit the Frog and his colleagues go on a warfare against ruthless pirates. They also share their problem-solving journey on sea to rescue a treasure.",
         "After telling the story of Flint's last journey to young Jim Hawkins, Billy Bones has a heart attack and dies just as Jim and his friends are attacked by pirates. The gang escapes into the town where they convince Squire Trelawney to hire out a boat and crew to find the hidden treasure, which was revealed by Bones before he died. On their voyage across the seas, they soon find out that not everyone on board can be trusted.",
         "The Muppets' twist on the classic tale."
      ],
      "budget": 0
   },
   "movielensId": 107,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-16",
      "dvdReleaseDate": "2005-11-29",
      "directors": ["Brian Henson"],
      "runtime": 100,
      "movieId": 107,
      "title": "Muppet Treasure Island",
      "mpaa": "G",
      "actors": [
         "Tim Curry",
         "Kevin Bishop",
         "Jennifer Saunders",
         "Billy Connolly",
         "Dave Goelz",
         "Frank Oz",
         "Steve Whitmire",
         "David Nicholls",
         "Frederick Warder",
         "Harry Jones",
         "Peter Geeves",
         "Jessica Hamilton",
         "Kermit the Frog"
      ],
      "imdbMovieId": "0117110",
      "originalTitle": "Muppet Treasure Island",
      "genres": [
         "Action",
         "Comedy",
         "Music",
         "Family",
         "Adventure"
      ],
      "youtubeTrailerIds": ["KLUdKoCganU"],
      "plotSummary": "After telling the story of Flint's last journey to young Jim Hawkins, Billy Bones has a heart attack and dies just as Jim and his friends are attacked by pirates. The gang escapes into the town where they hire out a boat and crew to find the hidden treasure, which was revealed by Bones before he died. On their voyage across the seas, they soon find out that not everyone on board can be trusted.",
      "tmdbMovieId": 10874,
      "avgRating": 3.19644,
      "releaseYear": "1996",
      "numRatings": 8094,
      "posterPath": "/5A8gKzOrF9Z7tSUX6xd5dEx4NXf.jpg"
   }
}