{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "macao",
            "id": 185077
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0044863",
      "video": false,
      "title": "Macao",
      "recommendations": [
         38964,
         38103,
         27622,
         25407,
         14605,
         42321,
         34752,
         84364,
         37485,
         41553,
         44001,
         49575,
         36635,
         26533,
         59165,
         25549,
         45975,
         35546,
         36461,
         73595
      ],
      "backdrop_path": "/tuSnADcaBbP9YmjdZ8b8Eh2Z0EZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nick Cochran",
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e0413e3",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Julie Benson",
               "gender": 1,
               "credit_id": "52fe44f8c3a368484e0413e7",
               "name": "Jane Russell",
               "profile_path": "/hmGsWi5KQaNlD5b9MFQ5eTYli5v.jpg",
               "id": 11165,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lawrence C. Trumble",
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e0413eb",
               "name": "William Bendix",
               "profile_path": "/38KJrQ1zYIJyB0TzR3e8g3SeXfA.jpg",
               "id": 79246,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lt. Sebastian",
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e0413ef",
               "name": "Thomas Gomez",
               "profile_path": "/7CNFFi9FG1Jc6ngmnZY3MGcK4zx.jpg",
               "id": 18646,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Margie",
               "gender": 1,
               "credit_id": "52fe44f8c3a368484e0413f3",
               "name": "Gloria Grahame",
               "profile_path": "/f4Y0WcGs4UDwRVFD9XYoDg5pclS.jpg",
               "id": 77081,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Vincent Halloran",
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e0413f7",
               "name": "Brad Dexter",
               "profile_path": "/4IJA7Ne7V79VZHjGn5U2FjWwHzW.jpg",
               "id": 14529,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Martin Stewart",
               "gender": 0,
               "credit_id": "52fe44f8c3a368484e0413fb",
               "name": "Edward Ashley",
               "profile_path": "/Bs13GSDR3cjCSsrxKZFBojvFO5.jpg",
               "id": 95013,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Itzumi",
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e0413ff",
               "name": "Philip Ahn",
               "profile_path": "/pVJZ47pTD15MntJUlFe458Mcuhc.jpg",
               "id": 95014,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Kwan Sum Tang",
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e041403",
               "name": "Vladimir Sokoloff",
               "profile_path": "/pbgNdX1vgSLIbB2phKiuOQlTGAi.jpg",
               "id": 14533,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e04140f",
               "name": "Harry J. Wild",
               "profile_path": null,
               "id": 11442,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e041415",
               "name": "Josef von Sternberg",
               "profile_path": "/eWI4ulq0Vm7gmShjDBdb8BuMlUc.jpg",
               "id": 2891,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e04141b",
               "name": "Bernard C. Schoenfeld",
               "profile_path": null,
               "id": 87394,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e041421",
               "name": "Stanley Rubin",
               "profile_path": null,
               "id": 20098,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "573e2d03c3a3681d35000498",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "574f6fb6c3a36841dc000208",
               "name": "Anthony Collins",
               "profile_path": null,
               "id": 95015,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58397b4fc3a36843ef003f0d",
               "name": "Nicholas Ray",
               "profile_path": "/zCtESNygm7exctVxvkBHRT5hbAC.jpg",
               "id": 2765,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.111719,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26282,
      "vote_count": 10,
      "budget": 0,
      "overview": "A man on the run in the Far East is mistaken for an undercover cop.",
      "similar": [
         14638,
         996,
         513285,
         910,
         247,
         37724,
         289,
         426,
         256591,
         599,
         402,
         1092,
         1939,
         9348,
         845,
         678,
         223,
         1834,
         25736,
         22584
      ],
      "original_title": "Macao",
      "runtime": 81,
      "poster_path": "/1hvGaESoUw1nIXOr3mI1hWYmvtr.jpg",
      "spoken_languages": [
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1952-04-30",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "A sultry chanteuse, a hunk on the lam and a fortune in stolen gems",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Josef von Sternberg",
         "Nicholas Ray"
      ],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Bernard C. Schoenfeld",
         "Stanley Rubin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044863/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4OTA1NzIxNV5BMl5BanBnXkFtZTcwODAxMDIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Mitchum, Jane Russell, William Bendix | See full cast and crew »"],
      "reviews": [
         "Josef von Sternberg began Macao (and copped the directorial credit), but Nicholas Ray finished it. Nonetheless, it abounds with Sternberg's branded flounces and fetishes. As in Shanghai Express and The Shanghai Gesture, he trowels on the Orientalism in thick impasto (Sternberg could have made the best Charlie Chan movie of them all). A nighttime chase through the Macao docks opens the movie (to be rhymed near its conclusion): A white-suited European is pursued by knife-throwing Chinese thugs; he falls in the water when one blade finds its mark. A badge filched from him pocket shows him to be a police detective. Into this world of Asian intrigue sails a boat from Hong Kong, just 35 miles up the coast. On it is the motley crew of salesman William Bendix, drifter Robert Mitchum and mysterious woman Jane Russell, who lifts Mitchum's wallet. Sans passport, Mitchum comes to the attention of the Macao police chief (Thomas Gomez), who reports the suspicious stranger to gambling kingpin Brad Dexter. Dexter assumes Mitchum is a cop he knows to be on his way to extradite him back to Hong Kong.... It's a playfully plotted adventure story. Russell gets a gig singing at Dexter's club in eye-popping gowns which actually aren't any more provocative than the black-and-white daytime outfits she traipses around in, wielding a parasol. She fares better than Gloria Grahame, as Dexter's moll, looking washed out and largely wasted (though she puts her distinctive spin on a couple of lines). Mitchum by this time has done this role \u0096 the lippy but laconic reluctant hero \u0096 so often he could do it in his sleep, which, given his hooded eyes, may be the truth of the matter. Macao is an utterly shallow film done with energy and style. The plotting remains perfunctory, but the play of shadows throughout remains transfixing \u0096 especially in the set-piece near the end, again on the dark waterfront, with ropes and nets casting their creepy spell. And the movie provides Russell with one of her few opportunities to flaunt her real, if narrow, talents: in addition to the statuesque figure that caught Howard Hughes' eye, she had spunk and sass. That's what Sternberg saw, and he fell for it. We do, too.",
         "A penniless adventurer (Mitchum) is mistaken for a police detective by the underworld boss (Dexter) of Macao. Meanwhile the real detective (Bendix) uses Mitchum as a decoy to lure Dexter out of the safety of the colony. Sexy Jane Russell is also on hand to give Mitchum more than his share of thrills. A bit of entertaining nonsense. A film which nevertheless is forgotten a few minutes after the end titles. Mitchum,Russell and Bendix all play with the right easygoing charm. Not a great movie but fun anyway.",
         "It's a routine but atmospheric potboiler, and worth a watch if not seen before. I've seen it a dozen times, but I'm a sucker for this kind of hard boiled dark nonsense. \"Shanghai Express\" was much better in all departments from Sternberg in the Golden Age, darker gloomier and more menacing, and is the yardstick I judge his other work from. Co-directed by Nicholas Ray (or was it finished?) \"Macao\" stands out for me from the real routine Hollywood films of the period, the ones that were meant to make a lot of money and did. Brad Dexter's finest film role as the whispering crook, Mitchum sparkles (or rather, snoozes his way through) in his best comedic vein, Russell and Grahame are perfectly decorative, however it's a pity Bendix couldn't have stuck around to the end. Mitchum boarded Macao without a passport and was the only one not searched at Customs - and the slender thread the whole story hangs by is also perpetrated by Thomas Gomez there too. If you, like me liked \"The big steal\" or \"His kind of woman\" you're sure to like this.",
         "'Macao' emerges on screen as a routine exercise in melodrama with a few flashy decorative touches from Von Sternberg's hand... Certainly the ambiance created did not at all suggest that Macao is an exotic, sinful, self-governing overseas territory of Portugal, on the South China Coast... The plot opens with the arrival of a ship in the port of Macao, and aboard are a former American lieutenant in the Signal Corps, who has just lost his passport (Mitchum); a tall tawny brunette (Russell); and a happy salesman (William Bendix)... Just before the boat docks, Mitchum, with a confused romantic involvement, uses up his sexual magnetism, in asking Jane about her past... Jane, a woman who had seen a lot and was not about to be surprised by much, replies: 'I don't warm up to questions when I don't know the answers myself.' Eventually, she reveals that she had formerly been a cigarette girl and photographer at a Miami Beach Club, then was a fortune-teller, and now is coasting along as a singer... Once again Jane's character is introspective but honest and open: 'I was never considered a brain. I'm a creature of moods.' Her philosophy was expressed by these words: 'Everybody's lonely worried, and sorry. Everybody's looking for something. I don't know whether it's a person or a place. But I'll keep on looking.' If Mitchum was impressed by her personality, his unemotional expression gives no indication of such an interest... His sleep-hooded eyes still challenge women to rouse him and make him their own... Upon arriving Jane is rapidly hired by gangster Brad Dexter to sing at his Club Quick Reward, much to the discomfort of his girlfriend and gaming table croupier, Gloria Grahame... Jane, physically glorious, is soon at work, singing to the gambling crowd a version of 'You Kill Me.' Meantime Dexter and his corrupt police intimate friend, lieutenant Thomas Gomez, have been alerted that one of the three new visitors is an undercover police officer sent to bring Dexter back to justice by cheating him into coming outside the three-mile limit of Macao (which has no extradition treaties). The criminal couple assume that Mitchum is the law-enforcer when in reality it is another big fellow... Jane's highlight covers her performance of the song 'One for the Road'... To impress everybody, Jane was wearing a terrific dress...",
         "Bob Mitchum and Jane Russell make for a rugged romantic duo in this crime film set in the Far East, directed by Josef Von Sternberg. In this rather light, watered down noir Russell, as a streetwise nightclub singer matches Mitchum with world weary put down after put down. Director Von Sternberg, whose visual style of the 30's was the envy of Hollywood but had fallen on tough times and was nearing the end of his career, occasionally captures the magic that displayed Marlene Dietrich with such allure and mystery in films like Shanghai Express and Morrocco. The problem is that Dietrich and Russell are different animals. Russell has never looked more glamorous but she doesn't move like Dietrich and her singing scenes make her look a bit like Gilda on steroids. Still, there is a chemistry between her and Mitchum that keeps the film entertaining. The supporting cast offers a comically hammy turn by William Bendix and a somewhat strange, semi-comatose performance by Gloria Grahame. Von Sternberg borrows heavily from his last good film, The Shanghai Gesture in many scenes, but Macao's main strength rests squarely on the broad shoulders of its two stars.",
         "Macao is entertaining and moves quickly (but ends too soon). Mitchum plays his typical laid-back, fearless, charming, unmotivated protagonist. The treat of this movie is seeing Jane Russell sling her one-liners, sing two low octave blues numbers, and saunter around the set. I think she and Mitchum hit it off just fine. The sets and camera work are first rate, but the plot could have used some more development. Since I have to add four more lines for submittal, let me add that the Chinese band was novel (I'm not sure if they were really playing, but it looked like it, and they were having a good time). Also, the blind man sure got around, and I'm glad he didn't turn out to be faking blindness.",
         "Nick Cochran, supposedly an American adventurer and petty criminal, arrives, short of cash and on the run from the United States where he is wanted, in Macao (at this period still a Portuguese colony). Arriving on the same boat is an attractive young woman named Julie Benson. Julie is hired by Vincent Halloran, the local gambling boss, as a singer in his casino-cum-nightclub. Halloran is also wanted in America (for offences far more serious than Cochran's), but cannot be extradited as long as he remains in Macao. Although this is a short film, there is still time enough for the plot to become very complex. A number of the characters are not what they seem. Is Cochran, for example, what he purports to be, or is he really a cop trying to lure Halloran beyond Macao's three mile limit into international waters where he can be arrested? Who is Lawrence Trumble, the mysterious salesman who also appears to have a sideline in stolen jewellery? This is the second film which Robert Mitchum and Jane Russell made together; the previous year they had starred in \"His Kind of Woman\". The two films have much in common beyond the two leading actors. Both have an exotic setting and both feature gambling and a ruthless gangster. The two leads play similar types in both films, Mitchum a seedy, down-on-his-luck character, likable despite his shady past and occasionally cynical exterior, and Russell a sultry glamour girl. There is, however, an important difference between the two films. \"His Kind of Woman\" can be seen as a comic send-up of the crime thriller genre, starting off in the dark, menacing film noir style and then metamorphosing into a comedy action-thriller. \"Macao\" is the genuine article rather than a parody, being for the most part played seriously rather than for laughs, although it the atmosphere is perhaps lighter than in some other films noirs. The difference lies less in the look of the film- \"Macao\" has some striking black-and-white photography- than in the moral atmosphere. Films such as the Humphrey Bogart classics \"The Maltese Falcon\" and \"The Big Sleep\" were notable not only for their dark, gloomy look but also for their tone of moral darkness. The private eye characters played by Bogart struggle to maintain their private integrity in a world of corruption and deceit. In \"Macao\" there is something closer to a traditional morality, with good triumphing over the evil of the ruthless villains. The result is perhaps something of a hybrid between authentic noir and a more traditional adventure thriller, still highly watchable even today. 6/10",
         "Cheeky, compact crime-drama in an exotic locale off the southern coast of China. Former Army Lieutenant Robert Mitchum, on the run from the law, winds up in the gambling and jewel-smuggling town of Macao without his wallet--seems pack-up-and-go lounge singer Jane Russell has fleeced him on the boat coming over from Hong Kong! Luckily, Mitchum becomes friendly with 'salesman' William Bendix, who is actually working to bring in the crime boss responsible for the death of an international police officer. Very tight and entertaining piece doesn't waste any time getting started. Some of the sloppy editing in the early stages fails to shape the scenes, but director Josef von Sternberg makes up for this with quick pacing and colorful asides. As for Russell, she's a stitch either working some very sarcastic dialogue or warbling seductive tunes down at the local gambling house. Gloria Grahame, as the boss's girl, wants Jane outta town fast--and it's easy to see why! *** from ****",
         "The story of Macao seems derived from the famous French film Pépé le Moko (remade in the US with the title Algiers): A criminal is trapped in an intricate exotic town where he can't be arrested and has to be lured out. But it is not the criminal who is at the center of this story - there actually is no center, and there is no real story either. Nonetheless, this movie is worth watching as an enchanting, thought stimulating visual experience. MINOR SPOILERS AHEAD Two famous directors, Josef von Sternberg and Nicholas Ray, worked on Macao, and their talents were not wasted. The set design and the cinematography are wonderful. (The actor's personalities are badly developed, they rather belong to the general scenery). There are many nice little scenes: Robert Mitchum grasping a falling stocking, Gloria Grahame throwing dice with diamond studded gloves, William Bendix getting a shave, Jane Russell throwing scissors at Mitchum and getting at him with a rotating ventilator (the man protecting himself with a cushion). All this happens in a nocturnal world hung with fishing nets, with gently bobbing sampans on dark waters - a spider's web, a big trap in which you never have firm ground under your feet. Jane Russell's character calls herself a \"creature of moods\". She is a kind of an archetype of many Pam Grier-style characters. (She doesn't actually dish out blows but you feel she is longing to). She impersonates a character I guess many a man would rather have her for a big sister than for a lover. In this aspect this movie is sort of ahead of its time. I have the impression that many movies of the late forties and early fifties are full of innuendos. How else one can explain why the casino kingpin and apparently the master of Macao who controls the lives of all the main characters is called Howard? Like the owner of the production company of Macao, notorious Howard Hughes, he controls every move of his employees and seems to be collecting beautiful women. At one moment Russell and Mitchum get into a rickshaw. He is giving her a ride home from the club where she is engaged as a singer. With his usual cool manner he asks her: \"What would Howard say?\" (if he knew I took you home). It must have been fun to poke a little fun at their boss and, possibly, reenacting a piece of reality.",
         "Heh! Masterpiece it ain't, but it's got Mitch and Jane and in my book that's a plenty. Josef Von Sternberg was no stranger creating mysterious dreamscapes of his own making, Shanghai Express and Morocco comes to mind first and in this movie it also shows very much. Fishing nets, artfully bobbing sampans, black cats, exotic bit parts and beautiful Chinese \"high-low\" gamblers in slit skirts. Ahh... mysterious east it is. Unfortunately sum is not as high as parts would suggest and so this particular film leaves you wanting. Mitchum is in his usual mysterious tough guy mode and like a man said nobody does it better, Russell is little bland in the movie but very pleasing to the eye. Bendix is in fine form and it's a shame he doesn't have more screen time and Grahame is completely written down. Shameful thing it is when gals best scene is when she is blowing to the dice. Macao is not a bad movie in any way, but with better script it could have been so much more. If you want to check worthier Mitch & Jane collaboration take a look at His Kind of Woman, that film really rocks! Missed opportunity!"
      ],
      "genres": [
         "Adventure",
         "Crime",
         "Drama",
         "Film-Noir"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "A sultry night club singer, a man who has also traveled to many exotic ports and a salesman meet aboard ship on the 45-mile trip from Hong Kong to Macao. The singer is quickly hired by an American expatriate who runs the biggest casino in Macao and has a thriving business in converting hot jewels into cash. Her new boss thinks one of her traveling companions is a cop. One is -- but not the one the boss suspects.",
         "Nick Cochran, an American in exile in Macao, has a chance to restore his name by helping capture an international crime lord. Undercover, can he mislead the bad guys and still woo the handsome singer/petty crook, Julie Benson?"
      ],
      "budget": 0
   },
   "movielensId": 1070,
   "movielens": {
      "languages": [
         "日本語",
         "广州话 / 廣州話",
         "English"
      ],
      "releaseDate": "1952-04-30",
      "dvdReleaseDate": "2007-01-23",
      "directors": [
         "Josef von Sternberg",
         "Nicholas Ray"
      ],
      "runtime": 81,
      "movieId": 1070,
      "title": "Macao",
      "mpaa": "",
      "actors": [
         "Robert Mitchum",
         "Jane Russell",
         "William Bendix",
         "Thomas Gomez",
         "Gloria Grahame",
         "Brad Dexter",
         "Edward Ashley",
         "Philip Ahn",
         "Vladimir Sokoloff"
      ],
      "imdbMovieId": "0044863",
      "originalTitle": "Macao",
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["lUsRsDs6NCk"],
      "plotSummary": "A man on the run in the Far East is mistaken for an undercover cop.",
      "tmdbMovieId": 26282,
      "avgRating": 3.06154,
      "releaseYear": "1952",
      "numRatings": 65,
      "posterPath": "/1hvGaESoUw1nIXOr3mI1hWYmvtr.jpg"
   }
}