{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "flying",
            "id": 334
         },
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "air force",
            "id": 3779
         },
         {
            "name": "training",
            "id": 4613
         },
         {
            "name": "manitoba",
            "id": 213913
         }
      ],
      "imdb_id": "tt0109823",
      "video": false,
      "title": "For the Moment",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lachlan",
               "gender": 2,
               "credit_id": "52fe46349251416c9104cbdb",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lill",
               "gender": 1,
               "credit_id": "52fe46349251416c9104cbdf",
               "name": "Christianne Hirt",
               "profile_path": "/wRZzP5sHkAHYxBW5rxMzyYXoX6b.jpg",
               "id": 117084,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Betsy",
               "gender": 1,
               "credit_id": "52fe46349251416c9104cbe3",
               "name": "Wanda Cannon",
               "profile_path": "/btdp9evoMcWO7V6oIiwa2QEjsv0.jpg",
               "id": 117085,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Zeek",
               "gender": 2,
               "credit_id": "558f45f5c3a3684e6e000033",
               "name": "Scott Kraft",
               "profile_path": null,
               "id": 170103,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Johnny",
               "gender": 2,
               "credit_id": "558f460b9251415570000118",
               "name": "Peter Outerbridge",
               "profile_path": "/a3OpOcxpBWi30MsgFTYLsWFwFoV.jpg",
               "id": 12978,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Kate",
               "gender": 0,
               "credit_id": "558f462ec3a3684de800462d",
               "name": "Sara McMillan",
               "profile_path": null,
               "id": 1482221,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mr. Anderson",
               "gender": 2,
               "credit_id": "558f463bc3a3685cf900125d",
               "name": "Bruce Boa",
               "profile_path": "/nPCLZTuTfOzSN5CvMnocX3hS92P.jpg",
               "id": 8664,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marion",
               "gender": 0,
               "credit_id": "558f464f9251416489000bed",
               "name": "Katelynd Johnston",
               "profile_path": null,
               "id": 1482222,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Charlie",
               "gender": 0,
               "credit_id": "558f46629251416489000bfc",
               "name": "Tyler Woods",
               "profile_path": null,
               "id": 1482223,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Dipper",
               "gender": 0,
               "credit_id": "558f46789251415a26000083",
               "name": "John Bekavac",
               "profile_path": null,
               "id": 123308,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Proctor",
               "gender": 0,
               "credit_id": "558f468dc3a3685d45001332",
               "name": "Robert G. Slade",
               "profile_path": null,
               "id": 1395428,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Dennis",
               "gender": 0,
               "credit_id": "558f46a5925141557000018b",
               "name": "Kelly Proctor",
               "profile_path": null,
               "id": 1482224,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Anne",
               "gender": 0,
               "credit_id": "558f46b9c3a3684349001c3e",
               "name": "Roxanne Boulianne",
               "profile_path": null,
               "id": 1482225,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Scotty",
               "gender": 0,
               "credit_id": "558f46d29251416489000c52",
               "name": "Robert G. Slade",
               "profile_path": null,
               "id": 1395428,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46349251416c9104cbd7",
               "name": "Aaron Kim Johnston",
               "profile_path": null,
               "id": 117083,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a790694c3a368227301c492",
               "name": "Ches Yetman",
               "profile_path": null,
               "id": 1686095,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 1.117474,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 37218,
      "vote_count": 3,
      "budget": 120,
      "overview": "This Canadian film presents and old-fashioned war time romance.  It is set during 1942 in Manitoba and traces the doomed affair between a young farmer's wife (Christianne Hirt) whose husband is fighting abroad and a dashing Australian pilot (Russell Crowe).  The pilot has come to train in the British Commonwealth Air Training Plan of Canada.  When the pilot, Lachlan, is not training, he is surreptitiously wooing Lill, the farmer's wife.  At the other end of town, Betsy (Wanda Cannon) who supports her two kids by bootlegging, charges for her services.  She gets involved with Zeek (Scott Kraft), an American flight instructor.",
      "similar": [
         424,
         14574,
         228150,
         369885,
         1654,
         1771,
         637,
         5925,
         423,
         857,
         2253,
         16869,
         289,
         613,
         339259,
         1251,
         853,
         10191,
         203833,
         289222
      ],
      "original_title": "For the Moment",
      "runtime": 115,
      "poster_path": "/mtfwuX9dyIKSWcg8hWsrGn8c4jX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1993-10-01",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "A Moment Can Last A Lifetime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Aaron Kim Johnston"],
      "runtime": 120,
      "synopsis": null,
      "writers": ["Aaron Kim Johnston"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109823/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3OTMzMTgzOF5BMl5BanBnXkFtZTcwNDg3MjUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Russell Crowe, Christianne Hirt, Wanda Cannon | See full cast and crew »"],
      "reviews": [
         "For the Moment is a beautiful little film of which few have heard. More's the pity. Filmed in my home province of beautiful Manitoba, Canada, it offers an insight into the experience and emotions of two charming young people who would never have met -- given their geographically separated homelands, Australia and Canada. -- except for the eruption of World War II which created many such alliances. The capital city of Winnipeg hosted a war-time canteen for service men and my aunt was a volunteer there. She had the honour of meeting many young lads -- from the British Empire and allied countries -- who were training at our various camps. Richard Burton was one such and he mentions, in his biography, his training experience. The beach scene was filmed at Grand Beach which was a very popular summer site for young families and young people so it was a pleasure to see it so beautifully used in this film. As others here have mentioned, the various backgrounds lent much to the story. The cast was well chosen and portrayed their characters with respect and sincerity. Thank you for the opportunity to voice my humble opinions here.",
         "This film takes you to another time when there was a different pace to everyday life. We get an idea how families had to deal with the war and how quickly we sent young men off to fight. A very touching look at the past and a reminder that casualties of war don't just happen on the front. Luckily many of us have never had to go through what our great-grandparents, grandparents or parents went through during a war. This film, I think, is a small thank you. Peter Outerbridge looks amazingly like a young Peter O'Toole and Russell Crowe is absolutely charming and as Australian as he can be. It's definitely worth listening to him recite \"High Flight\" and makes me wonder what he might accomplish with Shakespeare.",
         "Very nicely done movie. It does stay in your memory. Better billed as a romance than flying or war, altho the flying parts are realistic and almost error free. Flying buffs like myself will enjoy this movie even if attracted by the airplanes, unless they have no sensitivity or have never been in love. Fun watching early Crowe. He is good and exudes charm. His reading of \"High Flight\" is superb. cheers, Boom",
         "Russell, my fav, is gorgeous in this film. But more than that, the film covers a tremendous range of human passion and sorrow. Everything from marriage to homosexuality is addressed and respected. The film makes the viewer realize that tolerance of other humans provides the route to saving humanity. Fabulous love story between Lachlin and Lil. I replay their scenes over and over again. Anyone who has ever been in love will empathize with these people. All characters are cast and portrayed excellently.",
         "I have just seen this film, and fallen in love with it. There is a little bit of something for everyone, and its a particular free for all when it comes to the romance between Lachlan and Lil. When they are on the beach, I nearly cried... there is the unspoken realization that time is the most precious commodity and it is most evident when they are together. This idea taken from several angles, from marriage to sibblings to finding love in the least conventional of places. The film almost makes you long for that kind of desperation when you know that tomorrow could very well be your last. Crowe was particularly wonderful in his role of Lachlan. I've always had a soft spot for the accent, but I nearly melted with his portrayal of his character. The way this film was shot is also beautiful, with the music, backdrop of the open fields, and superb acting. All together, this is a wonderful film that tugs at all of human emotions.",
         "I enjoyed every moment of this movie, even though I knew they could never really be together. With the life expectancy of a Bomber pilot being only six weeks, It made me feel for all of those women and men back in the 1940's who must have lived this story.",
         "About midway through, a character invokes a bit of romanticism. Life, this person says, is \"a collection of moments; you got good ones and bad ones; they're all special if they stand out ... Once you've had a moment, it stays with you forever.\" Clearly, the thematic intent here is to celebrate each moment of one's life, to cherish it, and then watch it fade away. Russell Crowe plays Lachlan, a charming, Auzzie WWII pilot-in-training who, with his airman buddy, drops by to say hello to the buddy's wife-to-be at her Manitoba farmhouse. And Lachlan takes a romantic interest in the future wife's sister, Lill (Christianne Hirt). The romance between Lachlan and Lill is a bit dreamlike. As the plot moves along, characters express their joy and excitement, their guilt, their disappointments, their dreams, and their fears. Drama arcs high in the second half, and as one moment fades into the next, change brings tears and sadness. Not everyone survives. Production values are high. Cinematography is quite good. The excellent flying sequences evoke a sense of romanticism. Casting and acting are fine. My only real problem is the film's script. After the characters are introduced, the plot seems to go into a holding pattern; not much happens until the second half. Further, the main characters did not really interest me; I could not really identify with them. Also, I was a bit confused on several points; clarifying dialogue would have helped. \"For The Moment\" will appeal to dreamers and romantics. The WWII setting adds a touch of nostalgia. Overall, the story is a bit downbeat and sad, slightly melancholy. It's a well-made film, if you can get interested in the characters and are in the mood for a period piece romance.",
         "For the Moment is a two-hour trailer for a good movie. It's all lead-in; it never peaks, just slowly wanders along. There's tons of character background and lovely scenery--some good acting, too--but it never all comes together with any excitement whatsoever...and suddenly it's over without ever having gone beyond what should be the intro. Think: An expensively-made Hallmark Hall of Fame production. Plenty of longing looks between the two lovebirds, much dialogue that fills time but doesn't advance the story, some 90s political correctness to do with blacks and gays that never could have existed in 1942 rural Canada, guilt for everybody--and you know who the victims are going to be from the first time you see them. On the upside, Russell Crowe is beautiful.",
         "I felt this film - throughout. I waas impressed with Russell Crowe's talent in developing his relationship with Lillie, such a typical Aussie blend of softly softly approach, a bit self depreciating and very persistent. Really loved the cinematography and direction. Pace was just right and the portrayals of nearly all characters was impressive. Gosh, didn't Russell's talent even in 1993 shine! .. and I have yet to see Gladiator.",
         "I became more emotionally attached to this movie than any other I have ever watched. That may be because I can see the characters as my own grandparents, attempting to make sense of a world at war. The ending and use of Pachabel's Cannon are both amazing."
      ],
      "genres": [
         "Romance",
         "War",
         "Drama"
      ],
      "productionCompanies": [
         "John Aaron Features II Inc.",
         "Manitoba Film & Sound Development Corporation",
         "National Film Board of Canada (NFB)"
      ],
      "summaries": ["The story of airmen training in rural Manitoba in the summer of 1942 to go overseas and become bomber pilots in World War II, as well as the romantic entanglements which overcome them while they contemplate life and love in a world at war."],
      "budget": 0
   },
   "movielensId": 1071,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-10-01",
      "dvdReleaseDate": "2004-04-20",
      "directors": ["Aaron Kim Johnston"],
      "runtime": 115,
      "movieId": 1071,
      "title": "For the Moment",
      "mpaa": "PG-13",
      "actors": [
         "Russell Crowe",
         "Christianne Hirt",
         "Wanda Cannon",
         "Scott Kraft",
         "Peter Outerbridge",
         "Sara McMillan",
         "Bruce Boa",
         "Katelynd Johnston",
         "Tyler Woods",
         "John Bekavac",
         "Robert G. Slade",
         "Kelly Proctor",
         "Roxanne Boulianne",
         "Robert G. Slade"
      ],
      "imdbMovieId": "0109823",
      "originalTitle": "For the Moment",
      "genres": [
         "War",
         "Drama",
         "Romance",
         "Action"
      ],
      "youtubeTrailerIds": ["rnpIvNykI3I"],
      "plotSummary": "This Canadian film presents and old-fashioned war time romance.  It is set during 1942 in Manitoba and traces the doomed affair between a young farmer's wife (Christianne Hirt) whose husband is fighting abroad and a dashing Australian pilot (Russell Crowe).  The pilot has come to train in the British Commonwealth Air Training Plan of Canada.  When the pilot, Lachlan, is not training, he is surreptitiously wooing Lill, the farmer's wife.  At the other end of town, Betsy (Wanda Cannon) who supports her two kids by bootlegging, charges for her services.  She gets involved with Zeek (Scott Kraft), an American flight instructor.",
      "tmdbMovieId": 37218,
      "avgRating": 3.31148,
      "releaseYear": "1993",
      "numRatings": 61,
      "posterPath": "/mtfwuX9dyIKSWcg8hWsrGn8c4jX.jpg"
   }
}