{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "supernatural",
            "id": 6152
         },
         {
            "name": "ghost story",
            "id": 156580
         },
         {
            "name": "governess",
            "id": 165468
         }
      ],
      "imdb_id": "tt0055018",
      "video": false,
      "title": "The Innocents",
      "recommendations": [
         31417,
         11772,
         11167,
         931,
         13581,
         22307,
         27130,
         27632,
         11481,
         25508,
         3763,
         16093,
         23439,
         18333,
         28043,
         11773,
         25504,
         28501,
         8740,
         11020
      ],
      "backdrop_path": "/bgJuEW5Mb8SeeNobBkQa6u5kA7D.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "527470a1760ee37c3e070e84",
         "content": "The Innocents (1961)\r\n\r\n \r\n\r\nOh willow I die, oh willow I die... \r\n\r\n \r\n\r\nBased on Henry James' novel, The Turn Of The Screw, The Innocents is a thoroughly absorbing chiller that pot boils with almost unbearably knowing glee as to what it's doing to the viewer. Deborah Kerr stars as Miss Giddens, the lady hired by Michael Redgrave to act as governess to his young niece and nephew. We find ourselves in Victorian England, out on some country estate at Bly Mansion, where the children are angelic and enchanting in equal measure. Yet there’s an eeriness hanging over this place and it starts to seemingly play tricks on Miss Giddens' mind, she thinks she sees and hears things. It's only when she talks to housekeeper Mrs Grose (Megs Jenkins), that she starts to piece things together, but worryingly it's the children that appear to be at the root of the problems. Aren’t they?\r\n\r\n \r\n\r\nKerr is fabulous here, carrying an elegant gait around with her, she does a fine line in borderline hysteria caused by something unknown bubbling away under the surface. Filmed on location at Sheffield Park and Gardens, and the Bluebell Railway in East Sussex, this lovely Gothic chiller does justice to its literate source. Being co-scripted by Truman Capote, William Archibald and John Mortimer, that's really not much of a surprise in truth though is it?! Choosing to play on the viewers imagination more than pandering to shocks, director Jack Clayton superbly creates a sort of itchy like sense of dread. He’s fully aware that here in and around the Gothic abode, it’s more often than not what you don’t see – or think you see - that is more frightening.\r\n\r\n \r\n\r\nAce cinematographer Freddie Francis does a marvellous job with the photography, with deep focus and shadows the order of the day, and with Clayton sharp cutting and dallying with angles; and Georges Auric’s sinister music floating around the estate like some spectral peeping tom, the atmosphere created is akin to claustrophobic foreboding. In many ways it's actually an uncomfortable watch, but for all the right reasons, the themes that rumble away are grim in texture, the question of malevolent evil or otherwise is a constant, and fittingly the finale offers up a shocking denouement that is nigh on impossible to shake off. With great performances from the child actors (Pamela Franklin/Martin Stephens) sealing the deal, The Innocents is one of the smartest and most effective chillers to ever have come out of Britain. 9/10",
         "url": "https://www.themoviedb.org/review/527470a1760ee37c3e070e84"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Miss Giddens",
               "gender": 1,
               "credit_id": "52fe46cc9251416c75083e5f",
               "name": "Deborah Kerr",
               "profile_path": "/snyKI73NycIaXjU4GyxDq92ZRo5.jpg",
               "id": 20141,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Peter Quint",
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e63",
               "name": "Peter Wyngarde",
               "profile_path": "/o6pZQup0Oq6XoGxj9k8LZQ547rk.jpg",
               "id": 22529,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Mrs. Grose",
               "gender": 1,
               "credit_id": "52fe46cc9251416c75083e67",
               "name": "Megs Jenkins",
               "profile_path": "/nGx7nFSU93haAq2AU2e6G5ZdRIY.jpg",
               "id": 47398,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "The Uncle",
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e6b",
               "name": "Michael Redgrave",
               "profile_path": "/eQwqBfCucvLhQIKz23SzN3z6wN7.jpg",
               "id": 7640,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Miles",
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e6f",
               "name": "Martin Stephens",
               "profile_path": "/eqFF3SrUQ2yb0ONGQ96LBMtlEdR.jpg",
               "id": 70447,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Flora",
               "gender": 1,
               "credit_id": "52fe46cc9251416c75083e73",
               "name": "Pamela Franklin",
               "profile_path": "/7ViOYUIPtcPhqRyiTHKVnyzwzyF.jpg",
               "id": 25635,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Miss Jessel",
               "gender": 0,
               "credit_id": "52fe46cc9251416c75083e77",
               "name": "Clytie Jessop",
               "profile_path": null,
               "id": 80463,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Anna",
               "gender": 0,
               "credit_id": "52fe46cc9251416c75083e7b",
               "name": "Isla Cameron",
               "profile_path": null,
               "id": 80464,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "The coachman",
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e7f",
               "name": "Eric Woodburn",
               "profile_path": null,
               "id": 80465,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e2b",
               "name": "Jack Clayton",
               "profile_path": "/6GDPYIXVLTLTyc5mFmfvyh19DI7.jpg",
               "id": 25630,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e31",
               "name": "Henry James",
               "profile_path": "/xR2YUBp0saT4Ss4uRHNWtpBfNnG.jpg",
               "id": 39013,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e37",
               "name": "John Mortimer",
               "profile_path": null,
               "id": 65251,
               "department": "Crew",
               "job": "Additional Writing"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e3d",
               "name": "William Archibald",
               "profile_path": null,
               "id": 80462,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e43",
               "name": "Truman Capote",
               "profile_path": "/rRrTzbxvYAFCq55UopYDnb2aZw4.jpg",
               "id": 1930,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e49",
               "name": "Jack Clayton",
               "profile_path": "/6GDPYIXVLTLTyc5mFmfvyh19DI7.jpg",
               "id": 25630,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e4f",
               "name": "Albert Fennell",
               "profile_path": null,
               "id": 68426,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cc9251416c75083e55",
               "name": "Georges Auric",
               "profile_path": null,
               "id": 2578,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5319d63d92514177b1002885",
               "name": "Freddie Francis",
               "profile_path": "/ljOItnM4paoICjkKHN2M5rQQ1T1.jpg",
               "id": 5629,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56e149bbc3a3680a1a0022e0",
               "name": "Jim Clark",
               "profile_path": "/zT60qm2WTMUzPU0qhsGhUfgguUs.jpg",
               "id": 8970,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56e149dcc3a3680a2900228d",
               "name": "Wilfred Shingleton",
               "profile_path": null,
               "id": 6605,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56e149edc3a3680a260021ef",
               "name": "Sophie Devine",
               "profile_path": null,
               "id": 31060,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "56e14a2dc3a3680a0d001e65",
               "name": "John Cox",
               "profile_path": null,
               "id": 12246,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "56e14a45925141087c001f54",
               "name": "Peter Musgrave",
               "profile_path": null,
               "id": 38362,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 2,
               "credit_id": "56e14a719251410883002113",
               "name": "Ronnie Taylor",
               "profile_path": null,
               "id": 11847,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e14a8d9251410886002063",
               "name": "Jeanie Sims",
               "profile_path": null,
               "id": 1588445,
               "department": "Writing",
               "job": "Script Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e14aa8c3a3680a10001fdc",
               "name": "Gordon Bond",
               "profile_path": null,
               "id": 1432524,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "56e14acc925141087c001f72",
               "name": "Harold Fletcher",
               "profile_path": null,
               "id": 108811,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5aa46be90e0a26074b01738d",
               "name": "Buster Ambler",
               "profile_path": null,
               "id": 13322,
               "department": "Sound",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "5aa46c25c3a3687c06013fa0",
               "name": "Daphne Oram",
               "profile_path": null,
               "id": 1586674,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "5aa46c2dc3a3687c25017213",
               "name": "Daphne Oram",
               "profile_path": null,
               "id": 1586674,
               "department": "Sound",
               "job": "Sound Effects"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 6.011093,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 16372,
      "vote_count": 160,
      "budget": 0,
      "overview": "A young governess for two children becomes convinced that the house and grounds are haunted.",
      "similar": [
         77949,
         409297,
         19592,
         91586,
         561,
         259693,
         288158,
         2655,
         588,
         201085,
         622,
         396422,
         452507,
         416160,
         10014,
         253,
         714,
         1487,
         620,
         646
      ],
      "original_title": "The Innocents",
      "runtime": 100,
      "poster_path": "/qdSlJ3lZITHDva5EI4lQHidZbf5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Achilles",
            "id": 3185,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1961-12-25",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "Apparitions? Evils? Corruptions?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jack Clayton"],
      "runtime": 100,
      "synopsis": "The film begins by showing a pair of clasped hands, and a woman's voice is heard, whispering that all she ever wanted was to help the children, not hurt them, and that more than anything, she loves children. In the first scene, Miss Giddens (Deborah Kerr) is applying for a job as a governess. It is her first position, but the wealthy bachelor interviewing her (Michael Redgrave) is unconcerned with her lack of experience. He values his freedom to travel and socialize and unabashedly confesses that he has \"no room, mentally or emotionally\" for his niece and nephew, who were orphaned and left in his care as infants. His previously employed governess, Miss Jessel, died suddenly less than a year ago and he is desperate to find someone else to teach the children and keep them company. He says that all he cares about is that she accepts full responsibility for the children and does not trouble him with whatever problems may arise. Miss Giddens is instantly charmed by her suave employer and promises to do her best, assuring him that she loves children above all else and that she has an \"imagination,\" making her ideal to work with children. Upon arriving at Bry, the sprawling English estate where The Uncle keeps the children, Miss Giddens hears a woman's voice calling for Flora, the little girl. Moments later, she meets Flora, and is instantly taken with the bright, quirky child. She also forges a fast friendship with Mrs. Groce (Megs Jenkins), the kindly housekeeper. The boy, Miles, is away at boarding school, though Flora delightedly insists her brother is coming home. Sure enough, Miss Giddens receives a letter saying that Miles has been expelled from school because of his bad influence on the other boys. Mrs. Groce says she can't imagine Miles being a bad influence, and when Miss Giddens meets the boy herself, she too feels sure his teachers must have exaggerated. Apart from evading all her questions about his experience at school, she finds Miles as enchanting as Flora. At first he seems polite, composed, and mature -- perhaps even too mature, with his flirtatious flattery toward the pretty Miss Giddens. While tending to the rose bushes the next day, Miss Giddens sees the shadowy figure of a man standing atop one of Bry's towers. When she climbs the stairs to investigate she finds only Miles, playing with the pigeons, who insists he saw no one. On a rainy day Miss Giddens forgoes the day's schooling to play hide-and-seek with the restless children. While searching for them, she sees a woman cross the hall in front of her and disappear. Searching the attic, she stumbles across a photograph of a darkly handsome man, and is gazing at it when Miles sneaks up on her and wrestles her playfully. Miss Giddens tells him to stop, that he is hurting her, but he doesn't stop until Flora bursts in on them and tells Miss Giddens to go hide. She goes to hide downstairs behind the curtains, and through the window she sees a man leering at her. The figure is gone by the time Mrs. Groce comes to investigate her screams. When describing the man to Mrs. Groce, Miss Giddens realizes the man in the window was the same she saw in the photograph. Mrs. Groce explains that the man in the photograph is Peter Quint, who served as valet there before he died, presumably of head trauma from tripping on the stairs outside. She mentions that Miles was intensely devoted to Quint, that he absolutely \"worshipped\" him and trailed him everywhere like a dog, much as Flora latched onto Miss Jessel. Miss Giddens is yet more disturbed when she sees a mysterious woman from across the pond. She is certain that Flora can see her as well, though the little girl evades her questions. When Miles recites a monologue invoking a \"lost lord\" to rise from the grave, Miss Giddens believes this confirms that the children are possessed, and presses Mrs. Groce for more information about Peter Quint and Miss Jessel. Mrs. Groce reluctantly tells her that the two were entangled in a perverse relationship: Quint was physically and emotionally abusive to Miss Jessel, but the more he beat and scorned her the more she seemed to adore him. They were also obscenely indiscreet with their relations, performing sexual acts in plain sight of the other servants and even the children. After Quint's fatal accident, far from being relieved by her tormentor's death, Miss Jessel went into a deep depression and, as Mrs. Groce grudgingly reveals after days of prompting from Miss Giddens, soon drowned herself in the lake where Miss Giddens believes she saw her. Miss Giddens rapidly develops her theory of the children's possession by their former caretakers. She confides to Mrs. Groce that she believes the ghosts of Quint and Miss Jessel inhabit the bodies of the children so they can carry on with their sexual acts. The behaviors she once found charming and precocious in the children she now finds suspicious and unnerving, but is determined to rescue them from this hell she is sure they are trapped in. She tells Mrs. Groce that she must go to see the children's uncle to tell him of the haunting, insisting, before Mrs. Groce can even accuse her of such motives, that this is not a subconscious trick to get the handsome uncle to notice her. However, when Miss Giddens is about to leave, she sees Miss Jessel again, sobbing. Miss Giddens changes her mind then, afraid to leave the children alone with their tormentors. That night from the dark hall she hears unearthly noises, including malicious laughter from the children. When she checks on Flora she finds her at the window, and Flora says there is someone down in the garden. It turns out to be Miles. When Miss Giddens crossly sends him to bed, he cheerfully tells her that he was out of bed because he was afraid he was becoming \"boring,\" being so well-behaved, and hoped to impress her with this small act of rebellion. Miss Giddens then finds a dead pigeon under his pillow, its neck having been snapped. Miles says he plans to bury it the next day, and before Miss Giddens leaves, he kisses her goodnight, deeply and passionately on the lips as a grown man would. The next day, Miss Giddens writes a letter to the children's uncle, and while she is writing it Flora sneaks off. Miss Giddens finds her dancing with an imaginary (or invisible) partner down by the lake. While she is asking Flora how she rowed across the lake by herself, Miss Giddens again sees the figure of Miss Jessel staring mournfully at them from across the lake. Convinced that the children will be freed from the possession if they will only admit what is happening to them and who is doing it, Miss Giddens frantically begs Flora to admit that Miss Jessel is there. Flora begins to scream and cry, calling Miss Giddens wicked and insane. Mrs. Groce comes to investigate and escorts the child to bed. Hours later, Flora is still hysterical, and when Mrs. Groce finally leaves her bedside, she says she can't imagine where Flora learned such obscenities. Mrs. Groce then says that she did not see the figure at the lake and that the children were sweet and well-behaved until Miss Giddens came. Though deeply hurt that her one ally now doubts her sanity, Miss Giddens reminds Mrs. Groce that the uncle left her in charge and orders her to take Flora away and tells the other servants to leave. She feels certain that Miles is on the brink of confessing his ordeal to her and that she must be left completely alone with him. She cannot find her letter to the uncle, and accepts that Miles must have stolen it. When Mrs. Groce asks what she is to tell their uncle, Miss Giddens responds that of course she must tell him the truth, and Mrs. Groce agrees sadly, clearly intending to tell the uncle of Miss Giddens' instability. That night when alone with Miles, Miss Giddens tries to get him to talk about the ghosts, but he is his usual glib self. She then asks again why he was expelled from school, and Miles eventually admits that he frightened the other boys with his strange outbursts of violence and vulgar language. Miss Giddens asks repeatedly who he learned this language and behavior from, tearfully promising that all she wants is to help him, that her caring nature demands her to help others \"even if it hurts them.\" She soon pushes Miles too far, and he begins yelling that she is nothing but a \"hussy\" and laughs maniacally. While he is ranting, Miss Giddens sees Peter Quint's face appear in the window behind him, joining in the boy's laughter. Miles then hurls Flora's beloved pet turtle through the window and runs outside. As Miss Giddens chases him, he trips on the stairs outside and hits his head. Miss Giddens catches up to him and cradles him gently, and he whimpers humbly for her to forgive him. She tells him it's not his fault, that all he has to do is \"say his name\" and it will all be over, she alone will \"have\" him. Miles tries to run away in horror but she catches him and will not stop begging him to say the name. She sees Peter Quint appear standing on the hedge beside them, but Miles does not seem to see him and is screaming that she is insane. He finally shouts Quint's name, and the figure disappears. Miles frantically asks Miss Giddens where she saw him, and then immediately falls to the ground. Miss Giddens again cradles him and assures him that it's over, he is free. She then realizes that Miles is dead. Screaming and sobbing in horror, she then leans over him and kisses him passionately on the lips. The film ends on the image of her clasped, shaking hands, the same image it began with.",
      "writers": [
         "Henry James",
         "John Mortimer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055018/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0MDU4NjIzNl5BMl5BanBnXkFtZTcwOTA1NjAzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Deborah Kerr, Peter Wyngarde, Megs Jenkins | See full cast and crew »"],
      "reviews": [
         "\"The Innocents\" is one of those films that prove subtlety and imagination can be ten times more terrifying than loud noises or things that go bump in the night. There are no raging spirits or escaped madmen here. Nor will you find that stock of today's second rate horror films -- the creature that embodies evil and finds amazingly obscure ways in which to slaughter naughty teenagers. No, this movie scars one's psyche with darkness and silence and possibility, all mingled with its refusal to give the audience an easy answer at the end. Based on Henry James' novella, \"The Turn Of The Screw,\" the story is deceptively simple. An inexperienced governess is hired to care for two orphaned children in an isolated British manor and slowly comes to believe the ghosts of the previous governess and her brutish lover are trying to possess the children's souls. Being a decent woman \"who loves children,\" she fights back the only way she can -- by confronting the evil head on. But the question is, does the evil truly exist...or is it all in her own mind? As told by James, the novella is a startling ghost story, without question. He adds his usual psychological insights to the characters, but never do you doubt the ghosts exist. The defining moment comes when Miss Giddens sees Quint's face in a dark window then later finds a locket bearing his portrait and comes to her realization, \"Oh, he's a ghost!\" But in the movie, Truman Capote and William Archibald reverse this sequence -- she finds the locket first and THEN sees the man's face in the window -- and all simple explanations go out the door. Is Miss Giddens imagining things? Has she become overwhelmed by the responsibility of raising two precocious children without any sort of support from their selfish uncle? Is she merely sexually repressed and immature enough to transfer her crush on the uncle to a boy not even into puberty yet? And what of Flora, Miles' sister? If this is merely sexual repression on Miss Giddens' part, then why does she drag a little girl into the morass? Throughout the film, Miss Giddens offers evidence of her concerns -- a letter received from Miles' schoolmaster that she cannot fully share with Mrs. Grose because the woman cannot read; her awareness that the two innocents in her charge have a far more advanced knowledge of life than children that age normally would; stories told by Mrs. Grose about Miss Jessel and Quint and how they treated the children. So could it be the spirits of two miserable adults have come back to reclaim life in the persons of Miles and Flora? It could go either way. There is not one wrong moment in this movie. Not one. The first time I saw it was in New York City on a double bill with \"The Haunting\" (1963), a \"things that go bump in the night\" kind of movie. The audience and I howled through that one, it was so much silly fun. And we chuckled through the first ten minutes of \"The Innocents\" (especially when Mrs. Grose tells Miss Giddens, \"I'm SO glad you're here,\" with a little quiver in her voice), but by the end of that film (and I use the word \"film\" deliberately), the entire theater was dead silent. Any film that can shut up a room full of rowdy New Yorkers has got to be damned good. So...is \"The Innocents\" a ghost story or psychological study? Who can say? And to be honest, who cares? It is, at the very least, a damned good movie...and at the very best, a horror story that makes \"The Shining,\" \"Rosemary's Baby,\" \"The Others\" and even \"Psycho\" (a movie I love) look like the works of children. That this film is not available on DVD is a travesty.",
         "All great films engage us to lesser or greater degree: some emotionally, some intellectually -- a few, equally. No film in history, to my memory, seduces the viewer into actively co-creating the piece as it unreels, as does \"The Innocents.\" Immediately, vividly, and subtly, it arrests then implicates the viewer in every frame. Its first \"image,\" in fact, is a blank (black) screen -- and the haunting sound of a child's song. Instantly, viewers unconsciously react, emotionally (as to all music), to the beguiling yet off-putting song and the voice. Emotional tension, established immediately. Yet, one's mind never stops producing thoughts and images. So, without any visual cues from the screen, the haunting song produces images in viewers' own minds -- each no doubt different. Already, then, viewers are seduced into supplying their own mental images and, whether they know it yet or not, have been brilliantly and subliminally placed in the Deborah Kerr role. This, before a single production credit has appeared. We are watching a shadow: a nothing. And our minds demand we fill it with something. Thus does Jack Clayton's astonishing \"The Innocents\" begin. Certainly, other films have used the same opening device. But none with \"The Innocents'\" payoff. For, as it develops (based on Henry James', \"The Turn of the Screw\"), \"The Innocents'\" themes are, \"What do you see? What do you believe is true? Is it? Who is 'innocent?' The children? The nanny? You?\" The emotional undertow is inescapable, perhaps more so because two-thirds of the trio of protagonists are \"children in peril,\" always a surefire hook. But \"in peril\" from what, exactly? Deborah Kerr's possible paranoia / schizophrenia? Ghosts? Or our own powerful, perhaps lurid, imaginings of what may or may not have happened to these children from their deceased and perhaps sexually perverse tutors? The children's memories or imaginings of what did or didn't happen? The film unfolds with some of the most beautiful cinematography in history (Freddie Francis). \"The Innocents\" requires full-size screening, or at least letterboxing to fully appreciate the visual poetry supporting the suspense. Jack Clayton's production and direction rank among the finest in screen history. The miraculous work he pulls from his cast is uniformly jaw-dropping. Despite Deborah Kerr's ravishing natural beauty, one never recalls even a single performance in which she was \"Deobrah Kerr\": she was always the character -- whether a nun (\"Heaven Knows, Mr. Allison\"), an adulterous sexpot (\"From Here to Eternity\"), a Tennessee Williams underdog (\"Night of the Iguana\"), a strong-willed soprano-singing teacher (\"The King and I\") or a romantic comedienne (\"An Affair to Remember\"). Contrast Kerr's beauty, talent and career with Elizabeth Taylor, say. Equally ravishing, one was always aware of watching Miss Taylor \"act.\" Even in stunt casting, like her Martha in \"Who's Afraid of Virginia Woolf?\" or the debacle of \"Cleopatra.\" Miss Kerr is the real thing. So are Megs Jenkins (Mrs. Grose), Martin Stephens (Miles) and Pamela Franklin (Flora). The story and filming progressively grow more audacious, until the last heartbreaking sequence between Kerr and young Stephens. By then, of course, our hearts and minds are so thoroughly complicit in the goings on that the final cry heard on the soundtrack, before we are left again in the blank, black void of our own hearts and imaginings at all we've just lived through, before credits begin to roll, leaves us with perhaps the most haunting of all cinematic experiences. Why? Because we have made the film as it went along, as fully involved as any character in it -- our own minds contributing all that's unspoken and unseen. \"The Innocents\" is the \"Citizen Kane\" of its genre. And like \"Citizen Kane,\" it transcends genres. This is an immortal achievement by a team of filmic artists at their peaks. A revelation of what film can be.",
         "What makes a good chiller? Gore, special effects? No, as director Jack Clayton proves here, it's atmosphere, combined with the sounds of horror, that makes the difference. Granted, I've seen just about every Elm Street and Friday the 13th instalment, but \"The Innocents\" proves that what you don't see can scare you the most. Deborah Kerr is in fine form as an English governess who is sent to a remote mansion in the country to look after two young orphans. Their \"uncle\" in London doesn't have time for them. Kerr slowly begins to realize there's something not quite right with the young boy and girl. Their thoughts and actions are not consistent with the behavior of pre-teens. There's a dark secret, and Kerr sets out to discover it. We do see the ghosts, but it's when Kerr searches the house for the sources of strange noises and voices that we really feel a chill. \"The Innocents\" also makes great use of its black and white photography. I can't imagine it working as well in color (are you listening, Gus Van Sant?). Shadows just seem creepier in black and white. The children are well played by Martin Stephens and Pamela Franklin. Franklin was 11 when she made this film, and as an adult she would go on to star in another excellent haunted house movie, \"The Legend of Hell House.\" It's a shame that Hollywood has stopped making movies like \"The Innocents.\" Perhaps audiences used to Halloween-style slashers, \"Scream\" and \"I Know What You Did Last Summer\" would be demanding blood and guts. Yes, \"Scream\" was, pardon the pun, a cut above. It raised the slumping horror bar to new heights, and then \"I Know...\" ran under that bar, but that's another story. If you want genuine chills rather than cheap thrills, you can't do much better than \"The Innocents.\"",
         "Miss Giddens, an uptight but pretty young woman, takes a job as a Governess for two orphans on a grandiose estate in the English countryside. Flora and Miles seem like thoroughly innocent and angelic children, but soon, whispers of corruption begin to materialize. Miles is expelled from school for reasons he is reluctant to discuss. Miss Giddens learns of the fate of the prior governess, a masochistic young woman named Miss Jessel who was having an affair with a sadistic man named Quint. Soon, Miss Giddens is seeing the ghosts of the arrogantly handsome Quint and the forlorn Miss Jessel everywhere and comes to believe that the children have been possessed. But is she only imagining these horrors? And will she destroy the children in her attempt to save them? This movie is creepy, claustrophobic and totally paranoid. Filmed in moody black and white with an almost non-existent musical score (other than the chilling song \"Willow Waylee\" sung in a child's voice over the opening credits and throughout the film) \"The Innocents\" is a flawless suspense drama. I hesitate to call it a ghost story, as the presence of the ghosts is never confirmed (or denied, for that matter.) Nor is the sanity of the main character. Is the prim English Governess (played with classic elegance by Deborah Kerr) simply an uptight prude having obscene fantasies, or are the two children she's caring for really possessed by the evil and perverted spirits of the former governess and her sadistic lover? There's no gore, no stupid incidental music, no insufferably adorable children and no happy ending. Unspoken horrors, dark secrets and things that \"decent people\" don't discuss, fill this film with sick shadows and diseased memories. Whether or not the ghosts exist is a moot point by films end. This film is about corruption and perversion. Indeed, there are no \"Innocents\" in this film...only the facade of innocence, a flimsy backdrop of beauty drawn over the ugly, festering truth. But what IS the truth? This film is a masterpiece of dread and still has the power to disturb even some forty years later. I would highly recommend it to ghost enthusiasts and psych majors alike!",
         "Director Jack Clayton's masterpiece is a study of deepest dread. Its horror is the cinematic equivalent of rising damp. Deborah Kerr accepts a job as the governess of two strange children (Martin Stephens and Pamela Franklin) and becomes convinced that they occupy a world haunted by repressed memories and the restless dead. Martin Stephens' performance as the unfathomable Miles is extraordinary. The child projects a physical authority rare for his years. His dialog exchanges with Kerr run the gamut from highly amusing to deeply disturbing. Clayton's greatest achievement is the way he subverts common household settings to the point where they become arenas of fear. The sound design is chilling, conjuring sudden terror and thrusting us into the complex mechanics of the Kerr character's growing paranoia. Strikingly shot and lit, the film is a textbook example of grave cinematic suggestion.",
         "Miss Giddens (Deborah Kerr), a nineteenth century British governess, is appointed to take care of two children, Flora (Pamela Franklin) and Miles (Martin Stephens). Upon arriving at the bleak mansion she meets the housekeeper (Megs Jenkins) and also Flora. Miles arrives a few days later from school. The children seem like little angels but, following a series of bizarre events and examples of the children's wicked impulses, Miss Giddens begins to suspect that all is not what it seems. This dark and atmospheric tale is a wonderful example of how to create an admirable horror movie that, although has violent undertones, features very little violence when all is said and done. \u0091The Innocents' is certainly a psychological horror movie which leaves in doubt how much of the inexplicable happenings are supernatural, and how much is in the mind of the protagonist, Miss Giddens. Director Jack Clayton uses some astonishing visual trickery and ghostly effects to create and maintain a very unsettling atmosphere, almost from the very beginning. A number of effective ghostly apparitions are displayed on screen during the movie from varying distances which gives \u0091The Innocents' a constant, foreboding atmosphere. The way some scene changes blend with the end of the previous scene are rather disconcerting and almost dream like as there are long lingering images, once again, wholly adding to the effect. Some of the dialogue may seem a little unrealistic, but in general the movie is well scripted and features a few very dramatic scenes thanks to some delightfully written dialogue and strong acting performances. William Archibald and Truman Capote both won awards for their script writing. The only real fault with \u0091The Innocents' is how fast the film moves along. Miss Giddens seems to realise the truth of what is happening all too quickly. This does not make \u0091The Innocents' less enjoyable, but it would have been nice to have had an extra ten minutes or so explaining the story to us a bit more. \u0091The Innocents' has a sustained tone of dread throughout the movie. It seems that Miss Giddens is unable to move without being confronted by some spectre or seeing some rather peculiar behaviour exhibited from the children. I'd compare the dark atmosphere with that of \u0091The Haunting' (1963), both movies are comparable in the way they are presented and are both aesthetically pleasing. The acting was of a high standard, though one must forgive the two young performers if they occasionally seemed to overact. Martin Stephens was very good as Miles, playing his sinister part with an awful power, even though the character's superciliousness became somewhat of an annoyance. Megs Jenkins was also delightful as the anxious housekeeper Mrs. Grose. From the moment Mrs. Grose is first introduced the viewer can begin to suspect something. Jenkins came across as a friendly, but scared, woman who is desperate to maintain decorum in the house. A fine performance suited her character marvellously. One must also mention Deborah Kerr's fine performance as Miss Giddens as she played it with the right balance of inquisitiveness and fear. Deborah's dramatic performance certainly helped make this movie fantastic and one sympathises with her deeply as the film ends on the sombre and heartbreaking note that it does. \u0091The Innocents' is an elegant and stylish movie that is certainly worth watching. Fans of \u0091The Omen' and \u0091Village of the Damned' should enjoy this as well as any fan of dark, atmospheric horror. A strong screenplay, fine performances and breathtaking visual trickery make this movie a very pleasing addition to the horror genre and I highly recommend it to all. \u0091The Innocents' was able to scoop a BAFTA Award (British Academy of Film and Television Awards) for Best British Film as well as a BAFTA nomination for Jack Clayton which he thoroughly deserved. My rating for \u0091The Innocents' - 8/10.",
         "They sure don't make movies like this one anymore. This is one of the few horror movies that does not have gory or graphic images in it. Instead, the spooks in this movie are presented in a subtle way....yet, the movie is quite scary. This is the type of horror movie that I like, one in which every now and then you see a frightening image or a startling scene, and that image or scene lingers in your mind. Everything about this movie is haunting. First, there's the song at the beginning: you hear a young girl's voice singing a beautiful yet somber song. Later you hear that song in several scenes in the movie. Second, there's the setting: this movie takes place in a large Victorian mansion with many rooms and passages, while only about eight people live in it....what could be more eerie than that? Then there's the exceptional cinematography. The black-and-white photography is perfect for this movie. This movie would not have been too creepy if it had been done in color. Further, many of the shots were innovative and the lighting was used ingeniously in some of the scenes. Additionally, I liked the way that the director chose to play around with the sound, which brought more of an element of mystery to the movie. In one particular scene, there was a lot of noise initially....and in a split second there was dead silence....then several seconds later, it was noisy all over again (all in the same scene). But what I think is the most interesting thing about this movie is the fantastic performance by Deborah Kerr. It's fascinating to watch her facial expressions in this movie. She demonstrates her character's fear quite well. I also think that the actor who plays Quint is very scary-looking! He has a very sinister look, and it adds to the spookiness of this movie. If you really want to be spooked by this movie, watch it late at night with all of the lights off....dare to watch it by yourself.",
         "The Innocents is a film that has haunted me ever since I first saw it. Staggering, brilliant, masterful, The Innocents is the Rolls Royce of ghost stories. From the unforgettable camerawork by Freddie Francis to the incisive, beautiful direction by Jack Clayton to the brilliant performance by Deborah Kerr, The Innocents works on a thousand levels. This is a film for anyone who truly wants to see brilliance in its purest form. Any director who wants to make a suspense/horror piece that counts, see this film now. If you can, don't see the pan and scan version -- it was shot in black and white Cinemascope and should be viewed that way -- Letterboxed. Let's hope 20th Century Fox put it out on DVD. It is available on Laser Disc is a beautiful letterbox transfer. But if you get the opportunity to see it on a screen -- RUN. A film that lingers in the mind for decades to come. What more could you ask from a film?..............................",
         "Jack Clayton's sensitivity proves it, there is no need of blood and disgust to make a good creepy thriller! I saw many films in my life and I learned to love Bergman, Kubrick, Kieslowski, Leone, Allen, but I really believe that I enjoyed no other film as much as \"The Innocents\"! Outstanding cast and outstanding photographed! The music of Georges Auric is perfect (included an old death-yearning song \"O willow waly\"). If you ever go for a trip to England, go and see the wonderful location \"Sheffield Park Garden in Sussex\". This is not only an intelligent and incredible atmospheric film, it is a weird journey into a spiritual world. And perhaps Clayton's direction went too far, because unfortunately this gem never found an audience! After a novel \"The turn of the screw\" by Henry James. One more tip, if you ever have the chance to see this Cinemascope-film in a movie theater, do it! It really is overwhelming!!!",
         "The Innocents is a masterpiece of atmospheric horror cinema. The obvious influence for 2001's 'The Others', The Innocents portrays themes of paranoia, death and madness; superbly wrapped around a plethora of great performances from the four main leads. The story revolves around an uncle who doesn't have time for the children he has inherited, and therefore hires Miss Giddens (Deborah Kerr) to look after them. When Miss Giddens arrives at the mansion, she first meets Flora, the young girl and is 'enchanted' by the child. A few days later the boy, Miles, arrives at the house after being expelled from school. The fourth lead is made up by the housekeeper, Mrs Grose; played by Meg Jenkins. From the housekeeper, Miss Giddens eventually learns of what happened to the previous occupants of the house, and that's where the fun starts... Martin Stephens (Miles) and Pamela Franklin (Flora) do surprisingly good jobs as the two adorable young children that are the centre of the story. Their characters are portrayed as nice young children, but at the same time there is something sinister about them, and that is where the tale draws a lot of it's suspense and mystery from. Deborah Kerr also shines as the watcher of the children. We know from the outset that her character loves children, which makes her plight believable to the audience when she does all she can to save the children from the evil she believes is haunting them. We never really know what is happening in the movie; the children's viewpoints contradict that of Miss Giddens, and as there is evidence to support what both sides say, along with evidence to support that of the contrary, the mystery is able to build itself through this and that, therefore, along with the empathy we are able to feel for Mrs Giddens due to the nature of her character; the film is able to remain interesting and suspenseful for it's running time. The thing that this film does best is in capturing a dark and foreboding atmosphere. Through the way the story is portrayed and the beautiful cinematography, Jack Clayton is able to create scenes and sequences that are genuinely frightening and suspenseful; less is more rarely works to a great effect, but here it does. The 'ghosts' have very little screen time, but the time they do have is powerful and memorable enough to make it seem like much more. The film's creepy and menacing atmosphere never delves into violence or gore and relies solely on the story itself and the Gothic, atmospheric setting; and that is much to the film's credit. If you liked the slightly later 60's paranoid horror films, such as Carnival of Souls or The Haunting, then this film is definitely one to check out."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Achilles",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "In Victorian England, the uncle of orphaned niece Flora and nephew Miles hires Miss Giddens as governess to raise the children at his estate with total independence and authority. Soon after her arrival, Miss Giddens comes to believe that the spirits of the former governess Miss Jessel and valet Peter Quint are possessing the children. Miss Giddens decides to help the children to face and exorcise the spirits.",
         "Victorian England. Since the death of their parents, adolescents Miles and Flora have been under the guardianship of their wealthy selfish uncle, who admits he has no place emotionally for them in his life. While he lives in London leading his bachelor lifestyle, the children stay at his country estate, the children under the direction of a governess, Miss Jessel. After Miss Jessel passes away, the uncle hires a new governess, Miss Giddens, who admits that this would be her first posting as such, and about which she is nervous. The uncle has only two directions for her: (1) take control of every aspect of Miles and Flora's life, and (2) don't bother him with anything concerning the children. She will only have to care initially for Flora as Miles is away at boarding school. Miss Giddens' first challenge ends up dealing with the news that Miles has been expelled from school for behavior corrupting the other students. Upon meeting Miles, Miss Giddens cannot understand how such a well mannered boy could be expelled, he being overly charming in an overtly mature manner. She also finds Flora to be a lovely child. As time progresses, Miss Giddens begins to feel that something is not quite right at the estate, as she sees visions of a man and a woman on the estate who she has not met and who should not be there according to the housekeeper, Mrs. Grose. She also finds that Miles and Flora exhibit odd behavior at times, especially with each other. She ultimately comes to the conclusion that there was just cause for Miles' expulsion having to do with activities at the estate, and that she needs to bring these issues out into the open to exorcise the demons that affect Flora and most specifically Miles.",
         "In late 19th century England, a woman (Kerr) becomes governess of a small orphan girl living in a lonely stately home occupied only by the child, a housekeeper and a small complement of servants. Her initial misgivings allayed by the child's angelic nature, her anxieties are once more aroused when the girl's brother, equally captivating, is sent home from boarding school for wickedness of some unspecified kind. Eeerie apparitions and inexplicable behavior on the children's part cause her to wonder about the house's history, especially about the fate of the previous governess, Miss Jessel and the former valet, Peter Quint. She fears for the children's souls and for her own sanity. Eventually convinced that there is an unnatural force at work, perverting the innocence of her charges, she sets out to secure the children's salvation by wresting them from its power. Though her struggle reaches a resolution, its real nature and its outcome ultimately remain ambiguous.",
         "A young governess for two children becomes convinced that the house and grounds are haunted."
      ],
      "budget": 0
   },
   "movielensId": 1076,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1961-12-25",
      "dvdReleaseDate": "2005-09-06",
      "directors": ["Jack Clayton"],
      "runtime": 100,
      "movieId": 1076,
      "title": "The Innocents",
      "mpaa": "NR",
      "actors": [
         "Deborah Kerr",
         "Peter Wyngarde",
         "Megs Jenkins",
         "Michael Redgrave",
         "Martin Stephens",
         "Pamela Franklin",
         "Clytie Jessop",
         "Isla Cameron",
         "Eric Woodburn"
      ],
      "imdbMovieId": "0055018",
      "originalTitle": "The Innocents",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "aOsF0S65RR0",
         "wMKtpM7qtfU",
         "YmycuykUclM",
         "q33FVqRlWCo"
      ],
      "plotSummary": "A young governess for two children becomes convinced that the house and grounds are haunted.",
      "tmdbMovieId": 16372,
      "avgRating": 3.82716,
      "releaseYear": "1961",
      "numRatings": 567,
      "posterPath": "/qdSlJ3lZITHDva5EI4lQHidZbf5.jpg"
   }
}