{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "revolution",
            "id": 2020
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "government",
            "id": 6086
         },
         {
            "name": "control",
            "id": 6318
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "tyranny",
            "id": 189433
         },
         {
            "name": "cyrogenics",
            "id": 200802
         },
         {
            "name": "anarchic comedy",
            "id": 236316
         }
      ],
      "imdb_id": "tt0070707",
      "video": false,
      "title": "Sleeper",
      "recommendations": [
         11337,
         11686,
         11302,
         11030,
         11562,
         11485,
         15867,
         12762,
         28384,
         11382,
         8288,
         10849,
         11624,
         9684,
         10440,
         5143,
         11448,
         11610,
         30890,
         2639
      ],
      "backdrop_path": "/wEo1AsdSckokKpP2S9YQRWuSXaH.jpg",
      "revenue": 18344729,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Miles Monroe",
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bbd",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Luna Schlosser",
               "gender": 1,
               "credit_id": "52fe445a9251416c75031bc1",
               "name": "Diane Keaton",
               "profile_path": "/fzgUMnbOkxC6E3EFcYHWHFaiKyp.jpg",
               "id": 3092,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Erno Windt",
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bc5",
               "name": "John Beck",
               "profile_path": "/chrv4q7zhxuv8esZLBpfSBMp3o5.jpg",
               "id": 41269,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dr. Melik",
               "gender": 1,
               "credit_id": "52fe445a9251416c75031bc9",
               "name": "Mary Gregory",
               "profile_path": "/4K4xKpA1ADS2WqX1VGRqCEF4Vo3.jpg",
               "id": 69884,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Herald Cohen",
               "gender": 2,
               "credit_id": "52fe445a9251416c75031c0f",
               "name": "Brian Avery",
               "profile_path": "/2JUIGCOgpAgqbpuWtR9tVQjvJZ9.jpg",
               "id": 30050,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Dr. Tryon",
               "gender": 2,
               "credit_id": "53bb0d3fc3a368662e0000d2",
               "name": "Don Keefer",
               "profile_path": "/fNTZIfb8bPEp3PVipVXojPdso3B.jpg",
               "id": 104630,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Dr. Nero",
               "gender": 1,
               "credit_id": "53bb0d49c3a36866340000ef",
               "name": "Mews Small",
               "profile_path": null,
               "id": 133774,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Dr. Dean",
               "gender": 2,
               "credit_id": "53bb0d56c3a3686638000117",
               "name": "Peter Hobbs",
               "profile_path": "/fiU1PjlNSGp1NeSK8ki5ElF4WQj.jpg",
               "id": 123722,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Jeb Hrmthmg",
               "gender": 2,
               "credit_id": "53bb0d6ec3a368662e0000d7",
               "name": "Spencer Milligan",
               "profile_path": null,
               "id": 107304,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bcf",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bd5",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bdb",
               "name": "Marshall Brickman",
               "profile_path": "/kgFuTadgTSscJPIWuifG1pAZXf3.jpg",
               "id": 10439,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031be1",
               "name": "Jack Grossberg",
               "profile_path": null,
               "id": 68939,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031be7",
               "name": "Charles H. Joffe",
               "profile_path": null,
               "id": 6993,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bed",
               "name": "Jack Rollins",
               "profile_path": "/4zEeD2lPss6tFhgGzMIdoc68VDa.jpg",
               "id": 6994,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bf3",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bf9",
               "name": "David M. Walsh",
               "profile_path": "/iqzK0KjUbH5W2U5XwS3LQZ20RWH.jpg",
               "id": 19129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031bff",
               "name": "O. Nicholas Brown",
               "profile_path": null,
               "id": 16593,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031c05",
               "name": "Ron Kalish",
               "profile_path": null,
               "id": 68942,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031c0b",
               "name": "Ralph Rosenblum",
               "profile_path": null,
               "id": 6848,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.343781,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11561,
      "vote_count": 260,
      "budget": 2000000,
      "overview": "Miles Monroe, a clarinet-playing health food store proprietor, is revived out of cryostasis 200 years into a future world in order to help rebels fight an oppressive government regime.",
      "similar": [
         2048,
         17654,
         19,
         68,
         97020,
         59967,
         19959,
         157336,
         262543,
         8810,
         281,
         39899,
         9739,
         869,
         9693,
         10483,
         17431,
         87101,
         110415,
         83542
      ],
      "original_title": "Sleeper",
      "runtime": 89,
      "poster_path": "/fna6VsLR1EX3cF29Pk2FYZkfsBv.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Rollins-Joffe Productions",
         "id": 13954,
         "origin_country": ""
      }],
      "release_date": "1973-12-17",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Woody Allen takes a nostalgic look at the future.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Woody Allen"],
      "runtime": 89,
      "synopsis": "Miles Monroe, a jazz musician and owner of the Happy Carrot Health-Food store living in Greenwich Village in Manhattan, NY in 1973, is cryogenically frozen without his consent, and not revived for 200 years. The scientists who revive him are members of an underground movement: 22nd-century America seems to be a police state ruled by a dictator, about to implement a secret plan known as the \"Aires Project\" (sic). The underground movement hopes to use Miles as a spy to infiltrate the Aires Project, because he is the only member of this society without a known biometric identity. The authorities catch onto the scientists' project, and arrest them; Miles escapes by disguising himself as a robot. He goes to work as a butler in the house of socialite Luna Schlosser (Diane Keaton). When Luna decides to have her \"robot\"'s head replaced with something more \"aesthetically pleasing,\" Miles has no choice but to reveal his true identity to her. Luna is shocked, frightened, and threatens to turn Miles in to the authorities. In response, he kidnaps her and goes on the run, searching for the Aires Project. Miles and Luna start to fall in love, but Miles is captured and forced to undergo brainwashing. He forgets that he comes from 1973, and becomes a complacent member of futuristic society. Meanwhile, Luna finds a group of commando-rebels and joins the underground movement. The rebels kidnap Miles and force him to undergo reverse-brainwashing, whereupon he remembers his past and joins their efforts. Miles and Luna successfully infiltrate the Aires Project: they learn that the Leader was killed by a rebel bomb ten months previously, and all that survives is his nose. The nose has been kept alive, and the members of the Aires Project, mistaking Miles and Luna for doctors, want them to clone the leader from this single remaining part. Instead, Miles steals the nose and \"assassinates\" it by squashing it under a steamroller. (Source: Wikipedia)",
      "writers": [
         "Woody Allen",
         "Marshall Brickman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070707/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzMzY1MzI3Nl5BMl5BanBnXkFtZTcwOTM4OTYwNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Woody Allen, Diane Keaton, John Beck | See full cast and crew »"],
      "reviews": [
         "A futuristic comedy from Woody Allen in 1973 has him waking up from an operation 200 years later (in 2173) to find society has gone berserk. Clever, witty, and very funny. Allen is hysterically funny as the \"sleeper\" who gets to give history lessons on the 1970s, pose as a robot, and become a revolutionary to be near Diane Keaton. Filled with sight gags galore and great one-liners. The giant vegetables and chicken are funny. And so is the \"1984\" political humor that fits the Bush era better than it did the Nixon era. Also very funny is Allen's extended Blanche du Bois speech. Allen is excellent as is Keaton. John Beck plays a revolutionary. Mary Gregory is the doctor. George Furth is a party guest. Jackie Mason does the voice of the Jewish tailor. A must see.",
         "Woody Allen's films are generally treasured among other comedies because of their wit and charm. Many critics would agree, though, that Allen's earlier films were among his best. One of those movies was a lighthearted film called `Sleeper,' which starred a younger version of Allen and a younger, but always beautiful Diane Keaton. Although `Sleeper' leaves a person in stitches from laughter, its one flaw is that it lacks an ending. But don't let that stop you from seeing this comedy classic. In the end, who cares where it goes because it's just flat out funny. `Sleeper' is the story of Miles Monroe (Allen), who is cryogenically frozen in 1973 after having a procedure in a hospital. He is awoken nearly 200 years later by a group of scientists who want Monroe to help them defeat the leader of their society, as America's future consists of a totalitarian state. While on his adventure through this futuristic world, Monroe meets a beautiful woman named Luna Schlosser (Keaton) who he begins to have a love interest in. The two team up to try to oust their tyrannical government and bring about freedom and prosperity. `Sleeper' was hysterical from beginning to end. The very opening scene shows Monroe covered in tin foil-clearly scientists in 1973 found new and amazing uses for this wonderful kitchen product. As soon as Monroe awakens, he is disoriented, smiling aimlessly into space and walking backwards and into people. Allen's comical blend of intellect and charm shows up soon after. The futuristic society is comprised of people who have no historical references for the events of the past 200 years, as their leader has undoubtedly outlawed certain forms of knowledge that could lead to rebellion. They use Monroe to fill in the historical gaps by showing him pictures of famous twentieth century individuals, such as Joseph Stalin. Monroe provides his own synopsis of their contributions to the world in his own clever way, as he does also for former President Nixon. Allen's writing, direction and performance were hilarious. Rarely do we see writing as clever and sidesplitting in today's comedies. The only other comic director today that could even compare to Allen would be Christopher Guest, whose mockumentary films such as `Best In Show,' and the recent `A Mighty Wind,' have a real source of comedy. Most present comedies are trivial, filled with rehashed jokes that depend more on toilet humor than any form of real wittiness. The film's only problem is that after an hour and a half, it doesn't seem to know what to do with itself. It ends on a clever note about love with the protagonists somehow managing to save themselves, but not really the day. They realize that perhaps the only thing worth fighting for, in the end is love. All in all, `Sleeper' was a very funny farce on science fiction stories, and it cemented Allen's ability to be an engaging and funny in his films. ***",
         "Woody Allen's previous efforts, BANANAS and TAKE THE MONEY AND RUN, were exceptionally funny but very uneven films. His being a bit of an amateur in the film business is pretty obvious in these movies. However, by the time he created SLEEPER, he was a lot more polished and consistent film maker. While this is still a very stupid and sophomoric film, it is very funny nevertheless. While there are occasionally bad moments (such as the giant chicken), they are very few and the humor just keeps hitting you again and again. I particularly liked the Orgazmatron and the history lesson he gives the futuristic professors. This film is slapstick and dopey--exactly the type of film that intellectuals (the audience for most later Allen films) will probably hate. This is Allen for the common man--back when he used to be very funny.",
         "No question that Woody Allen's earliest films were the most unpretentiously humorous, and Sleeper stands out among them. The conception of a frozen Allen waking up centuries in the future allows for plenty of biting satire on America in the 70's, not that we don't have plenty of good old-fashioned slapstick to boot. The bit with the Jewish robot tailors knocks me out no matter how many times I see it (\"o-KAY, ve'll take it IN\").",
         "In this early comedy, Woody Allen plays Miles Monroe, a twentieth century healthfood restaurant owner and jazz clarinettist who is cryogenically frozen after surgery and awoken two centuries later. The America of 2173 is a totalitarian state ruled by an oppressive dictator, and Miles has been reanimated by a group of rebels fighting to overthrow the government. For reasons too complex to set out here, Miles is forced to go on the run disguised as a robot and finds himself falling in love with his new owner, an attractive but intellectually vacant young woman named Luna. The film recounts how Miles wins Luna over to the rebel cause and tells the story of their fight against the regime. Unlike some of Woody's later films, this is a pure comedy. It does not try to explore philosophical issues or to analyse the human condition in the same way as, say, \"Hannah and her Sisters\" or \"Crimes and Misdemeanours\". Although I normally think of Woody as a master of verbal wit, much of the humour in \"Sleeper\" is physical slapstick, based upon (and no doubt deliberate homage to) the comedians of the silent era such as Charlie Chaplin or Buster Keaton. (I particularly liked the scenes where Woody is disguised as a robot and those where the villains are attempting to clone the dictator, killed in a bomb explosion, from his nose). The links with that era are reinforced by the musical score, composed by Woody himself, in a jazz/ragtime style reminiscent of the 1910s and 1920s. The sets, by contrast, are very futuristic, with the clinical glass-and-chromium look of many science-fiction films. The combination of a futuristic theme with a traditional style of comedy is doubtless why the film was advertised under the slogan \"Woody Allen takes a nostalgic look at the future\". This is not, however, simply a pastiche of silent humour like the one Mel Brooks was to attempt a few years later in \"Silent Movie\". This being a Woody Allen film, there is also a good deal of verbal humour, particularly one-liners along the lines of \"I haven't seen my analyst in 200 years. He was a strict Freudian. If I'd been going all this time, I'd probably almost be cured by now\". (As that line suggests, Miles is the typical, neurotically insecure Woody Allen character). As is often the case with humorous science-fiction (such as Douglas Adams's \"Hitchhiker\" books), the humour is frequently used to make satirical points about twentieth-century society as seen from the viewpoint of an imagined future. Contemporary worries about our diet are neatly satirised by a joke about how the science of two hundred years hence has proved that fatty foods and smoking are actually beneficial to health whereas what we now think of as healthfoods are regarded as unhealthy. This joke has remained topical because anxiety about what we eat is, if anything,even greater today than it was in 1973. There is perhaps also a dig at seventies \"radical chic\" as the vacuous conformist Luna becomes an equally vacuous revolutionary. (The plot of \"Sleeper\" seems to owe something to another tongue-in-cheek science-fiction film from a few years earlier, \"Barbarella\", which also dealt with rebellion against a dictator and even featured similar \"orgasmatron\" machines; the star of that film, Jane Fonda, had by 1973 become Hollywood's most famous radical chic actress). The humour of \"Sleeper\" is often directed against figures from the sixties and seventies- perhaps too much so, as this type of humour tends to date very quickly. Some of it is still funny (such as Diane Keaton's Marlon Brando impersonation), but some can now be difficult to understand, particularly for non-Americans. (I had no idea, for example, who Howard Cosell was- apparently he was a sports commentator). That is, however, a minor quibble. Overall, this is an entertaining film and, in places, very funny, combining successfully two very different styles of humour. 7/10",
         "Sleeper is a comedy with one of the wittiest premises I've ever seen. It is a comedy about life in the 22nd century through a neurotic Jewish Brooklynite's cynical eyes. No matter how different things are in the future, his perspective doesn't change, his wry sense of humor stays the same, happily misplaced ragtime music plays over the movie, and old-fashioned sight gags are employed complete with the occasional stepped-up film speed. Allen has always done well playing virtually the same character in all of his movies, but his talent as an on screen comedian is milestoned in this performance. He has the brilliance to mock even the most elusive and unnoticed physical conventions of screen acting, for instance his whispering to Diane Keaton while they pose as doctors in the presence of several people close by. It's a nitpicky sense of humor that contributes greatly to the intelligence behind all of his manic goofiness. Diane Keaton is his match, however, whereas most of his leading ladies usually aren't. In fact, I hold Diane Keaton's performance in Sleeper as her crowning achievement so far that I've seen of her, even beyond her work in the Godfather films. She delivers great laughs. Her highlight is in what is possibly the funniest scene in the entire film, which eventually involves her doing an impression of Marlon Brando. Who would think that Diane Keaton would deliver the most convincing and dead-on Brando impression one has ever seen. While we're on the subject of that particular part of that hysterical scene that I will preserve for you to see for yourself, I must say that most people, even some of the most talented comedians and office/class clowns can hardly come close to mimicking Brando's voice, expressions and mannerisms. Diane Keaton somehow nails it. In Sleeper, she gives one of the funniest performances I've ever seen from an actress. She and Allen are truly one of the funniest comic pairs I've ever seen in a movie. What makes Sleeper so funny is not just the physical comedy but the out-of-the-box, completely unorthodox creativity behind all of the physical comedy. There is a scene where someone slips on a banana peel. But the banana peel is the size of a canoe, as is the banana and all of the electronically preserved fruits and vegetables in this particular place, and Allen is being chased by a futuristic cop and both of them are slipping repeatedly on the peel. The film has robot butlers and maids of the future, and gradually throughout the film some are introduced as robots programmed to act and speak like effeminate gay men and Brooklyn Jewish stereotypes. There is also a great amount of intellectualism and cultural knowledge in even the zaniest of humorous moments in Sleeper, and that is what makes it one of Woody Allen's funniest films and a work of true comic genius.",
         "We are blessed that Woody was around, making movies as interesting as this when he was. Already with this one, he began his vast exploration of movie techniques and devices that would last 25 years or so. The idea is simple in this one: he wanted to use film slapstick from a bygone era. How better to situate that than to move the whole picture into a future era? We have some truly classic stuff here. The banana joke, The mirror joke. The robot pantomime. The acting out of the Jewish dinner (done in later movies too). The inflated man joke. You can find all these in any number of Keaton. Marx, Laurel & Hardy movies. The unifying string of time travel, a romance, the leader and his nose is too weak to make this a solidly recommended outing. And it wouldn't be for a couple years until Woody cared about the cinematography at all. I had forgotten how pretty Diane Keaton was. Very. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "I think I am going to have to rank this as Woody Allen's second-best (and second-funniest) movie... after the unbeatable \"Annie Hall\". Even after having seen the movie 3 or 4 times I still find myself amused by some of Allen's shtick... and his rarely-demonstrated adeptness at physical comedy. So many classic physical bits: riding around in the wheelchair... eating the rubber glove... the future scientists trying to force his slack body into a futuristic vehicle. After this movie Woody started to get a little too cerebral... this was his last attempt at a just-plain-funny movie... and probably his most satisfying of his early comedies... only because there was a sort-of storyline. Woody is cryogenically frozen after a botched operation in the 1970s and is awoken 200 years later to find himself in a repressive Orwellian future. He meets up with a spoiled rich chick (Diane Keaton) and influences her (not really intentionally) into becoming a revolutionary activist.",
         "Although i was only 1yr when this film was made, its still one that i can watch again and again. Woody Allens physical slap stick is brilliant, the scene of him waking up and getting in the wheelchair makes me cry with laughter. I'm not a big Woody Allen fan so i cant compare it to his other movies, but i would strongly recommend this film. Anyone wanting a good laugh should definitely see this movie. It has that innocent feel you get from older movies that still had some standards of censorship. If the film was made today it would probably be crude and crass like American pie. I'm no prude but i feel that this film was made during the best time of movie making, when plot and good acting were more important than special effects and shock tactics.",
         "Slapstick combined with razor sharp dialogue. The film is pure magic, its my favourite comedy and I think it is in my top three Allen films of all time. See it if you like the Marx brothers, Woody is all of them rolled into one in this film, it's utter genius. Woody also plays the jazz music which scores the film, and you know you're in for a treat when hearing the first few bars makes you smile. There aren't many comedies out there which could top this in terms of low budget, gags-per-second ratio, music, and sheer quality. If a film could save your life (as in Hannah and her sisters), it's this one."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Rollins-Joffe Productions"],
      "summaries": [
         "A clarinet player who also runs a health food store is frozen and brought back in the future by anti-government radicals in order to assist them in their attempts to overthrow an oppressive government. When he goes off on his own, he begins to explore this brave new world that has Orgasmatron booths to replace sex and confessional robots.",
         "Health food store owner and wannabe jazz clarinetist Miles Monroe is involuntarily cryogenically frozen in 1973 after a mishap while in minor surgery. His still frozen body is found in 2173, and unfrozen by scientists Drs. Melik and Orva. In unfreezing Miles, the doctors have committed an illegal act in what is now a totalitarian police state, where records of the past have been destroyed and the resulting history unknown. The society is filled primarily of conformists who look to the state's \"leader\" for guidance. The doctors, working with an underground group of revolutionaries based in what is called the Western District, ask Miles to help the revolutionaries infiltrate the state's secret and highly important Aires project. Their rationale is that Miles does not exist in the eyes of the state and thus if captured cannot provide any information to them. In Miles' reluctant journey to the Western District, he co-opts the initially unwilling assistance of one of the conformists, poet Luna Schlosser, in trying both to reach the Western District and avoid capture by the police. As a non-political person who believes that all leaders are self-interested, Miles, even when learning the nature of the Aires project, has the primary goals of staying alive and getting the girl, as he is starting to fall in love with Luna, who may have her own thoughts about love and life in this society.",
         "A nerdish store owner is revived out of cryostasis into a future world to fight an oppressive government."
      ],
      "budget": 2000000
   },
   "movielensId": 1077,
   "movielens": {
      "languages": [
         "English",
         ""
      ],
      "releaseDate": "1973-12-17",
      "dvdReleaseDate": "2000-07-05",
      "directors": ["Woody Allen"],
      "runtime": 89,
      "movieId": 1077,
      "title": "Sleeper",
      "mpaa": "PG",
      "actors": [
         "Woody Allen",
         "Diane Keaton",
         "John Beck",
         "Mary Gregory",
         "Brian Avery",
         "Don Keefer",
         "Mews Small",
         "Peter Hobbs",
         "Spencer Milligan"
      ],
      "imdbMovieId": "0070707",
      "originalTitle": "Sleeper",
      "genres": [
         "Comedy",
         "Romance",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["PcaXIWYDo-4"],
      "plotSummary": "Miles Monroe, a clarinet-playing health food store proprietor, is revived out of cryostasis 200 years into a future world in order to help rebels fight an oppressive government regime.",
      "tmdbMovieId": 11561,
      "avgRating": 3.82838,
      "releaseYear": "1973",
      "numRatings": 7846,
      "posterPath": "/fna6VsLR1EX3cF29Pk2FYZkfsBv.jpg"
   }
}