{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "revolution",
            "id": 2020
         },
         {
            "name": "political activism",
            "id": 2339
         },
         {
            "name": "loser",
            "id": 3090
         }
      ],
      "imdb_id": "tt0066808",
      "video": false,
      "title": "Bananas",
      "recommendations": [
         11485,
         11337,
         8288,
         11561,
         11686,
         12762,
         11030,
         11624,
         11382,
         28384,
         19200,
         9684,
         11562,
         30890,
         2639,
         10849,
         15867,
         10440,
         11448,
         11610
      ],
      "backdrop_path": "/pDQjB6AQFG8lkW1Qc07MXYLEAPv.jpg",
      "revenue": 11833696,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fielding Mellish",
               "gender": 2,
               "credit_id": "52fe44219251416c75029cfd",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe44219251416c75029d01",
               "name": "Louise Lasser",
               "profile_path": "/32K4mhDymJMkm9goQ02cBX6lBFL.jpg",
               "id": 9565,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "General Emilio M. Vargas",
               "gender": 0,
               "credit_id": "52fe44219251416c75029d05",
               "name": "Carlos Montalbán",
               "profile_path": "/ydTvdSVpAP2y9wjJEgSdU9rgmrM.jpg",
               "id": 68934,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Yolanda",
               "gender": 0,
               "credit_id": "52fe44219251416c75029d09",
               "name": "Nati Abascal",
               "profile_path": "/fV96vl7KShw0iUVzGnDVB3MK2ii.jpg",
               "id": 68935,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Esposito",
               "gender": 2,
               "credit_id": "5486d4ed925141760c001426",
               "name": "Jacobo Morales",
               "profile_path": "/hbDBFcGi7klMuowJqCvvGG1s3Y1.jpg",
               "id": 941548,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Luis",
               "gender": 2,
               "credit_id": "5486d508c3a3681d060012b7",
               "name": "Miguel Ángel Suárez",
               "profile_path": "/hhBYWx0Uz4rm2QLwepliCChjjJA.jpg",
               "id": 87743,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Diaz",
               "gender": 2,
               "credit_id": "5486d551c3a3681d000013f8",
               "name": "René Enríquez",
               "profile_path": "/815lsHR69C4OsIdJw2K8QbrsJTi.jpg",
               "id": 237034,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Mrs. Mellish",
               "gender": 1,
               "credit_id": "5486d56d9251417609001573",
               "name": "Charlotte Rae",
               "profile_path": "/t6UyU97bkrGreYvLlUutomhTyIP.jpg",
               "id": 66071,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Dr. Mellish",
               "gender": 0,
               "credit_id": "5486d586925141760f0014f2",
               "name": "Stanley Ackerman",
               "profile_path": null,
               "id": 1396841,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "J. Edgar Hoover",
               "gender": 0,
               "credit_id": "5486d5b69251417609001582",
               "name": "Dorothi Fox",
               "profile_path": null,
               "id": 1396842,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Paul",
               "gender": 2,
               "credit_id": "5486d5cfc3a3681cf30014fa",
               "name": "Eddie Barth",
               "profile_path": null,
               "id": 32384,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Semple",
               "gender": 2,
               "credit_id": "5486d5eac3a3681d060012d4",
               "name": "Conrad Bain",
               "profile_path": "/PIrcDMGAhceckOWTz9S3KdnAOH.jpg",
               "id": 124007,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "British Ambassador",
               "gender": 0,
               "credit_id": "5486d6069251417600001487",
               "name": "Baron De Beer",
               "profile_path": null,
               "id": 1396843,
               "order": 12
            },
            {
               "cast_id": 28,
               "character": "Subway Thug #1 (uncredited)",
               "gender": 2,
               "credit_id": "5486d654c3a3681d060012dc",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 14
            },
            {
               "cast_id": 29,
               "character": "Himself",
               "gender": 2,
               "credit_id": "576ceeb492514169330030a3",
               "name": "Howard Cosell",
               "profile_path": "/yLWDtrPsoK3gUVveAGOsqijzMPe.jpg",
               "id": 153575,
               "order": 15
            },
            {
               "cast_id": 30,
               "character": "",
               "gender": 2,
               "credit_id": "57930d96c3a368401200b953",
               "name": "Tino García",
               "profile_path": null,
               "id": 1473301,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d0f",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d15",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d1b",
               "name": "Mickey Rose",
               "profile_path": null,
               "id": 68936,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d21",
               "name": "Axel Anderson",
               "profile_path": null,
               "id": 68937,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d27",
               "name": "Antonio Encarnacion",
               "profile_path": null,
               "id": 68938,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d2d",
               "name": "Jack Grossberg",
               "profile_path": null,
               "id": 68939,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d33",
               "name": "Charles H. Joffe",
               "profile_path": null,
               "id": 6993,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44219251416c75029d39",
               "name": "Manolo Villamil",
               "profile_path": null,
               "id": 68940,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d3f",
               "name": "Jack Rollins",
               "profile_path": "/4zEeD2lPss6tFhgGzMIdoc68VDa.jpg",
               "id": 6994,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d45",
               "name": "Marvin Hamlisch",
               "profile_path": "/sp6CNguidq58iMBmzc1uq8cE4Ax.jpg",
               "id": 10468,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d4b",
               "name": "Andrew M. Costikyan",
               "profile_path": null,
               "id": 68941,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d51",
               "name": "Ron Kalish",
               "profile_path": null,
               "id": 68942,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c75029d57",
               "name": "Ralph Rosenblum",
               "profile_path": null,
               "id": 6848,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 7.195863,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11302,
      "vote_count": 217,
      "budget": 2000000,
      "overview": "When a bumbling New Yorker is dumped by his activist girlfriend, he travels to a tiny Latin American nation and becomes involved in its latest rebellion.",
      "similar": [
         5236,
         2292,
         620,
         869,
         68734,
         262504,
         197,
         131634,
         262500,
         192141,
         17295,
         336,
         3291,
         3989,
         746,
         418667,
         276,
         338,
         760,
         10985
      ],
      "original_title": "Bananas",
      "runtime": 82,
      "poster_path": "/szw9Ci9h3CbRx6joz8X1KMbNFvt.jpg",
      "spoken_languages": [
         {
            "name": "",
            "iso_639_1": "yi"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jack Rollins & Charles H. Joffe Productions",
            "id": 13309,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         }
      ],
      "release_date": "1971-04-28",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Woody Allen"],
      "runtime": 82,
      "synopsis": "In the opening scene, TV reporter Howard Cosell, playing himself, covers the assassination of the president of San Marcos, an imaginary Central American banana republic. The scene shifts to the US, where lonesome loser Fielding Mellish ( Woody Allen) works as a product tester. Fielding has the hots for Nancy ( Louise Lasser), the girl collecting petition signatures door to door for the liberation of San Marcos, so he pretends to be interested in her cause. A relationship develops between them, but when she dumps him, he is devastated. He reckons he'll have to get very involved in the situation in San Marcos to win her back. In San Marcos, Fielding's ineptitude leads to his capture by the rebels who are fighting to overthrow the military dictator, General Vargas ( Carlos Montalbán). Fielding is encouraged, despite his modest education, to become the rebels' figurehead. His mission is to solicit funding for the rebel cause, but he fails miserably. As a key figure in a revolution that America does not support, Mellish is no longer welcome in his own country. Wearing a disguise, he returns to America, where his ex-girlfriend has renewed interest in him, not knowing he is really Fielding Mellish. Things seem to be developing well for them until the CIA discovers that he is a representative of the San Marcos rebels. After a humiliating and politically charged trial, Mellish is fortunate to avoid imprisonment. He marries Nancy, who, remarkably, now admires him for making great sacrifices for a cause she believes in so deeply. In a final scene that echoes the movie's beginning, Cosell narrates the consummation of Nancy and Fielding's marriage and, in classic sportscaster style, interviews them in bed afterward. (They remain demurely covered throughout.)",
      "writers": [
         "Woody Allen",
         "Mickey Rose"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066808/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MTE3MzI3MF5BMl5BanBnXkFtZTcwODg3OTYwNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Woody Allen, Louise Lasser, Carlos Montalbán | See full cast and crew »"],
      "reviews": [
         "I went to see \"Bananas,\" in the early 1970s with three of my high school buddies, in our local theater. And, it remains -- three decades later -- one of the most memorable and one of my most talked about movie-going experiences ever. So much of it was comprised of absolutely hysterical scenes which I've told countless people about through the years, and still tell people about. Watching this movie today, it seems as if it had been somewhat haphazardly written. I get the feeling that Woody Allen had kept a journal in which he noted the funniest sights he'd witnessed and the cleverest one-liners he'd heard, over a period of years, and then set about mixing all of these totally unrelated funny things into one script. It's like he was saying to himself, \"I think I'll throw in the bit about the guy trying to discreetly buy a sex magazine in a quiet neighborhood store and getting embarrassed, and then the snake bite bit later on. But first before the next plot turn, I think I'll put in the bit in which a guy gets out of his car and falls into an open manhole.\", etc. You feel at times like you're watching a Benny Hill-type comedy show, or a TV variety show with a series of comedy skits that have nothing at all to do with each other. Somehow, Woody blended it all together into a fairly coherent story. There are also a few scenes which feature \"Airplane\"/\"Naked Gun\"-style tongue-in-cheek humor. But, this movie had been made *long* before those were even thought of. There's a message in that: This movie was ahead of its time. There's a segment of \"Bananas,\" early on, which is just one outrageously funny bit after another after another. I guess the movie doesn't really have a point . . . except maybe that maniacal dictators are crazy, dangerous and should be driven from power . .. or maybe that freedom is worth fighting for . . . or maybe that some causes are worth laying down your life for. Obviously, there's relevance in all of that for us, today. Or maybe the whole point of this movie could simply be that Woody Allen knows how to make people laugh. Later, Art",
         "This is one of Woody Allen's earliest films -which should rank with the all-time greatest comedies. Although it was made back when the trial of The Chicago Seven was still fresh and Tobacco was still advertised on television, Bananas is timeless and still topical: J. Edgar Hoover in drag; the CIA sending US troops to fight on both sides of a revolution because they are afraid of being on the wrong side. One can usually recall a few scenes from a good movie, but Bananas is one of those great movies which one can replay in the mind from beginning to end. (Bananas is neatly bracketed at the beginning and end by Howard Cossell playing himself in bizarre Wide World of Sports coverages.) Allen has total control as writer, director and lead actor as in his later films, but in Bananas, the humor is broader and more cinematic. He plays the nebbish Fielding Mellish with less of the existential whining that mars his later films. There is a youthful resiliance like a toy punching bag that keeps coming back up. That is what made Chaplin's little tramp both comical and endearing.",
         "Bananas is like a cookie-batter of all of those early Woody Allen jokes all plopped into a bowl and shaken around. It's a film loaded with political jokes, but without a direct focus aside from Cuba and dictators and the like. There are numerous sexual jokes, including one of Woody's funniest scenes involving a magazine (the buying and holding on a subway, very silent comedy-like). And even Howard Cosell becomes an iconic figure in Woody's comedy in the brilliant opening scenes. The plot is very loose, so if you're looking for that look elsewhere. Also, to put it mildly, some of the jokes may not work at all for some viewers of today. But it's the go-for-broke irreverence of the picture that has it still worth viewing today. Much of Woody's own verbal bits are very good, but it's also worth to note how the physical comedy- while crude and a little off-key- also has a good ring to it. Unlike the director's later films, you can still sense that he's trying to 'get' how to make a film, and so in trying to do anything he can think of to get a laugh, of course, some of it doesn't work. For example, in Cuba the gag where the gargantuan pile of dung is carried down the stairs with the Lain music in the background gives a grin, but not as big a laugh as might be intended. Indeed, this might be Woody's most 'immature' film, while still containing some of his more biting, satirical jabs at dictators and oddball politics. Woody would still have this wild, go-for-broke style of humor more akin to some of his quirkier short stories in other films of the early 70s. While this isn't as successful in that regard as Sleeper or Love and Death, I'd still watch it again if it was on TV; even the romantic subplot, undercooked in comparison with the rest of the more satirical stuff, is interesting.",
         "\"Bananas\" is one of Woody Allen's earliest films: a pure comedy, with some satirical and political overtones (which are about 100% on-target - like when the leader of the rebels becomes a dictator himself when he rises to power). It's a strictly hit-or-miss effort, but, fortunately, the hits are definitely more than the misses. It contains many laugh-out-loud scenes; the whole courtroom sequence, his military training, the scene where he tries to pass unnoticed while he's buying a pornographic magazine, and his reaction to the line \"You're not tense, are you?\" are among the many highlights. It does have its dead spots, though, and some rather too obvious jokes that can't match the level of the rest (the closing sequence does not work at all, IMO). Marvin Hamlisch's score is unbelievably catchy.",
         "\"Bananas\" is just that on the surface - a crazy, off the wall movie written by, directed by, and starring a very young Woody Allen as a clumsy New Yorker who winds up as the leader of a small country. In the beginning, Allen plays a product tester whose parents are surgeons (in fact, he walks in on them at one point while they're performing surgery, and they have him take over the reins). He basically just wants to get laid, and when a young activist (Louise Lasser) appears at his door with a petition, he sees an opportunity. The two eventually break up, and in despair, he quits his job and goes to San Marcos, one of her causes. There he becomes a pawn in the revolution, later becoming their leader dressed like Castro but with a red beard. Only Allen could have imagined this, and it's quite brilliant. Underneath the one-liners and crazy situations is a statement about the war in Vietnam and the way it was reduced to sports reporting on television. To make his point, Howard Cossell is on hand for a play by play of the character's wedding night before an audience. Total Woody, with some hilarious moments. Highly recommended.",
         "\"Bananas\" shows why Woody Allen's early movies were far better. He plays Fielding Mellish, a products tester who is wishing that he had stayed in college (\"I was taking black studies. I could be black!\") After a brief fling with political activist Nancy (Louise Lasser), who is trying to restore democracy in the Latin American country of San Marcos (the movie begins with Howard Cosell hosting a \"live, on-the-spot assassination\" there). After she leaves him, he decides to go to San Marcos, where he gets involved with the revolutionary forces. Following the revolution's success, the leader installs some loony policies, and the US arrests Mellish for aiding the revolution. What follows shows the meaning of the expression \"trial and error\"! Allen truly reached his apex with this movie. It's just one crazy thing after another, namely when Mellish and the revolutionaries buy lunch. Sylvester Stallone, in an early role, plays one of the hoodlums on the subway.",
         "In the Republic of San Marcos, in Latin America, the president is killed in a Coup d'État promoted by General Emilio M. Vargas (Carlos Montalbán). In New York, the products tester Fielding Mellish (Woody Allen) meets the political activist Nancy (Louise Lasser) and they have a love affair. Fielding has an unrequited love with Nancy, who believes that he is immature and without leadership. Fielding decides to travel to San Marcos and General Vargas plots a scheme the assassination of Fielding to be supported by the USA against the rebels led by Esposito (Jacobo Morales). However the rebels save Fielding and train him in guerrilla warfare. General Vargas flees to the United States. Esposito deranges with the power and Fielding becomes the President of San Marcos. He wears a long beard and travels to USA seeking financial support to the country and he meets Nancy again, who falls in love with him. \"Bananas\" is a witty joke with the US- sponsored dictatorships in Latin America in the 60's by Woody Allen. The story has hilarious situations, like when Fielding Mellish is buying the porn magazine \"Orgasm\"; or with the two subway thugs (one of them the uncredited Sylvester Stallone); or having dinner with the junta; or training with the rebels. My vote is eight. Title (Brazil): \"Bananas\"",
         "This is one of Woody Allen's earliest movies, and I'd rank it probably 2nd out of his pre-Annie Hall movies, only behind Love and Death. It's certainly one of his funniest. The plot is pretty ridiculous (a neurotic product tester goes to the fictional San Marcos and ends up joining the rebels and eventually becoming president), but it's really secondary, and only serves to provide transitions from one comedy skit to another. It's pretty much a hit and miss movie, but when he hits (which is more often than not), it's very funny. There are plenty of hilarious one liners throughout. The music is very cheesy as well, but it fits in well with the silly humor. Obviously, this isn't like Woody's later movies, just take it for what it is -- a silly comedy -- and I don't think you'll be disappointed. Also of note, the opening credits are very funny and rivals Monty Python and the Holy Grail for best opening credits sequence.",
         "When asked why he titled his third feature-length picture 'Bananas,' Woody Allen replied, \"because there's no bananas in it.\" This, in a nutshell, pretty much summarises the general tone of the film. During the first ten years of his directing career, it's interesting to see Allen slowly developing his craft; as the years go by, from 'Take the Money and Run (1969)' to 'Sleeper (1973),' {and culminating in 'Annie Hall (1977)'} we notice how he learned to assimilate an unrelated collection of gags into a mature, cohesive narrative. 'Bananas (1971)' sits somewhere in the middle of all this, with a more developed story than its predecessors, but maintaining its roots as an anarchic comedy, much in the same vein as films like 'Duck Soup (1933)' and 'Monty Python and the Holy Grail (1975).' Though I had not anticipated enjoying 'Bananas' very much, I must say that the film provided countless moments of immeasurable hilarity. Though slightly uneven in parts {as is often the case, some jokes hit while others miss}, the film delivers the promised laughs. The storyline is characteristically simple and absurd. After a revolution breaks out in the small South American nation of San Marcos, a mediocre, unintellectual New Yorker, Fielding Mellish (Allen), travels there to impress his ex-girlfriend (Louise Lasser). After the fascist government tries to have him assassinated, poor Fielding falls in with the rebel gangs, somehow eventually becoming the President of the Latin American republic. This absurd plot line allows Allen to pile one gag on top of another, and, interestingly, the story itself never seems to lose its way or go off on any tangents. The film's satirical take on war, with the Vietnam War still raging in 1971, was very timely, and Allen also aims a few jabs at the media's handling of warfare \u0096 in the ridiculous and inspired opening, ABC's Wide World of Sports arrives in San Marcos to commentate the assassination of the current President. Later, Howard Cosell returns to host the consummation of Fielding's marriage, with an enthusiastic crowd watching the awkward couple tussling beneath the covers. 'Bananas' is a type specimen of one of Woody Allen's \"early, funny movies.\"",
         "At the recommendation of a friend, I watched Woody Allen's Bananas. Allen is often portrayed in the media and by critics as an albatross of Hollywood, and I really don't have a lot of experience with his films. Besides Bananas, I have only seen Match Point, which is one of the best films I've ever seen. Being made in 1971, Bananas touches on the activism culture of the time, and the USA's involvement in South American politics. Focused around the the fictitious country of San Marcos, presumably any number of nation-states the USA was involved in destroying. It opens with the president of San Marcos being assassinated and a general taking the reigns of power in the country. Good afternoon. Wide World of Sports is in the republic of San Marcos where we are going to bring you a live on the spot assassination. They're going to kill the president of this lovely Latin American country and replace him with a military dictatorship. A strong-handed dictator, a group of (apparently marxist) rebels ban together in opposition. Woody Allen's character is living in the States and falls in love with an activist who is looking for support of the people of San Marcos. They make plans together to fly down there in a show of solidarity, but his girlfriend breaks up with him (in one of the most humorous moments of dialog recorded on film). Because he already had plans to go, he visits San Marcos where he is unwittingly joined to the rebel cause. This is a very funny movie, especially is you are a fan of Groucho Marx - Allen's influence is quite obvious through lines such as, \"I object, your honor! This trial is a travesty. It's a travesty of a mockery of a sham of a mockery of a travesty of two mockeries of a sham.\" But Woody also brings his own spin, which is pretty political - \"You cannot bash in the head of an American citizen without written permission from the State Department.\" Most of it is one-liners or character comedy, but there are also cleverly composed dialog sequences and wacky settings. The film making is somewhat weak, and the musical score is odd, but this is about on par with early 70s movies. The story was flimsy, but apparently most of the movie was filmed improv. It is definitely worth a watch if only for the last scene alone."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Jack Rollins & Charles H. Joffe Productions"],
      "summaries": [
         "Fielding Mellish (a consumer products tester) becomes infatuated with Nancy (a political activist). He attends demonstrations and tries in other ways to convince her that he is worthy of her love, but Nancy wants someone with greater leadership potential. Fielding runs off to San Marcos where he joins the rebels and eventually becomes President of the country. While on a trip to the states, he meets Nancy again and she falls for him now that he is a political leader.",
         "In the Republic of San Marcos, in Latin America, the president is murdered in a Coup d'État promoted by General Emilio M. Vargas. In New York, the products tester Fielding Mellish meets the political activist Nancy and they have a love affair. Fielding has an unrequited love with Nancy, who believes that he is immature and without leadership. Fielding decides to travel to San Marcos and General Vargas plots a scheme the assassination of Fielding to be supported by the USA against the rebels led by Esposito. However the rebels save Fielding and train him in guerrilla warfare. General Vargas flees to the United States. Esposito deranges with the power and Fielding becomes the President of San Marcos. He wears a long beard and travels to USA seeking financial support to the country and he meets Nancy again, who falls in love with him.",
         "When a bumbling New Yorker is dumped by his activist girlfriend, he travels to a tiny Latin American nation and becomes involved in its latest rebellion."
      ],
      "budget": 2000000
   },
   "movielensId": 1078,
   "movielens": {
      "languages": [
         "",
         "English"
      ],
      "releaseDate": "1971-04-28",
      "dvdReleaseDate": "2000-07-05",
      "directors": ["Woody Allen"],
      "runtime": 82,
      "movieId": 1078,
      "title": "Bananas",
      "mpaa": "",
      "actors": [
         "Woody Allen",
         "Louise Lasser",
         "Carlos Montalbán",
         "Nati Abascal",
         "Jacobo Morales",
         "Miguel Ángel Suárez",
         "René Enríquez",
         "Charlotte Rae",
         "Stanley Ackerman",
         "Dorothi Fox",
         "Eddie Barth",
         "Conrad Bain",
         "Baron De Beer",
         "Sylvester Stallone",
         "Howard Cosell",
         "Tino García"
      ],
      "imdbMovieId": "0066808",
      "originalTitle": "Bananas",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "Xyqm-wWnX0A",
         "3zYmpH89U64"
      ],
      "plotSummary": "When a bumbling New Yorker is dumped by his activist girlfriend, he travels to a tiny Latin American nation and becomes involved in its latest rebellion.",
      "tmdbMovieId": 11302,
      "avgRating": 3.72062,
      "releaseYear": "1971",
      "numRatings": 3923,
      "posterPath": "/szw9Ci9h3CbRx6joz8X1KMbNFvt.jpg"
   }
}