{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "cabaret",
            "id": 2311
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "cross dresser",
            "id": 172789
         },
         {
            "name": "soprano",
            "id": 197005
         },
         {
            "name": "1930s",
            "id": 214548
         }
      ],
      "imdb_id": "tt0084865",
      "video": false,
      "title": "Victor/Victoria",
      "recommendations": [
         25431,
         226343,
         118898,
         429866,
         184915,
         163422,
         98997,
         313563,
         116314,
         300488,
         194246,
         117897,
         368432,
         79359,
         112193,
         107673,
         115360,
         103130,
         143529,
         116696
      ],
      "backdrop_path": "/zVK5QUQExB6hGpdDfRlDe0jTUrN.jpg",
      "revenue": 28215453,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 16,
               "character": "Victoria Grant / Count Victor Grezhinski",
               "gender": 1,
               "credit_id": "52fe45079251416c75049437",
               "name": "Julie Andrews",
               "profile_path": "/yQ0J92DMiLtQYoytLJ6CuBkdeN0.jpg",
               "id": 5823,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "King Marchand",
               "gender": 2,
               "credit_id": "52fe45079251416c750493f3",
               "name": "James Garner",
               "profile_path": "/ek70DefEq6LZZX3JyUjJ125q63f.jpg",
               "id": 16896,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Carroll 'Toddy' Todd",
               "gender": 2,
               "credit_id": "52fe45079251416c750493f7",
               "name": "Robert Preston",
               "profile_path": "/jYeXchYunCtIN3wd6VbNnoMWaqD.jpg",
               "id": 40202,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Norma Cassady",
               "gender": 1,
               "credit_id": "52fe45079251416c750493fb",
               "name": "Lesley Ann Warren",
               "profile_path": "/4I5VPyumsxYGKST9b0FL2harYRK.jpg",
               "id": 21818,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "'Squash' Bernstein",
               "gender": 2,
               "credit_id": "52fe45079251416c750493ff",
               "name": "Alex Karras",
               "profile_path": "/y2E9CI3lja7TP219CZXr3XiELxp.jpg",
               "id": 73234,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Andre Cassell",
               "gender": 2,
               "credit_id": "52fe45079251416c75049403",
               "name": "John Rhys-Davies",
               "profile_path": "/dvT1NPY8CXIVQh0O1h6rpfYOgKz.jpg",
               "id": 655,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Waiter",
               "gender": 2,
               "credit_id": "52fe45079251416c7504943b",
               "name": "Graham Stark",
               "profile_path": "/gDd2KD0G5PzVCc9n8ihV7ibtRKk.jpg",
               "id": 14107,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "Richard",
               "gender": 2,
               "credit_id": "56a68e8b92514129f1000703",
               "name": "Malcolm Jamieson",
               "profile_path": null,
               "id": 1568365,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Labisse",
               "gender": 2,
               "credit_id": "52fe45079251416c75049443",
               "name": "Peter Arne",
               "profile_path": "/8TjMvQ45ElBduMbf0BfnbykNQsC.jpg",
               "id": 14955,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Charles Bovin",
               "gender": 0,
               "credit_id": "52fe45079251416c7504944b",
               "name": "Sherloque Tanney",
               "profile_path": null,
               "id": 955645,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Divine' Admirer at Rehearsal (uncredited)",
               "gender": 0,
               "credit_id": "56281fb79251414cdb0000e1",
               "name": "Geoffrey Edwards",
               "profile_path": null,
               "id": 58658,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Stella, the receptionist",
               "gender": 1,
               "credit_id": "575f4def9251415e1f000307",
               "name": "Matyelok Gibbs",
               "profile_path": "/mFouHJqFX0Mtj1kgE5zkXXcNr8A.jpg",
               "id": 17479,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45079251416c7504940f",
               "name": "Tony Adams",
               "profile_path": null,
               "id": 14090,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45079251416c75049415",
               "name": "Henry Mancini",
               "profile_path": "/sXl1lCYNnSf10ESG1nyCEDYGs1L.jpg",
               "id": 1938,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45079251416c7504941b",
               "name": "Dick Bush",
               "profile_path": null,
               "id": 58660,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45079251416c75049421",
               "name": "Ralph E. Winters",
               "profile_path": null,
               "id": 10007,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45079251416c75049427",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe45079251416c7504942d",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45079251416c75049433",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56281d049251414ccf00009f",
               "name": "Gerald T. Nutting",
               "profile_path": null,
               "id": 1433977,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "59fc8db592514113bb02cc71",
               "name": "William Craig Smith",
               "profile_path": null,
               "id": 1433981,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "59fc8dbf92514113a602bdad",
               "name": "Rodger Maus",
               "profile_path": null,
               "id": 14097,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "59fc8dca92514113dd02ca2a",
               "name": "Tim Hutchinson",
               "profile_path": null,
               "id": 12651,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 10.753964,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12614,
      "vote_count": 113,
      "budget": 0,
      "overview": "A struggling female soprano finds work playing a male female impersonator, but it complicates her personal life.",
      "similar": [
         449176,
         26371,
         16367,
         428493,
         413666,
         10938,
         184352,
         376867,
         11000,
         47643,
         15121,
         1966,
         342473,
         398818,
         322127,
         261776,
         26280,
         11386,
         258480,
         26933
      ],
      "original_title": "Victor/Victoria",
      "runtime": 132,
      "poster_path": "/8LMzl4oHkzpZN9b7EA9NPye8MNe.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Peerford Ltd.",
            "id": 8846,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Artista Management",
            "id": 8844,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1982-04-25",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "The disguise surprise comedy of the year!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Blake Edwards"],
      "runtime": 132,
      "synopsis": "Down and out coloratura singer Victoria ( Julie Andrews) is rejected at yet another audition in 1930's Paris. The owner of Che Lui, Labisse ( Peter Arne) thinks that she is too 'pure' for his gay clientele. Leaving in bitter disappointment, she belts out a high B-flat which shatters his wine glass. Returning to her hotel, the landlord has taken her things and locked her out until she pays the rent. Swooning from hunger, she promises to sleep with him for a meatball. She returns to consciousness in her room with the landlord bending over her, but he flees when she begins screaming upon seeing a cockroach. Later, in a restaurant she ravenously orders nearly everything on the menu. She invites Toddy ( Robert Preston) to join her, explaining that she intends to eat for free by putting the bug in her food. Although the manager and waiter are sure it's a scam, the bug moves on to other patrons, creating a riot, which allows Victoria and Toddy to flee in the rain. Warming up at Toddy's apartment, we learn that Toddy is homosexual and that cheap coats shrink when they get wet. Victoria's virtue is safe, so she stays the night. The next morning Toddy has a cold, so Victoria dresses in a suit and hat left by his former boyfriend Richard ( Malcolm Jamieson) suit to get some medicine. Richard suddenly returns to get his things, but when he insults Toddy, Victoria springs from her hiding place in the wardrobe and punches him. He leaves, and Toddy is inspired - instead of marketing Victoria as a female singer, why not get her a job as a female impersonator, a man pretending to be a woman? She says that, \"A woman pretending to be a man pretending to be a woman\" will never work, but Toddy brings \"Victor\" to Andre Cassell ( John Rhys-Davies) who hires \"him\" to star in a show at his own restaurant. Rehearsals ensue, and Victoria acquires more appropriate mannerisms (\"Make your gestures broad! You're a drag queen!\") When the show opens, King Marchand ( James Garner) is in attendance. His girlfriend, Norma Cassady ( Lesley Ann Warren), is annoyed that King is obviously attracted to the \"woman\" on stage, but when Victoria is revealed to be Victor, she is delighted. Attending the backstage party, King challenges \"Victor\", stating that he couldn't be attracted to a man so Victor must be a woman. Victoria admits to Toddy that she is attracted to King. That night, Toddy takes her to their new residence in a posh hotel due to her success. King becomes determined to find out that Victor is a woman, and some comical sequences ensue as he sneaks into her room, watches her bathe (and learns the truth), then sneaks out, stranding his faithful bodyguard 'Squash' Bernstein ( Alex Karras) outside on a snowy balcony. Norma becomes more annoying and tawdry, in contrast to the classy Victoria, and King finally has Squash send her home to the states so that he is free to pursue Victoria. After visiting a gay nightclub (Che Lui, where she auditioned at the beginning of the film) and starting a riot with Toddy's ex-boyfriend, Victoria again sings a penetrating B-flat and shatters a glass to escape the fight. King and Victoria flee, and he says, \"I don't care if you ARE a man,\" and kisses her. She says, \"I am NOT a man.\" When Squash finds the two of them in bed together, he is shocked ... and then confesses that he, too, is gay, which stuns King. In the meantime, the owner of the trashed nightclub Che Lui has gotten suspicious about Victor, and hires a private investigator ( Herb Tanney) to find out the truth. The relationship becomes awkward, because Victoria must continue to masquerade as a man in public in order to keep her job. After telling Squash the truth, King is still aggrieved that people are thinking HE'S gay because he's with \"Victor.\" Going dancing at a gay club full of men, seeing the opera Madame Butterfly which brings her to tears, attending a bloody boxing match which makes her ill, they go everywhere as two men. He wants her to quit. She refuses, then asks if he'd quit his job - of course he wouldn't. Back in the USA, the jealous Norma is telling King's business partner Sal ( Norman Chancer) the shocking news about King and Victor. Sal and Norma appear in Paris to force King to sign over his business interests. He is about to reluctantly comply when Victor enters. Victor takes Norma into the next room and begins to undress ... at which point an intrigued Norma whispers that Victor should lock the door. Next we hear her screams of furious outrage as she learns that Victor is actually a woman. In a series of bumbling Clouseau-like scenes, the investigator eventually determines that Victor is a woman. A policeman appears at Victor's dressing room door demanding to see Victor unclothed or fraud charges will be pressed. He exists the dressing room reporting that Victor is definitely a man, having seen him naked from the waist down. Next we see a glowing Victoria, in a frothy black dress and wearing a feminine curled hairstyle. She joins a very surprised King at his usual table, where they watch Toddy in drag, comically sing through one of Victor's signature numbers.",
      "writers": [
         "Blake Edwards",
         "Hans Hoemburg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084865/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMzQzNTYxNV5BMl5BanBnXkFtZTcwNzU4ODcxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Julie Andrews, James Garner, Robert Preston | See full cast and crew »"],
      "reviews": [
         "My God, the reviewer before me MUST be mad!!! Either that, or he/she must be struggling with their own sexuality! THIS is one of my favorite movies of ALL time. Julie Andrews is in fine musical form; James Garner gives one of his greatest comedic performances since \"The Americanization of Emily\" (also with Julie Andrews) and Lesley Ann Warren just about steals the picture! This movie scores a solid \"10\" for comedy, a sterling \"10\" for music and a rousing \"10\" for romance! ANYONE that DOESN'T like this movie should suck an egg! HOW did Lesley Ann Warren NOT win an Oscar? Ditto, Robert Preston? I consider myself a guy's guy, but I confess I tear up every time I hear the opening refrains of Julie singing \"Crazy World,\" the film's theme song. Bravo, Blake Edwards!!!",
         "\"Victor/Victoria\" was the film where Blake Edwards finally managed to deliver his valentine to his wife, Julie Andrews, and convince the public to join in. Maybe because of that, it's one of his most heartfelt movies, and the enormous love between the director and his star do as much to warm up this movie as the careful colour composition of Dick Bush's fantastic - and underrated - photography. This is a film where everything works perfectly. The acting ranges from the impeccable (the leads) through the touching (Alex Karras) right to the truly sublime (Robert Preston and Lesley Ann-Warren). The musical numbers are lovingly staged and shot and, possibly because this is a pre-MTV film, we actually get to see dancers dancing, as opposed to machine-gun assemblies of body parts performing details of not necessarily connected movements. The directorial touch is assured, proficient but never showy: the many complicated set-ups are executed with elegance, economy - not a frivolous camera movement to be seen - and discretion. (The circular pan around Julie as she sings \"Crazy World\" is a lovely example of how camera movement can create emotion without drawing attention to itself.) The sets and costumes are lavish but, again, do not distract. The screenplay is witty, full of deft touches, and Edwards treats his rather daring (for 1982) theme without blinking, and with great lucidity. (The other drag film of the year was \"Tootsie\", which stuck to the romance and stayed away from uncomfortable homosexual touches as much as it managed to.) The timing never falters. And the score is priceless. All in all, a flawless entertainment, which, like the best movies from the studio system's heyday of which \"Victor / Victoria\" is a proud and worthy descendant, rewards the attentive (and interested) viewer with far more substance - and style - than might appear at first. I do not have the space to analyse this film at the length it deserves; but I can recommend it, which I do wholeheartedly.",
         "Dazzling art direction, lavish costumes, funny dialogue, a fabulous soundtrack, and Robert Preston make \"Victor/Victoria\" one of filmdom's most entertaining musicals of all time. Set in 1934 Paris, and filmed in luscious color, the film tells the story of two down and out friends who carry out an ingenious plan to get rich. Toddy (Robert Preston), a gay performer, persuades Victoria (Julie Andrews), a struggling singer, to change her appearance to that of a man so that she can pose on stage as a female impersonator. Blake Edwards converts the film's clever concept into a film of true cinematic flair and panache. The film's music alone is enough to make \"Victor/Victoria\" a winner. With consummate verve, Andrews sings the lively \"Le Jazz Hot\", a stage performance that has been mimicked by, it seems, one in ten talent competitors in the Miss America Pageant for the last twenty years. The colorful song \"The Shady Dame From Seville\" is memorable as a cultural classic. Even the restrained \"You And Me\" is satisfying, with its old fashioned charm. And Henry Mancini's wistful and slightly melancholy original score adds melodic balance to the flashy stage numbers. The casting is perfect. I cannot imagine anyone other than Julie Andrews as Victoria. James Garner is fine as King Marchand. And in support roles, Lesley Ann Warren adds sexy spunk as Norma, and Alex Karras is surprisingly effective as Marchand's bodyguard. But it is music man Robert Preston who leads this top notch Hollywood talent parade. Preston is likable throughout, and is a hoot in the film's finale. If the film has a flaw, it might be in the editing. The plot in Act Two slows down. Or, to say it a little differently, it ... drags (so to speak). The 132 minute runtime is a tad long maybe, and so a few scene deletions here and there might have rendered a slight improvement in the pace. But, this is a minor issue, one that I raise only in my grasping-at-straws attempt to find something to complain about. \"Victor/Victoria\" is an expressive, fun, one-of-a-kind musical garden party that easily makes my list of top fifty films ever made.",
         "Despite all of its gender-bending commentary on sexuality, both hetero- and homo-, \"Victor/Victoria\" looked and sounded in 1982 (year of \"ET\" and \"The Road Warrior\") as if it were made in 1962 -- and that was a good thing. Blake Edwards' trademark ability to combine lush romanticism with immitable slapstick comedy was here matched by a wonderful score by his longtime collaborator Henry Mancini, \"Voila!\" -- we're back in the early sixties again. (It didn't hurt that stars Julie Andrews and James Garner were hottest in the sixties, and had acted together in 1964's \"The Americanization of Emily.\") Robert Preston, \"The Music Man\" of late fifties Broadway and 1962 screen fame, further added an element of early sixties nostalgia -- with the twist that he here used his booming vocal tones in the service of a delightfully out and comfortable gay man. Preston was one of two hot contenders for the Best Supporting Actor Oscar that year. The winner was Lou Gossett, Jr. for his Drill Instructor in \"An Officer And A Gentleman.\" Rounding out the great cast are Lesley Ann Warren (sexy and very funny) in an Oscar-nominated role as Garner's mob moll floozie, and Alex Karras, continually funny as Garner's softhearted ox of a bodyguard. (Karras gets a classic Blake Edwards slapstick routine trapped in the freezing snow outside a Paris hotel, getting big laughs out of the simple line: \"You've got heat? That's good.\") And be sure to keep a lookout for \"Sherloque Tanney\" as the French private detective on Victor/Victoria's trail. Tanney was Blake Edwards dentist, and appeared in almost every Blake Edwards film from \"Darling Lili\" (1970) on. Other than his corpse in \"SOB,\" (1981), the French detective is possibly Dr. Tanney's greatest role on the screen. Tanney, too, gets to anchor several great trademark Blake Edwards slapstick routines. Oh, and there's music, too. Enough music for a Broadway musical (which is what \"Victor/Victoria\" became), and with a sad and wistful Mancini title tune (reprised in the film by Andrews) that reminds one a bit of \"Moon River\" and \"Days of Wine and Roses.\" Just like in the early sixties.",
         "Three of the stars of this movie all made their mark playing wholesome characters, (and all in musicals, ironically) but they certainly got rid of those personas in this film. Julie Andrews finally solved the problem of Maria by playing a woman pretending to be a man pretending to be a woman, Robert Preston's gay entertainer is a long, long way from Harold Hill, and Lesley Ann Warren... well, her floozy moll (\"Ya mean you really aw... quee-uh?\") basically erases all memories of Cinderella. All give excellent performances in this entertaining, funny film from director/co-writer Blake Edwards. And they all get to sing some great songs from Henry Mancini and Leslie Brucusse, among them \"Le Jazz Hot,\" (in which Andrews sings in her lower range, and actually sizzles) \"The Shady Dame From Seville,\" (first sung by Andrews, then hilariously reprised at the end by Preston) and \"Chicago, Illinois.\" (Warren is great in that) Though there is a long stretch in the middle that either included jokes and/or subtleties that went over my head or just wasn't funny, though not bad, otherwise it's a great comedy. In addition to the three performers mentioned, James Garner is also good as the gangster who falls for Andrews but is unsure of her gender.",
         "Many social innovations, have often as not originated in France. Take cross-dressing for instance. In the 1930's a singer created quite a sensation when her fabulous show became the toast of Paris. She traveled throughout Europe and remained a novelty for years. Her success was due to the fact that she was not a woman after all. She was a man. This fact became the inspiration for the film \"Victoria/Victoria.\" In the movie, a talented female singer (Julie Andrews) named Victoria Grant (aka Count Victor Grezhinski) schemes with an out of work cabaret singer, Carroll 'Toddy' Todd (Robert Preston, who is fantastic in this role) to create a female impersonation act. With the help of Andre Cassell, (John Rhys Davies) a night club owner they hope to get rich with the unusual act. Complications arise however, the least of which is a visiting gangster named King Marchand (James Garner) who takes a liking for Victoria. His Chicago girlfriend Norma Cassady (Lesley Ann Warren) become jealous and informs other hoodlums to come to Paris. Alex Karras, plays Mr. Bernstein, Garners' bodyguard). The film is a solid hit for the cast and lays the foundation of it become a classic. ****",
         "Paris in the '30s is the setting for this screwball sex comedy wherein JULIE ANDREWS, for the sake of being employed, takes a job as a woman pretending to be a man pretending to be a woman--figure that one out. Then we have a great moment when ROBERT PRESTON does an imitation of Julie singing \"The Shady Dame from Seville\" in drag--yes drag--the actor who played such sturdy romantic leads in the '40s and '50s is hilarious as a gay blade who hooks up with Julie during a restaurant scene in which she plants a cockroach in her plate to avoid paying for dinner. That's the kind of romp this is. And it's extremely witty, with JAMES GARNER as Julie's romantic interest who hasn't figured out why he's so attracted to \"the shady dame\" when she's supposed to be a man. First-rate sets and cinematography in color, and while none of it really makes any sense, the song and dance routines are fabulous with some great tunes by Henry Mancini. LESLEY ANN WARREN gives a priceless performance as a bird brained vamp in her Oscar nominated supporting role.",
         "First of all, let me just say that I am slightly obsessed with Julie Andrews and her work. With that out of the way... I love her in this movie because it's not your typical Julie Andrews movie. Most people see her in The Sound of Music or Mary Poppins or (if you know this far back in her career) Cinderella. However, she delivers a flawless performance as Victor/Victoria. The only skepticism I have about this movie is seeing her as a man. She's so feminine (in her mannerisms, voice, appearance, etc.) that it's almost impossible to think that she's a man. Robert Preston is wonderfully funny, and I always love James Garner. The movie probably could have done without Lesley Ann Warren's song and dance number (why ruin Julie and Robert's wonderful score?)... On a side note, Warren's character reminded me a bit of Jean Hagen's Lina Lamont in Singin' in the Rain; they each had their characters down perfectly, and you got just annoyed with them enough to hate them but like them at the same time... Of course, Andrews does a beautiful job with all the songs- my favorite being her first jazz number. All in all, an impossibly wonderful performance by all involved. DEFINITELY ten out of ten!",
         "Great wit, wonderful set design, very good acting - What can one say bad about the film? Perhaps the plethora of homosexuals was a bit over the top, as was the part of the private investigator, but these are nit-picks hardly noticed against the background of most modern releases. While I dislike musicals intensely, this one is different, most obviously in the setting for the music. Unlike the incongruous breaking out in song in the middle of conversation, this movie's music occurs within the framework of nightclub acts. This adds to the credibility of a plot that could have spun out of control, much as S.O.B. did (unfortunately). What really sets this movie apart from the crowd of box-office hits that plague us is the incredible wit of the dialogue. The writing is truly wonderful! And Preston is perfect for his character, his repartee style as sharp as the lines Blake Edwards puts in his mouth. It is my tendency to pick apart films on the issue of credibility, allowing as we should for the genre of the film. H.G.Wells once said that good science fiction depended on introducing one and only one fantastic idea, and then developing a plot whose events would follow reasonably from that one idea. Bad science fiction, he said, introduces several such incredible inventions and ideas, creating a plot too fantastic for the reader to immerse him/herself in. So too with movies. Good comedy, science fiction, drama, even action plots, should have one premise that might stretch the limit of credibility, and then develop the plot reasonably from there. Most modern box-office hits fail to do this, and in the process of feeding us one fantasy after another to stimulate our interest and attract our dollars, dulls our minds. Victor / Victoria is good writing because it starts with its one major premise - an unsuccessful, though talented singer achieving fame and fortune by altering her sexual image - and lets the plot play itself out. There are a few minor stretches beside the main premise, but without fantastic physical feats, explosions, car chases, and CG effects, Edwards has created a script that pulls - rather than pushes - you in to the plot. The weakest part of the plot is the fact that Andrew's character attains success not just by cross-dressing, but also by substantially altering her act. We are supposed to ignore the fact that she has changed from simply singing to singing with well choreographed movement. However, this is not a serious flaw, because in the real Hollywood (and Broadway), very good talent is habitually unsuccessful, while the fantastic and ridiculous is placed on an altar. (Does anyone really think Schwarzenegger can act?) Did I say acting? Perhaps I saved the best for last. Andrews playing herself is perfect here, Garner is fantastic, and Leslie Ann Warren adapted to her character's personality so completely that I hardly realized it was her. And, at the risk of repetition, Preston is perfection itself. The set design was almost excessive in the distraction it caused, for you could not help noticing how artfully it was designed and lit. Finally, Henry Mancini wrote the music. The DVD commentary added substantially to the production, making the entire package a 5-star offering, a rating I rarely give.",
         "Written and directed by Blake Edwards, this is a fast, witty farce about a woman posing as a man posing as a woman in 1930s Paris. Victoria (Julie Andrews) is down on her luck. Oh, not as bad as George Orwell in \"Down and Out in Paris and London,\" but pretty far down, this being the depression. She develops a scheme to cheat her way through a full meal at a restaurant by planting a cockroach in her salad. It more or less works but, more important, she runs into cheerful, savvy, gay Robert Preston who becomes her manager. Andrews has been unable to find work as a soprano because singers are a glut on the market, but Preston promotes her as a female impersonator. She succeeds wildly. Among the audience at one of her shows in a fancy nightclub is rich James Garner, his coarse moll, Leslie Anne Warren, and his big, beefy bodyguard, Alex Karras. Garner is sexually aroused by Andrews' sultry performance and when she whips off her headgear and reveals herself as a man named Victor, Garner's face falls marvelously. He's been excited by a MAN! When he gets back to his room he needs to prove his manhood by virtually attacking Warren. Alas, his homosexual anxiety renders him impotent, but Warren is all understanding. \"Awww, honey, it's no big deal. Women are lucky. They can fake it. Oh, not with YOU, baby! Listen, just 'cause you can't get it -- Up till now it's been wonderful.\" After that, it gets complicated. The writing is sharply witty. In the restaurant, at the very beginning, when Andrews and Preston meet, there is a hilarious exchange between Preston and the waiter, played by Graham Stark as one of those contemptuous French waiters who always seems distracted, as if mentally deconstructing La Pensee Sauvage, you know, and you're interrupting his cogitation. But Preston, being gay, is his equal. Stark pours a glass of white wine for Preston, who squints at it with distaste and remarks, \"The last time I saw something like this they had to shoot the horse.\" Preston is trying to dress Andrews as a man and teach her to act in a masculine fashion. He tells her thoughtfully, \"There are two main obstacles we must overcome.\" Andrews asks, \"My bosom?\", and then adds that if she has to bind her bosom for years it will wind up looking like an old wallet. After Andrews' success, Preston checks them into a three-star hotel and announces, \"You must see the bathroom. It's a religious experience.\" Much of the humor revolves around gender bending, of course, but the script treats the audience as reasonably sophisticated rather than 19th-century rural twits. I don't think Blake Edwards depends on shock value for laughs. The laughs arise out of the situations. There are a couple of songs thrown in. Julie Andrews has a splendid voice, and a range that runs from elephantine sub-rumble to air raid siren. The dance numbers are elaborately staged, with what I take to be a deliberate homage to Bob Fosse -- plenty of derbies, clicking fingers, and swiveling pelvises. There's a mostly dull romantic piece in the mosaic, done seriously, in which Andrews and Garner try to come to terms with the fact that they love each other, although if they want to keep her real sex a secret, they must go dancing at a gay bar. And some of the comic interludes seems a little forced, at least on multiple viewings. Andrews, in her masculine disguise, bravely accepts a cigar -- and coughs. She looks immeasurably better as a woman than as a man. And the final number, in which Preston is in drag and singing one of Andrews' numbers and falling all over himself, isn't really either imaginative or very amusing. But those are small things. Overall, this is a funny farce, skillfully written, directed, and performed."
      ],
      "genres": [
         "Comedy",
         "Music",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Peerford Ltd.",
         "Artista Management"
      ],
      "summaries": [
         "In 1934 Paris, trained coloratura soprano Victoria Grant, a native Brit, can't get a job as a singer and is having trouble making ends meet. She doesn't even have enough money for the basics of food and shelter. Gay cabaret singer Carole 'Toddy' Todd may befall the same fate as Victoria as he was just fired from his singing gig at a second rate club named Chez Lui. To solve both their problems, Toddy comes up with what he considers an inspired idea: with Toddy as her manager, Victoria, pretending to be a man, get a job singing as a female impersonator. If they pull this scheme off, Toddy vows Victoria, as her male alter ego, will be the toast of Paris and as such be extremely wealthy. That alter ego they decide is Polish Count Victor Grazinski, Toddy's ex-lover who was disowned by his family when they found out he was gay. The Count auditions for the city's leading agent, Andre Cassell, who, impressed, gets him a gig performing in the city's best nightclub. In the audience on the successful opening night is Chicago nightclub owner and \"businessman\" King Marchand, a stereotypical macho male who falls in the love with the woman he sees on stage, which doesn't sit well with his current girlfriend, Norma Cassady. King is shocked to learn that that woman is a man named Count Grazinski. While King tries to reconcile his romantic feelings for \"Victoria\" (in truth, King doesn't truly believe the Count is a man), his business associates won't tolerate his change in sexual orientation. Although feeling emancipated being treated as a man, Victoria, as herself, in turn falls in love with King. To pursue something with him as a woman would mean giving up this lucrative career. But the career may also come to an end in a jail term if the authorities find out that Victoria and Toddy have committed fraud in this impersonation.",
         "Set in 1930s Paris, starving opera singer Victoria (Julie Andrews) is aided by gay cabaret performer Toddy (Robert Preston). When Victoria dons Toddy's ex's clothes and then sends the abusive ex flying with a booming shout and an equally booming right hook, Toddy is hit with inspiration: he'll pass her off as a female impersonator. A woman pretending to be a man pretending to be a woman? It all goes well until Chicago \"businessman\" King Marchand (James Garner), starts to investigate, sure that a man like himself could never fall for another man! The revelation of Kings infatuation brings his body guard 'Squash' Bernstein (Alex Karras) roaring out of the closet and his spurned moll Norma Cassady (brilliantly acted by Leslie Ann Warren) off to Chicago to plan revenge with King's other \"business associates\".",
         "Victoria is a poverty-stricken soprano trying to find work in Paris in the 1930's. With the help of a worldly-wise nightclub singer, she invents her alter-ego Victor, a female impersonator who is hired to sing at a fashionable night spot. \"You want me to be a woman pretending to be a man pretending to be a woman?\" Interwoven throughout the comedy and musical numbers are some surprisingly astute observations about gender perceptions, discrimination and the battle of the sexes.",
         "A struggling female soprano finds work playing a male female impersonator, but it complicates her personal life."
      ],
      "budget": 0
   },
   "movielensId": 1081,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1982-04-25",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Blake Edwards"],
      "runtime": 132,
      "movieId": 1081,
      "title": "Victor/Victoria",
      "mpaa": "PG",
      "actors": [
         "Julie Andrews",
         "James Garner",
         "Robert Preston",
         "Lesley Ann Warren",
         "Alex Karras",
         "John Rhys-Davies",
         "Graham Stark",
         "Malcolm Jamieson",
         "Peter Arne",
         "Sherloque Tanney",
         "Geoffrey Edwards",
         "Matyelok Gibbs"
      ],
      "imdbMovieId": "0084865",
      "originalTitle": "Victor/Victoria",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["VksW-4TzlFo"],
      "plotSummary": "A struggling female soprano finds work playing a male female impersonator, but it complicates her personal life.",
      "tmdbMovieId": 12614,
      "avgRating": 3.50884,
      "releaseYear": "1982",
      "numRatings": 4127,
      "posterPath": "/8LMzl4oHkzpZN9b7EA9NPye8MNe.jpg"
   }
}