{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "politics",
         "id": 6078
      }],
      "imdb_id": "tt0068334",
      "video": false,
      "title": "The Candidate",
      "recommendations": [
         14268,
         1772,
         32075,
         28528,
         25010,
         142374,
         32686,
         142373,
         41461,
         26426,
         20263,
         40555,
         92819,
         40522,
         134184,
         48280,
         62327,
         17185,
         30162,
         43138
      ],
      "backdrop_path": "/cORjdju3DrmH08P4AeSCF7HoMP9.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Andres Gomez",
         "id": "55aadfcc9251411e110061f6",
         "content": "The cast is really good and Redford delivers a great performance. The story depicts the trip from an activist in the way to become the politician he was despising from the beginning, showing all the things that is is dropping in the raise to the election.\r\n\r\nHowever, the story is a bit rushed and the transfixing is not so evident as it could have been depicted.",
         "url": "https://www.themoviedb.org/review/55aadfcc9251411e110061f6"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bill McKay",
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011cef",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Marvin Lucas",
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011cf3",
               "name": "Peter Boyle",
               "profile_path": "/hAZw6rJlAemlqND09Km7qGvpZ6D.jpg",
               "id": 1039,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "John J. McKay",
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011cfd",
               "name": "Melvyn Douglas",
               "profile_path": "/to1UafQjBjZcN31AAS4fjmubk9Q.jpg",
               "id": 19550,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Senator Crocker Jarmon",
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011d01",
               "name": "Don Porter",
               "profile_path": "/6ZICq6pp1CCyplymj3gMoa3ktvL.jpg",
               "id": 94294,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Klein",
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011d05",
               "name": "Allen Garfield",
               "profile_path": "/ayvlc1cfZXF4j9ik4QUmKHJ5mC6.jpg",
               "id": 922,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Nancy McKay",
               "gender": 1,
               "credit_id": "52fe4424c3a368484e011d09",
               "name": "Karen Carlson",
               "profile_path": "/7d1FGqe0SNXl0tAxlVor56cyZFQ.jpg",
               "id": 92680,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Rick Jenkin",
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011d0d",
               "name": "Quinn K. Redeker",
               "profile_path": "/xVUJZjrKBAgymHxXKzRa4U9j9I9.jpg",
               "id": 91371,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Wally Henderson",
               "gender": 0,
               "credit_id": "52fe4424c3a368484e011d11",
               "name": "Morgan Upton",
               "profile_path": "/c6cHfJSxRl6Z9D2BcYNELq9ZwEZ.jpg",
               "id": 160947,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Paul Corliss",
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011d15",
               "name": "Michael Lerner",
               "profile_path": "/7VlkzO1z5wh96UCXpPZ0rUFx8aN.jpg",
               "id": 4250,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4424c3a368484e011cf9",
               "name": "Michael Ritchie",
               "profile_path": "/62566NoTLMRVLdoE07RG1B55zxy.jpg",
               "id": 12964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4424c3a368484e011d1b",
               "name": "Jeremy Larner",
               "profile_path": null,
               "id": 225697,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5985f4bcc3a36832340008c4",
               "name": "John Rubinstein",
               "profile_path": "/jyHEmKDxlCCxWnsM8hPoCpj0Bn.jpg",
               "id": 44261,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5985f4c39251413d420007fe",
               "name": "Victor J. Kemper",
               "profile_path": null,
               "id": 14536,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5985f4cac3a36832510007cb",
               "name": "Walter Coblenz",
               "profile_path": null,
               "id": 13718,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5985f4d29251413d42000816",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5985f4d99251413d1800085a",
               "name": "Nelson Rising",
               "profile_path": null,
               "id": 1864176,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5985f4df9251413d18000863",
               "name": "Robert Estrin",
               "profile_path": null,
               "id": 4141,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5985f4e99251413d53000851",
               "name": "Richard A. Harris",
               "profile_path": null,
               "id": 3985,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5985f4efc3a368329b000917",
               "name": "Hoyt Bowers",
               "profile_path": null,
               "id": 78390,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5985f4f59251413d5300085e",
               "name": "Gene Callahan",
               "profile_path": null,
               "id": 14879,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5985f4fb9251413d4a000874",
               "name": "Patrizia von Brandenstein",
               "profile_path": "/6UtivvIJJPZTDAaQpY5TOfRA8sb.jpg",
               "id": 6494,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5985f5019251413d53000874",
               "name": "Patricia Norris",
               "profile_path": "/gZQZwyO3fckr0qNOxTDwxEK442F.jpg",
               "id": 5634,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.202282,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21711,
      "vote_count": 45,
      "budget": 0,
      "overview": "Bill McKay is a candidate for the U.S. Senate from California. He has no hope of winning, so he is willing to tweak the establishment.",
      "similar": [
         77953,
         10139,
         9388,
         10316,
         5125,
         8834,
         9452,
         35056,
         2503,
         891,
         68,
         665,
         9798,
         582,
         10200,
         23631,
         399055,
         402897,
         376290,
         446354
      ],
      "original_title": "The Candidate",
      "runtime": 110,
      "poster_path": "/8lC09MS1xO9mbtF54fIaJjEbckV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Redford-Ritchie Productions",
            "id": 8776,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1972-08-23",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Too Handsome. Too Young. Too Liberal. Doesn't have a chance. He's PERFECT!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Ritchie"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Jeremy Larner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068334/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3MDI5Njc4NV5BMl5BanBnXkFtZTcwNjU5MDYyMQ@@._V1_SY316_CR1,0,214,316_AL_.jpg",
      "actors": ["Stars: Robert Redford, Peter Boyle, Melvyn Douglas | See full cast and crew »"],
      "reviews": [
         "I saw this film in 1972 when it came out, and I just saw it again on cable. I am amazed at how prescient this film was. Remember, this was before Jerry Brown, the real life politician most people will think of as a counterpart to Redford's character, had not yet run for governor and was still unknown outside of California. Nixon was still in office and was about to be re-elected by a landslide. Abortion was still illegal in all 50 states, and Roe v. Wade had not yet been decided. The term \"sound bite\" had not yet been coined. \"Spin\" was something a washing machine did. Redford plays an idealistic young storefront lawyer who is persuaded to run for the Senate as a Democrat against a Republican incumbent running for his fourth term. He feels free to speak his mind because he knows he hasn't a chance of winning. His freshness and honesty win over a lot of people favorable to his politics, and suddenly the gap closes. Now he has a chance of winning, but to do so he has to win over the \"undecided voters\" in the middle of the political spectrum. (Sound familiar? I'm writing this nine days before the Bush-Kerry election, and no one knows who will win.) Guess what happens? Suddenly he's not so fresh and honest anymore. And by the time he finally has a televised debate with the incumbent, he has mastered the art of the non-answer answer, that is, responding to a reporter's question by making a vague statement of his own without ever answering the question. Fast forward to 2004. The spin doctors now run the show. This film was intended as satire and as a warning. Regrettably, it has become a prediction. 10/10",
         "Michael Ritchie seems to have this thing for competition -- whether downhill racing, body building, water skiing, or, as here, politics. This isn't my favorite human motive, besting other people, so this one comes as a rather pleasant surprise, laden as it is with more social and political content than the with the details of the quest. I mean -- Redford doesn't even want the office! \"The Candidate\" has the appearance of a made-for-TV movie. The credits are presented simply, as in a TV movies. There is no underscore but the music that we hear consists of marches with lots of drums and sometimes one or two instruments hitting clinkers, as they would on a bandstand behind a speaker. The photography is highly colored and flat, as in a TV movie. Everybody seems to be dressed in suits or riding costumes. They look overly made up, freshly preened and pruned. They drive big new American cars and live in splendidly arid modern homes. In short they appear to lead the kind of lives to which naive screenwriters aspire. That out of the way, this is a pretty brave movie. It's a story of an innocent and blunt lawyer who become progressively corrupted during the campaign as victory seems more nearly in his grasp and the grasp of his managers. They 86 his sideburns and give him a haircut and put him in expensive suits. Girls love him because he displays such, well, such Robert Redforness. One guy belts him in the mouth at a rally and I can understand why. All men as handsome as Robert Redford should be illegal. But he does a decent job in his minimal way. His forte lies in little moves, as when he cocks his head and says quizzically, \"Eh\"? Everybody else is quite good too, though his wife is mostly decorative. Peter Boyle is fine, and Allan Garfinkle is always believable as a cynical scuzz. You have to admire the way the script does not spare Redford's character. He may be an idealist at first. What does he think of abortion? \"I'm for it.\" How about property taxes. \"I don't know.\" By the end of the movie he's learned fluent politicospeak. How's he feel about busing? \"You can't solve the problems of this country with a bus.\" (Right.) He knows that he's selling himself out but he wants to WIN. As the campaign gets into high gear he's late for a meeting with a labor leader, a grizzled Kenneth Toby given to smoking pinched little cigarettes. Everybody in the room is wondering where Redford is, and how he can treat an important man like Toby with such disrespect. And where is he? We see the door to a hotel room open and a gorgeous groupie emerge. A few seconds later Redford comes out buttoning his jacket. Nothing much is made of this incident. Boyle watches this parade in the hallway, staring after the girl, but nobody says anything and the scene lasts for only a few seconds. And here is where Ritchie and the writers earn my respect. Think of how easily this very effective scene could have been demolished. Boyle stopping the groupie and demanding to know what's been going on. Boyle admonishing Redford for cheating on his wife -- \"If this ever gets out our goose is cooked!\" Redford protesting that his private life is his own business. But none of this happens. Not in this scene or in any of the others in which a piece of character is revealed. Ritchie trusts in the perspicacity of the viewer. He shows us, because he doesn't have to tell us. He figures we're smart enough to pick up this clues by ourselves. Thank you, Mister Ritchie. We should be grateful to the writer as well, and to Redford's improvisational talents, when, alone in a car's rear seat, half crazed, he mangles the stump speech he's given a thousand times and comes up with a hilarious parody: \"The basic indifference that made this country great.\" Also admirable is that the movie deals with specific issues -- abortion, busing, unemployment, fire hazard, health concerns -- and Redford is the Democratic candidate while Don Porter is the Republican candidate (imagine actually NAMING the political parties and risking losing half the audience). Porter comes across like an actor, an old ham of an actor, which suits the part. He's smooth and wily at seducing the public, a kind of Don Juan of the political arena. Ritchie has taken some real chances here. Porter comes up with something like, \"Oh, sure, when I was a kid we were all poor too. Why some of us didn't even have our own SOCIAL WORKER.\" It took guts to make this movie. And talent to make it so well.",
         "Robert Redford plays idealistic senate candidate Bill McKay. He's mainly running to bring certain political issues into the open, although he never actually plans to win. But as time goes by, he realizes that whether or not he wins, he might not be able to hold on to his values. \"The Candidate\" is one of the many great movies about the world of politics. It holds up as well today as it did in 1972 (maybe even better). Redford gives a solid performance, as does Peter Boyle as campaign manager Marvin Lucas. One of the most insightful scenes is the debate between McKay and his opponent about the issues. A great movie in every way. Look for appearances by Natalie Wood, Groucho Marx, and Howard K. Smith.",
         "Robert Redford, in one of his unjustly overlooked films from 1972, stars as a lawyer and the son of the former governor of the state of California in an election year where the senatorial incumbent has no competition. Peter Boyle convinces Redford to run, fully expecting and anticipating to lose, therefore being able to run on a platform of pure integrity to show how out of touch the current senator has become. But suddenly the public realizes that some fresh, younger blood with an idealistic eye might be what they truly want rather than another in a long succession of terms by the same old huckster. Melvyn Douglas also stars as Redford's father. Even though this film is almost 30 years old, the Oscar-winning screenplay by Jeremy Larner shows just how timeless the same old issues the candidate has to decide where he stands upon (abortion, the environment, health care) actually are. The script really is eye-opening, because it underlines very well the point that even if, say, Jesus Christ were to run for office today, what He would say is not as important as how and when He'd say it. Directed by Michael Ritchie (Smile, The Bad News Bears, Semi-Tough), one of the few American directors who has been able to successfully show the black humor of the strange, fetid underbelly of competition in this society. Blink and you'll miss Natalie Wood at a fund-raiser. Completely climatized to the Seventies, she looks like Donovan's aide-de-camp.",
         "The Candidate, 1972, was a film that really made me think. It takes you through Bill McKay's campaign for California senator - and shows how an idealistic and inexperienced young man gets trapped by the media system. Most plot summaries will tell you that it is about how he gives the political system a kick - but I found that it was really more about how he became lost in it. It seemed that it was more of an 'outside' movie than an 'inside' one - there is always some mystery about what is going on inside everyone's heads. Robert Redford is really very good here as McKay - watch for a speech he makes to himself in the car. Peter Boyle also gave a thought-provoking performance, as Bill McKay's smooth-talking campaign manager. A sad commentary on the way things work. Very relevant. I recommend it for fans of Robert Redford or anybody interested in politics or media. 7 out of 10.",
         "This is a truly excellent and overlooked Redford vehicle, and his performance comes full circle. From wide-eyed idealism to resigned cynicism, all the way back to little-boy-lost and overwhelmed. Redford is flawless! Peter Boyle is right-on as the experienced campaign hand. Also it is easy to overlook Don Porter's effortless portrayal of the smooth and experienced incumbent senator, just on the verge of decline. Porter's seamless delivery makes it look easy. Douglas is also excellent as John J. McKay, Redford's father and the former governor. Obviously a traditional machine politician, and apparently estranged from his activist son for that, and perhaps for other reasons we are left to imagine, Douglas revels in the younger man's initiation to the corrupt world of politics. Catch the hunting scene to illustrate how these two are poles apart. An intelligent, realistic, and rewarding film about politics, done at a time when folks were perhaps looking for a political fairy tale.",
         "Redford plays Bill McKay, a crusading lawyer who happens to be the son of a former governor of California, a fact he plays down. When incumbent Republican Crocker Jarmon (Don Porter) is running for his umpteenth term in the senate, kingmaker Marvin Lucas (Peter Boyle) decides to tap Bill as a wild, dark horse candidate. While young McKay is initially suspicious and unwilling, Lucas tells him he can do whatever he likes and say whatever he likes on the campaign trail because no one expects him to win. With that freedom in mind, McKay sets off to run a very different style of campaign. The acting here is all top notch. Redford, a natural for the cameras, manages to make McKay fairly awkward and uncomfortable in the early going, but as he warms to being what a candidate is all about, he takes to the campaign trail amazingly well. Boyle is also excellent as the kind of old bastard it always takes to win one of these races, the political insider every race needs to smooth over the opposition within the party and crucify those without. Porter is also good as Jarmon, showing a stiff, wooden, conservative incumbent who must have seemed hopelessly out of date in 1972 -- especially considering his dashing, youthful opposition -- but who also sounds oddly like any politician in office today, with his talk of loving America and supporting business. The movie makes a very keen point about what people have to do to get elected, and we see a slow whittling of McKay's priorities as he must sacrifice his principles one by one in order to get elected. By the end of the campaign, the fresh-faced, honest young man we were introduced to at the start is gone, replaced by a slick image who is all things to all people. To be fair McKay fights this process, but the movie makes a strong point that, simply, this is what is required in order to win. The end note -- McKay asking Lucas \"What do we do now?\" is both telling and chilling, that even thirty years ago, there was such distrust and distaste for politics and what it did to people (and this was a year *before* Watergate). The Candidate still plays well despite some dated material, and the lessons it offers about politics and what it does to people still apply today. This is a film well worth your time investigating.",
         "\"If nothing counts, then everything does.\" \u0096 Michael Connelly Some points... 1. \"The Candidate\" stars Robert Redford as Bill McKay, a young lawyer who is manipulated into running against the Democratic candidate of California by political election specialist, Marvin Lucas 2. The film highlights how front-running politicians are often groomed by a team of \"handlers\" and \"election specialists\". The end result is less a person and more some cookie-cutter \"one man for all people\" fantasy image. (historically, \"young/vibrant presidents\" often follow \"old/seemingly wise presidents\", the public always bouncing from one extreme to the next, forever dissatisfied) 3. The film charts how disillusioned those within the political sphere often become. McKay goes from an idealistic lawyer who fights in the public's interest, to a man who spouts banal slogans and vapid sound bites. 4. How to win an election: have no clear political message. Stick to vague promises and appealing catchphrases. Promise change but specify nothing. 5. The film highlights how in-bred \"democratic politics\" has become. Everyone's father is in the business, everyone's calling in favours, scratching backs and providing a helping hand. 6. Studies show that, not only do a disproportionate number of sons follow their fathers into politics, but that those sons who lost or were separated from their fathers at an early age, or view their \"politician fathers\" as failures, often climb higher into power then their parents. There's some seriously warped psychological issues going on there. 7. Those drawn to politics are often those worse suited to the job. Those idealistic few who join for noble purposes, are soon crushed by the system. 8. Politicians: automatons, cult like drones who adopt the speech patterns of those they admire and surround themselves with. Democracy: forever dependent on voter gullibility. 9. After McKay wins the election at the end of the film, he turns to his handlers and says, \"What do we do now?\" What indeed. If the process of winning an election is so difficult, so time consuming, one imagines that staying in power will become a similarly all consuming and obsessive task. The politician cares not about bettering society, but about doing what is necessary to stay in power. 10. Most social changes, benefits, progress etc, occur despite politicians/politics, not because of it. 11. Politics in the television age: image driven, a circus act, empty spectacle, pure entertainment, voters asked to choose a leader like they choose a detergent brand. 12. McKay's political colours (yellow, green) deliberately revoke the reds, whites and blues of Americana. Only at the end, when he wins and is fully corrupted, does he succumb, his car now draped in reds, whites and blues. 13. Films like this were common in the 70s, many evoking the paranoia of the time period: \"The Parallax View\", \"Three Days of the Condor\", \"Z\", \"All The President's Men\", \"The Manchurian Candidate\" etc. 14. French sociologist Jacques Ellul argued in his book, \"Propaganda\", that it matters little what propagandists stand for or what their ends are (Liberal, Conservative, Republican, Democrat etc), because they are all taking part in an exercise that is fundamentally dehumanizing and anti-democratic. McKay may be a handsome, sympathetic icon of liberalism and virtue, but ultimately this isn't important. McKay and what he stands for will inevitably be overcome by the political machine he inhabits. He's no different from his opponent. 15. Ellul discussed this idea further in \"The Technological Society\". Here he argues that we are now so obsessed with technology and efficiency \u0097 with that one very best way to achieve a predetermined goal \u0097 that we have lost sight of our actions and, in a fundamental way, of what it means to be human. This idea is apparent throughout the film, the political campaign run by a hive of specialised robot consultants and a candidate who misplaces some of his humanness once he becomes obsessed with getting his \"numbers\" to move in the right direction. Poll numbers, soft-money loopholes, attack ads, phone ratings...this is politics meets Game Theory. 16: The religion of the future: the cult of control, of number worship, of data mining, of information gathering. Theory: security equals more data. Reality: Chaos. 8/10 \u0096 Excellent. The problem with these films, though, is that we as a modern audience are so aware of the problems, are so cynical towards politics anyway, that these films all amount to wasted preaching. Perhaps the realisation is that it is arrogant to assume that one man, one bill passed by congress, has the effect to instigate meaningful change, especially now that we live in a world where the big social changes seem to occur irrationally, often by accident (a world where a woman like Rosa Parks sitting in the back of a bus ends racial segregation?). One is then forced to make an almost Sartrean leap. If nothing counts, then why enter politics? Which leads to, if nothing counts, then everything does. Worth one viewing.",
         "Robert Redford, the idealistic son of a former party machine governor, gets encouraged into running for the U.S. Senate by a coterie of professional handlers. Fascinating film, alternately satiric, cynical, subtle, and ironic. Shot mostly in a documentary style. A must for cynics and/or political junkies; others won't care. A good performance by Redford is complimented by fine work by Boyle and Garfield. Douglas is also great as the candidate's father. One of filmdom's classic closing lines. 2 stars of 4 on a tough scale.",
         "\"The Candidate\" is a film which has something in common with Sidney Lumet's \"Power\" from the following decade. Both films look at the role played by political consultants, what would today be called \"spin doctors\", in the American electoral process, and both were made at a time when there was a popular conservative Republican in the White House, Nixon in 1972 and Reagan in the eighties. (Prior to the Watergate scandal, Nixon was highly popular, as indicated by his landslide win in that year's Presidential election). One difference between the films is that in \"Power\" more attention is paid to the personality of the spin doctor, whereas here it is the candidate himself who is at the centre. The film tells the story of a campaign for a Senate seat in California, currently held by another popular conservative Republican, Senator Crocker Jarmon. The Democratic candidate is Bill McKay, an idealistic, charismatic and politically liberal lawyer. Much of the film deals with the relationship between McKay and his spin doctor Marvin Lucas, who endeavours to persuade McKay to tone down his radical rhetoric, especially on controversial issues like abortion and school bussing, and to make himself a bland, centrist candidate, all things to all men. The script was written by Jeremy Larner, who had been a speechwriter for the liberal Senator Eugene McCarthy during the 1968 Presidential election campaign, so was presumably made with a liberal agenda in mind. It seems, however, to have ended up as one of those films which were ostensibly made from a liberal standpoint but which are just as capable of being interpreted in a conservative, or at least a centrist, fashion. (Others that come to mind include \"High Noon\" and \"Seven Days in May\"). Larner may have intended an indictment of the way in which the US political system discourages genuinely radical debate of issues such as poverty and race relations. The storyline, however, in which McKay comes back from a seemingly hopeless position to win the race, could also be interpreted as a warning that the Democrats must abandon radicalism and seek out the centre ground if they are to win elections. (If that was indeed the film's message, it was sadly lost on George McGovern, their candidate for President that year). Of course, Larner had put himself in a difficult position; had he written an ending in which Jarmon won the election, some might have seen this as an endorsement of conservative Republicanism. The film is made in a rather dry, semi-documentary style, concentrating more on political debate than on personal issues. There is a suggestion that McKay, a married man, may be having an affair with another woman, but this issue is given far less prominence that it would be in most political dramas. The personal relationship which is given most prominence is the rather difficult one between McKay and his more conservative father John, a former State Governor, who is initially reluctant to endorse his son's campaign. McKay is played by Robert Redford, one of Hollywood's most prominent liberals and a huge star in the seventies, but he cannot do much with the role; McKay comes across as little more than a handsome, charismatic mouthpiece for a set of ideas, some of which are not really even his own. Peter Boyle as Lucas and Don Porter as Jarmon are rather better, but to my mind this is a film which never really comes to life. Some of the issues have a certain modern resonance; many of Jarmon's speeches, for example, would go down well with the current \"Tea Party\" movement. Overall, however, my impression was that, while \"The Candidate\" may have been controversial in 1972, today is just comes across as a dull debate about the politics of forty years ago. \"Power\" has its faults, but it has held up rather better as an examination of the role of the spin doctor. 5/10"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Redford-Ritchie Productions",
         "Wildwood Enterprises"
      ],
      "summaries": [
         "Californian lawyer Bill McKay fights for the little man. His charisma and integrity get him noticed by the Democratic Party machine and he is persuaded to run for the Senate against an apparently unassailable incumbent. It's agreed he can handle it his own way, on his own terms. But once he's in the race and his prospects begin to improve, the deal starts to change.",
         "Idealistic young lawyer Bill McKay (Robert Redford), thoroughly involved with civil rights, legal aid and ecology, agrees to run for the U.S. Senate - not to win, he tells himself, but to bring vital issues before the voters. He despises political deals and compromises, but when the possibility of victory overshadows what seemed like certain defeat, his integrity begins to weaken. A fascinating and dynamic character study showing all the inner conflicts of a decent man torn between his ambition and his conscience. It tells what it costs - emotionally, morally, financially - to run for public office, and conveys all the doubts, all the self deceptions and ultimately all the cynicism of a man who knows he has sold out for something he isn't sure he really wants. Oscar-winning screenplay by Jeremy Lardner.",
         "Handsome Bill McKay is not his father's son, his father being former California Governor, John J. McKay. An idealistic civil rights lawyer, Bill believes the political process is all style over substance, and thus he can accomplish more for the people, many of those disenfranchised, in his role as lawyer than politician. For the upcoming midterm election, Bill is approached by strategist Marvin Lucas to contest the Democratic nomination for the California senate seat, the actual election against wildly popular Republican incumbent, Crocker Jarmon. Marvin is able to sell Bill, with his supportive wife Nancy at his side, on the idea as he can easily win the nomination, but has no chance of winning the actual election against Jarmon and thus he can freely speak his mind to the California electorate. Bill's biggest condition is that his father not be involved at all, Bill not wanting his father's legacy to overshadow any of his own messages. Unfortunately for Bill, McKay Sr. may influence Bill's campaign whether or not he is directly involved. What Bill did not account for is that he has to make a credible showing or else his own reputation as a human being may be in jeopardy. So as the polls continually change for the good or bad for Bill, he may buckle under the pressure to become what he didn't want to be in the first place. His entire life, including his marriage, may also be totally taken over by the campaign process until election day.",
         "Bill McKay is a candidate for the U.S. Senate from California. He has no hope of winning, so he is willing to tweak the establishment."
      ],
      "budget": 0
   },
   "movielensId": 1082,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-08-23",
      "dvdReleaseDate": "1997-10-28",
      "directors": ["Michael Ritchie"],
      "runtime": 110,
      "movieId": 1082,
      "title": "The Candidate",
      "mpaa": "",
      "actors": [
         "Robert Redford",
         "Peter Boyle",
         "Melvyn Douglas",
         "Don Porter",
         "Allen Garfield",
         "Karen Carlson",
         "Quinn K. Redeker",
         "Morgan Upton",
         "Michael Lerner"
      ],
      "imdbMovieId": "0068334",
      "originalTitle": "The Candidate",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "BOQPI6ykCqA",
         "oa30W7vLP2o",
         "UEBJ9D6y614"
      ],
      "plotSummary": "Bill McKay is a candidate for the U.S. Senate from California. He has no hope of winning, so he is willing to tweak the establishment.",
      "tmdbMovieId": 21711,
      "avgRating": 3.63639,
      "releaseYear": "1972",
      "numRatings": 1954,
      "posterPath": "/8lC09MS1xO9mbtF54fIaJjEbckV.jpg"
   }
}