{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "slapstick",
            "id": 9253
         },
         {
            "name": "ensemble cast",
            "id": 159753
         },
         {
            "name": "automobile racing",
            "id": 159953
         },
         {
            "name": "cross country race",
            "id": 196401
         },
         {
            "name": "turn of the century",
            "id": 205850
         }
      ],
      "imdb_id": "tt0059243",
      "video": false,
      "title": "The Great Race",
      "recommendations": [
         10338,
         14584,
         26175,
         16905,
         35992,
         17696,
         43812,
         898,
         14741,
         26201,
         42728,
         42010,
         19137,
         26268,
         11574,
         26516,
         26520,
         26817,
         74719,
         28290
      ],
      "backdrop_path": "/vga7453tBLXDqxeTV2IGUpVgIgk.jpg",
      "revenue": 25333333,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Prof. Fate",
               "gender": 2,
               "credit_id": "52fe445e9251416c7503256f",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Great Leslie",
               "gender": 2,
               "credit_id": "52fe445e9251416c75032573",
               "name": "Tony Curtis",
               "profile_path": "/4aSmN9M4BbFJbNaMSnjGJHffehQ.jpg",
               "id": 3150,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maggie Dubois",
               "gender": 1,
               "credit_id": "52fe445e9251416c75032577",
               "name": "Natalie Wood",
               "profile_path": "/1Z4HYNFGVpXfvteNLGJteetojfW.jpg",
               "id": 2769,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe445e9251416c7503257b",
               "name": "Peter Falk",
               "profile_path": "/mjgykviG6rY2WlF14aeDRsvVA6x.jpg",
               "id": 2314,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Hezekiah Sturdy",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325a3",
               "name": "Keenan Wynn",
               "profile_path": "/vKRcpt50Eh9AQ6yi9umy1YFZWyf.jpg",
               "id": 4966,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Henry Goodbody",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325a7",
               "name": "Arthur O'Connell",
               "profile_path": "/rWoLpGwQlIZSiPIzJqE1yIMiDxr.jpg",
               "id": 857,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Hester Goodbody",
               "gender": 1,
               "credit_id": "52fe445f9251416c750325ab",
               "name": "Vivian Vance",
               "profile_path": "/z9D5Ys28CZAnHk9kv6q5mbx4Srk.jpg",
               "id": 153254,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Lily Olay",
               "gender": 1,
               "credit_id": "52fe445f9251416c750325af",
               "name": "Dorothy Provine",
               "profile_path": "/wUVHMjjfYNUHh5hlQYcl5rxpV5H.jpg",
               "id": 29717,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Texas Jack",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325b3",
               "name": "Larry Storch",
               "profile_path": "/ZGsMveB21D6n2r7bKCH30Xhrr4.jpg",
               "id": 151644,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Baron Rolfe Von Stuppe",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325b7",
               "name": "Ross Martin",
               "profile_path": "/z19bM6CcQxNgmbPG0gqOKJDIyhC.jpg",
               "id": 51763,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "General Kuhster",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325bb",
               "name": "George Macready",
               "profile_path": "/t1xXYLfj7KSn2YQ3cKJ4V5ZYoQV.jpg",
               "id": 14564,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Frisbee",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325bf",
               "name": "Marvin Kaplan",
               "profile_path": "/fcritL1y9mNa55lnEpvbc3mPllO.jpg",
               "id": 127643,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Mayor of Boracho",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325c3",
               "name": "Hal Smith",
               "profile_path": "/67zxG00wgqe1uqR05veeZZnzK7A.jpg",
               "id": 25627,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Sheriff",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325c7",
               "name": "Denver Pyle",
               "profile_path": "/cnO648FW7r1NQqHZsPkJBACfXal.jpg",
               "id": 6462,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Baron's Guard",
               "gender": 2,
               "credit_id": "52fe445f9251416c750325cb",
               "name": "William Bryant",
               "profile_path": "/pDCdDtLA4hmrdLtXoB4ZzexMPEp.jpg",
               "id": 97281,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Saloon Brawler",
               "gender": 2,
               "credit_id": "56f6582392514155fe002951",
               "name": "Hal Needham",
               "profile_path": "/u2JnSd9p1yWLXwEy9pCJ7Wjg2FG.jpg",
               "id": 67767,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Mayor-Domo",
               "gender": 2,
               "credit_id": "56f6583dc3a36816e80024db",
               "name": "Raoul Retzer",
               "profile_path": "/pFzPPgJHK3QPM7NMy9vvBQxhcDY.jpg",
               "id": 47272,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe445e9251416c75032581",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe445e9251416c75032587",
               "name": "Arthur A. Ross",
               "profile_path": null,
               "id": 67687,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe445e9251416c7503258d",
               "name": "Martin Jurow",
               "profile_path": null,
               "id": 1928,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445e9251416c75032593",
               "name": "Henry Mancini",
               "profile_path": "/sXl1lCYNnSf10ESG1nyCEDYGs1L.jpg",
               "id": 1938,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445e9251416c75032599",
               "name": "Russell Harlan",
               "profile_path": "/yDYlBTYPEMARI8sKwPjnleqQvFL.jpg",
               "id": 4308,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe445f9251416c7503259f",
               "name": "Ralph E. Winters",
               "profile_path": null,
               "id": 10007,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.743031,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11575,
      "vote_count": 75,
      "budget": 12000000,
      "overview": "Professional daredevil and white-suited hero, The Great Leslie, convinces turn-of-the-century auto makers that a race from New York to Paris (westward across America, the Bering Straight and Russia) will help to promote automobile sales. Leslie's arch-rival, the mustached and black-attired Professor Fate vows to beat Leslie to the finish line in a car of Fate's own invention.",
      "similar": [
         87818,
         10184,
         27578,
         3082,
         76163,
         500,
         1164,
         96721,
         83542,
         621,
         9718,
         345920,
         9530,
         13161,
         8293,
         11576,
         14136,
         6916,
         992,
         27932
      ],
      "original_title": "The Great Race",
      "runtime": 160,
      "poster_path": "/9rL8GWuFdO3fLXcNV9rZRHskoOn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1965-07-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "The movie with 20,000-mile or one-million-laughs guarantee!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Blake Edwards"],
      "runtime": 160,
      "synopsis": "Tony Curtis and Jack Lemmon are reunited again, this time with Blake Edwards at the wheel of this epic farce. In an homage to the great silent stars--Charlie Chaplin and Buster Keaton--\"The Great Race\" is classic slapstick and grand adventure combined. The film takes us back to the early days of automobiles, a time when there were hundreds of designers rolling out hand-crafted masterpieces fondly called 'motor cars.' The plot involves an around-the-world motor car race with Tony Curtis, representing good, always impeccably dressed in white and well-mannered. He is the gentleman adventurer and motor car enthusiast who has entered the race with a sporty white roadster. He opens doors and stops to help a lady, even if it happens to be in the middle of a race. Jack Lemmon plays the villain and Curtis' fiercest opponent, dressed of course all in black with a bumbling sidekick a la Lex Luthor in Superman. He drives what only a sinister scientist like Dr. Frankenstein could envision, a machine that is only an automobile in the loosest sense of the word. It is a child's fantasy of what should come standard with an internal combustion engine. There are more gadgets and contraptions that have nothing to do with motoring of course, but everything to do with killing the competition... literally. Curtis has Keenan Wynn as aide, assitant and butler rolled into one highly competent navigator. He is both caricature and anachronism as the misogynistic and chauvanistic eighteenth-century English man servant whose fidelity to position and service is constantly at war with his distrust of women. Right on cue Natalie Woods appears, as the sizzling suffragette supreme, perfectly adorned in full Victorian splendor and parasol to boot. Ms Woods is as stunning as ever and she does her damndest to befuddle Mr. Wynn. She plays the first female reporter for the establisment newspaper. In addition to Mr. Wynn, Ms. Woods bedevils the paper's editor by ignoring his every directive to stay out of the newspaper business and especially his office. His authority though is tenuous at best and constantly undermined by the incessant nagging from his bullying front lineman of a wife who is sympathetic to the women's movement embodied by Ms. Woods. He is well on his way to a nervous breakdown and emasculated to the point that he can no longer summon the resolve to deny Ms. Woods the choice assignment of covering the race. But, as only a true champion of women's rights could cover it, she does so undercover as a contestant, entering a motor car paid for, naturally, by the newspaper. \"The Great Race\" is a romp as only a director and an experienced cast esembled here could pull off. It is a film that both celebrates and reinvents the art of story-telling on a big screen. Certainly it is the kind of classic film-making that has been forgotten in an era of big stars, short attention spans and revenue-maximizing studios who want the run time limited to double-digits so they can squeeze in another showing at the local cinelplex. Introduce this one to your kids, though. There is more than enough action and plenty of pratfalls to keep even the most hyperactive riveted to the screen.",
      "writers": [
         "Arthur A. Ross",
         "Blake Edwards"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059243/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1MzkzNTU3M15BMl5BanBnXkFtZTcwNzAzNjUxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Tony Curtis, Natalie Wood, Jack Lemmon | See full cast and crew »"],
      "reviews": [
         "Although \"It's A Mad, Mad, Mad, Mad World\" was the first comedy to get the epic film treatment, \"The Great Race\" is in my opinion the best epic comedy. It's just a much funnier film with so many laughs in its first half that the more serious part dealing with the palace intrigues and the straight sword fight acts more as a breather for the viewer before it revs up again with the funniest pie fight of all time and the smashing (literally) finale. Jack Lemmon shows why he was probably the most versatile comic actor of the 50-60s next to Peter Sellers (this is a long ways from the Lemmon of \"The Apartment\" or \"Irma La Douce\"!). Peter Falk, a decade before \"Columbo\" is hysterical too, while Natalie Wood never looked more sexy (except for the last part of \"Gypsy\") than she does here. They don't make this kind of simple comedy devoid of crudity any longer. That's what makes a film like \"The Great Race\" something to keep coming back to and enjoying again and again.",
         "Now I've read most of the comments on this film and while I might agree with some of the more specific comments regarding the looser and less plausible plot in the last third of the film and that Natalie Wood might have been more of a contribution and less of a distraction, these are moot points. The film is funny, enjoyable and a great tribute to the heyday of silent villains and heroes in a way that doesn't overdo it. Curtis' flashing smile, Wynn's turn-of-the-century mechanic character, the harried and frazzled O'Connell as Goodbody, and especially Falk's on-again, off-again sycophant/lackey/nobody's fool Max are memorable and fun. But as much as I like the main movie, my fave bits are the early scenes in which Professor Fate, always in black and macabre emblems, tries to outdo the stunts of the gleaming white, perfect and popular Great Lesile Gallant III. The stunts are fun, witty and totally unbelieveable. The plane pickup, the rocket train, the garishly painted torpedo with a mawkishly wonderful gramaphone speaker on top are priceless Victorian images of a time that we all imagine existed but never really did. Lemmon is a gem as Fate, right from the great use of his eyes under thick brows and black hat, to the spooky house in his own Munster's décor to the crème de la crème, the Hannibal Twin 8 race car. That car is a masterpiece of mechanical and artistic design. I wonder where it is now. Even the sound it generates in the film, that sinister and harmonious hum are perfect for Fate's élan. What I've never understood is why I never heard more of Lemmon's comments on this film. It had to be fun to make and work with Curtis, but the role of Fate is so underrated. You never see it mentioned in Biography or any anthologies of Lemmon's work. I still roll in peals of laughter at his dizzy 'Let's see the Great Leslie try THAT one on for size...' as he passes out in the mud. Or when Max breaks off the moustache in the freezing storm, and all you see is Fate's astonished look of shock followed by a sideways glare that could cut glass. The last part of the film, the entire Prince Hapnik and Potsdorf sequences are less than helpful, and they really aren't needed, despite a record pie fight, but it does serve to give Lemmon another role, diametrically different from Fate. Again he uses his eyes and his voice to great effect. `Baron Rolf von SHTUPP!!'(Any relation to Lilly von Shtupp in Blazing Saddles?) With perfect timing. I mean it. Try it some time and you'll never match that unique panache which Lemmon displayed. All in all, a wonderful and fun film. No deep message, just good turn-of-the-century atmosphere, great gags and lively dialogue. Enjoy, and don't take it too seriously. After all, it's not PEARL HARBOR, is it? **** our of **** for me.",
         "I cannot believe that \"The Great Race\" did not make it on AFI's 100 Funniest Movies list (well, actually I CAN believe it, since those lists seem very messed up to me). In fact, it has not gotten nearly as much recognition as it deserves. It is simply one of the funniest movies I have ever seen! The whole cast shines (especially Lemmon, who should have won an Oscar for Best Scene Stealer). Besides the great slapstick, there are a million subtle details that you don't notice unless you are really paying attention. This is why the movie is still great after several viewings: each time you watch it, you are bound to catch some little joke you didn't see before. Everything about this movie cracks me up. The contrast in character between Tony Curtis and Jack Lemmon is just great, the chemistry between the different characters is great, the movie parodies are great, the sets are great, the slapstick is great, and the dialogue is great. Even the MUSIC is funny... every time that goofy theme music for Professor Fate starts playing, I start laughing. If you haven't seen this, I highly suggest you rent it. Yes, it is long, but it is one of the few comedies I have seen that keeps up the laughs consistently... it never sags or has dull moments. It is downright hilarious from start to finish. And to top it all off, it has some very cool cars.",
         "In the classic opening credit sequence just before where we are transported back to the days of the \"Magic lamp\" slide projection shows, we are given a hint of what is to come when a tribute salute \" For Mr Laurel & Mr Hardy \" appears on the screen. Yes this movie does owe something to the slapstick routines of those two gentlemen yet it has a life of it's own which in many ways far surpasses slapstick. For those people who can only see the sight gags then this movie will only provide mild appeal. Look deeper and appreciate the marvellous comedic talents of Jack Lemmon, Tony Curtis, Peter Falk, Keenan Wynn and Natalie Wood. Comedy is always a thing of personal taste. I suspect that there will be those who will rave about how wonderful The Great Race is while others will call it a waste of time and money. There will be few in the middle ground. I fall into the rave category. To me this movie is sheer FUN. The visuals are splendid and awesomly huge. The costumes fabulous and the location settings vast. Everything is over the top, yet there is still room for small subtleties and in-jokes. The actors have a ball. Jack Lemmon just sneaks in as the best scene stealer but the able cast hold their own too. The Great Race just cries out for a restoration job and a release on DVD - please !",
         "Tony Curtis and Jack Lemmon, memorably paired in \"Some Like It Hot\", tried it again in \"The Great Race\". Natalie Wood was a reluctant addition, with a new biography of this actress repeating her displeasure with the film and its director. Peter Falk, not yet Columbo, rounded out a globetrotting quartet chasing first prize in the 1908 New York to Paris automobile race. Much has been made of how the script's \"Prisoner of Zenda\" subplot slows the action. Yet these scenes shot in Salzburg have contributed several zingers to the stock of movie quotes floating around in general circulation. Someone must have liked the \"Potzdorf\" episode, as \"More brandy!\" and \"Drat! I never mix my pies!\" remain among Jack Lemmon's most cited lines. Surviving participants in the real-life 1908 competition did not care for this trashing of their personal history. I loved it on its first release way back when, and it remains a pleasant (if long) watch on cable TV and home video.",
         "The best pie fight,bar room brawl,sword fight,comedic love story...wackiest villain...Saddened it's not mentioned as one of the greatest comedies ever or even mentioned as one of Jack Lemons greatest comedic roles.I'm guilty of quoting movie lines when the time is right and often quote from this movie. \"Brandy,Brandy...\",\"now you're using sex as a weapon..\",\"RISE AND SHINE?\",\"..now if you were the mens fencing champion...\"\"NOW CAN I GET ME SOME FIGHTN' ROOM!\" I can't believe Tony Curtis was a second choice to play \"The Great Leslie\".His all American do-gooder mentality is nauseatingly funny. Natalie Wood is beautiful and plays the ultimate suffragette. Jack Lemmon and Peter Falk are a fun duo as Leslies villainous rivals and truly set the tempo of the slapstick.Only Blake Edwards could have pulled off such an epic comedy.Who cares if the the drive around the world does'nt make sense.This movie is a true blue farce in every sense,nothing more and nothing less. Perfect casting and screenplay and the writers should be commended.",
         "THE GREAT RACE may not be a masterpiece--but it is a perfect choice for a cold and rainy night: stylish, frothy, and often flatly hilarious, it makes for \"comfort viewing\" at its best. One of the movie's several charms is that it draws heavily from Victorian clichés that still linger in the public mind, gives them a gentle comic spin, and then drops them into the tale of an early 1900s auto race from New York to Paris by way of Siberia. Add to this a heap of favorite character actors, a big budget, flamboyant period costumes, and the biggest pie fight ever filmed, and you have a movie where there is always something to enjoy on the screen. The great thing about THE GREAT RACE are the performances, which are very broad but endowed with a sly humor. The comedy accolades here go to Jack Lemmon and Peter Falk as the notorious Dr. Fate and his bumbling sidekick Max--wonderful bits of acting that will have you hooting with laughter in every scene--and Dorothy Provine scores memorably in a cameo as Lily Olay, the bombshell singer who presides over the most rootin'-tootin' saloon this side of the Pecos. But every one, from Tony Curtis and the lovely Natalie Wood down to such cameo performers as Vivian Vance, get in plenty of comic chops as the film drifts from one outrageous episode to another: suffragettes crowding a newspaper, the biggest western brawl imaginable, polar bears, explosions, daredevil antics, and a subplot lifted from THE PRISONER OF ZENDA agreeably crowd in upon each other. True, the film does seem over-long and may drag a bit in spots, but it never drags for very long, and it's all in good fun--and the production values and memorable score easily tide over the bare spots. Lots of fun. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "This is director Blake Edwards salute to the early days of films. It is quite long, but worth the time to see this masterpiece, and appropriate for all ages. Its basically the good guy vs the bad guy and the heroine theme but the roles are mixed up in a wonderful way to where each main character is both at different times. I love Maggie DuBois(Natalie Wood) the most because she is such a strong intelligent woman, and yet beautiful and sexy. She would do anything to stay in the race, and did. Professor Fate and Max are not Laural and Hardy but evoke their comedy team spirit strongly. They are the ones that make the bumbling mistakes that make them more human than the perfect Leslie(Tony Curtis). The prince is a silly compliment to Professor Fate, both brilliantly played by Jack Lemmon. Also worth seeing is Vivian Vance as the wife of the newspaper owner, and Larry Storch as the gunfighter. I really liked the submarine, rocket sled, pedaled air balloon, and the vintage cars. Visually, this movie is a work of art, and the music is perfect. The score features Henry Mancini's \"The Sweetheart Tree.\" Yes, there's lust, love and romance here too. This is the quintessential epic comedy of the 60's.",
         "The Great Race is a marvelously entertaining cartoon of a movie. Everyone is a broad character and slapstick abounds. The actors are great and the comedy is lively. If it has a fault, it's that it is a bit longer than necessary. However, it never slows down too much to make you lose interest. Jack Lemmon steals the show as the deliciously despicable Professor Fate. Lemmon brings melodramtic greatness to what would normally be the Terry Thomas role (and I love Terry Thomas). His partner in crime is Peter Falk, as the harried, but loyal Max. Together, they make this film great. Tony Curtis is the perfect true-blue hero, even if that becomes a bit obnoxious. He's so great that you just can't wait for Prof. Fate to get one up on him. Natalie Wood gets a bit annoying, too, as Maggie Dubois. Her strident proclamations about equality start to get on your nerves fairly rapidly. She's not quite intrepid enough for Nellie Bly, and not quite smart enough for Gloria Steinum. She has some good comedic moments, though. The film is episodic in nature and a bit uneven, but there a great moments throughout. Scenes to look for: The early daredevil rivalry between the Great Leslie and Prof. Fate, the saloon brawl in Borracho, the Prisoner of Zenda send-up, and the pie fight. Hollywood doesn't make great slapstick farces like this anymore. Humor now revolves around groin injuries and stupid one-liners and catch phrases. We don't see great character pieces anymore. It's a shame as these kinds of movies hold up well; especially as family fare. The DVD is pretty bare-bones. It would have been nice to have some commentary from Blake Edwards and Tony Curtis. Warner Brothers has but out some pretty substandard DVD packages, this one included. Still, it's worth the price just to watch the movie.",
         "I wish I could answer this - THE GREAT RACE and THOSE MAGNIFICENT MEN IN THEIR FLYING MACHINES both came out in 1965. It would be interesting to know who came up first with the idea of the car and/or the airplane film. Fortunately, aside from some brief cross-referenced scenes, THOSE MAGNIFICENT MEN remained bound to the sky as THE GREAT RACE was bound to the earth. In 1907 the world's first really great automobile race occurred: the Peking to Paris road race. It was such a success that it was hoped that a similar long race would be tried soon after. The result was the 1908 New York to Paris road race, which is the factual basis of THE GREAT RACE. It was won by a Thomas Flyabout, which had an appearance very much like the car driven by the Great Leslie. The cars in the 1908 race were to drive from New York City to Seattle, Washington, then get shipped by steamer to Vladivostok, and then to transverse the Russian Empire, Europe, and finally reach Paris. So keep in mind, there was no use of icebergs as in the film. Blake Edwards always has enjoyed playing around in his comedies and musicals with images from the times of the story. For example, in THOROUGHLY MODERN MILLY one of the two male leads wears eyeglasses, and (to see his girlfriend) climbs the side of an office building - in short (as the story takes place in the 1920s) he is imitating Harold Lloyd in SAFETY LAST. He dedicates this film to Laurel and Hardy, although it is set before the 1920s. In THE GREAT RACE he uses the forgotten 1908 race to build upon many different social events of the day like the suffragette movement that involves Natalie Wood (as the Nellie Bly like reporter Maggie) and her friend Vivian Vance as the wife (and temporary successor) of husband Arthur O'Connor a newspaper editor. There is also the final days of the American frontier, as seen in the sequences involving the town of Borracho and Tony Curtis' confrontation with Larry Storch over Dorothy Provine. There is (finally) the unsettled state of Balkan Europe, wherein the plot of Anthony Hope's THE PRISONER OF ZENDA is lampooned, concluding with a pie fight. The film marked the reunion of Tony Curtis and Jack Lemmon after their first pairing in SOME LIKE IT HOT, but Lemmon's character there was not as comically sinister as Professor Fate is here. Fate is totally captivated by his own ego. He certainly has engineering ability, but he is incapable of being friendly (when he is about to test out a rocket device early in the film his picture is being taken - some kids are touching the rocket, and he angrily yells at them to go away). He also is stuck with having the faithful but totally inept assistant Max (Peter Falk - who comes close to stealing the film) who constantly is pushing the wrong buttons on Fate's machines, with disastrous effects. And he is constantly trounced by the handsome, accessible, \"Frank Merriwell\" like \"Great Leslie\" (Curtis) who is far better organized, and a hell of a deal luckier. Not that Leslie is without flaws. A man of the Edwardian period, he does not think woman are fully the equal of men. Notice that Leslie's most fair minded complement to Maggie is that her choice of a Stanley Steamer for the race was the wrong car. It is, he says, meant for picnics and Sunday drives. But, he adds, her success in getting it across half of the U.S. before the boiler gave out was quite an accomplishment...and she should be proud. The self-satisfaction is annoying as Maggie shows. I might add that in the period of the film, Stanley Steamers won several races - steam engines can build up tremendous amounts of power but they have to be replenished more frequently than gasoline engines. Besides the four leads (five if you count the under-used Keenan Wynn) the performances of Storch and Provine were good (Provine being allowed a lively dance hall tune - \"He Shouldn'ta, Hadn'ta, Oughtn'ta Swung On Me!\", with Storch being unable to get the right amount of room he needs to cut loose on Curtis without falling on his face. Wood (like Provine) was given a nice tune - the charming, \"Sweetheart Tree\". And in the Balkan section, besides a second role for Lemmon, the conspirators George Macready and Ross Martin make the most of the \"Ruritania\" story - and demonstrate their own flair comedy (a rarity for Macready). For Martin it is particularly welcome, as his last appearance under Edwards' direction was as the evil criminal in EXPERIMENT IN TERROR three years earlier. While Baron Von Stuppe (what a name - possibly a cousin to Lily Von Stuppe (Madeleine Kahn) in BLAZING SADDLES) is a villain, he is shown to be confused sometimes - see Wood threaten him with President Theodore Roosevelt's wrath, and start singing the \"Star Spangled Banner\". Martin doesn't know what to do with this female nut."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Family",
         "Musical",
         "Romance",
         "Sport",
         "Western"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Patricia",
         "Jalem Productions"
      ],
      "summaries": [
         "Professional daredevil and white-suited hero, The Great Leslie, convinces turn-of-the-century auto makers that a race from New York to Paris (westward across America, the Bering Straight and Russia) will help to promote automobile sales. Leslie's arch-rival, the mustached and black-attired Professor Fate vows to beat Leslie to the finish line in a car of Fate's own invention. The Blake Edwards style of slapstick and song originated with this movie. A dedication to Laurel and Hardy appears at the beginning of the film. Edwards' tribute to Stan and Ollie can be seen most clearly in the interaction between Professor Fate and his cohort Max, as well as in the operatic Pottsdorf pie fight.",
         "In the early twentieth century, the Great Leslie - daredevil and all 'round Renaissance man always clad in white - has several world records to his name in daring feats of courage, always with the faithful Hezekiah by his side. Leslie's arch enemy is the dastardly Professor Fate - always clad in black - who is always trying either to outdo Leslie or thwart Leslie's attempts of daring, without success. Leslie suggests to the Webber Motor Car Company that they show their engineering expertise by building the supreme motor car for a New York to Paris race, that car which they ultimately name the Leslie Special after their inspiration. Not to be outdone, Fate, with his equally dastardly sidekick Max, also enters the race with what he considers his motor car masterpiece, the Hannibal Twin-8. Nothing is too dastardly an act in Fate's goal of winning. One of the other entries is the beautiful Maggie Dubois, a reporter covering the race for the New York Sentinel newspaper. An emancipated woman, Maggie initially tried to convince both Leslie and Fate to use her as their driving partner, both who refused, considering her among the weaker sex. Maggie however convinced the newspaper both to hire her and to sponsor their own car with her as the driver based on the internal struggle within the newspaper's ownership, which is similar to Maggie's own struggles. Maggie expects to win: in her logic, she is covering the entire race (which she does with the use of some primitive but effective technology), meaning she needs to be first at the finish line. Despite being emancipated, Maggie is not averse to using her feminine wiles to her advantage. Through the race, they come across a few adventures and obstacles. But being a long race with much interaction between the racers, their mindsets and priorities may change based on their time together.",
         "Comedy about an early 20th century car race across three continents."
      ],
      "budget": 12000000
   },
   "movielensId": 1083,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1965-07-01",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Blake Edwards"],
      "runtime": 160,
      "movieId": 1083,
      "title": "The Great Race",
      "mpaa": "PG",
      "actors": [
         "Jack Lemmon",
         "Tony Curtis",
         "Natalie Wood",
         "Peter Falk",
         "Keenan Wynn",
         "Arthur O'Connell",
         "Vivian Vance",
         "Dorothy Provine",
         "Larry Storch",
         "Ross Martin",
         "George Macready",
         "Marvin Kaplan",
         "Hal Smith",
         "Denver Pyle",
         "William Bryant",
         "Hal Needham",
         "Raoul Retzer"
      ],
      "imdbMovieId": "0059243",
      "originalTitle": "The Great Race",
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": ["Qng4rP5xjDE"],
      "plotSummary": "Professional daredevil and white-suited hero, The Great Leslie, convinces turn-of-the-century auto makers that a race from New York to Paris (westward across America, the Bering Straight and Russia) will help to promote automobile sales. Leslie's arch-rival, the mustached and black-attired Professor Fate vows to beat Leslie to the finish line in a car of Fate's own invention.",
      "tmdbMovieId": 11575,
      "avgRating": 3.46265,
      "releaseYear": "1965",
      "numRatings": 1633,
      "posterPath": "/9rL8GWuFdO3fLXcNV9rZRHskoOn.jpg"
   }
}