{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "ex-con",
         "id": 156121
      }],
      "imdb_id": "tt0113276",
      "video": false,
      "title": "Headless Body in Topless Bar",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Man",
               "gender": 2,
               "credit_id": "52fe49b09251416c750d021f",
               "name": "Raymond J. Barry",
               "profile_path": "/k4WDNgYHOUgRaPQIsZUPUxl1lO6.jpg",
               "id": 10361,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Vic Palmieri",
               "gender": 2,
               "credit_id": "58bc8ccd925141609e0407ad",
               "name": "Rustam Branaman",
               "profile_path": "/2nkZNXERq9l7sZX23yFMADWTXJ7.jpg",
               "id": 1112607,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Candy",
               "gender": 0,
               "credit_id": "58bc8cd7925141609b042095",
               "name": "Jennifer MacDonald",
               "profile_path": null,
               "id": 36197,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Danny",
               "gender": 2,
               "credit_id": "58bc8ce4925141607b0424bf",
               "name": "Taylor Nichols",
               "profile_path": "/yls98pv22GPdHpUF8U4uZJydyef.jpg",
               "id": 4944,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Bradford Lumpkin",
               "gender": 2,
               "credit_id": "58bc8cef925141607b0424cf",
               "name": "David Selby",
               "profile_path": "/31FZf0TdcYm53S9R9q1KWNNxVaH.jpg",
               "id": 56930,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Carl Levin",
               "gender": 2,
               "credit_id": "58bc8d16c3a368668603b204",
               "name": "Paul Williams",
               "profile_path": "/qkGR5o0Yl8Q1PitH6N422NunOiN.jpg",
               "id": 35040,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Letitia Jackson",
               "gender": 1,
               "credit_id": "58bc8d20925141607b042508",
               "name": "April Grace",
               "profile_path": "/9vHFcPQS463AjDgst7vFJy6ZUnA.jpg",
               "id": 10691,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Joe",
               "gender": 2,
               "credit_id": "58bc8d2a9251416084043dff",
               "name": "Biff Yeager",
               "profile_path": "/pxT4WEoRidROV04OjSvXC0ZjTV.jpg",
               "id": 1916,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Drunk",
               "gender": 2,
               "credit_id": "58bc8d329251416084043e06",
               "name": "Tom Bresnahan",
               "profile_path": null,
               "id": 128174,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "58bc8c65c3a36851cd025bb8",
               "name": "James Bruce",
               "profile_path": null,
               "id": 1234226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58bc8c71925141126a025630",
               "name": "Peter Koper",
               "profile_path": null,
               "id": 982030,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58bc8c86925141126a025651",
               "name": "Stephen David",
               "profile_path": null,
               "id": 999644,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58bc8c94c3a368666b03c6af",
               "name": "Charles Weinberger",
               "profile_path": null,
               "id": 1770661,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58bc8c9ec3a368664d041740",
               "name": "Tom Bresnahan",
               "profile_path": null,
               "id": 128174,
               "department": "Production",
               "job": "Co-Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 0.001497,
      "production_countries": [],
      "id": 96357,
      "vote_count": 0,
      "budget": 0,
      "overview": "An ex-con holds a group of people hostage in a topless bar.",
      "similar": [
         949,
         154400,
         9705,
         19457,
         16161,
         9303,
         10388,
         254772,
         354979,
         14805,
         30941,
         21882,
         472805,
         64131,
         52758,
         26762,
         277702,
         25915,
         83890,
         226448
      ],
      "original_title": "Headless Body in Topless Bar",
      "runtime": 110,
      "poster_path": "/tQ6HEWNxvbeF2WklTVEp3su446F.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-05-20",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Bruce"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Peter Koper"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113276/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMTAzNDY0NF5BMl5BanBnXkFtZTcwODc4ODcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Raymond J. Barry, Rustam Branaman, Jennifer MacDonald | See full cast and crew »"],
      "reviews": [
         "The Headless Body Topless Bar I just watched (pictured here) Is nothing like he described. I kept thinking this movie was something Quentin Tarantino would have done. Think of the seemingly hours you spent watching the warehouse scene in Reservoir Dogs. It was only one location, but the intensity of the character interaction kept you on the edge of your seat right? That is exactly how I felt when I watched Headless body in Topless Bar, totally engrossed but yet traumatized. I hated this film because it was SOOO intense and I loved it because I felt like I had actually experienced something that made me think about human nature, the will to survive, and the pain of vulnerability. If you are looking for a provocative, thought provoking movie this is a sure bet. It you want light hearted entertainment rent something with Meg Ryan in it.",
         "First off, considering some of the reviews, and the description on the DVD jacket I rented, I can only assume there must be two movies of the same name out there, since this whole \"spontaneous decapitation\" aspect mentioned in two other reviews is not in the movie I just watched. Although, in all fairness, watched is a loose term. After half an hour of squirming at horrific dialogue, poor direction, and contrived scenarios, I began to skim through the movie (ah the wonders of DVD), stopping at what looked like hopeful scenes. Then I was openly fast- forwarding. And most of it was still ridiculous.... \"The Man\" attempts a fairly quiet robbery of a nearly vacant strip club (the only smooth part of this film). However, when one of the other patrons (apparently gifted with X-Ray vision) spots the revolver the Man's hiding with his body and jacket and shouts out, our hero (??) panics and kills the bartender. After a few moments of muttered- out- loud inner monologue, he decides it'd be best to turn his botched hold- up into a hostage situation. Lucky for him, none of the handful of New Yorkers who frequent this club think of fighting back or resisting, even when he tucks his pistol deep into his pants pocket to feel up the club's lone stripper. Actually, he rarely holds onto his weapon, usually putting it somewhere fairly inaccessible (once even leaving it on the counter top while he roots around behind the bar). Yet the hostages all sit quietly at their tables, ignoring countless opportunities to tackle, pummel, or simply overwhelm their captor. In one of the (only slightly) more ridiculous scenes, the Man has one of his captives dance with a chair, then turns his back, leaving this poor, mistreated prisoner holding a metal chair at arms length, with the back of his captor's head just inches away.... He doesn't try anything, of course. That would end this movie far too quickly. The Man's pathetic attempts at forced \"bonding\" and psychotherapy sessions are a joke, a feeble and failed attempt to copy similar scenes in far better movies. The reactions these attempts get from his hostages are equally forced. The characters are plastic, inconsistent, and utterly unsympathetic. The numerous scenarios that crop up through the entire movie are all over- worded, forced, and painfully silly. There is not so much a story arc as a sine wave, rippling back and forth to whatever whim the writer and director seem to have been struck with that day on set. What should have been a fifteen minute student film has been under- developed into a paper- thin feature. Saying this movie drags on is like saying General Custer could have done better at Little Bighorn. I feel very sorry for Jennifer MacDonald, who goes through this entire movie topless for pretty much no reason at all (perhaps in a desperate attempt to keep 50% of the audience watching). I feel sorry for Paul Williams, that his career has slipped to the point that he did a film like this. I feel sorry for the crew of this film, who probably had to sit through multiple takes of these incredibly painful, poorly- written scenes. But most of all, I feel sorry for my friends and myself. We lost an hour of our lives to this movie, and we can never, ever get that hour back. If this review keeps one person from making the same mistake, then my work here is done....",
         "There are surreal moments in which the killer has egocentricities, then confusion and then uses psychobabble to torture his hostages. There is only one set of naked breasts that is shown in this movie and its not in a titillating atmosphere. I was hoping the poor girl would be able to put a shirt on. The headlessness doesn't come until near to the end and I won't spoil by telling who gets beheaded. I also thought the cast did an excellent job with characterizations and felt they were very believable. This movie was quite different and intriuging to watch especially after learning that it is based on an actual event that caused the New York Post to headline \"Headless body in Topless Bar\" back in the 80's. Not a movie for everyone but if you like dark and disturbing films you might just enjoy this one.",
         "this movie is the worst EVER!!! sorry but this was a total waste of good hours. quasi-psychology and b-actors makes a baaaad horror movie. you can say that if you are into bad movies you will adore this one. and the \"hot chick\" wasn't all that hot. there is absolutely no climax to the movie, and the worst part is the ending song. some homemade thing with these words \"its in awful condition the world is a mess. when heads fall of bodies and girls wont stay dressed. the cops they are clueless, eating donuts in their car. newspaperflash next morning: headless body,topless bar.\" Jesus! sorry guys, but milks gone bad with this one.",
         "Although this movie is loosely based on real events, it seems artificial at times; some of the dialogue sounds scripted, instead of spoken by real people, and not all of the situations are believable. But the one big situation is still enough to keep you riveted to the screen, and the performances are good all around, with a particularly unsentimental portrait of the criminal by Raymond J. Barry. (**)",
         "Ah, the joys of headlessness. If it were not for the vast amounts of nudity, this film would be a complete waste of time. Seems Joe (played by the gruff but lovable Biff Yeager) has a problem: his best friend Carl (played lamely by Paul Williams) has spontaneously decapitated. So what does Joe do but drag his headless friend to their favorite topless bar, sets him in a corner booth, and the remainder of the movie is Joe and his dead friend watching strippers while Joe comments on the size of their, em, talents. From the style this could almost be a student or art film, as surreal as it is, but it is the real deal. Stay away unless you like to see Burbons poured down the neck of a headless guy by a faithful best friend.",
         "Here are some of the quotes from the press (and yes I worked on the film): \"Don't walk, run to see headless!\" Newhouse papers \"Tough urban drama, fine ensemble acting\" New York Times \"Throbs with intensity\" Playboy \"A bottomless pit of naked tension. A razor sharp drama that cuts to the bone\" Details magazine \"Pinteresque tale, masterfully directed\" Buzz magazine",
         "I hired this film fully expecting an over the top black comedy and was shocked to discover a rather sombre story, punctuated by breasts and violence. The character of the headless man, Paul, who continues to function (albeit, on a purely instinctive level) must surely be a parable of where is best friend, Joe, is heading. Spending what would seem to be the best part of his waking hours in a peculiar topless bar Joe is most definitely heading down the road to ruin. Much like his faceless friend, Joe is becoming increasingly detached from the world and finds it hard to express himself and his anguished emotions. Imbibing copious amounts of alcohol, both Paul and Joe are spiraling down towards the inevitably violent conclusion. And the naked women? Beautiful though they are, they constantly taunt Joe who, as we learn from the virtual non-stop monologue, is unable to sustain a loving relationship. Yes sir, some very serious characters and issues here but the question is: does anybody care? with a title like HEADLESS BODY IN A TOPLESS BAR, you're not exactly gonna attract the intellectual crowd. Those in pursuit of some sleazy exploitation will find what they're after but perhaps, should they look closer, will find something much, much more... Okay, I admit it: I have not seen this movie."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Green Tea Pictures"],
      "summaries": ["Late one night, in a seedy topless bar, a group of men watch a stripper dance over their malted beverages. But, one of them is an ex-con who's about to put the group on a collision course with death. Inspired by the events that spawned the New York Post headline, Headless Body in Topless Bar is an intense black comedy about a group of hostages held under the torment of a twisted gunman. The lonely, deranged killer leads the patrons through a bizarre, intriguing, and darkly humorous pop-psychotherapy session that's part truth or dare, part Russian roulette. As the searing drama develops, issues arise: the politics of gender, the effects of institutionalization, and the deadly dance between predator and prey. Who will survive? Candy the jaded stripper? Lumkin, the Wall Street sexual deviant? Carl, the wheelchair-bound regular? Or Vic and Creamface, the two loudmouth beer-chugging hockey buddies? Anything can happen with this madman in charge."],
      "budget": 0
   },
   "movielensId": 109,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-05-20",
      "dvdReleaseDate": "2002-04-30",
      "directors": ["James Bruce"],
      "runtime": 110,
      "movieId": 109,
      "title": "Headless Body in Topless Bar",
      "mpaa": "",
      "actors": [
         "Raymond J. Barry",
         "Rustam Branaman",
         "Jennifer MacDonald",
         "Taylor Nichols",
         "David Selby",
         "Paul Williams",
         "April Grace",
         "Biff Yeager",
         "Tom Bresnahan"
      ],
      "imdbMovieId": "0113276",
      "originalTitle": "Headless Body in Topless Bar",
      "genres": ["Crime"],
      "youtubeTrailerIds": [],
      "plotSummary": "An ex-con holds a group of people hostage in a topless bar.",
      "tmdbMovieId": 96357,
      "avgRating": 2.33333,
      "releaseYear": "1995",
      "numRatings": 18,
      "posterPath": "/tQ6HEWNxvbeF2WklTVEp3su446F.jpg"
   }
}