{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hippie",
            "id": 458
         },
         {
            "name": "poetry",
            "id": 496
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "rock and roll",
            "id": 578
         },
         {
            "name": "hallucination",
            "id": 3298
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "addicted",
            "id": 4436
         },
         {
            "name": "joint",
            "id": 4523
         },
         {
            "name": "organ",
            "id": 4572
         },
         {
            "name": "lsd",
            "id": 5498
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "singer",
            "id": 10229
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "music band",
            "id": 41591
         }
      ],
      "imdb_id": "tt0101761",
      "video": false,
      "title": "The Doors",
      "recommendations": [
         8592,
         451,
         2604,
         10169,
         1630,
         10279,
         10155,
         9080,
         2119,
         11896,
         10303,
         177,
         9306,
         10328,
         12309,
         10395,
         11873,
         820,
         8873,
         2142
      ],
      "backdrop_path": "/1rv5sW6Qs2YK2iOzIgwH3SJPIl1.jpg",
      "revenue": 34416893,
      "reviews": [
         {
            "author": "talisencrw",
            "id": "57e4258d9251411df10045f1",
            "content": "I KNOW I'm giving way too many stars for this, but I don't care; The Doors were one of my very first favourite groups. I fondly recall, when I was 11, and Elektra Records released 'The Doors' Greatest Hits', and the album-length version of 'Light My Fire' was played all the time on the radio, and I was mesmerized by the instrumental middle of the song, got the album from my parents for Christmas, and started a lifelong love affair with the band. Yes, Jim Morrison is highly overrated. Yes, the movie is an extremely self-indulgent mess and it can be quite incoherent and incohesive. But the Sixties, the L.A. rock scene back then, and especially Morrison's life, were just like that, so it is oh so fitting!\r\n\r\nI adore the fact that it was Oliver Stone's labour of love (one of thankfully many) and that the surviving members of the band basically had full input. I would take this and 'Talk Radio' (my personal favourite Stone's throw) over a hundred of Stone's politically over-the-top movies any day!\r\n\r\nWhen I was 17, I took my life savings and visited, on my own, nine European countries, including France and its capital, Paris. Did I go for the Eiffel Tower, wild romance on Richard Linklater-esque trains, or its outstanding magic and sidewalk cafes? No--train-wise I had to put up with a stupid labour strike, such that an overnight sleeper car from Berne, Switzerland to Paris had to be switched, in the middle of the night, FOUR times, just so they could prove a point. And it was just to see Morrison's grave. I met 20 fantastic people who had made the pilgrimage from all over the world, and it was my first time having red wine and smoking pot. The graffiti and the sculpture of him, in the Pere Lachaise cemetery, were fascinating, as was his life. Would I go through that again? Of course I would.\r\n\r\nIt's Val Kilmer's best work by a mile. The film just oozes charisma and breathes life--just as the band's work must have done back in the day. Worth a purchase and re-watches (I watch it each year on Jim's birthday and accidentally bought it twice), for any fan of 60's music or its culture. A bonafide classic when Stone was actually really something.",
            "url": "https://www.themoviedb.org/review/57e4258d9251411df10045f1"
         },
         {
            "author": "Wuchak",
            "id": "5aae93b0c3a36846c30259ad",
            "content": "A hypnotic film, but it emphasizes the negative side of Jim Morrison and is filled with fabrications.\r\n\r\nRELEASED IN 1991 and directed by Oliver Stone, “The Doors” chronicles the Southern California band The Doors and their rise and fall between 1966-1971. The film focuses on charismatic singer Jim Morrison (Val Kilmer) who falls into alcoholism and drug-addiction. He flew to France in March, 1971, to join his girlfriend, Pamela Courson (Meg Ryan), and pursue a different career, but died the next summer due to his ongoing substance abuse. The other band members are played by Kyle MacLachlan (Ray Manzarek), Frank Whaley (Robby Krieger) and Kevin Dillon (John Densmore).\r\n\r\nI'm not old enough to remember The Doors. The first time I heard of them was when my older brother asked me if I knew of them. I busted out laughing saying, \"The Doors? Why don't they just call themselves The Window Sills.\" Yeah, I thought the name was pretty lame until I discovered Morrison's reasoning behind it:\r\n\r\nThere is what is known; And there is what is unknown; In between are the doors\r\n\r\nAnother thing that won my respect was their song that was used in the opening of “Apocalypse Now,” which is my all-time favorite film (the original version, not \"Redux\"). After that I bought their \"Best Of\" album and my impression was that their sound was horribly dated, even THEN. Over time, however, I've come to respect The Doors' music because it's so unique. They don't sound like anyone else. They have a weird, moody vibe, even their 'hits,’ augmented by a strange carnival feel. Over top of it all is Morrison's commanding and haunting vox. I prefer their more artistic songs like \"Riders on the Storm\" and \"The End\" as opposed to their 'hits,' but who can deny the catchiness of \"Light My Fire\" or the goofy charm of \"People are Strange\"?\r\n\r\nThe film focuses on Jim Morrison and leaves the viewer with the impression that he was a miserable artistic-genius type who had no sense of moderation; he sought to escape his personal struggle through loose sex, substance misuse and rock 'n' roll. His excessive self-abuse eventually spilled over to those closest to him and ultimately landed him in a premature grave. His body lies in Paris, a mecca to his fans who have spray-painted the surrounding monuments with gaudy graffiti, some of it profane. The image this leaves you with is that Jim Morrison is no fun to be around, even in death.\r\n\r\nSo “The Doors” is pretty much the ultimate story of sex, drugs and rock 'n' roll. Stone said he based his view of Morrison, as depicted in the film, on 160 transcripts of people that actually knew him or were around him and the band. From these documents emerged a central truth about Morrison's final years, an image of wild excess. Because of this, I was left with a bad impression of the man. I felt Morrison was a spaced-out, immature jerk, abusive to both himself and others, foolishly sacrificing his life and talents on the altar of alcohol & drug idolatry.\r\n\r\nYet this was only part of the truth. Thankfully the 37-minute documentary on the 'extras' disc, \"The Road to Excess\" (1997), balances things out. One of Morrison's sweethearts, wiccan Patricia Kennealy (played by Kathleen Quinlan in the movie), the guitarist and another guy offer the other side of the story. They properly point out that Stone's film only shows Jim's 'wild & crazy' side, emphasizing that the events depicted in the picture, while sometimes true, aren't \"all that happened.\" They unanimously describe Morrison as genuine, innocent, shy, loving and gallant, an amazing person who made those around him feel important, as if he was their best friend. Robby even states that Jim was \"the most influential person I've ever met.\"\r\n\r\nIn addition, the documentary features numerous clips of Morrison himself, clearly showing him to be a fun-loving, nice and sane person rather than the spaced-out, abuse-driven dude shown in the film. Needless to say, the documentary helps round-out one's image of the man.\r\n\r\nBOTTOM LINE: Val Kilmer doesn't just play Jim Morrison, he IS Jim Morrison. This is no small feat and vital to the film in light of the fact that he appears in practically every frame. He should have won an award. In any case, if you're in the mood for something that captures that late-60s counter-culture vibe “The Doors” is worth checking out, but it tends to exaggerate things in the name of mythmaking, which is usually the case with movies. For instance, Jim never lit up a closet door with Pamela locked inside (rolling my eyes), the idiotic Thanksgiving dinner sequence never happened and the naked revelries at concerts (and the bonfire) are overblown fabrications.  Still, the movie’s mesmerizing in a spaced-out way and highlighted by The Doors' music throughout. \r\n\r\nUnfortunately, the first half is superior to the second half, which becomes too unpleasant, offering a very limited and unflattering impression of Morrison. That's why it's essential to also watch \"The Road to Excess\" on the bonus disc or, better yet, the excellent 2009 documentary “The Doors: When You’re a Stranger,” which exclusively uses footage and photos from 1966-1971. Another problem with Stone’s movie is that it loses its dramatic pull in the second half in preference for hypnotic yet chaotic visual mayhem, not to mention outright lies.    \r\n\r\nLastly, in “The Road to Excess” Oliver Stone makes a couple of really asinine statements. Commenting on Morrison, he states: \"To live life intensely and well and die young and achieve everlasting fame & glory is the greatest. It's Achilles, it's Alexander, it's... Jim Morrison.\" Huh? Another dubious line is: \"The road to excess leads to the palace of wisdom.\" Is he on drugs? Jim's road of excess led straight to an early grave, not enlightenment.\r\n\r\nTHE FILM RUNS 2 hours 20 minutes. \r\n\r\nGRADE: C (but the \"The Road to Excess\" documentary gets an A-/B+)",
            "url": "https://www.themoviedb.org/review/5aae93b0c3a36846c30259ad"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Jim Morrison",
               "gender": 2,
               "credit_id": "52fe43839251416c75013437",
               "name": "Val Kilmer",
               "profile_path": "/AlhPeiH8R4reMNGNQ9ag1FPbuW9.jpg",
               "id": 5576,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Pamela Courson",
               "gender": 1,
               "credit_id": "52fe43839251416c75013447",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Ray Manzarek",
               "gender": 2,
               "credit_id": "52fe43839251416c7501343b",
               "name": "Kyle MacLachlan",
               "profile_path": "/ykDb80YOPY2HLuRClLDpSYxUCPX.jpg",
               "id": 6677,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Robby Krieger",
               "gender": 2,
               "credit_id": "52fe43839251416c75013443",
               "name": "Frank Whaley",
               "profile_path": "/ma1lgPwUHUlgdt9BIcIbEPjdx0h.jpg",
               "id": 11805,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "John Densmore",
               "gender": 2,
               "credit_id": "52fe43839251416c7501343f",
               "name": "Kevin Dillon",
               "profile_path": "/uAJsJxnbTWOpkBjRRBNtyRDt8qW.jpg",
               "id": 6863,
               "order": 4
            },
            {
               "cast_id": 29,
               "character": "Paul Rothchild",
               "gender": 2,
               "credit_id": "55a5d0bb92514109a7000761",
               "name": "Michael Wincott",
               "profile_path": "/pvKUzexxZT4sRTT1BczzrwX8ghz.jpg",
               "id": 7486,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Tom Baker",
               "gender": 2,
               "credit_id": "55a5ce6fc3a3682bba000743",
               "name": "Michael Madsen",
               "profile_path": "/azCognW0p1hl2bJFH31ZNtcTJ3R.jpg",
               "id": 147,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Bill Siddons",
               "gender": 0,
               "credit_id": "5347eb35c3a368672b00136f",
               "name": "Josh Evans",
               "profile_path": null,
               "id": 1044946,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Italian Count",
               "gender": 2,
               "credit_id": "55a5d00d925141099e0006ad",
               "name": "Costas Mandylor",
               "profile_path": "/5mk5ArXCnsDIq2BTj1XbVpjLhie.jpg",
               "id": 36055,
               "order": 8
            },
            {
               "cast_id": 32,
               "character": "Dog",
               "gender": 2,
               "credit_id": "55d6b2ed9251416709001477",
               "name": "Dennis Burkley",
               "profile_path": "/cCmRR9saqVLLmYqlBGTEcom8Lfq.jpg",
               "id": 83362,
               "order": 9
            },
            {
               "cast_id": 73,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "5778932b9251411c5300192d",
               "name": "John Capodice",
               "profile_path": "/sQuJV9o2FSXr5UBo2MaiTLObXiY.jpg",
               "id": 31007,
               "order": 10
            },
            {
               "cast_id": 74,
               "character": "Jac Holzman",
               "gender": 2,
               "credit_id": "577893909251416d770029e9",
               "name": "Mark Moses",
               "profile_path": "/98Pkb6phOJldkCHud8MXt7ftFL4.jpg",
               "id": 11889,
               "order": 11
            },
            {
               "cast_id": 75,
               "character": "Ed Sullivan",
               "gender": 0,
               "credit_id": "577894679251411cd4001842",
               "name": "Will Jordan",
               "profile_path": null,
               "id": 1238777,
               "order": 12
            },
            {
               "cast_id": 76,
               "character": "Music Manager",
               "gender": 0,
               "credit_id": "577894a39251411c530019cc",
               "name": "Robert LuPone",
               "profile_path": "/hIVQjz4iP4JJ5c8euwVjEsG9SiO.jpg",
               "id": 55496,
               "order": 13
            },
            {
               "cast_id": 77,
               "character": "Shaman",
               "gender": 0,
               "credit_id": "577894edc3a36832b00003b9",
               "name": "Floyd Red Crow Westerman",
               "profile_path": "/rAwnURUoJrIUbQtoRAPbHaTyLcu.jpg",
               "id": 7862,
               "order": 14
            },
            {
               "cast_id": 31,
               "character": "Cat",
               "gender": 2,
               "credit_id": "55d6b29a925141670c00130c",
               "name": "Billy Idol",
               "profile_path": "/m34UfaHkKBPA18zT4LMIHclXbIg.jpg",
               "id": 80117,
               "order": 15
            },
            {
               "cast_id": 30,
               "character": "Patricia Kennealy",
               "gender": 1,
               "credit_id": "55d6b27192514167130012d0",
               "name": "Kathleen Quinlan",
               "profile_path": "/qxEXUFX8LP7jAgLvB51S1lWB2zn.jpg",
               "id": 8183,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "Dorothy",
               "gender": 1,
               "credit_id": "52ffb7b99251416ad208f2ae",
               "name": "Kelly Hu",
               "profile_path": "/dxpA9Jz5qaJiDYhPYtH9Dmh1iNs.jpg",
               "id": 11024,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Andy Warhol",
               "gender": 2,
               "credit_id": "55a5cfd2c3a3682bb4000698",
               "name": "Crispin Glover",
               "profile_path": "/thA5rOv5XE1oFpxD9DSp0tDrIIR.jpg",
               "id": 1064,
               "order": 18
            },
            {
               "cast_id": 33,
               "character": "Warhol PR",
               "gender": 2,
               "credit_id": "55d8a683c3a36832070024be",
               "name": "Paul Williams",
               "profile_path": "/qkGR5o0Yl8Q1PitH6N422NunOiN.jpg",
               "id": 35040,
               "order": 19
            },
            {
               "cast_id": 21,
               "character": "Whiskey Girl",
               "gender": 1,
               "credit_id": "55a5cedbc3a3682bba00074a",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 20
            },
            {
               "cast_id": 22,
               "character": "Man at Birthday Party",
               "gender": 2,
               "credit_id": "55a5cf3b9251410996000691",
               "name": "Phil Fondacaro",
               "profile_path": "/3Ao8VPvlytIm3DWFffdSPxwxFdC.jpg",
               "id": 12662,
               "order": 21
            },
            {
               "cast_id": 23,
               "character": "UCLA Film Professor",
               "gender": 2,
               "credit_id": "55a5cf9e92514109990006aa",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "order": 22
            },
            {
               "cast_id": 24,
               "character": "Okie Girl",
               "gender": 1,
               "credit_id": "55a5cfb292514109ab00073d",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 23
            },
            {
               "cast_id": 27,
               "character": "Edie",
               "gender": 1,
               "credit_id": "55a5d01dc3a3682bad00068f",
               "name": "Jennifer Rubin",
               "profile_path": "/xK5ubDqPfiWjXffMJzTvObFlXsV.jpg",
               "id": 56978,
               "order": 24
            },
            {
               "cast_id": 28,
               "character": "Magazine Photographer",
               "gender": 1,
               "credit_id": "55a5d031c3a3682bba000781",
               "name": "Mimi Rogers",
               "profile_path": "/cTXSghmtclAmeTSg4lBBjeOwpoQ.jpg",
               "id": 13920,
               "order": 25
            },
            {
               "cast_id": 81,
               "character": "CBS Girl Backstage",
               "gender": 1,
               "credit_id": "5868b5a09251414e8a0089d3",
               "name": "Charlie Spradling",
               "profile_path": "/siWhm3sZFFpSyFPwpn0DostNhka.jpg",
               "id": 147396,
               "order": 26
            },
            {
               "cast_id": 82,
               "character": "(uncredited)",
               "gender": 1,
               "credit_id": "59c04db89251417d9b004bf8",
               "name": "Delia Sheppard",
               "profile_path": "/jnekLWN0sAt5FHw8gvgMVIisUws.jpg",
               "id": 16663,
               "order": 27
            },
            {
               "cast_id": 83,
               "character": "Extra (uncredited)",
               "gender": 1,
               "credit_id": "59c04dc49251417d9b004c06",
               "name": "Julie Strain",
               "profile_path": "/9uk7Z97iYo8y5nAQbOmL3uDN2Tr.jpg",
               "id": 80116,
               "order": 28
            },
            {
               "cast_id": 84,
               "character": "Music Manager's Sidekick",
               "gender": 2,
               "credit_id": "59f5084d9251414d4d01d8cc",
               "name": "Paul A. Rothchild",
               "profile_path": null,
               "id": 1913572,
               "order": 29
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43839251416c750133f1",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43839251416c75013403",
               "name": "Bill Graham",
               "profile_path": null,
               "id": 65553,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43839251416c75013409",
               "name": "Sasha Harari",
               "profile_path": null,
               "id": 57244,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43839251416c7501340f",
               "name": "A. Kitman Ho",
               "profile_path": null,
               "id": 2621,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43839251416c75013415",
               "name": "Robert Richardson",
               "profile_path": "/9tLrDHL9qL9yYIhcJVaINwnzmWN.jpg",
               "id": 149,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43839251416c7501341b",
               "name": "David Brenner",
               "profile_path": null,
               "id": 6051,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43839251416c75013421",
               "name": "Joe Hutshing",
               "profile_path": null,
               "id": 4186,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43839251416c75013427",
               "name": "Olivia Barash",
               "profile_path": "/qTGwaTk9ERXPXhODiTHxWHwRZfB.jpg",
               "id": 65554,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43839251416c75013433",
               "name": "Carl Orff",
               "profile_path": null,
               "id": 65556,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "568dc8039251416b47001061",
               "name": "Susan Malerstein",
               "profile_path": null,
               "id": 1434225,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "568dc8359251416b5500109a",
               "name": "Sara Spring",
               "profile_path": null,
               "id": 1559230,
               "department": "Production",
               "job": "Production Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "568dc8469251416b52001014",
               "name": "Sidney Ray Baldwin",
               "profile_path": null,
               "id": 1404230,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "568dc8749251416b47001085",
               "name": "James M. Muro",
               "profile_path": null,
               "id": 21118,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "568dc8919251416b5200102f",
               "name": "Randy Nolen",
               "profile_path": null,
               "id": 1391594,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "568dc8a99251416b40001125",
               "name": "Ken Speed",
               "profile_path": null,
               "id": 8890,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "568dc8cbc3a36858f00010b0",
               "name": "Tod A. Maitland",
               "profile_path": null,
               "id": 17992,
               "department": "Sound",
               "job": "Production Sound Mixer"
            },
            {
               "gender": 1,
               "credit_id": "568dc8e4c3a36858fc0010db",
               "name": "Marlene Stewart",
               "profile_path": null,
               "id": 3989,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "568dc8f8c3a3685906001325",
               "name": "Barbara Ling",
               "profile_path": null,
               "id": 5585,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "568dc910c3a36858ea0010fa",
               "name": "Cricket Rowland",
               "profile_path": null,
               "id": 7148,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "568dc91bc3a36858ec001075",
               "name": "Larry Fulton",
               "profile_path": null,
               "id": 11620,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "568dc955c3a36858f400101e",
               "name": "Dora Medrano",
               "profile_path": null,
               "id": 1559235,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "568dc98ac3a36858fc001109",
               "name": "Helen Pollak",
               "profile_path": null,
               "id": 8850,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "568dc9a29251416b450011e4",
               "name": "Lynda Gurasich",
               "profile_path": null,
               "id": 83118,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 0,
               "credit_id": "568dc9ed9251416b550010f2",
               "name": "Wylie Stateman",
               "profile_path": null,
               "id": 1352969,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "568dc9f9c3a3685906001373",
               "name": "Wylie Stateman",
               "profile_path": null,
               "id": 1352969,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "568dca449251416b4e001113",
               "name": "Gregg Landaker",
               "profile_path": null,
               "id": 1341781,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "568dca539251416b4a0010f1",
               "name": "Michael Minkler",
               "profile_path": null,
               "id": 1399141,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "568dca5fc3a36859020011f3",
               "name": "Michael Minkler",
               "profile_path": null,
               "id": 1399141,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "568dca6e9251416b55001110",
               "name": "T.J. O'Mara",
               "profile_path": null,
               "id": 17993,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "568dca8ac3a36859020011ff",
               "name": "Jay B. Richardson",
               "profile_path": null,
               "id": 1389624,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "568dca9cc3a3685906001399",
               "name": "Lon Bender",
               "profile_path": null,
               "id": 16736,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "568dcaaac3a3685902001206",
               "name": "Scott Martin Gershin",
               "profile_path": null,
               "id": 3193,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "568dcabcc3a36858ec0010c1",
               "name": "George H. Anderson",
               "profile_path": null,
               "id": 14382,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "568dcae6c3a3685902001219",
               "name": "Hugo Weng",
               "profile_path": null,
               "id": 1050930,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "568dcaf39251416b47001105",
               "name": "Dan M. Rich",
               "profile_path": null,
               "id": 1536361,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 2,
               "credit_id": "568dcb1a9251416b4700110e",
               "name": "William H. Burton Jr.",
               "profile_path": "/xhvDErmxpPvEb9dd3h2XMNnB7Re.jpg",
               "id": 1412253,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "568dcb2bc3a36858f0001130",
               "name": "Webster Whinery",
               "profile_path": null,
               "id": 4064,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "568dcb80c3a3685902001241",
               "name": "Dayton Nietert",
               "profile_path": null,
               "id": 12598,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "568dcb8dc3a3685902001246",
               "name": "Ian Kincaid",
               "profile_path": null,
               "id": 589970,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 2,
               "credit_id": "568dcbb5c3a3685902001254",
               "name": "Mario Kassar",
               "profile_path": null,
               "id": 3986,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "568dcbc49251416b400011d1",
               "name": "Brian Grazer",
               "profile_path": "/yqiKX3auDuorea0BOtuB6Ifhyp6.jpg",
               "id": 339,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "568dcbd7c3a36858f90011a7",
               "name": "Nicholas Clainos",
               "profile_path": null,
               "id": 1559240,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "568dcc089251416b400011e3",
               "name": "Clayton Townsend",
               "profile_path": null,
               "id": 3184,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 1,
               "credit_id": "568dcc3ac3a36858ea0011a8",
               "name": "Risa Bramon Garcia",
               "profile_path": null,
               "id": 3191,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "568dcc45c3a36858fc0011c0",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "568dcc9e9251416b52001120",
               "name": "Bruce R. Hogard",
               "profile_path": null,
               "id": 1321587,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "568dcd7b9251416b4e0011c8",
               "name": "Julie Monroe",
               "profile_path": null,
               "id": 53645,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "568dcdb8c3a36858ea0011f4",
               "name": "Carlton Kaller",
               "profile_path": null,
               "id": 1398863,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 2,
               "credit_id": "57789819c3a36832b0000513",
               "name": "Joseph P. Reidy",
               "profile_path": "/3bZ4HUh4JFPKo1yw2XDYjMmwj6m.jpg",
               "id": 7531,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5778989d9251411c53001b80",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "577898c0c3a3683269000561",
               "name": "Randall Jahnson",
               "profile_path": "/ijL3uaKskVMZipUUtRzKiZhCfpW.jpg",
               "id": 57377,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 7.461413,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10537,
      "vote_count": 362,
      "budget": 38000000,
      "overview": "The story of the famous and influential 1960's rock band and its lead singer and composer, Jim Morrison.",
      "similar": [
         106646,
         31900,
         12271,
         4995,
         979,
         27,
         627,
         5915,
         122081,
         316029,
         363676,
         228970,
         1407,
         325789,
         152532,
         4247,
         36685,
         9433,
         149870,
         24402
      ],
      "original_title": "The Doors",
      "runtime": 140,
      "poster_path": "/9CkFrWAkg23YynYd2uJLyWznMZZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ixtlan Productions",
            "id": 525,
            "origin_country": ""
         },
         {
            "logo_path": "/4PR5ZyqlDrMqx1h5PyOL4VRL70z.png",
            "name": "Imagine Entertainment",
            "id": 23,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Carolco Pictures",
            "id": 14723,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bill Graham Films",
            "id": 78806,
            "origin_country": ""
         }
      ],
      "release_date": "1991-03-01",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "The Ultimate Story of Sex, Drugs & Rock 'N' Roll",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Oliver Stone"],
      "runtime": 140,
      "synopsis": "California, 1968. In a dark recording studio, Jim Morrison, lead singer for the rock band, The Doors, drinks whiskey while recording spoken-word versions of his poetry. The engineer (a cameo appearance by Doors drummer, John Densmore) plays a pre-recorded music track and Jim begins to recite his work \"An American Prayer\". In a flashback to 1949, a young Jim and his family are seen driving across the Southwestern United States in New Mexico. They pass the scene of a car accident involving two families; one family are American Indians. An old Indian man lies dying on the side of the road. Jim watches until his family has driven out of sight. The film then jumps to 1965. Jim is seen hitchhiking to California and is picked up by a motorist. In Los Angeles Jim attends UCLA's film school. His student film, an artistic and surreal collection of haunting images, is heavily criticized by both his classmates and his professor (a cameo by director Oliver Stone). His future band mate, Ray Manzarek, tells Jim that his movie is commendable, despite the criticism. When the professor asks Jim to defend the film, Jim says simply \"I quit.\" Jim takes up residence in Venice Beach and meets Pamela Courson, his future wife. The two spend a romantic evening on a rooftop and they have sex. Jim later meets Manzarek on the beach, interrupting him while he meditates. Jim shows Ray poetry he has written that he believes can be recorded as a song (\"Moonlight Drive\"). Ray is astounded and the two set out to form a band, the name being inspired by Aldous Huxley's memoirs, The Doors of Perception. They recruit John Densmore as their drummer and Robby Krieger on guitar. Their first rehearsals are held in Ray's apartment, where they perform \"Break on Through\". Robby plays a song he'd been working on which becomes \"Light My Fire\". The band finds themselves on LA's famous Sunset Strip, performing as an opening act in one of the Strip's many clubs. The band is approached by a talent agent who wants to sign them. The same man later tries to talk to Jim alone, thinking he could be signed without his band mates. Jim is indifferent. One year later. The band bonds further while on a trip to Death Valley to try peyote. Everyone experiences different hallucinatory visions while the film's soundtrack plays the strains of \"The End.\" The scene changes to another performance by the band where Jim is singing the Oedipal interlude of the song, which offends the club owner who throws them out. Outside, they are approached again by a talent agent. They are given a chance to record an album in six days. The band agrees. Having achieved some measure of success, the band is asked to appear on the Ed Sullivan Show where they'll perform \"Light My Fire.\" Before the performance, Sullivan's producer, asks the band to alter the song slightly, changing \"Girl we couldn't get much higher\", a potential reference to doing drugs. Jim is reluctant but agrees. During the performance, however, Jim does not comply (clearly defiant to sing the song as it is), drawing the anger of the producer, who angrily says the band will never perform on the show again. Another year later in New York City, at a party thrown by Andy Warhol at The Factory, Jim meets Nico, sometimes singer with the Velvet Underground, and Warhol himself. Warhol gives Jim a telephone that he claims can be used to speak with God. Later, at their hotel, Jim cavorts in the elevator with Nico, while Pamela staggers around in a drug-induced funk. The band is later interviewed by the press - one of the reporters is Patricia Kennealy. Jim speaks cryptically about his parents (saying they died in an automobile accident years before) and about life in excess and using drugs. Jim later has sex with Kennealy but is mostly unable to perform. She entices him with cocaine and consumption of his own blood which drives him into an animalistic frenzy. Jim later is unable to perform sexually with Courson. Jim asks Pamela if she'll die for him and dangles himself out the window. Pamela becomes nearly hysterical and manages to get Jim back in the room where he is able to finish sex with her. December 9, 1967. Backstage at a concert in New Haven, Connecticut, Jim has a feverish encounter with Kennealy, who reveals that she knows Jim's parents are still alive and that she talked to his father on the phone. Jim tries to convince her that they are at least figuratively dead, but she still tells him never to lie to her again. A policeman appears, asking who they are. Kennealy tries to explain who Jim is, however the cop becomes hostile when Jim resists arrest and sprays the singer in the eyes with mace. The rest of the band comes to his aid, Manzarek tells Kennealy to leave Jim alone. During their performance that night, Jim suddenly stops singing and recounts the incident to the crowd while mocking the police. A police captain walks on stage and arrests Jim, stating that his language as broken state obscenity laws. Jim is arrested on-stage by the cops whom provided security for him, and are now roughing him up as the crowd goes wild with rage. A near-riot is averted when other policemen arrive on the scene to disburse the crowd. Another year later. Jim and Pamela throw a Thanksgiving 1968 dinner party for their friends. Right before the party, Jim had convinced Pamela to take a tab of LSD and she spends the rest of the day in a largely depressed state. One of the guests is Patricia Kennealy, a name that Pamela recognizes immediately. She confronts both Jim and Patricia about their sexual relationship and becomes furious with Jim, throwing food at him in front of their guests. Jim stomps on the duck Pamela had been roasting and demands she kill him with a kitchen knife. A montage follows where Jim and Pamela have a furious fight and Jim locks Pamela in a closet and sets the door on fire. In a Celtic hand-fasting ceremony (the high priestess is played by the real Kennealy) Jim marries Patricia. Jim is also seen partying heavily and getting into a car accident when he runs into a police car. Jim is later in the studio trying to record \"Touch Me\" for the Soft Parade album. Their producer, Paul Rothschild, tells Jim that his life of excess is affecting his performance and that Janis Joplin suffered the same fate and died of alcoholism. On a small television in the studio, Jim sees a commercial for a car that features a pop version of \"Light My Fire.\" The band tells him that they decided to sell the song to the auto company during a time when Jim was in minimal contact with them. Jim becomes infuriated and hurls the TV across the room, nearly hitting Ray, and then cheerfully apologizing. Later, while Pamela performs oral sex on Jim as he sings the title track for the album, everyone in the control booth leaves quietly, unimpressed with Jim's still lackluster performance. March 1, 1969. Backstage in Miami, where the band is due to perform, the band awaits the arrival of their front man. Densmore looks out on the crowd and hears a reporter recording a story about what he believes is the end of the band itself, criticizing the Soft Parade album. The band is told that Rothschild is bringing Jim to the venue. When he arrives his band mates are angry with him. Jim gives Robby a tab of LSD and they go onstage. Not long into the show, Jim sees a vision of a bonfire and a young American Indian girl and the old man he'd seen dying in the road years before. Jim stops singing and tells the crowd that they're slaves. The band stops playing, clearly annoyed and angry with Jim's attitude. The audience, already agitated at Jim's tardiness, begins to yell back at him. Jim yells mostly nonsensical gibberish and tells them he'll expose himself. When he unzips his pants, the police present at the venue, try to arrest him but he evades them and runs into the crowd, singing \"Dead Cat, Dead Rats\" and launching into \"Break on Through.\" The incident is a low point for the band, resulting in resentment from the other band members and Jim's trial the following year for indecent exposure. At his August 1970 trial, Jim is found not guilty for lurid behavior, but convicted of indecent exposure and using profanity and is sentenced to eight months in prison. Yet, Jim is allowed to remain free on bail while the verdict is being appealed. When the last of his appeals for his 1970 indecent exposure conviction is denied, Jim and Pamela decide to flee to Paris, France where Jim can relax and focus his creative writing energy. After the Doors make a comeback with their early 1971 album, 'L.A. Woman', Jim decides to quit the band and focus on his poetry. At a birthday party for Ray's young daughter, Jim talks with the rest of the band who play \"Riders on the Storm\" for him. Jim comments that it \"sounds pretty good for four guys who were barely talking to each other\" the day they recorded it. Jim gives everyone a small printed version of \"An American Prayer\" and the band, despite having hardly spoken, say their goodbyes, Densmore even tells Jim him he'll actually miss him. On July 3, 1971, Pamela finds Jim Morrison dead in a bathtub in their apartment in Paris. The final scenes of the film are of graves of other poets, composers, writers & performers all buried in Père Lachaise Cemetery in Paris. A rock version of Remo Giazotto's \"Adagio in G minor\" plays in the background with a voice over by Morrison. The camera finally moves toward Morrison's own grave, showing the graffiti that covers other gravestones nearby, finally settling on his marker. Just before the credits, the screen whites out and text appears saying \"Jim Morrison is said to have died of heart failure. He was 27. Pam joined him three years later from a heroin overdose in August 1974, and she was also age 27 when she died.\" During the credits, the band is shown recording the song \"L.A. Woman\" in the studio.",
      "writers": [
         "Randall Jahnson",
         "Oliver Stone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101761/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMTY4ODYwNV5BMl5BanBnXkFtZTcwODQ4NDEzMQ@@._V1._CR0,35,284,464_SX214_AL_.jpg",
      "actors": ["Stars: Val Kilmer, Meg Ryan, Kyle MacLachlan | See full cast and crew »"],
      "reviews": [
         "We all know how legendary The Doors were and still are, and sooner or later someone was going to make a film about them. Might as well be Oliver Stone. Given the subject matter, Stone was able to go off the deep end with his imagery here to the point of making one have an epileptic seizure OR think they just dropped some acid. Either way, it's great to watch in my book. The film is flawed in that it's not titled correctly. It's not about The Doors, it's about Jim Morrison and basically just the wild and crazy side of him. That's ok I guess, Morrison was The Doors. Many have criticized Stone for not depicting Jim in the proper light, but given how many people knew him it had to be an almost impossible task to please everyone as everyone knew him differently. I think we all can attest to this through the friendships we have with our friends. Some know us as one way, and some know us as another. I respect Stone for trying and feel sorry for him about the flak people have given him as I know he is a very talented director. I think his intentions were spawned out of true admiration and that he made this film for himself and to pay tribute, and not to win any awards. More of this can be found on the Special Edition DVD from Stone himself. Even if one does not enjoy the trippy qualities of the film such as I do, or any part for that matter, one could not avoid admitting how well Val Kilmer portrays Morrison. It's simply amazing and is one of the best performances that I can bring to mind, and is the best example of how to literally become someone else, bar none. He doesn't act like he's Jim Morrison, he becomes Jim Morrison. He is Jim Morrison. This is no doubt helped by the uncanny facial similarities the two have. Not only that, most of the singing that's in the film was done by Kilmer himself and even a few of the original band members admitted that they honestly could not tell the difference between their two voices. Even if you hate Val Kilmer, this performance jumps in your face and screams for respect while trying to strangle you. As mentioned earlier, some do not like the film for several reasons. One is that it makes Jim look like a monster and that it only glorifies his wild and uninhibited behavior. Two is that it's basically just one big acid trip into bits of history about the band. For one, Oliver Stone said it best....when you have to condense a person's life, a legend at that, into two measly hours you must take the highlights. Everyone lives longer than two hours, even Jim. We all know Jim was crazy, and with so many of the insane stories Stone heard while trying to piece together the script for this, a lot of what he heard was simply what you see. The wild and crazy side. As a result, what we're left with is not an accurate depiction of The Doors or of Jim Morrison. It is entertaining, yes, but it is not accurate. I think it could have been done perfectly, but it would have been excruciatingly difficult...and still not everyone would like it. And as far as the trippiness of the film, well that's Oliver Stone for you. We saw the same thing in Natural Born Killers a few years later. I personally like the style of it and felt that it was in place here but that's just my opinion. The '60's, drugs, and rock and roll equals trippy. Overall a decent attempt at one of the most difficult subjects to cover, legends. And even though it's not entirely accurate and even though Morrison is one of my idols and he deserved a little better, I do enjoy the film greatly. The film should have been named Pandora's Box.",
         "This film is truly a gem. The Doors is easily the best film of the rock n' roll genre and at least one of the most important films of its era. Though I am not an Oliver Stone fan I must give credit where it is due. Stone really does a terrific job with this film, and shows what he is capable of when he actually knows about the subject he is attempting to comment on. A few of the scenes in the film are almost exact recreations of actual events. However, the magnificent thing about this film is that it manages to recreate a certain amount of reality while simultaneously realizing that for a film to possess its own vitality it must transcend the preexisting reality, move beyond the surface, beyond everything that is obvious, and express and explore something deeper. Val Kilmer delivers a powerful performance in which he almost seems to be channeling the energy of Jim Morrison, and though I've seen many of Meg Ryan's films this is the only one I can recollect where she does such a good job that she makes you really forget about her and focus on the character. The cinematography of the film by Robert Richardson (Platoon, Wall Street, Born on The Fourth of July, Natural Born Killers, Casino, Bringing out the Dead, and many more) is bold and unique making the film one of the most distinct visual films I've ever seen. This film is truly one of a kind, and breaks through into new cinematic territory, giving priority to the visual aspects of the film in an era where there are so few films that even give much consideration to the single most important aspect of the motion picture. The genius of this film is that it is visual-audio as opposed to audio-visual and is more concerned with expressing something than simply impressing the audience. The Doors is a refreshing cinematic breakthrough in an era in which cinema seems all but forgotten.",
         "My eyes were closed until autumn 1995, when channel 5 in Sweden showed The Doors. I taped it and didn't think too much of it in the beginning. The only thing I knew about The Doors was their song \"Light my fire\". A friend of mine, who borrowed the film from me, told me he liked the \"cave\" scene and the music in it. I myself liked the scene where Jim climbs up to Pam's balcony. That was pretty much it. But then I noticed the song \"love street\" which is played in the beginning, and then I realized that the guitar intro to \"The end\" wasn't that bad. After that I bought the soundtrack and now I was pretty much hooked. I put my eurodisco records on a shelf and became a \"rock'n roller\", and Jim was my role model. My relationship to Jim Morrison is actually the closest to being a gay that I will ever be. The best part of the film are the opening thirty minutes, where Jim \"quits\" his film class on UCLA, follows Pam home from the beach and takes her out on a night walk, rehearses with the band and \"Light my fire\" is introduced. Too bad we never get to see the band being formed. I love that story, when Jim meets Ray on the beach and that conversation leads up to Jim singing \"Moonlight drive\". This scene is also one of few which shows the real Jim Morrison, but I will get back to that later. Around this time, Jim meets his girlfriend with whom he stayed until he died. After half an hour, the movie takes on in a different direction. It is from now on, a very dark movie. This is for a reason, and the reason is that Oliver wants the audience to see everything through Jim's eyes. The result is that some scenes are very surreal and after a while you may think that Oliver Stone himself took some acid before shooting them. The negative side of the film, which have made many people upset, is the way Jim Morrison is presented. Jim is high or/and drunk in nearly every scene he appears in, and since the movie is shown through his angle the result is the surrealism and spaced-out scenes. \"Jimbo\" has unfortunately a bigger part than Jim. (See the movie and you'll know what I mean.) I have read practically every book there is to read about The Doors, including the one named \"light my fire\", written by the organist Ray Manzarek. This guy isn't too happy with the movie. I see his point but at the same time, he confirms in the book that most of the things in the movie has actually happened; the back against the audience, the Ed Sullivan sequence where Jim sings the word \"higher\" on national television, the TV-throwing in the studio. Other things could never happen or are just simply wrong; the Andy Warhole-party where Jim is abandoned by the rest of the band (something that true friends would never do to one another), Jim's student project (his movie didn't look like that at all), Jim's red mustang (Jim had a blue mustang which he actually called \"the blue lady\"). Oliver Stone focuses the movie on the wrong things. Sure, Jim Morrison was a pothead, but he was also a very intelligent, sensitive, friendly and funny person. This is far from the picture most people have of him after seeing the movie. But if you know this, and just want some Rock'n roll in your life you will like the movie anyway. Another strange thing is that Oliver Stone has said that he loved Jim and wanted the movie to be a sort of homage to him!? Some homage. So the film is great, however it is not the real story of Jim Morrison. The only time we see the sensitive side of Jim is when he turns down an early offer from a record company man who tells him to \"drop those guys\". The music numbers are the scenes that impresses me the most. The choreography, the lighting of the stage, and, above all, the fact that Val Kilmer actually sings all the songs by himself. Look at the \"Not to touch the earth\" sequence and you'll know what I mean. And now we come to the best thing with this movie. The ONE thing that made me buy it and watch it about 30 times after that. That thing is Val Kilmer. An actor who hadn't made anything spectacular before this and haven't really done anything after it. He was born to do this part. It isn't the real Jim, but an alternative Jim who you kind of love to hate. But now I'm only talking about the personality. Kilmer walks like, talks like, sings like, and above all looks like Jim. And some looks. What wouldn't I give to have that hair or that wardrobe. Besides Kilmer, there are many more great and well-known actors in this movie; Mimi Rogers, Michael Wincott, Josie Bissett, Crispin Glover, Kathleen Quinlan (who plays the very true character Patricia Keneally), and one of the few actors that I can't stand; Michael Madsen. Also, some artists gone acting; Billy Idol, Swedens own Eagle-Eye Cherry (whose scene were cut out from the final film), and if my eyes aren't lying to me; Billy Vera. And oh yeah, I almost forgot: MEG RYAN (arrr). Also, do not forget to check out the cool end credits, with fast speeding pictures of night time L.A, being played to \"L.A woman\". I now see that channel four is showing \"Wall Street\". Very appropriate way to spend the rest of this evening, don't you think? Of course, it can't be compared to The Doors but nevertheless!",
         "Watching Oliver Stone's The Doors can be at times a frustrating experience. Considering the central figure in the film is pretty much always drunk or stoned or both the entire plot seems to unfold in a bit of a haze. Those watching the film may come away feeling a little stoned themselves. Yet through the drug and alcohol-fueled haze this film does have a lot to recommend it. Most notably it has one of the most stunningly brilliant acting performances you could ever hope to see. Val Kilmer, playing Jim Morrison, is simply perfect in the role. It sounds clichéd but Kilmer really seems to become Morrison. The physical resemblance is eerie and their voices are so similar it is fairly impossible when listening to the film's soundtrack to figure out when exactly you're hearing Morrison and when you're hearing Kilmer. Tracing Morrison's journey from shy, reserved youth to manic, drugged-out rock god the performance by Kilmer is mesmerizing throughout. As good as Kilmer is you can't help but feel that his performance deserved to be surrounded by a better film. The film might as well have been titled \"Morrison\" because it is much more the story of one man than it is the story of his band. And therein lies much of the problem because while Kilmer is undeniably terrific, Morrison, at least as he is portrayed in this film, is not a very sympathetic character. That shy, quiet guy we see on the beach at the film's beginning becomes a bit of a monster, at times almost completely unlikable. And since the film revolves entirely around Morrison it makes the film often hard to embrace. Many would argue that Morrison was unfairly portrayed here, not nearly as mean-spirited and hot-tempered as we are led to believe. The truth probably lies somewhere in between but the fact remains that in this film it is very hard to embrace Jim Morrison and as such it is very hard to completely embrace the film. With the focus almost completely on Kilmer's Morrison the rest of the cast comes off as little more than bit players. Kyle MacLachlan as keyboardist Ray Manzarek has the most to do amongst the remaining band members and his performance is fine but it really gets swallowed up by the ever-present and always center stage Morrison. Meg Ryan, playing Morrison's longtime companion Pamela Courson, is allowed only to react to Morrison's antics and never establishes a character and identity of her own. Even when stoned out of her mind, as everybody in this film always seems to be, Pamela comes across as the wholesome girl next door who is, well, rather dull. Kathleen Quinlan has a more memorable turn as another woman in Morrison's life, Patricia Kennealy, who is anything but dull. But again her character is there only to serve Jim. It's always about Jim. Nobody could deny that Jim Morrison was the most captivating figure in The Doors. But as the film unfolds and you watch Morrison stumble from one stupor to the next you'll probably wish we could have spent a little more time with some of the other characters. This film version of Jim Morrison is a hard guy to love. So in the end what are we left with? You get one awe-inspiring, magnificent performance but that performance overshadows everything else going on in the film. You get a fascinating life story but one that unfortunately proceeds mostly in a frustrating drug-induced haze. You certainly get a tremendous soundtrack with all of The Doors' most notable songs. Well, most of them anyway. There seems to be a real yin and yang with this movie. There is plenty that is very good about it, but all that is good seems to be balanced out by something which frustrates. Jim Morrison led an extraordinary life but this film which tells his tale ends up being rather ordinary.",
         "This is just a sampling of the lyrics that singer/writer Jim Morrison contributed to his group The Doors, and just this, as part of his epic piece \"The Celebration of the Lizard\" shows his skill as a master of the written word. He is shown in Oliver Stone's The Doors as a shy, though often obnoxious and crude, persona who self describes himself in one scene: \"I think of myself as a sensitive, intelligent human being, but with the soul of a clown that forces me to blow it at the most crucial of moments.\" He may have blown it in the end, but it makes for a fascinating story. As being a Doors fan, the music and words are the best character of the movie- the songs represent feelings and emotions, desires and hatreds, and other facets of life in the late 60's, are indispensable gems of rock and blues. While the Doors recorded only six albums together (not counting American Prayer, Morrison's awesome feat of an album) each one is still transfixed into the minds of people all over the world. It's thirty-two years since the king died, but in another thirty-two he will still be remembered. And that is a fact that Stone plays with like Travis Bickle in front of the mirror with his guns in Taxi Driver. He reveals only Morrison's known persona, and not the quiet moments. The concert recreations are grand, but there isn't more of the sweet Jim (one glimpse of such a Jim is seen at a birthday party when he gives out gifts as \"Chief Mojo Risin) What is shown is splendid enough for his abilities- he paints a vivid picture of Los Angeles 1965 onward, with Val Kilmer in the second best acting job of 1991 (deserved of an Oscar nomination), and puts Jim in the middle. He is a man who is fascinated with death, with man's wills to power, and how life gets painful without the chemicals top open the mind. Kilmer gets so much into your head in this film that by the end you'll love him, hate him, or feel wonder about him. I felt wonder about him, wonder why he looked to heroes who gave him such ideas about the love of death, wonder why he felt the need to take it to the limits. But his desires are Stone's as well, and while this isn't a perfect film, it's one that isn't easily forgotten. A+",
         "Jim Morrison wrote many of the Doors songs and was a complete drunk by the time he died in 1971. This film depicts Morrison in a very one sided view. Yes he was an alcoholic with a disregard for authority, yes he was on self destruct mode and burnt out quickly reaffirming the James Dean \"Live fast Die young\" motif. But what is missing from Stone's depiction of him was his great intellect,his absurd humour and his natural talent as a composer and vocalist. However it is a wonderfully visual film that takes the viewers on a hallucinogenic ride through drug hazed Los Angeles in the late 60's. It was the first of many films that Stone created in the 90's using an almost dream like quality to evoke the feeling of the turbulent times. Although this picture is not a 100% accurate account of who or what Jim Morrison was it is still very engaging and enjoyable. A good place for someone who is new to the Doors to start.",
         "Utterly absorbing bio-pic of Jim Morrison. The name Val Kilmer is, or should be, synonymous with incredible acting that is not merely natural or convincing, but immensely fun and commanding. You may have noticed while watching his recent Wonderland - Val has the ability to make a picture. Here, he IS The Doors: The Movie. There, he WAS Wonderland. I am exaggerating, i suppose. For Oliver Stone has crafted a marvellous film which makes you feel like you've experienced what the sixties were like. Through using The Doors actual music (what was missing from the recent Sylvia, the art of the subject itself - her poetry) to help tell its story and colour its scenes, and filmic techniques to create the drug-induced world vision of Jim Morrison, Stone really takes you into the world of his movie, and the world of the sixties. This movie made me appreciate what an exciting experience The Doors were, and has actually cultivated love in me for their music. I didn't realise they had more than one classic: Light my Fire, The End, People are Strange, Love her Madly, Break on Through to the Other Side, Riders on the Storm, Touch Me, Roadhouse Blues (Let it roll, baby roll) and probably more i'm yet to discover. For a better recreation of what Andy Warhol's factory actually felt like, see I Shot Andy Warhol. Crispin Glover actually looks more like Andy than the guy who plays him in \"I Shot,\" but the guy in I Shot much better captured Andy's vagueness and almost unconsciousness while in conversation. This, however, is but three minutes in the movie and has no effect on it as a whole. Oliver Stone has an amusing cameo: a young film student, Jim Morrison, shows his short film to his class, who are uncouth and disparaging about it, after which camera pans to reveal Oliver Stone standing at the lecturn, (obviously, playing the film professor), who says: \"Why don't we ask the author what he thinks?\"",
         "Although less popular now, Jim Morrison was an American pop culture icon during the late 1960s. He liked to refer to himself as \"Mr. Mojo Risin\", an anagram of his name. Oliver Stone's film \"The Doors\" is mostly about Morrison ... his rise to stardom in the 1960s, his personality, and his mysterious death in 1971. Influenced in childhood by American Indians, Morrison grew up fascinated with Indian Shamanism, elements of which he would later infuse into his poetry and music while hanging out in the mid 60s in the hip areas of Los Angeles. Here he would meet musician Ray Manzarek (Kyle MacLachlan). Along with two other band members, the group would form \"The Doors\", a name Morrison borrowed from the title of Aldous Huxley's book on drug use and enlightenment, called \"The Doors Of Perception\". During this time Morrison comes across as sensitive, shy, poetic, and an idealistic dreamer. The film's first hour is quite good. We get some insights into Jim's early years, and we get to hear some of that great music, like \"Riders On The Storm\", and \"Light My Fire\". The film's second half is less interesting. Morrison himself has changed, as a result of his celebrity status. His narcissism, his boozing and drug use, have turned his world into chaos, which is evident in a couple of staged concert events, one in New Haven, the other in Miami. The amount of time that Oliver Stone spends on these noisy, chaotic events is excessive. Some of that could have been edited out. As with most Stone films, the cinematography in \"The Doors\" is excellent, and includes some early CGI. Val Kilmer is a great choice to play the part of Morrison. And Kathleen Quinlan is good as Patricia, the seductive witch. The film's images at the cemetery in Paris, together with Gothic background music, make for a haunting finale. Stone's movie is not to be taken in a literal sense. Rather, it is suggestive of the complex mix of personal and cultural forces that interacted to create a pop culture legend. As a byproduct of this cinematic tribute, the viewer gets to see how the late 1960s really were, with the art deco, the hippie lingo, and all that hostility that existed in society. The film thus counters the political revisionism that later decades have assigned to that period. As such, \"The Doors\" complements and reinforces other films of that era which also \"tell it like it really was\": \"Medium Cool\", \"Easy Rider\", \"Alice's Restaurant\", and \"Zabriskie Point\", to name a few. Despite a noisy, irksome second half, \"The Doors\" is an intriguing film about an intriguing historical figure. Mr. Mojo Risin's \"style\" may have died with the times. But Jim Morrison, himself, lives on ... as legend.",
         "Val Kilmer did a great job portraying Jim Morrison. He brings you into the spiraling life of Jim Morrison and back to the days of sex, drugs, and rock and roll. Throughout the movie you see what made Jim Morrison tick, and get to hear some great music along the way. The cinematography during his drug induced hallucinations is well done and helps pull you into Morrison;s life. Definitely a movie you can sit and watch more than once and one you can enjoy whatever age you are. Whether you were a dedicated Mossison fan or have never followed him, this movie is entertaining on it's face. The fact that the movie portrays the real life of a rock and roll legend, makes the movie that much more interesting.",
         "The Doors is unapologetically a film about sex, drugs, and rock n' roll. For 140 minutes we follow Doors singer Jim Morrison from his days as an aspiring film student at UCLA to his death in Paris in 1970 at the age of 27. Writer-director Oliver Stone based the story of the film on some 150 transcripts detailing the life and character of Morrison. The result is far from flattering. The Doors paints a picture of a man enamored with death, his own inevitable demise more a relief than an agony. Death stalks Morrison wherever he goes from a young age. As a child driving through the New Mexico desert with his family, Morrison happens across the site of a car accident littered with dead and dying Navahos. We watch the young Morrison endure what seems to be a sort of possession rite by spirits of the dead natives. Years later he'll profess to be a shaman and from what we see on screen, he might well have believed it to be true. Native American spirits dance alongside Morrison as he sings on stage. Whether these were real or simply an acid fueled hallucination is left deliberately unclear by Stone. Likewise, a death-like character (Richard Rutowski) shadows Morrison throughout his life as a rock singer. Whether this indicates Morrison saw death as a friend, was actually accompanied by Rutowski (who was a real life friend of Morrison), or was simply hallucinating remains ambiguous. What is clear is the following: in his great desire to self destruct, Morrison drank whiskey like water and spent an inordinate amount of time on precarious ledges outside Hotel windows thirty stories up. Kilmer's performance as Morrison is easily the finest of his career. Raw, nervy, deliberately off putting and confrontational, moments of sobriety are few are far between for this insecure egomaniac. At times I didn't feel as though I was watching a portrayal of a character long deceased so much as a documentary. From threatening suicide repeatedly to quarreling constantly with police at concerts, scenes of bad behavior are many but moments of insight are few and far between. This doesn't seem a shortcoming on behalf of director Stone so much as an accurate depiction of the highly acidic Morrison as he truly was; this was a man who didn't want to be understood. This was an artist on the constant edge of oblivion; an iconoclast who refused to be loved and was close to intolerable whenever possible. Of course it's less than a pleasant experience following the venomous creature that Morrison became for the film's final hour as he goes from alcohol induced nervous breakdown to drug fueled indecent exposure, but I for one appreciate Stone's refusal to Hollywoodize the life and death of Morrison. Kilmer abandons completely all instinct for self preservation on screen, submerging himself in a performance that can only be described as his magnum opus. Meg Ryan leads the supporting cast as Pamela \"Morrison\" Courson, Morrison's longtime lover and common-law wife. Ryan seems lost in the role but thankfully spends a minimal amount of time on screen as Morrison was a firm supporter of the \"free love\" social movement. Indeed, he spends more time with journalist and witchcraft enthusiast Patricia Kennealy (Kathleen Quinlan), an amalgam of several Morrison lovers who suffered through his frequent alcohol and drug induced impotence. A very fine Michael Madsen is wasted as actor Tom Baker, a friend of Morrison's whose relationship is grossly underdeveloped. The only performance among the supporting cast worthy of praise is that of quirky character actor Crispin Glover in a cameo as Andy Warhol, a scene that is absolutely spellbinding. Some may criticize The Doors for glamorizing a life of excess; this film gives younger viewers the idea that drugs and promiscuous sex are fun, critics may charge. Those who would are missing the point entirely. As are those who would interpret this film as the cautionary tale of a life wasted. Little about the character we view on screen is glamorous. It seems no accident that Morrison died as he did. This was a man obsessed with death; his demise seems more a moment of wish fulfillment than tragedy. My only significant criticism of the film is that the title is certainly a misnomer; this could have easily been titled \"The Jim Morrison Story\" as there is not a single scene on screen without the eccentric singer while the remaining members of the band are relegated to obscurity. Call it art imitating life once more."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Bill Graham Films",
         "Carolco International N.V.",
         "Carolco Pictures"
      ],
      "summaries": [
         "Oliver Stone's homage to 1960s rock group The Doors also doubles as a biography of the group's late singer, the \"Electric Poet\" Jim Morrison. The movie follows Morrison from his days as a film student in Los Angeles to his death in Paris, France at age 27 in 1971. The movie features a tour-de-force performance by Val Kilmer, who not only looks like Jim Morrison's long-lost twin brother, but also sounds so much like him that he did much of his own singing. It has been written that even the surviving Doors had trouble distinguishing Kilmer's vocals from Morrison's originals.",
         "Meeting each other in UCLA Film School in 1965, Ray Manzarek suggests to Jim Morrison that they form a rock band. With Robby Krieger and John Densmore, that band would become The Doors. Although the foundation of the group was based on consensus, Robby and John in particular increasingly see frontman Jim's on-stage performances self-indulgent - albeit undeniably charismatic - to his controversial lyrics. His on-stage antics are fueled in large part by excessive alcohol and drug use. Outsiders begin seeing Jim as The Doors, while he begins seeing himself as \"The Lizard King\". It is that charisma that gets them a deal with Elektra Records, and resulting fame. Despite his popularity with the record buying public, Jim continually has run-ins with those in authority for his anti-establishment behavior. With him and the band through it all is Jim's longtime girlfriend, Pamela Courson. Theirs is a rocky relationship, primarily over Jim's open infidelity - including with reporter Patricia Kennealy - and drug-induced erratic behavior.",
         "The story of the famous and influential 1960s rock band and its lead singer and composer, Jim Morrison, from his days as a UCLA film student in Los Angeles, to his untimely death in Paris, France at age 27 in 1971."
      ],
      "budget": 38000000
   },
   "movielensId": 1093,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-03-01",
      "dvdReleaseDate": "2001-02-20",
      "directors": ["Oliver Stone"],
      "runtime": 140,
      "movieId": 1093,
      "title": "The Doors",
      "mpaa": "R",
      "actors": [
         "Val Kilmer",
         "Meg Ryan",
         "Kyle MacLachlan",
         "Frank Whaley",
         "Kevin Dillon",
         "Michael Wincott",
         "Michael Madsen",
         "Josh Evans",
         "Costas Mandylor",
         "Dennis Burkley",
         "John Capodice",
         "Mark Moses",
         "Will Jordan",
         "Robert LuPone",
         "Floyd Red Crow Westerman",
         "Billy Idol",
         "Kathleen Quinlan",
         "Kelly Hu",
         "Crispin Glover",
         "Paul Williams",
         "Debi Mazar",
         "Phil Fondacaro",
         "Oliver Stone",
         "Jennifer Tilly",
         "Jennifer Rubin",
         "Mimi Rogers",
         "Charlie Spradling",
         "Delia Sheppard",
         "Julie Strain",
         "Paul A. Rothchild"
      ],
      "imdbMovieId": "0101761",
      "originalTitle": "The Doors",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [
         "1_LPEynddOo",
         "DDE9kXwG0fs",
         "JkUx9kS6oBQ"
      ],
      "plotSummary": "The story of the famous and influential 1960's rock band and its lead singer and composer, Jim Morrison.",
      "tmdbMovieId": 10537,
      "avgRating": 3.36532,
      "releaseYear": "1991",
      "numRatings": 9203,
      "posterPath": "/9CkFrWAkg23YynYd2uJLyWznMZZ.jpg"
   }
}