{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "white house",
            "id": 833
         },
         {
            "name": "usa president",
            "id": 840
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "widower",
            "id": 33476
         },
         {
            "name": "wildlife conservation",
            "id": 211505
         }
      ],
      "imdb_id": "tt0112346",
      "video": false,
      "title": "The American President",
      "recommendations": [
         11566,
         3525,
         287,
         11364,
         9440,
         11860,
         12560,
         11062,
         2054,
         18129,
         10879,
         11896,
         13665,
         1552,
         249,
         11092,
         11584,
         1406,
         11060,
         9869
      ],
      "backdrop_path": "/wmViVyE9P0HTVU54sP3EriCmtIc.jpg",
      "revenue": 107879496,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Andrew Shepherd",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adf79",
               "name": "Michael Douglas",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sydney Ellen Wade",
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80adf7d",
               "name": "Annette Bening",
               "profile_path": "/q8pCSQzGLrhgtVXBKzMnwfoeBlH.jpg",
               "id": 516,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lewis Rothschild",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adf81",
               "name": "Michael J. Fox",
               "profile_path": "/2CwTJuL6UHqPJ82oh8WpWUw8Q0V.jpg",
               "id": 521,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "A.J. MacInerney",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adf85",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Robin McCall",
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80adfad",
               "name": "Anna Deavere Smith",
               "profile_path": "/qxnkWqihNIu2FKL8UFxAfv9XfAW.jpg",
               "id": 63279,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Lucy Shepherd",
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80adfb1",
               "name": "Shawna Waldron",
               "profile_path": "/oWfERtTQVAhhvnzM7axvRD3lQju.jpg",
               "id": 112080,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Janie Basdin",
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80adfb5",
               "name": "Samantha Mathis",
               "profile_path": "/dzUjIFu7AAbwwJfj6aFRPfvYgC3.jpg",
               "id": 20767,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Leon Kodak",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfb9",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Senator Bob Rumson",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfbd",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Beth Wade",
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80adfc1",
               "name": "Nina Siemaszko",
               "profile_path": "/htNzOMMh4Hys3EhTDWdJOlbtKpL.jpg",
               "id": 42133,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Susan Sloan",
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80adfc5",
               "name": "Wendie Malick",
               "profile_path": "/w3kIoXuvYDDp2fTTzy4Uq8KZSM2.jpg",
               "id": 61980,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Agent Cooper",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfc9",
               "name": "Beau Billingslea",
               "profile_path": "/3Ooz7bdkkSwwbzOs9SPXIXvGKYQ.jpg",
               "id": 78494,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Esther MacInerney",
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80adfcd",
               "name": "Gail Strickland",
               "profile_path": "/pT9Tb2f07joxd7KYPLucak7X8J0.jpg",
               "id": 42003,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfd1",
               "name": "Joshua Malina",
               "profile_path": "/qa9ItKTmW35iicfsYXowg6P6qm6.jpg",
               "id": 131642,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "President René Jean D'Astier",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfd5",
               "name": "Clement von Franckenstein",
               "profile_path": "/pwpD8AxmseZOmnWXRsDErKk08Ro.jpg",
               "id": 43115,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Leo Solomon",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfd9",
               "name": "John Mahoney",
               "profile_path": "/jK2uDKxfysuYjNAgUxbwyhd4fKD.jpg",
               "id": 4251,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Chairman of the Joint Chiefs",
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfdd",
               "name": "John Mahon",
               "profile_path": "/tkBnAn8PA3gSOj3bSH8zquD7P04.jpg",
               "id": 43978,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Jeff",
               "gender": 0,
               "credit_id": "56bb985592514144db0003ad",
               "name": "Gabriel Jarret",
               "profile_path": "/19LMwcgNFfQnmcIkWeb4SVjKNyR.jpg",
               "id": 92808,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adf8b",
               "name": "Rob Reiner",
               "profile_path": "/2zw9Iq9uo4vZiTQNQWdNFwbA1TA.jpg",
               "id": 3026,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adf91",
               "name": "Aaron Sorkin",
               "profile_path": "/oFff5AbvrhmPW2WsyXV5cL7KURN.jpg",
               "id": 13520,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adf97",
               "name": "Rob Reiner",
               "profile_path": "/2zw9Iq9uo4vZiTQNQWdNFwbA1TA.jpg",
               "id": 3026,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adf9d",
               "name": "Marc Shaiman",
               "profile_path": "/aesoPh8jPR5qDKjjt7o5uj9kS3W.jpg",
               "id": 9251,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfa3",
               "name": "John Seale",
               "profile_path": "/w4wp04pRMqJI2vt3gFTdIWLDDzp.jpg",
               "id": 2702,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80adfa9",
               "name": "Robert Leighton",
               "profile_path": null,
               "id": 3032,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.139604,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9087,
      "vote_count": 248,
      "budget": 62000000,
      "overview": "Widowed U.S. president Andrew Shepherd, one of the world's most powerful men, can have anything he wants -- and what he covets most is Sydney Ellen Wade, a Washington lobbyist. But Shepherd's attempts at courting her spark wild rumors and decimate his approval ratings.",
      "similar": [
         66,
         9386,
         75,
         9772,
         9440,
         11679,
         817,
         13223,
         4141,
         310,
         935,
         1213,
         1429,
         8871,
         7461,
         9762,
         2270,
         4347,
         508,
         509
      ],
      "original_title": "The American President",
      "runtime": 106,
      "poster_path": "/lymPNGLZgPHuqM29rKMGV46ANij.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         }
      ],
      "release_date": "1995-11-17",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Why can't the most powerful man in the world have the one thing he wants most?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Rob Reiner"],
      "runtime": 114,
      "synopsis": "Michael Douglas is President Andrew Shepherd, a widower and father who begins to get uncomfortable with the perception surrounding his being a single father. He drops in on a meeting with environmental lobbyists and meets hard-charging Sydney Wade (Annette Bening). After Sydney escorts President Shepherd to a State dinner, the two strike up a relationship, much to the chagrin of Sydney's boss, played by John Mahoney, and much to the delight of President Shepherd's political rival, the scheming Senator Bob Rumson (Richard Dreyfuss). Rumson's attacks on Sydney and the President's character send President Shepherd's approval ratings tumbling and eventually forces Shepherd to choose between one of his priority bills and the bill Sydney was hired to get passed.",
      "writers": ["Aaron Sorkin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112346/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NDU2NDYzOF5BMl5BanBnXkFtZTYwNDk5MDI5._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Douglas, Annette Bening, Martin Sheen | See full cast and crew »"],
      "reviews": [
         "This Reiner flick is a gem of the nineties. In its genre probably the best thing to hit the screens since Capra rounded them up over half a century ago. The story itself is nothing extraordinary. Set in Washington it is a simple tale of love between lobbyist Sidney Wade and widow President Andrew Sheperd. Flung into love they both encounter obstacles as both opposition and political differences tear them apart. No need to worry though, all is well that ends well. And Reiner is not the one to slip one on us. What makes this film shine above most are not the development of characters or the underdeveloped political statements. Its the achievement of giving audiences 90 minutes of pure bliss. Douglas is lovable as president, Beattys spouse makes you jealous as always, J. Fox never misses an opportunity to display huge talent and Dreyfuss is just the kind of guy you love to hate. Add a dose of victorious political correctness and top it of with a final speech that raises the hair on any kinds of neck but rednecks, and you got your evening made. Enjoy !",
         "Is there a genre that Rob Reiner can't work in and make successful? He captured comedy beautifully with The Sure Thing. Music was brilliant with This is Spinal Tap. Horror? How about Misery? Courtroom drama was awesome with A Few Good Men. And now we have a political drama/comedy. There is nothing this man can't do. This movie works inspite of people's claims that it is too political. Well you know what, it's about the president of the United States of America, there's going to be a bit of poiltics in it. And guess what, guns do kill people, so to have an issue at hand here that deals with gun control is applaudable. Okay, that's out of the way, let's talk about the film itself. Because it is wonderful. It is funny, well acted, and it is written with a good ear. The cast in this film is one to be envied by almost everyone except Oliver Stone and Robert Altman who seem to get everyone to do their films. But here we have Douglas as the president, Sheen as his aid, Michael J. Fox, Samantha Mathis, Annette Bening as Sydney Ellen Wade and in my favourite performance, Richard Dreyfuss as the sniveling weasle Senator Bob Rumsen. As the story goes, the president's character gets questioned when he ( a widow ) finds a girlfriend in Sydney Wade. The issues are handled wonderfully here. Nothing is really tip-toed around as the script writer ( Aaron Sorkin ) writes a brave script about what is right and wrong with being the president and having a girlfriend. I personally liked the politics in the film. I enjoyed how Shepherd decides to ignore the critisism leveled at him until the very end when he gives one of the best written speeches I've ever seen in film. And when he flexes his authoritative muscles, you feel his power, you feel that the president has spoken. And I was moved. This is a great film and one that should be checked out for sure. **** I also found it to be interesting that the character in the film that tries to get the issue of gun control brought to the forefront is Michael J. Fox. He is Canadian and we don't have problems with guns here. Is it a coincidence ( probably ) that he was chosen to play this role? Or was it done deliberately? Interesting.",
         "This is a great feel good movie about a charismatic, essentially very decent, fictional U.S. President, played by Michael Douglas in an extremely likable role. It's a political story as well as a love story. Douglas is both commanding & assured in his presidential role and charming & endearing in his romantic role. If anyone has not yet seen this movie, you'll discover you're in for an unexpected treat. There's something here for everyone...romance, comedy, politics, and drama. Andrew Shepherd is a youngish, popular President soon up for re election. Pressure is being put to bear on him to consolidate his administration's high poll ratings by pushing through a moderate crime bill which totally lacks Republican party support, yet is considered too weak by the Democrats. Meanwhile he finds himself attracted to Sydney Wade, an environmental lobbyist who is seeking legislation to reduce carbon monoxide emissions. Shepherd has been widowed for three years, and currently needs an escort for a State Dinner in honour of the President of France. He invites Sydney to this function and during this & subsequent encounters, the pair fall in love. Trouble ensues when Shepherd is torn between the politically expedient crime bill and the environmental legislation he has promised his new love interest. In terms of romance, there is the ongoing love story between the widowed President and the young lobbyist, Sydney, charmingly played by Annette Benning. This lovely and intelligent lady is quite smitten but at first obviously a bit overwhelmed by it all, feeling awkward and uncertain as the President's date. Sydney looks absolutely radiant at the state ball as she is swept off her feet by this handsome leader of the free world. Their chemistry proves to be electric, the dialogue clever, and the potential sexual situations quite tasteful by modern standards. Naturally the course of true love never does run smooth so it goes without saying that additionally, this unusual fishbowl courtship would have some unique problems as politics and public opinion intrude upon the couple's personal life. A certain built in comedy natural for a dating President makes this romance all the more enchanting. For instance, when Andrew attempts to buy his sweetheart some roses, can't you just imagine the national crisis that all but ensues? Despite his position as Head of State, Andrew likes to do his courting the old fashioned, personal way. During his initial phone call to Sydney, she believes he's one of her friends pulling a prank, which of course results in some hilarity. Naturally this tale is ripe with politics, and some reviewers even claim that the film is something of a precursor to TV's West Wing. Shepherd faces the dilemma of being forced to choose between the crime bill that his party is after him to push, versus Sydney's particular environmental cause. Not only party politics, but there is waning public support to consider. Needless to say, the President has no lack of advisers around who are more than eager to state their views, giving at times unsolicited advice. Martin Sheen plays his Chief of Staff and Michael J. Fox is cast as his Domestic Policy adviser. Shepherd must also contend with mud slinging by a nasty, unscrupulous rival Senator (portrayed by Richard Dreyfuss), who calls into question both Shepherd's family values and his girlfriend's activist past. By the way, any liberal political bias presented in this movie proved totally inoffensive to me. I definitely didn't sense that the producers had a nefarious grand agenda here. Drama wise, there's a touching, close relationship depicted between the President and his charming young teenage daughter, Lucy, and a definite sense of his loneliness following the death of his wife from cancer. Also, Shepherd is confronted with the choice of keeping his promise to Sydney versus salvaging his political career. His Oval Office moral dilemmas are not only relevant to the Presidency but can be extrapolated to any person in any career. This film delivers a powerful message about both personal and presidential integrity. At one point there's a moving speech that is inspiring for anyone, but may give American viewers in particular cause for reflection about the real significance of their country's Presidency and the qualities they might want to look for in the person elected to that office. Personally, I was practically ready to start flying the Stars and Stripes and I'm not even American! Whatever the nation involved, pity we don't have more Andrew Shepherds in political life today.",
         "US President Andrew Shepherd is a widower who was sweep into power on the back of great public sympathy. Three years into his presidency he meets and falls for Sydney Ellen Wade, an environmental lobbyist. Eventually they begin to date against the counsel of his advisors, giving his rivals (most notably Senator Rumson) and the media the ammunition they need to begin to attack his presidency. This is not exactely a political thriller. In fact it is as far removed from reality as you could imagine. However that's the point, this film doesn't pretend to be anything other than a romantic comedy - it has some political wranglings but it is very far from the (still very tidy and clean) rule of Martin Sheen's President in TV's The West Wing. However the story is nicely handled and Rob Reiner is natually very good at this type of thing. Here it occasionally is far too sickly sweet and sentimental, but most of it works well. Douglas is good in the lead and looks quite acceptable as the President of the US - lets be honest, if it was him or \"oil baron\" Bush who would you pick? Bening is also good as Sydney but neither have anything outside of the usual romantic leads to do. The real strength here is the supporting cast - both in terms of class and sheer enterainment value.To name a few - Sheen, MJ Fox, Mathis, Dreyfuss - all big names, all funny performances. Overall this is a big sloppy romantic comedy, but it's done with so much class that it's hard not to like it. Not brillant, but very enjoyable all the same.",
         "This film sees the best acting from Michael Douglas (my God, he isn't a villain), Annette Bening (power woman), Michael J Fox (finally not a teen) and Martin Sheen (oh so amusing). This is such a warm film. It is innocent yet powerful. And the humour is second to none. Just fabulous.",
         "I don't mean that as a slam. I like Pretty Woman a lot, too. But this movie is my \"cure for all ills\" movie. The one I throw in the DVD player on rainy Sunday afternoons and crack out my best junk food. And the political setting seems to give it more meat. Michael Douglas is perfect. Annette Benning is perfect (and I would give anything to look as beautiful as she does in that blue dress at the State Dinner). Michael J. Fox, Martin Sheen, Anna Devoure Smith. People being passionate about each other and about important issues and about doing the right thing. Everything about this movie lifts me up when I'm feeling down. I'm not a liberal, and I'm not a conservative - I fall somewhere in the middle. My beliefs in gun control to not include \"(getting) the guns\". But this movie is so good - that I can look past the occasional differences in political views. Those views are presented in a smart, thoughtful and constructive manner - and I appreciate them even though they are not my own. I enjoy this movie for what it is - a sweet, smart, funny movie set in one of the most \"romantic\" settings in the world - The White House.",
         "This film worked for the same reason the West Wing works... it humanizes the President. Yes, the most powerful man in the world has feelings and falls in love. I liked one reviewer's comment saying that this film is Capra-esque. It certainly is because of its overall feel-good aspect and optimism. I enjoyed this film, and Michael Douglas seldom disappoints me. 8/10.",
         "Okay, without a doubt this is one of my favorite romantic comedies. Michael Douglas comes off as Presidential, Annette Benning is spectacular, Martin Sheen is exceptional, and the supporting cast is marvelous. And this is all directed by Rob Reiner, the 2nd generation actor writer director who understands every aspect of film making and is not afraid to let loose with all the knowledge, power and presence required to make a first class film. Of particular note are David Paymer, Michael J. Fox, and Anna Deavere Smith, all three exceptional character actors whose contributions add so much to the texture and tone of the film. Paymer is the perfect foil to Fox, and Anna balances them perfectly, giving a unity to the staff presence in the film. Perhaps the most intriguing part of the film is the incorporation of 'normal' events in the White House during the romance. We are not excluded or merely \"clued in\", but we participate in all the activities of the President, which makes the film more realistic and visceral. The flow of the film is exceptional, since there are no explosions or other violence to distract us, and the cinematography is amazing. The sets are perfect. Rated PG-13 for a scene of sexual innuendo and a few uses of profanity, this film is far from offensive in its delivery, its demeanor, or its presentation. A classic which will enhance any collection.",
         "No offence to Michael Douglas but I'm not a fan of his movies but in The American President I thought he was brilliant and enjoyed watching him in the movie. He makes the character very charming, warm and compassionate. This film was really the first to show the audience an insight into The White House and what it is like for the President, all the problems and dilemmas he has to go through and the expectations ordinary people have for their elected officials. In this film, Michael Douglas plays the President who has a daughter and has had to juggle his job with raising his daughter after his wife died and the public have been sympathetic to him but a threat comes along in the guise of Sydney Ellen Wade played by Annette Bening who Andrew Shepherd takes an interest in and wants to have a relationship with but soon the relationship is under scrutiny and everything from his and her pasts are used to undermine them. What I find interesting about the film is that American schools teach their students about their government. I think the UK is lacking in this as there is no effort to teach kids about their government and as a result they don't care about politics and that is a shame. The film is intelligent and yet Rob Reiner does it in such a way that anyone can understand what is being said and you don't need to have an degree to gasp what lies beneath the words. Richard Dreyfuss plays a right pantomime villain in this, I found myself hissing at him every time he came on the screen and he really played him well as this smug, unscrupulous person who uses muck to discredit Shepherd's character but can't discredit the president's policies. Annette Bening is just great in this. She is funny and beautiful and has some of the most amusing scenes. Scenes such as her trying to walk out the wrong door in the oval office and not knowing the President was on the phone and her thinking it was a prank. I have to say I love Michael J. Fox in this, Personally, I think he had some of the best lines in the film. His character looks up to the President and you see him wanting his idol to speak up and tell the American people the way it is and not the way Rumson is telling it. Martin Sheen is the President's adviser in this and then went on to become the President in The West Wing. A fine cast, inspiring writing especially at the end and a talented director made this film so popular with the audience.",
         "\"The American President\" was the source of the later dramatic television series success \"The West Wing\". Apparently, statist influencers in the U.S. have become so successful at warping the real by \"spin\" that many people could not understand this seminal film, especially those incompetent reviewers who masquerade as professional critics. It is by any standard of reason I suggest 1. authentic in its meticulously presented milieu, characters and dialogue, 2. an appealing classically romantic comedy and 3. a wonderfully satiric juxtaposition between the American--the self-responsible--qualities of even a president and his vulnerability to pseudo-religious moralizing attacks as he tries to access his individual rights in a nation gone constitutionally insane under the urging of Postmodernists. All this widower president wants at the beginning is a date with a feisty environmental lobbyist; later he wants her as a girl friend, and vice versa, with a a chance to explore their growing relationship. This simple human dignity is compromised as a right by the opposition party's leading candidate, who uses innuendo and false headlining to undermine the man's public popularity and threaten two vital bills both the president and the lobbyist are trying to get through a stone-walling Congress. Rob Reiner directs in a serious and lyrical way dialogue and character revelations that in lesser hands might have been slow or worse; in my judgment the pace never falters for an instant. Aaron Sorkin 's memorable script takes in issues, personalities, levels of relationship and supervision that I believe were both difficult and rewarding with uncommon precision and skill. As the \"American\"--individual, realist, pro- rights--president, Michael Douglas achieves award level simplicity and command at the same time, something which he had been growing toward for two decades. Only players with shorter roles--John Mahoney, and White House staffers--are really exactly right in their roles; but the clarity of the characters presented in the film's script is so strong, owing the the power of the central character and his categorical value of individualism, that sincere performances become exceptional. Annette Benning is attractive and passable as the lobbyist--first girl friend; Martin Sheen is acceptable as Douglas's aide; but no one is outstandingly good I claim nor unacceptable; their believability I suggest is produced by the ideas and values they are representing. Michael J. Fox's speech level is inadequate as the committed, immature aide; Samantha Mathis and Shawna Waldron and Leon Kodak, Anna Deavere Smith, Richard Dreyfuss, Gail Strickland, and many others get small telling moments; the film centers so well I claim on the president and his lady that all else become background, mosaic pieces in a larger picture, observing, relating to, or commenting on the main thrust of action--a president doing his job and asking his rights. This centrality leading to unforgettable scenes is a quality only the best films possess--\"The Guns of Navarone\", \"The Fountainhead\", \"Gone With the Wind\" and \"Bend of the River\", for instance. In a comedy, this is a rare achievement therefore. Marc Shaiman's music is unobtrusive and occasionally moving; Gloria Gresham's costumes and the production design by Lilly Kilvert aid the film's hard-won credibility. Cinematography by John Seale and Art Direction by John Warnke are outstandingly believable. I suggest the producers Charles Newirth, Rob Reiner, Barbara Maltby and Jeffrey Stott have achieved something as rare here as was achieved in \"An Affait to Remember\", \"The Bridal Path\", \"You Came Along\" and \"Operation Petticoat\" and other service-based idea-level satires--something lasting, emotionally satisfying and unusually profound for any genre."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Castle Rock Entertainment",
         "Wildwood Enterprises"
      ],
      "summaries": [
         "Andrew Shepherd is approaching the end of his first term as President of the United States. He's a widower with a young daughter and has proved to be popular with the public. His election seems assured. That is until he meets Sydney Ellen Wade, a paid political activist working for an environmental lobby group. He's immediately smitten with her and after several amusing attempts, they finally manage to go on a date (which happens to be a State dinner for the visiting President of France). His relationship with Wade opens the door for his prime political opponent, Senator Bob Rumson, to launch an attack on the President's character, something he could not do in the previous election as Shepherd's wife had only recently died.",
         "As President, Andrew Shepherd is immensely popular (he has a 63% approval rating). As a man, he's a lonely father struggling to raise a daughter. His struggles multiply when his romance with lobbyist Sydney Ellen Wade becomes fodder for both the press and a rival Senator -- precipitating a rapid drop in the polls.",
         "Comedy-drama about a widowed U.S. president and a lobbyist who fall in love. It's all above-board, but \"politics is perception\" and sparks fly anyway."
      ],
      "budget": 62000000
   },
   "movielensId": 11,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-17",
      "dvdReleaseDate": "1999-08-31",
      "directors": ["Rob Reiner"],
      "runtime": 106,
      "movieId": 11,
      "title": "The American President",
      "mpaa": "PG-13",
      "actors": [
         "Michael Douglas",
         "Annette Bening",
         "Michael J. Fox",
         "Martin Sheen",
         "Anna Deavere Smith",
         "Shawna Waldron",
         "Samantha Mathis",
         "David Paymer",
         "Richard Dreyfuss",
         "Nina Siemaszko",
         "Wendie Malick",
         "Beau Billingslea",
         "Gail Strickland",
         "Joshua Malina",
         "Clement von Franckenstein",
         "John Mahoney",
         "John Mahon",
         "Gabriel Jarret"
      ],
      "imdbMovieId": "0112346",
      "originalTitle": "The American President",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["UrC75wUKoFM"],
      "plotSummary": "Widowed U.S. president Andrew Shepherd, one of the world's most powerful men, can have anything he wants -- and what he covets most is Sydney Ellen Wade, a Washington lobbyist. But Shepherd's attempts at courting her spark wild rumors and decimate his approval ratings.",
      "tmdbMovieId": 9087,
      "avgRating": 3.66105,
      "releaseYear": "1995",
      "numRatings": 19587,
      "posterPath": "/lymPNGLZgPHuqM29rKMGV46ANij.jpg"
   }
}