{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "salesman",
            "id": 10332
         },
         {
            "name": "desert",
            "id": 18034
         }
      ],
      "imdb_id": "tt0115531",
      "video": false,
      "title": "American Strays",
      "recommendations": [],
      "backdrop_path": "/5FTlsw9jYR6TMTyHgNFYkLGgILn.jpg",
      "revenue": 1910,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Johnny",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5cf3",
               "name": "Luke Perry",
               "profile_path": "/78TAr0wLoRHyubnYxjyHNCt70V2.jpg",
               "id": 8395,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5d03",
               "name": "Eric Roberts",
               "profile_path": "/45i6fsxBwH1UyA74tWQ6am0DntC.jpg",
               "id": 21315,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Patty Mae",
               "gender": 1,
               "credit_id": "52fe4c14c3a368484e1a5d17",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Helen",
               "gender": 1,
               "credit_id": "5565c757925141353d001813",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "Sonny",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5cdb",
               "name": "Scott Plank",
               "profile_path": "/ugUUGtma9TYBI8fT6dTiiQiJkyY.jpg",
               "id": 117474,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Cindy",
               "gender": 1,
               "credit_id": "52fe4c14c3a368484e1a5cdf",
               "name": "Melora Walters",
               "profile_path": "/jOK1KzMo93l1qpHHdgYrj81Elco.jpg",
               "id": 4766,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Dwayne",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5ce3",
               "name": "John Savage",
               "profile_path": "/4cNKdr2E2gAvAjjydcwJGscoBsD.jpg",
               "id": 47879,
               "order": 6
            },
            {
               "cast_id": 4,
               "character": "Oris",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5ce7",
               "name": "Brion James",
               "profile_path": "/4Vm3Zq6arXq3jyFfq3yJgH9Jj2l.jpg",
               "id": 591,
               "order": 7
            },
            {
               "cast_id": 5,
               "character": "Gene",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5ceb",
               "name": "Joe Viterelli",
               "profile_path": "/3HhSpMcoWk4fucH6DSTU66x2D0g.jpg",
               "id": 60023,
               "order": 8
            },
            {
               "cast_id": 6,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5cef",
               "name": "James Russo",
               "profile_path": "/tV4X0uEuqu6XYml3yEs9rsG9EzW.jpg",
               "id": 785,
               "order": 9
            },
            {
               "cast_id": 8,
               "character": "Jordan",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5cf7",
               "name": "Will Rothhaar",
               "profile_path": "/xWcCuxFOrFNhrWM2eUqGjI8kL13.jpg",
               "id": 149484,
               "order": 10
            },
            {
               "cast_id": 9,
               "character": "Daphne",
               "gender": 0,
               "credit_id": "52fe4c14c3a368484e1a5cfb",
               "name": "Jessica Perelman",
               "profile_path": null,
               "id": 1105470,
               "order": 11
            },
            {
               "cast_id": 10,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe4c14c3a368484e1a5cff",
               "name": "Toni Kalem",
               "profile_path": null,
               "id": 3006,
               "order": 12
            },
            {
               "cast_id": 12,
               "character": "Mondo",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5d07",
               "name": "Vonte Sweet",
               "profile_path": null,
               "id": 95797,
               "order": 13
            },
            {
               "cast_id": 13,
               "character": "Omar",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5d0b",
               "name": "Anthony Lee",
               "profile_path": null,
               "id": 156975,
               "order": 14
            },
            {
               "cast_id": 14,
               "character": "Johnny's Girlfriend",
               "gender": 0,
               "credit_id": "52fe4c14c3a368484e1a5d0f",
               "name": "Stephanie Cushna",
               "profile_path": null,
               "id": 1059089,
               "order": 15
            },
            {
               "cast_id": 15,
               "character": "Exterminator",
               "gender": 2,
               "credit_id": "52fe4c14c3a368484e1a5d13",
               "name": "Sam Jones",
               "profile_path": "/w0C7aONaeB6a5DqdzTa23TzcvPm.jpg",
               "id": 33321,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "58d437cdc3a368124f018dc7",
               "name": "Michael Covert",
               "profile_path": null,
               "id": 144130,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58d437d3c3a368124f018dca",
               "name": "Michael Covert",
               "profile_path": null,
               "id": 144130,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58d437eec3a368127c0189da",
               "name": "Seo Mutarevic",
               "profile_path": null,
               "id": 1016856,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58d437f9c3a368125f018c07",
               "name": "John R. Graham",
               "profile_path": null,
               "id": 1003243,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "58d4380bc3a368126f017d53",
               "name": "Sheila Jaffe",
               "profile_path": null,
               "id": 7494,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "58d438109251411fc501997e",
               "name": "Georgianne Walken",
               "profile_path": null,
               "id": 7495,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "58d4381c9251411fc501998b",
               "name": "Rod Dean",
               "profile_path": null,
               "id": 55954,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.01854,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 136311,
      "vote_count": 5,
      "budget": 0,
      "overview": "The desert can be a lonely place for the people who live there or for those who are traveling through. It is also the teller of different stories including the story of a traveling salesman whose only commodity is death and the story of a young man who finds that the death that he wishes for is difficult to find. Others are just traveling through, on their way to another place when they stop to eat at Red's Desert Oasis. The food may not be great, and the waitress may be surly, but those who stopped at Red's will find that they are involved in the showdown of their life.",
      "similar": [
         9355,
         839,
         409,
         345009,
         205584,
         1927,
         9543,
         559,
         564,
         1701,
         336843,
         294254,
         10243,
         26388,
         12162,
         567,
         262543,
         1402,
         947,
         310307
      ],
      "original_title": "American Strays",
      "runtime": 97,
      "poster_path": "/iJTCKWGPaNyRTu2GFFDeoCQxUYe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Harmony Gold",
            "id": 7901,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canned Pictures Inc",
            "id": 54301,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-12",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Love 'em or Kill 'em.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Covert"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Michael Covert"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115531/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyODY1OTYxMF5BMl5BanBnXkFtZTcwNTk4ODUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Scott Plank, Melora Walters, John Savage | See full cast and crew »"],
      "reviews": [
         "'American Strays' is part of the quirky road movie sub-genre in the vein of 'Highway 61', 'Motorama' and 'Roadside Prophets', only it isn't anywhere near as good as those overlooked efforts. A self-conscious, contrived gallery of eccentric characters derived from equal parts David Lynch, and the Coen brothers, with some sub-Tarantinoesque dialogue thrown in. This movie tries much too hard in some ways and not hard enough in others, making it way too uneven and self-indulgent to satisfy either a mainstream or cult audience. When it does have a decent idea (e.g. Luke Perry's failed suicidal slacker hiring 'The Exterminator' to do the job for him) it goes nowhere with it, and every potentially interesting bit is sabotaged by lame and silly schtick like Jon Savage's serial killer vacuum cleaner salesman. Just about the only reason to watch this is for one of the oddest and most eclectic casts assembled in recent years. They range from cult heroes like Luana Anders ('Dementia 13'), Sam Jones ('Flash Gordon) and the late Brion James ('Blade Runner'), dependable character actors like Joe Viterelli ('Heaven's Prisoners'), Jennifer Tilly ('Bound'), and James Russo ('Donnie Brasco'), coulda been contenders turned b-grade slummers Eric Roberts ('Runaway Train') and Jon Savage ('The Deer Hunter'), and left field picks like Luke Perry ('90210'), Melora Walters ('Magnolia') and Patrick Warburton ('Seinfeld's Puddy). Apart from the spot-the-actor aspect, there's not a whole lot to recommend this movie.",
         "One of the characters in the movie points out the violence present in the Star Spangled Banner, claiming that it has fostered Americans to a life of violence. He says that it would have been much better if America the Beautiful would have been the US anthem. Indeed, the lyrics of the song are filled of war rhetoric. Actually, the French equivalent, La Marseillaise, is just as brutal - at least. I guess that it goes for a number of anthems, since they often emerged from a nationalist crescendo, which is usually related to a war of some sort. All in all, nations as such have a history of war, closely linked to their formation. Hey, that's pretty true about civilization. It's a mystery how this species has survived. Anyway, in American Strays, we follow a few fragments of human lives, and how they connect, purely by chance, leading to a grand finale in the spirit of said anthems. It's a sinister perspective on Americans, but also partly a beautiful one. Yes, there is beauty in the midst of gun smoke and brutality - fragile beauty, but isn't that the very nature of beauty? When strong, it loses its shine. The film is refined in how it follows some human fates, at the point of their catharsis, and does so without judging, without staying at stereotypes. It is satire, certainly, but done with a heart and with intelligence - and curiosity, too. The characters have several dimensions, far from being simple caricatures, and what happens to them is foreseeable, but still not the most obvious way out. Yes, I'm impressed by this little study of human nature. Although the persons depicted are odd creatures, in rare circumstances, something general is being stated about man, about society, about the very torment for each of us in trying to find fulfillment. And that's the same, whatever the nation or its anthem.",
         "This movie is basically a satire of the American west and the crazy people who live there - here in my case. Contrary to some other reviewers - the script of this movie is a work of art - the acting nothing short of total excellence. It's the kind of movie that deserves an academy award - much like Mullholland Drive did - but the academy seldom gives awards too truly brilliant movies. I'm not writing this review to explain the plot - but just too put some words down on paper stating how really good this movie is. Perhaps if anything the movie - the script - the acting - is all too beautiful - too intelligent and too brilliant - because apparently some people - some reviewers - lack a soul or have an empty one and simply can not see outwardly what does not exist within. The mesmerizing acting of Jennifer Tilly is worth the price of admission in itself - but all the acting in this movie goes beyond just good.",
         "Finally got down to \"American Strays\" in the to-be-watched stack. And I feel as though it should have occupied more space in the stack, because it strikes me as actually being 3 films rather than one. Before proceeding, I will say that I was impressed by the cinematography/lighting throughout the work. Occasionally self-conscious, but overall creative and effective. The director has a good feel for the relation of camera to subject. I can also see how the director was able to draw together such a diverse and impressive cast. Each role held some attraction for actors who care more about acting than about money. Eric Roberts is especially noteworthy playing against type. However, the production itself is schizophrenic, with the ultimate result of distracting one from the finely done details. ***SPOILERS AHEAD*** \"American Strays\" is 3 perfectly decent short films forced together to make a feature-length film. The only relational concept is the theme of guns empowering violence (and feelings of empowerment). Film 1 involves the travelling vacuum cleaner salesman, Film 2 is the suicidal youth who hires someone to help kill him, and Film 3 is the many-threads-converging-to-a-finale. Films 1 and 2 share only the desert setting with Film 3; neither is otherwise related to the other two. If Film 1 were filtered out of the rest it would make a charming little oddball 20-30 min. film. (I would encourage the shorter length -- some of the scenes felt stretched and some trimming would add punch.) Film 2 I personally found meaningless/pointless. But it would have much cleaner effect if it stood alone. And Film 3 -- if Film 3 were trimmed a bit and played a bit broader, it would be a brilliant memorable satire which answers the question: \"What would happen if you brought the genres of Pulp Fiction, gangstas, Natural Born Killers, Reservoir Dogs and average-man-pushed-too-far together?\" The sort of film you share with your film-loving friends, so you can congratulate yourselves and each other for recognizing all the references. As fond as I am of Frankenstein, I still cannot wholeheartedly recommend this assemblage of parts. The sutures show too strongly. The director is obviously thoughtful and talented; the cinematography/lighting, set dressing, and characterizations are all quite effective. But I feel each of these films deserved to be seen separately and judged upon their own merits, rather than being forced to share the screen.",
         "Intensely bizarre. Bizarrely intense. This movie is very likable. I, personally, enjoy movies with this type of surrealistic plot that makes more sense emotionally than logically, such as The Lost Highway and The Doom Generation. There are a lot of gaps that are not explained and leave a mystery for the viewer to imagine what is really going on beneath the surface. Even though I am very critical of movie violence, there are many characters who are developed and then killed and I found myself involuntarily laughing at their death scenes. This type of illogic is precisely what makes this movie so compelling.",
         "Quentin Tarantino gets under my skin, where Richard Rodriguez does not. Its a corner of myself I do not quite understand. If you have QT wonder, this could help. Tarantino places the viewer as a sort of museum visitor. He has this virtual video store of references, sometimes well arranged. You are not supposed to actually experience anything; you are supposed to slowly walk by while they blast something out, coming to meet you. Its cinema by advertising, experience by push. I like it better when a filmmaker builds something I can enter; it doesn't matter whether it is an escape or not. If he builds niches for me to enter and explore, if he invites or teases me in, then I commit, I invest, I experience and am changed somehow. This apparently trivial movie does that. Its just as brutally comic as the QT school, with its faux quaintness and engineered humor. It also avoids the challenge of long form film-making by assembling numerous small stories. It similarly is a pastiche of references from other, real films, films with actual identity. But it works. Three real stories here, all love stories. The suicidal loser who gets the sexy traveler; the outresourced husband who \"finds\" his wife and place again; and the two serial killers who find each other and ride off together. They are stitched by common local, similar upholstery and a temporally but not spatially shared climax. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "If you're a fan of twisted plots, crazy characters, and movies that may not exactly make sense, you need to see this film. If you enjoyed Guy Richie's films (Lock, Stock and two smoking barrels; Snatch) with multiple plots running together, seemingly unrelated till the very end, you will probably also enjoy this movie. Perhaps my favorite thing about American Strays are the Strays themselves - a cast of some of the most bizarre characters ever seen in cinema assembled in a way that just barely makes sense. I find myself really rooting for some characters and wishing death on others. There is some bad acting in this film, and some choppy dialogue, and some pretty unbelievable plots, but that's part of this movie's charm. It's almost a terrible movie, I always think, \"i can't believe i'm watching this (again!),\" but when it's over, I am so glad I watched it. This movie is a secret treasure. I don't know anyone who's seen it, other than people I make watch it. It's hard to find, most video rental places don't carry it, so you'll just have to buy it.",
         "Totally original ideas abound in \"American Strays\". This stylish black comedy where nothing is explained, has converging story lines. Among the bizarre desert travelers are a dysfunctional family, bickering mob figures, a vacuum salesman serial killer, and other quirky characters. The liberal quantities of violence are tempered by a fresh and unpredictable script. Incredible cast, incredible dialog, with above average character development. The beautiful desert locale photography adds immensely, and the soundtrack is memorable. I recommend going into this movie without reading any plot summaries, and simply coming along for the ride with these unforgettable characters. - MERK",
         "Strayed persons in a strayed movie. Six or seven scripts, each ten minutes long, rolled into one pointless movie with no direction or redeeming value whatsoever. Well, maybe a few laughs here and there. But this has been done better, American Perfekt for example. The title says enough, I guess...",
         "Using elements from several other more popular films, American Strays brings together six different stories with the meeting room being a cafe in the desert. In one story we have Luke Perry as a man who cannot cope with his life and hires an 'Exterminator' to help him end his existence. The second story is about two hit men who are driving through the desert. One is cut up really bad and is wearing band-aids, the other is an overweight gentlemen with stomach problems. They really don't have much plot other than they provide the ending with some more bodies. The third story is about two people who are driving through the desert. They have a moment in their car where you question their friendship. Nothing becomes of this moment, and eventually they make it to the cafe. The fourth story is about a vacuum salesman. For more than half the film, we follow the path of Dwayne, a salesman who is willing to try any pitch to try to get his vacuum sold. Interestingly played by John Savage, this is the best story of the film. He travels from door to door in the desert demonstrating to potential buyers the effectiveness of his vacuum at a 'killer' price. The fifth story is about two lovers on the run from the law. Constantly in some sort of sexual embrace, these two have just robbed something, and are driving around and having sex whenever they want. The sixth and final story has to do with just a random family. Eric Roberts plays a man who is lost in the desert with his family in a minivan. All of these stories interweave together when they should all be going in separate directions. What happened in 1996? This film made no sense at all. I felt like I began the film in the middle of the actual movie. There is no discussion at all, there is not even a hint, as to how all these characters happened to be in the same desert. All this film is meant to show is violence can happen to anybody. While other are happy with comedic lines, I actually needed some pre-story to bring this film together. Literally, we jump right into the middle of the robber's story. We have no clue how he got the cash, or how long him and his lady friend have been together. We have no history of Roberts family. No clue what happened to him prior to entering the desert, or where they are headed to. All that we know is that they are as lost as I was in this film. What was the point of the train that Luke Perry kept seeing? Was it to symbolize that his life was about ready to arrive? How did the hit men get the cop in the back of their car, and why were they still carrying it? Who were the gangsta's and what was their part in this film? QUESTIONS, QUESTIONS, QUESTIONS......I NEED ANSWERS ANSWERS ANSWERS!!! There were some decent ideas in this film, but without building a story it is hard to develop these ideas. My feeling is that perhaps the director made this film, and found that he only had the budget to release the second half. If that was the case, here is my advise to the director...scrap the project...there is no reason to beat a dead horse. A self-conscious, contrived gallery of oddball characters are simply derived from parts of David Lynch, and the Coen brothers, with some sub-Tarantinoesque dialogue thrown in. Unless you, as a viewer, enjoy picking out odd character actors, then I suggest slowly backing away from this film because 'there is nothing to see here folks.\u0085' Grade: * out of *****"
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": [
         "Canned Pictures Inc.",
         "Harmony Gold"
      ],
      "summaries": ["The desert can be a lonely place for the people who live there or for those who are traveling through. It is also the teller of different stories including the story of a traveling salesman whose only commodity is death and the story of a young man who finds that the death that he wishes for is difficult to find. Others are just traveling through, on their way to another place when they stop to eat at Red's Desert Oasis. The food may not be great, and the waitress may be surly, but those who stopped at Red's will find that they are involved in the showdown of their life."],
      "budget": 0
   },
   "movielensId": 1102,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-12",
      "dvdReleaseDate": "2004-10-19",
      "directors": ["Michael Covert"],
      "runtime": 97,
      "movieId": 1102,
      "title": "American Strays",
      "mpaa": "",
      "actors": [
         "Luke Perry",
         "Eric Roberts",
         "Jennifer Tilly",
         "Carol Kane",
         "Scott Plank",
         "Melora Walters",
         "John Savage",
         "Brion James",
         "Joe Viterelli",
         "James Russo",
         "Will Rothhaar",
         "Jessica Perelman",
         "Toni Kalem",
         "Vonte Sweet",
         "Anthony Lee",
         "Stephanie Cushna",
         "Sam Jones"
      ],
      "imdbMovieId": "0115531",
      "originalTitle": "American Strays",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["8TKRgXHmcCo"],
      "plotSummary": "The desert can be a lonely place for the people who live there or for those who are traveling through. It is also the teller of different stories including the story of a traveling salesman whose only commodity is death and the story of a young man who finds that the death that he wishes for is difficult to find. Others are just traveling through, on their way to another place when they stop to eat at Red's Desert Oasis. The food may not be great, and the waitress may be surly, but those who stopped at Red's will find that they are involved in the showdown of their life.",
      "tmdbMovieId": 136311,
      "avgRating": 2.61047,
      "releaseYear": "1996",
      "numRatings": 86,
      "posterPath": "/iJTCKWGPaNyRTu2GFFDeoCQxUYe.jpg"
   }
}