{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sheriff",
            "id": 798
         },
         {
            "name": "night",
            "id": 3752
         },
         {
            "name": "barn",
            "id": 3875
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "children",
            "id": 10103
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "preacher",
            "id": 18072
         },
         {
            "name": "corn",
            "id": 41002
         }
      ],
      "imdb_id": "tt0115885",
      "video": false,
      "title": "Children of the Corn IV: The Gathering",
      "recommendations": [
         25751,
         25752,
         25753,
         25749,
         25748,
         70575,
         18009,
         38499,
         32595,
         38500,
         36421,
         25754,
         28859,
         76171,
         35945,
         19286,
         27770,
         12525,
         19287,
         33519
      ],
      "backdrop_path": "/nDlE10yY2kXla8SBtLvqz32LhTO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Grace Rhodes",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03ad0f",
               "name": "Naomi Watts",
               "profile_path": "/8W02WOJI1pEGh2iqQsgITR5tV0P.jpg",
               "id": 3489,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Margaret Rhodes",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03ad13",
               "name": "Jamie Renée Smith",
               "profile_path": "/2m1ddsKk0gbmcsocLS8D9wRODIm.jpg",
               "id": 58727,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "June Rhodes",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03ad17",
               "name": "Karen Black",
               "profile_path": "/xKtsATh6T64NJfE1io1AnofnFRi.jpg",
               "id": 8963,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "James Rhodes",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad1b",
               "name": "Mark Salling",
               "profile_path": "/zVB5EAQaotoxu5qEqp9rlr9OILX.jpg",
               "id": 102723,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Donald Atkins",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad1f",
               "name": "Brent Jennings",
               "profile_path": "/wkKnquYyWGT5ciIfgJAdy7tAxXX.jpg",
               "id": 84685,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Sandra Atkins",
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03ad23",
               "name": "Toni Marsh",
               "profile_path": null,
               "id": 102724,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Marcus Atkins",
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03ad27",
               "name": "Lewis Flanagan III",
               "profile_path": null,
               "id": 102725,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Josiah",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad4f",
               "name": "Brandon Kleyla",
               "profile_path": null,
               "id": 941626,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Doc Larson",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad53",
               "name": "William Windom",
               "profile_path": "/nTqbMx3o9rk6Q5PfS3fwh5LEbGw.jpg",
               "id": 8499,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Jane Nock",
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03ad57",
               "name": "Salle Ellis",
               "profile_path": null,
               "id": 1099709,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Rosa Nock",
               "gender": 1,
               "credit_id": "58f02a2ec3a3686b4d006892",
               "name": "Marietta Marich",
               "profile_path": "/qov07poVxBvkMYgYlPQF0RliWJn.jpg",
               "id": 985344,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Mary Anne",
               "gender": 0,
               "credit_id": "597eaafdc3a3685397028790",
               "name": "Samaria Graham",
               "profile_path": null,
               "id": 1188222,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03acf9",
               "name": "Greg Spence",
               "profile_path": null,
               "id": 56746,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03acff",
               "name": "Stephen King",
               "profile_path": "/z8cHPoqTslxRR7oWQ5wsh0fNLt2.jpg",
               "id": 3027,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad05",
               "name": "Stephen Berger",
               "profile_path": "/uXtsIr73KxMfXFUenfDHbbdtXQ8.jpg",
               "id": 102720,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad0b",
               "name": "Greg Spence",
               "profile_path": null,
               "id": 56746,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad2d",
               "name": "Jake Eberle",
               "profile_path": null,
               "id": 943901,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad33",
               "name": "Gary DePew",
               "profile_path": null,
               "id": 949611,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad39",
               "name": "David C. Williams",
               "profile_path": null,
               "id": 56748,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad3f",
               "name": "Richard Clabaugh",
               "profile_path": null,
               "id": 71150,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03ad45",
               "name": "Charles Hatcher",
               "profile_path": null,
               "id": 1099708,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad4b",
               "name": "Dean Lent",
               "profile_path": null,
               "id": 46354,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 5.139265,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25750,
      "vote_count": 49,
      "budget": 0,
      "overview": "Grace Rhodes, who is studying to be a doctor, returns to her hometown as a strange illness is afflicting the local children. The symptoms include a high fever and spasms, but even weirder is what happens the next day: All those with the illness claim they are somebody else -- then they begin murdering the grown-ups. After her sister undergoes the same sinister metamorphosis, Grace comes to believe there is some connection to an evil cult figure who may be returning from the grave.",
      "similar": [
         10781,
         341006,
         12662,
         9373,
         16764,
         397514,
         588,
         948,
         298312,
         381288,
         10585,
         3600,
         9538,
         301846,
         12521,
         74997,
         13567,
         300665,
         434873,
         10185
      ],
      "original_title": "Children of the Corn IV: The Gathering",
      "runtime": 85,
      "poster_path": "/tRjeV9AZgCXGTqyvlp7Ui55Yb3l.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
         "name": "Dimension Films",
         "id": 7405,
         "origin_country": "US"
      }],
      "release_date": "1996-10-08",
      "vote_average": 4.6,
      "belongs_to_collection": {
         "backdrop_path": "/g4aK8Up5zSegesJdMYbxDcndn20.jpg",
         "name": "Children of the Corn Collection",
         "id": 115225,
         "poster_path": "/v6auJblMcNxUmZx23mQXMHmzyY3.jpg"
      },
      "tagline": "In a sleepy midwestern town... A horrifying evil is about to rise again!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Greg Spence"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Stephen King",
         "Stephen Berger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115885/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxOTY3NTEzMV5BMl5BanBnXkFtZTcwMjA2MDAyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Naomi Watts, Jamie Renée Smith, Karen Black | See full cast and crew »"],
      "reviews": [
         "Deciding that there should be a comment here that explains slightly more if a movie \"sucks\" or not, which is not much of an opinion. While none of these films with the exception of the first film are masterful, this is the best of the sequels. It has more of a supernatural element than some of the others but still manages to keep things moving and even a little suspenseful. This fourth installment also has a very high rating on the gore scale as well with some rather gruesome killings. If you have not yet seen this one but have others in the series it is worth the time. However, all said, it is for hard core genre fans only.",
         "I find this to be the second best of the series(my fave is part 5), this one has suspense, gory deaths, is well acted, and it has Karen Black, one of my fave actresses of all time. It also has a large body count and enough graphic violence to satisfy gore hounds.",
         "After the disappointment of III, I wasn't too thrilled by the fact that a fourth installment was on the way. I was delighted to find out that not only is this film better than the previous sequel, but it's the best in a so-so series. How did they manage that? Pros: Strong direction by Greg Spence, who made his debut with this film. Excellent performances. Some chills. Inventive death sequences. A feeling of dread hangs over the film. An attempt to start a new storyline, and a good one at that. Plenty of blood and gore. Some effective dream sequences. Cons: Relies a bit too much on dream sequences for it's scares. Some may be disappointed that this has little to do with the rest of the series. The short running time makes it hard for some things to develop. Since this film has so little to do with the other films in the series, it may have been better had they called it something else. Final thoughts: While the first two are OK, and III is unmemorable, this sequel is a vast improvement over all of them and even the ones that followed. Fans of the first three should watch this one with caution though because aside from the title, the fact that it's set in Nebraska, and that it has to do with evil kids controlled by a demon, it has nothing to do with the other films in the series. A sleeper! My rating: 3.5/5",
         "This is pretty different from the first two(and possibly the third, haven't seen that yet), but that's not necessarily a bad thing. I liked the fact that there was no mention whatsoever of \"He who walks behind the rows\". That was the most annoying thing in the first two movies for me, especially when it turns out it is in fact a god of the corn... that's just too far out. Instead, we here have a preacher child, who controls the children. I think that's a very good twist, since now the enemy is personified. No black clouds, no lightning and no moving corn. Much better. It does still have some of the corny(no pun intended) stuff, especially in some of the death scenes. It does have a better plot than both the first movies in my opinion, but it's somewhat ruined by a few things; bad acting by some of the actors, a few ridiculous death scenes, and at some points it is slow. I personally think the whole influenza thing was better than the lightning from the first two movies, but some fans of the original might hate it. 7/10",
         "\"Children of the Corn IV: The Gathering\" is a semi-decent entry in the series. **SPOILERS** Tired of being troubled with strange dreams, June Rhodes, (Karen Black) asks her daughter Grace Rhodes, (Naomi Watts) to come back to her small Nebraska town. As Margaret Rhodes, (Jaime Renee Smith) and James Rhodes, (Mark Salling) both start to come down with the flu, the children of the entire town come down with it as well. While trying to treat the cases with Doc Larson, (William Windom) it disappears but the children start to act mysteriously. When a series of murders engulfs the town, Grace and Donald Atkins, (Brent Jennings) the father of one of the children, track down the culprit, a young teen Josiah, (Brandon Klevla) who corrupts the children to eliminate the adults. The Good News: This one surprised me, and was far better than it should've been. The best aspect about this film was it's very high gore quotient. There isn't all that huge of a body count, but what's there is some of the more imaginative kills in the genre. One is nailed to a door with needles with a scythe thrown from behind them breaks through the door and impales them in the head, having a scythe rammed through the back and come out through the chest, having their fingers lopped off, dragged by barbed wire face-first into an uprooted pitchfork and many more gruesome moments. With many non-gore kills and with some hallucinations thrown in, it's quite a surprisingly gory flick. Even more impressive is that they are all involved in some big action scenes. It's nearly impossible to describe them without giving the film away, but all those scenes are great. There's even some suspense granted, with an eerie chase through a dimly-lit cornfield. With the preceding circumstances around it, it becomes all the creepier. The opening half's dealing with the strange virus and the mystery is pretty well-handled, giving a glimpse of what's to come while even throwing a surprise into it as well. The ending confrontation is full of action and suspense as well, which sends it out on a perfectly appropriate spectacle ending. This is a pretty decent edition to the series. The Bad News: There really isn't a whole lot that really didn't work in this one, and it's got to deal with the fact that it rarely has anything to do with the other films. It discards the cornfields and the psycho-babble that the others dealt with and instead concentrates on a mysterious disease and the race to discover what it is. That is a wrong move for two reasons. It's already quite clear very early on what's going on, as an early murder and resurrection is dealt with in this manner that goes undiscovered for a long time. By the time it's been discovered, it's been so long coming that it's merely old hat by then. Very rarely is a film that far behind the audience, and this one is. The other major problem is that it never once really put anyone that was supposed to survive in any danger of them possibly not making it. There's always a very easy way out of the suspenseful parts where they're supposed to be tortured, and it's always a shame when it's all over so quickly and easily. Otherwise, these were the two main problems with the film. The Final Verdict: It's decent enough, but it's by no means all that spectacular entry in the series. If it fixed a couple of minor problems and kept a fun atmosphere as it does, then it would probably be a more remembered film, and can really only be recommended to hardcore fans of the series or Naomi Watts fans. Rated R: Graphic Violence, Graphic Language and several scenes of children in danger",
         "This is a very well done film indeed. It is very scary, and the plot is well done. It does differ in some ways from the first three films though. Unlike the first three there is not just one child leading them all. Most people don't realize this but \"He Who Walks Behind The Rows\" is actually one of the main characters in the film. It was revealed by director Greg Spence that a crucial deleted scene features two characters telling Naomi Watts that the children called Jociah by another name: \"He Who Walks Behind The Rows\". Once you realize this the film is more enjoyable to watch if you are a fan of the original Children of the corn movie.",
         "\"Children of the Corn IV: The Gathering\" is the fourth installment in the \"Children of the Corn\" series, and was surprisingly a decent sequel. After the horrible monster effects in Part III's finale (which almost completely ruined the movie for me) I was hoping \"The Gathering\" would head in a new direction, which it did. This sequel concerns a small town in the midwest (Nebraska, I believe). Naomi Watts (The Ring) plays Grace, a mother who works at a medical office in the small town. Her daughter, Margaret begins to display a strange illness that the rest of the town's children are seeming to show also, which includes a burning fever and the children's teeth falling out. The medical office soon becomes full of sick little kids who are contracting the illness. Weird, huh? Turns out that the cult of children are back, trying to recruit more young'ns (after killing their parents) into their organization for \"he who walks behind the rows\". The most memorable thing about the film is Naomi Watts' performance, who even did surprisingly well in her earlier work, I'm sure most people who see this will recognize her from the hit Japanese remake \"The Ring\". The film also features Karen Black of \"Burnt Offerings\", who also did pretty well even though she croaked at the hands of the evil little the children in a creepy sequence halfway through. Some of the murder sequences were far fetched and a little corny (especially Grace's friends' death at the medical office) but it was nothing too major, I was expecting that because of what kind of film it was. Basically, if you're a fan of the series, this is an alright sequel. It is very far from perfect, but it was decent and enjoyable for the most part, and Naomi Watts made it worth it. See it if you want to enjoy an okay horror movie. 6/10.",
         "I dunno why i decided to rent this movie considering how 2 and 3 weren't all that great, but i saw a preivew for it a long time ago and it seemed a little creepy so i figured i'd give it a shot. I was really shocked how good it turned out to be. It didn't really have a thing to do with the other children of the corns other then the fact that the kids were evil. Children of the Corn IV probably could have been its own movie insted of a sequel. Well anyways i really liked it. It had a good story line and was pretty creepy. ****/*****",
         "This is the second best in the series, And I loved seeing Karen Black, I even wanted her to survive, it hurt to see her die. Anyway, I also liked the deja-vu thing they have going on, effects are good, the cast was good, the suspenseful scenes were well staged, everything was good!!!",
         "This film is religated to a special genre, what I like to call STV (an abbreviation of Straight-to-Video release). An attempt at a cheap thrill, these films are usually more laughable than scary. But the Children of the Corn franchise is probably the most interesting of this genre. I remember renting this particular installment of Children of the Corn at the fresh young age of 14 for a slumber party with some friends. We had all seen COTC 1, 2, 3, so what the heck, why not check out 4? There was nothing particularly different about the plot: again, the children of a midwestern town all mysteriously turn evil, killing their parents in interesting, grotesque ways. There were the same laughable moments in which writers contrive clever new ways for a child to kill an adult and the same lame horror film dialogue. It was all the same. Except one thing. The performance of the lead heroine was stunning! Not your typical STV calibar performance, but instead, WOW--complex, understated, and intense, I was very impressed with the no-name lead actress. Fast forward to seven years later, in which I am reading an interview with my favorite new actress, Naomi Watts and she mentions, \"I was in Children of the Corn IV\" and ohmygosh, the planets have aligned, it all makes sense! This stellar actress was giving stellar performances long before she was cast into stellar movies. So the short of it, if you are at all a fan of Naomi Watts, this is not a bad one to get a glimpse of her pre-Mulholland Dr. work. Yeah, it's campy and lame and gratuitously violent, but with Naomi, it's not so bad. Rating: 4 out of 10 (on the whole), Naomi's Performance: 7 out of 10"
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Dimension Films"],
      "summaries": ["All the kids in a town over night become feverish and have convulsions. The next day they start to become evil, change their names for those of kids killed long ago, and then start killing any adult in their path, in vicious and mysterious forms. A young woman who has just returned to town tries to find out what is happening, while trying to protect her transformed young sister. However, the kids are starting to revive their leader..."],
      "budget": 0
   },
   "movielensId": 1105,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-08",
      "dvdReleaseDate": "2001-10-09",
      "directors": ["Greg Spence"],
      "runtime": 85,
      "movieId": 1105,
      "title": "Children of the Corn IV: The Gathering",
      "mpaa": "R",
      "actors": [
         "Naomi Watts",
         "Jamie Renée Smith",
         "Karen Black",
         "Mark Salling",
         "Brent Jennings",
         "Toni Marsh",
         "Lewis Flanagan III",
         "Brandon Kleyla",
         "William Windom",
         "Salle Ellis",
         "Marietta Marich",
         "Samaria Graham"
      ],
      "imdbMovieId": "0115885",
      "originalTitle": "Children of the Corn IV: The Gathering",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["IY2BQ0rZ6_4"],
      "plotSummary": "Grace Rhodes, who is studying to be a doctor, returns to her hometown as a strange illness is afflicting the local children. The symptoms include a high fever and spasms, but even weirder is what happens the next day: All those with the illness claim they are somebody else -- then they begin murdering the grown-ups. After her sister undergoes the same sinister metamorphosis, Grace comes to believe there is some connection to an evil cult figure who may be returning from the grave.",
      "tmdbMovieId": 25750,
      "avgRating": 2.35672,
      "releaseYear": "1996",
      "numRatings": 1012,
      "posterPath": "/tRjeV9AZgCXGTqyvlp7Ui55Yb3l.jpg"
   }
}