{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "leopard",
         "id": 4478
      }],
      "imdb_id": "tt0116859",
      "video": false,
      "title": "The Leopard Son",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Narrator",
            "gender": 2,
            "credit_id": "52fe473b9251416c750921ef",
            "name": "John Gielgud",
            "profile_path": "/jvTSqk7cuOrsdtf037olQ9BKRAe.jpg",
            "id": 11857,
            "order": 0
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe473b9251416c750921f5",
            "name": "Hugo Van Lawick",
            "profile_path": null,
            "id": 928583,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.001177,
      "production_countries": [
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 17642,
      "vote_count": 0,
      "budget": 0,
      "overview": "The true story of the birth, growth and coming of age of a leopard cub in Africa's Serengeti plain. The journey of \"The Leopard Son\" begins at his mother's side where he discovers, through play, essential skills for survival in the wild. As it is with humans, there inevitably comes the day when a child must leave his mother to go out on his own.",
      "similar": [
         113296,
         2989,
         9732,
         10527,
         11430,
         18994,
         9904,
         57586,
         606,
         388259,
         10603,
         1523,
         2454,
         873,
         1966,
         411,
         9273,
         87,
         55787,
         258489
      ],
      "original_title": "The Leopard Son",
      "runtime": 87,
      "poster_path": "/7AWx0SmqvNQ2kAsUPTR2JtVnswz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Discovery Channel Productions",
         "id": 3358,
         "origin_country": ""
      }],
      "release_date": "1996-09-27",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hugo Van Lawick"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Michael Olmert"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0ODUxNTM0NF5BMl5BanBnXkFtZTcwNzk4NjgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Gielgud | See full cast and crew »"],
      "reviews": [
         "I just watched an older VHS recording I had made of this movie when it debuted on The Discovery Channel. This is a marvelous film full of gorgeous, eye-popping cinematography and spot-on camera-work. The previous posts complaining of no music...what the hell were they watching? Stewart Copeland composed a great music score for this film that's over 74 minutes long!! How can you watch this film and not notice the music? I must go out of my way to ask anyone visiting this site to completely ignore the previous 2 posts and go out of your way to seek a copy of this movie and escape into the lush and savage beauty of Ngorongoro. This is easily one of the most masterful nature films ever made and I think it's sad that Discovery Channel didn't do more to promote this film and make it available on DVD--here's hoping for a Blu-Ray version. Hugo--God rest your soul--you are gone but not forgotten and this film is a true gem to remember you for! John Brune Fort Wayne, IN",
         "This film is about Serengeti. And the animals who live there. Especially leopards. And it focuses on... you guessed it! - a leopard! The film is wonderful. I never watched Hugo Van Lawick's other works, but I guess they are just as great as this one. It manages to capture the first year(s) of a leopard son growing up to be an adult. His relationship with his mother is really well caught on camera and very touching. But what sets this film apart from similar ones is the fact that it is about many animals, not just the leopard. Lions, hyenas, cheetahs, baboons, eagles - you name it. Every once and a while the camera shifts to someone else, so it is not a strict animal autobiography. Kind of nice is that the film has a very natural feeling to it compared with other (later) Discovery works. The \"later works\" tended to focus more on dramatic camera angles and tons of special effects *cough* Planet Earth *cough*. This one shows the life of animals from their eye view. And there are some nice close-ups too. Hugo tries to focus on timing rather than on \"dramatic camera angles\". Very nice work! The music is also outstanding. Instead of some generic African or classical music so common in later Discovery's pictures Hugo found the guts to invite Stewart Copeland of The police. Stewart has a very interesting take on rhythm and music. His score sets this movie apart from all the rest. It's a pity this movie wasn't released on DVD yet. I guess Discovery decided to forget about one of the greatest movie it ever released and focus on something less interesting. Like dramatic camera angles, special effects and generic African music.",
         "I was really excited about this \"movie\" at the time it was released in theatres. I thought it was really great. But when it came out a few years later on tv. i found it ordinary. It was like the other documentaries on the Discovery Channel, it was not special. I saw many before. It was boring, it lack music and its not special like it was made to be. But i stiill like it, i love animals, especially big cats. I would get this 6 stars"
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Nature Conservation Films BV"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 1106,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-27",
      "dvdReleaseDate": null,
      "directors": ["Hugo Van Lawick"],
      "runtime": 87,
      "movieId": 1106,
      "title": "The Leopard Son",
      "mpaa": "",
      "actors": ["John Gielgud"],
      "imdbMovieId": "0116859",
      "originalTitle": "The Leopard Son",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["1AfBwPrB4pM"],
      "plotSummary": "The true story of the birth, growth and coming of age of a leopard cub in Africa's Serengeti plain. The journey of \"The Leopard Son\" begins at his mother's side where he discovers, through play, essential skills for survival in the wild. As it is with humans, there inevitably comes the day when a child must leave his mother to go out on his own.",
      "tmdbMovieId": 17642,
      "avgRating": 2.75,
      "releaseYear": "1996",
      "numRatings": 44,
      "posterPath": "/7AWx0SmqvNQ2kAsUPTR2JtVnswz.jpg"
   }
}