{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "ant",
            "id": 3126
         },
         {
            "name": "biotope",
            "id": 4166
         },
         {
            "name": "grasshopper",
            "id": 5705
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0117040",
      "video": false,
      "title": "Microcosmos",
      "recommendations": [
         64968,
         65287,
         11516,
         65002,
         129728,
         57726,
         17376,
         43101,
         64559,
         12513,
         67385,
         72495,
         12156,
         45886,
         4702,
         169780,
         63290,
         156231,
         76772,
         16242
      ],
      "backdrop_path": "/3Hb4kiKGFPWiBfUs94bfamZxDEA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "Récitant / Narrator (French version) (voice)",
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b0639",
               "name": "Jacques Perrin",
               "profile_path": "/6qegj3UL0YKMARVakEDSFTXbMRk.jpg",
               "id": 20030,
               "order": 0
            },
            {
               "cast_id": 18,
               "character": "Narrator (English version) (voice)",
               "gender": 1,
               "credit_id": "52fe44e5c3a36847f80b063d",
               "name": "Kristin Scott Thomas",
               "profile_path": "/9NuZGaPn3Z1svlbF9ZkdtjgrHZo.jpg",
               "id": 5470,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b05e7",
               "name": "Claude Nuridsany",
               "profile_path": null,
               "id": 57226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b05ed",
               "name": "Marie Pérennou",
               "profile_path": null,
               "id": 57227,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b05f3",
               "name": "Claude Nuridsany",
               "profile_path": null,
               "id": 57226,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b05f9",
               "name": "Marie Pérennou",
               "profile_path": null,
               "id": 57227,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b05ff",
               "name": "Christophe Barratier",
               "profile_path": "/Eci3c1JhMmURu7uP8s2VxXfXOV.jpg",
               "id": 43993,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b0605",
               "name": "Michel Fauré",
               "profile_path": null,
               "id": 57228,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b060b",
               "name": "Philippe Gautier",
               "profile_path": null,
               "id": 57229,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b0611",
               "name": "Patrick Lancelot",
               "profile_path": null,
               "id": 34994,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b0617",
               "name": "André Lazare",
               "profile_path": null,
               "id": 57230,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b061d",
               "name": "Yvette Mallet",
               "profile_path": null,
               "id": 57231,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b0623",
               "name": "Jacques Perrin",
               "profile_path": "/6qegj3UL0YKMARVakEDSFTXbMRk.jpg",
               "id": 20030,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b0629",
               "name": "Bruno Coulais",
               "profile_path": null,
               "id": 35073,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b062f",
               "name": "Thierry Machado",
               "profile_path": null,
               "id": 57232,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b0635",
               "name": "Florence Ricard",
               "profile_path": null,
               "id": 57233,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44e5c3a36847f80b0643",
               "name": "Marie-Josèphe Yoyotte",
               "profile_path": null,
               "id": 1663,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 4.114215,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         }
      ],
      "id": 9305,
      "vote_count": 75,
      "budget": 0,
      "overview": "A documentary of insect life in meadows and ponds, using incredible close-ups, slow motion, and time-lapse photography. It includes bees collecting nectar, ladybugs eating mites, snails mating, spiders wrapping their catch, a scarab beetle relentlessly pushing its ball of dung uphill, endless lines of caterpillars, an underwater spider creating an air bubble to live in, and a mosquito hatching.",
      "similar": [
         258480,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         242224,
         376867,
         394117,
         27586,
         370663,
         43923,
         540,
         152532,
         11216,
         1581
      ],
      "original_title": "Microcosmos : Le peuple de l'herbe",
      "runtime": 80,
      "poster_path": "/s6Mkz01oFA5GTZFmYrytid0tYvZ.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Conseil Général de l'Aveyron",
            "id": 19264,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Galatée Films",
            "id": 793,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 15671,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Bac Films",
            "id": 208,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Delta Images",
            "id": 26009,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Productions JMH",
            "id": 19289,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Urania Film",
            "id": 12242,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Télévision Suisse-Romande (TSR)",
            "id": 8453,
            "origin_country": ""
         }
      ],
      "release_date": "1996-05-20",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "CHF ",
      "directors": [
         "Claude Nuridsany",
         "Marie Pérennou"
      ],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Claude Nuridsany",
         "Marie Pérennou"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0117040/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4MDU2ODcyNF5BMl5BanBnXkFtZTcwOTk2NDEzMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Kristin Scott Thomas, Jacques Perrin | See full cast and crew »"],
      "reviews": [
         "This is a French-made nature film that features a lot of closeup photography. Much of that footage is amazing stuff. How they got closeups that sharp on these insects is a tribute to the camera lenses available today and the expertise and patience of the photographers. Some of the shots are so close that, at first, you don't know what insect you're seeing. Other insects are not familiar ones you'd recognize, anyway. Some are really strange-looking. The colors, the wild shapes and actions of these creatures all make a for a fascinating movie in parts, one that literally all ages should enjoy, as the cliché goes. I found, however, that with no dialog, it was tough to watch more than 30 minutes at one time. You might want to break this up into two or three segments. There is sound, however: the sound these insects make. With the camera-work, it makes you feel as if you, too, were a small object on the ground listening to these strange sounds. Obviously, this is a unique film and highly recommended.",
         "I saw the Winged Migration before this one and I though that was the most beautiful and amazing films ever made. I never though I would be proved wrong soon. Microcosmos has everything Winged Migration has, such as amazing cinematography, beautiful music and the best studio ever, our planet, it also has something more - the whole new world to show that most people don't realise exists. \"Look at your feet, this funny world.\" starts the beautiful song while the opening credits roll and we are treated to a beautiful flight through the clouds. The camera pans down, to the forest and then lower still. Thus starts the most amazing journey you ever saw on film and for the next hour you can't take your eyes of the screen. Palm trees, anakondas, space aliens... Grass and insects actully, but shown in the way you never thought possible. Who would have known that the sight of two snails making tender love is so cute and lovely, that spiders are so scary, dung-beetles are so funny and waterdrops so heavy? Watch how grass grows, flowers open in the morning, insects eat plants, plants eat insects, insects make love to other insects, plants and vice versa, chrysalis change into butterfly, etc., etc. And did I mention tender snail lovemaking? :) There is whole new world under our feet. Everything so small and so amazingly beautiful at the same time. Don't let it stay unnoticed. Go and watch this film immediately (and see Winged Migration as well).",
         "Amazing. There must have been millions of hours of footage shot to obtain these perfect sequences of magnified nature. Each segment was fascinating, beautiful, in some cases strangely emotional. My jaw was literally dropped through much of this film. I even found myself wowing like a hippy and chuckling like Butthead many times. There were even some moments that I almost said, \"No, that's not realistic. They made that up.\" The soundtrack was almost non-existent, so you appreciated it more when the haunting music worked its way into a scene. The sound quality of the actual critters was very good as well. There is nearly no narrative or narration throughout the film -and that would be my only criticism -there should have been NONE. The movie was spectacular with no commentary, and the human voice for a brief moment in the beginning and end detracted from the alien environment. This movie was not a documentary, it was just fine filmmaking that would only fall into the genre of \"mind-f---\".",
         "Microcosmos is a magnificent journey, an experience to explore a world full of details and wonder. After watching this \"documentary\" you would never see another insect in the same way as before. If you read some comments complaining about the little-to-non-existent narration is because they fail to understand this \"documentary\" is not about getting the facts straight. It is an experience and as such it is to be lived not to be told. Sit on the grass, observe, and paint the daughter of the dragonfly.",
         "The technology of the human race has finally let us truly see the marvels of what lies beneath our feet every day. I don't know how a documentary on insects could ever succeed with out some guy's deep soothing voice come in to tell us what the heck was going on but this movie proved that it can defiantly be done. Micro Cosmos actually make me feel small for not realizing what happens in the real world of insects. If you thought \"A Bugs Life\" was cool in terms of the technical aspects, after watching this, you will know where they got they're ideas from. I have no interest in bugs, but if youre ready to be enlightened; this will do it for you.",
         "\"Microcosmos\" is definitely one of the best animal documentary movies ever made! It's not about the most bizarre and exotic animals somewhere in Africa, but shows the all-day life of tiny insects like flies, spiders, bugs, ants, frogs, worms and snails in a French forest. There are nearly no comments, but well-chosen classical music adds a fascinating rhythm, dynamics and atmosphere to the stunning pictures... the French filmmakers just don't watch the tiny animals like scientists, but point out the beauty of their appearances, movements, actions and searches for food. Every single insect appears like painted from an artist and is shown in full close-up so that you can discover many new sides about the small animals somewhere in your own garden... and if you've watched a really romantic love scene by two snails know what \"natural beauty\" really means... highly recommended!",
         "This film gives an incredible account of insects and other little creatures many of which are known to home gardeners who are continually fighting a battle against them. But here we see the insect life in all its intriguing detail and wondrous colour. The photography is superb. It's a pity more attention was not given to the sound which comes and goes in an unpredictable fashion. There is very little commentary so one must just accept the beauty of each particular shot. One does not have to be a zoologist to enjoy this strange world the inhabiatnts of which outnumber humans on planet earth. There is some sound e.g. the flutter of wings and the buzzing of bees but much of the film is silent as one might expect in a world of insects. Music accompanies some of the scenes adding a degree of drama. Two slimy snails are seen touching and fondling each other indicating unmistakably that foreplay has begun and sexual union will follow as the choral music climaxes. The photographers must have a rare patience to record such intimate and detailed incidents. The film is not without its humorous moments. I thought the caterpillars marching in single file were an absolute gem and evoked genuine laughter. Fascinating too was Mr. Spider working at lightning speed as he wrapped in a shroud his most unfortunate victim. I found it even more enjoyable on second viewing.",
         "It was undeniably beautiful. Take a meadow in France that appears to consist of nothing but grass, and show us what wonders there are to be seen if you lower your eyes and look at the very very small... Insects (and arachnids and teensy molluscs) offer a possible advantage over, say, lions; in that with insects, cinematography really comes into its own. If you want to show a lion catching an antelope then you have to point your camera at a likely spot and wait and wait and wait until the event occurs; and when it does, chances are that the lighting is at its worst, the background is less than ideal and you would have got a better view from somewhere else. The world of the tiny gives the fellow with the camera much more control, much more room to manoeuvre. It's much easier to hit upon the perfect angle from which to show the spider eating the grasshopper. I don't know if this is true; but it's one possible explanation for why the shots are so gorgeous, and why we feel we were given the best possible seats. But if you find yourself asking, \"What the hell was going on?\" - well, you shouldn't have to ask. You should have been told. One of the reasons (I hope) for watching what is after all a documentary, is to find out WHAT GOES ON in an ordinary meadow; and if the producer thought that a human voice would destroy the sibylline loveliness of it all, that's just too bad - film-making isn't all pretty pictures. If you don't want David Attenborough doing the talking (although frankly, I don't see why you wouldn't), then find someone else or some other style of narration; or, perhaps, take more care to arrange the images so that the images themselves tell the story. I'm sure it could have been done. As it was I got the impression that we were shown ants getting hit by raindrops until they thought we must be tired of ants - and then we were shown something else. I don't want to carp too much. The makers could well retort that books, rather than films, are ideally suited to explanation, and that they had simply made a film for us to watch AFTER we had read the relevant books. Perhaps they have a point. At any rate, we may remain in the dark, but we have a wonderful view.",
         "The stunning images are not what make it a masterpiece, rather it is its poetry which conveys the sheer beauty of life. This movie is a religious experience.",
         "That's how good this documentary is! I simply mentioned the snail couple because that particular scene made such a strong impact on me. I never saw more affection and love in the animal world...the two brown snails were, honest to God, kissing. Actually, they were all over each other:) I find it a little disturbing that some previous posters don't qualify \"Microcosmos\" as a documentary. I think that it didn't need to narrate and explain what it was about, but it indeed documented something, a part of the beautiful nature that surrounds us. The fact that so little human \"presence\" is required makes it even more enjoyable and somehow, pure. It is truly mesmerizing and captivating, like watching a beautiful moving painting that relaxes the body and soul. How better to honor nature?"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Galatée Films",
         "France 2 Cinéma",
         "Canal+"
      ],
      "summaries": ["A documentary of insect life in meadows and ponds, using incredible close-ups, slow motion, and time-lapse photography. It includes bees collecting nectar, ladybugs eating mites, snails mating, spiders wrapping their catch, a scarab beetle relentlessly pushing its ball of dung uphill, endless lines of caterpillars, an underwater spider creating an air bubble to live in, and a mosquito hatching."],
      "budget": 5000000
   },
   "movielensId": 1111,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-05-20",
      "dvdReleaseDate": "2005-05-03",
      "directors": [
         "Claude Nuridsany",
         "Marie Pérennou"
      ],
      "runtime": 80,
      "movieId": 1111,
      "title": "Microcosmos",
      "mpaa": "",
      "actors": [
         "Jacques Perrin",
         "Kristin Scott Thomas"
      ],
      "imdbMovieId": "0117040",
      "originalTitle": "Microcosmos : Le peuple de l'herbe",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["76R2EKEnoJQ"],
      "plotSummary": "A documentary of insect life in meadows and ponds, using incredible close-ups, slow motion, and time-lapse photography. It includes bees collecting nectar, ladybugs eating mites, snails mating, spiders wrapping their catch, a scarab beetle relentlessly pushing its ball of dung uphill, endless lines of caterpillars, an underwater spider creating an air bubble to live in, and a mosquito hatching.",
      "tmdbMovieId": 9305,
      "avgRating": 3.94787,
      "releaseYear": "1996",
      "numRatings": 1976,
      "posterPath": "/s6Mkz01oFA5GTZFmYrytid0tYvZ.jpg"
   }
}