{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "armored truck",
            "id": 159660
         },
         {
            "name": "ashtray",
            "id": 208636
         }
      ],
      "imdb_id": "tt0117284",
      "video": false,
      "title": "Palookaville",
      "recommendations": [],
      "backdrop_path": "/4636OM4XH8Ii7dogMYbVFN0SuDH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Sid Dunleavy",
               "gender": 2,
               "credit_id": "52fe465c9251416c91051e6f",
               "name": "William Forsythe",
               "profile_path": "/3oaz2y7hIm3r3OyDKvQ1i2D8cLR.jpg",
               "id": 4520,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Russell Pataki",
               "gender": 2,
               "credit_id": "52fe465c9251416c91051e73",
               "name": "Vincent Gallo",
               "profile_path": "/tkWaZr3WmLm2SxeXymlbYSfRaZW.jpg",
               "id": 22461,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "52fe465c9251416c91051e77",
               "name": "Adam Trese",
               "profile_path": "/hVPP0r2q2kk8rVJ8m7KYqNTBAvG.jpg",
               "id": 27858,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ed the Cop",
               "gender": 2,
               "credit_id": "52fe465c9251416c91051e7b",
               "name": "Gareth Williams",
               "profile_path": "/fU2bv1Bn7mUoyYSY3wMxVRjSq3J.jpg",
               "id": 118131,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Betty, Jerry's Wife",
               "gender": 0,
               "credit_id": "52fe465c9251416c91051e7f",
               "name": "Lisa Gay Hamilton",
               "profile_path": "/a9DRGto0Dm63mbqq56dhw4aZBzM.jpg",
               "id": 64908,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Enid",
               "gender": 1,
               "credit_id": "52fe465c9251416c91051e83",
               "name": "Bridgit Ryan",
               "profile_path": "/geQGXtltoWVhb3MSpNPQKlfltbJ.jpg",
               "id": 42136,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Laurie, Russell's Girlfriend",
               "gender": 1,
               "credit_id": "52fe465c9251416c91051e87",
               "name": "Kim Dickens",
               "profile_path": "/yIXBljS46WXvRk2gma3ravVBBgU.jpg",
               "id": 21165,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe465c9251416c91051e8b",
               "name": "Suzanne Shepherd",
               "profile_path": "/fV9dTx6hqkldSymMaVtiQ6sL5Jb.jpg",
               "id": 11484,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Chris",
               "gender": 1,
               "credit_id": "52fe465c9251416c91051e8f",
               "name": "Nicole Burdette",
               "profile_path": "/uhbivJXrZ4y7n3S3BuBQnfk8uG0.jpg",
               "id": 4159,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Ralph",
               "gender": 0,
               "credit_id": "52fe465c9251416c91051e93",
               "name": "Robert LuPone",
               "profile_path": "/hIVQjz4iP4JJ5c8euwVjEsG9SiO.jpg",
               "id": 55496,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mr. Kott, Money Truck Driver",
               "gender": 2,
               "credit_id": "52fe465c9251416c91051e97",
               "name": "Sam Coppola",
               "profile_path": "/nw61T8Yuua0OCabfdoWult2qbeQ.jpg",
               "id": 118132,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "June",
               "gender": 1,
               "credit_id": "52fe465c9251416c91051e9b",
               "name": "Frances McDormand",
               "profile_path": "/jodV4NuQAvxQWIHxqnop1jUX77N.jpg",
               "id": 3910,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Money Truck Driver",
               "gender": 0,
               "credit_id": "52fe465c9251416c91051e9f",
               "name": "Walter Bryant",
               "profile_path": null,
               "id": 118133,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Old Man",
               "gender": 2,
               "credit_id": "52fe465c9251416c91051ea3",
               "name": "Douglas Seale",
               "profile_path": "/1Tbu7xnv3iwiLtKIJg1taQITbKC.jpg",
               "id": 15833,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Old Arthur",
               "gender": 2,
               "credit_id": "52fe465c9251416c91051ea7",
               "name": "William Riker",
               "profile_path": null,
               "id": 118134,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe465c9251416c91051e65",
               "name": "Alan Taylor",
               "profile_path": "/f8hPlHuaRw1py22wp2qqNRfVDMw.jpg",
               "id": 47005,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe465c9251416c91051e6b",
               "name": "David Epstein",
               "profile_path": null,
               "id": 50518,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "561cce8cc3a368225b002fdd",
               "name": "Uberto Pasolini",
               "profile_path": null,
               "id": 57632,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "561cced79251411e6500183f",
               "name": "Rachel Portman",
               "profile_path": "/AkMflxC3EkbWuyPoltQ406EJvue.jpg",
               "id": 3562,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "561ccf03c3a368225e0033ed",
               "name": "John Thomas",
               "profile_path": null,
               "id": 58367,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "561ccf349251415a62003499",
               "name": "David Leonard",
               "profile_path": null,
               "id": 112576,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561ccf489251415a6700390e",
               "name": "Kerry Barden",
               "profile_path": "/zb3khdNgVHerkFz4esvjSZHnbDW.jpg",
               "id": 5328,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561ccf5bc3a3682253003590",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561ccf6d9251415a5f00343d",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "561ccf88c3a3682264003565",
               "name": "Anne Stuhler",
               "profile_path": null,
               "id": 1467186,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "561ccf9b9251415a67003917",
               "name": "Roswell Hamrick",
               "profile_path": null,
               "id": 1467187,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "561ccfb0c3a368226400356a",
               "name": "Janie Bryant",
               "profile_path": null,
               "id": 1522041,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "561ccffd9251415a720034f5",
               "name": "Sheila Waldron",
               "profile_path": null,
               "id": 1400540,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.128586,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37616,
      "vote_count": 8,
      "budget": 0,
      "overview": "Jerry and his two pals, Russ and Syd, are just looking for some easy money to help them break out of their nowhere lives in their nowhere town. Despite a bungled jewelry store heist which exposes their incompetence as criminals, a fateful event (and an old black-and-white film) convinces them that they can pull off an armored-truck robbery. While they are busy plotting their caper, their dysfunctional families spin out of control, all around them.",
      "similar": [
         4771,
         429733,
         8012,
         507,
         3134,
         8810,
         949,
         281,
         948,
         339692,
         298312,
         4638,
         193893,
         10212,
         11564,
         43923,
         133805,
         2142,
         6075,
         12162
      ],
      "original_title": "Palookaville",
      "runtime": 92,
      "poster_path": "/r5rAF13jpTxRaaPqZRPKgmejiLW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Redwave Films",
            "id": 8764,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Playhouse International Pictures",
            "id": 2492,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Public Television Playhouse Inc.",
            "id": 65387,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-07",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "One foot in the door. The other one in the gutter.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Taylor"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["David Epstein"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117284/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1NzA1Mzc2NF5BMl5BanBnXkFtZTcwMzQwOTc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Forsythe, Vincent Gallo, Adam Trese | See full cast and crew »"],
      "reviews": [
         "For reasons which, to me anyway, are completely unfair, every heist movie released since 1992's RESEVOIR DOGS has been compared to that film. I agree that film was great, and obviously there have been rip-offs, but not every heist film is, and PALOOKAVILLE, a wonderful surprise, is an example. In fact, if there's any film this should be compared to, it's the 1950's Italian movie BIG DEAL ON MADONNA STREET. Like that film, this is not about hardened criminals planning a heist, but about ordinary guys who try to be criminals while juggling their lives(one is married and has a kid, one takes care of his dogs, and even the third, who's more of the criminal mind than his friends, is dreaming of going with his girlfriend to California). It's also like BOTTLE ROCKET, which is also about inexperienced thieves, but where those guys, for the most part, want to be criminals, these guys just see it as an escape. But director Alan Taylor and writer David Epstein aren't making a tract, they're making a film about characters we can relate to, and while it lags at times, this is surprising, funny, and touching. Also, the performers are all good(this is an early look at the talents of Kim Dickens and Vincent Gallo). One of the more under-rated films of the year.",
         "In the vein of \"Small Time Crooks\" and \"Trapped in Paradise,\" \"Palookaville\" tells the story of three screw-up, would-be criminals (Forsythe, Gallo and Trese) and their quest for the perfect crime. The film opens with a foiled jewelry store robbery that find the trio in a bakery instead of its neighboring store. The whole situation is goofy in an endearing way, especially when we find Trese crouched on the floor, hiding from police yet all the while chowing down doughnuts and brownies. With this film, Parker creates a familiar oddball trio with, while not completely appealing personalities, an overall charming combination. Forsythe's seriousness plus Gallo's wit and Trese's goofiness makes a film that made me laugh out loud and left me smiling, but in an independent rather that cheesy way. Definitely recommended.",
         "I'm very rarely inspired to give a film a Ten, but this must have been just the film I was in the mood to see at the time. Only a few of those consciousness-threatening laughs, but generally a warmly funny film. As a dog-hater, I'm always astonished when a dog (or two) steals the show. Palookaville's dogs were the first film roles I've ever seen for the kind of pets MY friends have in real life. My wife was so caught up in her identity with the lives of the characters, that she was at one point heard to remark \"Oh, no! Don't let something bad happen in this film!\" Almost made us want to go and live in New Jersey.",
         "Basically this is one of the finest films I saw the year it came out. American indie comedy/character cinema at its best. The trouser sniffing scene almost got me ejected from the cinema for laughing too loudly. This movie is an absolute triumph. Around the same time I caught 'Big Night', 'The Daytrippers' & 'Buffalo 66' - all great films. If you liked any of them you'll love 'Palookaville'.",
         "In New Jersey three friends are out of work and out of prospects for improvement. Their first attempt at crime fails when they break into a bakery they mistake for the back of a jewellers shop. Russell's brother in law is a cop who knows that he is up to no good, however Russell still wants the trio to do one reasonable job to help them onto their feet. The next step is the robbery of an armoured car. However, are they bad at being bad or just to good to be bad. There have been quite a few films that make comedy of inept criminals, however this film is more than that. Rather than being figures of fun, these are good people without much hope who resort to crime in rather amateur way, for example to help plan their job they hire a 1950's crime thriller called `Armoured Car Robbery' from the video store. There are no pratfalls or physical humour but instead gentle stuff that is amusing. The title comes from the line in On The Waterfront in which Marlon Brando bemoans his failure as a fighter as a `one-way ticket to Palookaville' or being a loser. The three men of the title are losers, but they are good, likeable people in difficult situations. Happily the film allows us into their lives so that they are not just `inept criminals' caricatures. The dialogue is involving but also snappy and witty. The strong cast help this enormously. Gallo is really good in the lead and the actual moment when he realises that he may be in a tough spot but he is not a bad person is really quite touching. Forsythe is good and wears his sensitive side well on his sleeve. Trese has the most difficult character \u0096 the danger would be he becomes the `drama' side of the film, but he handles it well with good support from his on-screen wife Hamilton. The support cast of family and lovers all are really believable characters, although the film really belongs to the lead three. Overall I suspect many will find this slight and not as funny as they expected. However I found it a well written (sharp yet real dialogue) with respect for it's characters \u0096 finding humour in their situations and approach rather than making them comedy characters. Add this to some well pitched performances and it makes for a film that does what it sets out to do and does it better than many of it's ilk.",
         "This is the 2nd film I've seen Vincent Gallo (the other one was `Buffalo 66' which was decent) act in, and I have to say this guy picks perfect roles. You forget the guy is acting, and that's the mark of a craftsman. He ends up in my favorite scene of the movie where his neighbor playfully starts a last call strip-tease after he returns home one night. Gallo this time plays Russell, who along with his buddies, do their best to bounce off the outer rim of social responsibility by tackling the next level of semi-professional burglary. Russell should have learnt long ago that you need to lock the bedroom door or something s****y is bound to happen. The performances are compelling and the writing is convincing. Above all, it's a very funny film. There are some good lines and unforgettable scenes (the moments at the dinner table come to mind). So yeah, you end up laughing more than you expected but the movie `Palookaville' actually does what it's supposed to do; it moves you. You care about what happens to these guys because they are learning more about themselves than you expect them to. As a result you don't really want this one to end early. Remember\u0085 if you ever see a legally blind person trying to board a bus with not one but two guide dogs, the small one's in training.",
         "When Marlon Brando uttered the immortal line \"I got a one-way ticket to \"Palookaville\" (in \"On the Waterfront\"), he was referring to his current life as washed-up boxer, crumb and stooge for the mob, living out his life in a kind of moral limbo, doing rotten things and not quite realizing their import until it's too late. The creators of this fine, quirky film reputedly got the idea for their movie from the line quoted above. Their idea of \"Palookaville\" is a forgotten nothing of a town where oddballs and misfits abound and where a job in the local pizzeria constitutes a career. The movie centers around a trio of professional losers, whose attempt to rob a jewelry store nets them nothing but some pastry from the bakery they break into by mistake. Their efforts to hold up armored cars yield similar results. Nearly everyone in their orbit seems to be a screw up, including their hapless girlfriends. In spite of their criminal bent, our would-be crooks manage to be endearing (each robbery is going to be their \"last job\"), as is the entire movie. You find yourself rooting for them and when the intended burglary of the armored car gets them the town's highest honor (they did return the money, which makes them heroes to the town, which doesn't seem to realize what they were up to) you almost want to stand up and cheer. William Forsythe (\"Gotti\") anchors the film with his performance and his two dogs manage to steal several scenes. Vincent Gallo and Adam Trese are also fine as his accomplices, as is Frances McDormand, in a far-too-small role that for once emphasizes her good looks. This offbeat, comic film is definitely worth a look.",
         "A trio of small town friends intent on pulling off a big-time burglary. Nothing in life seems to favor them and this heist won't either. The cast is young and fresh and the plot is humorous and exciting. Extremely watchable. Good flick for a pick-me up some night.",
         "I loved all your critics. This movie deserves a great deal of honors. But I did not only love the film. I also listened to the beautiful music. I have been looking on the web but could not find anything about is. That in fact, I found it very strange, as the main theme came up over and over again, all the time slightly different. Really fantastically done. It supported the plot of the film in a strong way, sometimes sad, then funny and later melodramatic etc. Did anyone else listen too? And have a look at the end titles who made it? I forgot that stupid enough. Hope you can help, waiting for your reply...I guess it would help already to learn the composer, but any additional information would be most welcome too!",
         "\"Palookaville\" tells of three schmucks who are determined to be crooks but somehow just can't seem to mastermind even a simple burglary. Surprisingly well scripted, acted, and directed, given the plot, this film develops and maintains the integrity of it's inept principals while walking a tightrope between comedy and drama, avoiding falling headlong into either genre. An enjoyable little flick for channel surfers."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Playhouse International Pictures",
         "Public Television Playhouse Inc.",
         "Redwave Films"
      ],
      "summaries": ["Jerry and his two pals, Russ and Syd, are just looking for some easy money to help them break out of their nowhere lives in their nowhere town. Despite a bungled jewelry store heist which exposes their incompetance as criminals, a fateful event (and an old black-and-white film) convinces them that they can pull off an armored-truck robbery. While they are busy plotting their caper, their dysfunctional families spin out of control, all around them."],
      "budget": 0
   },
   "movielensId": 1112,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-07",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Alan Taylor"],
      "runtime": 92,
      "movieId": 1112,
      "title": "Palookaville",
      "mpaa": "",
      "actors": [
         "William Forsythe",
         "Vincent Gallo",
         "Adam Trese",
         "Gareth Williams",
         "Lisa Gay Hamilton",
         "Bridgit Ryan",
         "Kim Dickens",
         "Suzanne Shepherd",
         "Nicole Burdette",
         "Robert LuPone",
         "Sam Coppola",
         "Frances McDormand",
         "Walter Bryant",
         "Douglas Seale",
         "William Riker"
      ],
      "imdbMovieId": "0117284",
      "originalTitle": "Palookaville",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["T6RzJaZA1qY"],
      "plotSummary": "Jerry and his two pals, Russ and Syd, are just looking for some easy money to help them break out of their nowhere lives in their nowhere town. Despite a bungled jewelry store heist which exposes their incompetence as criminals, a fateful event (and an old black-and-white film) convinces them that they can pull off an armored-truck robbery. While they are busy plotting their caper, their dysfunctional families spin out of control, all around them.",
      "tmdbMovieId": 37616,
      "avgRating": 3.40025,
      "releaseYear": "1995",
      "numRatings": 406,
      "posterPath": "/r5rAF13jpTxRaaPqZRPKgmejiLW.jpg"
   }
}