{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114622",
      "video": false,
      "title": "North Star",
      "recommendations": [],
      "backdrop_path": "/fBPxv0frpA38jLCZve6XOG8d8ZR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sean McLennon",
               "gender": 2,
               "credit_id": "52fe4c84c3a368484e1ba945",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Hudson Saanteek",
               "gender": 2,
               "credit_id": "52fe4c84c3a368484e1ba949",
               "name": "Christopher Lambert",
               "profile_path": "/sIl2F9LDTjfnAVBxEG5CTtZGuJU.jpg",
               "id": 38559,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe4c84c3a368484e1ba94d",
               "name": "Catherine McCormack",
               "profile_path": "/a8Jszh3rHQ2T4u1VyE4lXrb0uDI.jpg",
               "id": 2462,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Reno",
               "gender": 2,
               "credit_id": "52fe4c84c3a368484e1ba951",
               "name": "Burt Young",
               "profile_path": "/rbSsSkQ72FoGcvwIHUxQWJ92I3W.jpg",
               "id": 4521,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4c84c3a368484e1ba957",
            "name": "Nils Gaup",
            "profile_path": "/A04LmjnxXHHIoNQctHlZaRzqwEv.jpg",
            "id": 22558,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 1.887848,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 200383,
      "vote_count": 5,
      "budget": 0,
      "overview": "Set during the Alaskan gold rush of the late 1800's. In his efforts to gain control of a small mining town, Sean McLennon is buying up every mining claim that becomes available, usually after the deaths of the previous owners at the hands of McLennon's 'assistants'. One of the miners targeted by McLennon, a half-Indian hunter named Hudson Saanteek, manages to escape his hired thugs and comes back into town looking to re-establish his claim and get revenge. McLennon and his men have the advantange of numbers and weapons, but Saanteek has his survival skills and knowledge of the Alaskan wilderness.",
      "similar": [],
      "original_title": "North Star",
      "runtime": 90,
      "poster_path": "/qevX0JBVA8l64xCiR6c4BzXzQCh.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-01-03",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Where land is power and revenge is obsession.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nils Gaup"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Heck Allen",
         "Gilles Béhat"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114622/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4Mzk4OTczOV5BMl5BanBnXkFtZTcwOTY1MzAzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Caan, Christopher Lambert, Catherine McCormack | See full cast and crew »"],
      "reviews": [
         "I really liked this film. James Caan was outstanding and intense, plus there was overall great character development throughout - it's not a simple \"Western\". Although Christopher Lambert's leading role is controversial, it may be due to character baggage from his other better known roles such as in Highlander. This is my first direct exposure to the actor/producer, and from a fresh perspective his performance seemed fully resonant with the tone and flow of the movie. The settings are beautiful, and even though filmed in Norway, it adequately characterizes the Gold Rush as an Alaskan phenomenon.",
         "Had \"North Star\" been made in the 1940's or 1950's and had starred John Wayne or Charlton Heston, it would have been hailed as an exciting wilderness adventure, featuring excellent chase sequences and solid characters. However, it was made in 1995, and while the story had a good deal of potential as a great, if mindless, adventure story, it unfortunately is too tame for modern viewers. They will probably be either very bored or just not interested. While the characters are effective and the story is loaded with some great stuff, it simply pales to films of its kind, including \"Cliffhanger\" and \"White Fang.\" That said, the cast is excellent, if a little miscast. James Caan is the villian, a man maddened by the isolated confounds of Nome Alaska. Having lived there for many years, I knew many people in his situation, and he does as a good a job as possible showing the effects such desolate surroundings can have on the human spirit. He nails the performance and shows why he's the celebrated actor that he is, and he makes dialogue such as \"Nobody dies until I tell them to die!\" sound miraculously believable. Christopher Lambert also brings passion to the role of the half-breed Indian who is trying to protect his land from Caan. While it is obviously a miscast (he's part Eskimo like I'm Clark Gable!), he does a commendable job as a man torn between loyalties, protecting a land from a native people who don't necessarily trust him. I don't think he was the ideal choice for the role, simply because he's obviously French, but the subtly and haunted characteristics that he demonstrates here shows a great deal of flair and concern for making this film work. Between he and Caan, not to mention an altogether underused Catherine McCormick, they almost manage to lift this tame adventure story above standards. Unfortunately, good perfomances can't save it. Only style and more over-the-top actions scenes would have, and that is where the movie is lacking. Still, it's not a bad film to watch during the dog-days of summer for a little pick-me-up. **1/2 out of ****",
         "\"North Star\" was released in 1996 but went unnoticed at the box office. It's a Western that takes place in Nome, Alaska, (but shot in Norway) during the Alaskan gold rush of the late 1800s. James Caan plays the love-to-hate villain who denies mining claims to foreigners and attempts to kill a half-breed Indian (Christopher Lambert) for the claim to a cave filled with gold, which the natives use in their ceremonies. The half-breed ends up abducting the villain's woman, played by the beautiful Catherine McCormack (who you might remember as Wallace's doomed wife at the beginning of \"Braveheart\"). As others have pointed out, there are elements of other Westerns here, like \"Death Hunt,\" \"Valdez is Coming,\" \"The Far Country\" and \"Dances With Wolves (20th Anniversary Edition),\" but that's to be expected and, besides, it's one of the few fully Winter Westerns that I can think of (of course, films like \"Will Penny,\" \"Jeremiah Johnson\" and a few others have some fairly long Winter sequences). While Caan's villainy is too over-the-top for my tastes (although he does it well), I found \"North Star\" to be a well-done Western up until the final 15 minutes or so. Like I mentioned above, it really dawned on me while viewing that this was the first Western I ever saw that focused exclusively on Winter conditions. The locations, sets and cast are all first-rate even while the story-telling has somewhat of a TV-movie vibe. But those last 15 minutes just throw the entire film off. It's like the filmmakers either rushed the ending to just complete the project or perhaps they weren't confident with the closing footage and awkwardly tried to \"make it work\" in the editing room. Either way, it shows. Still, it's a worthwhile modern Western that attempts something unique even while being a pastiche of the genre. GRADE: C+",
         "Businessman Sean McLennon is the president of the miners union. He has banned all non-Americans from staking claim to the land. Moreover he is killing off people in order to then buy their claims at auction. However when his men only wound Saanteek and kill an old Indian, Saanteek returns to take revenge on McLennon and to protect his land. Why did I bother to tape this film? The film industry is a funny thing isn't it \u0096 James Caan was at his peak in Godfather and Rollerball, while Lambert had his `peak' with Highlander \u0096 but now they both wind up in this, although for Lambert he hasn't fallen too far. The story here is very basic and starts out very dry. Unfortunately it stays that way. The characters never get interesting and the plot never ever gets any tension involved at any level. The way the ending is forced into a face off is clumsy and typical of the whole film. Caan is OK because he never seems to take it totally seriously \u0096 certainly the plot `twists' around his character are impossible to accept without laughing. Lambert is terrible \u0096 he seems to be saying all his lines through gritted teeth as if he has his jaw wired up! The rest of the cast are also poor but the leads being bad distract from that. The cast is wooden and even then they are put to shame by the wooden sets being better than them. The sets and costumes are good and set the period well \u0096 shame the film lets them down. Overall this is totally lacking in interest, plot, characters and any sort of action or tension whatsoever. It's not total rubbish it's just made with no conviction, no passion and is worse than bad \u0096 it's just barely mediocre.",
         "North Star is unique for a European western in that it's set in Alaska, far from the sun baked deserts of the southwest. Everything else is disappointingly typical. Caan plays a black-hearted land baron in 1899 Alaska who's systematically murdered and cheated his way into being the owner of the largest goldmines in the area. He tries to kill Lambert, a half Eskimo who had the good sense to file a claim on his people's sacred (and gold rich) cave. It isn't boring but a chase movie where Christopher Lambert squares off against James Caan and Burt Young in a savage frontier battle for survival should have generated more heat than this, especially being that this is co-written by Sergio Donati, who also helped pen For A Few Dollars More and Once Upon A Time In The West! It's pretty straight forward and unpretentious but it made me wish it were more compelling. The characters were pretty cardboard, though Caan seems to be having some fun swinging back and forth between greedy and treacherous to insane and out of control. Also, everyone appears to be under-dressed. This movie takes place in Nome, Alaska during a snowstorm but everyone's dressed like it's Fall. Lee Marvin and Charles Bronson were better in Death Hunt, watch that one first!",
         "I've probably seen James Caan more often as a villain than a hero, and the villain role suits him just fine. He goes from bad to evil to maniacal in the course of the story here, with a twist in the picture that comes out of nowhere that attempts to explain his hatred of the half breed Hudson Santeek (Christopher Lambert). That he's a half breed himself serves no purpose other than to cause this viewer to go \"Oh!\", so I don't know why that element was even introduced. While watching the film, I hearkened back to my childhood days with 'Sergeant Preston Of The Yukon'; this could have been an extended episode of that show. Great footage of Alaskan sled dogs mushing through wind whipped snowy trails, not quite figuring out how competing sled teams didn't get all tangled up with each other. One thing Preston never had to put up with was getting shot and falling into icy rivers. Man, I can't imagine even being THAT cold! I wonder if the actors got bonus pay for that. I caught this on the Encore Western Channel this evening, and I suppose the 'Western' connotation has some bearing, even if filmed as an Alaskan wilderness adventure. It's got a typically 'B' Western flavor focusing on an evil town boss (Caan) swindling local miners out of their gold claims and leaving them dead in his wake. I can't think of a Western that ever got the body/deed count as high as eleven like this picture did, which can only mean that Christopher Lambert was no Red Ryder or Durango Kid. For his trouble, the man should pour himself a brandy to warm up.",
         "Christopher Lambert has quite a checkered list of elastic films where you either like his work or not. Sometimes they're fun (\"Highlander\", \"The Hunted\", \"Fortress\" and \"Gunmen\"), others less so (\"Love Dream\", \"Highlander II\" and \"Fortress II\") or they're downright atypical (\"I love You\", \"Subway\" and \"Southland Tales\"). For me the mid-90s chase adventure \"The North Star\" falls in the middle bracket\u0085 not a terrible film by any standards, just lacklustre along with Lambert's performance. It did remind me of the Charles Bronson and Lee Marvin 1980 feature \"Death Hunt\". In Alaska in the 1890s a half-breed trapper becomes the target of a crooked businessman who wants the land of his ancestors and the only way to do so is to kill the half-breed. The plot's foundation harbours familiar trappings, but never really comes alive with no real momentum or character interest. The action is uninspired, dialogues forced and the direction rather stagy in a cheap- looking production. It's the villainous performances of an unhinged James Caan and a burly Burt Young that keeps it from freezing over. Add to that the vivid snowy locations that dress up the screen. Catherine McCormick shows up, but gets little to do. A sleepy, flat-footed chase drama.",
         "In the latter part of the 19th century,Alaska is swamped with people claiming land for goldmines and a struggle ensues between a crooked businessman and a half breed over stolen land. This is in all aspects a western but set in land covered with snow and with sledges more than horses.Film is actually mainly norweigian made but also has other countries involved in it's production,so may even come under the euro western genre.Film is slow paced but also strangely seems rushed at times especially at a rather lacklustre climax.James Caan as the villain of the piece plays it all wide eyed and mad looking which is a little over the top.Some sporadic violence and a couple of OK moments but not enough.",
         "I'm sorry to say that this film only deserves 2 out of 10, due to the main character Christopher Lambert. The expectations to this film was great here, since it's partially filmed here in Norway. (The snow scenes and great outdoor scenery is filmed at Mösvatn near Rjukan in Telemark, Norway, and the great Nils Gaup is the director.) Lamberts performance sucks big time! He does not fit into the story at all. This snow filled western (or northern) has great actors, but due to Lambert tragic figure, the whole film just crashes to the ground, though the story should be good enough. The film also flopped big time in the cinemas, of course, due to this... This is Nils Gaups worst film. It looks like he really lost the grip on this one. Go watch another of his films! Ofelas or Kautokeino-Opprøret, or Misery Harbour! They are all great!",
         "Despite being made by one of Hollywood's most prominent film companies (Regency), and starring James Caan and Christopher Lambert, the distributor (Warner Brothers) doesn't seem to have done much (if anything) in the way of a theatrical release, at least on this side of the ocean. Seeing the movie for myself, I think I can understand why. It's not a TERRIBLE movie - the scenery looks nice at times, and the movie is never boring - but it comes across as flat. Lambert is his usual vanilla self, and Caan at times doesn't seem to be taking this acting assignment with much seriousness. There appear to have been cuts made to the story, either in the screenplay stage or in the editing room, which leads some parts of the movie to be somewhat incoherent or without proper explanation. One explanation for this may be that this movie was a co-production between FOUR countries - maybe details got lost in the constant translation between the parties. The movie obviously had a limited budget, which explains why the movie lacks visual depth and scope at times, often resembling a made-for-TV movie. And in the last part of the movie, Caan's character starts doing some ludicrous things that no man with sense would do in his situation. You are not missing much if you skip by this movie at your video store."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "AFCL Productions",
         "M6 Films"
      ],
      "summaries": ["Set during the Alaskan gold rush of the late 1800's. In his efforts to gain control of a small mining town, Sean McLennon is buying up every mining claim that becomes available, usually after the deaths of the previous owners at the hands of McLennon's 'assistants'. One of the miners targeted by McLennon, a half-Indian hunter named Hudson Saanteek, manages to escape his hired thugs and comes back into town looking to re-establish his claim and get revenge. McLennon and his men have the advantange of numbers and weapons, but Saanteek has his survival skills and knowledge of the Alaskan wilderness."],
      "budget": 0
   },
   "movielensId": 1118,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1996-01-03",
      "dvdReleaseDate": null,
      "directors": ["Nils Gaup"],
      "runtime": 90,
      "movieId": 1118,
      "title": "North Star",
      "mpaa": "",
      "actors": [
         "James Caan",
         "Christopher Lambert",
         "Catherine McCormack",
         "Burt Young"
      ],
      "imdbMovieId": "0114622",
      "originalTitle": "North Star",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Set during the Alaskan gold rush of the late 1800's. In his efforts to gain control of a small mining town, Sean McLennon is buying up every mining claim that becomes available, usually after the deaths of the previous owners at the hands of McLennon's 'assistants'. One of the miners targeted by McLennon, a half-Indian hunter named Hudson Saanteek, manages to escape his hired thugs and comes back into town looking to re-establish his claim and get revenge. McLennon and his men have the advantange of numbers and weapons, but Saanteek has his survival skills and knowledge of the Alaskan wilderness.",
      "tmdbMovieId": 200383,
      "avgRating": 3,
      "releaseYear": "1996",
      "numRatings": 35,
      "posterPath": "/qevX0JBVA8l64xCiR6c4BzXzQCh.jpg"
   }
}