{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "diamond",
            "id": 1384
         },
         {
            "name": "supermarket",
            "id": 1545
         },
         {
            "name": "gang war",
            "id": 2987
         },
         {
            "name": "disabled child",
            "id": 4640
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "bronx",
            "id": 161307
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         }
      ],
      "imdb_id": "tt0113326",
      "video": false,
      "title": "Rumble in the Bronx",
      "recommendations": [
         9404,
         10348,
         10622,
         9056,
         10753,
         12207,
         10974,
         21521,
         11134,
         11205,
         21519,
         8697,
         11230,
         10975,
         10951,
         21733,
         18764,
         11847,
         11198,
         11636
      ],
      "backdrop_path": "/rGeVEsRDVvlMBN7fmOKhNW2GtWy.jpg",
      "revenue": 32392047,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Keung",
               "gender": 2,
               "credit_id": "52fe45219251416c91028851",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elaine",
               "gender": 1,
               "credit_id": "52fe45219251416c91028855",
               "name": "Anita Mui",
               "profile_path": "/dTixqSDiMWlTNOiSWJLd4jkn5gI.jpg",
               "id": 44917,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe45219251416c91028859",
               "name": "Françoise Yip",
               "profile_path": "/6TllaFxiYl6j5l5rmnbAIGInaPJ.jpg",
               "id": 10875,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Uncle Bill",
               "gender": 0,
               "credit_id": "52fe45219251416c9102885d",
               "name": "Bill Tung",
               "profile_path": "/dE7UFkmJqs8PgUOkCTDDI69J90i.jpg",
               "id": 44922,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe45219251416c91028861",
               "name": "Marc Akerstream",
               "profile_path": "/d9HrS0vvlLb3ho5h6AlHj0KEWw5.jpg",
               "id": 44919,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Angelo",
               "gender": 2,
               "credit_id": "52fe45219251416c91028865",
               "name": "Garvin Cross",
               "profile_path": "/gQ5UZq9pR7d96wWvwFVEX1fCPsB.jpg",
               "id": 21264,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Danny",
               "gender": 0,
               "credit_id": "52fe45219251416c91028869",
               "name": "Morgan Lam",
               "profile_path": null,
               "id": 44921,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "White Tiger",
               "gender": 0,
               "credit_id": "54dbbdfac3a368310200202d",
               "name": "Kris Lord",
               "profile_path": null,
               "id": 1426138,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Whitney",
               "gender": 0,
               "credit_id": "54dbbe0b925141618c00240b",
               "name": "Carrie Cain-Sparks",
               "profile_path": null,
               "id": 1235524,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45219251416c9102886f",
               "name": "Stanley Tong",
               "profile_path": "/sG4jGodAJpyymBEEODAc0D09bBG.jpg",
               "id": 44916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45219251416c91028875",
               "name": "Edward Tang",
               "profile_path": null,
               "id": 46318,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45219251416c9102887b",
               "name": "Fibe Ma",
               "profile_path": null,
               "id": 46319,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57e146d392514104530063d9",
               "name": "Barbie Tung",
               "profile_path": null,
               "id": 46321,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.888132,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 33542,
      "vote_count": 291,
      "budget": 7500000,
      "overview": "Keong comes from Hong Kong to visit New York for his uncle's wedding. His uncle runs a market in the Bronx and Keong offers to help out while Uncle is on his honeymoon. During his stay in the Bronx, Keong befriends a neighbor kid and beats up some neighborhood thugs who cause problems at the market. One of those petty thugs in the local gang stumbles into a criminal situation way over his head.",
      "similar": [
         24,
         140300,
         604,
         605,
         9053,
         3131,
         146,
         55292,
         9502,
         23742,
         9461,
         251516,
         7549,
         11474,
         11134,
         18707,
         9535,
         44865,
         21733,
         1273
      ],
      "original_title": "紅番區",
      "runtime": 91,
      "poster_path": "/y7AxKPPCtZyrGQKvxzn5zTQ8wFm.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Golden Harvest Company",
            "id": 2521,
            "origin_country": ""
         }
      ],
      "release_date": "1995-01-30",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "No Fear. No Stuntman. No Equal.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stanley Tong"],
      "runtime": 104,
      "synopsis": "Ma Hon Keung (Jackie Chan), a Hong Kong cop, comes to New York to attend the wedding of his Uncle Bill (Bill Tung) who introduces his new wife to him down at his local Chinese supermarket, which he owns and is in the process of selling to Elaine (Anita Mui). Uncle Bill's friend, Steven Lo, loans him a vintage automobile for the wedding. Later that night, a street gang starts a motorcycle race near Uncle Bill's apartment. They are about to run over his friend's car until Keung jumps down and stops them. He soon starts a rivalry with the street gang when he drives them away from the supermarket that they were robbing and vandalizing. This starts a series of brawls in which the bikies try to corner Keung and finish him off. When a member of the street gang named Angelo (Garvin Cross) gets involved in an illegal diamond deal gone bad and steals the diamonds, the small-time gangsters become the victims of a much larger and more effective criminal syndicate led by White Tiger (Kris Lord). While running away with the diamonds, Angelo leaves them in a cushion, which is unknowingly used by Keung for the wheelchair of a disabled Chinese American boy, who is raised by his elder sister Nancy, a lingerie model/dancer who works in a seedy bar and is an associate/girlfriend of the bikies. Keung befriends Nancy and advises her to stay away from crime. When the gangsters see this, they chase Keung and Nancy. After failing to confront Keung, the bikies turn up at Elaine's supermarket and start vandalizing it, during which two of Angelo's men are captured by White Tiger's men, who turn up at the supermarket in search of Angelo. Angelo's colleagues are unaware of his diamond heist and one is executed in a tree-shredder; his remains are given back to the other gangster to show to his friends as a warning to return the multi-million dollar goods. In the meantime, Keung and Nancy go to bikies' shed after the latest supermarket attack, and Keung defeats them in another brawl, at which point the shredded remains are brought back. Keung agrees to help the bikies' leader, Tony (Marc Akerstream). Keung convinces the street gangsters to reform, then brings the big-time criminals to justice after another long-winded street battle. The syndicate and Keung work out the diamonds are in the boy's wheelchair, and the handover is botched after Nancy and Tony are held hostage by the syndicate; the diamonds are lost after the syndicate uses towtrucks to pull the supermarket apart and the diamonds are spilled as Keung is in the building and knocked over. A long climatic battle occurs in the Hudson River after White Tiger's men hijack a hovercraft and are pursued by Keung and the New York Police Department. The hovercraft finally ends up running through the streets, causing much damage to property. Keung ends the chase by stealing a large sword from a museum and clamping it onto a sports car window and driving into the hovercraft, shredding the rubber undercarriage and immobilising the vehicle and capturing the syndicate men. After shooting one of them non-fatally to force them to reveal White Tiger's location, Keung drives the hovercraft, with the rubber implausibly re-patched with tape, across town to a golf course where White Tiger is playing with subordinates. He runs them over and squashes them non-fatally into the ground. The film ends with White Tiger being squashed, his clothes ripped off his back, leaving him buck naked.",
      "writers": [
         "Edward Tang",
         "Fibe Ma"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0113326/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwNzYxMTIyNl5BMl5BanBnXkFtZTYwOTA5MTE5._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Jackie Chan, Anita Mui, Françoise Yip | See full cast and crew »"],
      "reviews": [
         "Jackie Chan had never had a box office hit in America despite starring in Hollywood films such as 'Battle Creek Brawl' and 'The Protector' in the 1980s. 'Rumble in the Bronx' was a Hong Kong made film, but they wanted it to have international appeal and achieved this through its New York setting and American background characters. The film intended to introduce Jackie Chan to the West, and that's exactly what it did - but they didn't expect it to be a number one box office hit. The story involves Keung (Jackie Chan) coming over to America to visit his Uncle who owns a grocery store in the Bronx. Soon enough a biker gang turns up and causes havoc at the store, so it's up to Keung to fend off the bad guys, uncover police corruption, and generally save the day in style. This is a high energy film and the pace never lets up, there isn't one big set piece in this film there are many big set pieces, but the most impressive stunt has to be the one where Jackie jumps from the top of a multi-storey car park onto a small balcony across the road. The multiple camera set up shows us that there is no safety netting or use of wires - just Jackie entrusting his own life in his own abilities. Naturally there are countless fight scenes where Jackie shows us his own brand of kung fu comedy, including the process of making inanimate objects become very animated indeed. Only he can turn pinball machines, trolleys and fridge doors into weapons! The only slight criticism I would have is that the fights are over edited, people like Jean Claude Van-Damme and Steven Segal might need a lot of cuts to put a fight scene together, but Jackie doesn't - he's an expert choreographer, and the cuts are needless. I'm not saying that the fight sequences are under par, because they're not, they are still very impressive - especially to people who haven't seen the man in action. When the American audiences saw 'Rumble in the Bronx', they saw the real Jackie Chan not the shadow of a man struggling to gain artistic input under a Hollywood studios control. They were wowed by the death-defying stunts, frenetic fight sequences, and the sheer energy of the film from start to finish got word-of-mouth working overtime. 'Rumble in the Bronx' was the surprise box office hit of 1996, it made the West sit up and take notice of an exceptional talent they had long overlooked. The next time Jackie Chan would star in a Hollywood film he would be given the respect he had always deserved - and another box office hit.",
         "Before I'd seen \"Rumble in the Bronx\", I'd heard of Jackie Chan but never seen any of his movies. Well, when I saw this, I practically died laughing. Basically an hour and a half of him bonking people in every direction, the movie is physical humor at its best. The plot has Hong Kong cop Keung (Chan) coming to New York for his uncle's wedding and having to battle street gangs and a crime syndicate. By battle, I of course mean pulling every crazy stunt imaginable. I really liked the early scene in the store, and then the whole hovercraft sequence. I gotta ask: how did we get by before these kinds of movies? There was once a time when movies all followed the Disney formula, and Jackie Chan-style plots were unfathomable. Thank God for Bruce Lee! As it is, Jackie Chan often seems to be spoofing Bruce Lee. Hilarious.",
         "I've read reviews from a number of people who were fans of Jackie Chan before he was well known in the west, that express disappointment that Rumble in the Bronx is the film that finally made Chan a household name in America, because they feel the film is quite a come-down from the \"Police Story\" films that formed the main link between Chan and his past before making this film. I must strongly disagree. Yes - the Anglo actors aren't very good; the plot is silly at times; the dialog is weak, some of the characters are unbelievable. But there's seems no question that the stunt-work is excellent, and the fight scenes are excellent - these really form the reason for making the film in the first place. Furthermore, I think that, of all the protagonists he's played, Chan's character here is the closest to being a true hero of the highest caliber - incorruptible, unstoppable, compassionate, smart - if all our heroes were like this, this would be a different world; if we were all like this, it would be heaven. And I'm not getting all that ironic here - I sincerely mean that Chan returns a kind of virtuous character to the silver screen, that hasn't been seen for a very long time. Consequently, despite occasional violence, I would not stop children from seeing this film - I would encourage them to do so. They can learn a lot about ethics and character from watching this film - and that is actually quite remarkable, to be able to say that of a Martial Arts film.",
         "Watch it for the great action, great stunts and hilarious comedy. You can attack this movie from many different levels. The acting ranges from bad to horrendous, and so is the dialogue and dubbing. But even things like that add to the film's comic elements. When you're not laughing with the film, you're laughing at it. If you're a fan of most of Jackie Chan's work, like I am, have fun! Plus, that Francoise Yip is really, really hot. My score: 7 (out of 10)",
         "This was the first film I saw of Jackie's (first one released in the US that I can remember despite The Protector and The Big Brawl in the 80s) and I have to say it's a great introduction to Chan's work. The fighting is great and well shot while the stunts are amazing. The humor (a Jackie trademark) is also hilarious. People from the US really don't know what a good martial arts film is. Some have grown up with Bruce Lee and it's appreciated but many of them are constantly renting Van Damme and Steven Segal films (working at a video store, I see it all the time). Seeing someone who really is impressive at martial arts, dosen't need fast cuts and choppy editing, and does his own stunts puts all the Van Damme's and Segal's to shame. Take the warehouse fight for example and compare it to any American martial arts film and you will see the difference. For those who haven't seen this film yet and love martial arts films - rent this movie. For those who have seen it and want to see more Jackie - I recommend Drunken Master I and II (II is very hard to find in the US), The Young Master (great final fight), Who Am I? (unbelieveable stunts), Police Story I, II, and III (all around Jackie Chan films, III is known in the US as just Supercop), Operation Condor (tons of martial arts), and Project A I and II (II is another hard to find one in the US). You may also want to check out Rush Hour and Shanghai Noon - they aren't as good as the ones listed above but they are entertaining and Jackie Chan films nonetheless. As for Rumble In The Bronx, make it your first Chan film.",
         "This movie is spectacular. Jackie Chan going to the Bronx. And man, it's a zoo out there. HAHAHAHAHA!!! His uncle runs a store along with Elaine(Anita Mui,1963-2003) who seems to be a lit bit edgy with Keung(J.C.). Uncle Bill(Bill Tung) shows Keung his new aunt-in-law. Who happens to be Afro-American, who Keung happens to be in such shock, but not uptight about it. Seems like he'll get along with her quite well. Though she was shameless when using the bathroom when the tougher baddies tore the store down. The fight scenes are completely unforgettable, and Keung and the gangs ended working together when one of the gangs was brutally murdered by a tougher group other than themselves. The second best scene was the hovercraft vs. Chan vs. a Lamborgini. The Laborgini may have lost their doors, but the sword laced auto took out that hovercraft easily. The water ski scene was awesome. And in my opinion Chan should try out pro one day. Though Chan is wild and cool, he knows how to have fun here in the U.S.A. Rating 4 out of 5 stars.",
         "This is basically the movie that introduced Jackie Chan to Hollywood and the world to Jackie Chan. It brought the crazy and amazing action and fight sequences from Chan's into the western world of film-making. It makes this movie something fresh and unique, or at least for its time it was. I remember first seeing this movie in the mid-'90's, just before the time it was released as a rental movie. My brother was working in a video-store and had to take a few new video's home with him in order to decide whether or not the video-store should buy this movie for rental purposes. In those days this movie was really something fun and spectacular to watch and shortly afterward Jackie Chan also became a real big and popular movie-star. Way more popular and appreciated as he is now days. What really makes this movie is its action. It's never anything too big, also since the movie is made obviously with a fairly low budget but it's very entertaining and amazing at the same time. Amazing, since obviously no harnesses or cables were used for the fight sequences and stunts. It also resulted in lots of broken bones and other injuries during the production but the end result for the movie is really something great and spectacular looking and is brought very entertainingly by Jackie Chan and director Stanley Tong, who both directed the action sequences together. You should see this movie just purely for its entertaining action, since everything else about the movie is actually quite bad to be honest. It might very well be the Jackie Chan movie with the very best action in it. The movie is a very entertaining one to watch that gets better as it progresses. It's as if the in the first halve tried to be too serious with its approach but in the second halve the gloves are off and the movie becomes truly ridiculously over-the-top and fun at the same time. The best example of this is perhaps the finale sequence in which Chan and his happy friends get the main bad guy with an hovercraft. It's a totally pointless and completely ridicules and also short, rushed done sequence but because of that it at the same time works out very hilarious. I'm still looking for a movie with a better use of the hovercraft than this one! It's hard to really judge the acting in the movie, since all of the actors were dubbed, even the American actors. This gives the movie an even more ridicules feeling and also makes the acting seem as something completely horrible and over-the-top. The movie its story often makes lots of crazy jumps and it perhaps even feel as two totally different scripts that were blend in with each other, with as a result that not everything always makes a whole lot of sense and continuity and character treatments are messy. It perhaps almost seems as if the story was mainly purely there to let the movie feature as many and crazy stunts and fight sequences as possible. The movie is most of the time looking and definitely feeling as a B-movie but in a good way. It's made as an entertaining movie and at entertaining this movie does simply not fail. As long as you don't pay any attention to the story or logical and it's acting or anything else like it, you'll simply enjoy this movie for the entertainment that it brings, with mainly it's over-the-top but absolutely amazing action sequences. 7/10 http://bobafett1138.blogspot.com/",
         "Well here we go once again with the undisputed king of action comedy. The one and only Jackie Chan. While this is nowhere near Chan's best movie we can be grateful for the fact that this is the film that finally gave Chan his much deserved break in the USA. This is the story on Chan's character Keung who comes to the Bronx for his uncle's wedding and ends up caught up in a series of events that involve biker gangs, and diamond robbers. But really none of this matters this is just an excuse for Jackie to show of his amazing action skills (in the fight scenes which he also choreographed), and this he does to his usual amazing standards. There seems to be more edits in the fight scenes that is normal for Jackie but I suspect this might be down to one of two things. One making the film more palatable for a western audience. Or two that Jackie broke his ankle in the filming of this movie. Still tell me the last time you saw a western movie star leap from a roof on to the fire escape of the next building!!! Truly amazing stuff. On the down side the western characters and acting are very wooden but hey just enjoy Chan and hopefully then go seek out his Hong Kong movies.",
         "I'd guess you'd have to call 'Rumble in the Bronx' an extreme example of a guilty pleasure. Though back in the 1990s, it was not my first introduction to Jackie Chan (the inferior 'Supercop' was) it was the one that got me hooked on his work. All the way through this viewing \u0096 the first in many years, the word \"silly\" kept popping up in my mind. It's dialogue, acting, stereotypes and shoddy cop work was so hilariously bad, I could only think this had to be written by someone who's only contact with the U.S.A. involves watching old 1970s cop hour-long dramas. And while some scenes were actually funny (SEE: the wrench threat) some were downright unintentionally funny (SEE: the toddler-toss and the entire closing on the golf course.) Leaving all that negative behind, it was an extreme joy watching Chan perform his own stunts in many, many inventive ways while simultaneously creating a very human and good-hearted character. The stunts were simply amazing and if one were to watch today for the first time, they need to know: he did them all himself, without a green screens, cables, etc. As arrogant as Chan is \u0096 I've read his biography, it's dripping with arrogance, he does have great gifts in originality, showmanship, pride in his work and making sure he never uses traditional American trickery/stunts. (This changes later in his work, when he was forced and got older, but this work and ones around it were all pure Chan.) Synopsis: Good-natured nephew Chan visits NYC and gets thrown in extraordinary circumstances: fighting both gangs and mob bosses while helping 2 women, his Uncle and a handicapped child. All that's irrelevant; what matters is once the action starts, it never lets up. And with an open-mind, what a fun rumble you'll have. Side Note: Wow.. not only was it painful for all the actors to get hurt during production (not to mention the roughly 16 dozen vehicles) it was also gut wrenching to watch the closing credits that showed mostly the unintentional crashes, broken bones, etc. You really have to hand it to the devotion of the crew, cast and Chan. Definitely Chan. My comments about his arrogance does not mean I don't admire the man, especially his extremely poor and underprivileged beginnings to the entertainer he became. He's one of the very few actors/action stars that no matter how incredibly silly his movies look to me \u0096 it has to be a culture thing, it's always a rush to see how long his fight scenes last, how inventive he becomes and simply how exciting they are.",
         "Jackie Chan is, without a doubt, one of the greatest action stars of our time - but that is not all he does, by far. He is the only actor I can think of who has so seamlessly blended heartstopping action with rolling-on-the-floor comedy. However, having seen some of his later work, I must say that in certain respects this movie did not live up to the expectations I had set for Jackie Chan. While the action sequences were excellent, they were a bit sparse, and there was too much plot between them. Normally that wouldn't be something to complain about too much, but in this case the plot was almost nonexistent. I've decided that the movie was basically an excuse for two big scenes: the kung-fu battle with the gang, and the hovercraft scene. There were several scenes in the movie which had me laughing out loud - the kind of clever humor and subtlety that has become Jackie Chan's trademark. But during a great portion of the movie, I was scratching my head wondering where that refreshing humor had gone. Some scenes were just too serious for a Jackie Chan movie. All that said, I really did enjoy the movie, and would give it 6 stars out of 10. The action sequences did have me on the edge of my seat, and the funny parts did have me laughing. I won't say that it was Jackie Chan's best work, but it was certainly enough to get him onto the American radar, and I'm very glad that that's where he is now. So I would recommend seeing this movie, but if someone were seeing their first Jackie Chan movie, I would recommend something else, possibly starting with a newer, non-dubbed American film first."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Golden Harvest Company",
         "Maple Ridge Films",
         "Toho-Towa"
      ],
      "summaries": [
         "Keong comes from Hong Kong to visit New York for his uncle's wedding. His uncle runs a market in the Bronx and Keong offers to help out while Uncle is on his honeymoon. During his stay in the Bronx, Keong befriends a neighbor kid and beats up some neighborhood thugs who cause problems at the market. Meanwhile, one of those petty thugs in the local gang stumbles into a criminal situation way over his head. Blinded by greed, his involvement draws his gang, the kid, Keong, and the whole neighborhood into a deadly crossfire. When the lazy cops fail to successfully resolve matters, Keong takes things into his own hands. Needless to say, much spectacular kung-fu and outrageous action sequences follow....",
         "A young man visiting and helping his uncle in New York City finds himself forced to fight a street gang and the mob with his martial art skills."
      ],
      "budget": 7500000
   },
   "movielensId": 112,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English"
      ],
      "releaseDate": "1995-01-30",
      "dvdReleaseDate": "1997-06-24",
      "directors": ["Stanley Tong"],
      "runtime": 91,
      "movieId": 112,
      "title": "Rumble in the Bronx",
      "mpaa": "R",
      "actors": [
         "Jackie Chan",
         "Anita Mui",
         "Françoise Yip",
         "Bill Tung",
         "Marc Akerstream",
         "Garvin Cross",
         "Morgan Lam",
         "Kris Lord",
         "Carrie Cain-Sparks"
      ],
      "imdbMovieId": "0113326",
      "originalTitle": "紅番區",
      "genres": [
         "Crime",
         "Action",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["q7vg8uGzLts"],
      "plotSummary": "Keong comes from Hong Kong to visit New York for his uncle's wedding. His uncle runs a market in the Bronx and Keong offers to help out while Uncle is on his honeymoon. During his stay in the Bronx, Keong befriends a neighbor kid and beats up some neighborhood thugs who cause problems at the market. One of those petty thugs in the local gang stumbles into a criminal situation way over his head.",
      "tmdbMovieId": 33542,
      "avgRating": 3.39901,
      "releaseYear": "1995",
      "numRatings": 13383,
      "posterPath": "/y7AxKPPCtZyrGQKvxzn5zTQ8wFm.jpg"
   }
}