{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "graduation",
            "id": 3687
         },
         {
            "name": "beer",
            "id": 4552
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "drunk",
            "id": 40879
         },
         {
            "name": "roller coaster",
            "id": 156768
         },
         {
            "name": "keg",
            "id": 204151
         }
      ],
      "imdb_id": "tt0116422",
      "video": false,
      "title": "Glory Daze",
      "recommendations": [
         61418,
         15513,
         25576,
         157036,
         78411,
         265347,
         51321,
         18856,
         112969,
         17140,
         43015,
         76297,
         241432,
         189755,
         285844,
         238622,
         40506,
         41587,
         90953,
         188507
      ],
      "backdrop_path": "/cB7wC5BWjmfA1lvV7ln8Uh0USF8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e0463d9",
               "name": "Ben Affleck",
               "profile_path": "/lowyjtC3tZcNEGrxCGoEwjqgdvk.jpg",
               "id": 880,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Chelsea",
               "gender": 1,
               "credit_id": "52fe450fc3a368484e0463f5",
               "name": "Alyssa Milano",
               "profile_path": "/5ddv9PnPeuoYXzXIbBjREU41K4z.jpg",
               "id": 24967,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rob",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e0463dd",
               "name": "Sam Rockwell",
               "profile_path": "/mEH7nCaG75XNkoFbp3MIwCbIZb6.jpg",
               "id": 6807,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Joanie",
               "gender": 0,
               "credit_id": "52fe450fc3a368484e0463e1",
               "name": "Megan Ward",
               "profile_path": "/tkdBrtF2uq5v9d2g32JRnoKQFji.jpg",
               "id": 64999,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e0463e5",
               "name": "French Stewart",
               "profile_path": "/8IpVIyRvwRAeWjsGtM7eAcZlj4t.jpg",
               "id": 67711,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Slosh",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e0463e9",
               "name": "Vien Hong",
               "profile_path": null,
               "id": 95852,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mickey",
               "gender": 0,
               "credit_id": "52fe450fc3a368484e0463ed",
               "name": "Vinnie DeRamus",
               "profile_path": null,
               "id": 95853,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dina",
               "gender": 1,
               "credit_id": "52fe450fc3a368484e0463f1",
               "name": "Kristin Bauer van Straten",
               "profile_path": "/8k7M0Y6r28tSQ9ysxeiYS5Q7m1t.jpg",
               "id": 90658,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Luther",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e0463f9",
               "name": "John Rhys-Davies",
               "profile_path": "/dvT1NPY8CXIVQh0O1h6rpfYOgKz.jpg",
               "id": 655,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Stew",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e0463fd",
               "name": "Lance Wilson-White",
               "profile_path": null,
               "id": 95854,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Doc",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e046401",
               "name": "Tegan West",
               "profile_path": null,
               "id": 56785,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Flunky",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e046409",
               "name": "Sean Whalen",
               "profile_path": "/lyuTKNHGCZueuIu7iBt6COzqIBj.jpg",
               "id": 9996,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Graduation Woman",
               "gender": 0,
               "credit_id": "52fe450fc3a368484e04640d",
               "name": "Christine Klotz",
               "profile_path": null,
               "id": 95855,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Crazy",
               "gender": 0,
               "credit_id": "52fe450fc3a368484e046411",
               "name": "Chris Slater",
               "profile_path": null,
               "id": 95856,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Jack's Mom",
               "gender": 1,
               "credit_id": "52fe450fc3a368484e046415",
               "name": "Elizabeth Ruscio",
               "profile_path": "/1hFtaKTo36a9rUsnnIFcvz0jJIJ.jpg",
               "id": 95857,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Jack's Dad",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e046419",
               "name": "Spalding Gray",
               "profile_path": "/xXUGK1bQRi6vBT8Xu0NsShIEKRe.jpg",
               "id": 8978,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Doug",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e04641d",
               "name": "Brendan Fraser",
               "profile_path": "/n8VOWXp94nhIEo5nS9o6bOpUHiN.jpg",
               "id": 18269,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Theresa",
               "gender": 1,
               "credit_id": "52fe4510c3a368484e046421",
               "name": "Leah Remini",
               "profile_path": "/bb8HtfAJQSUt0KPwhd46sZ7yupX.jpg",
               "id": 15050,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "The Bus Driver",
               "gender": 0,
               "credit_id": "52fe4510c3a368484e046425",
               "name": "Jay Lacopo",
               "profile_path": "/2WmwSaKFvhBD45ZzOQejDcewyhH.jpg",
               "id": 95858,
               "order": 19
            },
            {
               "cast_id": 25,
               "character": "Dina's Boyfriend",
               "gender": 2,
               "credit_id": "52fe4510c3a368484e04642d",
               "name": "Michael Stephen Ferrari",
               "profile_path": null,
               "id": 95861,
               "order": 21
            },
            {
               "cast_id": 26,
               "character": "Joanie's Mom",
               "gender": 1,
               "credit_id": "52fe4510c3a368484e046431",
               "name": "Mary Woronov",
               "profile_path": "/s2bYX2L2WYRXw1feRBKpRITDJQZ.jpg",
               "id": 100552,
               "order": 22
            },
            {
               "cast_id": 27,
               "character": "The Comic Strip Groupie",
               "gender": 1,
               "credit_id": "52fe4510c3a368484e046435",
               "name": "Meredith Salenger",
               "profile_path": "/5KPSGIuTE9lVLsL8rMoxnkn28Fa.jpg",
               "id": 18706,
               "order": 23
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 2,
               "credit_id": "59e392f59251410b6700026e",
               "name": "Matt Damon",
               "profile_path": "/elSlNgV8xVifsbHpFsqrPGxJToZ.jpg",
               "id": 1892,
               "order": 24
            },
            {
               "cast_id": 29,
               "character": "",
               "gender": 2,
               "credit_id": "59e392f59251410b67000270",
               "name": "Matthew McConaughey",
               "profile_path": "/jdRmHrG0TWXGhs4tO6TJNSoL25T.jpg",
               "id": 10297,
               "order": 25
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe450fc3a368484e0463cf",
               "name": "Rich Wilkes",
               "profile_path": null,
               "id": 53345,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe450fc3a368484e0463d5",
               "name": "Rich Wilkes",
               "profile_path": null,
               "id": 53345,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.543704,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26626,
      "vote_count": 17,
      "budget": 0,
      "overview": "It's punk rock meets Animal House in this campus comedy that stars Ben Affleck as Jack, a soon-to-be graduate who finds he's having a difficult time letting go of the college life -- and decides maybe he doesn't have to. Also questioning whether there's life after college are Jack's roommates: Rob, who fears domestication; comic-strip artist Mickey, who's shy around girls; intellectual party animal Slosh; and perpetual student Dennis.",
      "similar": [
         86838,
         8363,
         193893,
         9424,
         19053,
         9777,
         107811,
         15037,
         1586,
         2048,
         281,
         3597,
         2770,
         20453,
         52449,
         9352,
         634,
         4638,
         195589,
         376659
      ],
      "original_title": "Glory Daze",
      "runtime": 100,
      "poster_path": "/aZMYmtjim90B5ifnkHPUAVyfQ5L.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Woodward Productions",
            "id": 39526,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Weiny Bro Prods.",
            "id": 39527,
            "origin_country": ""
         }
      ],
      "release_date": "1995-10-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "True or False.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rich Wilkes"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Rich Wilkes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116422/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzMTcxNjA0M15BMl5BanBnXkFtZTcwMDE3MTYxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Affleck, Sam Rockwell, Megan Ward | See full cast and crew »"],
      "reviews": [
         "I absolutely adore this film. I bought it after getting my hands on the soundtrack, which is also awesome, and it really hit the spot. Like many people have said before, if you've ever been in a similar situation, this film will resonate deeply! It really is intriguing to read reviews from people who hated it. Obviously that makes just as much sense as people who loved it, not everyone can relate to the story or understand the journey, but i wouldn't want people to be put off from seeing it purely on the strength of the negative reviews. Great performances from the whole cast, perfectly balanced with a brilliant punk soundtrack. A real gem.",
         "I'm a big fan of the examination of teens and young adults (being a teenager myself) and Glory Daze is a great story of a group of best friends on the eve of adulthood and how basically all of them are terrified of moving on from college and into the real world. During the movie we discover the various characteristics, interests, styles, dreams and aspirations of the various leading characters. Their stories intertwine, and involve each other in some way. All of the plots involved in Glory Daze are simple, but flow smoothly and steadily in the backdrop of campus parties and bonfires. The acting is superb and the cast is simply perfect(of course it's better to watch the movie now when most of the actors (Ben Affleck, Sam Rockwell, and French Stewart) all become more well known names. All of them are perfect in their roles as bewildered college students. I love the end of the movie (but I won't spoil anything). I recommend this movie to anyone, especially teenagers, who just want to watch a movie about the fun and anxiety of the last days of real youth. 9/10. I also recommend Dazed And Confused, a great teen movie.",
         "Honestly, much better than I was expecting. Without close examination of this movie's characters and their development, your average watcher would write this movie off as standard party movie genre with no heart or empathy. But, as a fan of this film, I've grown to see it for what it most likely was intended to be...a pleasant, relatable buddy flick whose characters could have only been based almost entirely on personal relationships. Questions we've all asked ourselves, and conversations we've all had exist in this film, in a non-figurative way. Growing up, and out of your comfort zone is all too common of a post adolescent's defining hour and that is exactly what this movie explores. The music and sense of humor in Glory Daze are proof of a personal reliance towards the materiel and not just some A-hole producer/director trying to cash in on the maturing sentiment. Some might not be able to relate to it because of its seemingly personal aim, have you a \"too serious metal dude\" or...well, a girl, but I think that for your average free thinker, its an easy to connect with. I'll keep it short. I'm gonna end with Kevin Smith on this one, I like Affleck, cause he's just a good dude, and so it seems are the rest of the cast and those involved in the creation of Glory Daze. Good dudes, who think, what more could you honestly ask from this movie?",
         "Ah, what a wonderful little gem \"Glory Daze\" is. Everyone extols the virtues of \"Animal House,\" calling it the greatest college comedy ever, but for my generation of college students, I bet \"Glory Daze\" would be seen as a far better film (if only people would SEE it). Ben Affleck is great in his portrayal of Jack, the ultimate purveyor of suburban angst. His scene with the jokester passing out graduation gowns is priceless, as is the confrontation on the bus with Brendan Fraser and Leah Remini. He gives a most memorable performance. The best thing about \"Glory Daze\" is its honesty; even the tough, angry Jack breaks down when it comes to love. even he still seeks his \"funny s**t\". Give this one a chance; any college student should relate (especially those male ones who are free of the fraternity lifestyle).",
         "Any one who a had a social life as a student at U.C. Santa Cruz, will love this movie. This movie was very poignant for me having spent my own college years doing the same exact stuff portrayed in the movie. It has just really helped me (nearly 10 years later) to find a bit of closure with what the heck happened back then during the greatest time of my life! I feel the acting was genuinely good. Ben really made the best out of this role. I can tell that the writer/director banged out enough background info. for the actors, so that they could know exactly how their characters should act. I love the scenes of Santa Cruz and especially liked the bus scene between Ben Affleck, Lhea Remini, and Brendan Frasier. Not only was Brendan dressed like I was back then, but I swear, I think, I had a convo. on the bus with a girlfriend while waiting for the damn train to pass, too. Yeah, every bus ride was an adventure! There is a strong moral in the movie, it's hard to find but it can be gleaned from any college graduate. Freedom from Fear leads to a Fear from Freedom. As for any banana slugs out there, save this movie when your thirty and you'll completely realize why you did what you did, and how Santa Cruz will always be on your mind. That's a good thing I believe, because we lived in a very special place that seems to create amazingly talented and successful people. John Garcia -Class of '95 U.C. Santa Cruz, Oakes College Currently a Certified History Teacher! (Oh yeah, and Alyssa Milano is always so Stunningly Gorgeous!)",
         "You could compare this movie to PCU or Animal House, but that really doesn't do any of those movies justice. PCU and Animal house are very slapstick and obvious, while Glory Daze is more lifelike. The combination of depression, sarcasm, and random Kevin Smith-esque references work well. The rag-tag group of misfits that live at Rancho are all very different characters, but somehow, you can relate to every one of them. 9/10",
         "Remember that one period in your life that you wanted to last forever? Or perhaps that era of your life is now. God, on the outside, \"Glory Daze\" is a crude, depressing movie. However, it is my all time favorite because it is more than just a mere movie. It is what most movie makers dream of making: something entertaining, yet so substantial that you can't help but say \"whoa\" as the impact of what happens hits you. \"Life is ever-changing,\" it says to you, \"and we all try to stop it from changing at some point, but then we realize that we can't and find it better just to move on and continue to live.\"",
         "What do Ben Affleck and Sam Rockwell, have in common? Well, yes, they are all in this movie, but no. They are both now famous, respected actors, and movies like 'Glory Daze' helped shape their careers. The movie, set in the 90′s, follows a group of college students that just might not be ready to let go of the party life. Angst filled, angry, generation xers souped up on pizza and beer that just do not know where to go in life. I mean we can all relate to that right? Admittedly, when these Hollywood superstars made this movie they certainly weren't at their acting peak, but they held their own. Ben Affleck conveys the perfect combination of anger and uncertainty in life, and when you throw in relationship issues he becomes a pretty evolved character. Rockwell, the one with the girlfriend in the movie, faces an issue of every graduating guy in his position, \"do I stick with her and get serious, or do I go get some strange?\" His struggle is uncomfortable to watch, in a good way, especially when Matthew McConaughey makes a cameo showing him what his life could be if it goes terribly wrong. To avoid forming a list here I will just say the others also did a great job playing their parts, especially Slosh (Vien Hong), the former computer geek, current party animal. Unlike some college movies that play off of pretty much every college stereotype, 'Glory Daze' seems more realistic and genuine. I actually found myself believing that these actors could be college students. They looked a bit old, but it was a far cry from the thirty year olds playing high schoolers on 90210. Writer Director Rich Wilkes (Airheads) does an admirable creating believable characters, but does have some trouble with the flow of the story. I did find that I started to lose focus and become bored at times. A movie like this should be almost like the perfect mix tape, you start of strong, drop it down a notch, then right back up. Instead we start of with \"Thunderstruck\" and get twenty minutes of Coldplay, and no one wants that Speaking of mix tapes, 'Glory Daze' has a soundtrack that is filled with that 90′s music that is sure to ignite that nostalgic feeling of \"oh yeah, I remember that \" so sit back, enjoy the ride, and remember how much better things were the 90′s.",
         "Two days before graduation, Jack (Ben Affleck) is having serious doubts about the future. The old gang is breaking up; Rob is moving to LA with his girlfriend; Dennis (French Stewart) is finishing his third degree and going to grad school in Michigan; Slosh has dropped out of school and stays drunk all the time; and Mickey (Vinnie DeRamus) seems tired of the scene and wishes he had the guts to tell his friend Chelsea (Alyssa Milano) how he feels about her. You have to love this incredible cast (including some who went on to much bigger and better things), with some nice cameos from Matt Damon as a hated ex-roommate and Matthew McConaughey as an alcoholic rental truck representative. This is one of the many mid-90s slacker films, alongside \"Stoned Age\", \"Suburbia\" and others. While there is no explanation for Affleck's hairstyle and facial hair, it is nice to see him in this role circa \"Good Will Hunting\". And those who were punks in the 1990s will appreciate the soundtrack: NOFX, Bad Religion, Tilt, The Mr. T Experience, Ednaswap, and Bouncing Souls. Did \"SLC Punk\" have a soundtrack this good?",
         "What a movie !!! Its so cool, funny and intelligent and I love Ben Affleck in this. The movie manages to entertain more that huge movies with millions of dollars in budget. Its very down to earth and has some great moments that leave you happy. The trials and tribulations of the characters are so real and engrossing. I simply love it love it love it. Not one scene is wasted brilliant lines brilliant performances. In its own world and in its own league. I think the trick is that its funny but also nostalgic with a lot of sadness in it. So its a perfect combination. Not to give anything away, watch it if you like to think about your past and reflect on all the good/bad times. Its a treasure of a film. Its sad that not many people know of it. It's one of my favourites."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Weiny Bro Prods.",
         "Woodward Productions"
      ],
      "summaries": ["It's two days before graduation, and Jack is having serious doubts about the future. The old gang is breaking up - Rob is moving to L.A. with his girlfriend; Dennis is finishing his third degree and going to grad school in Michigan; Slosh has dropped out of school and stays drunk all the time; and Mickey, who still has a year of school to go, seems tired of the scene and wishes he had the guts to tell his friend Chelsea how he feels about her. As Jack looks out at his four years in Santa Cruz, he wonders if this isn't the best time of his life, and he wonders whether it might be a mistake to let it all go just because of graduation. As his pals also get glimpses of life after college, he decides he's not going to leave, that he's going to live his glory days a little longer."],
      "budget": 0
   },
   "movielensId": 1121,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-01",
      "dvdReleaseDate": "2003-02-11",
      "directors": ["Rich Wilkes"],
      "runtime": 100,
      "movieId": 1121,
      "title": "Glory Daze",
      "mpaa": "R",
      "actors": [
         "Ben Affleck",
         "Alyssa Milano",
         "Sam Rockwell",
         "Megan Ward",
         "French Stewart",
         "Vien Hong",
         "Vinnie DeRamus",
         "Kristin Bauer van Straten",
         "John Rhys-Davies",
         "Lance Wilson-White",
         "Tegan West",
         "Sean Whalen",
         "Christine Klotz",
         "Chris Slater",
         "Elizabeth Ruscio",
         "Spalding Gray",
         "Brendan Fraser",
         "Leah Remini",
         "Jay Lacopo",
         "Michael Stephen Ferrari",
         "Mary Woronov",
         "Meredith Salenger",
         "Matt Damon",
         "Matthew McConaughey"
      ],
      "imdbMovieId": "0116422",
      "originalTitle": "Glory Daze",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["3owAhQbgGW0"],
      "plotSummary": "It's punk rock meets Animal House in this campus comedy that stars Ben Affleck as Jack, a soon-to-be graduate who finds he's having a difficult time letting go of the college life -- and decides maybe he doesn't have to. Also questioning whether there's life after college are Jack's roommates: Rob, who fears domestication; comic-strip artist Mickey, who's shy around girls; intellectual party animal Slosh; and perpetual student Dennis.",
      "tmdbMovieId": 26626,
      "avgRating": 2.85606,
      "releaseYear": "1995",
      "numRatings": 132,
      "posterPath": "/aZMYmtjim90B5ifnkHPUAVyfQ5L.jpg"
   }
}