{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Ratliff"],
      "runtime": 0,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114147/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5MDAwNDE5N15BMl5BanBnXkFtZTcwNjEwMDcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mavis Beslile, Bruce Friedrich, Charles Johnson III | See full cast and crew »"],
      "reviews": [
         "This movie is sheer genius. Like Roger Moore at his best, this documentary lets people tell their own amazing story - in this case, the story of how a small city learns to accept the horrifically unacceptable and incorporate it into their everyday lives. Unlike Roger Moore's flicks, which to me often elicit laughs from a position of judgmental superiority, Ratliff's movie is full of heart and soul and the poignant humor that comes from recognizing our universal vulnerability to the human ability to adapt, even to what is essentially insane. Aside from the core message, it's a delightful foray into the world of Amarillo's fascinating and sometimes eccentric townsfolk - as local Stan Marsh says, \"it's the wind that makes us crazy.\"",
         "It's not clear what the point of this video is. Although representatives of both Pantex and protesters are interviewed, the director prefers to interview local eccentrics at great length. How is an Amarillo man's trips to various countries relevant to the storage of disassembled nuclear weapons? I have met an eccentric like him in another town; does it prove something about the nature of the town? Consider that Amarillo has a population of 200,000! It seems like the creator wanted to create a cartoonish image of thousands of ignorant locals and an evil corporation that manipulates them. The documentary presents no evidence that this is the reality of the situation. I'm sure the good people of Amarillo consider the town portrayed in this video to be unrecognizable.",
         "I remember watching this film when it first came out in 1995. In spite of the serious subject matter, the film has many hilarious moments. I was laughing to the point of tears and had never laughed so much in my life! Stanley Marsh 3 (of Cadillac Ranch fame) sort of steals the show, along with another wealthy Amarillian(?) whose name escapes me (the latter was actually the funniest person in the film, I thought). The film does discuss what could potentially happen with all that weapon-grade plutonium sitting in bunkers. I suppose Stanley Marsh 3's antics are not so out-of-place, when one considers how to cope with all that stuff sitting almost underneath a fair-sized city. I guess the film never made it onto commercially-available video, which is too bad. I never heard any more about it after its initial run at the Dobie Theater here in Austin TX. I vaguely remember hearing about Stanley Marsh 3's shenanigans landing him in trouble, and the film's release was tied up in the process."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["Funny yet incisive look at the PANTEX Nuclear Weapons Plant, in Amarillo, TX, which was used for nuclear weapons assembly during the Cold War. The plant, which provides most of the jobs for those living in Amarillo, now operates as a disassembly-line where the weapons, which were once built there, are now being taken apart with the plutonium getting stored underground. The film deals with the issues of storing the plutonium and the effects the plant has had (and is having) on the town of Amarillo, as well as how it has affected the way people thought about the Cold War and its aftermath. It does so by taking a look at the lives and activities of the Amarillo residents directly or indirectly associated with, or having strong opinions about the Plant."],
      "budget": 0
   },
   "movielensId": 1122,
   "movielens": {
      "languages": [""],
      "releaseDate": null,
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 1122,
      "title": "Plutonium Circus",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0114147",
      "originalTitle": "Plutonium Circus",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Funny yet incisive look at the PANTEX Nuclear Weapons Plant, in Amarillo, TX, which was used for nuclear weapons assembly during the Cold War. The plant, which provides most of the jobs for those living in Amarillo, now operates as a disassembly-line where the weapons, which were once built there, are now being taken apart with the plutonium getting stored underground. The film deals with the issues of storing the plutonium and the effects the plant has had (and is having) on the town of Amarillo, as well as how it has affected the way people thought about the Cold War and its aftermath. It does so by taking a look at the lives and activities of the Amarillo residents directly or indirectly associated with, or having strong opinions about the Plant.",
      "tmdbMovieId": 470646,
      "avgRating": 2.65909,
      "releaseYear": "",
      "numRatings": 22,
      "posterPath": null
   }
}