{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "election",
         "id": 15134
      }],
      "imdb_id": "tt0117320",
      "video": false,
      "title": "A Perfect Candidate",
      "recommendations": [],
      "backdrop_path": "/iYoo3QvW8BHKxoW9CNCl6FVlrdt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4ab6c3a368484e162eeb",
               "name": "Oliver North",
               "profile_path": "/mcxq09F4CV7b7e82K4iQ9fc0rX6.jpg",
               "id": 167494,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "5330fe85c3a3686a9d000d9a",
               "name": "Mark Goodin",
               "profile_path": null,
               "id": 1304440,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "5330fe94c3a3686a9d000da0",
               "name": "Bill Clinton",
               "profile_path": "/xvAI4AFNFOSblUzLQ5FshY0srAj.jpg",
               "id": 116341,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "5330febdc3a3686aaf000d86",
               "name": "Chuck Robb",
               "profile_path": null,
               "id": 1304441,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ab6c3a368484e162ee1",
               "name": "R. J. Cutler",
               "profile_path": "/h0iDBlVu1uhvhbsOGeWE4sPeMJK.jpg",
               "id": 89814,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ab6c3a368484e162ee7",
               "name": "David Van Taylor",
               "profile_path": null,
               "id": 621628,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.153959,
      "production_countries": [],
      "id": 124837,
      "vote_count": 2,
      "budget": 0,
      "overview": "The filmmakers follow Oliver North's unsuccessful 1994 bid for a Virginia Senate seat, focusing on North's campaign strategist, Mark Goodin, and a Washington Post reporter. Mudslinging ensues.",
      "similar": [
         434178,
         403285,
         10316,
         33792,
         84334,
         9386,
         9451,
         10139,
         982,
         13003,
         421851,
         439128,
         58383,
         37722,
         391088,
         479426,
         440858,
         56156,
         66775,
         22479
      ],
      "original_title": "A Perfect Candidate",
      "runtime": 105,
      "poster_path": "/mk9i91EJ4bDtuQ11xQy4G0vLHFP.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-06-19",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "In the Voting Booth, No One Can Hear You Scream",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "R.J. Cutler",
         "David Van Taylor"
      ],
      "runtime": 105,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117320/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzMjgyMjI2N15BMl5BanBnXkFtZTcwMzg1NTUyMQ@@._V1_SY317_CR17,0,214,317_AL_.jpg",
      "actors": ["Stars: Don Baker, Mark Goodin, Mark Merritt | See full cast and crew »"],
      "reviews": [
         "When I was a little kid I used to be in awe when a president's speech was broadcast on TV. I did not watch the speeches (what child would?) but I was struck by a feeling that they were extremely important. Decisions were being set in motion, I thought. So when I grew up I was surprised to realize that all along it had only been a bunch of hot air. This movie is a document of such hot air. A behind the scenes documentary of a '94 Senate race in Virginia, A Perfect Candidate is both funny and depressing. If you have any hope left that your vote counts for something, that optimism may be destroyed after seeing this movie. It's Oliver North against Chuck Robb. Robb comes off as very dull/awkward. There is an amazing moment when a reporter asks him if he is in favor of replacing striking workers at factories. Robb says his position on that issue has not changed. So you're in favor of strike worker replacement? \"No.\" You're against it? \"I did not say that.\" Robb then offers a reply which completely dodges the question and walks off. North is a smoother politician, but you still don't trust his smile. He makes the requisite church appearance, endorses Jesus, and tells the people it's such a relief to talk about something besides politics-as if his running for Senator has nothing to do with why he is speaking at this church. I only came here this morning because I'm Christian just like you, he wants them to believe. We see North tell college students that he never lied to congress. When asked how he feels about the potentially racist implications of flying a Confederate flag, North makes the suspicious claim that he recently saw Robb wearing a Confederate necktie. As this happens a reporter backstage tells a North strategist that this claim sounds fishy, North's helper responds with a shrug. Apparently he's not the least bit disturbed that his candidate may have just told a blatant lie. There is a lot of footage of North's campaign strategists. At one point we see one person privately admitting that politics only offer entertainment. But \"what we are not offering are solutions...not us, not not anybody.\" It's almost refreshing for somebody to come right out and admit it. If you are tired of two-faced politicians and their ever-present vague promises of \"change\", you need to track this movie down. It is honest, and good for a laugh.",
         "A Perfect Candidate looks at the 1994 Virginia Senate race between Democratic incumbent Chuck Robb and Republican Oliver North of Iran-Contra fame. Robb was plagued by alleged incidents about his past involving a Playboy model, cocaine, New York hotel rooms, wild parties, etc... and in addition his fellow Democrat and (at the time) political enemy, ex-Governor Douglas Wilder, was also running for the seat. And also under the surface was the national surge of the Republican party which was about to take control of the House of Representatives for the first time since the 1950's. So, Robb should have lost, and why and how he didn't is what this documentary shows us. The fight between Robb's and North's campaigns focused mainly on who could better destroy the other one. Robb's personal lapses contrasted against Norths' lying to Congress and his dealings with numerous questionable figures. He cloaked it all in a patriotic fight against communism, and became a favorite of the extreme right, while alienating more moderate possible supporters. In this documentary, with plenty of footage of the campaign, neither candidate seemed worthy of anyone's vote, with it's footage of Robb dancing around direct questions and claiming he had never told a lie in his life, and North courting the hard right.",
         "The filmmakers follow Oliver North's unsuccessful 1994 bid for a Virginia Senate seat, focusing on North's campaign strategist, Mark Goodin, and a Washington Post reporter. Mudslinging ensues. The election was 1994, the film was made in 1996, and I watched it in 2013. As I could not vote until 1999 and am not from Virginia, this story is a little bit foreign to me. Of course I know who Oliver North is. Even those who do not know what Iran-Contra was have at least heard of it. The scandal has haunted and will continue to haunt North, and was a good part of why he did not make it to the Senate (though he did better than you might think). The film works as a look back at politics and campaigns in the 1990s, and how they have changed. Even more interesting is how since this setback, North went on to reinvent himself (again) as a news commentator.",
         "A Perfect Candidate is an interesting and thought provoking documentary on the Senate race between Republican Oliver North (of Iran Contra fame) and scandal tarred incumbent Deomcrat Chuck Robb. The movie tries to make the case that no matter what your positions are on the issues it is better to vote for someone who is a ideologue than a moderate. It demeans the very notion of someone who may be conservative on some issues and liberal on others. Before that it is a celebration of Oliver North because of his perfect conservatism. When North starts to make mistakes and Robb starts tearing into him the movie becomes more interesting because the filmmakers obviously never thought Robb could win re-election. The great thing about this documentary is all of the scenes with Douglas Wilder. He was the first black governor of Virginia and ran as an independent in the Senate race for a while. The racial issues explored is the main reason why this is worth getting."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Arpie Films"],
      "summaries": ["The filmmakers follow Oliver North's unsuccessful 1994 bid for a Virginia Senate seat, focusing on North's campaign strategist, Mark Goodin, and a Washington Post reporter. Mudslinging ensues."],
      "budget": 0
   },
   "movielensId": 1123,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-06-19",
      "dvdReleaseDate": "2004-04-20",
      "directors": [
         "R. J. Cutler",
         "David Van Taylor"
      ],
      "runtime": 105,
      "movieId": 1123,
      "title": "A Perfect Candidate",
      "mpaa": "",
      "actors": [
         "Oliver North",
         "Mark Goodin",
         "Bill Clinton",
         "Chuck Robb"
      ],
      "imdbMovieId": "0117320",
      "originalTitle": "A Perfect Candidate",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The filmmakers follow Oliver North's unsuccessful 1994 bid for a Virginia Senate seat, focusing on North's campaign strategist, Mark Goodin, and a Washington Post reporter. Mudslinging ensues.",
      "tmdbMovieId": 124837,
      "avgRating": 3.60465,
      "releaseYear": "1996",
      "numRatings": 215,
      "posterPath": "/mk9i91EJ4bDtuQ11xQy4G0vLHFP.jpg"
   }
}