{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "lake",
            "id": 1889
         },
         {
            "name": "son",
            "id": 5153
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "family holiday",
            "id": 33694
         },
         {
            "name": "family conflict",
            "id": 155294
         },
         {
            "name": "old age",
            "id": 211660
         }
      ],
      "imdb_id": "tt0082846",
      "video": false,
      "title": "On Golden Pond",
      "recommendations": [
         488,
         25431,
         11050,
         13665,
         874,
         2075,
         3116,
         22414,
         16769,
         3110,
         1879,
         11558,
         16619,
         5919,
         19429,
         2039,
         10671,
         18254,
         10236,
         16520
      ],
      "backdrop_path": "/5iU8AVqS4vAD8YPdofPm3ZXYPMr.jpg",
      "revenue": 19255967,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ethel Thayer",
               "gender": 1,
               "credit_id": "52fe448b9251416c75038731",
               "name": "Katharine Hepburn",
               "profile_path": "/ieGNYekIGc5R16cYmIzzyo59Lfz.jpg",
               "id": 6598,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Norman Thayer Jr.",
               "gender": 2,
               "credit_id": "52fe448b9251416c75038735",
               "name": "Henry Fonda",
               "profile_path": "/jNLuMWW7SpSeGMUP5qxOAtg0Ryr.jpg",
               "id": 4958,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Chelsea Thayer Wayne",
               "gender": 1,
               "credit_id": "52fe448b9251416c75038739",
               "name": "Jane Fonda",
               "profile_path": "/y1QtAxHn8XOi4cHzDRJUuvK3aFp.jpg",
               "id": 6352,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Billy Ray",
               "gender": 2,
               "credit_id": "52fe448b9251416c7503873d",
               "name": "Doug McKeon",
               "profile_path": "/xRRbS5Cj11PMXIKw6bKt96EqYCn.jpg",
               "id": 70569,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Bill Ray",
               "gender": 2,
               "credit_id": "52fe448b9251416c7503876b",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c75038743",
               "name": "Mark Rydell",
               "profile_path": "/j7JuFKjL3iKeXdYVJILd6MFlVJA.jpg",
               "id": 21958,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c75038749",
               "name": "Ernest Thompson",
               "profile_path": null,
               "id": 70570,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c7503874f",
               "name": "Bruce Gilbert",
               "profile_path": null,
               "id": 14841,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c75038755",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c7503875b",
               "name": "Billy Williams",
               "profile_path": null,
               "id": 11848,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c75038761",
               "name": "Robert L. Wolfe",
               "profile_path": null,
               "id": 13721,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c75038767",
               "name": "Ernest Thompson",
               "profile_path": null,
               "id": 70570,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "569173a692514179b30008ec",
               "name": "David M. Ronne",
               "profile_path": null,
               "id": 1551213,
               "department": "Sound",
               "job": "Production Sound Mixer"
            },
            {
               "gender": 2,
               "credit_id": "569173ba925141799e00089b",
               "name": "Marshall Schlom",
               "profile_path": "/9VbB4cL2H1dMbsqQzd51R4IrhPY.jpg",
               "id": 559913,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "569173d3c3a36802e2000882",
               "name": "Dorothy Jeakins",
               "profile_path": null,
               "id": 29800,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "569173de92514179b3000901",
               "name": "Stephen B. Grimes",
               "profile_path": null,
               "id": 10641,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "569173e9c3a36802ef000849",
               "name": "Jane Bogart",
               "profile_path": null,
               "id": 1424530,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5691740a92514179ac0008ed",
               "name": "Dianne Crittenden",
               "profile_path": null,
               "id": 1221,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5691741592514179a0000adf",
               "name": "Barry Primus",
               "profile_path": "/A5Uqoi17cM2DeNlxV5livnuUX7c.jpg",
               "id": 73194,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56917464c3a36802ef000866",
               "name": "Adger W. Cowans",
               "profile_path": null,
               "id": 1534521,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "5691747592514179b3000920",
               "name": "Richmond L. Aguilar",
               "profile_path": null,
               "id": 1164426,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 2,
               "credit_id": "569174bd92514179a3000855",
               "name": "James A. Contner",
               "profile_path": null,
               "id": 104876,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "569174e0c3a36802e20008cc",
               "name": "Else Blangsted",
               "profile_path": null,
               "id": 1560854,
               "department": "Sound",
               "job": "Music Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 8.129084,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11816,
      "vote_count": 133,
      "budget": 0,
      "overview": "For Norman and Ethel Thayer, this summer on golden pond is filled with conflict and resolution. When their daughter Chelsea arrives, the family is forced to renew the bonds of love and overcome the generational friction that has existed for years. Norman must find his way through his anger and fear of growing old, while Chelsea struggles to rebuild their relationship. Ethel's consistent support of her \"Knight in shining armor\" is inspirational in its simplicity. This is a movie to ponder and always keep in your heart.",
      "similar": [
         8545,
         49519,
         88,
         773,
         13,
         334,
         112160,
         634,
         7972,
         293768,
         342878,
         11631,
         35,
         329103,
         10999,
         2539,
         10559,
         2698,
         5693,
         103663
      ],
      "original_title": "On Golden Pond",
      "runtime": 109,
      "poster_path": "/6eurFv9VjqJ35PyIc2H35C0Fyca.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1981-12-04",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "when life is at its finest...when love is at its fullest...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Rydell"],
      "runtime": 109,
      "synopsis": "On the beautiful Golden Pond (really Squam Lake in Holderness, New Hampshire), elderly couple Ethel and Norman return to their summer cottage, where Ethel is immediately thrilled to hear the loons welcoming them back, although Norman claims he can hear nothing. They proceed to uncover the furniture and open the windows, while Normans failing memory reveals the onset of his senility. Ethel is more energetic and lucid, joking that they are only in late middle age since she is still in her 60s and hes still in his 70s. Norman expresses a certain preoccupation with dying, having retired as a college professor many years earlier. The couple take a canoe ride on the lake and are both quite excited to see loons on the water, when suddenly a speed boat disturbs their peace, prompting them to flash their middle fingers and yell at the boater. When they later gas up their motorboat, Norman confronts some teenagers who mildly ridicule him for being old. Thereafter, Ethel sends Norman out to pick strawberries nearby. While Norman is on his walk he becomes disoriented and scared, wandering off the trail and into the woods. After a short run that causes him to pant heavily, he finds his way back to the cottage without giving Ethel any suspicions of the incident. Norman settles down to read the baseball reports in a newspaper while Ethel reads aloud from a letter, in which their daughter Chelsea announces that she will soon be visiting with her new boyfriend, who is a dentist. They talk with the local postman who tells them that one of the oldest local residents, whom Norman suspects was a lesbian, has died at the age of 97, which he suggests is somehow unfair. After the postman leaves, Norman confesses to Ethel that he got lost on his walk and needed to rush back to her. She embraces him and reassures him they will go on that same walk together to regain his memory. He wonders why she loves him so much. Norman puts on a tie to prepare for the visit of his daughter on his 80th birthday, and Ethel cautions him to be nice to Chelsea and her boyfriend. Chelsea greets him by calling him Norman and he refers to her as fat. She then introduces a 13-year-old boy named Billy Ray, the son of her boyfriend Bill Ray, and asks her mother about Normans memory problems. Norman is brusque with Bill, who is clearly not comfortable in the rustic setting given his apprehensions about bears, and they make small talk about aging, with Bill noting that he is now 45. Bill is even more awkward in explaining that hes still recovering from his divorce, and how Chelsea has made his life better. Their friction increases as Bill tells Norman he intends to sleep in the same bed with Chelsea, which Norman sarcastically accepts. Bill tells Norman it will not be easy getting to know him, and he does not want to be taunted. Billy, who is fond of saying the word bullshit, reluctantly agrees to spend time with Norman while Bill watches Chelsea and Ethel skinny-dipping in the pond after dark. Norman asks Billy what he does for fun, and the boy boasts that he sucks face with girls. In response, Norman tells him to go off and read the book 'Treasure Island'. Norman thereafter tells Ethel their daughter plans to sleep with Bill, and she recalls that they did the same thing once. Ethel tells Norman that Chelsea would like to leave Billy with them for a month while she and Bill go to Europe, and he agrees. Later that night they assemble around a large birthday cake and Norman says he has little to say about living for four score years. The next day, after showing off her impressive body by swimming in a bikini, Chelsea is excited to see her old friend the postman, who still nurtures an understandable crush on her. Bill breaks the evident tension by falling into the lake. That evening, everyone but Chelsea plays Parcheesi. She suggests that Norman has a drive to beat people. The next day, Chelsea conveys her tormented feelings about her father to Ethel. Even though she is successful in Los Angeles, he makes her feel inadequate from a distance. Ethel wants her to quit being upset about her childhood, and tells her to move on with her life. After Bill and Chelsea take off for Europe, Billy quickly expresses his contempt about his situation. He suggests hell head out west on his own, but Norman dismisses this foolish idea and tells him to go fishing with him and Ethel. The trio head out on the motorboat; Ethel reads under a parasol while the men fish. Billy later tries to impress them by diving off a dock into the lake, but his attempts are rather sloppy. Some time later, Norman takes Billy out fishing again, explaining that a huge trout lives in the lake that he has been trying to catch for years, which he has nicknamed Walter. Ethel comes by later in a smaller boat and embarrasses them by bringing lunch. Norman catches and reels in a rather large trout, which Billy helps him bring into the boat, although he tells him that Walter is a much larger fish. That night Norman starts a fire in the fireplace that gets out of control, causing Ethel and Billy to put it out. Norman gets upset at Billy, even though he knows the fire was his fault. Ethel asks Billy to have patience with Norman, who is just doing the best he can. On another day, Ethel persuades Norman to let Billy take out the motorboat on his own, and she is then surprised when Norman gives her some immodest kisses. Having gained confidence in Billy, Norman later takes him to a special fishing area called Purgatory Cove, where the rocks eat boats. Billy carefully guides Norman through, even though heavy clouds have darkened the sky. While they are fishing, Norman ponders that he wont be around long enough to catch Walter, and Billy just then catches what he thinks is the treasured fish, only to find it is a dead loon. Billy asks Norman if he is afraid to die, and the old man is resentful to speak about it. Norman then trusts Billy to drive the boat while he guides him out of the rocks. They are moving along well until Billy accidentally accelerates and slams the boat into a rock, launching Norman into the lake. Billy dives in and helps Norman to a rock; Norman, who is bleeding from the head and traumatized, still manages to hang on to Billy and help him cling to the rock. After some hours, Ethel goes to the postman and convinces him to go out into the lake to find Norman and Billy. Spying them hanging onto the rock in Purgatory Cove, Ethel dives off the boat and into the water, swimming out to them. Norman swiftly tells her, You shouldn't be out this late at night. A week goes by in which the men stay indoors, and at last Ethel relents to let them go fishing again. Chelsea then returns, surprised to find that Billy and Norman have gotten along so well. (She comments that Bill is back on the west coast for work.) Chelsea laments that Norman was never her friend like he is with Billy, then quickly announces that she married Bill while in Europe, only she is sure that Norman will not be happy for her, because he is a son of a bitch. Ethel slaps Chelsea across the face, sternly telling her, That old son of a bitch happens to be my husband, motivating Chelsea to run off and jump in the lake. Meanwhile, out on the lake Billy hooks the mythical Walter, and Norman brings him up in a net. Back on shore, Chelsea apologizes to Ethel, and her mother tries to explain that Norman is just a frightened father, and implores her to be more kind. When Billy and Norman return, they are delighted to tell Chelsea how they caught and released Walter, and Billy runs to tell Ethel. Chelsea tells Norman she wants to have more of a father-daughter relationship, that she does not want to be so mad at him, that she wants to be his friend. She agrees to come around more often, and quickly tells him she married Bill. She is shocked that Norman is indeed happy for her, and he suggests that he will enjoy seeing more of Billy. Norman happens to mention that Billy had tried doing a backflip off the dock, and Chelsea proclaims that she could do so much better. Billy and Ethel nervously watch as Norman encourages Chelsea to go through with the dive, and even though she is scared, she clumsily goes heels over head into the water, with elation from all. As Chelsea is packing up the car to leave, Norman gives Billy a cherished fishing rod, and gives her a swimming medal he won in college 60 years earlier. As they depart, she says to Norman, Goodbye... Dad, whereupon they embrace. At the end of the summer, Norman and Ethel are packing up the cottage when he becomes faint after picking up a heavy box, and he collapses to the floor. She runs to get his nitroglycerin, forcing it into his mouth as she fears he will die. She gets the phone and frantically calls the operator for a doctor, but gives up with dread that it wont make a difference. He then surprises her by saying the pain has subsided. She confesses she thought he was really going to die, which gives her very dismayed feelings. He stands up with her help, feeling better. He hears the loons on the lake, who have come to say goodbye. Just two loons, he notices, who may also have kids that have moved away.",
      "writers": [
         "Ernest Thompson",
         "Ernest Thompson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082846/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDg3MTIzMTYxNl5BMl5BanBnXkFtZTcwMjAxNzY0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Katharine Hepburn, Henry Fonda, Jane Fonda | See full cast and crew »"],
      "reviews": [
         "Mark Rydell's On Golden Pond was a surprise hit in 1981, finishing third in box office grosses after Rocky III and E.T. Such an occurrence was unheard of in Hollywood, considering the key players in the film, Henry Fonda and Katharine Hepburn, each had not had a hit film in almost twenty years and were both hardly spring chickens in the business. Both these veteran actors proved they could still make it in Hollywood among young starlets, and triumph. Still, when you see \"On Golden Pond,\" you sense that their teaming together for the first time in their careers is purely a special occasion, an opportunity of a lifetime that few actors in their seventies receive. They in turn have left us with a wonderful showcase of movie talent, a film of warmth, good humor, and love. It always amazes me when I read that Henry Fonda had only received two Oscar nominations during his career, one of which he earned for this film. Like his good friend Jimmy Stewart, Fonda was rarely a boisterous actor. He had a natural ease to his acting, a gift for making audiences believe that every word he uttered was truth. Now, in his final screen performance as Norman Thayer Jr., Fonda had to reach deep into his own personal experience and his advancing years to create a character who struggles with his own mortality. Norman is a grouchy curmudgeon who has memory lapses and heart palpitations. He has a loving and cheerful wife, Ethel (Hepburn), but a difficult relationship with his only daughter, Chelsea (Jane Fonda). He and Ethel journey back to their cottage on the lake for what may be their last summer. Immediately, Norman comes face to face with his old age and his inability to remember what should be familiar sights. I especially like the scene where he gets lost in the woods looking for strawberries and scares himself when he is unable to find his way back. Ethel has such faith in him, sure he will \"get back on that horse\" and be as valiant as he once was. What more could you want from a wife? Chelsea arrives after many years away from her parents, bringing with her a new boyfriend (Dabney Coleman) and his son, Billy (Doug McKeon). You can sense the tension between Chelsea and Norman the minute she walks in the door. This reunion is fascinating not only because we can never tell where the difficulty lies in their relationship, but also the fact that these problems also exist on and off the screen. The father-daughter relationship between Henry and Jane was also very turbulent ever since Jane began her protests in Vietnam, much to the chagrin of her father. This collaboration of the two was meant to mend fences between them. Not often do the personal lives of actors collide so eloquently in Hollywood, but here it seems just about right. The sequence where Norman and Bill (Coleman) attempt to build a conversation is originally conceived and acted so naturally. He carefully asks Norman if it would be alright if Chelsea and he sleep together in the same room at the cottage. Of course, Norman makes this confrontation as difficult as possible, making Bill nervous and jerking him around. Ironically, Bill comes back at him, not allowing Norman to use him in petty mindgames and hoping they would become friends, which is obviously \"not an easy task.\" This is an unsettling turn for Norman and the audience, but it is necessary for the story to progress and for Norman to respond accordingly to the other characters in the story. Ethel and Norman volunteer to let Billy stay with them for the summer while Chelsea and Bill head off to Europe. Billy is not pleased with the arrangement at the outset, but gradually bonds with Norman through learning to fish on the pond. While Billy is not necessarily an original character, it is fascinating to see him try to understand Norman, and in turn how Norman learns to associate with the son he never had. It is a learning experience for both of them, even though they are many generations apart. Many reviewers have remarked that ON GOLDEN POND uses a conventional story and revives it with great performances from the cast. It is interesting to note that the screenwriter, Ernest Thompson, altered his own play in order to escape a bit of the conventionality that the film medium required. The framework may seem as original as an old shoe, but the added touches in the script and its delivery give this film a certain magic that only classical Hollywood films possessed. Fonda has a great way to end a career with this role, placing himself completely within Norman's world and searching within and through the role for his own solutions to life's problems. His Oscar was given to him for more reasons than mere charity. Hepburn is delightful as Ethel, working so well with Fonda that it does not seem as if they are acting. For a couple of old Hollywood actors who never even met before this, they each prove they are true masters of their craft. Jane Fonda takes a supporting role this time, incorporating some of the same motives as her father into her part, and as a result delivers a special performance. Mark Rydell is one of those directors that often gets left off the list of the all-time greats, but proves once again here he is a masterful storyteller. In this project, he allows both the visual elements of the pond and his actors to make magic, a truly memorable combination. On Golden Pond is not an epic, but what it accomplishes runs close to epic proportions. It is very rare that a stageplay converts so well to the screen like this one. On Golden Pond is vibrant, emotional, and so heartfelt, it is impossible not to like, unless you are a curmudgeon like Norman Thayer. It is also unique that great actors such as these will agree to try again for Hollywood glory so late in their careers. It is up to us viewers to experience this wonder before the chance is lost and these thespians finally close up the cottage and head off to their retirement.",
         "\"On Golden Pond\" is simply an old-fashioned testimonial to long-lost youth and facing one's mortality, and, in its simplicity, becomes a life-affirming valentine to those who feel that time has become the enemy - a seemingly ageless, universal perception. If not for the magnificent acting duet between Henry Fonda and Katharine Hepburn, this lovely, sentient piece would have been ignored by most moviegoers. But buoyed by these two acting legends, it manages to circumnavigate the heavy, mawkish waters -- rising far above and beyond anybody's expectation. Earning a whopping ten Oscar nominations, Ernest Thompson's reflective screenplay won one of those Oscars, but, for me, it's Dave Grusin's soothing, glistening score that is the stronger selling point here, adding immeasurably to the film's ruminative tone and gently rustic surroundings. Henry Fonda plays brusque, cantankerous Norman Thayer, a one-time college professor approaching his 80th birthday with a mixture of anger, cynicism and fear as he shows signs of losing his faculties. Norman is not a particularly kind or considerate gent. Abrupt, callous, remote, and ill-equipped to offer nurturing support of any kind, living with Norman must have been quite an ordeal for those growing up under his roof. As a means of self-preservation, their only child, Chelsea, has long estranged herself from the family, unable to emotionally come to terms with her unhappy, unhealthy relationship with her father. Fonda offers the most affecting, endearing performance of his durable career. He manages to use Norman's undesirable traits to his advantage, investing in his character a gruff charm and cynical sense of humor that is totally winning. He melts away the harmful, negative elements, as Carroll O'Connor managed to do for Archie Bunker, and makes Norman not only funny and entertaining, but loveable. As a result, Fonda becomes the glowing centerpiece of `On Golden Pond,' and it is this portrayal, along with his `Grapes of Wrath' Tom Joad, that will remain indelibly etched in our hearts and minds for decades to come. Kate Hepburn is his Ethel, a loving, pragmatic anchor who obviously has played an important role in the lifetime success of this complicated man. Devoted to a tee, Ethel understands and compensates for the weaknesses of her husband. She valiantly assuages his deepening fears with good-natured kidding, feigned hopelessness, and careful but subtle guidance. She is Dulcinea to his Don Quixote. As a lioness would shield an endangered cub, she has automatically assumed the roles of caregiver, protectorate and confidence booster without pause or grief. Only for Ethel does Norman step out of his shield of emotional armor and display a genuine affection that is lost to others, including himself. Hepburn absolutely radiates with warmth and vitality, providing the film with a necessary center. Though less flashy and substantive, both she and Fonda were Oscared for their work here, with Hepburn winning a record-breaking fourth 'Best Actress' award. Incidentally, this was their ONLY screen pairing, yet they work together as if they've known each other all their lives. Fifteen-year-old Doug McKeon manages to hold his own among the star power here as a young resentful upstart whose dentist father (Dabney Coleman) is romantically involved with Chelsea. Forced to play out the rest of his summer with the old folks while his father and girlfriend spend quality time together, he learns a delicate lesson or two as he develops an unlikely bond with Norman. Coleman himself has one edgy, amusing scene as he tries to gracefully deal with an overly wry Norman. Surprisingly, the weakest story link involves Norman's strained relationship with daughter Chelsea, played by Hank's own daughter, Jane Fonda (Oscar-nominated). The familial situation obviously parallels their own real-life lack of connection, but the scenes seem strangely shallow and self-serving as they forge through some mucky emotional moments as if striving for real-life closure. What should have been insightful and compelling comes off forced and distracting, particularly on Jane's part. Henry Fonda's own physical frailty at the time of shooting adds a special poignancy to the film. Ironically, Hepburn won her second Oscar in 1967 for playing another wifely Rock of Gibraltar in `Guess Who's Coming to Dinner?' The ailing Spencer Tracy died shortly after the completion of that film. Fonda would pass away a few months after winning his only Oscar. A most welcome and satisfying diversion that touches with its unpretentiousness, `On Golden Pond' is a lovely, lovely little film that should resonate for ages to come.",
         "On Golden Pond is a film that proved to me that acting is a beautiful thing when it comes from some of the veterans and the greats. I have always had the opinion that most acting from the 60's and earlier is one dimensional and flat. But then I saw this film and I realized that I was watching two of the best, from any era. Fonda and Hepburn are absolutely stunning in here and they so richly deserved to win their Oscars that year. And not only am I mad to see that Chariots of Fire beat out Raiders of the Lost Ark, but it also beat this film out as best picture, and that is a shame, and a crime. On Golden Pond reminded me a little of my relationship with my grandfather. It's not that we didn't get along because we did, but at times it was a little strained simply because of the age difference. But Billy soon learns that Norman Thayer Jr. is not just an old man, but he is a guy that has a lot say and he can offer him so much and of course they become friends. So we all know how the movie is going to end up, but it is the execution that is the strength of the film. We watch as these two grow together. We sense that they are becoming more at ease with each other and when we finally see our two guys catch that guarantuan fish named Walter, by this time we are pretty much sure what they are going to do. And it's kind of funny to draw parallels between Walter the fish, and Norman the crusty old man. But both have been around the pond for years. Norman's life wouldn't be the same if his quest for the fish was never there. Perhaps the same with Walter, perhaps he has enjoyed alluding Norman for all these years. But now the game is up, but it doesn't have to be. Norman caught him, perhaps that's all that should matter. You can draw your own conclusions from that analogy. But I like the way it comes out. On Golden Pond is a treasure. It is sweet, tender and honest. You will never see a performance better than the one Henry Fonda gives in this one. And this made me want to go out and rent some of the films that the two screen legends were in before and I have to admit that their early work is impressive. But it is here that they shine like never before. So my recommendation is this. If you are young and would never imagine seeing a film like this because it doesn't have someone like Sara Michelle Gellar or Arnold Schwartzenegger in it, then take the take advice of someone who had the same pre-conceived notions when I was 15. No Sly, no Spielberg? Hey forget it, not my cup of tea. But this will give you a new appreciation of film. It really is that good. And for those of you that have seen it, remember this line? \"Wife's name is Ethel Thayer, thounds like I'm lithsping dothsn't it? \" What a great film.",
         "I was expecting a very boring movie. All I thought about this was a couple of old people sitting around talking at some cabin. I was way off. This film is quite the opposite. Things do happen that make this movie well worth watching. Henry Fonda is excellent and made me laugh really hard with his sarcastic answers to many questions. I do believe Jane Fonda was not in the film enough. Of course we can't go without mentioning Katherine Hepburn. She is one of the greats and this film has proof. This is a film I would definitely recommend to others. It is light hearted and dramatic all at the same time. Watch this film it will entertain you.",
         "This film is just so nice to watch. The plot is fairly simple, as is the direction. The script just serves as the frame for Hepburn and Fonda. To say their performances are out of this world is probably the wrong way to say it. They are just so gentle and sweet. This film convinced me of their sheer quality. They had made only a handful of films between them over the last decade or so. To come out of retirement and do something like that is unbelievable. I can only assume that their performances are so similar to what they are in real life that it wasn't really acting. If you are at all a fan of Fonda or Hepburn, you must see this film. You must see it. It will put you in a better mood.",
         "I really enjoyed \"On Golden Pond\". I wanted to see it, because Henry Fonda won his only Best Actor Oscar for it. Since I'm a Henry Fonda fan, I thought I should watch the movie the Academy considered his best. When I watched it, I really enjoyed it! It makes you not want to take life for granted, in any way. For Norman, he learns not to take life for granted by enjoying it. He also learns not to be so crotchety, and not to dote on death. His daughter, Chelsea, learned to forget about her differences with her father, and to love him while she can. Katharine Hepburn also gives a brilliant, Oscar-winning performance as Ethel Thayer, Norman's devoted wife. She helps him in more ways than the audience realizes, because she tries to make him feel young, which is what he needs. \"On Golden Pond\" is a wonderful movie with a combination of drama and comedy that makes for an entertaining experience. I recommend this movie to everyone!",
         "Oh,the numerous memorable characters Henry Fonda brought to the screen over the years.His most memorable came in his final film,On Golden Pond. This film brought to light two important realizations for me.Family togetherness is one of the most important things we have in life,and we had better resolve our differences as a family and get along because we can't go back and correct the things we come to regret.Secondly,I came to realize that elderly couples are more than the stereotype we sometimes force upon them.They don't cease to be affectionate and sexual merely because they have gotten older.Henry Fonda and Katharine Hepburn made a delightful couple here and make you wish they had worked together more often through the years,but unfortunately,this was their first and only film together.Also,the pairing of Fonda with real life daughter Jane was indeed a delight to see.Their own troubled relationship made them naturals for their parts as a father and daughter coming together after years of tension.You could sense that at times, Henry and Jane were not acting at all when it came to their scenes with one another,making these scenes more realistic and effective.Henry Fonda received a well deserved Oscar for this film.I watched the night he received it,and recall his reaction from his home(he was too ill to attend the ceremony),and the tears streaming down his face.I couldn't help but shed a tear or two myself.I'm sure I was not the only one.Great film.",
         "Cinematically, \"On Golden Pond\" is a breathtaking movie. The enveloping surrounds of the woods, the shimmering gold of the pond at dark, the loons, the details of the water plants. Rarely I have seen such a eye captivating piece of film. And set to the gentle, breezy thought provoking music makes it nothing short of perfect. Reduced to a single plot line, this movie would sound rather silly. It is one of those films in which the lead actors already supercede the brilliance of the writing. This of course could be expected from two of Hollywood's best loved veterans. There were things in the movie I could see coming due to experience, but the amount of plot turns was amazing. There was also enough direction, good in the sense the director achieved getting what he wanted, but without interfering too much with the performances. Henry Fonda, in his final performance as the cranky, lovable Norman, made me sit up and take notice in his only Oscar deserved role. I had seen him previously in earlier films like \"The Grapes of Wrath\" and \"12 Angry Men\", but I disliked both of them. His pivotal performance in the interaction of the 13 year old Billy was incredibly funny, moving and something that many people could relate to because of the generation gap. The film truly captured the spirit of Katharine Hepburn, not very much unlike the loving, cheerful Ethel herself. At least twice in her legendary career she was passed over for two Oscars she deserved, for \"The Philadelphia Story\" and \"The African Queen\". It was great of the Academy to hand Kate her last well deserved award. The other support actors managed to do a pretty great job. The exception was Jane Fonda for her performance as Chelsea. It may or may not have been her fault, but her acting was pretty weak, regardless of the script. Underneath it all, there are messages. Things that we could help mend but with our continued prejudiced beliefs never happen. The example of this was the tense relationship of Norman and Chelsea, a problem staring them in the face but could have been solved if only there were a little faith. In real life, we don't have to look much further than our front door to find these things. \"On Golden Pond\" has taken its place as one of my favourite movies. The nominations and Oscars it received that year was well deserved. I love the movie mostly through the fact that violence and special effects are not needed to drive it, too typical of movies right now. It was made at a time when these things were too sadly emerging, so it was really a breath of fresh air amongst sameness. The movie was wholesome indeed, but it had something else. It was compelling drama, and real to life honesty and humanity are all that is needed to make it a movie great. And its all these elements for which it should be credited. Rating: 9/10",
         "Watch it last night, having seen it once years ago. This is a great movie about relationships, and dying, but in a comical way. I really liked Henry Fonda (\"good...GOD!\") the best, and the movie really focussed on him. Katharine Hepburn was good, too (duh, they both got Oscars), but I found Jane Fonda was a downer. I understand real-life flowing into the characters and all that, but a) she was depressed, or depressing, take your pick b) she was on display during her bikini scenes (you could tell she was posing) and c) can hair get any bigger? (well, it was the 80's). If you like guns and car chases, this is not the movie for you. If you like thoughtful dialogue, some swearing by young and old, and some interesting things to think about, then you probably will like it.",
         "I spent my summers on Lake Wentworth not far from Golden Pond (Squam Lake) and this movie just takes me back to those innocent summers growing up. So many little things in this movie are spot on. We always said hello and goodbye to the lake. We always went skinny dipping at night. ( The rule of the lake was \"no bathing suits after dark\"). I can't say what my favourite scene is in the movie, because they all are, but the scene where Norman has the angina attack and Ethyl stands over him and gives him a speech of encouragement will bring tears to anyone. \"...You're my knight in shining armor and your gonna get back up on that horse and go, go, go...\" From what I've read Katherine Hepburn ad-libbed that herself. The cinematography, the writing, the acting and the realism in this movie cannot be beat. The best movie about New Hampshire ever made. I can't get through this movie without crying. And that's a good thing, a very good thing!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "IPC Films",
         "Incorporated Television Company (ITC)"
      ],
      "summaries": ["The loons are back again on Golden Pond and so are Norman Thayer, a retired professor, and Ethel who have had a summer cottage there since early in their marriage. This summer their daughter Chelsea -- whom they haven't seen for years -- feels she must be there for Norman's birthday. She and her fiance are on their way to Europe the next day but will be back in a couple of weeks to pick up the fiance's son. When she returns Chelsea is married and her stepson has the relationship with her father that she always wanted. Will father and daughter be able to communicate at last?"],
      "budget": 0
   },
   "movielensId": 1124,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-12-04",
      "dvdReleaseDate": "2003-12-16",
      "directors": ["Mark Rydell"],
      "runtime": 109,
      "movieId": 1124,
      "title": "On Golden Pond",
      "mpaa": "PG",
      "actors": [
         "Katharine Hepburn",
         "Henry Fonda",
         "Jane Fonda",
         "Doug McKeon",
         "Dabney Coleman"
      ],
      "imdbMovieId": "0082846",
      "originalTitle": "On Golden Pond",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "HWjBM48YP0s",
         "ePrAPtP1k4A",
         "XuBmgQkJhMU"
      ],
      "plotSummary": "For Norman and Ethel Thayer, this summer on golden pond is filled with conflict and resolution. When their daughter Chelsea arrives, the family is forced to renew the bonds of love and overcome the generational friction that has existed for years. Norman must find his way through his anger and fear of growing old, while Chelsea struggles to rebuild their relationship. Ethel's consistent support of her \"Knight in shining armor\" is inspirational in its simplicity. This is a movie to ponder and always keep in your heart.",
      "tmdbMovieId": 11816,
      "avgRating": 3.68915,
      "releaseYear": "1981",
      "numRatings": 5062,
      "posterPath": "/6eurFv9VjqJ35PyIc2H35C0Fyca.jpg"
   }
}