{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0115645",
      "video": false,
      "title": "Before and After",
      "recommendations": [
         41589,
         2703,
         42807,
         61536,
         48287,
         20263,
         78411,
         34714,
         46797,
         58473,
         42232,
         117553,
         91217,
         17207,
         32855,
         26686,
         18856,
         17770,
         28902,
         36859
      ],
      "backdrop_path": "/ovMyA7mEHDx2PDGEljcxKOeo2Lq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Carolyn Ryan",
               "gender": 1,
               "credit_id": "52fe4651c3a36847f80f87e3",
               "name": "Meryl Streep",
               "profile_path": "/uyalVm3tH5DaUoxCmvILS9sUFsR.jpg",
               "id": 5064,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ben Ryan",
               "gender": 2,
               "credit_id": "52fe4651c3a36847f80f87e7",
               "name": "Liam Neeson",
               "profile_path": "/9mdAohLsDu36WaXV2N3SQ388bvz.jpg",
               "id": 3896,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jacob Ryan",
               "gender": 2,
               "credit_id": "52fe4651c3a36847f80f87eb",
               "name": "Edward Furlong",
               "profile_path": "/o7x6XcLSZSJygjYKLMcElEehmkr.jpg",
               "id": 820,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Panos Demeris",
               "gender": 2,
               "credit_id": "52fe4651c3a36847f80f87ef",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "5322c9849251411f7a0046c8",
               "name": "Daniel von Bargen",
               "profile_path": "/fFiiZCvBCqQ4xmCzYpMJQ7xboP3.jpg",
               "id": 1473,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Judith Ryan",
               "gender": 0,
               "credit_id": "557758cc925141372d00051b",
               "name": "Julia Weldon",
               "profile_path": null,
               "id": 121955,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Fran Conklin",
               "gender": 2,
               "credit_id": "557758e4c3a3683953000843",
               "name": "Daniel von Bargen",
               "profile_path": "/fFiiZCvBCqQ4xmCzYpMJQ7xboP3.jpg",
               "id": 1473,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Wendell Bye",
               "gender": 2,
               "credit_id": "557759189251416cf40008e3",
               "name": "John Heard",
               "profile_path": "/rz9E9VyZXeyspfCshXFKHIy5rP0.jpg",
               "id": 11512,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Terry Taverner",
               "gender": 1,
               "credit_id": "557759409251416cf700093b",
               "name": "Ann Magnuson",
               "profile_path": "/ry9H1u1GFbwXiWWolYA63pjBctp.jpg",
               "id": 37042,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Martha Taverner",
               "gender": 1,
               "credit_id": "5577595692514142b20000ed",
               "name": "Alison Folland",
               "profile_path": "/j4LkS9pycdpKECqZ4bCTqMtZrHA.jpg",
               "id": 2841,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "T.J.'s Mom",
               "gender": 1,
               "credit_id": "55775989c3a368395500087d",
               "name": "Bernadette Quigley",
               "profile_path": "/uJbM7dkkTuQw4JCDS7jIDrAGOLn.jpg",
               "id": 71821,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Young Policeman",
               "gender": 2,
               "credit_id": "557759cbc3a3683955000888",
               "name": "Timothy Patrick Cavanaugh",
               "profile_path": null,
               "id": 1166093,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Female Bailiff",
               "gender": 1,
               "credit_id": "557759e99251416cfa00085e",
               "name": "Sharon Ullrick",
               "profile_path": null,
               "id": 29365,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Courtroom Audience",
               "gender": 2,
               "credit_id": "55775a119251416ceb000b0d",
               "name": "Paul Giamatti",
               "profile_path": "/rX4LRmkYshMRfQ6lVbeZVAfqVKI.jpg",
               "id": 13242,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Bailiff",
               "gender": 2,
               "credit_id": "55775a2c92514142b20000f6",
               "name": "Jordan Lund",
               "profile_path": "/sPITFnVcOCpSgEyXij1kYqE8Cbz.jpg",
               "id": 33713,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4651c3a36847f80f87f5",
               "name": "Barbet Schroeder",
               "profile_path": "/jDMy62PR1pfD0dX5E0K3Q6SI1wm.jpg",
               "id": 23393,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55775a4bc3a368396100094f",
               "name": "Luciano Tovoli",
               "profile_path": null,
               "id": 49069,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55775a91c3a36839660009a4",
               "name": "Ted Tally",
               "profile_path": null,
               "id": 57862,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56a2cf07c3a368389e000f07",
               "name": "Ray Fisher",
               "profile_path": null,
               "id": 1393558,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.194586,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43566,
      "vote_count": 49,
      "budget": 35000000,
      "overview": "Two parents deal with the effects when their son is accused of murdering his girlfriend.",
      "similar": [],
      "original_title": "Before and After",
      "runtime": 108,
      "poster_path": "/yTDzXDKNGlmGYk5HuEeZUAypo1p.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-23",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "A murder. A suspect. A shadow of a doubt.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barbet Schroeder"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Rosellen Brown",
         "Ted Tally"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115645/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgwODk4NDkzNF5BMl5BanBnXkFtZTcwMjA0MjUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Meryl Streep, Liam Neeson, Edward Furlong | See full cast and crew »"],
      "reviews": [
         "While not a terrible movie it has a few serious problems. The problems start with the casting. Edward Furlong is cast to play the 16 year old son of parents played by Meryl Streep and Liam Neeson, but at age 16 he appears to be roughly five inches shorter than Streep and is utterly dwarfed by Neeson. Furlong looks more like he was their 12 year old son than their 16 year old son. Next problem is that certain points you need to catch at the beginning of the film simply slip by far to fast to catch. In a murder mystery or something with major plot twists that might be tolerable, but not in your ordinary family drama. But to me the most troubling problem (and if you are determined to see the movie regardless you might not want to read on, because this will give away most of the movie) is that it simply does not make sense. The story is Furlong has pulled off the road with his girlfriend and parked in the snow, gets stuck, they argue and tussle with each other, with him pushing her and accidentally causing her to fall face-first on the car jack. He then flees. She's found, rushed to the hospital and dies. The movie then deals with the family struggle of how to deal with this in court. Getting the kids' story out takes at least half the movie and by the time it gets out things are moving fast and little things, like making sense, get lost in the wake. If Furlong and the girlfriend TOGETHER had been absolutely unable to get the car out of the snow, and the deep rut he had made in it, it makes no sense that after she is spread out on the ground and unable to help he then gets the the car out by himself -- that is the kind of inconsistency any prosecuting attorney would have latched onto, and which any defense attorney would have seen as a major problem in court (I make these comments as a criminal defense attorney). But that's not the only problem with the kid's story. It was supposedly an accident. He cared about her. He never wanted to hurt her. And yet after she is hurt he cleans up the scene, gets that stuck car out of there, leaves, she is found and is STILL ALIVE long enough for an ambulance to reach her, get her to an emergency room and have a serious effort to save her life before she dies on the table in the ER. The entire issue of her having BEEN ALIVE and left to die is ignored. Not mentioned once by him, his family, the girl's grieving mother, his defense attorney, the prosecution or the judge who heard the case. It is as if the director forgot that in the second scene in the movie we see Meryly Streep, a doctor in the film, called to the ER to help with efforts to save the girl, long before we know her son was involved in the girl's death. The scene leaves no doubt (I went back and watched it a second time to be sure because the inconsistency seemed so glaring) that the girl was still alive when she reached the ER. But she was left to die by the kid for whom we are supposed to feel sympathy. Not only are there problems with the issue not having been properly addressed by any of the characters who would have addressed it, the fact that we need to feel sympathy for the kid is a problem. Easy to feel sympathy for him in having his life thrown into chaos as a result of an accident.... hard to feel sympathy when he would have had to have left his girlfriend there to die, and when in cleaning up the scene he would have had to have had enough contact with her (she fell on the car jack, and he removed the jack and put it back in the trunk of the car) that he certainly should have noticed she was still alive. Despite strong performances from the actors and good cinematography, the movie was a bit disappointing because of direction, casting and the script.",
         "'Before and After' is the kind of movie that you expect to be really fantastic. Great actors, good plot. It has huge potential. Unfortunately, the actual script seriously flaws this movie. There stand brilliant actors such as Liam Neeson, Meryl Streep, and Edward Furlong. But the actual words coming out of their mouths were often so silly, it makes you wonder how the same person who wrote 'The Silence of the Lambs' also wrote this screenplay. Overall, despite the script flaws, it has quite a good mystery, and besides the young daughter, a brilliant cast. It is worth a watch, if just for the main casts' beautiful performances.",
         "BEFORE AND AFTER Aspect ratio: 1.85:1 Sound format: Dolby Digital A middle-class New England family is forced to confront a range of difficult issues when the eldest child (Edward Furlong) is accused of murdering his girlfriend (Alison Folland). Barbet Schroeder's earnest drama looks and feels like a big-screen TV movie, toplined by A-list stars and filmed with professional elegance on wintry New England locations. Schroeder struggles to avoid melodrama and mawkishness, resulting in a lack of tension, as parents Meryl Streep and Liam Neeson become torn between protecting their son and telling the truth about his possible involvement in Folland's death. Frustrated lawyer Alfred Molina makes the point that 'truth' has little or no bearing on the criminal justice system, where defence and prosecution teams become engaged in brinkmanship designed to sway the jury one way or another. Ted Tally's screenplay makes a number of similar points, but the narrative begins to drift around the halfway mark and never really recovers. Some will be won over by the cast and production values, others won't be so forgiving.",
         "Reading the majority of comments about \"Before and After,\" I wanted to guess the commentators'ages (mostly in their twenties - thirties?) and to assume that they were either childless or had never raised teenagers. As announced by the young voice when the movie opens, this is a story of daily life that was changed in an instant, and that afterwards, the family was never the same again. It sounds like a tautology, but most of our lives are not interesting enough as material for the movies, and it is a rare script and director that can show \"daily life\" and have anyone praise its results. Ordinary dialogue, too, is a challenge, because people as a rule don't speak in great cadences. Moreover, if one is looking at the movies today, anything that is not \"family drama\" contains a volley of expletives that passes for dialogue. So it is understandable that this movie did not rate high in the minds of the x-generation. As a parent of teens, however, I found the film quite true to life. It's basically about how parents respond to a dire family crisis and how they must adjust to each other as a unit. We see how the son, as played by young Ed Furlong, is affected by the shock of this event. As an actor, his fine portrayal as the sensitive young writer in \"Grass Harp\" is a parallel role and should be mentioned. As for the parents, Streep was drawing on her experience as a mother of three and was not \"acting\" in the way one saw her in her obviously great roles, such as \"Sophie's Choice\" or \"Out of Africa.\" This was a subtler challenge for her. With Neeson, also a father in real life, he chose to portray the father as impulsive, strong and the embodiment of unconditional parental love. I felt that the parents were meant to be somewhat opposites and complementary-- she contemplative, more intellectual and sympathetic, he aggressive, protective and reactive. Some viewers were disturbed by the unbalanced and unsympathetic portrayal of the dead girl's mother and the dead girl herself. How could it be otherwise and not be told from Jacob or Jude's point of view? This is not \"Rashomon\" -- we were not meant to have different points of view defended. However, the very casting of the mother and of the girl friend as being less well educated and of a different \"class,\" was obvious, and another \"true thing\" that often happens in families. Here, however,it is not the parents' disapproval that is important, but how they respond to their son's guilt. Some viewers might say that my comments betray my being manipulated. Well, all viewers are being manipulated in any movie, and a measure of whether we like the movie or not, is whether we resent or do not mind being manipulated as the writer and director wished us to be. If someone watched this movie hoping for the suspense of a crime drama, they won't like it. If someone watched this hoping for dramatic acting as in the Oscar-winning roles of Streep or Neeson (I would have cited \"Lamb\" as his earliest and strongest), then they also would be disappointed. And if someone were watching this expecting something other than a presentation of daily life, then they would also be disappointed, because they would have found it flat, bland, even trite- until something dramatic, like the accident on Jacob's fateful date-- happens to jolt its members out of their routine and their complacency. That is what this movie is about. I found myself agreeing with the entire gamut of the parents' reactions (which some viewers found \"stupid\"), but that is how parents (and even children) often behave in a crisis. I also found myself understanding both Jacob's and his sister's emotions. Jude didn't have many lines, but those she spoke were true and thought-provoking coming from a youngster of that age and maturity. One other crucial point is how the actors responded to each other as members of a family, and I found that they were not only well cast, but were all up to the challenge, delivering themselves quite honorably. This incident could have happened to any ordinary family, and there but for the grace of God, go I. Of four ****, I rate three and a half.",
         "\"Before and After\" has a fine premise - the girlfriend of their 16-yr-old son is found apparently murdered in the snow and the parents struggle with what to do. Eventually, when the son goes A.W.O.L., they suspect he commited a murder, and the whole family struggles with what to do. The father finds bloody items in the trunk of the car and is able to dispose of them before the sheriff returns with a search warrant. Eventually the son shows up, the father and mother disagree on what to do, the younger sister gets upset. \"Before and After\" also has some of the finest actors of our day - Liam Neeson as the father, Meryl Streep as the mother, Daniel Von Bargen as the sheriff. But, somehow the movie only works moderately well. Some of the dialog is a bit dubious, some of the scenes are over-dramatic. I suppose it is a function of so-so writing and directing. Still, it is a film that kept my interest very well. The story got me to thinking what I would have done if any of my teenage children had gotten into a similar bind. With a great writer and director this could have been a \"10\" movie. I rate it 7 of 10.",
         "This is an all too common problem: someone somewhere convinces bona fide movie stars, in this case Meryl Streep and Liam Neeson, no less, to appear in a feature film that, without movie star names attached, would have ended up as made for TV. This is a weak script with bad, predictable dialogue - very disappointing with such a cast. With some reworking, it might have been a very powerful family story, perhaps never as compelling as Ordinary People, for instance, but better than it was.",
         "The shortcomings of the United States' justice system are explored in \"Before and After\". A youth (Jacob) is fighting with his girlfriend and she accidentally falls on a jack which kills her. The family grapples with whether or not to tell the truth not only the courts but to their own lawyer and police officer who is a family friend. Is it morally right to tell the truth that the girl's death was nothing more than a mere accident and hope that it will be believed or should a story be made up in the hopes that Jacob will be let off since the police have no evidence. (The father, in the interests of protecting his son, wiped the jack clean of the blood). We learn of course, that everyone is against the mother and son who want to just tell the truth, especially the lawyer who is interested more in getting Jacob off the hook, no matter how much of a story he has to invent, how many lies he has to tell, how many people's characters he has to besmirch. The moral structure behind the criminal justice system in the U.S. is uncovered as not one that seeks what is right or true but what kind of entertaining bi-polar battles between the defense and the prosecution can be unleashed in a furious game of words. While the theme of the film is compelling, the production standards are low. This seems more like a made-for-TV movie. With big guns like Liam Neeson and Meryl Streep you'd expect better acting. While Streep's performance is okay, Neeson seems like not the best choice for this role. Also, the actor playing the second dark-haired lawyer seems too clownish for his role. Surprisingly, I found that the young actors were the strongest. The actors playing the two children, especially \"Jacob\" were extremely skilled.",
         "** Spoilers ** In this movie about a young boy who does not show up at home one cold evening and the ensuing mystery of why, there are plot holes galore: how did the kid get the car out of being stuck, why did he drive home, why did he leave the bloody evidence in the trunk, where did he go on that cold night after returning the car to his home, what kind of clothes did he take with him, what did he do for money, why was the father so immediately defensive about his son, what was the motivation for the kid's remaining totally silent and sullen upon his first meeting with his parents, were they willing to let some other kid take the rap, why did the people who threw a rock through the widow wait around long enough to get caught up with? I could go on. The movie does hold your interest until you start asking yourself questions about what is going on. This is the weakest performance I have ever seen Meryl Streep turn in, she just does not seem engaged. Liam Neeson gives it a go, but is defeated by the poor script. Julia Weldon is O.K. as the daughter, but she speaks with a philosophical maturity well beyond her twelve-something years. I thought Edward Furlong was effective in playing the sensitive and moody teen and Alfred Molina brought some spark to his portrayal of a bulldog attorney. But overall pretty much a waste of acting talent. The unfortunate thing is that there was enough talent here to make this so much better if the script had just been tightened up.",
         ".Spoilers. There was a lot of good things about this movie. It was a compelling and interesting story right from the beginning. The acting was seemingly well played...... until the third act. What on earth happened to the direction of this film? I have not read the book, so I don't know if it has the same direction as this movie played out... but the third act did not even seem like the same movie. The acting took a nose-dive, and the melodrama began flowing freely like ipecac down the throat. From the beginning, I thought: Hey, sure, it's plausible that the Father wanted to save his son, and that these goofy things with the cover-up, and the family binding together to uphold the lie, were certainly no stretch of reason. Then we get to mom's, and Eddie's character's confession, and the whole thing is a puke-fest of gotchas and ridiculous moral claims about right and wrong which are, at best, pointless opposing claims about whether right or wrong and the law are the same thing. Don't misread me, though. I really enjoyed the beginning of this movie. I just hated the end. 6/10",
         "I was pleasantly surprised by this movie. I had put off watching it for a long time because I thought it would fall on standard clichés in the telling of its murder mystery. But there's a lot to like here. For starters, the performances by the lead actors are first rate. Streep and Neeson come across as real people tackling a real problem. I should also add that Alfred Molina also gives a solid performance as the defense attorney. (Though the fact he looks like idiot movie critic Michael Medved gave me a few chuckles at times.) The script gives most of its characters a fair shake. The parents are sympathetic at times, but sometimes they make decisions we disapprove of. The townspeople and police are not one-note characters, showing off more than one side. The movie unfolds at a pace that keeps us interested and informed. It's directed with an appropriate bleak look that suits the subject matter. There is one flaw with the movie, however. I thought that Edward Furlong's character was repulsive, stupid, and hateful. I don't blame Furlong for this, but his direction and his parts of the screenplay. I think a better way the movie could have gone would be to give him a mixed view, neither overly sympathetic or hateful. This would make the viewer think long and hard about him, and wonder if his fate at the end of the movie is correct or not."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Hollywood Pictures"
      ],
      "summaries": [
         "When teenage son Jacob is being accused of murdering his girlfriend, the well-respected and close-knit Ryan family is in turmoil. Jacob flees, father Ben destroys possible evidence, the village community turns hostile and mother Carolyn is forced to temporarily close her doctor's practice. Then Jacob gets arrested and soon finds himself and his family entangled in a web of truth, trust and lies, all on his way to court.",
         "Two parents deal with the effects when their son is accused of murdering his girlfriend."
      ],
      "budget": 35000000
   },
   "movielensId": 113,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1996-02-23",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Barbet Schroeder"],
      "runtime": 108,
      "movieId": 113,
      "title": "Before and After",
      "mpaa": "PG-13",
      "actors": [
         "Meryl Streep",
         "Liam Neeson",
         "Edward Furlong",
         "Alfred Molina",
         "Daniel von Bargen",
         "Julia Weldon",
         "Daniel von Bargen",
         "John Heard",
         "Ann Magnuson",
         "Alison Folland",
         "Bernadette Quigley",
         "Timothy Patrick Cavanaugh",
         "Sharon Ullrick",
         "Paul Giamatti",
         "Jordan Lund"
      ],
      "imdbMovieId": "0115645",
      "originalTitle": "Before and After",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["KRrUiYxr5dc"],
      "plotSummary": "Two parents deal with the effects when their son is accused of murdering his girlfriend.",
      "tmdbMovieId": 43566,
      "avgRating": 3.1237,
      "releaseYear": "1996",
      "numRatings": 1156,
      "posterPath": "/yTDzXDKNGlmGYk5HuEeZUAypo1p.jpg"
   }
}