{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "provence",
            "id": 1649
         },
         {
            "name": "avarice",
            "id": 2851
         },
         {
            "name": "battle for power",
            "id": 4933
         },
         {
            "name": "source",
            "id": 7199
         },
         {
            "name": "neighbor",
            "id": 10226
         }
      ],
      "imdb_id": "tt0091288",
      "video": false,
      "title": "Jean de Florette",
      "recommendations": [
         4481,
         11673,
         678,
         14320,
         204,
         1716,
         934,
         11174,
         777,
         976,
         874,
         4483,
         2457,
         55368,
         27030,
         8422,
         14652,
         827,
         11121,
         32499
      ],
      "backdrop_path": "/qNBxyt60hnzBRSHo1uRkRU34fYE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Cesar Soubeyran",
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e499",
               "name": "Yves Montand",
               "profile_path": "/zrDxGcU5r1T6arsSRu17fXKArWN.jpg",
               "id": 2565,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jean de Florette",
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e49d",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ugolin",
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e4a1",
               "name": "Daniel Auteuil",
               "profile_path": "/lWXsmJwL4H2RyJpC8p7hLFl27pZ.jpg",
               "id": 6012,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Aimée Cadoret",
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e4a5",
               "name": "Elisabeth Depardieu",
               "profile_path": "/sSXnuq1WkzntJY3pfS4P1Lqo5yv.jpg",
               "id": 38351,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Baptistine",
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e4a9",
               "name": "Margarita Lozano",
               "profile_path": "/d4RgbbQMfRJ2K3bOF8B2mpGoYMl.jpg",
               "id": 16314,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Manon",
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e4ad",
               "name": "Ernestine Mazurowna",
               "profile_path": "/9QqfGhcsLNNBq2QED7YQEgvy7Yx.jpg",
               "id": 38385,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Philoxène",
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e4b1",
               "name": "Armand Meffre",
               "profile_path": "/78QEUotrpBxrOeZpHgrkU1N9bba.jpg",
               "id": 38386,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Anglade",
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e4b5",
               "name": "Jean Maurel",
               "profile_path": null,
               "id": 38387,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Eliacin",
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e4b9",
               "name": "Didier Pain",
               "profile_path": "/pCupSXZsoYgiWALZW5ph2gB1HQZ.jpg",
               "id": 38389,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Pascal",
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e4bd",
               "name": "Pierre-Jean Rippert",
               "profile_path": "/iDW0knuEkwgkA3yElG64u6BXD2n.jpg",
               "id": 38390,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e48f",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e495",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e4c3",
               "name": "Jean-Claude Petit",
               "profile_path": null,
               "id": 37187,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e4c9",
               "name": "Pierre Grunstein",
               "profile_path": "/bcwjFDlHZZMZZGIS6UsNirmQ9Sx.jpg",
               "id": 11204,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e4cf",
               "name": "Marcel Pagnol",
               "profile_path": "/bjIlDWOTYWpvAGJFBOyVfdL48nL.jpg",
               "id": 38393,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e4d5",
               "name": "Noëlle Boisson",
               "profile_path": null,
               "id": 12758,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e4db",
               "name": "Sophie Coussein",
               "profile_path": null,
               "id": 23510,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e4e1",
               "name": "Hervé de Luze",
               "profile_path": null,
               "id": 3564,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e4e7",
               "name": "Jeanne Kef",
               "profile_path": null,
               "id": 38396,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e4ed",
               "name": "Arlette Langmann",
               "profile_path": null,
               "id": 38397,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e4f3",
               "name": "Corinne Lazare",
               "profile_path": null,
               "id": 38398,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e4f9",
               "name": "Catherine Serris",
               "profile_path": null,
               "id": 38399,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e4ff",
               "name": "Dominique Hennequin",
               "profile_path": null,
               "id": 38400,
               "department": "Sound",
               "job": "Sound Engineer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e505",
               "name": "Pierre Gamet",
               "profile_path": null,
               "id": 28685,
               "department": "Sound",
               "job": "Sound Engineer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.030384,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 4480,
      "vote_count": 149,
      "budget": 4940939,
      "overview": "In a rural French village, an old man and his only remaining relative cast their covetous eyes on an adjoining vacant property. They need its spring water for growing their flowers, and are dismayed to hear that the man who has inherited it is moving in. They block up the spring and watch as their new neighbour tries to keep his crops watered from wells far afield through the hot summer. Though they see his desperate efforts are breaking his health and his wife and daughter's hearts, they think only of getting the water.",
      "similar": [4481],
      "original_title": "Jean de Florette",
      "runtime": 120,
      "poster_path": "/uvcz97eHaZUEYFmDZGfbwTqTcUB.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "DD Productions",
            "id": 1524,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Films A2",
            "id": 875,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Renn Productions",
            "id": 82,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Télévision Suisse-Romande (TSR)",
            "id": 8453,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "AMLF",
            "id": 1869,
            "origin_country": ""
         },
         {
            "logo_path": "/gKP4egMJOi5rksdnplfPV1wa0sd.png",
            "name": "RAI",
            "id": 1583,
            "origin_country": "IT"
         }
      ],
      "release_date": "1986-08-27",
      "vote_average": 7.7,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Water of the Hills Collection",
         "id": 39460,
         "poster_path": "/zEpjz1iP9zPzsceOfoXDfY6VlWU.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Berri"],
      "runtime": 120,
      "synopsis": "The film \"Jean de Florette\" (1986) and the one which followed it, \"Manon des Sources\" (1986), are the screen rendition of Marcel Pagnol's exquisite novel, \"L'eau des Collines\" (\"The Water from the Hills,\" 1963). It is the story of two competing projects, one carried out by the city-dweller Jean Cadoret, and the other by the peasant Ugolin, set in the rustic and picturesque environment of Provence in the 1920s. It is a story of opposites: the city versus the country, modernity versus traditional, good versus bad, and memory versus oblivion. As \"Jean de Florette\" begins, Ugolin (Daniel Auteuil), also known as \"Galinette,\" having fulfilled his compulsory military duty, returns to \"les Bastides Blanches,\" his native village. His uncle is César Soubeyran (Yves Montand), \"le Papet,\" who with Ugolin is the last of the Soubeyrans, the most powerful family in the village. \"Le Papet,\" having never married (a bit of a misnomer, since \"papet\" means \"grandfather\" in Provençal), has no heirs to whom he can pass his fortune. He sees in Ugolin his only hope for continuing the Soubeyran lineage. Ugolin returned to \"les Bastides\" with the idea of growing carnations. He sets up a small plot of land, plants his cuttings, and waits for the results. Ugolin keeps his enterprise a secret until the first harvest, when he takes his uncle along to witness the sale of the flowers to the village florist. Impressed by Ugolin's success, César sees in it a way to secure the Soubeyran family's fortune, and he resolves to do everything possible to facilitate Ugolin's success. The enterprise needs more land, and since carnations require lot of water to grow, this land must have a reliable source of water. Nearby, at the domain known as \"les Romarins,\" there is a spring whose existence has almost been forgotten. César and Ugolin know of its existence, and they go to speak to the owner of the land, Pique-Bouffigue, offering to buy his property. Pique-Bouffigue is antagonistic toward César (probably because César never married his sister, Florette) and insults him. A fight ensues, during which César unintentionally causes Pique-Bouffigue's death. The two Soubeyrans arrange his body at the foot of a tree to simulate an accidental fall. César writes to an old school chum, Grafignette, who lives in nearby Crespin, asking to whom he should now address his offer to purchase \"les Romarins.\" Grafignette writes back that the Pique-Bouffigue's heir is named Jean Cadoret (Gerard Depardieu). Cadoret is the son of Pique-Bouffigue's sister, Florette, who had just passed away few days earlier. Realizing that \"les Romarins\" would be practically uncultivable without the nearly forgotten spring, César and Ugolin plug it up with cement, and then camouflage it. Furthermore, César makes sure that the rest of the village knows that Jean Cadoret comes from the hated village of Crespin, thereby guaranteeing the silence and complicity of the few villagers who could be aware of the existence of this spring. Jean, \"le bossu\" (the hunchback), his wife Aimée (Elisabeth Depardieu), and his young daughter, Manon (Ernestine Mazurowna) soon arrive at \"les Romarins,\" planning to settle down and raise rabbits. \"I'm here to cultivate the authentic!\" he tells Ugolin, who interprets the word \"othentic\" as some sort of exotic vegetable. Jean's project is in direct competition with César 's for the precious, scarce resources of arable land and water. César is convinced that it is only matter of time until Jean, a city dweller, will fail, sell his property, and return to the city where he was employed in the tax collector's office. He advises Ugolin to befriend Jean, to help him and his family as much as possible in their venture, thus insuring that when Jean is finally desperate enough to sell out, it will be to his true friend and good neighbor, Ugolin. The Cadorets spend their first winter at \"les Romarins\" preparing their project, and the spring heralds their success: the rabbits are growing fat and multiplying, and the kitchen garden gives produce which are the envy of the Soubeyrans. Summer is another story: no rain. Jean's well is now dry, and he, together with Aimee and Manon, must fetch the life-giving water from a spring located more than one mile away, still on the Cadorets' property, at \"le Plantier.\" They endlessly shuttle between their garden and the spring as many as five or six times per day. Despite his efforts, Jean cannot keep up with his garden's thirst, and he collapses exhausted: all the rabbits die, and the garden is burned by the implacable Provence sun. Once restored to health, Jean is not ready to give up, and mortgages his property to César. Jean reads in one of his books about the dowsing technique and proceeds to use it to look for a spring on his land. Thinking he has discovered one, Jean digs until he reaches bedrock, and then dynamites the rock. He is injured in the explosion, and dies on his kitchen table. Aimée sells the property to César and prepares to depart. César and Ugolin, not even waiting until Aimée and Manon have left, rush to the hidden spring and unplug it. Manon, who had followed them, is crushed by the spectacle of the gushing water: her beloved father died just as a spring was \"discovered\" on the property. César cups some water from the spring and pouring it over Ugolin's head declares him the \"King of Carnations.\"",
      "writers": [
         "Claude Berri",
         "Gérard Brach"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0091288/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNDc1NTE2OF5BMl5BanBnXkFtZTcwMjczNzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Yves Montand, Gérard Depardieu, Daniel Auteuil | See full cast and crew »"],
      "reviews": [
         "... and never really come close. How can one be the witness to this much acting, such a strong storyline about greed (which makes us appreciate human qualities - all the more), and not be touched/moved by this ? Combined with part II (which really is not optional - considering it's dramatic revelation) - it makes for superbe movie-going experience that is barely 1 notch short of GodFather quality, as far as drama goes. Character development is excellent, pretty much all of it is plausible, nothing really grates, except to see a good man suffer. Jean is good, an erudite - but he cannot understand nor smell a conspiracy - as this makes no real sense to someone with his principles. And when is all said and done - what matters most once you are heading to the pearly gates (should you be so lucky) the amount of wealth you've amassed or how you lived ? How do you hope to be remembered ? As cunning and sly as Soubeyrand is - I guess he never figured it out.... A cruel, stunning classic, with impeccable french nuances. A must-see. J.M.",
         "I was 10 when my parents rented this and it's sequel the first time. They tried to make me watch it, but I refused. Subtitled movies are for cultured people was my thoughts at the time. I came down a few hours later when they had just started Manon De Sources. Emanuelle Beart had just started playing harmonica. If you've seen this then you'll know why I was instantly captivated. Before I realized what was happening I was caught up in the tale. For many years I have remembered the film, and meant to see it again, it made such an impression on me. I finally saw them again today, and they were magnificent. I watched them both, one after the other. The scenery is spectacular, and the story is so spellbinding that time will fly. I am usually an action junkie, but these films just appealed to me as no other ever has. Even if you hate subtitles I guarantee that you will love this film, and an hour later you'll remember the characters speaking in English. No matter how tough you are, if your heart doesn't break for Jean, then it never will.",
         "This film captures another world, and makes you a part of it. The acting is superb, the scenery breathtaking, and a huge amount of skill and effort has gone into evoking the heat of summer and the details of village life in a harsh, pre-industrial world. If you cannot stand watching a film in a foreign language, or you only watch films with special effects and non-stop action,then you may find something to object to in this one, but otherwise it is perfection. The story is heart-wrenching, all the characters (both good and bad) demand sympathy, and the story is both credible, and beautifully told. That is the true quality of this film - it tells a simple, gripping story in a way that grips any viewer with a heart from start to finish.",
         "Certainly one of the best examples of French cinema. A searing powerful story of greed, and its effects. All the actors are excellent, Yves Montand is especially heartbreaking. This movie and its sequel are two of the best films of the 1980's. By the way it's about time they were re-released on DVD i want to add them to my collection.I do not understand why such films are released and the go out of print these are important wonderful films that deserve new audiences, and a new generation of admirers. If it is a business decision that they don't create as much revenue as most of the garbage that comes out of Hollywood, they should be ashamed of themselves.",
         "Marcel Pagnol was rightly admitted into the Acadamie Francaise, just about the highest honor a French writer can receive. No less a major force than Orson Welles described Pagnol's own movie 'La Femme du Boulanger' (The Baker's Wife) as the greatest movie ever made. For someone with a limited canvas - Provence, its small hamlets, the port of Marseilles, and the people who lived there - he sure extracted the maximum mileage. Jean de Florette and its sequel Manon des Source has now arguably become the highest profile of all Pagnol's work eclipsing even the great trilogy 'Marius', 'Cesar' and 'Fanny' featuring the great Raimu, and his two autobiographical works My Father's Glory and My Mother's Castle. It is very gratifying for someone with a healthy streak of cynicism in their makeup to read such glowing tributes to this movie. If French cinema NEEDED an ambassador, which it doesn't, then these two titles - shot back to back as Montand's wife, Simone Signoret, lay dying - could not be bettered. To add any superlatives to those already posted here would be superfluous so just let me say that Montand is at the top of his game and that is saying something. Superb entertainment with terrific ensemble playing. An all-time great. 11/10",
         "Okay, you have to give a lot of the credit to Pagnol for the book, but this to me is one of the best movies ever made. - A classic, simple story, beautiful location beautifully filmed, and a triumvirate of marvellous actors in Depardieu, Auteuil and Montand. - I saw this again a few days ago and enjoyed very minute. - Is it really true I have to submit at least ten lines? This is a new rule, right? Shouldn't you warn people before they start writing?",
         "Of all the French movies I've ever seen (and I've seen quite a bunch of them, let me tell ya) Claude Berri's \"Jean de Florette\" has to be one of the best if not the best. I saw this couple of times in the television some years ago and recently bought the DVD just to find out that this film seems to be excellent no matter how often and many times I decide to watch it. \"Jean de Florette\" works in so many different levels. I love the breathtaking settings, beautiful French countryside - superterranean paradise. Actors are magnificent, Gérard Depardieu has a long and respected career in the cinema but if you ask me the role of Jean de Florette is truly the very greatest performance of his life. Yves Montand and Daniel Auteuil equally shine as the greedy and devious Soubeyrans. Characters are simply incredible. Naturally audience immediately loves the hunchback. He's so warm, nice, sympathetic, unyielding and persistent yet jovial - truly the amiable hero of the story. However, no one can't help of loving those crooked rogues as well. They are so incomprehensibly mean it's definitely comical. That's what makes \"Jean de Florette\" such a great and memorable experience. It's a very sad and tragic story but it makes you laugh a lot. In the same time it manages to be extremely cruel, funny and touching. This is exactly what movies are made of. It's safe to call \"Jean de Florette\" a perfection, powerful and stirring motion picture experience and a grand classic everyone should watch. 10/10.",
         "I'm not quite sure what the appeal is to this movie, but it's definitely there. I've watched this several times in the past 15 years and always got involved with it....and it's companion piece, \"Manon of the Spring.\" If given a choice, I prefer the latter movie, only perhaps because this is a frustrating story, seeing a good man get ruined simply for greed. Both stories are well-done. This tragic tale of two greedy people driving a nice man and his family off their land is not just frustrating but sad, especially since their is no happy ending, with the man dying while trying to salvage his property. The second film is years later when the daughter, now grown up, gets revenge. Gerald Depardieu is the nice guy here, the one we all root for while Yves Montand and Daniel Auteuil are the greedy jerks. These three are famous French actors who always give their audiences good performances. A big plus in this film is the very nice cinematography, which is why I bought this when it first came out on DVD. If the story depresses you at all, go right into the sequel immediately for a more satisfying ending to the whole tale. Both movies were made in 1987. In a nutshell, this is good storytelling.",
         "This is a marvel of story-telling. Rarely have I felt so much pain for a fictional character. The \"force of destiny\" (great sound track motif selection!) is nowhere as evidently crushing as in this movie. I'm astounded and stunned by the beauty of human suffering, not, of course, out of sadism but out of melancholy. Great, great movie (though the Southern French accent is very hard to understand).",
         "Jean de Florette is a magnificently acted, superb film with fine music and excellent cinematography. The colors used are vibrant and the red carnations are a stunning adjunct of the movie. Its sequel, Manon of the Spring, is even better, and its dramatic ending is quite well written and enacted. Together, these two films are amongst the finest to come from France."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "DD Productions",
         "Films A2",
         "RAI Radiotelevisione Italiana"
      ],
      "summaries": [
         "In a rural French village an old man and his only remaining relative cast their covetous eyes on an adjoining vacant property. They need its spring water for growing their flowers, so are dismayed to hear the man who has inherited it is moving in. They block up the spring and watch as their new neighbour tries to keep his crops watered from wells far afield through the hot summer. Though they see his desperate efforts are breaking his health and his wife and daughter's hearts they think only of getting the water.",
         "A greedy landowner and his backward nephew conspire to block the only water source for an adjoining property in order to bankrupt the owner and force him to sell."
      ],
      "budget": 0
   },
   "movielensId": 1131,
   "movielens": {
      "languages": [
         "Italiano",
         "Français"
      ],
      "releaseDate": "1986-08-27",
      "dvdReleaseDate": "2001-01-23",
      "directors": ["Claude Berri"],
      "runtime": 120,
      "movieId": 1131,
      "title": "Jean de Florette",
      "mpaa": "PG",
      "actors": [
         "Yves Montand",
         "Gérard Depardieu",
         "Daniel Auteuil",
         "Elisabeth Depardieu",
         "Margarita Lozano",
         "Ernestine Mazurowna",
         "Armand Meffre",
         "Jean Maurel",
         "Didier Pain",
         "Pierre-Jean Rippert"
      ],
      "imdbMovieId": "0091288",
      "originalTitle": "Jean de Florette",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["V44E_YanQsg"],
      "plotSummary": "In a rural French village, an old man and his only remaining relative cast their covetous eyes on an adjoining vacant property. They need its spring water for growing their flowers, and are dismayed to hear that the man who has inherited it is moving in. They block up the spring and watch as their new neighbour tries to keep his crops watered from wells far afield through the hot summer. Though they see his desperate efforts are breaking his health and his wife and daughter's hearts, they think only of getting the water.",
      "tmdbMovieId": 4480,
      "avgRating": 4.10481,
      "releaseYear": "1986",
      "numRatings": 3535,
      "posterPath": "/uvcz97eHaZUEYFmDZGfbwTqTcUB.jpg"
   }
}