{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116587",
      "video": false,
      "title": "Hustler White",
      "recommendations": [
         48200,
         268536,
         27069,
         177656,
         191476,
         41425,
         42241,
         48336,
         47589,
         171229,
         42626,
         327654,
         33560,
         117232,
         215931,
         49113,
         96580,
         113454,
         42135
      ],
      "backdrop_path": "/gYFbl9LFHy5vXRM315SGkgjHlH9.jpg",
      "revenue": 127251,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Montgomery 'Monti' Ward",
               "gender": 2,
               "credit_id": "52fe468bc3a36847f8104cad",
               "name": "Tony Ward",
               "profile_path": "/jgcHcN27hc8XVQkYWxJZdHT55zW.jpg",
               "id": 173578,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Jürgen Anger",
               "gender": 2,
               "credit_id": "5589e10792514140b2001002",
               "name": "Bruce LaBruce",
               "profile_path": "/tZxNktGAuIBKZkTI60OhX28z19A.jpg",
               "id": 1115333,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Eigil Vesti",
               "gender": 0,
               "credit_id": "5589e124925141569c00001b",
               "name": "Kevin P. Scott",
               "profile_path": null,
               "id": 1480846,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Piglet",
               "gender": 0,
               "credit_id": "5589e13d92514151d7000421",
               "name": "Ivar Johnson",
               "profile_path": null,
               "id": 1480847,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5589e14ec3a3680dfb0014b2",
               "name": "Kevin Kramer",
               "profile_path": null,
               "id": 1125234,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5589e160c3a3682104002505",
               "name": "Alex Austin",
               "profile_path": null,
               "id": 1278121,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Seymour Kasabian",
               "gender": 0,
               "credit_id": "5589e17392514140b2001009",
               "name": "Ron Athey",
               "profile_path": null,
               "id": 1388629,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Stew Blake",
               "gender": 0,
               "credit_id": "5589e189925141569c000025",
               "name": "Glen Meadmore",
               "profile_path": null,
               "id": 1480849,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Ambrose Sapperstein",
               "gender": 0,
               "credit_id": "5589e19ec3a36809b10014d1",
               "name": "Graham David Smith",
               "profile_path": null,
               "id": 1480851,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Peter Festus",
               "gender": 0,
               "credit_id": "5589e1b39251414c71002405",
               "name": "Miles H. Wildecock II",
               "profile_path": null,
               "id": 1480852,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Roger V. Deem",
               "gender": 0,
               "credit_id": "5994e6f3c3a36857730043a1",
               "name": "Barry Morse",
               "profile_path": "/zSxknYe697kQyMXnNjnWX71Zpfl.jpg",
               "id": 1567928,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe468bc3a36847f8104cb3",
               "name": "Bruce LaBruce",
               "profile_path": "/tZxNktGAuIBKZkTI60OhX28z19A.jpg",
               "id": 1115333,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5589e06e9251414c710023ee",
               "name": "Rick Castro",
               "profile_path": null,
               "id": 1388631,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5589e07ec3a36809b10014b9",
               "name": "Rick Castro",
               "profile_path": null,
               "id": 1388631,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5589e093c3a36809b10014be",
               "name": "Bruce LaBruce",
               "profile_path": "/tZxNktGAuIBKZkTI60OhX28z19A.jpg",
               "id": 1115333,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5589e0a892514140b2000ffd",
               "name": "Jürgen Brüning",
               "profile_path": null,
               "id": 118828,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5589e0b492514151d7000417",
               "name": "Bruce LaBruce",
               "profile_path": "/tZxNktGAuIBKZkTI60OhX28z19A.jpg",
               "id": 1115333,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5589e0cac3a3680545004692",
               "name": "Jeff Rogers",
               "profile_path": null,
               "id": 1480845,
               "department": "Production",
               "job": "Associate Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.117704,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 44497,
      "vote_count": 13,
      "budget": 0,
      "overview": "Reminiscent of Sunset Boulevard, Hustler White transposes the action from the silver screen's old movie backlots to contemporary male prostitution and the porn industry. Said to be an homage to classic Hollywood cinema.",
      "similar": [],
      "original_title": "Hustler White",
      "runtime": 79,
      "poster_path": "/sREgNitMxCnucK5yL8oV4eP4EnK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jürgen Brüning Filmproduktion",
            "id": 1373,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dangerous to Know Swell Co.",
            "id": 56302,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hustler White Productions",
            "id": 56303,
            "origin_country": ""
         }
      ],
      "release_date": "1996-07-19",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "See it with someone you've paid for.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Rick Castro",
         "Bruce La Bruce"
      ],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Rick Castro",
         "Bruce La Bruce"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116587/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MTA5NzUyNF5BMl5BanBnXkFtZTcwMTk1MzMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tony Ward, Bruce La Bruce, Kevin P. Scott | See full cast and crew »"],
      "reviews": [
         "In HW, the always-entertaining Bruce la Bruce has produced his most appealing film to date by far. Model and former Madonna boy-toy Tony Ward is sweet and funny as Monty, the object of ice-queen film-maker Jurgen Anger's (played by la Bruce) instant love. The graphic, fetishistic sexual encounters of Santa Monica Boulevard hustlers and their johns are merely clever sidebars to the main story of Monty and Jurgen's collaboration and romance. HW is far too bizarre for mainstream moviegoers; a pity, as its themes are universal and their exposition right on target.",
         "A good effort from La Bruce as a director, if not as an actor. In fact the major drawback in the film is the dreadful 'acting'. Here I am Bruce! I'm a good actor (so I've been told anyway) and I'm gay! One of the major drawbacks of gay films in this ilk is the acting. So I'm not good-looking. Hey, we can't all be! Anyway, aside from a few sick, sleazy moments designed to shock (but are mostly just boring), this is a much better effort than his earlier films. Maybe because he had a collaborator this time?",
         "I have seen this film twice and each time see different elements. The film is a 'shocker' not a family film. Graphic S&M, sexual, playful, obscene, realistic and just outrageous. For mature audiences with an open mind. The story starts by bouncing around Hollywood, looking into the encounters of other hustlers and later as the two main characters develop, finishes in a love story. Tony Ward (long time model in magazine & music video) is portrayed as La Bruce's obsession which might have a tragic ending? you'll have to see for yourself!",
         "I wanted to dislike this more than I did, but against my will, after a while I began to sort of like it. It's still bad, but it's not offensive the way it seems like it will be from the opening. For a movie about hustling, with a few real-life gay porn stars thrown in for good measure, it isn't really smutty or gross -- it's having far too much fun with its own genre-hopping and movie-referencing for that. At the beginning it feels like it's going to be a lot more pornographic than it is -- that it so say, disgusting as opposed to sexy; however, there are a few sexy scenes -- there's a boots and leather porn shoot that's pretty erotic, as is the scene where a row of black men take turns with a blond muscle boy (and there are a lot of hustlers in short shorts, if that's your thing). There's a briefly touched-upon theme with a skinhead who wants to kiss, the notion of closeness vs. sex and if the two are compatible, that could have been elaborated on to give the film some weight, but it's not dealt with effectively; it's mainly there as a stupid joke. Most of the jokes are stupid, especially the recurring \"Anger...any relation to Kenneth?\" bit. (I love the movie's tagline, though.) The editing is a particular flaw -- it's in your face and has no rhythm, and it makes the film seem more cheap than the subject matter already suggests. That cheapness may be part of LaBruce's intention (the amateurish acting would seem to say so), but it's still childish regardless -- a scene where someone repeatedly runs over a guy with his car is flat and unfunny. There's narration where Castro is talking to us, and it's completely phony-sounding -- the movie is fake everything. Again, I think that must be the point. (The film's overall reason for existence seems geared toward a scene where LaBruce gets to suck face with a hustler.) The best scene in the movie is that with Castro and a baby in the bathtub, a scene that is essentially a rip-off (or homage) to \"Flesh.\" 6/10",
         "This is a good bit of avant-garde porn, with a purposefully ridiculous story with great drag sensibility. The main character's name is enough to make me giggle, and even though the sex is sometimes car crash, I shouldn't be watching this weird, it's still a turn-on. Please ignore viewer's comment who just doesn't get it. It's porn for the hopelessly snide and above-it-all crowd, but lets us laugh at ourselves and admit we like trashy sex as much as we look down our noses at it. For the simple-minded: It's SUPPOSED to be badly filmed and badly acted. That's what them there Hollywood types call satire. I will plug the Zeitgeist theatre in New Orleans where I saw this, since I have to pad this out to submit it.",
         "I stumbled across this film at the media center in my college where I was doing research for a paper on prostitution and the description of this film made it sound like a documentary on homosexual hustlers in west Hollywood. This movie was not what I expected but it was quite an experience. I can't say that I liked this movie but I'll never forget it, as certain images from it are stuck in my head forever. There isn't much plot beyond the story of an annoying German queen (played by the director) who is obsessed with a is-he-or-isn't-he-gay street hustler. I thought Tony Ward, as the hustler, was particularly unattractive, as there's no way I would ever pay to have sex with him. As a matter of fact, except for the cute bald guy who gets mummified and the blond porn star who gets gang banged, I thought all the guys in this movie were average looking at best. So, basically the most enlightening thing that I derived from this movie is that I'm just as good-looking as the guys who work the corner of Santa Monica boulevard. I just might give this street hustling thing a shot. Anyway, like I said there is some mummification, a gang bang, as well as bondage and an incredible scene of amputee gay sex, which is the most explicit I've ever seen. This scene, in particular, for better or worse will stay with me forever. Also, the kissing scene between Ward and the German guy really gave me the creeps. Don't get me wrong, I'm not homophobic and I like to see two guys kiss as much as any other red-blooded American boy but not these two...it really made me sick. In all, this flick is definitely worth a look, unless you're easily offended, and you'll certainly never forget it.",
         "A campy crime/love story intersects with random vignettes from the lives of various hustlers on Santa Monica boulevard. The protagonist, a pretty and altogether amoral dumbster hustler, robs a hippy trick and steals his car, running over and maiming a skinhead in the process. A prissy writer comes to the city and becomes obsessed with the same hustler. They get together, talk about the history of hustling on the boulevard and end up snogging on the beach (after a near fatal jacuzzi accident & miraculous resurrection). The surrounding vignettes are more outré, with a singing cowboy saddling and riding a young stud, s&m mortician snuffing out an amputee and a white twink \"raped\" by half a dozen hung black men. All in a day's work seems to be the moral. A postmodern plunge into some pretty disconnected lives, with references to Warhol, Baby Jane and Sunset Boulevard thrown in for good measure.",
         "It's not a porn movie, declares the box that holds Hustler White, a mid-90s look at the gay prostitute scene in LA. True enough, although some of the acting's not much better. What is better is that there's the ring of truth beneath the silly plot and stilted dialogue. These hold together numerous scenes that are nothing like what you've seen before. But you'll enjoy it more if you can keep from distancing yourself, so try. You may have no problem, or you may run screaming from scenes that include duct-taping, train-pulling, and, um, stumping. Your loss if you do.",
         "A lot of irony in this film. A pretentious reviewer could probably come up with some references to Derrida and self-deconstruction and how the ridicule the film got for the effeminate character who wishes to make a documentary of hustling in LA is a way of undermining the film itself, which indeed is something of a documentary of hustling in LA. It got some nice and crazy sex scenes, which are important. The overall feeling I have of the film is that it is like an artistic natural documentary, where the sad events, painful human conditions are like facts of nature, to be viewed, maybe briefly analyzed, but ultimately they are there and can't be changed. The story of \"piglet\" is like the bad consciousness of the film, however, the one condition where the film can't help but take sides.",
         "caught this move on my cable network and was surprised that a film with such graphic and explicit scenes would air on television at around ten o'clock. nonetheless i settled in to watch this piece by famed director and photographer Bruce labruce who hails from Toronto, Canada. i still haven't formed a solid opinion of whether or not i like this film as it is difficult to classify. there were many interesting aspects such as the camera following the different characters/hustler around west Hollywood as they waited for their next meal ticket of sorts. the opening scene definitely got my attention as it came at you fast and furious and relentless. the sex scenes themselves were on the boring side except like the rest of the reviewers the amputee gay sex scene. the grittiness and edginess of the the picture made it more realistic though i could have done without the one scene where a male hustler gets his leg run over by a car that tony ward's character is driving and is shown in graphic detail. while i've been an admirer of tony ward's previous work as a runway model and Madonna's boy toy he looks haggard and beaten down in this flick. labruce's other films such as raspberry Reich and skin flick all seem to have the same elements ie. graphic in your face gay sex, political themes and messages and unsavoury characters. a film that will have people talking i can't say i would watch it again. but if you're aware of labruce's style than you might like it. to all others, stay away."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Dangerous to Know Swell Co.",
         "Hustler White Productions",
         "Jürgen Brüning Filmproduktion"
      ],
      "summaries": ["Reminiscent of Sunset Boulevard, Hustler White transposes the action from the silver screen's old movie backlots to contemporary male prostitution and the porn industry. Said to be an homage to classic Hollywood cinema."],
      "budget": 0
   },
   "movielensId": 1137,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-07-19",
      "dvdReleaseDate": "2002-07-09",
      "directors": [
         "Bruce LaBruce",
         "Rick Castro"
      ],
      "runtime": 79,
      "movieId": 1137,
      "title": "Hustler White",
      "mpaa": "NR",
      "actors": [
         "Tony Ward",
         "Bruce LaBruce",
         "Kevin P. Scott",
         "Ivar Johnson",
         "Kevin Kramer",
         "Alex Austin",
         "Ron Athey",
         "Glen Meadmore",
         "Graham David Smith",
         "Miles H. Wildecock II",
         "Barry Morse"
      ],
      "imdbMovieId": "0116587",
      "originalTitle": "Hustler White",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["_ZsZTZh981Q"],
      "plotSummary": "Reminiscent of Sunset Boulevard, Hustler White transposes the action from the silver screen's old movie backlots to contemporary male prostitution and the porn industry. Said to be an homage to classic Hollywood cinema.",
      "tmdbMovieId": 44497,
      "avgRating": 3.2,
      "releaseYear": "1996",
      "numRatings": 75,
      "posterPath": "/sREgNitMxCnucK5yL8oV4eP4EnK.jpg"
   }
}