{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "biography",
         "id": 5565
      }],
      "imdb_id": "tt0116212",
      "video": false,
      "title": "Entertaining Angels - The Dorothy Day Story",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dorothy Day",
               "gender": 1,
               "credit_id": "52fe4a369251416c750e15e3",
               "name": "Moira Kelly",
               "profile_path": "/pQstHxjYadJBlwD0ifXFRS0xUT5.jpg",
               "id": 20005,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Peter Maurin",
               "gender": 2,
               "credit_id": "52fe4a369251416c750e15e7",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Forster Batterham",
               "gender": 0,
               "credit_id": "52fe4a369251416c750e15eb",
               "name": "Lenny Von Dohlen",
               "profile_path": "/yZfisRYu3aEDRa0AaEIjMhkmW8w.jpg",
               "id": 15799,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sister Aloysius",
               "gender": 1,
               "credit_id": "52fe4a369251416c750e15ef",
               "name": "Melinda Dillon",
               "profile_path": "/f4DU3lNCJqNVgwDZmHMlNV96rKV.jpg",
               "id": 4778,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mike Gold",
               "gender": 2,
               "credit_id": "52fe4a369251416c750e15f3",
               "name": "Paul Lieber",
               "profile_path": null,
               "id": 45839,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Maggie Bowen",
               "gender": 1,
               "credit_id": "52fe4a369251416c750e15f7",
               "name": "Heather Graham",
               "profile_path": "/rHIEhPAnZQn8BTbB1EVQ5ggEOX7.jpg",
               "id": 69122,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a369251416c750e15fd",
               "name": "Michael Ray Rhodes",
               "profile_path": null,
               "id": 109635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a369251416c750e1603",
               "name": "John Wells",
               "profile_path": "/rpVdPsbj7QLJ0VRRDmhPcYoF6m0.jpg",
               "id": 47333,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.900262,
      "production_countries": [],
      "id": 99479,
      "vote_count": 2,
      "budget": 0,
      "overview": "\"Entertaining Angels\" is an interesting title for this movie about the 1920's and 30's social activist, Dorothy Day, for it can be regarded that what this woman did, sometimes single-handedly, always controversially, in her fight against social injustice would, indeed, be wonderful entertainment for angels... or it could mean that her work was for the benefit of the 'angels' at the bottom of the social ladder for whom she fought daily against those who would hold them down... this included her work as a suffregette. However it is meant, this film captures much of the real-life drama that took place on big city streets, and of the very personal trials which eventually led her to convert to roman Catholicism, and a dedication to helping the poor.",
      "similar": [
         45317,
         323677,
         319888,
         11202,
         1578,
         10637,
         227306,
         462,
         640,
         769,
         5915,
         318846,
         324786,
         389015,
         407445,
         363676,
         371638,
         396371,
         369192,
         43959
      ],
      "original_title": "Entertaining Angels - The Dorothy Day Story",
      "runtime": 112,
      "poster_path": "/qlnRf2EW1kU8XFHhfVRDAqybrvD.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-09-27",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Ray Rhodes"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["John Wells"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116212/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5Nzc5MTYyNl5BMl5BanBnXkFtZTcwMDkwMTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Moira Kelly, Martin Sheen, Lenny von Dohlen | See full cast and crew »"],
      "reviews": [
         "For those unfamiliar with Dorothy Day, having never read any of her writings, this film might seem like a nice one. However, if this is all anyone ever got of the \"Dorothy Day Story,\" they wouldn't really have much of the story. It's a shame, because her writings and life were so interesting, as was her daughter Tamar's. The Catholic Worker Movement, which Day founded, still exists with over 120 communities across the USA. The film is at its best in portraying Day's life in New York City while she lived a \"bohemian\" life as a reporter, working for a socialist newspaper. It is too shallow in dealing with her conversion to Catholicism, leaving no real explanation for it. If it at least makes some interested in this woman's life, that is to be highly commended. I would recommend reading Day's own autobiography, The Long Lonliness.",
         "This may be the best film no one has seen, despite the brief but important performance of rising star Heather Graham. {Perhaps the awkward title kept people away). \"Entertaining Angels\" does what few movies have: explore inner, spiritual conflict dramatically and intelligently. This is an engaging, challenging work for everyone. The film overall is not preachy, yet the religious dimension here is real, just as it is real in the lives of millions of Americans, whether the Hollywood inner-circle likes it or not.",
         "I liked this film. It tells the real-life story of Dorothy Day, who founded the \"Catholic Worker\" newspaper and relief agency for the poor in New York City during the Depression. Moira Kelly gives a very good performance as Day. The story follows her quest to find her way in life, ultimately leading to her helping thousands of people and providing a role model for activists. The film contains a scene where Kelly says one of the most quotable lines ever: \"If you feed the poor, you're called a saint. If you ask why they're poor, you're called a Communist.\" Kelly says this during a scene when she is responding to people who resist her search for the truth through her newspaper. Americans who are concerned with political freedom and justice should keep this statement in mind - it is especially salient today. That said, there are flaws in \"Entertaining Angels.\" Kelly's performance as the younger Dorothy Day is great, but in the film Day is supposed gradually to look older, and this aging process isn't convincing. Martin Sheen also has a part as a wandering, Christ-like, populist preacher. He's OK here, but his Inspector Clouseau-like French accent won't be on his career retrospective videotape. Also, the film might have bitten off more than it can chew. It could have used a bigger budget and a more professional cast. Overall, though, this one is well worth a rental. I'm a big Moira Kelly fan, too. I hope she will be around a long time.",
         "Entertaining Angels goes through the hard life of the converted Catholic Workers Movement leader Dorothy Day, portrayed by the extremely talented Moira Kelly. This movie is great even for people who don't know who Dorothy Day is. This movie is very excellent. If you like this movie you will probably like the Emmy nominated CBS movie Joan of Arc ( Peter O'Toole and Leelee Sobieski), and the Zeffirelli film Brother Sun, Sister Moon.",
         "...and as good an introduction as I could hope to someone who had to have been a complex person. I'd only heard of Dorothy Day before I viewed this movie at a Catholic retreat house run by the Redemptorists. I suspect the producers felt they could go only so far with the subject matter, but they paid attention. The fact that they even tried reflects well on them. Moira Kelly credibly kept my attention throughout. I could recognize Melinda Dillon, Heather Graham, Brian Keith and Martin Sheen among the other players, but that's not to slight the large cast that truly worked as an ensemble. I'll doubtless learn more, and plan that by reading Day's autobiography \"The Long Loneliness\" and her account of the Catholic Worker movement, \"Loaves and Fishes\". Any film that inspires me to learn more about its subject earns my respect.",
         "Wow. Those of you who haven't had a chance to see Moira Kelly are really missing out on a truly great talent. Ever since I first saw her on The Cutting Edge, I've really looked up to her admirable character and her obvious acting talent. As Dorothy Day, she manages to take upon a tremendously difficult role and she succeeds beyond all expectations. The screenplay is well written, and while it does lead off the main drive of the story at times, Kelly is always there to provide a cohesive nature to to it which keeps the entire thing together. I really enjoyed this film -- I really didn't find the religious overtones to be a problem as a few of the reviews out there seemed to suggest. I hope you give it a try. You'll be glad you did. And, oh yeah... she's got a nice singing voice, too.",
         "Entertaining Angels: The Dorothy Day Story is an independent film that tells the story of the life of Dorothy Day,a journalist who turned into becoming a social activist and founder of the Catholic Worker newspaper.She is known to be the American Mother Teresa.Moira Kelly stars in the title role together with Heather Graham, Lenny Von Dohlen and Martin Sheen. The year is 1917.In it,we see Dorothy Day hanging out with notorious liberals such as Eugene O'Neal and working as a politically active radical journalist.They are working together in supporting the implementation of the women's right to vote.We also see her drinking and free loving that he later found herself pregnant.This results into an abortion which traumatized her and consumed her with guilt.She later found herself to become a single mom bearing a daughter from another relationship.This led to a change in direction after she meets Sister Aloyisius and becoming a Roman Catholic after being an atheist all her life.Later she and her child,move to Manhattan where she begins working with the needy while trying to reestablish her career as a journalist.She co-founds The Catholic Worker, a newspaper dedicated to her new cause and to criticizing the rigid class distinctions of the Establishment that only serve to keep the poor oppressed and hopeless. It was a great movie.Despite the fact that it spends a lot of the time during Day's younger years instead of her years as a renewed Catholic,we get to see a great performance from Moira She was able to translate Day's combative nature and the yearning for meaning in life that made her convert into Catholicism.Also,her fight for for social justice, civil rights, and disarmament as well as her incredible struggles for it were also in it.It would have been better if it went to that direction more instead of Day's young life as a wild drinker.But overall,it still is a good portrayal of her on screen."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["Paulist Pictures"],
      "summaries": [
         "The phrase \"entertaining angels\" refers to the practice of treating all guests--be they kings or peasants--as if they were visiting angels. This is the challenge for all humble Christians and the one Dorothy Day rises to meet.",
         "\"Entertaining Angels\" is an interesting title for this movie about the 1920's and 30's social activist, Dorothy Day, for it can be regarded that what this woman did, sometimes single-handedly, always controversially, in her fight against social injustice would, indeed, be wonderful entertainment for angels... or it could mean that her work was for the benefit of the 'angels' at the bottom of the social ladder for whom she fought daily against those who would hold them down... this included her work as a suffregette. However it is meant, this film captures much of the real-life drama that took place on big city streets, and of the very personal trials which eventually led her to convert to roman Catholicism, and a dedication to helping the poor."
      ],
      "budget": 0
   },
   "movielensId": 1140,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-09-27",
      "dvdReleaseDate": null,
      "directors": ["Michael Ray Rhodes"],
      "runtime": 112,
      "movieId": 1140,
      "title": "Entertaining Angels - The Dorothy Day Story",
      "mpaa": "",
      "actors": [
         "Moira Kelly",
         "Martin Sheen",
         "Lenny Von Dohlen",
         "Melinda Dillon",
         "Paul Lieber",
         "Heather Graham"
      ],
      "imdbMovieId": "0116212",
      "originalTitle": "Entertaining Angels - The Dorothy Day Story",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["vblgJ-8eY9o"],
      "plotSummary": "\"Entertaining Angels\" is an interesting title for this movie about the 1920's and 30's social activist, Dorothy Day, for it can be regarded that what this woman did, sometimes single-handedly, always controversially, in her fight against social injustice would, indeed, be wonderful entertainment for angels... or it could mean that her work was for the benefit of the 'angels' at the bottom of the social ladder for whom she fought daily against those who would hold them down... this included her work as a suffregette. However it is meant, this film captures much of the real-life drama that took place on big city streets, and of the very personal trials which eventually led her to convert to roman Catholicism, and a dedication to helping the poor.",
      "tmdbMovieId": 99479,
      "avgRating": 3.58537,
      "releaseYear": "1996",
      "numRatings": 41,
      "posterPath": "/qlnRf2EW1kU8XFHhfVRDAqybrvD.jpg"
   }
}