{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "crime boss",
            "id": 9730
         },
         {
            "name": "mansion",
            "id": 12545
         }
      ],
      "imdb_id": "tt0117968",
      "video": false,
      "title": "Three Lives and Only One Death",
      "recommendations": [],
      "backdrop_path": "/51frOgQSs4n1PsG2dJtHDu67VoQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mateo Strano / Georges Vickers / Butler / Luc Allamand",
               "gender": 2,
               "credit_id": "52fe48b9c3a36847f817612d",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Maria Gabri - Colosso \"Tania la Corse\"",
               "gender": 1,
               "credit_id": "52fe48b9c3a36847f8176131",
               "name": "Anna Galiena",
               "profile_path": "/958wVgr0CXvMu1pMWwIT8XpAa2U.jpg",
               "id": 27391,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe48b9c3a36847f8176135",
               "name": "Marisa Paredes",
               "profile_path": "/aDfNPZ2plaCmdrYkCkburjBqYnP.jpg",
               "id": 954,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cecile",
               "gender": 1,
               "credit_id": "52fe48b9c3a36847f8176139",
               "name": "Chiara Mastroianni",
               "profile_path": "/mBrsvkCKYEM2RAyDpLxx3Tdge1F.jpg",
               "id": 20710,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Helene",
               "gender": 1,
               "credit_id": "52fe48b9c3a36847f817613d",
               "name": "Arielle Dombasle",
               "profile_path": "/yl6RniErLOkQKxUJjn791WBJB5O.jpg",
               "id": 28626,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mario",
               "gender": 0,
               "credit_id": "52fe48b9c3a36847f8176141",
               "name": "Jean-Yves Gautier",
               "profile_path": null,
               "id": 20918,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Martin",
               "gender": 2,
               "credit_id": "574cea3c925141447b000794",
               "name": "Melvil Poupaud",
               "profile_path": "/moYCrYGhIP4QTDmkED2lMGxMuOW.jpg",
               "id": 26100,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "André",
               "gender": 2,
               "credit_id": "574cea4b92514144690007d2",
               "name": "Féodor Atkine",
               "profile_path": "/cf50q5tFxLlp6rlSyG96AlhZrfi.jpg",
               "id": 20285,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Tania's Husband",
               "gender": 0,
               "credit_id": "574cea5d925141447b00079e",
               "name": "Jacques Pieiller",
               "profile_path": null,
               "id": 548643,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Radio Narrator",
               "gender": 0,
               "credit_id": "574cea6c925141446b00072e",
               "name": "Pierre Bellemare",
               "profile_path": "/bWkRv1MpIhMgcghUdoRiAhHhEtE.jpg",
               "id": 583686,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Luca",
               "gender": 0,
               "credit_id": "574cea76c3a3683ada0006fc",
               "name": "Smaïn",
               "profile_path": "/1EcwigjWCwP9ivgYsIkl0jEkCHa.jpg",
               "id": 228930,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Bum #1",
               "gender": 0,
               "credit_id": "574cea85c3a36827e2000708",
               "name": "Lou Castel",
               "profile_path": "/tcFGR2TRAhPYXJUOH9n0DNbDOuQ.jpg",
               "id": 32827,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Antoine José",
               "gender": 0,
               "credit_id": "574cea929251415cd400038d",
               "name": "Jean Badin",
               "profile_path": null,
               "id": 116996,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Madame Vickers",
               "gender": 0,
               "credit_id": "574cea9bc3a3683ada000709",
               "name": "Monique Mélinand",
               "profile_path": "/o4mSStTS3LY3EMS4s10nYiDpMaK.jpg",
               "id": 24771,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Carlito",
               "gender": 0,
               "credit_id": "574ceaaa92514153720005ef",
               "name": "Bastien Vincent",
               "profile_path": null,
               "id": 1628723,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Piotr",
               "gender": 2,
               "credit_id": "574ceac7c3a36827cd0007e6",
               "name": "Guillaume de Tonquédec",
               "profile_path": "/mDPeqkKJgFMiH60gH32VTwgOHSp.jpg",
               "id": 17896,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48b9c3a36847f8176129",
               "name": "Raúl Ruiz",
               "profile_path": "/5vwVDnEIhCEs6sg51JFoArAXqLS.jpg",
               "id": 121585,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53be8f46c3a3684cf400306f",
               "name": "Pascal Bonitzer",
               "profile_path": null,
               "id": 64750,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53be8f59c3a3684cdb00392f",
               "name": "Raúl Ruiz",
               "profile_path": "/5vwVDnEIhCEs6sg51JFoArAXqLS.jpg",
               "id": 121585,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "584cdeb6c3a3682ac5006f55",
               "name": "Jorge Arriagada",
               "profile_path": null,
               "id": 134463,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "584cdee3c3a3682ac7006347",
               "name": "Laurent Machuel",
               "profile_path": null,
               "id": 1393921,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "584cdef39251411e3800686f",
               "name": "Rudolfo Wedeles",
               "profile_path": null,
               "id": 1160340,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.061498,
      "production_countries": [
         {
            "iso_3166_1": "PT",
            "name": "Portugal"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 55049,
      "vote_count": 5,
      "budget": 500000,
      "overview": "Raoul Ruiz’s enthralling thriller is made up of four intertwining stories of bizarre occurrences in Paris featuring a man who was stolen away by fairies, a professor who becomes a tramp, the lovers who inherit a chateau – and the last tale that connects all that has gone before.",
      "similar": [
         15092,
         154400,
         680,
         94329,
         339403,
         90,
         15196,
         6916,
         276,
         242076,
         13830,
         321258,
         10668,
         7452,
         29264,
         14001,
         409297,
         384737,
         16274,
         227359
      ],
      "original_title": "Trois vies et une seule mort",
      "runtime": 123,
      "poster_path": "/fQSUYzVwz4GwPSjo3l7kwyhWRgq.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Gemini Films",
            "id": 6584,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 16366,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Madragoa Filmes",
            "id": 11143,
            "origin_country": "PT"
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1996-05-15",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Raoul Ruiz"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Pascal Bonitzer",
         "Raoul Ruiz"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0117968/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NzE4Mzc1MF5BMl5BanBnXkFtZTcwNTM3MTkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marcello Mastroianni, Anna Galiena, Marisa Paredes | See full cast and crew »"],
      "reviews": [
         "Chilean director Raul Ruiz created a weird, wild, fantastic world with Three Lives and Only One Death. Marcello Mastroianni plays four different characters in as many different stories that at first seem completely separate, but by the films end are wholly intertwined. It is beautifully, almost mystically shot, effectively using shadows, light, and computer imagery to create painted like imagery. It is a bit confusing, but wholly satisfying film. In the first story Mastroianni plays a salesman who walked out on his wife (Marisa Paredes) twenty years ago. The wife has since found another husband (Feodor Atkine) and is living a seemingly happy life. For reasons left unexplained Mastroianni suddenly decides he wants his old life back. He catches the new husband, at a Tabac and offers to pay him 1,000 francs for a hour of his time. What proceeds is an imaginative, fantastic tale of why Mastroianni has been gone for twenty years. It is far to complicated to explain here, but lets say it involves a room with moving walls and tiny fairies who prefer to eat franc bills, but will settle for newspaper. The end of the story finds Mastroianni wanting to leave the second husband in the fantastic room, while he moves back in with his wife. In the second story Mastroianni plays a successful professor who, for reasons that are all his own, become a beggar, and a rather successful one at that. He befriends a prostitute (Anna Galiena), who he later finds out isn't all she pretends to be, and whose husband (Jacques Pieiller)is something of a psychopath. In the third story a young couple (Chiara Mastroianni and Melvil Poupaud) find themselves being mysteriously supported by an unnamed friend. After months of finding 1,000 francs in their mail box each week, they learn this mysterious stranger has died and left them his mansion. The catch is they must keep on a peculiar butler (Mastroianni of course) or lose everything. The fourth story is really a means to tie all three stories together, and yes, it is weird. There is a lot going on throughout the film. It is visually stunning, complex in story, and a delight throughout. It is the type of film that really deserves a second, and third viewing to allow thoughtful absorption of the many details. In what was his second to last film before his death, Mastroianni does a masterful job playing these varied, and interesting characters. It is a film not meant for everyone. The story is a weird and complex as anything put out by David Lynch. But for the lover of cinema, there is much to appease the appetite. It is a beautiful, layered, surreal film that is a true pleasure to watch. Like this review? Go to www.midnitcafe.blogspot.com for more.",
         "With his work in the 80's Ruiz managed to cast upon the French conundrums about time and reality an oblique, dreamlike light. A light that diffused the essay into heady magic, into shadow play that was dangerous and sultry with the impossible. He would see Welles from the other side of the mirror, from the fictional looking in. None of that here, instead dry vignettes like a French Bunuel. Some wit and irreverence and a few touches about convergent realities that remind of his earlier films are lost in too much transparence. The structure is reminiscent of something he would do. A surreal comedy where Marcello Mastroyanni is three different characters. All three stories are framed by a narrator reading them for a radio program. Eventually the three lives converge, worlds overlap under a single author who weaves himself in fictions that inexplicably become real, but they converge and overlap too late and no real sparks fly. Whereas earlier Ruiz trusted intuition to take him to the place where ideas mean things, here he starts from ideas and structures as he goes on. It is all scaffold, elaborate, suffocating scaffold, with no edifice to support. Ideas cast adrift without anchor. Compare with the richness of his 80's films about sailing inwards.",
         "\"Three Lives and Only One Death\" directed by Raoul Ruiz, was probably a vehicle for Marcello Mastroianni. The film marked the end of the life of one of the greatest actors of all times. A giant among giants, the actor probably sensing his own death played not only one, but three different roles. There are many messages within the story, one of which seems to be pointing to the unification of the single currency not only in France, but in the countries of the European Union, something much in the news these days. The narrative consists on three stories that are interconnected. Each one shows Mr. Mastroianni at the center of the story. Mr. Ruiz showed his admiration to the surrealists masters of the genre like Luis Bunuel and his followers. As far as the narrative is concerned, the film has an absurdist character in stories that speak about everyday life, played by larger than life characters. The situations do not make sense, although there is a basic story line that is kept throughout the film. The best excuse for watching the film is to see Marcello Mastroianni in his heavily accented French having a good time playing disparate people. Others in the cast include the actor's daughter, Chiara in the third vignette playing opposite Melvil Poupaud. The first story features Feodor Atkine who meets an unexpected fatal attack. Marisa Paredes, Aurore Dombasle and Anna Galiena also appear as the three women in the main character's life.",
         "Having just read about Raoul Ruiz's passing I was motivated to look up reviews of my favorite film of his. I am writing this because I was surprised to see that none of the reviewers seemed to get that the film was an allegory for the coming of the Euro currency. The \"craziness\" of the film is actually a commentary on the craziness of the Euro. For instance viewers will notice that the characters lose their personalities on the Rue Maastricht. The Maastricht Treaty laid the groundwork for the Euro in 1992 that wentinto effect January 1, 1999. Much of what is happening today with Europe and the Euro was symbolically foreshadowed in the film. If you watched the film and didn't understand its underlying premise I suggest watching again. I am sure you'll experience an \"ah ha\" moment and will discover this crazy film of Mr. Ruiz's makes brilliant sense.",
         "Wonder how many of his wives and lovers found themselves in this film. He is old and splits off into many diverse personalities: and does so quite successfully. The fairies are a little hard to take. However, one of the wildest roles is the one by msieu Doucard, that evil French spy in the Sharpe movies. With overalls, he plays a simple Frenchmen who meets a really wierd end at the hands of Mastroiannani. The actor is too intelligent, though, and he didn't quite hide his intelligence as well as say, Billy Bob Thornton in his similar role. In other words, you don't buy that Msieu Doucard would be so gullible, or is that the shadow of the Sharp movies overcoming me? Mastroiannani's real daughter plays his daughter in this movie, which i found delightful. Now I will have to see it again, and find out where the importance of the bells first became known. The psychoanalyst is precious, so much totally ANTI every psychologist you've ever known, but just as arrogant. Since I'm 65 now, looking at M's hump made me realize how important it is to \"Sit up straight and pull my diaphragm up from my tummy.\" Those humps can really make you look old. If he was faking it, he was doing a great job. You won't see another movie like this one, not even \"Three Faces of Eve\" is in the same genre. Great cinematography as well. What the little chickadees do, you don't want to have done to yourself, I can assure you.. Funny and sad, and oh, so tolerant of sexual infidelity....a French movie, indeed. And no offense meant to the wonderful French, without whom we would still 'be a dependency of England' (Gore Vidal).",
         "Great dark humour, very funny, felliniesque film. Mastroianni is as good as always. A tad confusing at times. Requires complete attention at all times. The ending is the best part, a very clever film.",
         "Raul Ruiz has crafted a genuinely surrealistic film, dealing with such subjects as identity, time, chance and the cyclical pattern of events, but for all his camera tricks (some of which are outstanding), his storytelling is rather flat, and his characters talk too much. Ruiz asks for too much patience and too many allowances on the part of the viewer, without giving his stories the kicker that would justify them; his one big revelation was all but spoiled in pretty much every review of the film, not to mention its own title. (*1/2)"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Gemini Films",
         "La Sept Cinéma",
         "Madragoa Filmes"
      ],
      "summaries": ["Take a walk into the weird world of filmmaker Raul Ruiz as he takes us to Paris for a twisted ride. A man which shares four names and four personalities (which is the real one?) is the link between four different, yet similar, stories involving love, lust, crime, and time."],
      "budget": 0
   },
   "movielensId": 1143,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-05-15",
      "dvdReleaseDate": null,
      "directors": ["Raúl Ruiz"],
      "runtime": 123,
      "movieId": 1143,
      "title": "Three Lives and Only One Death",
      "mpaa": "",
      "actors": [
         "Marcello Mastroianni",
         "Anna Galiena",
         "Marisa Paredes",
         "Chiara Mastroianni",
         "Arielle Dombasle",
         "Jean-Yves Gautier",
         "Melvil Poupaud",
         "Féodor Atkine",
         "Jacques Pieiller",
         "Pierre Bellemare",
         "Smaïn",
         "Lou Castel",
         "Jean Badin",
         "Monique Mélinand",
         "Bastien Vincent",
         "Guillaume de Tonquédec"
      ],
      "imdbMovieId": "0117968",
      "originalTitle": "Trois vies et une seule mort",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Raoul Ruiz’s enthralling thriller is made up of four intertwining stories of bizarre occurrences in Paris featuring a man who was stolen away by fairies, a professor who becomes a tramp, the lovers who inherit a chateau – and the last tale that connects all that has gone before.",
      "tmdbMovieId": 55049,
      "avgRating": 3.41935,
      "releaseYear": "1996",
      "numRatings": 62,
      "posterPath": "/fQSUYzVwz4GwPSjo3l7kwyhWRgq.jpg"
   }
}