{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0040723",
      "video": false,
      "title": "Raw Deal",
      "recommendations": [
         19618,
         26174,
         35956,
         31556,
         21454,
         30162,
         37992,
         22342,
         34667,
         27999,
         21296,
         22985,
         31152,
         20367,
         28023,
         35017,
         30624,
         22925,
         43075,
         139176
      ],
      "backdrop_path": "/akQNeF8JYldsiHFexExijXyiTHI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Joseph Emmett (Joe) Sullivan",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03f993",
               "name": "Dennis O'Keefe",
               "profile_path": "/uTu2E94CyTJuXnr8UWcVRzNkMqo.jpg",
               "id": 88462,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Pat Cameron",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03f997",
               "name": "Claire Trevor",
               "profile_path": "/6RMb6vmgxfTpSWF7fggD0kYnP19.jpg",
               "id": 14965,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Ann Martin",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03f9b7",
               "name": "Marsha Hunt",
               "profile_path": "/fKYyWL0MI0UrZp1UT6CaWOJqzEH.jpg",
               "id": 1215925,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Fantail",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03f99b",
               "name": "John Ireland",
               "profile_path": "/87deUnSyOPNaoiQiBHjScqhu8CZ.jpg",
               "id": 14502,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rick Coyle",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03f99f",
               "name": "Raymond Burr",
               "profile_path": "/Asn6aKAPshAUDnJN3OMLsBWCRwO.jpg",
               "id": 7685,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Spider",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03f9a3",
               "name": "Curt Conway",
               "profile_path": null,
               "id": 94779,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Marcy",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03f9a7",
               "name": "Chili Williams",
               "profile_path": "/txJylUvPnHrFnfTADJN9hiThqTe.jpg",
               "id": 94780,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Police Capt. Fields",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03f9ab",
               "name": "Regis Toomey",
               "profile_path": "/wdcVhuLj0OzaEsgumhRcrMtbfq8.jpg",
               "id": 22093,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Murderer",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03f9af",
               "name": "Whit Bissell",
               "profile_path": "/aOe39nPJuZpGYGR3WuRo5PiYGwK.jpg",
               "id": 13786,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Gates",
               "gender": 0,
               "credit_id": "52fe44f1c3a368484e03f9b3",
               "name": "Cliff Clark",
               "profile_path": "/pSidj0mVZYQtXQzdszeTBgqGwj5.jpg",
               "id": 89728,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03f98f",
               "name": "Anthony Mann",
               "profile_path": "/9uc4d2GGoHBRLeAqsZJpwJX4S8x.jpg",
               "id": 40199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5376d1ec0e0a261425000dcc",
               "name": "John C. Higgins",
               "profile_path": null,
               "id": 52589,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5376d2340e0a26141c000e05",
               "name": "Leopold Atlas",
               "profile_path": null,
               "id": 543922,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5376d2510e0a261422000e2e",
               "name": "Edward Small",
               "profile_path": null,
               "id": 10914,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5376d28f0e0a26141c000e25",
               "name": "Alfred DeGaetano",
               "profile_path": null,
               "id": 103359,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5376d2a50e0a261425000e07",
               "name": "Edward L. Ilou",
               "profile_path": null,
               "id": 1124118,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5376d2c20e0a261422000e4f",
               "name": "Armor Marlowe",
               "profile_path": null,
               "id": 1320496,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5376d2d60e0a261416000df5",
               "name": "Clarence Steensen",
               "profile_path": null,
               "id": 118445,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "54e1b144c3a368087b00117a",
               "name": "John Alton",
               "profile_path": "/2T1IJWguIJicQD2dw0SqzoVAYxa.jpg",
               "id": 96252,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "571e61199251416f23000584",
               "name": "Paul Sawtell",
               "profile_path": null,
               "id": 4681,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 3.443783,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26167,
      "vote_count": 24,
      "budget": 0,
      "overview": "In this film noir classic, a revenge-seeking gangster (Dennis O'Keefe) is sent to prison after being framed for a crime he didn't commit. After seducing a beautiful young woman, he uses her to help him carry out his plot for vengeance, leading him to the crazy pyromaniac (Raymond Burr) who set him up.",
      "similar": [
         156022,
         769,
         3134,
         10651,
         483,
         3112,
         339692,
         281,
         1701,
         979,
         395834,
         281298,
         996,
         281957,
         37835,
         26789,
         398175,
         400,
         8292,
         994
      ],
      "original_title": "Raw Deal",
      "runtime": 79,
      "poster_path": "/yKf09gEue3x0dw67nXfnAD1ULNy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Eagle-Lion Films",
            "id": 4927,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Edward Small Productions",
            "id": 13479,
            "origin_country": ""
         }
      ],
      "release_date": "1948-05-26",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Bullets!  Women! -- Can't Hold a Man Like That!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Anthony Mann"],
      "runtime": 79,
      "synopsis": "In prison and planning a break, Joe Sullivan (Dennis O'Keefe) gets visited by Ann Martin (Marsha Hunt), the social worker who writes to him while he's inside and Joe has developed an attraction to Ann as she is the only women who has come to see him. Joe breaks out with the help of his girl friend Pat (Clair Trevor) and the first place they go is to Ann's house to change clothes, and use her car. Joe wants to take Ann hostage mainly as an extension of his sexual attraction to her. During the events Pat ruminates about the fractured relationship she and Joe have, and her feelings of jealousy cause her to begin treating Ann suspiciously. Joe is planning a rendezvous with Ricky Coyle (Raymond Burr) to collect fifty-thousand dollars owed him, but the gangster double-crosses Joe, and gives instructions that Joe must not reach him, and a few thugs go off to waylay Joe. With Ann and Pat's help Joe manages to overcome those who are bent on killing him, but Ricky kidnaps Ann and Joe decides to try to save her. Along the way Pat forces Joe to confront his feelings for her and Ann, and in a fiery finale all debts are finally paid.",
      "writers": [
         "Leopold Atlas",
         "John C. Higgins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040723/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI1MjQzMjQ2MF5BMl5BanBnXkFtZTgwNDY0MjE3MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dennis O'Keefe, Claire Trevor, Marsha Hunt | See full cast and crew »"],
      "reviews": [
         "Folks can go on and on about a visual style. The fact is, RAW DEAL exemplifies more than just an atmosphere. There's a catalyst for horrific violence driven by the desperation of the characters, their psychosis and their inability to escape from the choking shadows not only around them, but inside their heads. This movie, a cheap b-production with only one actor with stand-out talent, Claire Trevor, and a young powerful Raymond Burr, manages to seem authentic all the way through because it doesn't hold back on the violence or the threat of violence. There's a desperate prison escape, by hero O'Keefe, who's trying to get to Burr the crime boss, for whom he took a fall. Burr wants O'Keefe dead so he doesn't have to worry about O'Keefe ratting on him. O'Keefe uses two women he knows, his floozy Trevor and the good-girl counselor he really loves (she's cast in light and draws him like a moth) as cover. The movie then follows O'Keefe as he does a mini-FUGITIVE, like the television show, making love to his women and encountering a raging lunatic in the woods who doesn't have anything to do with him, but might get O'Keefe caught anyway by swarming police on the hunt for the maniac. In this rough noir, you get a suicide by cop, a guy fighting not to get his face impaled on a set of wall antlers, a flaming friccasee thrown in a drunk woman's face, a nasty deception and the good girl getting tortured, and a bloody final encounter between psycho Burr and O'Keefe, with plenty of face-ripping and falling from burning buildings. That's not standard stuff, and if you can get into babe Trevor with light shimmering on her lips as she tries to figure out how to save her thug O'Keefe from the police, Burr, and the younger angel ready to steal him away, then you will enjoy hell out of this film.",
         "What a perfect film for insomniacs. This is wonderful to watch with the lights out. With that said, let's look at this underrated work by director Anthony Mann. First the obvious...John Alton is a genius. The lighting, or lack thereof, is visually striking. What this man could do with a $10 budget was simply amazing. Secondly, let's note the unusual commentary/narration by Academy Award winner(she won the award that same year for her role in \"Key Largo\"), Claire Trevor. I can count only a couple of film noir in which the voice-over is done by a doomed (in love)woman. Her sense of entrapment perfectly encapsulate's the mood of this film. Now, let's also note the odd use of a theremin for the bulk of the music used in this film. Check it out...very creepy. But one of the most overlooked components in this film has to be the hulking visage of Raymond Burr. This guy had to be in just about every film made between 1944 and 1960. In this particular film he is a sado-masochistic pyromaniac. In just about every scene he is torching somebody, whether it be by using his lighter, or throwing a flaming flambeaus at some poor unsuspecting party-going girl or by just burning down his own apartment. He's a nutcase...but a joy to watch on the screen. Okay, so the story itself isn't the most original. But with everything else this film has going for it, I HIGHLY recommend anyone even slightly interested, to go buy it NOW! It's one of my absolute favorite film noir's. Oh...I almost forgot. Check out Marsha Hunt in this film. She's stunning.",
         "Enjoyable noir outing enlivened by a first rate cast, solid script and typically solid Alton camerawork. O'Keefe is right at home as Joe, the hotheaded lug with his own code and unlucky streak. Trevor is at her fatalistic best as the true blue moll who is meant for him but gets stepped over. Hunt is appealing and credible as the fresh-faced moralist who tries to change Joe but winds up changed, instead. Burr is an effective heavy, albeit a bit too wimpy at the end. Toomey, Bissell, and Ireland are all competent as well. Alton uses multiple familiar Malibu locations to good advantage. The cinematography is excellent. The script is particularly effective, building as Joe slowly discovers how he has been set up and deceived by basically everyone to some degree. Claire Trevor's struggle to come clean at the end is a moving and suspenseful section and the violent climax is curiously redeeming and satisfying. Noir fans should definitely give this one a look- not as famous as your typical Bogey or Mitchum entry, but just as iconic in its own way.",
         "***SPOILERS*** ***SPOILERS*** Gunplay is for Westerns (of which Raw Deal's director, Anthony Mann, went on to direct several). Film noir prefers more baroque outbursts of malice, ideally illuminating, however briefly, the dark crevasses of human psychopathology. Crime kingpin Raymond Burr, shot from below to make his bulk loom even more frighteningly, nurses a fascination with fire. His chambers glow with candlelight, and he playfully singes the earlobes of his henchmen with a cigarette lighter. When, displeased with some news he's just heard, a party girl splashes him with some of her drink, he reacts with lightning-quick instinct, hurling a chafing dish of flaming Cherries Jubilee into her face - and, not so incidentally, ours. (This, by the way, five full years before Fritz Lang arranged for Gloria Grahame to get a kisserful of scalding coffee in The Big Heat.) Of course, in accord with Chekhov's dictum that a rifle produced in Act One must be discharged by Act Three, waiting in the wings there's a conflagration with Burr's name on it. Raw Deal was the second of the collaborations between Mann and cinematographer John Alton, following T-Men. There's scarcely a frame in the film that Alton has not composed, lighted and shot with offhand brilliance, yet the film flows along without the fussy, embalmed look that comes from self-conscious artistry or uncertainty about what to do with it. A subdued voice-over opens the movie - not the stentorian narration with which so many noirs are saddled (including T-Men) but an almost interior monologue spoken by a woman, Claire Trevor. (Never has she been better - not in Murder, My Sweet, nor Born To Kill, nor Key Largo, which snagged her an Oscar.) A savvy moll of a certain age, she knows time is running out on her, hence her obsession with clocks: wristwatches, clock faces in towers, wall clocks (at one crucial point Alton encloses her anxious face within a dial). She's been carrying a torch for Dennis O'Keefe, in stir after a double-cross by Burr. But a breakout has been arranged, with the codependent Trevor driving the getaway car, her purse holding two tickets to Panama on a freighter leaving in three days time. But there's many a slip 'twixt cup and lip. First, a jam forces them to include in their getaway plans a young social worker (Marsha Hunt) who has taken a professional interest in O'Keefe (much to Trevor's chagrin). Next, Burr has sent one of his deranged torpedoes (John Ireland) in pursuit. Third, O'Keefe is determined to have one last reckoning with Burr. Fourth, Ireland manages to abduct Hunt.... Half the movie takes place in San Francisco, mainly in fog-shrouded Corkscrew Alley. The great outdoors of the Northwest accounts for the rest - with a haunting nocturne in a pine forest, which city-gal Trevor remarks makes her feel `I dunno, both big and small at the same time.' But indoors or out, darkness reigns (and, thanks to Alton, the film's many and intricate shadows all but achieve co-starring stature). It's hard-core noir, to be sure, sinister and brutal, but shot through with a redemptive touch of poetry.",
         "Director Anthony Mann and photography whiz John Alton combined for several film noirs in the late 1940s and this was one. Most of them had the same feel which meant great photography and an okay-but-nothing-spectacular story. This one was different in that in had a female doing the narration. I wouldn't mind that but in this kind of hard-boiled film, a feminine voice such as Claire Trevor's didn't sound right. Now, if she an edge to her a la Marie Windsor or Ann Savage, fine, but Trevor's voice didn't fit. Trevor was a good noir actress, but using her for narration was questionable. It did have an apt villain, however, in Raymond Burr. The burly Burr was brutal, which means he was effective. He looked mean and sounded mean, all the way up to his 1954 \"Rear Window\" performance before going good-guy with television's Perry Mason. Dennis O'Keefe, Marsha Hunt and John Ireland also star and do a fine job. There is a lot of tough dialog in here. There are tons of nighttime shots, very dark scenes so make sure you view this on DVD because prior VHS prints of this made it difficult to view.",
         "Raw Deal (1948) What a moody, dark, steamy, dangerous drama. The story is a little clunky at times, but with this much atmosphere, who cares? Between classic early Anthony Mann (the director) and classic early John Alton (the cinematographer), there is no doubt about wanting to get sucked in, dragged down, swept away, and wowed. It really is a beautiful, brooding movie. The key theme is escape, as a convict is on the run and he takes two women with him, one his girlfriend who is sort of \"bad\" and one an admirer who is basically \"good.\" The two don't get along of course, and in the process of fleeing from one situation to another (pretty much always at night) we see the man switch from one kind of woman to another. This man is Dennis O'Keefe, who is strong and almost better here because he isn't well known and there is no baggage from other movies and other roles. The women are played by Claire Trevor, who is terrific, and Marsha Hunt, who is not--though she holds her own. Other smaller parts are gritty and impressive, including Raymond Burr as a very bad man, always photographed from below so he seems sinister. If the escape and the running were the whole movie, it would have been compact and effective, a tight little piece following these three on the road, hiding, and eventually fighting for their survival. There is one odd and highly improbable scene were they happen upon another criminal running from the police. It's good drama, but too coincidental, out in the mountains of the Pacific Northwest. Otherwise the parts are strong, the story well paced. And the visuals just stunning. That's the biggest reason to watch. And get pulled away.",
         "From Claire Trevor's spacey, almost whispered voiceover, to the eerie moog soundtrack, to the foggy, shadowy scenography, Raw Deal is one of the most brilliantly conceived and masterfully crafted hardboiled movies ever made. Its early scenes are set in Washington state--i.e., Twin Peaks and X-Files country--and this setting establishes the spookiness that continues all through the rest of the film. Claire Trevor is especially good playing one of her washed-up floozy roles, and Raymond Burr is at his most diabolical as a pyromaniac crime boss. Fire and rain, shadow and fog, yearning and betrayal, deep loyalty and triple-crossing--as a mood piece this movie is unsurpassed. Once you've seen it, think about exactly who got the \"raw deal\" of the title--just one or two of the characters, or maybe all of them?",
         "\"Raw Deal\" was independent film made in 1948 by producer Edward Small. It is an excellent example of the \"film-noire\" genre that was popular in the forties and early 50s. It is filmed in black and white amidst the dark shadows and special lighting that characterized these films and in this case, most of the story takes place at night. It is skillfully directed by the soon to be famous Anthony Mann who went on to make a series of realistic and violent westerns with James Stewart in the fifties. Although the film runs a scant 78 minutes, it manages to tell its story and hold the viewer's interest throughout. Dennis O'Keefe stars as a convict who's escape is engineered by the crime boss (Raymond Burr) who had set him up for the fall in the first place, with the hope that O'Keefe wiil be killed in the escape attempt. Of course, he does escape and sets out to seek his revenge. O'Keefe's anti-hero really has no redeeming qualities. At one point he is poised to shoot down a forest ranger in cold blood. Claire Trevor is excellent as O'Keefe's long suffering moll who hopes to get him out of the country and eventually marry him. It is a role similar to the one for which she would win the Best Supporting Actress Oscar for \"Key Largo\" the same year. Marsha Scott is the third side to the triangle as the good girl who wants O'Keefe to give himself up. Burr is particularly sadistic as the crime boss who fears for his life. At one point he throws a flaming pan onto a girl who has displeased him. John Ireland is along as Burr's hitman who gets into an exciting fight with O'Keefe in a darkened storeroom. \"Raw Deal\" is a good movie that didn't get the praise it deserved.",
         "Claire Trevor providing voice-over narration to the accompaniment of a Theramin! What an indelible effect this makes! In a way, it is not the usual sort of narration we find in film noir: Trevor is usually shown as her voice, with that spooky electronic instrument providing harmony, come through on the soundtrack. The standard for this was to have the protagonist (almost always a male) do this but without appearing as he spoke. Trevor not only appears but indeed appears in a hat with a veil covering her face. This will stick in your memory for years after you've seen it! Trevor helps boyfriend Dennis O'Keefe break out of prison. But a good girl, Marsha Hunt, has also visited and shown interest in them. Which one will he chose: bad but loyal Trevor or goody-goody Hunt? These are both excellent actresses. Marsha Hunt underplays a little bit here. But she is superb. The movie has a very solid, if somewhat standard plot. But all kinds of things are tossed into the mix -- all to the movie's benefit. For example, when O'Keefe has settled into his first hide-out, a wife-murderer appears and demands to be given shelter. He's there for a few minutes of screen time but after that his story is dropped. John Alton's cinematography is superb. Anthony Mann directed this Eagle Lion feature with expert hands. Some of the characters may be losers but the movie is a true winner.",
         "Joseph Emmett \"Joe\" Sullivan (Dennis O'Keefe) is in the State Prison for taken the blame for the gangster Rick Coyle (Raymond Burr) that owes him US$ 50,000.00. Joe is visited by the young Ann Martin (Marsha Hunt) that works at the law firm that is defending him and she tells that after three years, Joe will certainly be on probation. However his lover Pat Cameron (Claire Trevor) also visits him and tells that Rick has plotted an escape for him during the night. What they do not know is that the sadistic Rick wants to get rid off Joe and expects that Joe will be murdered or caught during the prison break. Joe is well-succeeded in the escape and Pat drives the runaway car. However the car is shot in the tank by the police officers and they run out fuel. Joe brings Pat to Ann's house expecting to have a hideout for a couple of days, but Ann calls the police believing that she would help Joe. They escape in Ann's car and head to Crescent City, where Joe expects to meet Rick to receive his money and travel to South America with Pat. But Rick sends a hit-man to kill Joe while Pat feels that she is losing Joe to Ann that has fallen in love with him. Will Pat and Joe have the chance to travel together to South America? \"Raw Deal\" is a film-noir with a triangle of love between an ambiguous criminal that wants to be a good man, his experienced lover and a naive young woman that also falls in love for him. Raymond Burr performs a scary gangster. The plot is full of action and has an unusual narration in off by Pat Cameron. The cinematography in black and white is very beautiful and the conclusion is dark. My vote is seven. Title (Brazil): \"Entre Dois Fogos\" (\"Between Two Fires\")"
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Drama"
      ],
      "productionCompanies": ["Edward Small Productions"],
      "summaries": [
         "Joe Sullivan is itching to get out of prison. He's taken the rap for Rick, who owes him $50 Grand. Rick sets up an escape for Joe, knowing that Joe will be caught escaping and be shot or locked away forever. But with the help of his love-struck girl Pat and his sympathetic legal caseworker Ann, Joe gets further than he's supposed to, and we are posed with two very important questions: Is Joe really the cold and heartless criminal he appears to be, or is there a heart of gold under that gritty exterior? And does Joe belong with the tough, street-wise Pat, or with the prim, moralizing Ann?",
         "Joseph Emmett \"Joe\" Sullivan is in the State Prison for taken the blame for the gangster Rick Coyle that owes him US$ 50,000.00. Joe is visited by the young Ann Martin that works at the law firm that is defending him and she tells that after three years, Joe will certainly be on probation. However his lover Pat Cameron also visits him and tells that Rick has plotted an escape for him during the night. What they do not know is that the sadistic Rick wants to get rid off Joe and expects that Joe will be murdered or caught during the prison break. Joe is well-succeeded in the escape and Pat drives the runaway car. However the car is shot in the tank by the police officers and they run out fuel. Joe brings Pat to Ann's house expecting to have a hideout for a couple of days, but Ann calls the police believing that she would help Joe. They escape in Ann's car and head to Crescent City, where Joe expects to meet Rick to receive his money and travel to South America with Pat. But Rick sends a hit-man to kill Joe while Pat feels that she is losing Joe to Ann that has fallen in love with him. Will Pat and Joe have the chance to travel together to South America?"
      ],
      "budget": 0
   },
   "movielensId": 1153,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-05-26",
      "dvdReleaseDate": "2005-10-18",
      "directors": ["Anthony Mann"],
      "runtime": 79,
      "movieId": 1153,
      "title": "Raw Deal",
      "mpaa": "",
      "actors": [
         "Dennis O'Keefe",
         "Claire Trevor",
         "Marsha Hunt",
         "John Ireland",
         "Raymond Burr",
         "Curt Conway",
         "Chili Williams",
         "Regis Toomey",
         "Whit Bissell",
         "Cliff Clark"
      ],
      "imdbMovieId": "0040723",
      "originalTitle": "Raw Deal",
      "genres": ["Crime"],
      "youtubeTrailerIds": ["mINFj0hSweo"],
      "plotSummary": "In this film noir classic, a revenge-seeking gangster (Dennis O'Keefe) is sent to prison after being framed for a crime he didn't commit. After seducing a beautiful young woman, he uses her to help him carry out his plot for vengeance, leading him to the crazy pyromaniac (Raymond Burr) who set him up.",
      "tmdbMovieId": 26167,
      "avgRating": 3.25,
      "releaseYear": "1948",
      "numRatings": 160,
      "posterPath": "/yKf09gEue3x0dw67nXfnAD1ULNy.jpg"
   }
}