{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "undercover",
            "id": 1568
         },
         {
            "name": "treasury department",
            "id": 10890
         },
         {
            "name": "classic noir",
            "id": 155436
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0039881",
      "video": false,
      "title": "T-Men",
      "recommendations": [
         42678,
         27635,
         44098,
         35543,
         42295,
         36814,
         27999,
         37041,
         28023,
         17131,
         36338,
         44101,
         21296,
         46421,
         41553,
         28561,
         40765,
         33813,
         52859,
         29470
      ],
      "backdrop_path": "/axIdcswMJgNA4FQSy7YF8mn5Hhh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dennis O'Brien / Vannie Harrigan",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fbe1",
               "name": "Dennis O'Keefe",
               "profile_path": "/uTu2E94CyTJuXnr8UWcVRzNkMqo.jpg",
               "id": 88462,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Evangeline",
               "gender": 0,
               "credit_id": "52fe44f1c3a368484e03fbe5",
               "name": "Mary Meade",
               "profile_path": null,
               "id": 94778,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Tony Genaro / Tony Galvani",
               "gender": 0,
               "credit_id": "52fe44f1c3a368484e03fbe9",
               "name": "Alfred Ryder",
               "profile_path": "/y9AcwedephR2UFKBzKHSjVpF8Y8.jpg",
               "id": 15620,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "The Schemer",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fbed",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mary Genaro",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03fbf1",
               "name": "June Lockhart",
               "profile_path": "/5Cqdk9yh7A7SNg5jdDqs0g2qUNr.jpg",
               "id": 13997,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Moxie",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fbf5",
               "name": "Charles McGraw",
               "profile_path": "/m6jBxQ3ZnePMBtCEy3eTu168kg3.jpg",
               "id": 8233,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Diana Simpson",
               "gender": 1,
               "credit_id": "598645179251413d39006d47",
               "name": "Jane Randolph",
               "profile_path": "/5EN6xSvHUkgwwm4yIasnsFVVEHq.jpg",
               "id": 30114,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Gregg",
               "gender": 2,
               "credit_id": "598645249251413cfc006e83",
               "name": "Art Smith",
               "profile_path": "/nfNMbg7r4xkVViVhoDbivh8BNGJ.jpg",
               "id": 14359,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Chief Carson",
               "gender": 2,
               "credit_id": "5986453a9251413d39006d6c",
               "name": "Herbert Heyes",
               "profile_path": "/tPVQAGw2F9rKQTR9PHIbggP4cBl.jpg",
               "id": 82836,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Brownie",
               "gender": 2,
               "credit_id": "5986454c9251413d53007067",
               "name": "Jack Overman",
               "profile_path": null,
               "id": 100326,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "'Shiv' Triano",
               "gender": 2,
               "credit_id": "59864564c3a368324200726c",
               "name": "John Wengraf",
               "profile_path": "/ccb8ViZsmwCNogQspG2MfA8WCLl.jpg",
               "id": 12157,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Agent Lindsay",
               "gender": 0,
               "credit_id": "598645939251413d39006dd2",
               "name": "Jim Bannon",
               "profile_path": "/stJTNkdwcE2BupcDz8Qul40cTRa.jpg",
               "id": 84486,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Paul Miller",
               "gender": 0,
               "credit_id": "598645b49251413d4a0070d0",
               "name": "William Malten",
               "profile_path": null,
               "id": 1864308,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fbd7",
               "name": "Anthony Mann",
               "profile_path": "/9uc4d2GGoHBRLeAqsZJpwJX4S8x.jpg",
               "id": 40199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fbdd",
               "name": "John C. Higgins",
               "profile_path": null,
               "id": 52589,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03fbfb",
               "name": "Virginia Kellogg",
               "profile_path": null,
               "id": 78795,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fc01",
               "name": "Aubrey Schenck",
               "profile_path": null,
               "id": 30968,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fc07",
               "name": "Paul Sawtell",
               "profile_path": null,
               "id": 4681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fc0d",
               "name": "John Alton",
               "profile_path": "/2T1IJWguIJicQD2dw0SqzoVAYxa.jpg",
               "id": 96252,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fc13",
               "name": "Fred Allen",
               "profile_path": null,
               "id": 105461,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.011335,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26174,
      "vote_count": 20,
      "budget": 0,
      "overview": "Two U.S. Treasury (\"T-men\") agents go undercover in Detroit, and then Los Angeles, in an attempt to break a U.S. currency counterfeiting ring.",
      "similar": [
         996,
         10775,
         136400,
         341013,
         513285,
         14638,
         247,
         26389,
         2252,
         816,
         817,
         818,
         1422,
         1092,
         8961,
         37710,
         5503,
         10764,
         96,
         426
      ],
      "original_title": "T-Men",
      "runtime": 92,
      "poster_path": "/z9hZ6bvwhlXrhoNZE7cr7B0tFGM.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Edward Small Productions",
         "id": 13479,
         "origin_country": ""
      }],
      "release_date": "1947-12-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Terrific... and true!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Anthony Mann"],
      "runtime": 92,
      "synopsis": "A flood of counterfeit money is flowing into general use and the United States Treasury Department is reeling. The illegal tender has an unusually high quality due to the expert engraving of the plates, and very good paper used for making the funny money nearly indistinguishable from the real thing. The Treasury Department calls in Dennis O'Brien (Dennis O'Keefe) to go undercover and infiltrate a ruthless Detroit gang believed to be responsible for the fake dough. O'Brien partners up with the newly married Anthony Gennaro (Alfred Ryder) and the two gain access to the thugs making the bad money. O'Brien tracks down one of the main players named Schemer (Wallace Ford) and further discovers the top boss who is bringing paper in from Asia and making the excellent counterfeit money. When Gennaro's true identity is discovered by the counterfeiting crooks O'Brien must make a tough decision to continue his assignment to bring down the criminals who will stop at nothing to continue their illicit activities. As O'Brien manages to get all the culprits together for a bust he realizes his cover is blown and he races against the clock to bring the bad guys to justice and stay alive.",
      "writers": [
         "John C. Higgins",
         "Virginia Kellogg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039881/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMjE0NjcwM15BMl5BanBnXkFtZTcwMDY2ODQzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dennis O'Keefe, Wallace Ford, Alfred Ryder | See full cast and crew »"],
      "reviews": [
         "Whether by fluke or design, joining the talents of director Anthony Mann and cinematographer John Alton resulted in one of the most potent creative teams in movie history \u0096 certainly in the film noir cycle whose look and energy they helped forge (Alton's contributions are so innovative and striking that they amount to co-direction). Working for Eagle-Lion Studios on Poverty Row, they took a routine agents-in-peril plot packed with propaganda about Our Tax Dollars At Work in Washington and turned it into a memorable film that's little short of extraordinary -- at least at times. Treasury agents Dennis O'Keefe and Alfred Ryder get assigned to track down a counterfeiting ring uttering high-quality, almost indetectable paper. They catch the scent, by means of cigars and Chinese herbs, of a portly gentleman in San Francisco. Going into deep cover, they get drawn into an increasingly edgy and violent underworld, putting themselves at considerable risk (in one of the film's most morally freighted moments, one of them doesn't make it out). Appreciating this film means shutting out the super-patriotic anthem that rings out whenever we catch sight of the Capitol dome and the narrator's portentous drone that accompanies it (actually, more than 50 years later, these laughable gimmicks add a piquant period flavor). Instead, watch for Mann's syncopated pacing, which always catches you off guard, and for Alton's amazing throwaway effects. There are shots in this low-budget exercise so complex and evocative that they're models of the cinematographer's craft (Alton did, after all, write the seminal textbook \"Painting With Light\"). Shifting double images in the windows of telephone booths and pizza shops create parallel worlds. The film leaves us with a number of unforgettable set-pieces: Assassin Charles McGraw plying his trade in a Turkish bath, Ryder not being able to acknowledge his new bride for fear of blowing his cover, a murder which one of the agents dares not prevent, or even react to. T-Men looks terrific, keeps us on edge, and deserves its reputation as one of the high-points of the film noir cycle.",
         "The oldest federal law enforcement outfit going are the Treasury Men, those intrepid folks who see that no one avoids paying the federal duties on various items or counterfeits our money. That was the subject that Director Anthony Mann decided to tackle in the documentary style made famous over at 20th Century Fox in such films as Boomerang, The Street With No Name, and The House on 92nd Street. Over at Fox it was done for effect. But as good as T-Men is and it is a crackling good film, let's not forget the reason for John Alton's camera work with lights and shadows is because he and Mann were working on a B picture. These guys got creative because they had to. Later on Anthony Mann in the Fifties got some real good size budgets to work with in those technicolor westerns he did with James Stewart. You'd hardly know it was the same director. T-Men involves treasury agents Dennis O'Keefe and Alfred Ryder going undercover to get a very slick group of counterfeiters. The murder of an informer brings the Treasury Department to the decision to use undercover men. They meet all kinds of criminal types of both sexes and in good noir style the tension mounts before they too become informed on. Our good guys blend well into the criminal world in their performances. But the outstanding acting in T-Men is done by hit man Charles McGraw and Wallace Ford who is aptly nicknamed Schemer in this film. This is definitely a film for fans of the noir genre.",
         "When counterfeit currency begin appearing in the L.A. area, the Treasury Dept. comes to investigate. The only way to deal with the problem is to have two agents from different areas of the country infiltrate the ring in order to have the ones responsible captured. Dennis O'Brien and Tony Genaro are the two men tapped for the job. It takes both men a while in getting to know how the gang operates. Dennis O'Brien gets lucky when he follows the Schemer into a craps game where he passes a counterfeit bill that is soon discovered. O'Brien is the one that is able to penetrate and get to know who are the people involved and is instrumental in solving the mystery. \"T-Men\", directed with an amazing style by Anthony Mann is told documentary style, as though what we are watching was an episode, or a re-enactment of the real incident narrated by someone in the Treasury Department. Mr. Mann's direction and his innovative camera placements are about what makes the film watchable. The interesting black and white cinematography by John Alton gives the film a great look that keeps the viewer involved in the story. The background music is by Paul Sawtill and it works good with the action. Dennis O'Keefe makes a cool Dennis O'Brien, the T-Man that is smart and is able to solve the puzzle at the risk of losing his own life. Alfred Ryder plays Tony Genaro, another T-man whose cover is blown by a friend of his wife. Wallace Ford is perfect as the oily Schemer, a man who loves to gamble and the steam baths. Mary Meade, June Lockhart, Charles McGraw, are seen in supporting roles. The film clearly points out to the talent of a great film director, Anthony Mann, who created a film with a style and a substance that others imitated, but never succeeded.",
         "This is one of the better examples of film noir cinematography. Once the introductions are over and the dramatization of the case begins, the film overflows with startling black-and-white contrasts and interesting camera angles. Director Anthony Mann and photographer John Alton were at the top of their game and the DVD transfer enhances their work. The great camera-work more than makes up for the fact that the story is just so-so, the weakest of the three noirs the two did together on this 3-pack DVD (the others being, He Walked By Night and Raw Deal.) However, it does sport the typically-tough film noir characters and some great suspense over the last 10-15 minutes. What you have to wade through is the boring beginning but staying with it will be rewarding. I thought the grim story could have used a little warmth, at least some wisecracking with some floozy \"dame.\" But, no molls in this story this is man's gangster film all the way.",
         "T-Men is yet another collaboration of director Anthony Mann and cinematographer John Alton, a sizzling semi-doc done in the noir manner, it's the usual fed goes undercover story, and yet made with such verve and energy as to jump off the screen. The larger than life film-making, combined with the sober subject matter, almost tip this one into the realm of the surreal, as Mann and Alton were basically too talented for such mundane material, as essentially the script serves their talents, which are considerable, rather than the other way around. Routine as the story is, this is magnificent film-making.",
         "Director Anthony Mann's hard-boiled, film noir approach coupled with the stylistic cinematography of John Alton make this semi-documentary tale of government treasury agents infiltrating a large counterfeit ring an exciting crime drama. Dennis O'Keefe is great as a hard-nosed agent who slowly earns the trust of the bad guys while his partner, Alfred Ryder, is his equal as the sacrificing newlywed whose duty to his country comes before his duty as a husband. The film offers a fascinating look into the world of undercover work and intrigue and even has an opening segment from the Treasury Office itself.",
         "One of the better documentary style noir thrillers that was popular in post World War II Hollywood. Reed Hadley gives a neat deep voiced narration, souding like some sort of law enforcement officer, but it's a bit much at times. Dennis O'Keefe stars as a federal agent disguised as a small time hood. His target- to nab counterfeiters. Anthony Mann keeps the story fascinating, as O'Keefe dives deeper and deeper into the underworld. The real star here is John Alton's superb black and white cinematography, using harsh, minimal light, he creates a world that just peeks out of pools of black.",
         "Some nice shadowy photography by John Alton and a well-paced storyline directed with style by Anthony Mann, makes for a diverting crime melodrama in crisp documentary style that was popular in the early to mid-'40s. Think BOOMERANG, THE HOUSE ON 92nd STREET, 13 ROUE MADELEINE and other Fox melodramas of that era. But this was done on a poverty row budget by Eagle-Lion with the usually light-weight actor DENNIS O'KEEFE in the sort of role usually handed to someone like Dana Andrews, Mark Stevens, John Hodiak or William Eythe if the film was made at Fox. He's surprisingly good as a noir hero whose task is to infiltrate a counterfeit gang with another Federal man, posing as would-be counterfeiters, and thus providing a succession of suspenseful moments where our hero is in danger of being exposed as a T-man for the government. Even more effective, in lesser roles, are CHARLES McGRAW and WALLACE FORD. In fact, McGraw would have been an even better choice for the lead than O'Keefe, his tight-lipped bearing and impressive physique suiting him for the role of a dangerous noir hero. June Lockhart has only a fleeting appearance in one brief scene but others in the cast are properly sinister or authoritative, according to the way the script depicts the supporting characters. Summing up: Worth a look, but not at the top of the film noir greats due to a script that is only slightly above average.",
         "This undercover-secret-service-agents-infiltrate-counterfeiting-ring film is heavily dependent on exceptionally fine noir lighting and camera work under the direction of Albert Mann which help to maintain a high degree of tension, notwithstanding its pseudo-documentary format (complete with voice-over narrator) and somewhat stilted acting. Wallace Ford is positively slimy in the supporting role of Schemer, a hood-fallen-in-influence.",
         "Two treasury agents infiltrate a dangerous gang of counterfeiters in this exciting 1947 film. The two are able to be accepted by the gangsters due to excellent detective and preparation on their parts. The heartbreaking scene where one of them was killed was skillfully done. The camera image of Dennis O'Keefe, after his cohort is killed, was memorable. Also memorable was the one scene that June Lockhart appeared in. Realizing that her husband is on assignment and unable to reveal himself, Lockhart plays along. Later, her husband is killed. Wallace Ford is excellent as a mob stooge. Another great film noir by director Anthony Mann. It is only at the very end that the head of these people is revealed. We never saw this person throughout the film."
      ],
      "genres": [
         "Drama",
         "Film-Noir",
         "Crime"
      ],
      "productionCompanies": ["Edward Small Productions"],
      "summaries": [
         "United States Treasury agents O'Brien and Genaro infiltrate a counterfeiting ring which has some dangerously good paper. This is supposedly based on several actual Treasury cases.",
         "Two US Treasury agents hunt a successful counterfeiting ring."
      ],
      "budget": 0
   },
   "movielensId": 1154,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1947-12-15",
      "dvdReleaseDate": "2005-10-18",
      "directors": ["Anthony Mann"],
      "runtime": 92,
      "movieId": 1154,
      "title": "T-Men",
      "mpaa": "",
      "actors": [
         "Dennis O'Keefe",
         "Mary Meade",
         "Alfred Ryder",
         "Wallace Ford",
         "June Lockhart",
         "Charles McGraw",
         "Jane Randolph",
         "Art Smith",
         "Herbert Heyes",
         "Jack Overman",
         "John Wengraf",
         "Jim Bannon",
         "William Malten"
      ],
      "imdbMovieId": "0039881",
      "originalTitle": "T-Men",
      "genres": [
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "kiW-WS_QTjM",
         "RVcgvVYI6W0"
      ],
      "plotSummary": "Two U.S. Treasury (\"T-men\") agents go undercover in Detroit, and then Los Angeles, in an attempt to break a U.S. currency counterfeiting ring.",
      "tmdbMovieId": 26174,
      "avgRating": 3.33197,
      "releaseYear": "1947",
      "numRatings": 122,
      "posterPath": "/z9hZ6bvwhlXrhoNZE7cr7B0tFGM.jpg"
   }
}