{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0039004",
      "video": false,
      "title": "Pastoral Symphony",
      "recommendations": [
         121211,
         8896
      ],
      "backdrop_path": "/aeg1YdIhwnOJ5X07wC39XVxJB5g.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Gertrude",
               "gender": 1,
               "credit_id": "52fe4bb7c3a36847f8210e3f",
               "name": "Michèle Morgan",
               "profile_path": "/uqVbTWbEDIjgIZgtw3CCXslDWnY.jpg",
               "id": 35254,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Pastor John Martens",
               "gender": 0,
               "credit_id": "52fe4bb7c3a36847f8210e43",
               "name": "Pierre Blanchar",
               "profile_path": "/mwqvqvATTawCCy4ZB8oQwKc1hbH.jpg",
               "id": 239396,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Amelia Martens - his wife",
               "gender": 0,
               "credit_id": "52fe4bb7c3a36847f8210e47",
               "name": "Line Noro",
               "profile_path": null,
               "id": 94950,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Jacques Martens - his son",
               "gender": 2,
               "credit_id": "52fe4bb7c3a36847f8210e4b",
               "name": "Jean Desailly",
               "profile_path": "/ak0Lfk0ht2Hm1dC5AYpOl35JELa.jpg",
               "id": 18559,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Piette Casteran",
               "gender": 0,
               "credit_id": "52fe4bb7c3a36847f8210e4f",
               "name": "Andrée Clément",
               "profile_path": null,
               "id": 239363,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bb6c3a36847f8210e1d",
               "name": "Jean Delannoy",
               "profile_path": null,
               "id": 70854,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bb6c3a36847f8210e23",
               "name": "Jean Delannoy",
               "profile_path": null,
               "id": 70854,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb7c3a36847f8210e29",
               "name": "André Gide",
               "profile_path": null,
               "id": 1065701,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bb7c3a36847f8210e2f",
               "name": "Jean Aurenche",
               "profile_path": null,
               "id": 40531,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bb7c3a36847f8210e35",
               "name": "Jean Aurenche",
               "profile_path": null,
               "id": 40531,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb7c3a36847f8210e3b",
               "name": "Pierre Bost",
               "profile_path": null,
               "id": 34822,
               "department": "Writing",
               "job": "Dialogue"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.583274,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 117500,
      "vote_count": 4,
      "budget": 0,
      "overview": "A minister falls in love with a blind young woman he sheltered, but so does his son.",
      "similar": [],
      "original_title": "La symphonie pastorale",
      "runtime": 110,
      "poster_path": "/8ohlwQ7SHDsQdNXoqMsWwwZxQXc.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1946-09-26",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jean Delannoy"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "André Gide",
         "Jean Aurenche"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0039004/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5NDQzNjQwNl5BMl5BanBnXkFtZTcwNzMwODYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Pierre Blanchar, Michèle Morgan, Line Noro | See full cast and crew »"],
      "reviews": [
         "My title will enrage the highbrows,but ,after reading the notorious \"Cahiers du Cinema\" who on earth (and particularly in France) will watch a Jean Delannoy film ,cause it's \" inevitably bad\" cause Godard and co have decided it is so? \"La Symphonie Pastorale\" is a marvelous black and white movie.A simple story of a minister who takes on a little savage girl,Gertrude (a Dreyeresque name!) .For a short while ,it's got something of Helen Keller ,cause the heroine is blind when the story begins.But Delannoy focuses on the relationship between the man who's got four children and his protégée.Pierre Blanchar (it's probably his best part) and Michèle Morgan are at the top of their game and they give subtle performances.When the elder son (Jean Desailly)comes back,and falls in love with Gertrude ,the tragedy is in the air.The priest realizes he loves the girl in a way a father should not. Delannoy takes advantage of the snowy landscapes and the frozen rivers,of the tiny church where the organ becomes a mediator between Gertrude and the young man ,of an excellent cast. He has even got a sense of humor !There's a private joke .When they show Desailly the organ ,one of the men says \"Amour,Delices et Orgues!\" which was the title of a (very mediocre) previous film in which the actor was featured the same year.",
         "I had read this in high school French class and am a warm fan of Michelle Morgan, so I rented this recently. For those looking or a comedy, this is the wrong choice. This is the story of a stuffy, humorless and unimaginative married Protestant pastor with several children near a small village in the Swiss Alps,who one day, takes in a little blind girl who has just lost her mother. He raises and teaches the girl everything - and in the process gradually falls in love with her as she becomes an adult, to the great alarm of his family. His denials that he has fallen in love with her - and that he has done all he can to deny her a life independent of the family in order to keep her there, dependent on him and grateful to him, are the source of the drama. The movie is very grim. The pastor is someone any viewer will grow to hate within 5 minutes of the movie! Narrow, self-satisfied, pompous, haughty toward wife, family and congregation, he is truly unlikeable. At times, the dialogue is over the top. At times, the viewer is frustrated because if the pastor's son, or the blind girl, only articulated clearly what they wanted without this terrible deference to the lying pastor, the situation would be averted. All that said, the movie has its power. Michelle Morgan is lovely and sweet. The viewer will remember this one.",
         "La Symphonie Pastorale is a neglected classic of French cinema.It is high time tall tales about its importance are told to all cinema lovers whether in France or outside of France.It is one of those few lucky films in the history of French cinema with which some of the most important personalities of French culture have been associated. One can cite the names of Michèle Morgan,André Gide and Jean Delannoy. This film is an honest adaptation of André Gide's best book \"La Symphonie Pastorale\".Jean Delannoy has worked wonders with this film by making a star as well as talented actress out of charming Michèle Morgan.It is true that love and its implications is the major theme of this film but we also get a chance to see other sentiments such as jealousy and innocence.After viewing this film there would hardly be anyone who would not have been influenced by the heroic figure of the leading lady Gertrude.The best human experience which one can derive from this film concerns how the vision of a person changes in the course of time ? It is a wonder that this film and the book have remained free of controversies despite the presence of religion.",
         "La Symphonie Pastorale is a weak film with a disappointingly clichéd plot derived from an Andre Gide novel. The maudlin story centres on a blind girl who is left orphaned and is taken in by a Protestant pastor who raises her and later falls in love with her. The Pastor is depicted as a jealous, vindictive character who undermines his family's happiness by his lustful pursuit of the girl. Everything about this film is weak - the acting, the heavy-handed melodramatic story line and the symbolism of the church organ through which the blind girl mediates with the world. The only really redeeming aspect is the scenery which is well-filmed and provides the pastoral setting for the tale. The Alps dwarf the petty human dramas unfolding in the cabin and provide a solemn, austere backdrop perhaps reflecting the Protestant faith of the community. Other than that, the direction is workmanlike - it serves to convey the story clearly and unambiguously but there is little artistry on display. With just a little more grandeur, the film could have transcended its melodramatic narrative and positioned itself alongside the other great French works of the 1940s. The film's outcome is likewise predictable and melodramatic so perhaps any criticism from Cahiers du Cinema was well-deserved in this particular case."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Les Films Gibé"],
      "summaries": [
         "On Christmas Eve, Jean Martens, a Swiss minister, takes in a blind half-crippled orphan and brings her up with his four children. But Gertrude grows to be a woman and Jean gradually falls in love with her without admitting it to himself. On the contrary, he lulls his conscience by interpreting the Scriptures to his advantage. But neither his wife nor his oldest son are fooled. When, after a long-delayed operation, Gertrude recovers her sight she is not long to find out that sin has corrupted the soul of her benefactor. Seeing no hope in the situation, the young woman decides to take her own life.",
         "A minister falls in love with a blind young woman he sheltered, but so does his son."
      ],
      "budget": 0
   },
   "movielensId": 1157,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1946-09-26",
      "dvdReleaseDate": null,
      "directors": ["Jean Delannoy"],
      "runtime": 110,
      "movieId": 1157,
      "title": "Pastoral Symphony",
      "mpaa": null,
      "actors": [
         "Michèle Morgan",
         "Pierre Blanchar",
         "Line Noro",
         "Jean Desailly",
         "Andrée Clément"
      ],
      "imdbMovieId": "0039004",
      "originalTitle": "La symphonie pastorale",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["wPkVD4Ga35s"],
      "plotSummary": "A minister falls in love with a blind young woman he sheltered, but so does his son.",
      "tmdbMovieId": 117500,
      "avgRating": 3.32051,
      "releaseYear": "1946",
      "numRatings": 39,
      "posterPath": "/8ohlwQ7SHDsQdNXoqMsWwwZxQXc.jpg"
   }
}