{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fascism",
            "id": 1755
         },
         {
            "name": "auschwitz",
            "id": 2450
         },
         {
            "name": "typhus",
            "id": 4020
         },
         {
            "name": "victim",
            "id": 4399
         },
         {
            "name": "interview",
            "id": 4434
         },
         {
            "name": "prejudice",
            "id": 10360
         },
         {
            "name": "burglary",
            "id": 11728
         },
         {
            "name": "rabbit",
            "id": 15199
         }
      ],
      "imdb_id": "tt0112373",
      "video": false,
      "title": "Anne Frank Remembered",
      "recommendations": [],
      "backdrop_path": "/nBKHv9ODiG8TOQgpwGo0AUc01En.jpg",
      "revenue": 1,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Narration (voice)",
               "gender": 2,
               "credit_id": "573d16df9251413675000928",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Diary Readings (voice)",
               "gender": 1,
               "credit_id": "573d16f7925141367b000861",
               "name": "Glenn Close",
               "profile_path": "/fF6tCfuvuUhaePm5onUNnIE4FvL.jpg",
               "id": 515,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe47eec3a36847f814fe7d",
            "name": "Jon Blair",
            "profile_path": null,
            "id": 82293,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.779281,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         }
      ],
      "id": 51352,
      "vote_count": 5,
      "budget": 0,
      "overview": "Using previously unreleased archival material in addition to contemporary interviews, this academy award-winning documentary tells the story of the Frank family and presents the first fully-rounded portrait of their brash and free-spirited daughter Anne, perhaps the world's most famous victim of the Holocaust. Written by Dawn M. Barclift",
      "similar": [
         3396,
         1658,
         36023,
         116684,
         36022,
         180163,
         36024,
         36025
      ],
      "original_title": "Anne Frank Remembered",
      "runtime": 117,
      "poster_path": "/x2n4YIVsms3JL8qCfzrbOg2yx0x.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-06-08",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "She is perhaps Hitler's best known victim, but what was Anne Frank really like?",
      "adult": false,
      "homepage": "http://www.sonypictures.com/classics/annefrank/index.html",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jon Blair"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Jon Blair",
         "Anne Frank"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112373/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTMyOTkxMzA5N15BMl5BanBnXkFtZTcwNjU3MTUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Kenneth Branagh, Glenn Close, Anne Frank | See full cast and crew »"],
      "reviews": [
         "I first saw this documentary at the theater when it first came out in the spring of 1996, albeit in a limited art-house release in selected cities (thank God Chicago was one of them). I happened to see it at the famed \"Music Box Theater\" on Southport Avenue in Chicago to a packed audience (the same theater John Cusack takes his date to on \"High Fidelity\"). After the credits were over, the audience was so dumbstruck, not a soul moved or said a word until the theater staff turned on all the lights and dropped the curtains -- it was as if people wanted to stay and talk about it. But alas, that wasn't part of the program, and we shuffled off deep in our thoughts, although a few of us caught up later at the coffeeshop next door to talk about it. It was that moving. This is the best documentary on Anne Frank I have ever seen, and is one of the best documentaries to come out of the 1990's. It should not be missed, and should be revisted as often as possible. Kenneth Branagh's narration is gripping and beyond comparison. The tranche de la vie recounting of Anne's as well as her friends' childhood experiences from her former playmates are extremely moving. One of my favorite scenes in this documentary was the meeting filmed in 1995 between Dr. Fritz Pfeffer's (called Albert Dussel by Anne in her diary) son, Mr. Pepper, and Miep Gies. When he said \"vielen Dank\" to Miep Gies for hiding his father, there wasn't a dry eye in the house, especially when it was revealed that the son later died just weeks after the meeting. The most moving scene, however, was the serendipitously acquired 8mm black-and-white home movie footage of a wedding filmed in June of 1941 on the Merwedeplein in Amsterdam, The Netherlands (the Franks moved to Amsterdam from Frankfurt a.M., Germany in 1933). In the footage, as the bride and groom emerge from the entrance of a three-flat townhouse, the camera pans upward and catches a waving 12-year-old girl waving happily from a second-floor window. The girl is Anne Frank, and is the only motion picture footage of her known to be existence. Anne's brief bout with the silver screen continues to be one of the most haunting reminders of what could've been, hope unfulfilled, and the tragedy that was the Holocaust. A must see for all those interested in history.",
         "Through the years I've been very much interested in the life of this teenager who left such a profound, indelible mark on the world. My fascination has also been born of fear, as in, could this happen again. And throughout the ensuing years, yes, I fear 'it' continues to happen around us and of course 'it' was happening long before Anne. The 'it' of course is can a so-called civilized society turn on its own or on an innocent country/race/continent and murder citizens in cold blood on the flimsiest of excuses? I leave that question out there. At the beginning of the documentary there is a statement about the leader Adolf Hitler in that the one profound fact about Hitler that is never mentioned was that he was elected democratically and all of the atrocities committed were done as the result of a compliant poodle-press and fear-mongering propaganda played over and over again for a docile population. One of the atrocities was Anne Frank, who put a face to the death camps by the miracle of her diary's survival. Kenneth Brannagh does a wonderful job on the commentary and interviewing, he has that rare gift of minimizing his own persona thus allowing the subjects to speak for themselves. Many new facts and people never before interviewed are brought to life in the meticulous research, which I will not go into here as they add immeasurably to the reality and gut wrenching sorrow of the film. Glenn Close reads selections from the diary and her voice is perfect for the part, she brings a naiveté and freshness to the role. Old childhood friends of Anne's are interviewed at length and her last days before death are well recorded and witnessed along with her vibrant and mischievous personality. This is not to be missed. A wonderful and respectful film about the seldom seen Anne. 10 out of 10.",
         "The Diary of Anne Frank is the second best-selling nonfiction book in the world, and for good reason. Nonetheless, sitting through this documentary about her life, which fills in some of the details where the diary left off, I thought, \"Just another documentary about Anne Frank.\" I found it to be competent but not extraordinary. That was my complacent attitude because I was already well aware of the story of Anne Frank; most of what the documentary had to tell me wasn't news to me. Everything changed, though, when I got to the end of the documentary---when I saw the motion picture footage of Anne Frank. The emotional impact of seeing this footage, only a second or so long, made everything that came before it a thousand times more real---but not just everything that was in the documentary; everything I had previously known about Anne Frank suddenly became more real to me, more personal. I'd always been moved by her story, but when I saw that footage, what I felt was stronger and deeper and more profound than any other film experience of my life. (I knew beforehand that this documentary contained live footage of Anne Frank, and I'd even seen the footage in a movie review on television, but seeing it in the context of the documentary was a completely different experience. It's not likely that my mentioning it here will spoil it for anyone.) I realize now that many people still don't know the story of Anne Frank; it's discouraging at times to be witness to this kind of ignorance. I think to myself, \"How could someone NOT know the story of Anne Frank?\" This being the case, though, ANNE FRANK: REMEMBERED, along with reading her diary, is the best place to start. It's a story that everyone should know.",
         "As good as Schindler's List was, I found this movie much more powerful as it is a documentary and based on real life. It details the story of the Frank family, and Anne in particular. Although it is a bit slow moving at first (detailing their family life before the war); it becomes very powerful. Due to some of the footage and photos of the camps, I would not recommend it for children but for adults, it illustrates the horror of the Holocaust through one young girl. Highly recommended.",
         "The documentary is excellent, except for one element - the narration says \"Polish death camps\" - once and for all, please get this right - there were NO POLISH death camps! Poland was occupied by Germany and the death camps were German DEATH CAMPS SET UP BY THE Nazis! This is an important piece of history that is surprisingly perpetuated in a variety of printed and film material.\"Usage of the term has been condemned as insulting by the Polish foreign minister Adam Daniel Rotfeld in 2005, who also alleged that it\u0097intentionally or unintentionally\u0097shifted the responsibility for the construction or operation of the camps from the German to the Polish people.\" (quoting from Wikipedia) Even Obama had to apologize for using this term as late as May 2012. This wrong term must NOT be used anymore. Death camps were NAZI CAMPS, located in Nazi-occupied Poland!",
         "Your comment is completely false, her diary has been proved to be authentic. Don't know why there are people like you who lie and want to say otherwise. Suppose every site has it's trolls and idiots. Anyway this is a brilliant and moving documentary that should be seen by all. Includes interviews of people that knew Anne Frank and members of her family. Also try and see the BBC's Diary of Anne Frank which is a brilliant 5 part mini series that follows her time in hiding. The film Anne Frank: The whole story is quite good too and deals with her life before hiding, during hiding and after capture.",
         "The first half is interesting, mostly interviews with friends and neighbors of the Franks before and during their time in hiding. But so much of that basic material is familiar to any who have read the diary, or know the play that there were few revelations, and I wasn't sure what the fuss was about. But it is the second half of the film, that fills in with tremendous detail what happened to Anne and her family and friends after they were discovered, and after the diary ends that is overwhelmingly powerful. I've struggled with many films and books about the Holocaust. It's all almost too much for the mind to take in, reducing human suffering to insane numbers, or piles of dead bodies that the brain can set up a sort of emotional firewall around. That's why the most powerful piece of art about the holocaust I'd encountered before this was Elie Wiesel's \"Night\" \u0096 by reducing the nightmare to one specific young boy's experience I could finally feel the emotional impact of the fact that all these numbers and photos of mass graves were real human beings. 'Anne Frank Remembered' has that same kind of power; by focusing the holocaust to one family's very specific experience, it paradoxically makes the enormity of all the suffering real and present. And yet, like Anne Frank herself, this documentary, while overwhelmingly sad, also sees the good in people. As much as I wept (and boy did I weep) at the cruelty and death, I also wept at the courage and love shown by the friends and family who kept Anne alive, and the survivors who carry the memories of those who survived and chose to still embrace the world instead of running and hiding. How I wish I had that kind of courage and strength. A truly important document of the human experience.",
         "Anne Frank Remembered was an amazing movie! It was very emotional. The interviews with the survivors of the holocaust was very well done. It's amazing how much courage and strength they had to go through and still survived. There are some very harrowing images that are very hard to see. As someone who loves The Diary Of Anne Frank this was a must see and am very glad I was able to watch it. There was lots of information that I had never known.The interviews with Anne's friends and cousin provided great insight into her. The scene with Miep Gies meeting Albert Dussel's son was very touching. The video of Anne (the only known video of her) really hits you just how full of life she was. One of her friends mentioned that had Anne known that her Father was alive maybe she would have fought harder. We'll never know if that was true but is crushing to think about.",
         "Anne Frank Remembered (1995) *** (out of 4) With over 25-million copies of her book sold, Anne Frank is without question the most famous name of the victim's to Adolf Hitler's reign of terror during WWII. The teenager would keep a journal of her and her family's years of living in terror as they hid never knowing if someone would learn about their whereabouts or perhaps someone would tell on them. Then, of course, there was the drama of being so close with one another in such a short space, which just added to the drama as the outside world was falling apart. I think this is far from the perfect documentary for a number of reasons including a pacing issue, which I felt really made the film drag at spots. I'd also say that the documentary loses focus throughout and there are times where items other than Anne are being covered and they're just not nearly as interesting. With that said, the film is still very much worth seeing but in large part due to Miep Gies who was the main person who kept the family hidden and didn't give away their secret. It's pretty amazing getting to hear from someone so close to the events and not to mention that she not only helped the family but she was the one who discovered the diary. Hearing her tells her stories are without question the highlights of the film and this includes some pretty emotional stuff as she tells about the family being taken away from their location and of course the father having to learn that he was the only one who survived the Holocaust. I think the film probably would have been much better had it focused on her because there's no question that things aren't as sharp when she's not on the screen. The film is certainly worth seeing just for her but those interested in Anne Frank would probably be better served by either reading the actual book or watching the 1959 movie.",
         "A documentary on the life of Anne Frank, a Jewish girl whose family lived in hiding from the Nazis in a secret annexe in Amsterdam between 1942 and 1944, and whose book Het Achterhuis (translated as The Diary Of A Young Girl) has become symbolic of the horrors of the Second World War and is perhaps the most famous diary in history. The story of Anne Frank is many things - uplifting, heartbreaking, profound - and this Academy Award-winning documentary is a fascinating and deeply moving study of her life and the abhorrent anti-Semitism of World War II. It details Anne's family's early life in Frankfurt, their move to Holland, their father's careful plans to hide out the war in the secret rooms of his company office, life in hiding, their betrayal by an unknown informer, and the horrors of Auschwitz and Bergen-Belsen, where Anne and her sister Margot both died of typhus. It is a particularly intimate and touching film because of the participation of two women; Gies, who helped protect the Franks and rescued Anne's diaries when the Franks were captured, and Goslar, a close friend of Anne's from pre-war days who was imprisoned in a neighbouring labour camp. These women's courage, intelligence and humanity is simply extraordinary, and the candour with which they celebrate Anne's life is deeply moving, as are the testimonies of everyone else who knew her. Anne's strength lies in her universal free spirit; she was not perfect - by all accounts spoiled, precocious and short-tempered - but she was her own person, with a talent, imagination and desire to make her mark on the world. Everyone can identify with her, which makes the senseless obscenity of a war politic that murders innocent fifteen-year-old girls for the sake of their racial background all the more incomprehensible. Goslar sums it up eloquently, saying, \"I cannot judge this whole period. Nobody can understand it I think.\". The film concludes with an astonishing image; a few seconds' film of Anne standing at her window on the Merwedeplein, taken by an amateur cameraman filming a wedding in the street. There she is - a symbol of hope in the face of bigotry and hatred. With excellent music by Carl Davis, terrific narration by Branagh and Anne's diary excerpts read by Richardson. The film was financed by Blair, the BBC and the Disney Channel, and received a limited but well-deserved theatrical release."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "War"
      ],
      "productionCompanies": [
         "Anne Frank House",
         "British Broadcasting Corporation (BBC)",
         "Disney Channel"
      ],
      "summaries": ["Using previously unreleased archival material in addition to contemporary interviews, this academy award-winning documentary tells the story of the Frank family and presents the first fully-rounded portrait of their brash and free-spirited daughter Anne, perhaps the world's most famous victim of the Holocaust."],
      "budget": 0
   },
   "movielensId": 116,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-06-08",
      "dvdReleaseDate": "2004-03-09",
      "directors": ["Jon Blair"],
      "runtime": 117,
      "movieId": 116,
      "title": "Anne Frank Remembered",
      "mpaa": "",
      "actors": [
         "Kenneth Branagh",
         "Glenn Close"
      ],
      "imdbMovieId": "0112373",
      "originalTitle": "Anne Frank Remembered",
      "genres": [
         "Documentary",
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["HFMnh-n7U7w"],
      "plotSummary": "Using previously unreleased archival material in addition to contemporary interviews, this academy award-winning documentary tells the story of the Frank family and presents the first fully-rounded portrait of their brash and free-spirited daughter Anne, perhaps the world's most famous victim of the Holocaust. Written by Dawn M. Barclift",
      "tmdbMovieId": 51352,
      "avgRating": 3.91795,
      "releaseYear": "1995",
      "numRatings": 1042,
      "posterPath": "/x2n4YIVsms3JL8qCfzrbOg2yx0x.jpg"
   }
}