{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "embezzlement",
            "id": 163072
         },
         {
            "name": "cross country trip",
            "id": 188717
         }
      ],
      "imdb_id": "tt0025799",
      "video": false,
      "title": "Six of a Kind",
      "recommendations": [],
      "backdrop_path": "/xPA8OU74hm5YEKiBuDqMxFAAv5M.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "J. Pinkham Whinney",
               "gender": 2,
               "credit_id": "52fe4b0ec3a368484e17554d",
               "name": "Charles Ruggles",
               "profile_path": "/mYzf9Vq3rFizQwk5cXJBFSYAcJI.jpg",
               "id": 2436,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Flora Whinney",
               "gender": 1,
               "credit_id": "52fe4b0ec3a368484e175551",
               "name": "Mary Boland",
               "profile_path": "/41fxfIYTR3hEVv0rm2rvYhS3nup.jpg",
               "id": 88870,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sheriff John Hoxley",
               "gender": 2,
               "credit_id": "52fe4b0ec3a368484e175555",
               "name": "W.C. Fields",
               "profile_path": "/hPUjAJE8HAzMJhH1oc2p3mdDAVj.jpg",
               "id": 13954,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "George Edward",
               "gender": 2,
               "credit_id": "52fe4b0ec3a368484e175571",
               "name": "George Burns",
               "profile_path": "/4Uw1GXgr21eSMWDZiAQkIXg5axL.jpg",
               "id": 80625,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Gracie Devore",
               "gender": 0,
               "credit_id": "52fe4b0ec3a368484e175575",
               "name": "Gracie Allen",
               "profile_path": "/obRJIzDzeBEu8izy9E2mpVNO4Mw.jpg",
               "id": 109896,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Mrs. K. Rumford",
               "gender": 1,
               "credit_id": "52fe4b0ec3a368484e175579",
               "name": "Alison Skipworth",
               "profile_path": "/31okBT6NukBP0Pon266W06yJQSv.jpg",
               "id": 131234,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Ferguson",
               "gender": 0,
               "credit_id": "52fe4b0ec3a368484e17557d",
               "name": "Bradley Page",
               "profile_path": "/sCKJ3kzWIfZ0LaFZYQwlMXAYetl.jpg",
               "id": 980450,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Goldie",
               "gender": 1,
               "credit_id": "52fe4b0ec3a368484e175581",
               "name": "Grace Bradley",
               "profile_path": "/wHpWbDt9tua4oqCfC7iBYiQSihx.jpg",
               "id": 148397,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Gillette",
               "gender": 0,
               "credit_id": "52fe4b0ec3a368484e175585",
               "name": "William J. Kelly",
               "profile_path": null,
               "id": 120071,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Clerk in Newspaper Office",
               "gender": 0,
               "credit_id": "52fe4b0ec3a368484e175589",
               "name": "Phil Tead",
               "profile_path": "/hMMNH7wltsJMoepjbZXrwfl5zkV.jpg",
               "id": 153277,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Detective (uncredited)",
               "gender": 2,
               "credit_id": "52fe4b0ec3a368484e17558d",
               "name": "James Burke",
               "profile_path": "/s01DJdyVjmF0f6fXIGzsDHjPVGs.jpg",
               "id": 14453,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Woman (uncredited)",
               "gender": 1,
               "credit_id": "52fe4b0ec3a368484e175591",
               "name": "Kathleen Burke",
               "profile_path": "/s8Yp7ByWW8toWVZlL7EswUFGVqp.jpg",
               "id": 29761,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b0ec3a368484e175549",
               "name": "Leo McCarey",
               "profile_path": "/l66PVNnScSS20J5nff1mqyNgOge.jpg",
               "id": 30008,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b0ec3a368484e17555b",
               "name": "Keene Thompson",
               "profile_path": null,
               "id": 1050219,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b0ec3a368484e175561",
               "name": "Douglas MacLean",
               "profile_path": "/wt6VFNraMN8TLwhY8KkVVK3mhsE.jpg",
               "id": 1009637,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0ec3a368484e175567",
               "name": "Walter DeLeon",
               "profile_path": null,
               "id": 233111,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0ec3a368484e17556d",
               "name": "Harry Ruskin",
               "profile_path": null,
               "id": 33029,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.081151,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 127973,
      "vote_count": 2,
      "budget": 0,
      "overview": "The Whinneys share expenses for their trip to Hollywood with George and Gracie and their great Dane. A clerk in Whinney's bank has put fifty thousand dollars in a suitcase, hoping to rob Whinney on the road, but instead Whinney takes another road and is himself arrested in Nevada.",
      "similar": [
         257091,
         92591,
         24405,
         8999,
         21950,
         43802,
         42659,
         43259,
         52280,
         189930,
         179113,
         154537,
         30390,
         260939,
         43307,
         111712,
         43877,
         479201,
         294651,
         28713
      ],
      "original_title": "Six of a Kind",
      "runtime": 62,
      "poster_path": "/jgFaWCqzv27kzscpAM6sSHPjuz7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1934-02-09",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Leo McCarey"],
      "runtime": 62,
      "synopsis": null,
      "writers": [
         "Keene Thompson",
         "Douglas MacLean"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025799/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5NzQ5MjU0NV5BMl5BanBnXkFtZTgwMzIyMzQwMjE@._V1_SY317_CR27,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Ruggles, Mary Boland, W.C. Fields | See full cast and crew »"],
      "reviews": [
         "It is not always certain that by mixing comedians together you will produce laughter. The comics involved have to actually like or admire each other, or be willing to put up with each other's crankiness. GO WEST with the Marx Brothers had Buster Keaton write the script as a gag man. Groucho did not think too highly of Keaton's ideas, and embarrassed him at a script meeting. And though some of Keaton's gems still appear in the finished film (such as the gun that turns into a brush that turns into a gun) the film was one of the weakest the Marx Brothers ever made. A better film, but also affected by dueling comic egos, was W.C. Fields and Mae West in MY LITTLE CHICKADEE, which jettisoned the script for a series of duels of one liners between the leads. But the one liners were equally funny, so the film remains a success. But SIX OF A KIND is an example of six film comics who worked well together. The reason is simple: it is really three comic teams working together: Charlie Ruggles and Mary Boland, George Burns and Gracie Allan, and W.C. Fields and Alison Skipworth. Ruggles and Boland were paired in about half a dozen comedies during the 1930s, usually with Boland as a somewhat bossy wife, and Ruggles as a nervous wreck of a husband. Fields (usually a single act) was paired three times with Skipworth (TILLY AND GUS and IF I HAD A MILLION were the other two times). Skippy always figured out how to control or counter the larcenous activities of her man - it the present film she takes action into her own hands with the stolen money that is being searched for (she knows that the local sheriff, Fields, is not the one to trust with this). As for Burns and Allan they manage to effortlessly involve themselves with the put upon Ruggles and Boland on their cross-country trip by car. Ruggles quickly gets to realize what a mistake it was to agree to travel with Gracie - at one point she manages to cause him to fall off a cliff, and dangle from a branch. He is relatively helpless when she insists on 1) photographing him on his perch, and 2) correcting his grammar. The presence of George and Gracie's humongous dog (\"Ran Tang Tang\" is it's name) does not make travel arrangements easier for Charlie and Mary. Fields has some choice moments. When he insists on shouting at the quartet, he says he's allowed to do so - he's the sheriff! He also explains, during a pool game, the improbable story of how he got his undeserved moniker \"Honest John\". You have to listen carefully to the tale, as it is interrupted with his attempts to play pool a few times (once getting accidentally beaned by a billiard ball), but it does show that there were items that even Fields would have had no reason to steal. Oh, in the \"Summary Line\", I mentioned a forgotten actor named Bradley Page - he was the man who is responsible for the trouble that Charley Ruggles is suspected of. Bradley has to have a reason to leave town in order to catch up with the unwary Ruggles and Boland, so he telephones his girl friend. He tells her to call back his job and say that he has to leave town because somebody has died. There is a pause as he apparently hears a question shot back by the girlfriend. \"ANYBODY!\", he says - clearly annoyed. Although the bulk of the humor in the film is carried by the sextet of performers, Mr.Page happened to have the most amusingly unexpected line in the film.",
         "That was one of the lines in a trailer about this film and for once the publicists did not exaggerate. All six of the featured players here are on the screen 99% of the time, so they have to be good. It's always fascinating how certain plot premises can be worked for either highballing comedy to a deadly serious situation. Mary Boland of the ditzy and Charlie Ruggles of the henpecked play their usual characters who are planning to motor all the way to California. To share expenses they advertise for someone to share the ride. They get Burns and Allen and a monster of a dog. That same premise was a deadly serious one several generations later in Kalifornia. Of course if you're traveling with Gracie Allen you know you're going to be going absolutely nuts trying to figure her Monty Pythonesque reasoning about the whole world. And if that ain't enough you get to run into W.C. Fields, part time sheriff and full time pool hustler who's living in sin with Alison Skipworth. But back then we didn't delve into such things. A real classic comedy from the thirties, not to be missed.",
         "Three zany couples, all SIX OF A KIND, become entangled in a madcap search for stolen bank loot. This is a lively, hilarious comedy, with the six stars - Charlie Ruggles & Mary Boland, W. C. Fields & Alison Skipworth, George Burns & Gracie Allen - all heartily engaged in doing what they did best: getting laughs. Ruggles & Boland make another of their film appearances as husband & wife - this time rather more amorous than usual. They were a perfect team - she the strident lioness, he the nervous rabbit - and they dominate most of the screen time here. From beginning to end, they are a delight. Burns & Allen continue the patter they originated in Vaudeville, perfected on radio & would eventually take to television, with George the perpetual straight man & Gracie the eternal fool. At times in the film she tends to go a bit over the top, but it's difficult to dislike her. Her heart was obviously made of solid gold. While Skipworth is given rather short shrift - only fragments of her formidable personality flash through - Fields is in his element as the disreputable sheriff of Nuggetville, Nevada. Whether explaining how he got the nickname \u0091Honest John' or skulking about at night looking for the missing moola, he is never less than wonderful. Best of all, he gets to perform his entire classic pool routine, preserving it forever for a grateful posterity. Finally, he executes the near miraculous - he gets Gracie to shut up. Paramount was so pleased with the success of SIX OF A KIND that they wanted to hurry the principle players into another comedy. Only Fields demurred. He felt he had now arrived at the point where he no longer needed to share a movie with other celebrity comics. The Studio finally agreed and began preparation of Fields' first solo starring feature, YOU'RE TELLING ME (1934).",
         "The idea in this is to take three comedy teams and combine them in one movie. The gimmick is that these represent three radically different types of humor. What happens usually is people find some things funny and ignore the others. Scan through these IMDb comments and you will see grace fall on different players in this. The Fields poolplaying routine is priceless. I've seen it before but cannot recall where. But its inserted into this project without reference to anything else. Incidentally, it works as well as it does because there is a watcher in the frame, a deadpan face that is every bit as valuable and practiced as the actor. That's indicative of how the experiment fails as a whole. If you know \"Mad Mad Mad World,\" you'll know a successful example where comedic methods actually do bump up against each other and generate something resonant, rich, higher. In this case however, the comedic models take turns. Isn't as effective. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "A must for anyone who wants an example of a comedy that's just wonderfully ridiculous, \"Six of a Kind\" is a road-trip movie that's absolute nonsense. Ruggles and Boland make you laugh at them, with them, and for them; Burns and Allen take silly to a new level; and Fields and Skipworth show up later in the game to round out this sextette of psychos. Fields' billiard scene (reworked from one of his earlier films) is not to be missed.",
         "Comedy can date more rapidly than drama, generally. Certainly, the comedy of Burns and Allen (while still unique) is of its era. In fact, they perfected their act in their 50s TV series -- which is still delightful if you can find it. But the value of \"Six of a Kind\" is more an artifact of particular players forever captured on film. Mary Boland is always excellent and she's wonderful here (but at her best a few years later in \"The Women\"). Charlie Ruggles essentially played the same role all his career and nobody plays Charlie Ruggles better. Alison Skipworth is barely utilized at all, here. It's the preservation of W.C. Fields' immortal \"Honest John\" routine from vaudeville that earns \"Six of a Kind\" its place in film history. It's difficult to imagine how this routine worked from the distance of a stage. But on film it's a miracle of comic construction, timing, delivery and skill (yes he actually ricochets that billiard ball off the far end of the table where it bounces back and hits his forehead). The routine is hypnotic and hysterical, and perfectly pitched for film.",
         "SIX OF A KIND (Paramount, 1934), directed by Leo McCarey, might indicate a movie about a card game but actually is a road trip story featuring a combination of three popular screen teams of Charlie Ruggles and Mary Boland; George Burns and Gracie Allen; and W.C. Fields and Alison Skipworth. Ruggles and Boland are the central characters, Burns and Allen take the back seat as the secondary couple along for the ride, while the final twosome, Fields and Skipworth, arriving during the its final half, acquiring less screen time than the others, all gathered together for this one of a kind comedy. The story revolves around J. Pinkham Whinney (Ruggles), a teller at the Second National Bank, and his wife, Flora (Boland) of twenty years, preparing for their two week vacation/ second honeymoon on a road trip to California. Flora, who has placed an advertisement in the Daily Morning Globe for another couple to accompany them and share expenses, acquires the company of George Edwards and Miss Gracie DeVore (Burns and Allen), along with their great Dane, Rang-Tang-Tang. To make matters worse, Pinky unwittingly has $50,000 of stolen bank money placed in his suitcase by fellow bank clerk Ferguson (Bradley Page) with the intention of taking back the cash at Whinney's first stop at Glen Falls Hotel in Glen Falls, and leaving town with his girlfriend, Goldie (Grace Bradley). With George and Gracie doing some back seat driving, Whinney ends up taking another route to Philipsburg, getting themselves lost, robbed by a couple of tramps (Walter Long and Leo Willis), and ending up in the small town of Nuggetville, Nevada, where the Whinneys register at the Palace Hotel run by Mrs. K. Rumford (Alison Skipworth). Because they are unable to pay for their rooms (having Whinney and George sharing one room and Gracie and Flora in another), Mrs. Rumford decides to take Whinney's suitcases as security. Going over the contents with \"Honest John\" Huxley (W.C. Fields), the town sheriff who is anything but honest, acting as her witness, she encounters $50,000 hidden inside. Further complications arise for Whinney when detectives (James Burke and Dick Rush), hired by the bank, enter the scene, suspecting him of stealing the money with plans of going away with Goldie which leaves Flora in a state of shock. At 62 minutes, SIX OF A KIND has all the ingredients of a two-reel comedy in feature length form. With Ruggles and Boland doing what they do best, their scenes are nearly overshadowed by the annoying antics of Burns and Allen, whose very presence makes it totally impossible for the Whinney's to have a moment alone together. One scene finds Gracie taking Flora's picture as she stands by the ledge, causing her to fall over when told to move back, revealed in a harrowing predicament resting on a limb over the Grand Canyon. Another scene taking place in a store has George falling victim to Fields while attempting to buy a sweater. Nothing could really compare with the best known sequence of all with Fields attempting to play a game of pool and asked repeatedly by a character named Busby (Tammany Young), \"How did you get to be called Honest John?\" While SIX OF A KIND is notable as a W.C. Fields film, this being his third and final opposite Alison Skipworth, whom he affectionately calls \"Duchess\" this time around, the movie was distributed on video cassette in 1996 as part of the Burns and Allen comedy collection, commemorating the 100th birthday of George Burns. A decade later, SIX OF A KIND was placed onto DVD, triple featured with other lesser known Burns and Allen 1935 releases, LOVE AND BLOOM and HERE COMES COOKIE, preceded with theatrical trailers. Out of the television markets since the 1980s, SIX OF A KIND was given a rare screening on Turner Classic Movies in June 2001 as part of its tribute to \"Star of the Month\" W.C. Fields. A silly comedy at best made credible by the six pack accompanied by a deuce with half a deck named Gracie. (***1/2 jokers)",
         "Poor Charlie Ruggles. He has plans for his second honeymoon with wife Mary Boland and ends up with more than he bargained for, not to mention a Great Dane. You see, flibbertigibbet wife Boland has graciously advertised for a couple to share expenses with on the road, and they end up with Burns and Allen. Gracie, whose proudest moment is the three glorious years she spent in the fifth grade, owns the humongous canine who insists on sitting in the front seat then shows his gratitude by pushing driver Ruggles over a cliff! That's one pooch that can forget about his milk bone. Troubles erupt, not just because of Gracie being always in the wrong place at the wrong time, but an embezzler (Bradley Page) at the bank Ruggles works at who switches suitcases with him in order to get the money out of the branch. But Ruggles leaves with it, and Page must get it back in order to pacify his moll (Grace Bradley). On the road, the gang encounter a group of road robbers, then check into the motel owned by suspicious Alison Skipworth who along with her dipsomaniac sheriff pal (W.C. Fields) learn of the embezzling. Amusing complications occur throughout with Ruggles yearning for time alone with his beloved wife. This extremely short comedy has six stars and lots of opportunities for them to do what they do best. Fields shows off his pool routine (the same one he did 10 years later in \"Follow the Boys\" which I ironically saw again only a few days after this!), while Allen tells Burns about her wacky family, including an infant with three feet. Page, with his thin mustache and dour personality, was a type-cast villain with a voice that instantly gave him the image of smarmy characters who whether criminals or businessmen you don't trust from the minute you see them. The ending wraps the film up very nicely with a conclusion that couldn't have been done a few months later thanks to the strict production code that came into effect.",
         "Six of a Kind (1934) *** (out of 4) A couple (Charles Ruggles, Mary Boland) are about to go on their second honeymoon when the wife gets the bright idea to save some money by placing an ad in the paper hoping to get another couple to go along and share expenses. A couple (George Burns, Gracie Allen) agrees to go but it's just one disaster after another especially when they get to a small town with a mixed up sheriff (W.C. Fields). Considering the cast you'd think this Leo McCarey comedy would be much better known but it's pretty much been forgotten over time. While it's far from a classic comedy there are enough good moments to make it worth sitting through and especially with a 62-minute running time. The biggest thing going against the movie is its screenplay, which really isn't all that good. At just 62-minutes it seems as if the movie is broken down into six, ten-minute vignettes and it really gives the movie a somewhat uneven film. With that said, enough of those vignettes work thanks in large part to the cast. Ruggles and Boland are very good together and share some great comic timing and especially in some early scenes dealing with how much she paid for the ad. Burns and Allen really don't get too much to work with as the screenplay pretty much keeps him in the background while she gets to play dumb. Even Fields role isn't the greatest but the comic legend does what he can with it. The real star of the film goes to the wonderful dog who is downright hilarious during his scenes and especially the ones where he's pushing Ruggles around.",
         "In 1933, Leo McCarey directed the best Marx Brothers movie, \"Duck Soup\". One year later, he directed \"Six Of A Kind\": it may not be quite in the same league, but it is made with a similar anarchic, lively sensibility. It's also quite daring for its time (\"Why don't you go to bed?\" - \"That was the intention\"!). Personally I am not so familiar with any of the comic actors in this film, but evidently I should fix that: Gracie Allen is totally dissociated from common sense and often hilarious (not to mention pretty cute and huggable!), Mary Boland and Charlie Ruggles have a wonderful, warm chemistry as a loving middle-aged couple, while W.C. Fields plays a Western-type precursor to Inspector Clouseau. The first half is (arguably) slightly funnier than the second, but the whole film is so short (about an hour long) that you probably won't notice. *** out of 4."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "The Whinneys share expenses for their trip to Hollywood with George and Gracie and thier great Dane. A clerk in Whinney's bank has put fifty thousand dollars in a suitcase, hoping to rob Whinney on the road, but instead Whinney takes another road and is himself arrested in Nevada.",
         "J. Pinkham Whinney, a conservative bank clerk, and Flora, his wife of twenty years are going on a second honeymoon, a long overland two week car trip to Hollywood which will limit them to only a day in Tinseltown. Flora makes the error of advertising for a car-pooling couple in order to save expenses and they end up with ditsy George Edward, his lightheaded girlfriend Grace and their huge mastiff. The three passengers cause no end of discomfort and annoyance to the Whrinneys in their small car, In addition, 'Pinky' is unknowingly transporting a suitcase filled with $50,000 embezzled from the bank courtesy of one of his larcenous co-workers. Whinney unwittingly carries it cross county until they reach Nevada and meet another dizzy couple, Sheriff John Hoxley and the eccentric Mrs. K. Rumford.",
         "When a respectable middle-class couple take a cross-country trip by auto, they share expenses with a decidedly oddball couple, none of whom know the car carries embezzled funds."
      ],
      "budget": 0
   },
   "movielensId": 1160,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-02-09",
      "dvdReleaseDate": "2003-02-04",
      "directors": ["Leo McCarey"],
      "runtime": 62,
      "movieId": 1160,
      "title": "Six of a Kind",
      "mpaa": "",
      "actors": [
         "Charles Ruggles",
         "Mary Boland",
         "W.C. Fields",
         "George Burns",
         "Gracie Allen",
         "Alison Skipworth",
         "Bradley Page",
         "Grace Bradley",
         "William J. Kelly",
         "Phil Tead",
         "James Burke",
         "Kathleen Burke"
      ],
      "imdbMovieId": "0025799",
      "originalTitle": "Six of a Kind",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["YvFsgjoXuUI"],
      "plotSummary": "The Whinneys share expenses for their trip to Hollywood with George and Gracie and their great Dane. A clerk in Whinney's bank has put fifty thousand dollars in a suitcase, hoping to rob Whinney on the road, but instead Whinney takes another road and is himself arrested in Nevada.",
      "tmdbMovieId": 127973,
      "avgRating": 3.17045,
      "releaseYear": "1934",
      "numRatings": 44,
      "posterPath": "/jgFaWCqzv27kzscpAM6sSHPjuz7.jpg"
   }
}