{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "vietnam war",
            "id": 2957
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "cult director",
            "id": 155167
         },
         {
            "name": "nursery",
            "id": 180751
         },
         {
            "name": "film-essay",
            "id": 180754
         },
         {
            "name": "quotation",
            "id": 180756
         }
      ],
      "imdb_id": "tt0060304",
      "video": false,
      "title": "2 or 3 Things I Know About Her",
      "recommendations": [
         50785,
         8075,
         1626,
         40652,
         113479,
         31522,
         42206,
         34181,
         126202,
         29369,
         9797,
         21135,
         41391,
         124,
         42536,
         69605,
         122683,
         753,
         89688,
         84823
      ],
      "backdrop_path": "/htIrTi5WK4XyGYLa3fHBaKgH3Zy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Monsieur Gérard",
               "gender": 0,
               "credit_id": "52fe4491c3a36847f809d783",
               "name": "Joseph Gehrard",
               "profile_path": null,
               "id": 53911,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Juliette Jeanson",
               "gender": 1,
               "credit_id": "52fe4491c3a36847f809d787",
               "name": "Marina Vlady",
               "profile_path": "/ahihmtkWXCND8bLiMlcPjGfHlth.jpg",
               "id": 14813,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Marianne",
               "gender": 1,
               "credit_id": "52fe4491c3a36847f809d78b",
               "name": "Anny Duperey",
               "profile_path": "/qu7goZBv9ETl8BbIagaCPzNwQ0O.jpg",
               "id": 24475,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Robert Jeanson",
               "gender": 0,
               "credit_id": "52fe4491c3a36847f809d78f",
               "name": "Roger Montsoret",
               "profile_path": null,
               "id": 53912,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "John Bogus",
               "gender": 2,
               "credit_id": "52fe4491c3a36847f809d793",
               "name": "Raoul Lévy",
               "profile_path": null,
               "id": 37775,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Roger",
               "gender": 0,
               "credit_id": "52fe4491c3a36847f809d797",
               "name": "Jean Narboni",
               "profile_path": null,
               "id": 53913,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Girl talking to Robert",
               "gender": 1,
               "credit_id": "5692c8889251416557000418",
               "name": "Juliet Berto",
               "profile_path": "/5ene8zcRp8ppEE8KEmQfC1SyfOi.jpg",
               "id": 18228,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4491c3a36847f809d77f",
               "name": "Anatole Dauman",
               "profile_path": null,
               "id": 2304,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4491c3a36847f809d79d",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4491c3a36847f809d7a3",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59da67f992514125050449bc",
               "name": "Raoul Lévy",
               "profile_path": null,
               "id": 37775,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59da68009251412514047e18",
               "name": "Raoul Coutard",
               "profile_path": "/xfAtBAME3A4vb4uXkWAjtsasRBZ.jpg",
               "id": 3540,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59da6806c3a36862270430ba",
               "name": "Françoise Collin",
               "profile_path": null,
               "id": 28097,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59da680e925141252c044e02",
               "name": "Chantal Delattre",
               "profile_path": null,
               "id": 36522,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "59da68159251412514047e37",
               "name": "Gitt Magrini",
               "profile_path": null,
               "id": 18214,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59da681ec3a36861ec045ef2",
               "name": "Isabelle Pons",
               "profile_path": null,
               "id": 1902548,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "59da686e92514124c904690b",
               "name": "Charles L. Bitsch",
               "profile_path": null,
               "id": 25059,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.00367,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 8074,
      "vote_count": 43,
      "budget": 0,
      "overview": "The story of a housewife who must work the streets to earn an extra living - and who becomes the starting point for a larger socio-political essay.",
      "similar": [
         13,
         2142,
         3134,
         1368,
         1369,
         298312,
         28,
         205,
         769,
         4771,
         600,
         281,
         11778,
         339692,
         281957,
         395834,
         2604,
         445954,
         10285,
         431
      ],
      "original_title": "2 ou 3 choses que je sais d'elle",
      "runtime": 100,
      "poster_path": "/1umitwqhO4jO3hOq4TuSLG2ICtT.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Argos Films",
            "id": 6116,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Anouchka Films",
            "id": 14679,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films du Carrosse",
            "id": 53,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Parc Film",
            "id": 14680,
            "origin_country": ""
         }
      ],
      "release_date": "1967-03-17",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean-Luc Godard"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Catherine Vimenet",
         "Jean-Luc Godard"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0060304/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI0MjczNzAzOV5BMl5BanBnXkFtZTcwOTM4NjE3Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joseph Gehrard, Marina Vlady, Anny Duperey | See full cast and crew »"],
      "reviews": [
         "There is something sublime about this film; whether it is the perspective, the idea behind the story (from an article about married women living in the new flat buildings of Paris suburbs taking on part-time prostitution) or the often sublime sequencing of events, there is a continuity of thought at work behind it, the continuity of the artist (as film maker, painter, philosopher) at work. The film has elements of meditation, social comment, and faith which seeks not just to analyse or explain what is is to live in this modern world (since, as Godard observed, living in Paris inevitably involves some form of prostitution) - but to put meaning back into it again, to raise ideas and thought about observing this life, to speculate. So the ideas about a superficial love of products (cars, washing powder, magazine) may seem a little dated and old-school post-modernist for us, but how many directors tackle the questions so openly, artistically and honestly, on a multitude of levels all at once? The film is about Godard's eye and mind of course, secretly feeding dialogue directly to his actress with microfone and earpiece (fulfilling Renoir?), as well as fulfilling a cinematic history of boys filming girls. The coffee cup analogy of consciousness emerging, the car wash scene, the tripartite openness of the film, the perspicacity... there is too much to say about this film. If only there were novelists or writers around who could do the same, with such beauty. rino breebaart",
         "Godard rejects his `all you need to make a film is a girl and a gun' theory in Two or Three Thing I Know About Her. The 'her' refers to Paris rather than the female protagonist and the only gun apparent is a toy that belongs to her son. The inspiration for the film came from an article on housewife prostitution. Godard consequently examined his theory that to live in Paris (in 1966) one had to prostitute oneself to survive. The narrative is shot through the eyes of Juliette (Marina Vlady), a Parisian housewife. She prostitutes herself weekly in the vain hope that she will be able to buy happiness and escape the high rise Parisian suburb where she lives with her husband and young son. Two or Three Things I Know About Her is a skillfully composed visual essay. It is an astounding collage of images that acknowledges the transformation of modern society into a technological monstrosity. As the principal strength of the French New Wave, Godard created a masterpiece that comes across as revolutionary and modernist over thirty years subsequent to its conception.",
         "Do you go to the movies expecting to exhilaration, emotion? Maybe this film is not for you. Godard once said, \"I don't think you should FEEL about a movie. You should feel about a woman. You can't kiss a movie.\" The film does have enough spice to tantalise prurient tastes (middle-class part-time hooker). Yet our storyline is no tempestuous avalanche of excitement crashing to a windswept climax. Godard uses it as an attack on fiction itself. In doing so he questions how we fictionalise our very lives. Buying into lifestyles or accepting dominant themes in merchandising and politics. \"Pax Americana: jumbo-sized advertising,\" as a voice-over proclaims. Performances are excellent. Cinematography has plenty of Godard's hallmark, arresting features. The film integrates a political kick more successfully than many of his attempts. But the real thrill is an intellectual one. 2 or 3 Things I Know about Her appeals to the philosophically inclined. For this viewer, it is a film to watch and re-watch many times, enjoying the test of ideas. A work of great beauty. It also transports Godard to being more than just a filmmaker. An exemplary demonstration and examination of Brechtian technique, it is more than a purely cinematic use of Bernold Brecht's 'alienation' effect. Godard uses it to make the viewer examine the nature sensory perception and the almost existential convenience of any definition of truth. Peter Wollen, in his essay 'Godard and Counter Cinema', described how the director was working towards a political rationale for his attack on fiction. Fiction=mystification=bourgeois ideology. But Wollen acknowledges that initially Godard's fascination is more connected with, \"the misleading and dissembling nature of appearances, the impossibility of reading an essence from a phenomenal surface, of seeing a soul through and within a body or telling a lie from a truth.\" The basis for all this is a story of Paris \u0096 it could be the 'her' of the title. Galloping consumerism. Policies determined by economics, not people. Demolition and construction at an alarming pace. While the ordinary decent person cannot keep up. \"If you can't afford LSD buy a colour TV.\" Our 'ordinary decent person' is an attractive woman on the balcony of high-rise. Our voice-over describes a few things about her. As she turns her head, he describes her again. Same description. Different name. The first time, the real actress (Marina Vlady). Then she is the character, Juliette Janson. \"Her hair is dark auburn or light brown,\" says the voice-over, \"I'm not sure.\" The voice-over (Godard himself in a conspiratorial whisper) switches back and forth between politics and Juliette's situation, leaving us in no doubt over parallels. The two are then linked diegetically: \"The government is disrupting the nation's economy, not to mention its basic moral fibre.\" Johnson's futile bombing campaigns in the Vietnam also come under attack. One of Juliette's clients is a war reporter. She does a 'double / all-nighter' with her colleague Marianne which includes parading naked with flight bags over their heads. We are treated to intercut pictures of napalmed victims. Although it is one of Godard's cleverest and most rounded attacks on capitalism, the film comes into its own as he questions the nature of reality, neatly linked up using gender politics. \"What is language, Mummy,\" asks Juliette's youngster. \"Language is the house man lives in,\" she answers. Examples of male-dominated language pervade the film, from street hoardings to bright signage (both used as intertitles). Language is not 'objective' and defines how we view things rather than just what they 'are'. Juliette's husband is proud of how clever she is, finding a car at a 'bargain' price. She doesn't reveal to him how she is helping things along. Juliette is objectivised, both in the story \u0096 with our conscious collusion \u0096 and by her habit of turning to the camera to address us directly as Vlady, the actress commenting on the character, speaking about her and through her. Yet Godard attempts to rise above male-orientated perception. \"Should I have talked about Juliette or the leaves . . . since it's impossible to do both at once?\" Perhaps our use of language extends to our thinking, where it can be equally subverted. \"Now I understand the thought process,\" says Juliette, \"It's substituting an effort of the imagination for an examination of real objects.\" A more precise definition is developing. What is an object? It is something we pass from subject to subject to allow us to live together. Arbitrary agreements, a language, an arbitrary 'reality.' But it is not all dour. Take love. \"True love changes you, false love leaves you as you are.\" Juliette seems unaffected by her double life as a hooker. She applies garish red lipstick before servicing a client. (But her studied indifference would tend to make her, one must assume, a rather unappealing prostitute in real life.) And as Godard lifts our spirits more with thoughts of leaves and children than of the depredation he has critiqued, we are lifted to savour the divine inspiration of a seeker after truth. \"One must always be sensitive to the intoxication of life.\" He says. Which can be taken both ways. Both the leaves and Juliette, \"trembled slightly.\" A particularly beautiful sequence is when Juliette says, \"You can describe what happens when I do something without necessarily indicating what makes me do it.\" She sheds a tear. \"This is how, 150 frames later . . ..\" 2 or 3 Things I Know about Her also contains perhaps the most legendary close-up of a cup of coffee ever made. Foamy swirls appear only to disappear again. Visual metaphor appearing and dissolving.",
         "\"I had a dream last night, you know. I was walking all alone at the edge of a cliff. The path was only wide enough for one person. Suddenly I saw two twins walking toward me. I wondered how they would get past. Suddenly one of the twins went towards the other and they became one person. And then I realized that these two people were North and South Vietnam being united.\" -- Christophe, Juliette's young son In the opening moments of the film, Godard introduces us--with his famous whispering narration--to Marina Vlady, the actress who will play our protagonist \"in a few frames,\" to paraphrase. He repeats what he says, only a few frames later, this time introducing her as Juliette. [i]This[/i] is what cinema is. A movie that isn't completely self-conscious, is little more than a book on film. In addition to Godard's ramblings on such topics as Vietnam, Paris life, and philosophy, Juliette often thinks outloud, speaking directly to the audience, while looking at the camera. We even get the privilege to experience her thoughts first-hand a few times. \"Her,\" is not Juliette nor Paris, as some theories state, but the cinema. In fact, we learn very little about Juliette or about Paris, as they are both lost behind ridiculous questions with no answers and the result of these questions. Commercialism is a mask for some people, and many scenes suggest lifestyle is becoming more important than life. The final shot of the film shows many household products--such as Tide--scattered in a field. Godard is say we must live together with each other and these objects--as they are all together in the field--which, as he states, sadly live on longer than we do. The more primitive we are, the happier we become, but we are to conditioned to use them, so we must make a compromise on both sides. But what are the two or three things Godard knows about cinema? Everything there is to know about this young artform. Future filmmakers must take a work of art like this and figure out everything else, because right now we only know two or three things about it. Discuss the film and others at: http://moviefan.proboards20.com",
         "2 ou 3 choses que je sais d'elle (2 or 3 Things I know About Her) is one of Godard's most fluid and complex narratives, and that is saying much considering the very nature of most of Godard's work. On the surface, the \"narrative\" (if one were to call it that) concerns a group a middle/upper-middle class Parisian women who prostitute themselves in order to buy consumer goods. Based on a newspaper article Godard read, this \"narrative\" seems like an interesting point for gender politics. However, \"narrative\" or gender politics are really not the point of \"2 or 3 Things...\". First off, \"her\" is less a person, but a city- Paris. And it is just not Paris, as in the city of romance and art, but De gaulle's radical transformation of Paris from a pre-war city of antiquity to a modern commercial center. The film is framed around extended shots of constructions sites, developing freeways, and cranes for a reason- to show how this ancient city is being radically transformed with or without the benefit of its citizens. In a way, this film is a meditation on a phenomena spreading around the world from the 1990's to the present (and especially the United States)- urban gentrification. In the push to modernize and beautify a city, the powers that be often step on the majority which make up a city- the lower and middle class. Godard's precise comments on urban planning are 40 years ahead of their time. If anything, \"2 or 3 Things...\" is far more relevant today than in 1967. Secondly, the film is an agit-prop protest against crass commercialism and how it defaces and devoids the human experience. The 2 or 3 women in the film (Paris included) are so wrapped up in the base drive for material goods that they forget the very principles of humanity- love, caring for one's family, intellectual desire, and compassion. Godard's definition of consumerism robs a society of its metaphysical compassion and leads intellectual and personal freedom into a locked room. In the age of I-Pods and Paris Hilton, Godard's sharp criticism of crass consumerism is amazingly relevant. It is a wonder that the Adbusters/Culture jam movement have not latched onto this film with a passion. \"2 or 3 Things...\" also serves as one of the many watermarks of Godard's highly productive and influential 1960's period- blending the emotions of Contempt or Vivre Sa Vie with the chic radicalism of La Chinoise or Week End. Godard was an artist in constant evolution in the 1960's and \"2 or 3 Things...\" is one of these many evolutionary steps. Be forewarned, \"2 or 3 Things...\" is NOT a good starting point for those new to Godard. It is far too meditative, \"slow\", and didactic for one to get a true sense of Godard's radical style. I strongly recommend Masculine-Feminine, Contempt, Breathless, Band of Outsiders, or Week End as a better starting point for Godard. A newcomer to Godard's style might be forever turned off by the slow pacing of \"2 or 3 Things...\". However, after digesting a few of this great film maker's works, line up \"2 or 3 Things...\". A timeless and extremely relevant film.",
         "The title is a slightly ironic one; implying the importance of Godard as the film's personal narrator and ably illustrating that the \"two or three things he knows about her\" are referring not only to the film and the central character, but to Paris itself. It's one of the filmmaker's most difficult and disorientating films, existing within the same creative mindset as Week End (1967) and La Chinoise (1967), but failing to meet that particular level of subversive brilliance. Many of Godard's most obvious hallmarks are still in place, from the notion of society as prostitution, the rise of American consumerism, the state of France in the midst of political upheaval, relationships between men and women, the nature of cinema as a platform for discussion, satire, imagination and ideas, and the appropriation of a larger than life visual design taking in elements of pop art, surrealism, Buñuel and Brecht. However, unlike the similarly minded films aforementioned, 2 or 3 Things I Know About Her (1967) doesn't quite come together as a consistent and cohesive whole, instead seeming somewhat sluggish and anchored to a character that is neither interesting nor particularly well performed. That said; I feel people shouldn't be so quick to dismiss the film, as it features several scenes of bold technical invention, a sharp and biting wit and a real sense of both visual and thematic imagination. It is also a fairly worthy time capsule to the spirit and scope of Paris at this particular time, expressing many of the political fears and social concerns central to most free-thinking Parisians circa 1967. Whereas the two other Politically minded films that Godard produced in 1967 would broaden the thematic scope to create a much more pointed attack on armchair terrorists and bourgeois revolutionaries, \"2 or 3 Things\" works on a much smaller scale; choosing suburban Paris with its high-rise apartment buildings, shops and service stations as a backdrop that is continually dwarfed by the wheels of industry and industrial repair. At one point Godard says in voice over that \"the landscape is like a face\", all the while showing how it is continually destroyed, changed and re-developed in a series of repetitive visual metaphors open to a variety of thematic interpretations. Many viewers take these sequences at face value and choose to view the film as a simple, heavy-handed essay on the decline of industry and the rise of Capitalism and subsequently write the film off. However, even though the film takes a great deal of work and may indeed seem boring and heavy-handed, there are deeper themes and ideas that make this a slightly more rewarding work in the long run. Once again, Godard anchors his ideas to the theme of prostitution; recalling elements of Vivre sa Vie (1962) whilst simultaneously foreshadowing certain issues later expressed in Sauve qui peut (la vie) (1980). Like the latter film, Godard implies that with an increasing focus on consumerism and the pursuit of material gain, society is prostituting itself. This is further elaborated upon by Godard's continual focus on product logos and brand names that are inter cut and often re-framed in order to create humorous puns that are probably lost on anyone not entirely familiar with the French language, as well as a final shot that renders the cityscape of suburban Paris as the ultimate consumer paradise. The idea of prostitution also extends to the main character, who here, prostitutes herself in order to break up the monotony of her everyday life, whilst also featuring as a somewhat controversial comment on acting itself (something that is further implied in the opening scene). Like many of Godard's films, \"2 or 3 Things\" uses a great deal of humour to give the satire a more pointed attack. Much of this humour tends to go over the heads of most viewers, largely as a result of having to read the subtitles or simply missing out on much of Godard's clever use of wordplay and usually ironic puns. Scenes, such as the young boy relating his dream about the unification of North and South Vietnam, or the scene in which Juliet and her friend enact a bizarre, tongue-in-cheek sex game with a foreign war correspondent (who films them with a super 8 camera and looks a little like Godard himself), all the while cutting back and forth to shots of construction and cars entering a service station, being an incredibly bold and rebellious critique in itself. Other sections of the film seem more poetic; almost as if Godard is putting his thoughts on film as he goes along and creating something that is, on the one hand, entirely personal, whilst simultaneously being an obvious piece of satirical agitprop. The two strands don't always sit well together, and too often Godard's ideas seem strained and unformed; especially in comparison with those two other films from 1967, previously mentioned. Obviously many viewers have had problems with the film, and really, your enjoyment of it will depend greatly on how much you trust Godard's instincts as both a satirist and filmmaker, and how willing you are to enter into a dialog with him on a subject that is now resigned to an incredibly brief footnote in 20th century history. For me, the film is undoubtedly one of his more difficult projects and not one that I would place higher than the likes of Le Mepris (1963), Pierrot le fou (1965) or Helas pour moi (1993), etc. However, the scope of Godard's ideas and his way of presenting them visually are close to genius, whilst the occasional moment of imaginative wit, visual poetry or the sheer verve of Godard's film-making abilities make the slow pace and poor performance from Marina Vlady all the more bearable. 2 or 3 Things I Know About Her is worth seeing in the context of both Week End and La Chinoise and is certainly worth experiencing as a double bill with the similarly themed Sauve qui peut (la vie).",
         "It's strange to see a work by a filmmaker that is a lesser one, but made during his prime. It's like watching a Godard that speaks to his future films- the much lesser ones- while still holding onto the quality of his work at the time. It came after Masculin/Feminine, a very good work, made during Made in USA (unseen by me) and before Week End, possibly Godard's quintessential attack/satire on culture and film-making. With 2 or 3 Things I Know About Her, we get a character who you might think at first is like the Anna Karina character in My Life to Live. She seems to sell herself for sex, but also just lives her life the way she wants it to. But it's really sort of three different strands going on concurrently- there's a pretty coherent look at a mother and wife, Juliette (Marina Vlady, often as dead-pan as Godard can get her to be), who sometimes takes cares of her kids, sometimes just goes out to shop and socialize, and sometimes has absolutely passionless sex for money. The second strand almost comes as being like a pseudo-documentary- or a satire on one perhaps- where Godard has his ladies, Juliette and several others throughout, who break the '4th wall' and talk right to the camera about their own state of mind and being and such. The third strand has Godard himself, in a perpetual whispering tone (to get our attention, of course) about the usual socio-political-philosophical-moral-cinematic-why-is-the-sky-blue narration that accompanies many a Godard film. And all of this, of course, with some of the most breathtaking cinematography I've seen in any of his work- there are close-ups that, as repetitious as they might've been, really did work. Like with the coffee- we see the coffee and the bubbles, and the colors swirling, while the narration keeps on going. There's even a very self-conscious moment where the camera blurs, the narration mentions blurred perspective, then when things come into 'focus' on both ends. In fact, this is not only one of the most self-conscious of all of Godard's work, but one of the most self-conscious films I might have ever seen. Not that this is an immediate negative, and in this framework Godard's intentions, aside from giving a good kick in the nuts to conventions and what the usual even means in typical words and descriptions of 'things' much less with cinema. There's almost a sense of consciousness expansion he's after in this self-consciousness too, which is par for the course for a Godard film. And it's also loaded to the gills with bright primary colors (this was continued into Week End, though with that in much greater, striking effect), and product placements galore; it always gives one a grin to see his great love/hate relationship with items from mass marketing and produce. And, of course, those title cards. But what ends up lacking from the film for me, and why I would only consider it a good Godard film as opposed to a masterpiece, is that I get a lot more fulfillment watching Godard's work when he just loses all abandon of common plot-sense, and just makes almost an video essay with plenty of semantics, a loose story, and an eye for locations and people and scenery and products and all sorts of things that show him being instinctively good with the camera...BUT, that it's also entertaining. It's not that 2 or 3 Things I Know About Her isn't never quite interesting, but the fulfillment I got out of it was more of being so familiar with his work that I could get a kick out of things I could already expect in the changes of form and moments of contemplative narration, not really out of any emotional connection though to anything with anyone in the film. Juliette, unlike Karina's Nana (who, by the way, as a tongue-in-cheek in-joke appears in a pop-art style photo on a wall in one scene right from that movie), is at least 70% of the time not really a character in the usual sense: if anything she's more of a mouthpiece, a kind of figure for Godard to put forward his ideas of feminist/radical thinking, done in a manner of voice and inflection that is always the same, rarely shifting. Maybe that's part of the point, and by the end we may know more than two or three things- especially about what she's thinking and attitudes on gender and the whys and why nots of just living and existence- but emotions are almost null & void in this world. In the meantime, as Godard maybe knows he doesn't have enough of a story with her 'real' character, when not talking to the camera, as a wife and mother, he shifts attention at times to random moments with other women, like one who talks to the camera about her banal existence (\"I walk, climb, see a movie twice a month, etc\"), or with a sort of touchy sexual discussion in a bar. The focus actually is never too grounded for Godard, which is partly what I mean about this film hinting at the descent his films would go to in the 80s and 90s (at least from my point of view). It's not JUST about women, it's almost about everything- drugs, culture, TV, politics, war (Vietnam especially, quite the topical philanthropic satirist he was), automobiles (a funny bit happens with a red car too), literature, morality, and all that and a bag of 60's-era Godard chips. It's worth checking out, I suppose, especially in widescreen, but not as something to see right away if getting into the director's work- I think if I had seen this as my third or fourth Godard film I might've disliked it even more. As apart of a stretch of films, I respect it and am involved, but compared to the others it's not as successful in terms of it really connecting more than it does. B+",
         "Jean-Luc Godard has been known for his intellectual observations and criticisms. This film is no exception, it is one of the director's masterpieces, a film of unique intellect and style, a movie in which feels almost like a documentary with many characters narrating their actions, along with Godard who whispers personal opinions and observations into the camera. The film is miraculous in its acute social observation along with its discussion of almost every facet of Paris life given both a realistic context by Godard and his pseudo-documentary approach and a fictional context by the actors, creating for us a sort of double-sided film of both fact and fiction, of satire and drama, and of love and hate. As with almost all Godard films, subjective to those not familiar with his sense of structure, but an essential viewing for the intellect.",
         "Godard made '2 ou 3 Choses...' more or less at the peak of his creativity. It was also made 'at the same time' as 'Made in USA'. The latter film is, for me, the beginning of the end of Godard as a major contributor to cinema, This, on the other hand, seems to be quite wonderful. Godard had always been interested in 'prostitution', literally and metaphorically. Here he monumentalises his theme. Juliette Jeanson is a fabulous intensely feminine creation, magnificently played by Marina Vlady. Augmenting her housekeeping money by prostitution as a rather more down-market version of 'Belle de Jour', she muses about her life and its meaning. This is a film in which it is not the 'plot' or the 'narrative' or even the dialogue that conveys meaning, it is the counterpoint between the images, the dialogue and the situation. This is massively enhanced by the director's use of his own voice as a kind of commentary. 'Shall I speak of Juliette or the leaves on the trees...' etc. In a way, the film is also an essay on subjectivity and the way that people are treated as objects in certain aspects of capitalism. I hasten to add that I do not swallow Godard's uncritical Marxism, but there is quite enough in this film to make you think long and hard about modern society - today just as much as when it was made. But the great thing about the film is that it is not just an intellectual exercise, less a piece of unthinking propaganda. It is a film with a heart and Juliette is one of the most lovable female characters in 60s French cinema. The downside for the here and now is that, of all of the serious films of its era, this is arguably the one that least fits on a television. The Techniscope seems to be the widest image that the cinema allows and trim anything from the edges of Godard's images at your peril. So the trick is to see it in a cinema!",
         "Directed by Jean-Luc Godard (À Bout De Soufflé (Breathless), Alphaville, Pierrot Le Fou), I wanted to watch this French film purely because it featured in the book 1001 Movies You Must See Before You Die, I never would have heard of it before reading about it. Basically this film does not tell a story, it is more a study of modern life, with almost everything you can think of put in, according to the director, sports, politics, even groceries, Godard narrates himself in a whispered voice. There is no conventional cinematic narrative, it sees one day in the life of Juliette Jeanson (Marina Vlady), her life is sophisticated but empty, she is a married mother but involves herself in prostitution, and after dropping off her screaming child her day is uneventful with the usual daily routine, shopping, housework and child-rearing, and appointments with clients, seen as banal rather than erotic. Also starring Anny Duperey as Marianne, Roger Montsoret as Robert Jeanson, Jean Narboni as Roger, Christophe Bourseiller as Christophe Jeanson, Marie Bourseiller as Solange Jeanson, Raoul Lévy as John Bogus, the American, Joseph Gehrard as Monsieur Gérard and Juliet Berto as Girl talking to Robert. The performance of Vlady obviously keeps whatever is going on flowing, but in fact the real \"her\" of the title is Paris, with all the images seen and sounds heard it combines to form a most interesting sociological essay, I agree it is somewhat dated, but is indeed still daring and a mostly splendid experimental drama. Good!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Argos Films",
         "Anouchka Films",
         "Les Films du Carrosse"
      ],
      "summaries": ["In this film, 'Her' refers to both Paris, the character of Juliette Janson and the actress playing her, Marina Vlady. The film is a kind of dramatised documentary, illustrating and exaggerating the emotionless lives of characters in the new Paris of the 60s, where commercialism mocks families getting by on small incomes, where prostitution is a moneyspinning option, and where people are coldly resigned and immune to the human nightmares of Vietnam, and impending Atomic war."],
      "budget": 0
   },
   "movielensId": 1164,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1967-03-17",
      "dvdReleaseDate": "2009-07-21",
      "directors": ["Jean-Luc Godard"],
      "runtime": 100,
      "movieId": 1164,
      "title": "2 or 3 Things I Know About Her",
      "mpaa": null,
      "actors": [
         "Joseph Gehrard",
         "Marina Vlady",
         "Anny Duperey",
         "Roger Montsoret",
         "Raoul Lévy",
         "Jean Narboni",
         "Juliet Berto"
      ],
      "imdbMovieId": "0060304",
      "originalTitle": "2 ou 3 choses que je sais d'elle",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of a housewife who must work the streets to earn an extra living - and who becomes the starting point for a larger socio-political essay.",
      "tmdbMovieId": 8074,
      "avgRating": 3.41584,
      "releaseYear": "1967",
      "numRatings": 202,
      "posterPath": "/i1gpu7tlXsOVhhRdPIxCNphYJV0.jpg"
   }
}