{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "female friendship",
            "id": 5248
         },
         {
            "name": "vacation",
            "id": 6876
         },
         {
            "name": "chance encounter",
            "id": 190084
         }
      ],
      "imdb_id": "tt0101811",
      "video": false,
      "title": "Enchanted April",
      "recommendations": [
         44308,
         41944,
         111605,
         183437,
         120518,
         48833,
         41667,
         50448,
         22490,
         169002,
         59704,
         31507,
         90603,
         13169,
         43886,
         5333,
         127878,
         33324,
         43096,
         73116
      ],
      "backdrop_path": "/jKoHtz1u3Nj2jbxaXj1Ei3OjJTl.jpg",
      "revenue": 13200170,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lottie Wilkins",
               "gender": 1,
               "credit_id": "52fe450ac3a368484e04510d",
               "name": "Josie Lawrence",
               "profile_path": null,
               "id": 157758,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rose Arbuthnot",
               "gender": 1,
               "credit_id": "52fe450ac3a368484e045111",
               "name": "Miranda Richardson",
               "profile_path": "/kTs3t6pnO3zR7WYSVYzQfJ9yKMW.jpg",
               "id": 8436,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mrs. Fisher",
               "gender": 1,
               "credit_id": "52fe450ac3a368484e045115",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Caroline Dester",
               "gender": 1,
               "credit_id": "52fe450ac3a368484e045119",
               "name": "Polly Walker",
               "profile_path": "/nUYl7W4QcO9ud2ig6qvLQ2qs0HZ.jpg",
               "id": 6416,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mellersh Wilkins",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e04511d",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "George Briggs",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e045121",
               "name": "Michael Kitchen",
               "profile_path": "/bt1UWcegfSflLONcFN6XNqgayZt.jpg",
               "id": 10648,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Frederick Arbuthnot",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e045125",
               "name": "Jim Broadbent",
               "profile_path": "/50TV6UKJKjmqdn1GQNuuCIYHLzP.jpg",
               "id": 388,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe450ac3a368484e045109",
               "name": "Mike Newell",
               "profile_path": "/aE6M4LhrTqtQ8i3WI5QeZAFN4pO.jpg",
               "id": 10723,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe450ac3a368484e04512b",
               "name": "Elizabeth von Arnim",
               "profile_path": null,
               "id": 138233,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe450ac3a368484e045131",
               "name": "Peter Barnes",
               "profile_path": null,
               "id": 81506,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe450ac3a368484e045137",
               "name": "Ann Scott",
               "profile_path": null,
               "id": 64175,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450ac3a368484e04513d",
               "name": "Simon Relph",
               "profile_path": null,
               "id": 954409,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450ac3a368484e045143",
               "name": "Mark Shivas",
               "profile_path": null,
               "id": 55982,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450ac3a368484e045149",
               "name": "Rex Maidment",
               "profile_path": null,
               "id": 47928,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe450ac3a368484e04514f",
               "name": "Dick Allen",
               "profile_path": null,
               "id": 1144714,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe450ac3a368484e045155",
               "name": "Richard Rodney Bennett",
               "profile_path": null,
               "id": 10724,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450ac3a368484e04515b",
               "name": "Malcolm Thornton",
               "profile_path": null,
               "id": 961251,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe450ac3a368484e045161",
               "name": "Sheena Napier",
               "profile_path": null,
               "id": 77697,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.774747,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 26561,
      "vote_count": 30,
      "budget": 0,
      "overview": "Based on Elizabeth Von Arnim's novel, four Englishwomen rent an Italian villa on holiday.",
      "similar": [
         13,
         281957,
         279,
         398818,
         11121,
         109689,
         207932,
         22971,
         11224,
         1429,
         4771,
         235,
         1213,
         51828,
         68718,
         82693,
         180863,
         75780,
         346364,
         581
      ],
      "original_title": "Enchanted April",
      "runtime": 89,
      "poster_path": "/tLZQ9pv6gHdVgXdkmzUQzacFS2g.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Greenpoint Films",
            "id": 12918,
            "origin_country": ""
         }
      ],
      "release_date": "1991-11-06",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "It's April in Italy, and anything can happen...even love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Newell"],
      "runtime": 95,
      "synopsis": "Lottie Wilkins and Rose Arbuthnot, two married women living in 1920's London share the misery of empty relationships with their spouses and decide to rent an Italian castle for the spring to get away. In order to save money, they advertise for two other women to join them. Mrs. Fisher, an elderly widow who knew many famous authors in her youth is struggling with a lonely and regimented existence and jumps at the chance to join the vacation. Lady Caroline Dester is a gorgeous flapper who has been grabbed one too many times and is sick of men, she only wants to be left alone... or so she thinks... They arrive in San Salvatore' a seaside Italian castle drenched in wisteria and sunshine and find themselves in a romantic landscape that leaves a lot of time to consider their lives in London. After reflecting for a while Lottie decides to send a letter to her husband, inviting him to join her. The next one to join them is Mr. Briggs, the owner of the castle, who is on his way to Rome. He has taken a liking to Rose, believing her to be a war widow. The third guest is the uninvited husband of Rose, Frederick, who has actually come to the castle to see Lady Carolina, whom he has taken a liking to after having met her at a party in London. Rose is unaware of all this and Frederick realizes that he really loves his wife after all.",
      "writers": [
         "Elizabeth von Arnim",
         "Peter Barnes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101811/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3Nzc4Mjc3MV5BMl5BanBnXkFtZTcwNjMzMzU1MQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Alfred Molina, Joan Plowright, Miranda Richardson | See full cast and crew »"],
      "reviews": [
         "\"Magic\" isn't too strong a word for the spell this film weaves. You find yourself relaxing, and seeing others in a more benevolent light... Any movie that has that civilizing an effect on viewers deserves serious attention. Seldom are we soaked in beauty like this. As if that weren't enough, it's funny. Performances are, without exception, extraordinary, but special mention must be made of the miraculous Miranda Richardson, and the superb Josie Walker - both open like roses. Why ISN'T this film on DVD? It deserves to live forever.",
         "This is a lovely, spirit-restoring movie. From the use of the actual villa that inspired Elizabeth Arngrim to write the novel in the 1920s to the inspired casting, every choice was perfectly right! The quiet joy of this film doesn't stale after repeated viewings. Josie Lawrence, Miranda Richardson, Polly Walker and Joan Plowright seem to have been born to play these parts! I would dearly love to see Enchanted April released on DVD in a widescreen format.",
         "Had a bad day? Dog bit the mailman? Car wouldn't start? People got on your nerves? Then refresh yourself with a delightful experience. Two women decide to pool their resources in answer to an ad for a month's rental of a villa in Italy. Due to financial circumstances, two other women join them. Two have humdrum marital lives; one is an elderly woman who prefers to live in the past; the fourth is a wealthy and beautiful woman wholly jaded by life. As the spell of the villa permeates their spirits, each grows in her own way and is uplifted in her outlook. This also changes the people in their lives who have visited them. As they leave you know the magic of the villa will remain with them...and you will find your outlook altered, for the better. A delightfully uplifting movie!",
         "I just adore this movie. I am on my 6th video and have great hopes they will eventually release it on DVD. It is a wonderful story about 4 women who stay at a villa in Italy and how their relationships change while there. The cast is full of well known British actors and they are brilliant in their roles. I watch this movie when I feel the need to relax and unwind. It is very well directed and tends to follow the book pretty closely, which is unusual for a director. The scenery and the script are both delightful. I recommend this movie to anyone who wants to escape from reality, even if only for a short period of time. When ever I play this film, I can almost imagine being in Italy with the smell of flowers and feel the sunshine. Four stars****",
         "I always tell people that \"Enchanted April\" is an adult movie with no cussing, no sex, and no violence. One might think of it as \"the ultimate chick flick\", but I bet there are one or two enlightened men out there who love it too. Don't invite the kids, though. This movie is very low-key. Seeing \"Enchanted April\" is a very healing experience. The sound track and gorgeous scenery, along with the ladies' gentle manners, bring to mind the peace and beauty of a pre-Raphaelite painting. Lest anyone think yours truly only watches one kind of movie, I will paraphrase a line I heard once on \"Saturday Night Live\" and say that my two favorite movies are \"The Deer Hunter\" and \"Enchanted April\".",
         "I read all the reviews here at IMDB, and you know what? Not one of them is negative, with many saying it's their favorite movie of all!! And it's no wonder. Enchanted April is beautiful in so many ways. But most of all, the movie is good for your heart. Before our eyes and ears, the characters transform from their tragic and flawed previous selves into persons full of life and love. While the story might be nothing earth-shattering, to watch the characters unfold as if caterpillars becoming beautiful butterflies is so wonderfully satisfying. If you have a heart, Enchanted April will make it feel warm and full. I hope that soon the widescreen DVD will become available. I have it on tape, but better justice would be done with the original theatrical version.",
         "\"My child, my sister, dream How sweet all things would seem Were we in that kind land to live together, And there love slow and long, There love and die among Those scenes that image you, that sumptuous weather.\" Charles Baudelaire Based on the novel by Elizabeth Von Arnim, \"Enachanted April\" can be described in one sentence \u0096 it takes place in the early 1920s when four London women, four strangers decide to rent a castle in Italy for the month of April. It is the correct description but it will not prepare you for the fact that \"Enchanted April\" - an ultimate \"feel good\" movie is perfection of its genre. Lovely and sunny, tender and peaceful, kind and magical, it is like a ray of sun on your face during springtime when you want to close your eyes and smile and stop this moment of serene happiness and cherish it forever. This is the movie that actually affected my life. I watched it during the difficult times when I was lost, unhappy and very lonely, when I had to deal with the sad and tragic events and to come to terms with some unflattering truth about myself. It helped me to regain my optimism and hope that anything could be changed and anything is possible. I had promised to myself then that no matter what, I would pull myself out of misery and self-pity and I would appreciate every minute of life - with its joy and its sadness...I promised myself that I would go to Italy and later that year I did and I was not alone. Charming, enchanting, and heartwarming, \"Enchanted April\" is one of the best movies ever made and my eternal love. This little film is a diamond of highest quality.",
         "If anyone is wondering why no one makes movies like they used to, with conversation, character and a simple theme of friendship struggling to evolve into something new, better and different, those folks need to take in this film and see top notch writing, directing, and acting that melds into a wonderful evening of observation on how things used to be in Italy and England. Other days, other times funneled into a terrific comedy of entertainment, made in 1992 with Alfred Molina, Joan Plowright, Polly Walker, Josie Lawrence, Jim Broadbent, Miranda Richardson, and Michael Kitchens in the major roles. Under the brush stroke direction of Mike Newell, these actors accomplish vividly memorable performances that are photographed with a sublimely subtle painter's eye. Reminiscent of the theatrical bedroom farce of the turn of the century, this film might be called a friendship farce that becomes a worthwhile experience in the growth of the romantic nature within each character, and the viewer, too. An artistic telegram on the importance of caring about those around us.",
         "When life is not leading towards anywhere promising, stop, go somewhere else, relax, restore and restart. The movie has been on air in town for a brief period, about ten days in a very small cinema at sleazy area. Though I missed the show, some ten years later I borrowed it from British Council again, now the library of BC has been closed down. Magic Italy, who can resist its charm? Rational and cool-headed English people always find the southern Mediterranean countries a place to channel their suppressed feeling and emotion, and Italy of course is one of the choices. At that conservative time, married housewives usually travelled overseas with their husbands. These four women who were suffering from various kinds of unhappiness find refuge to lick their crooked feathers at an Italian island. After reflecting on their lives, they are much refreshed. And further afield in London, during the absence of their wives, the husbands also have revelation about their life goals and go to the island to join their life partners. And happily, the cynical Caroline Dester found her love too. The cinematography was lyrical and comforting, a landmark of many European movies. Solely by watching without thinking careful about the people or other things, the movie soothes one's weary soul and heart. I tried to dig up Elizabeth von Arnim's other novels but they were not available easily now. Thank you Mike Newell, otherwise we'll never know her and her enchanting works.",
         "I'm biased towards any movie that paints a luxuriant picture of Italy - in my opinion the most romantic country in the world. Unfortunately the movie was rather short, unusually so for a period piece, and a little sparse on the cinematography aspect. However, the excellent story makes up for it. The four ladies embark on a much-needed relaxing vacation with problems on their minds. Over the course of the movie, they realize their problems and begin fixing them. They believe San Salvatore, the castle they stay in, has an enchanting effect on people. \"It's a tub of love,\" says Lottie Wilkins. You can watch their gradual change from dissatisfied to exuberant as the Italian seaside works its magic on them. All their problems and their solutions are plausible. The actresses were great. The background music seemed very appropriate for an romantic Italian locale. All in all, a 10/10 movie for me."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "BBC Films",
         "Miramax",
         "Greenpoint Films"
      ],
      "summaries": [
         "This slow-paced gem is about the civilizing influence of Italy on beleaguered Londoners both male and female and has its own civilizing influence on the viewer. It's almost like taking a little mini-trip to Italy, a gorgeously filmed enchantment.",
         "Four women rent a chateau on a remote Italian island to try to come to grips with their lives and relationships. They explore the differences in their personalities, reassess their goals, and reexamine their relationships in a sisterly fashion."
      ],
      "budget": 0
   },
   "movielensId": 1177,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1991-11-06",
      "dvdReleaseDate": "1993-04-28",
      "directors": ["Mike Newell"],
      "runtime": 89,
      "movieId": 1177,
      "title": "Enchanted April",
      "mpaa": "PG",
      "actors": [
         "Josie Lawrence",
         "Miranda Richardson",
         "Joan Plowright",
         "Polly Walker",
         "Alfred Molina",
         "Michael Kitchen",
         "Jim Broadbent"
      ],
      "imdbMovieId": "0101811",
      "originalTitle": "Enchanted April",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["1-HsRAM2Ink"],
      "plotSummary": "Based on Elizabeth Von Arnim's novel, four Englishwomen rent an Italian villa on holiday.",
      "tmdbMovieId": 26561,
      "avgRating": 3.85435,
      "releaseYear": "1991",
      "numRatings": 1919,
      "posterPath": "/tLZQ9pv6gHdVgXdkmzUQzacFS2g.jpg"
   }
}