{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "single",
            "id": 9457
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "brooklyn bridge",
            "id": 158967
         }
      ],
      "imdb_id": "tt0116606",
      "video": false,
      "title": "If Lucy Fell",
      "recommendations": [
         58628,
         18773,
         76275,
         29965,
         24422,
         244801,
         31083
      ],
      "backdrop_path": "/6crD8dK4O7VnhuAp1PqskOLtoi9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe43599251416c7500cfab",
               "name": "Sarah Jessica Parker",
               "profile_path": "/chjO3dDzkT7UzAZk1AGjXdbezyg.jpg",
               "id": 520,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe43599251416c7500cfb3",
               "name": "Elle Macpherson",
               "profile_path": "/1XWYq795rjP2dQtH8PRC8GUI3aI.jpg",
               "id": 5590,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Emily",
               "gender": 1,
               "credit_id": "52fe43599251416c7500cfbf",
               "name": "Scarlett Johansson",
               "profile_path": "/8EueDe6rPF0jQU4LSpsH2Rmrqac.jpg",
               "id": 1245,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe43599251416c7500cfaf",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Al",
               "gender": 2,
               "credit_id": "52fe43599251416c7500cfbb",
               "name": "Dominic Chianese",
               "profile_path": "/szL093yLdzjRvqVWQfu0KPfitDQ.jpg",
               "id": 68186,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Eddy",
               "gender": 0,
               "credit_id": "52fe43599251416c7500cfc3",
               "name": "Emily Hart",
               "profile_path": "/fwlBkJ0wjp7DrKwBNcEgEs8VNmP.jpg",
               "id": 68187,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "59e392fa9251410b6700035e",
               "name": "Ben Stiller",
               "profile_path": "/o9M2PyoF7QDSMq1OwW0D892fIkV.jpg",
               "id": 7399,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500cfa7",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500cfc9",
               "name": "Ron Fortunato",
               "profile_path": null,
               "id": 7492,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43599251416c7500cfcf",
               "name": "Susan Graef",
               "profile_path": null,
               "id": 39983,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43599251416c7500cfd5",
               "name": "Amanda Kravat",
               "profile_path": null,
               "id": 68188,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43599251416c7500cfdb",
               "name": "Charlton Pettus",
               "profile_path": null,
               "id": 68189,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "546270340e0a26780d000215",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.500823,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10324,
      "vote_count": 17,
      "budget": 0,
      "overview": "Joe and Lucy are roommates and best friends. Lucy, whose love life is embarrassingly dull, convinces Joe, who is infatuated with a neighbor he's never met, that if they don't have stable romances within a month, they must jump off the Brooklyn Bridge.",
      "similar": [
         1259,
         276,
         290762,
         1024,
         1643,
         13523,
         24420,
         44564,
         226,
         11356,
         17612,
         862,
         38,
         19913,
         40807,
         13,
         1903,
         50544,
         112160,
         86331
      ],
      "original_title": "If Lucy Fell",
      "runtime": 92,
      "poster_path": "/kFjffUg7zcST9AW4GoWiJFoNsH3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Motion Picture Corporation of America (MPCA)",
            "id": 11061,
            "origin_country": ""
         }
      ],
      "release_date": "1996-03-08",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "A comedy for the romantically challenged.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Schaeffer"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Eric Schaeffer",
         "Tony Spiridakis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116606/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNjYyMjIyMV5BMl5BanBnXkFtZTcwNzE4OTUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sarah Jessica Parker, Eric Schaeffer, Ben Stiller | See full cast and crew »"],
      "reviews": [
         "Platonic best friends and roommates Sarah Jessica Parker (a therapist who's bored with her clients) and Eric Schaeffer (a struggling artist who also teaches art to kids) are frustrated over their lackluster love lives and recall a pact they made years before: if they're both without partners at the age of 30, they will jump off the Brooklyn Bridge together. Romantic comedy alternates between being jaded and sentimental; it has flashes of satirical wit--but only flashes. Sarah Jessica Parker doesn't have much of a character here, and she compensates for this by doing silly bits of business (stretching, giggling, making faces). The most natural performance in the film is turned in by Elle Macpherson as Schaeffer's dream girl; the role is an enigma, but Macpherson's offhand appeal and easy manner gives this fantasy figure some personality, whereas Parker is stuck in a vacuum. Ben Stiller overdoes his small part as a celebrity artist and a young Scarlett Johansson turns up as one of Schaeffer's students (looking like a pint-sized Lolita), but Schaeffer himself runs hot and cold. Wearing funny hats and talking in different rhythms, Schaeffer doesn't really overplay or underplay--he's a goofy mensch, but not a dynamic one like Albert Brooks or Woody Allen. He's careful to give his character some shading, yet the quirks--like much of the serious dialogue--are superficial. *1/2 from ****",
         "If there is any merit in this movie, it is thanks to the performances of Sarah Jessica Parker and Ben Stiller. Elle McPherson is mediocre, as usual, and was obviously only picked for her looks (if you like the boring model type - how original to have her as an object of fantasy - yawn!) In fact, my theory is that the truly awful Schaeffer only wrote this tripe so he could legitimately molest Elle McPherson. He is extremely unattractive physically (what is with that hair and the dreadful clothes?), which wouldn't be a problem if he had a likable personality. I suppose his character is supposed to be sweet, funny and bumbling, but instead he comes across as unpleasant, selfish and completely in love with himself. At one stage Elle's character describes him as \"funny, intelligent and good looking\" (or words to that effect) - I'm afraid she's wrong on all three. How the viewer is supposed to believe that any woman would find him attractive, let alone two, is beyond my comprehension.",
         "I saw this movie in the theater - TWICE - when it first came out. I became smitten with Eric Schaeffer and thought If Lucy Fell was hilarious. Now that I caught it on USA (or TNT, whatever) recently, I'm able to see how flawed this romantic comedy really is and wondering why I was so taken in by it before. First of all, I found the titular character to be pretty unlikeable. She's quick to point out everyone's shortcomings in a cold, clinical sort of way yet can't even look her father in the face when she talks about things that are important to her. She knocks her roommate for being afraid to talk to Jane when *she can't even talk to her own father*! She carries on this passion-less relationship with Dick, not even thinking that it might hurt him less to just cut it off. I liked Joe, esp. his diatribes (still love that job in Central Park scene) but he too was hard to relate to. He hasn't had sex in five years because he's obsessed with Jane, the woman next door? OK, so I know this is Hollywood and things are exaggerated for comic effect, but what are we supposed to think of \"Bwick?\" The guy doesn't speak in complete sentences at first and seems near illiterate (or, I guess he's so enmeshed on the artistic plane that he can't be bothered with the concrete). I could have cried for Ben Stiller when again I saw the scene of him \"painting\" (i.e. yelling and hurling paint-coated body parts at canvas) - totally ridiculous. I know, that was the point... hook Lucy up with a nutter so that she'll realize what's under her nose. When I first saw this movie, I think I was 28, and the idea of 30 still loomed ahead. Now, at 33, the idea of two single people taking their lives because they haven't found reasonable relationship material is not only beyond crazy, but it's insulting. (Well geez, maybe these guys would have found love if one hadn't wasted years obsessing over an unattainable woman and the other had extricated herself from a dead-end relationship!) It feeds into this ridiculous notion everyone under 30's got that somehow, single life goes downhill after one hits 30. (I can tell you it only gets better!) Still, \"every pot finds its cover,\" and these two half-wits \"find\" each other by the end of the movie, so all's well that ends well.",
         "I don't know how to classify this movie. It is disgustingly bad. It is not funny, yet its supposed to be a comedy. The only part mildly entertaining is Ben Stiller's character, yet he is not developed at all. Everything else is just so serious. These two losers have it so bad. Oh, poor them. Please! Do jump off the Brooklyn Bridge. I did not know anything about this movie before watching it. Initially I thought Joe (Eric Schaeffer) was a homosexual. After all, he had very feminine characteristics. Additionally, he wore a dress in parts of the movie. And also, there is his hair (you know what I'm talking about). And the makeup, etc... etc... I'll admit that I couldn't stand watching the last 20 minutes, but I do know how it ends. Anyway, it would have turned out better if Joe came out of the closet. This is one of the worst movies I've ever seen. It should get a rating of 1. Don't watch this movie!",
         "There was a brief moment in the history of cinema in the 90's when coffe shop hippies made movies. They usually consisted of a stupid idea played out over 90 minutes with a terrible deluded and quiet boring conversations. This movie is one of them. Let me start with the main 2 characters. Both are meant to be finding love and along the way find watch other. But wait you guessed it with a stupid twist along the way to keep the dopple headed crowd cheering along the way. This movies insults its viewer by making a movie around a premise which is so retarded that quiet frankly the director should have been shot. Anyway i digress. (I apolgize to the viewer not director). This movie is filled with that 90's cheese that ozzes from every frame. SJP is just awful and her chemistry with her supposed love interest is as noticeable as a fly on doo doo. Let me save you from this rant/review just do not watch this garbage. It is from an era that spawned some great movies but this was not even close to a rental!",
         "I saw this movie on cable, so I can't ask for my money back. However, I would like that time of my life back. If Lucy Fell attempts to be an insightful dialogue film, but fails due to lack of insight and any knowledge of how people talk and recognition to any hint of human intelligence. Maybe people talking about spitting in each other's mouths could be slightly funny if the writer had any talent or could sense any direction, but no. Evaluating the performances is pointless, since any actor working with this material is obviously in too much pain to develop a character. Save your money and life, avoid this movie at all costs!",
         "Nothing in this movie worked. SJP criticizes one of her patients for being boring when she is one of the most boring creatures on Earth. Her roommate is beyond pathetic and as sorry a specimen as you're likely to find. Why does he wear a skirt and a woman's headband? Because he's a quirky artist. Why does he run around and chase the Chinese menu guy? Because he's a quirky artist. We get it, we just don't care. The characters' quirks were completely manufactured and phony. Nobody speaks, acts or does anything like the people in this movie. I almost cracked a smile once but it went away really fast. I watched half of the movie and couldn't finish it.",
         "Essentially, I found this movie meaningless. Even though I do like Sarah Jessica Parker, Joe (played by Eric Schaeffer) seemed like an unnecessary jerk. He who has been watching through a telescope supermodel Elle MacPherson, suddenly becomes turned off by her when she admits to having fantasized about him. Dissapointing ending.",
         "I can't believe some of the reviews I'm reading - so negative! I love this movie. I realize that to watch it now may leave the audience disappointed - but when it came out back in the 90's, this movie was fantastic. The script gave you just enough about the characters that you were able to draw more from their actions to see their vulnerability and insecurities. There are quite funny moments, sweet, sad and interesting. For me it was great to see these characters learn about themselves and what they wanted. I enjoyed this movie very much - and while it may not be Oscar-worthy or ground breaking, it remains one of my favorites.",
         "OK. i don't know if anyone else noticed, but this movie has like a million goofs in it. if you guys see anymore, comment back so you know the scene when joe is in jane's apartment when he finds out that she knew he was watching her. every time the camera focuses on jane and comes back to joe, his shirt if buttoned a different way. like one minute it will be half open and the next it will be fully buttoned. and his hair is different too. This scene just seemed so blatantly obvious too me that i felt i had to write this. i don't know, i thought it was interesting. also because there is no \"goofs\" section on this page."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Motion Picture Corporation of America (MPCA)",
         "TriStar Pictures"
      ],
      "summaries": ["Joe and Lucy are roommates and best friends. Lucy, whose love life is embarrassingly dull, convinces Joe, who is infatuated with a neighbor he's never met, that if they don't have stable romances within a month, they must jump off the Brooklyn Bridge."],
      "budget": 5000000
   },
   "movielensId": 118,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-08",
      "dvdReleaseDate": "2001-01-30",
      "directors": ["Eric Schaeffer"],
      "runtime": 92,
      "movieId": 118,
      "title": "If Lucy Fell",
      "mpaa": "R",
      "actors": [
         "Sarah Jessica Parker",
         "Elle Macpherson",
         "Scarlett Johansson",
         "Eric Schaeffer",
         "Dominic Chianese",
         "Emily Hart",
         "Ben Stiller"
      ],
      "imdbMovieId": "0116606",
      "originalTitle": "If Lucy Fell",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["TNTV9Txit-Q"],
      "plotSummary": "Joe and Lucy are roommates and best friends. Lucy, whose love life is embarrassingly dull, convinces Joe, who is infatuated with a neighbor he's never met, that if they don't have stable romances within a month, they must jump off the Brooklyn Bridge.",
      "tmdbMovieId": 10324,
      "avgRating": 3.01064,
      "releaseYear": "1996",
      "numRatings": 1175,
      "posterPath": "/kFjffUg7zcST9AW4GoWiJFoNsH3.jpg"
   }
}