{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "bar shootout",
            "id": 185461
         }
      ],
      "imdb_id": "tt0120121",
      "video": false,
      "title": "The Shooter",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Michael Atherton",
               "gender": 2,
               "credit_id": "53cb23670e0a265dfc000d34",
               "name": "Michael Dudikoff",
               "profile_path": "/oUsn5aUJ4f9V4a5mcucTVbQMRj1.jpg",
               "id": 21259,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kyle Tapert",
               "gender": 2,
               "credit_id": "53cb23820e0a265ded000dc4",
               "name": "Randy Travis",
               "profile_path": "/fxTlJ3kRNG1vURYeHAHjpOjHzbv.jpg",
               "id": 55725,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Wendy",
               "gender": 1,
               "credit_id": "53cb23ae0e0a265dea000d68",
               "name": "Valerie Wildman",
               "profile_path": "/6VveQx5v1ELVNjnvPWZg0Bgzw29.jpg",
               "id": 47884,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jacob Finch / Narrator",
               "gender": 2,
               "credit_id": "53cb23db0e0a265dfc000d4b",
               "name": "Andrew Stevens",
               "profile_path": "/jaWFCqWahZeUimpEU2GJStm6pKI.jpg",
               "id": 21479,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jerry Krants",
               "gender": 2,
               "credit_id": "54846d0bc3a3685d0500074f",
               "name": "William Smith",
               "profile_path": "/rlO5RpMwYgyLmD9QsePedpsS8Dq.jpg",
               "id": 98102,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gina",
               "gender": 0,
               "credit_id": "59795e3dc3a368685a0095e2",
               "name": "Libby George",
               "profile_path": null,
               "id": 1858702,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4aee9251416c910ca5c7",
               "name": "Fred Olen Ray",
               "profile_path": "/vHcV6RYDAT1kh3RGRah8tiNrDyK.jpg",
               "id": 31155,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54846cbf92514168d20006f0",
               "name": "Tony Giglio",
               "profile_path": null,
               "id": 42712,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.875735,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 150823,
      "vote_count": 1,
      "budget": 0,
      "overview": "The story is of a small town in the early west and of a 'shooter' of reputation that drifts into it and stands up to the controlling family that runs it. But far from a John Wayne, this hero is caught and brutally beaten and left to die, only to be saved by a prostitute that has also suffered under the hand of this group of desperados. The only one possible to stand up to the shooter is another solitary man who joins with the notorious family although he is deputized as the town's sherif.",
      "similar": [
         1427,
         1923,
         2832,
         1904,
         346364,
         261023,
         281,
         359940,
         33,
         281957,
         9362,
         50270,
         23629,
         26389,
         1585,
         2252,
         1547,
         1586,
         4141,
         4771
      ],
      "original_title": "The Shooter",
      "runtime": 91,
      "poster_path": "/vjG4mxkTw9Ftrf1Yv87dl0Sadim.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Royal Oaks Entertainment",
            "id": 953,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Amritraj / Stevens Entertainment",
            "id": 40644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cabin Fever Entertainment",
            "id": 21304,
            "origin_country": ""
         }
      ],
      "release_date": "1997-10-23",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Fred Olen Ray"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Tony Giglio"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120121/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MDYzNDgzNV5BMl5BanBnXkFtZTcwNDczNjcxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Dudikoff, Randy Travis, Valerie Wildman | See full cast and crew »"],
      "reviews": [
         "Getting away from action movies for awhile, Michael Dudikoff does a western for a change, and the results are one of his best movies. This time around, he plays a mysterious drifter (what else?) who gets more than he bargained for when he comes to the rescue of a woman in the desert and returns her to town. County singer Randy Travis is good as one of the bad guys, and Valerie Wildman does a nice job as the girl. Veteran character actor William Smith is also (as always) a standout, with that gravely voice that just makes him perfect casting for the bad guy. Also nice is seeing Dudikoff play a vulnerable character, one who can't rely on fancy fighting skills to stay alive. One scene that helps to support the vulnerability of his character is when he's overcome by thugs and beaten to a bloody pulp and left for death. Afterwards, he must recover with the help of Wildman, and when he's well enough, he comes back gunning for revenge. Though it sometimes has the look of a film that was made by a bunch of friends wearing costumes gathered from some second-rate clothing stores, it works for what it is. Dudikoff isn't going to replace Clint Eastwood as the next western megastar, but he's good in the film and gets to show off a different side with his character. Worth a rental for those looking for a decent 90 minutes on a dull night.",
         "I'm surprised about the many female voters who even give this film better marks. My thought about this film was that the target audience is adult and male. Whipped and tortured women, merciless revenge and a high body count are typical ingredients, introduced into film history by the spaghetti subgenre. The opening and the hand-smashing are DJANGO rip-offs. THE SHOOTER however lacks the style of e.g. DJANGO. Score, acting and cinematography are mediocre at best but if you look for the above mentioned ingredients you are in the right place here. And the actors don't have an Italian accent. 4 / 10.",
         "Dudikoff stars as Michael Atherton a gunfighter and ex-union soldier, after stumbling across a woman being beaten by some no-good scum, Atherton naturally steps in and saves the girl(Valarie Wildman) and in the process finds himself targeted for vengeance by the family of one of the guys he killed and it's not long before Atherton is caught, beaten and almost killed, only to be saved by Wendy the girl he saved before, Atherton takes aim at taking down the family and does, however the sheriff has a vendetta, one that goes all the way back to the war in this far-better-than-you-would-expect direct to video western which features a decent story and Dudikoff in good form. This, The Silencer, Soldier Boyz and Virtual Assassin are the only watcahble movies from Dudikoff in the 90's. However where as Dudikoff is well suited to the role of a western, it's Randy Travis who ends up making the most impression and in turn steals the movie. 3/5 Matt Bronson",
         "Where do I start? The hero should have learned to ride a horse before filming a western. Red lipstick marks on a persons back really don't look like whip cuts. Hats of that period didn't have modern metal ventilation holes and the style of saddles used were not developed until the mid 1900s. After firing about eighteen rounds, our hero finally had to reload his six-shooter and there was zero \"kick\" when revolvers were fired. What bad guy takes the time to tie the picture perfect rope noose to hang the heroin? Who knew all the \"whores\" out west were so attractive? I could go on. All in all,a very amateurish production.",
         "A whore is being whipped to death, so a guy rides up and kills everybody. Then there is more killing. And then a whore gets whipped to death. Then Randy Travis says a lot of stuff that nobody cares about. Then there is more killing. Then Travis tries simultaneously to kill a whore and have a shootout, but he talks too much. Then the good guy rides away with the last whore. The only question that remains is why do all the men, good or bad, want to kill the whores? I think the word \"whore\" was uttered more in this movie than at my cousin's wedding. I give it three stars because, in the middle of the movie for some unknown reason,they turned it into a porno. Boobies on screen; butt-licking off of it. But then they killed that whore. Killed her dead.",
         "\"The Shooter\" was a different type of film for Michael Dudikoff. Although normally associated with action flicks that incorporate martial arts, this film , because it was a western, enabled him to display that he is a far more capable actor than certain formula story lines have allowed. The major problem, of course, is that the film does not allow any solid character development. The fleshing in is really left to the viewer . We can only guess at the sadness that has made the Shooter, whose real name is Michael Atherton, the killer that he is- a killer, mind you, that a little town, terrorized by a local bully, welcomes as a hero who can release it from its misery.",
         "I feel this is one of the best movies I've seen,I'm an older male and love most westerns. I love movies based in part at least on facts,If I am not mistaken this is such a movie. I also like revenge type movies,This qualifies there as well in my opinion.Some of my favorite parts of the movie were the opening scene with the whipping and the barn shooting scene. I felt the corral beating scene was a little overkill but did not affect how I feel about the complete movie. I saw what I think is a continuation of this movie in a gun smoke episode. I also enjoyed that.I recommend taking the time to watch this movie ,I will watch it again. I also felt the romance parts of this movie were well played. I thought it was so out of character for Randy Travis to play a villain type ,but I always enjoy his acting.",
         "Action, horror, sci-fi, exploitation director Fred Olen Ray shows he has some talent as a director. Character actor William Smith is one of the best tough/bad guys in the industry. He treats the viewer with the best acting performance of his career. As for Randy Travis he gives his best Lee Van Cleef impression. He's not bad in the film. Smith and Travis make the movie. As for the rest of the cast none of them really stand out. Ray did a great job directing this flick, Smith and Travis were good, I'd give this B western on a scale of one to ten(ten being the best) a seven.",
         "Will they ever make movies without nudity and sex? This came on at 3:00 on Sunday afternoon and I couldn't believe what they showed. Thank God my son was outside or I would have been freaked out if he had seen the soft/medium porn! Do people who make movies not care who they offend or corrupt? Kids could have been watching after church and that is what they show???!!! The acting was good and I enjoyed the suspense but GEE! There was violence and bad guys but that is to be expected in a western movie. Randy Travis was really good in his role. If the writers, directors and producers would just quit putting on so much uncalled for sex scenes. What has to happen to get them to quit going in that direction? Where can I complain?"
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "Amritraj / Stevens Entertainment",
         "Cabin Fever Entertainment",
         "Royal Oaks Entertainment Inc."
      ],
      "summaries": ["The story is of a small town in the early west and of a 'shooter' of reputation that drifts into it and stands up to the controlling family that runs it. But far from a John Wayne, this hero is caught and brutally beaten and left to die, only to be saved by a prostitute that has also suffered under the hand of this group of desperados. The only one possible to stand up to the shooter is another solitary man who joins with the notorious family although he is deputized as the town's sherif."],
      "budget": 0
   },
   "movielensId": 1181,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-23",
      "dvdReleaseDate": null,
      "directors": ["Fred Olen Ray"],
      "runtime": 91,
      "movieId": 1181,
      "title": "The Shooter",
      "mpaa": "",
      "actors": [
         "Michael Dudikoff",
         "Randy Travis",
         "Valerie Wildman",
         "Andrew Stevens",
         "William Smith",
         "Libby George"
      ],
      "imdbMovieId": "0120121",
      "originalTitle": "The Shooter",
      "genres": ["Western"],
      "youtubeTrailerIds": ["F2ptqKcPLsE"],
      "plotSummary": "The story is of a small town in the early west and of a 'shooter' of reputation that drifts into it and stands up to the controlling family that runs it. But far from a John Wayne, this hero is caught and brutally beaten and left to die, only to be saved by a prostitute that has also suffered under the hand of this group of desperados. The only one possible to stand up to the shooter is another solitary man who joins with the notorious family although he is deputized as the town's sherif.",
      "tmdbMovieId": 150823,
      "avgRating": 3.04545,
      "releaseYear": "1997",
      "numRatings": 110,
      "posterPath": "/vjG4mxkTw9Ftrf1Yv87dl0Sadim.jpg"
   }
}