{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "army",
            "id": 6092
         },
         {
            "name": "greek island",
            "id": 174363
         },
         {
            "name": "italian army",
            "id": 174379
         }
      ],
      "imdb_id": "tt0102426",
      "video": false,
      "title": "Mediterraneo",
      "recommendations": [
         41583,
         46028,
         27670,
         12776,
         11010,
         20914,
         38286,
         50531,
         38396,
         37769,
         43645,
         56804,
         20069,
         8832,
         38397,
         37775,
         43200,
         25606,
         38366,
         24160
      ],
      "backdrop_path": "/rVnw6V6NselkJfYt90beU1yXesy.jpg",
      "revenue": 4532791,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sergente Nicola Lo Russo",
               "gender": 2,
               "credit_id": "52fe46a39251416c9105ac05",
               "name": "Diego Abatantuono",
               "profile_path": "/kKihAlP104AJ0zshWfET2gGt4fA.jpg",
               "id": 55912,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tenente Raffaele Montini",
               "gender": 2,
               "credit_id": "52fe46a39251416c9105ac09",
               "name": "Claudio Bigagli",
               "profile_path": "/c2HBprEaFtHQsWOKr2SEXKjGcE2.jpg",
               "id": 119950,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Attendente Antonio Farina",
               "gender": 2,
               "credit_id": "52fe46a39251416c9105ac0d",
               "name": "Giuseppe Cederna",
               "profile_path": "/aSwa9dzV46RDq616678mTiNxSVs.jpg",
               "id": 106350,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Marconista Luciano Colasanti",
               "gender": 2,
               "credit_id": "52fe46a39251416c9105ac19",
               "name": "Ugo Conti",
               "profile_path": "/ihyYwD4DdZ25cnkzUu2mT3d3bqx.jpg",
               "id": 71296,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Corrado Noventa",
               "gender": 2,
               "credit_id": "52fe46a39251416c9105ac11",
               "name": "Claudio Bisio",
               "profile_path": "/8HT4BvXeNiHMoPmRQdjqDtgEIa9.jpg",
               "id": 55914,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Eliseo Strazzabosco",
               "gender": 0,
               "credit_id": "52fe46a39251416c9105ac15",
               "name": "Gigio Alberti",
               "profile_path": "/6p9sclgR7wCQlOuHLUfULDEuWHp.jpg",
               "id": 55915,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Tenente Carmelo La Rosa",
               "gender": 2,
               "credit_id": "52fe46a39251416c9105ac1d",
               "name": "Antonio Catania",
               "profile_path": "/v37iYgXfWEgbAD3544stGjjF8on.jpg",
               "id": 7542,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Vassilissa",
               "gender": 0,
               "credit_id": "52fe46a39251416c9105ac27",
               "name": "Vana Barba",
               "profile_path": "/mDXdj4nCNo3EYymjIJYi6QFKDhx.jpg",
               "id": 1042162,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Libero Munaron",
               "gender": 0,
               "credit_id": "59be8a9cc3a3681b8602e45d",
               "name": "Memo Dini",
               "profile_path": "/rarFYLGBjNi2RCRyawKq8sTdXNa.jpg",
               "id": 1488531,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Felice Munaron",
               "gender": 0,
               "credit_id": "59be8aac925141352502b437",
               "name": "Vasco Mirandola",
               "profile_path": "/yXiTL6N75wV43oTfBhaDa3rZFBN.jpg",
               "id": 1385127,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "prete ortodosso",
               "gender": 2,
               "credit_id": "59be8ab8c3a3681bd402c222",
               "name": "Luigi Montini",
               "profile_path": "/o9Mo4SYwBERHZbF4xZvCJEIfQxq.jpg",
               "id": 103609,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "pastorella",
               "gender": 1,
               "credit_id": "59be8ac3925141354a02c8e7",
               "name": "Irene Grazioli",
               "profile_path": "/g9kam3z9DHeCSnvTir1clUEz8qL.jpg",
               "id": 141715,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Aziz",
               "gender": 0,
               "credit_id": "59be8acc925141350602d51d",
               "name": "Alessandro Vivarelli",
               "profile_path": null,
               "id": 1867694,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46a39251416c9105ac23",
               "name": "Gabriele Salvatores",
               "profile_path": "/qRBui7fB2dxaChy2cf1msFT52qJ.jpg",
               "id": 55916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a39251416c9105ac2d",
               "name": "Enzo Monteleone",
               "profile_path": null,
               "id": 134533,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 5.18297,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 38251,
      "vote_count": 249,
      "budget": 0,
      "overview": "Greek Sea, World War II. An Italian ship leaves a handful of soldiers in a little island; their mission is to spot enemy ships and to hold the island in case of attack. The village of the island seems abandoned and there isn't a single enemy in sight, so the soldiers begin to relax a little. Things change when their ship is hit and destroyed by the enemy, and the soldiers find themselves abandoned there. Actually, the island isn't deserted and when the Greeks understand that those Italians are harmless, they came out of their hiding places in the mountains and continue their peaceful lives. Soon the soldiers discover that being left behind in a God-forgotten Greek island isn't such a bad thing, after all...",
      "similar": [
         857,
         424,
         14574,
         228150,
         637,
         369885,
         10105,
         1654,
         1771,
         16869,
         2253,
         5925,
         853,
         289,
         676,
         423,
         613,
         339259,
         324786,
         374720
      ],
      "original_title": "Mediterraneo",
      "runtime": 96,
      "poster_path": "/zn2nfy87gqCt4uZ7m3Azs16EFRX.jpg",
      "spoken_languages": [
         {
            "name": "ελληνικά",
            "iso_639_1": "el"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Silvio Berlusconi Communications",
            "id": 8694,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Penta Films",
            "id": 6651,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "A.M.A. Film",
            "id": 17087,
            "origin_country": ""
         }
      ],
      "release_date": "1991-01-31",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "On a magical Greek island a soldier is about to discover that it is better to make love instead of war",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gabriele Salvatores"],
      "runtime": 96,
      "synopsis": "n 1941, one year after Italy joined Germany against the Allies in World War II, a small group of misfit Italian soldiers is sent to a small Greek island in the Aegean Sea for four months of lookout duty. The soldiers include a lieutenant who likes art, a macho sergeant, a farmer accompanied by his beloved donkey Silvana, and other quirky people. They are not very good soldiers, but a cross section of average, independent men. The soldiers anticipate attack from outside and on the island and take all sorts of inept precautions. They find a small town with no people. They see bombing on the horizon and realize that the ship that would pick them up has been destroyed. Then mysteriously, people reappear in the village: the villagers say they hid because the Germans had taken all the men. They have decided to accommodate the Italians. It isn't long before everyone's sunny nature appears. The Italian soldiers are absorbed into the life, heat and landscape of the idyllic island. The local priest asks the lieutenant, a Sunday painter, to restore the murals in his church. Two soldiers, who are brothers, befriend a lovely young woman, a shepherdess, who believes that three is the perfect number for an affair of pure sexual fun. The sergeant takes up folk dancing and the shyest of the soldiers falls profoundly in love with the island's single, very overworked, prostitute.",
      "writers": ["Enzo Monteleone"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0102426/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTU0MzcwMjI0M15BMl5BanBnXkFtZTcwODAxNTUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Diego Abatantuono, Claudio Bigagli, Giuseppe Cederna | See full cast and crew »"],
      "reviews": [
         "The outline of this film appears in other postings, so I will just add my two drachma by way of critical appraisal. In case you are in any doubt, Mediterraneo ranks in my best three ever - a magnificent film. If you never see it, part of your life will have been unlived. Mediterraneo epitomises the difference between Hollywood and the demands of a largely US audience and the subtler approach of the European director/writer who seeks simply to express him/herself through the medium. I read two reviews in the Washington Post both of which managed to misunderstand the film completely, one going so far as to characterise the cast as \"Marx Brothers\". In fact, they are probably the finest ensemble of characters I have ever seen in film - a completely disparate group of individuals who nearly all manage to find spiritual (and sexual) fulfulment in the sensuality of Aegean island life. The film is multi-layered and, the more obvious ones, such as the powerful anti-war message and the venality of post-Fascist Italy are often mentioned. But no-one has ever picked up on the phrase \"una face, una race\" which is repeated throughout the film. This is the nostrum that Italians and Greeks have a common Mediterranean heritage (come on Washington Post hacks - didn't the title give you a clue?) and that there is an enormous irony in the Italians - who rightly pride themselves on the antiquity of their civilisation - seeking to subdue another culture whose origins are 2000 years older. This is underlined by the easy participation of the soldiers in both high and low Greek culture, .....the painting of the frescoes in the church (n.b. the Orthodox Church predating the Holy Roman Empire by centuries - clever eh!) and the wonderful unifying theme of football, which only a European or South American viewer could truly appreciate. The group's ambivalent attitude to sexual mores adds to the sense of the place as essentially a home for Greco-Roman sensuality - a fact which is gloriously exposed with the later juxtaposition of our band of heroes with the starched British Royal Navy officers who arrive to remove them from the island. I have not seen any mention in other reviews of the beautiful cadence of the Italian dialogue - as lilting as the bazouki music which accompanies much of the film. The sense of disillusionment that takes over the film at the end is very powerful and it is no accident that Salvatore shows us the Lieutenant returning to the island on a ferry full of burnt-pink tourists. This is a film that can only truly be appreciated if you have a feeling for, and understanding, of European culture. This is a film for grown-ups. Mediterraneo demonstrates that though box-office grosses for European films are small (unless it is something produced explicity for a US audience, like the truly dreadful Four Weddings) our directors have managed to stay true to their craft. If there are not enough car chases or shoot outs for you, look out for the five-star ratings in the Washington Post. Fact 1: Only 10% of Americans possess a passport: Fact 2: None of them review for the Washington Post.",
         "\"Mediterraneo\", which we saw during its debut run locally, has stayed fresh as when we first saw it. This small, endearing film has a lot going for it. In fact, it makes a perfect statement against WWII, or any war, for that matter, without being in one's face. The subtlety of this film stays long in the viewer's mind. We are presented a group of Italian soldiers on a mission to set a base in a small, and apparently uninhabited island in the Aegean Sea, not too far from Italy, but millions of years away in the way it has stayed primitive enough to offer anything to these men. As soldiers, under the command of Raffaelle, these are not the typical professional soldiers. In fact, these men discover themselves and a world they didn't know existed during their time in the island. What surprises the soldiers is not to encounter anyone living in the village facing the sea, where they disembark. It becomes clear everyone is hiding from them. When the populace discover these men are harmless they return and embrace the invaders with open arms. After all, they feel the Italians share a lot in common with them. The men, obviously abandoned, and lacking means of transportation, get stuck in the island. In fact, they don't realize, but when the Italian aviator arrives in his one engine plane, he is amazed how many years have passed since they arrived at that remote spot. This small film is a delight to watch. Diego Abatantuono makes a great Lorusso. Claudio Bigati, is Raffaele, the man with an artistic eye, who sees the beauty of the classical Greek design. Vanna Barba plays Vassilessa, the local whore who falls in love with the shy Farina(Giuseppe Cederna). The rest of the cast does a good job under Mr. Salvatores' direction. Watch this film as it will delight fans of Mr. Salvatores and the Italian cinema.",
         "Mediterraneo is all about the sea. It is actually part of a trilogy from Salvatores (with Marrakech Express and Turne') about those who run away. It's about friendships, it's about people living their life in this beautiful planet. Enjoying the stars and the deep blue sea. It's about the stupidity of war, and how soldiers are foremost people and they should never forget that. (Notice the line on how good it would be if you trade weapons for hashish) It's about man being the same over millennia, since what makes him feel alive and happy has not changed a bit. Since what so many people fret about is the ugly uselessness of power. (Notice the ancient Greek poetries that are read at night) This movie is all about the greatest sea there is, the sea that will always be at the center of everyone's life. It's the sea for man. The oceans are not for man's size. It's the sun, it's blue and white.",
         "A beautiful movie that addresses life's simple pleasures. Marooned on an island, this band of soldiers are left with nothing to do and no war to fight. They mull around waiting for their apparent \"call up\" while soaking up along the Mediterranean. As their thoughts of war wane, they begin to explore the meaning of life. With minimal dialogue, the juxtaposition between death (war) and life (the sea) is remarkably achieved through brilliant cinematography. With the sea as a backdrop, we are asked to question our existence and deduce our priorities. This film will make you go for a holiday!",
         "Whatever you can ask for in a film is sure to be found in Mediterraneo. This is certainly one of the best European films of the decade; very warm, appealing, and hilarious. The story of a small group of Italian soldiers (they're not actually very soldier-like) stranded on a beautiful Greek island during Second World War is very nicely depicted by director Gabriele Salvatores. The characters of Nicola Lorusso, Raffaele Montini and the soldier in love with Vassilisa are great. The island itself is beautiful, which calls to some incredible cinematography. The musical score is spectacular, a delicious medley of Italian and Greek folkloric music. My verdict: 10 / 10",
         "A squad of Italian soldiers arrives to occupy a remote Greek island during WW2, but soon goes native as the immediacy of the war slowly recedes from their island paradise. I enjoyed this film immensely. I hope this is only available in the original Italian with subtitles. The dialog among the soldiers is so quintessentially Italian and funny, that a dubbed version would lose almost everything in translation. The locations are terrific, the plot development is subtle but never boring, and it's a joy to watch a film that encourages you to lean forward and savor it, rather than one that pins you in your seat with technology and effects.",
         "I think IMDb explains the plot best: An Italian ship leaves a handful of soldiers in a little island; their mission is to spot enemy ships and to hold the island in case of attack. The village of the island seems abandoned and there isn't a single enemy in sight, so the soldiers begin to relax a little. Actually, the island isn't deserted and when the Greeks understand that those Italians are harmless, they came out of their hiding places in the mountains and continue their peaceful lives. Soon the soldiers discover that being left behind in a God-forgotten Greek island isn't such a bad thing, after all... The film won the Oscar for Best Foreign film in 1991 and I'm pretty sure this wasn't the best foreign film of that year, but I can understand why it won. The film captures something I think many people can relate to or understand...escape. These soldiers find an escape from the war. Which is something anybody who has been in a war can relate to. And, the film also captures the freedom these men have. For the moment they're at the island they can also escape from their everyday responsibilities and do what they like best. That's something most people want. For instance, the lieutenant enjoys painting and at the island he gets the opportunity to paint the church. Instead of fighting a war or worrying about how to pay the bills he is doing what he enjoys best, painting. The film may not be the best foreign film of 1991, but it is a very warm-hearted film that you will enjoy. 3 (***) out of (****)",
         "It was a very good Italian film I've seen along with Cinema paradiso and Barnabo delle Mongtagne. On the island they forget everything, just enjoy peace and simple jolly life. 30years later,a few people left the island come back, because they couldn't adjust themselves in the world. Only place to return to was the island. On watching the film, I was quite saddened, because our life is like a dessert where Utopia is nothing but a mirage. Director's words \"I'd like to dedicate this film to people who want to run away\" says all. Very memorable film!!!",
         "I am not one for Italian movies but this was a cracker. If you have to go by the sub-titles then pay attention at the beginning when the soldiers are in the process of securing the town and they engage a chicken.....its a bit of humour that has stayed with me for years since watching it. It is one of those feel good movies that you just don't want to end...highly recommended. In an age where any discerning movie goer struggles to find a decent movie at a video shop because of all the crassy Hollywood type movies that are churned out, this is a must watch movie.",
         "Italian cinematography always had interesting and beside all great movies. \"Mediterraneo\" is definitely one of them with strong antiwar message. A movie that Americans cannot make cause they haven't experienced wars like the ones that were led on European ground. Story starts when Italian ship leaves a handful of soldiers in a little Greek island during World War II. Italian soldiers must hold that island by any cost. Island seems to be deserted and when their sheep gets destroyed by enemies, soldiers must find a way to live on that island. Soon they found out that the island is not deserted when Greeks came out of their hiding places in the mountains. All of the inhabitants are women, children and old men, so soldiers began to relax and finally live their lives. Gabriele Salvatores made a movie situated during a war without any war scene, presenting the Greek island as heaven on Earth for those untypical soldiers. All of them have their dreams and desires, but as time pasts by, only one soldier always tries to leave at all cost (he wants to come home to his wife). Antonio Farina falls in love with prostitute Vassilissa (gorgeus Vanna Barba) and they even stopped counting days on that island, so they don't know what is happening in the war or in outside world. This island present oasis, imaginary world where everyone is happy. Like some sort of utopia. So from the first to last scene Salvatores directs this movie with no mistakes, cause he had great scenario, actors and he found beautiful location in Greece. I specially liked Diego Abatantuono in role of Nicola Lorusso, but I must also mention Claudio Bigagli and Giuseppe Cederna. Every single person who worked on this drama with elements of comedy created a movie that we all can watch whenever we want to escape from to real world. But is there a place like this on Earth? Yes, I think there are plenty of places like this, but we have to look for them cause nothing good comes easy."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "A.M.A. Film",
         "Penta Film",
         "Silvio Berlusconi Communications"
      ],
      "summaries": ["Greek Sea, World War II. An Italian ship leaves a handful of soldiers in a little island; their mission is to spot enemy ships and to hold the island in case of attack. The village of the island seems abandoned and there isn't a single enemy in sight, so the soldiers begin to relax a little. Things change when their ship is hit and destroyed by the enemy, and the soldiers find themselves abandoned there. Actually, the island isn't deserted and when the Greeks understand that those Italians are harmless, they came out of their hiding places in the mountains and continue their peaceful lives. Soon the soldiers discover that being left behind in a God-forgotten Greek island isn't such a bad thing, after all..."],
      "budget": 0
   },
   "movielensId": 1184,
   "movielens": {
      "languages": [
         "ελληνικά",
         "Italiano",
         "Español"
      ],
      "releaseDate": "1991-01-31",
      "dvdReleaseDate": null,
      "directors": ["Gabriele Salvatores"],
      "runtime": 96,
      "movieId": 1184,
      "title": "Mediterraneo",
      "mpaa": "",
      "actors": [
         "Diego Abatantuono",
         "Claudio Bigagli",
         "Giuseppe Cederna",
         "Ugo Conti",
         "Claudio Bisio",
         "Gigio Alberti",
         "Antonio Catania",
         "Vana Barba",
         "Memo Dini",
         "Vasco Mirandola",
         "Luigi Montini",
         "Irene Grazioli",
         "Alessandro Vivarelli"
      ],
      "imdbMovieId": "0102426",
      "originalTitle": "Mediterraneo",
      "genres": [
         "Comedy",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Greek Sea, World War II. An Italian ship leaves a handful of soldiers in a little island; their mission is to spot enemy ships and to hold the island in case of attack. The village of the island seems abandoned and there isn't a single enemy in sight, so the soldiers begin to relax a little. Things change when their ship is hit and destroyed by the enemy, and the soldiers find themselves abandoned there. Actually, the island isn't deserted and when the Greeks understand that those Italians are harmless, they came out of their hiding places in the mountains and continue their peaceful lives. Soon the soldiers discover that being left behind in a God-forgotten Greek island isn't such a bad thing, after all...",
      "tmdbMovieId": 38251,
      "avgRating": 3.74652,
      "releaseYear": "1991",
      "numRatings": 1079,
      "posterPath": "/zn2nfy87gqCt4uZ7m3Azs16EFRX.jpg"
   }
}