{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sexual obsession",
            "id": 459
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "sexuality",
            "id": 738
         },
         {
            "name": "camcorder",
            "id": 2249
         },
         {
            "name": "spanner",
            "id": 2874
         },
         {
            "name": "orgasm",
            "id": 3201
         },
         {
            "name": "longing",
            "id": 4115
         },
         {
            "name": "interview",
            "id": 4434
         },
         {
            "name": "videotape",
            "id": 177185
         },
         {
            "name": "voyeurism",
            "id": 178649
         }
      ],
      "imdb_id": "tt0098724",
      "video": false,
      "title": "Sex, Lies, and Videotape",
      "recommendations": [
         11562,
         7452,
         10403,
         9540,
         695,
         10712,
         68924,
         14320,
         11159,
         13384,
         884,
         12762,
         11896,
         11033,
         28145,
         11337,
         655,
         2075,
         990,
         2039
      ],
      "backdrop_path": "/esCRA7XoKR95PmbzmcbrfhcXQNN.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "William",
         "id": "5263abec19c2950a330e677c",
         "content": "This is about the most nonsexual movie I have ever seen with the word sex in the title. This is worse than a watered down romance novel. The story was very boring and uninspired. I personally find all the actors/actresses unattractive and there is no chemistry. On top of this being a flat film, it contains absolutely no nudity. This would be fine for the majority of movies but with a name like Sex, Lies and Videotape, one would expect at least brief nudity. Anyways, complete waste of time.",
         "url": "https://www.themoviedb.org/review/5263abec19c2950a330e677c"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ann Bishop Mullany",
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f86b",
               "name": "Andie MacDowell",
               "profile_path": "/znSR45ZcNNlb1sNP1gYmVACYI2a.jpg",
               "id": 1533,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John Mullany",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f86f",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Graham Dalton",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f873",
               "name": "James Spader",
               "profile_path": "/gFDjZje8P0S3MzHuw1cxiYuHBX5.jpg",
               "id": 13548,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cynthia Bishop",
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f877",
               "name": "Laura San Giacomo",
               "profile_path": "/xOPY9e0HN6zYmI5HrmRSbwygEzy.jpg",
               "id": 1212,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Therapist",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f8ab",
               "name": "Ron Vawter",
               "profile_path": "/4macrTl4QtHtTmuQNAm9k9cBCqk.jpg",
               "id": 32592,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Barfly",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f8af",
               "name": "Steven Brill",
               "profile_path": "/9CpoLVxDKV2XRF3rigTNSVimJK1.jpg",
               "id": 32593,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Girl on Tape",
               "gender": 0,
               "credit_id": "5499e2f4925141312f0003cc",
               "name": "Alexandra Root",
               "profile_path": null,
               "id": 1403163,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Landlord",
               "gender": 0,
               "credit_id": "5499e312c3a3682f1e000397",
               "name": "Earl T. Taylor",
               "profile_path": null,
               "id": 1403165,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "John's Colleague",
               "gender": 0,
               "credit_id": "5499e33bc3a3682f160003e2",
               "name": "David Foil",
               "profile_path": null,
               "id": 1403169,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f867",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f87d",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f883",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f889",
               "name": "Nick Wechsler",
               "profile_path": "/1HeDC5sNgXBN09SiyoPs3VcUQsH.jpg",
               "id": 6468,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f88f",
               "name": "Cliff Martinez",
               "profile_path": "/hDYGsWAe7Lacfkx62AyqpllXsqg.jpg",
               "id": 8377,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f895",
               "name": "Walt Lloyd",
               "profile_path": "/7jVPvsnbqRvHRCn4SW3IV3Z3KOr.jpg",
               "id": 10418,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f89b",
               "name": "Deborah Aquila",
               "profile_path": "/7OBiqW30sXcW4f2xMds53L4JBN5.jpg",
               "id": 3965,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f8a1",
               "name": "Victoria Spader",
               "profile_path": null,
               "id": 32590,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f8a7",
               "name": "Joanne Schmidt",
               "profile_path": null,
               "id": 32591,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 8.749379,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1412,
      "vote_count": 237,
      "budget": 1200000,
      "overview": "A sexually repressed woman's husband is having an affair with her sister. The arrival of a visitor with a rather unusual fetish changes everything.",
      "similar": [
         80752,
         106646,
         22705,
         2149,
         4995,
         979,
         627,
         1278,
         28468,
         86331,
         122081,
         112160,
         82023,
         17899,
         1948,
         4247,
         755,
         10497,
         27066,
         11184
      ],
      "original_title": "Sex, Lies, and Videotape",
      "runtime": 100,
      "poster_path": "/kOXATYKziiKmoMxgKA10JOO13JZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Outlaw Productions",
            "id": 889,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Virgin",
            "id": 1419,
            "origin_country": ""
         }
      ],
      "release_date": "1989-08-18",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steven Soderbergh"],
      "runtime": 100,
      "synopsis": "Set in Baton Rouge. Ann Bishop Mullany (Andie MacDowell) is talking to her psychiatrist (Ron Vawter) about a dream in which she is taking out the garbage. Ann is frustrated and has reached the point where she no longer desires sex; although, she says that her husband, John (Peter Gallagher), had already stopped trying to touch her a long time earlier. Ann says that she also is irritated with John for having invited an old friend to stay with them at their house without Ann's consent; however, Ann tells the therapist that it is, after all, John's house, insofar as he is paying the mortgage. We learn that Ann has stopped working altogether, as John is quite successful, a self-made, aspiring big shot -- he plans to become a law office partner soon -- and the couple lives comfortably. Meanwhile, John has been having an affair with Ann's sister, cheeky Cynthia Patrice Bishop (Laura San Giacomo), who is sexually carnivorous and somewhat unrefined, in stark contrast to the more genteel Ann. The sisters enjoy something of a close relationship (talking and visiting often), although it has been clearly tainted by long-established friction. Ann, naturally, does not know of the affair, but has her suspicions. While Ann is in her therapy session, John and Cynthia are having sex. The lovers talk afterward and Cynthia tells John she harbours a \"perverted\" desire to make love to him in her sister's bed. Returning to his law office, John finds Ann had called while he was away to tell him that his old friend, drifter Graham Dalton (James Spader), has just arrived. The three of them, Ann, John and Graham, are having dinner together. John is critical of his old friend, whom he feels has changed considerably since their glory days (mainly, it seems, because Graham wears a black shirt, which John describes as undertaker's clothing). John mentions that Graham ran away from Elizabeth, his old beloved girlfriend. The tension between the two builds further when Graham remarks that liars are the second-worst people in the world, surpassed only by lawyers. The next day, Ann accompanies Graham in search of an apartment. One landlord (Earl T. Taylor) shows them a flat, and after haggling briefly over the rent, Graham takes it. Soon afterward, at a café, talk between Ann and Graham progresses on to the topic of sex. Ann says that women are not generally as interested in sex as men think. Graham admits to being impotent, that he can't have an erection while in the company of anybody else. (We later learn that he masturbates while watching women he has recorded on videotape talking about their sexual lives and fantasies.) Meanwhile, John calls Cynthia so that they can have sex together the way she wants. Cynthia calls him \"scum\", but, of course, seizes the opportunity to fulfill her fantasy and goes to the house where John waits, naked, on the bed he shares with Ann, covered only by a strategically-placed potted plant. On a later unannounced visit to Graham's apartment, Ann interrupts Graham while he is watching a videotape of one of his old girlfriends (Alexandra Root) detailing her sexual experiences. Through her inquiry, Ann learns of Graham's unusual fetish and asks him to watch a tape with him, but Graham refuses: He had promised all the subjects not to let anyone else see their tapes. Ann leaves, disturbed by the revelation (or, more likely, indignant over Graham's refusal) and advises her sister, during their next phone call, not to get in touch with Graham, as Cynthia, ever on the prowl, had promised to do. Cynthia, however, is only intrigued more so by this and visits him, anyway, even though, up to this point, they have never met. Graham soon invites Cynthia to make a videotape. During the recording, she then recalls her first sexual experiences aloud... Immediately afterward, Cynthia, worked up from the experience, calls John demanding he leave work immediately to have sex with her. In spite of the growing pressures of his job, he begrudgingly obliges, though he has to change important work commitments, which he does using \"a family crisis\" as an excuse. Later, Cynthia tells Ann that she has been videotaped by Graham, but refuses to be specific about what she may have told him. And while she assures Ann that nothing sexual occurred between them, she does reveal that she had chosen to masturbate for Graham, to which Ann expresses her extreme dismay. Ann visits Cynthia at the bar where she works to show her (and collect money for) the sundress she's bought as a joint-gift between the sisters for their mother's birthday. A tipsy regular (Steven Brill) who flirts constantly with Cynthia, tries to make a pass at Ann. They both ignore him. Ann leaves annoyed after Cynthia and the barfly remark that the dress looks more like a tablecloth. That night, Ann finally confronts John, asking why he was not in the office when she called, whether he's having an affair, and specifically if he has been having sex with Cynthia. John denies everything, playing both roles of offended husband and lawyer. It works and he convinces her. The following day, John gets angry with Cynthia upon hearing of her visit to Graham's and of her agreeing to make the videotape. After some heated talk, Cynthia tells John to leave, that she doesn't feel like going on with the affair any longer. Meanwhile, Ann is at home vacuum-cleaning the master bedroom when she discovers Cynthia's lost pearl earring stuck inside the machine. Slowly, Ann pieces together what has been going on, how foolish she has been, and reacts, first trying to smash the earring with the vacuum cleaner, then leaving the house after changing her clothes in a rage. Ann arrives at Graham's apartment. She quickly learns that Graham already knew (from Cynthia) that John was being unfaithful, but felt it wasn't his place to tell her. Ann now wants to make her own videotape. Although Graham is hesitant at first, she finally convinces him... Ann returns home very late, John already having started calling friends, frantically concerned that something may have happened to her. As soon as she sits down, Ann tells him she wants out of the marriage. John tries to play innocent once again, keeping calm, but upon hearing that Ann, too, has made a videotape, becomes irate and goes after Graham. John storms into Graham's apartment, punches Graham in the face, locks him outside, and watches Ann's tape. On screen, Ann reveals she's never had an orgasm, not even with her husband. Ann and Graham both admit to having had fantasies of each other. Ann wonders aloud whether Graham could give her an orgasm. Ann then begins turning the tables subtly on Graham, now asking him the questions. It emerges that Graham has spent the last nine years feeling sorry over his idealized ex-girlfriend, Elizabeth, with whom he somehow expected to reconnect, and that this was his reason for drifting back to Baton Rouge. Ann tells him that Elizabeth would never want him back after nine years and especially not with all his unresolved issues. Ann picks up the camera herself and now focuses it on Graham. He confesses that he used to lie compulsively, to everyone, and that the lying, as well as \"non-verbal\" acting-out of his feelings, was what destroyed his relationship with Elizabeth... After some quiet, affectionate moments together on the couch, Graham switches off the camera... As John leaves, having seen all of Ann's videotape, and perhaps truly knowing her for the first time, he spitefully reveals to Graham that he had once had an affair with Elizabeth while she and Graham were still together, even before the relationship started to go downhill. Once John is gone, Graham destroys his collection of videotapes. Some time passes. While John is in his office with a colleague (David Foil) prior to their golf game, John's most important client, the one he had run out on during the affair with Cynthia, calls to say he has found another firm to take his business. John's boss then insists upon seeing him immediately (suggesting that John is likely to be fired because of his irresponsibility). Ann surprises Cynthia with a visit during her shift at the bar to give her a small birthday present along with a new telephone number, the sisters making their first small step toward forgiveness and acceptance of each other. Ann then joins Graham where he waits outside his apartment. They take each other's hands as she walks up, then curl up together on the steps. It appears they are now a couple. It starts to rain.",
      "writers": ["Steven Soderbergh"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098724/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNjk5NzM2Nl5BMl5BanBnXkFtZTcwMTg2ODQwNw@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: James Spader, Andie MacDowell, Peter Gallagher | See full cast and crew »"],
      "reviews": [
         "\"sex, lies and videotape\" is a low-key drama that REALLY showcases Stephen Soderbergh's true talents. The film was made on a modest budget and is mainly dialogue-driven, yet I was deeply fascinated from start to finish. This is another film that sends out a message to all aspiring directors: You don't need a large budget to make a truly great motion picture! Soderbergh hasn't received worldwide fame until recently with the hit \"Traffic.\" As much as I loved \"Traffic\" I urge everyone--who's curious of Soderbergh's work--go check out this initial effort. The element that impressed me the most was the succint, yet brutally realistic dialogue. I've never been more impressed with a film's dialogue and actually screamed out, \"Now THAT'S how people talk!\" The interactions between each character are so intense and down to earth, and gets the audience deeply engaged. James Spader shines in this career-making performance as a documentary filmmaker who gets his rocks off filming women talking about sex. We never know why he developed this unusual interest, but that's what's so great. And the way Spader carries his character is so subtle and powerful. His character is quiet and mysterious, and he expresses this enigmatic role perfectly with every silence, every facial gesture, every tone of voice. That's another element that I loved. Soderbergh expresses to his audience that people don't always mean what they say. And you can tell by every hint of body language. During these character interplays, you get a feel for what the characters are really thinking with their every subtle nuance. And that's what creates most of the film's tension. And of course, the film has great depth and treats its subject with the greatest of maturity. In one scene, Spader interviews this young woman who talks about her first experience with masturbation. That could've easily been transformed into something gratuitous and heavy-handed. The subjects of sex and infidelity are treated with a sense of reality, and I'm sure many couples who are involved in relationships where one of the mates are cheating will find the whole situation with Andie McDowell and Peter Gallagher haunting. Everything is low-key and some might find the rhythm slow-moving, but that's what I liked about it. It slowly unfolds and takes its time developing the characters and their situations. Many filmmakers would've taken the subject of infidelity and made it into a melodramatic soap. But Soderbergh is very patient. He never once thinks, \"Maybe the audience is not interested anymore,\" and speeds things up. He goes at his own pace, and works with it consistently. I don't know if others will get the same effect I did out of this movie, but appreciate a film that respects its characters and respects its dialogue. Sure, I also appreciate a film with massive entertainment value, but other times I'd rather watch something with depth and realism. This is one of those films that just has a subtle energy. Looking at \"sex, lies and videotape\" from the outside, it's hard to explain the power of Soderbergh's masterpiece. All I say is go see for yourself! I hope you'll be just as astounded. My score: 10 (out of 10)",
         "Sex, Lies and Videotape will probably strike the average viewer as irredeemably degenerate, maybe even perverted, since voyeurism is still considered aberrant behavior. But as far as this film is concerned, that's the appearance, not the reality. Whereas the drama revolves to a certain extent around the voyeuristic masturbation of an impotent man, the heart and soul of the film is an unrelenting, hard driving psychological siege on the biggest erogenous zone of all: the brain. This film is about sex. But it's not about the frothy swapping of fluids and feelings. It's about honesty, without which one can't have intimacy, which is to sexual stimulation what the water valve is to the hydrant. From beginning to end, we see this theme brought into focus by the dramatic contrast between two different relationships � the one based on lies and deceit, the other based upon honesty. And guess which one wins out in the long run? In a sense, it's what your mother and Sunday school teacher taught you all along. But what makes this movie way more interesting than your mother or Sunday school teacher is the level of honesty it suggests is necessary as the basis of a healthy relationship. Ann (Andy McDowell), for example, an acceptably moral person tells the voyeuristic masturbator `You got a problem.' He replies by adding that he has a lot of problems. But, he says, `They belong to me.' Somehow, the openness about one's problems renders their bile and poison ineffective. `Lilies that fester,' said Shakespeare, `smell far worse than weeds.'",
         "Spader's character was the reason I enjoyed the film so much. I could identify with him and his dilemma. It seemed he felt like a stranger in an even stranger land. Who were these humans that seem so happy in the same world he could not find happiness within? What is this life we live? More importantly, what is the point? Why bother? His great battle with existence was a philosophical one. He, like myself, felt infinite sadness over the knowledge that are no concrete answers... The movie is also interesting because it attacks the main sexual organ, the mind. Graham while trying to distance himself from the human experience by capturing sex confessionals on videotape, perhaps unwittingly became more intimate with his \"partners.\" Roger Ebert points out that the films' argument is that conversation is better than sex. Personally, I think the movie is about trying to find happiness with another person. Some Modest Mouse song lyrics come to mind. \"And it's hard to be a human being/ And it's harder as anything else/ and I'm lonesome when you're around/ I'm never lonesome when I'm by myself\" Graham finds it hard to be a human being and live in this human world full of values that he finds strange, confusing, and most importantly unfulfilling. What do you do when your ideology and needs don't mesh in the society you live within? How does one deal with feelings of loneliness in a society that spurns him? This movie is about one man's way. James Spader does such an excellent job as this character. In fact, great acting all around by the entire cast and excellent writing and directing by Mr. Soderbergh. Go see this movie now!",
         "Steven Soderbergh, as observed by other reviewers and critics, did take inspiration from the kinds of films Eric Rohmer's been making for decades. These kinds of films, as Sex, Lies, and Videotape is at its core, about people in morality crises, and how they get out of them or linger with how they act is the point. Some people may not like the film, therefore, as nothing incredibly outrageous or spectacular will occur. For all the attention Soderbergh received (Golden Palm, Independent Spirits, Oscar and Golden Globe nominations, immediate recognition), he's made a small film, and it's not as ambitious as some of his later, greater works like Out of Sight and Traffic. But as a revealing, intimate character study, with an often clever and controlled mis-en-scene, Soderbergh shows his skills were already honed at twenty-six. Without good acting the film would be like a hopeless rendition of a foreign film, but with the four lead performances from McDowell, Gallagher, Gia Como, and Spader (his is most under-stated of the bunch for me) these are as fully realized characters as Soderbergh could get. They all must've taken something about the characters in the script, because for all the flaws and misconceptions and fears these characters carry, they are human. Even Gallagher's John, who's the conniving husband and lawyer, is recognizably as he is even when he's comparatively lesser than Graham and Ann. Only one side character, the barfly played by Steven Brill, gets the film to immediately halt with uncomfortable humor. But the rest of the film, loaded with innuendo (there's not one shot of nudity, similar to a Rohmer film like Chloe in the Afternoon, where the cover art of the film is rather misleading to those looking for a film with breasts and other parts) and involving drama, doesn't shake its foundations until maybe the last five to ten minutes. And when it does, it does not make the film a lost cause, at least for me. Begs to be seen again, though with maybe a year or so between viewings. A-",
         "Why does Graham prefer iced tea so much? He offers it to Ann when she visits him for the first time at his apartment. Does the same when Cynthia pays him a visit. When he and Ann are having their first real conversation in the restaurant there's a glass of iced tea next to him, while Ann has a glass of white wine. Besides being a probable leitmotif, it's something that, seems to me is a part of Graham's character. He comes to live in that town to get away, to find a closure to his past. He ends up providing closure to the lives of these three characters. Let's imagine a scenario sans Graham - a phase in the life of a woman whose husband is having an extra-marital affair with her sister. She's suspicious but he denies. She finds evidence to prove that he's having an affair with her sister and decides she's had it, she's leaving her husband. Do you think this might have been the conclusion of this scenario? I think not. As Ann rightly says to Graham, that she would have left her husband anyway, but the reason she's doing it now, is because of him. She thinks sex is overrated, her sister seems to believe in the opposite and here comes a man whose profession, for all practical purposes is having women talk about sex. Ann's therapist is a foil to Graham. While he dispenses his advice and listens patiently to Ann, Graham is the all important catalyst that helps her make a practical decision in her life. He also aids in her real sexual awakening. Before Graham, sex, for Ann was incidental. Now it takes on a different perspective. One might say that in making women talk so intimately to him about sex, he sort of breaks the ice on a topic that is more or less socially tabooed. His is a presence that evokes trust in the most introverted of women, making them confide in him and by doing so have an almost cathartic experience. I think the iced tea motif of Graham's character fits in here. Beyond his trademark black-shirt, blue denim attire, it is the only other element related to him that is conspicuously stated. That's my conjecture anyway! Needless to say, James Spader is superb as Graham. He manages to evoke many of the nuances of Graham's character by subtle, volatile facial expressions. Andie McDowell is also great as Ann. Hers is a really sensitive and touching performance. Peter Gallagher and Laura San Giacomo are both equally good. The music for this film is appropriately minimal and poignant. Great effort by Soderbergh, who I'm glad to hear has come back to his experimental film roots with his recent film 'Full Frontal'.",
         "Yes, \"Sex, Lies and Videotape\" is about sex, lies and videotape. And, while the sex is mostly served in dialogue-form and not a single shot of nudity is present, there is some graphic lying and some explicit videotape. Kinky, right? Well, not really. \"Sex, Lies and Videotape\" is Steven Sodenbergh's first film and it's not a bad one. It's just not entirely worthy of the praise it received, at Cannes for example. The situations in the film do create a fair amount of tension that moves the story along. But then, it'd be hard not to have some tension in a film about a woman whose husband is cheating on her with her sister, while she starts interacting with a stranger who is the husband's old college roommate and has a strange videotape fetish and may or may not be a pathological liar. (How do you believe someone who just confessed to having been a pathological liar to not being one anymore? The film doesn't really riddle that one for us.) Clearly, these characters clash together. But it's not as heated or interesting as it was in later Sodenbergh's films like the spectacular \"Traffic.\" The dialogues in \"Sex, Lies and Videotape\" range from good to incredibly awkward. But the real strength of the film is the actors. While James Spader clearly stands out - I have never seen him deliver such a subtle performance where every scene simply works for him - Andie McDowell is phenomenal, Peter Gallagher playing the scummy, treacherous husband yuppie lawyer type is great and Laura San Giacomo as the vulgar sister / lover is fabulous. Their performances make the script work, which, under normal circumstances with inferior actors would have seemed rather silly.",
         "It is a film about relationships, dilemma, courage and more. What works in life and what does not. Honesty does and (crudely speaking) at a very basic level that is the message. At the very heart are the three protagonists who are stuck. The therapist is spectacularly wrong in his interpretation to the apparently frigid wife: 'If you think about it ...you are obsessed about things you have no control over'. But she demonstrates at the end that she did have the control. All she needed was a better, more 'intimate' therapist; a catalyst : Graham ; who ends up uncluttering the cheating sister in law's mind and forces the husband to confront his problems in the process. It is a remarkably optimistic film in its content and therefore perhaps slightly unrealistic. It is a film about masterful use of contrasts; the two women and the two men could not have been more opposite in every possible respect. In a way Graham is also a perfect contrast to the imperfect Psychoanalyst. This helps the director bring out the message clearly. The whole film is crafted in a minimalist way, flows smoothly and does not carry much 'garbage'! Music, camera and the narrative are almost perfect in that they are almost invisible. So are the actors, especially James Spader and to a large extent Andie MacDowell. Gallegher is probably less than perfect but very good nonetheless. Laura Giacomo portrays a rather difficult character really well. It treats the audience with respect as the message is subtle and very personal, as it should be. My only grievance is the last office scene involving Gallegher was probably unnecessary. Sex and the videotapes are incidental to the storey and perhaps misnomers therefore. It is like reading a rather well written short storey and I would recommend 'Days And Nights In The Forest' (perhaps slightly more realistic and understated than this film) by Satyajit Ray to those who have enjoyed this film. My rating 8/10.",
         "Steven Soderbergh's Sex, Lies, And Videotape was all the rage at Cannes in 1989, winning the Golden Palm Award for Soderbergh and the Best Actor Award for James Spader. Soderbergh was also nominated for an Oscar for his screenplay. Despite the lurid, voyeuristic title, this film is not really about sex at all. It's about intimacy and what it takes to reach that with another person. Lies are always a barrier to that, but who would have thought that videotape would be so useful in revealing so much about people, although it actually shows little? James Spader, late of \"The Practice\" fame, is outstanding as the old college friend that returns to his friend's town, and stirs up the truth about each character. Peter Gallagher, currently in \"The O.C.\", is equally great as the lawyer, husband, who uses those in his orbit without regard to any consequences. Andie MacDowell is absolutely perfect as the conservative wife, who thinks that sex is overrated. Laura San Giacomo, from \"Just Shoot Me\", is also perfectly cast as the sexpot sister of MacDowell. All the actors, who weren't too well known at the time, give bull's eye performances. Rarely has any of them been as good since. Soderbergh's direction and screenplay are also responsible for the success of the film. Very little actually happens in the movie in terms of action, scene changes, and technical aspects of film in general. It's reminiscent of the many talky European films that are often very frank but where little happens. However, there is not a wasted moment in this film. Soderbergh gives us one of the most honest, mature depictions of the barriers to intimacy ever put on film. In doing so, he shows us that the characters are not free of their own ulterior motivations, even though some appear to change for the better. What is significant is that barriers to intimacy are just as difficult to face as the events that precipitate our facing them. The brief final shot speaks volumes with no dialog. ***1/2 of 4 stars.",
         "A classic case of where the mechanics of marriage become the insidious culprit to sexual indiscretion...John Millaney is the overly mortgaged white collar malcontent who is callous with his regard toward marital fidelity...He has an affair with his wife's sister, Cynthia Bishop, she is a morally bankrupt loner who resents her sister's relatively structured existence...Gram Dalton is the voyeuristic creep who preys on the dissatisfaction of married women with the seven year itch syndrome, and other disgruntled and socially misplaced women as well!! He perceives vulnerability in women to be sexually stimulating!! His ultimate undoing is his creative resolution to boredom, and this basically backfires in an absolutely horrendous way!!! Ann Millaney (John's wife) is torn between a perfect marriage and an emotional millennium.. She is convinced that not only does doing things her way work, IT MUST!!. It is not necessary to have all the missing pieces to the puzzle in her marriage because she realizes the ramifications of such a heinous plight!! What presses everyone's buttons? Is it kink, is it bi, or bi for the night, is it emotional nurturing?...James Spader's character (Gram Dalton) has a life that is based on comparative stability, everybody (mostly women) can expose their lewd nuances while he keeps his a secret, once someone has tampered with his quirkiness which is close to the vest, he has no ability to cope, thus, he exaggerates his mistakes!!!All of the characters in this film are hit with the grim reality that not accepting responsibility accomplishes nothing....They all engage in a form of permanent self destruction!! Being flippant about immorality has a definite rude awakening!! What seems complicated is really very simple, and the depraved intrigue of perversion merely brings out all of their most dreaded skeletons in the closet!!!! Seldom in a film is there such a precise poignancy about things that bother people that really should not bother them at all...This is what gets them into so much trouble!! Steven Soderbergh's production efforts in this film were merely a harbinger of things to come, as he has gone on to produce and direct fabulous movies (\"Good Night and Good Luck\", \"Syrianna\", and \"Traffic\", to name but a few!!) This film effectuates a noteworthy devotion to an unintentional and sordid sexual authenticity!! Sundance is a network for the non-conventional..\"Sex Lies and Videotape\" is testament to the fact that what appears gray flannel is not always the panacea people would like to believe it to be!! Marital upheaval is all about emotional affliction in this movie. Latent reactions are a manifestation of psychological insecurity. You are never going to get what you want out of a relationship because you don't know what that is!! This was the summon substance of what the film \"Sex Lies and Videotape\" was all about!! This film had a personal dedication to it as well!! A very well made film, I give it 5 stars!!!",
         "Steven Soderbergh's now legendary debut was the first his film I saw. It was in 1989, during the Moscow International Film Festival. Only later I found out that Sodebergh was 29 when he wrote the screenplay in eight days during a trip to Los Angeles and made the film for $1.8 million. His independent movie was a real hit that was selected for Cannes Film Festival and won the Palme d'Or and the best actor prize for James Spader. The film concerns four attractive and intelligent young people. Ann (Andy MacDowell in the best role I've ever seen her) is married to John (Gallagher) but their sexual life is practically non-existent since Ann finds sex over-rated, and to simply put it, she does not enjoy or even need it. John is having an affair with Ann's sexy younger sister, Cynthia (San Giacomo) who seems to resent Ann. Enters Graham (Spader), John's college friend with the unusual hobby of videotaping women while they describe their sexual fantasies and very important skill - he knows how to listen. I had seen many movies before \"sex, lies and videotape\" and I've seen plenty since but it has a special place in my memory. It was the first film I had seen that dealt with and talked about very intimate topics of sexuality, satisfaction, jealousy, sisters' relationship, marital problems and loyalty, the secret longings in all of us, and the ever mysterious nature of erotic desire with such level of honesty, openness, and intelligence. The writing, the dialogs, and the acting are superb with James Spader and Laura San Giacomo simply outstanding and Andie McDowell very convincing."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Outlaw Productions (I)",
         "Virgin"
      ],
      "summaries": [
         "Ann is married to John, who is having an affair with her sister Cynthia. Ann's a quiet type and unwilling to let herself go. When John's old friend, Graham, shows up, all their lives change. Graham likes to videotape interviews with women.",
         "John and Ann Mullany, a junior partner at a law firm and a housewife respectively, are a young, upwardly mobile couple, who most would deem to have a perfect life. Ann's outward perfection belies the fact that she is in therapy, dealing with the stress over worrying about global issues with which she has little to no control. She does not see certain things with which she does have control being problems in her life, namely her sexual repression or her disinterest in sex as an activity, that is until it manifested itself in this stress which in turn is having, what she believes, a negative impact on her marriage. What she is unaware of is that, long before her stress began, John embarked on an affair with her sister, bartender Cynthia Bishop, who she doesn't admire as being too \"loud\". John reconnects with a close friend from college named Graham Dalton, who, to John, appears to have lost his way in life in the years that they have not been in touch. Graham, via the method in which he deals with his emotional and sexual problems - which is also believes is being totally forthright to all concerned - has a profound effect on Cynthia, John and Ann, who in turn, especially Ann, have a profound effect on him.",
         "A sexually repressed woman's husband is having an affair with her sister. The arrival of a visitor with a rather unusual fetish changes everything."
      ],
      "budget": 1200000
   },
   "movielensId": 1186,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-08-18",
      "dvdReleaseDate": "1998-09-08",
      "directors": ["Steven Soderbergh"],
      "runtime": 100,
      "movieId": 1186,
      "title": "Sex, Lies, and Videotape",
      "mpaa": "R",
      "actors": [
         "Andie MacDowell",
         "Peter Gallagher",
         "James Spader",
         "Laura San Giacomo",
         "Ron Vawter",
         "Steven Brill",
         "Alexandra Root",
         "Earl T. Taylor",
         "David Foil"
      ],
      "imdbMovieId": "0098724",
      "originalTitle": "Sex, Lies, and Videotape",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["rxdQQpJ9t-4"],
      "plotSummary": "A sexually repressed woman's husband is having an affair with her sister. The arrival of a visitor with a rather unusual fetish changes everything.",
      "tmdbMovieId": 1412,
      "avgRating": 3.51421,
      "releaseYear": "1989",
      "numRatings": 8619,
      "posterPath": "/kOXATYKziiKmoMxgKA10JOO13JZ.jpg"
   }
}