{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wheelchair",
            "id": 2564
         },
         {
            "name": "louisiana",
            "id": 3134
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "soap opera",
            "id": 168622
         },
         {
            "name": "actress",
            "id": 207583
         },
         {
            "name": "accident",
            "id": 207819
         }
      ],
      "imdb_id": "tt0105107",
      "video": false,
      "title": "Passion Fish",
      "recommendations": [
         31901,
         77434,
         24276,
         25113,
         27397
      ],
      "backdrop_path": "/91dvH3w4uywkkIiIIbzviwahsaQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "May-Alice Culhane",
               "gender": 1,
               "credit_id": "52fe45dbc3a36847f80de7bd",
               "name": "Mary McDonnell",
               "profile_path": "/4NcE9BcnLB3oWns51r9peH8GhN8.jpg",
               "id": 1581,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Chantelle",
               "gender": 1,
               "credit_id": "52fe45dbc3a36847f80de7c1",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nurse Quick",
               "gender": 1,
               "credit_id": "52fe45dbc3a36847f80de7c5",
               "name": "Lenore Banks",
               "profile_path": "/u6wZ7cM2nZVYil3XvLkHVuFw7ON.jpg",
               "id": 20765,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rhonda / Dawn",
               "gender": 1,
               "credit_id": "52fe45dbc3a36847f80de7c9",
               "name": "Angela Bassett",
               "profile_path": "/tHkgSzhEuJKp5hqp0DZLad8HNZ9.jpg",
               "id": 9780,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sugar LeDoux",
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de7cd",
               "name": "Vondie Curtis-Hall",
               "profile_path": "/tH7QvQ9ST9zLuZZsTHzxMXkgtIy.jpg",
               "id": 6198,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Rennie",
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de7d1",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ti-Marie",
               "gender": 1,
               "credit_id": "52fe45dbc3a36847f80de7d5",
               "name": "Nora Dunn",
               "profile_path": "/wX89q3KHGOe0z47LU6UmukgEdo7.jpg",
               "id": 4496,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Luther",
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de7d9",
               "name": "Tom Wright",
               "profile_path": "/AlBgY9VySrLBhVsOJXtUXuflOGG.jpg",
               "id": 55270,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Reeves",
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de7dd",
               "name": "Leo Burmester",
               "profile_path": "/8V3Ev6pKP8VBRIjDONJW5cgi5Zc.jpg",
               "id": 30151,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dr. Kline",
               "gender": 2,
               "credit_id": "589656db9251412e1900f86f",
               "name": "Michael Mantell",
               "profile_path": "/80CLXfrPC9BoqhjsV5k5rzm5XQL.jpg",
               "id": 91030,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Drushka",
               "gender": 1,
               "credit_id": "589657059251412e1900f885",
               "name": "Marianne Muellerleile",
               "profile_path": "/5Qex2uBzsjqSRUFeeW4sT7FhuYH.jpg",
               "id": 543,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Louise",
               "gender": 0,
               "credit_id": "589657f09251412e16010238",
               "name": "Maggie Renzi",
               "profile_path": "/6KeCgZsBKF8Wr0mAY8NlclHDF5d.jpg",
               "id": 20835,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Perky",
               "gender": 1,
               "credit_id": "5896597b9251412e1900fa46",
               "name": "Amanda Carlin",
               "profile_path": "/71BztypUVB0Ai2cjDT4ZMyecOHU.jpg",
               "id": 156692,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Kim",
               "gender": 1,
               "credit_id": "589659a992514129c800bd23",
               "name": "Sheila Kelley",
               "profile_path": "/chbHBKXxpEKTKWhY6aazEAZGKRb.jpg",
               "id": 68109,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Precious",
               "gender": 1,
               "credit_id": "589659dd9251415a5b00b578",
               "name": "Mary Portser",
               "profile_path": "/tBcI5T3Y0bxm5u3n1T5w1doFL8e.jpg",
               "id": 58354,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Nina",
               "gender": 0,
               "credit_id": "58965b979251412e0d01021b",
               "name": "Nancy Mette",
               "profile_path": "/u59U4lhU25groL2jdTidzuOvdSk.jpg",
               "id": 169316,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Redwood Vance",
               "gender": 2,
               "credit_id": "58965bf0c3a36808a500fadb",
               "name": "Michael Laskin",
               "profile_path": "/dt0nTgeDt8kfWWtpXvanE1L28q8.jpg",
               "id": 19454,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de7b3",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de7b9",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5910f80b9251414e92039090",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5910e1819251414eca035f6d",
               "name": "Sarah Green",
               "profile_path": null,
               "id": 16398,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5910e1889251414e8d0365b0",
               "name": "Maggie Renzi",
               "profile_path": "/6KeCgZsBKF8Wr0mAY8NlclHDF5d.jpg",
               "id": 20835,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5910e1909251414ead035969",
               "name": "John Sloss",
               "profile_path": null,
               "id": 3727,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5910e1989251414e9203824c",
               "name": "Mason Daring",
               "profile_path": null,
               "id": 20836,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5910e19ec3a36864c603798f",
               "name": "Roger Deakins",
               "profile_path": "/pSCN7CfILlfQrxX43Kgqrx5mBYQ.jpg",
               "id": 151,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.239201,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41768,
      "vote_count": 9,
      "budget": 0,
      "overview": "Soap actress May-Alice Culhane is paralyzed from the waist down in an accident. She returns to her old home in Louisiana, where she proceeds to drink quite steadily and to drive away five personal attendants in the first twenty minutes of the movie. Then she meets with Chantelle, whose stubbornness matches her own -- if only because Chantelle, herself a recovering cocaine addict, cannot afford to lose this job. Their mutual dislike gradually develops into an armed truce as the two women deal with their own problems and with each others'.",
      "similar": [
         2142,
         3134,
         298312,
         11564,
         205,
         769,
         4771,
         281,
         339692,
         281957,
         458741,
         296096,
         395834,
         8834,
         445954,
         10285,
         431,
         681,
         948,
         23483
      ],
      "original_title": "Passion Fish",
      "runtime": 135,
      "poster_path": "/xiDasTZfOZ0jEZ6O3NiapeVzUIV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Atchafalaya",
         "id": 36289,
         "origin_country": ""
      }],
      "release_date": "1992-12-11",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Sayles"],
      "runtime": 135,
      "synopsis": "May-Alice Culhane (Mary McDonnell), a soap opera actress, is injured in a Manhattan street accident which leaves her paralyzed from the waist down. Bitter and self-pitying, she returns to her long-empty Louisiana home. There she spends her days and nights lying on a couch, watching TV and drinking wine. She runs through several live-in nurses, none of whom she gets along with. Finally the agency sends a new nurse, sullen and cold Chantelle (Alfre Woodard). Chantelle soon makes it clear she won't put up with May-Alice's drinking and laziness, and they have frequent arguments. Through all this a series of visitors to the house provide insights into May-Alice's life, while May-Alice learns from a vaguely menacing stranger that Chantelle is a recovering cocaine addict. May-Alice and Chantelle finally begin to warm to each other. May-Alice quits drinking, follows Chantelle's physical therapy regime, and takes up photography. Chantelle begins an affair with a local horse trainer, while May-Alice enjoys the increasing attentions of a married handyman she knew as a teenager. Eventually May-Alice finds out that Chantelle has a young daughter, Denita, who lives in Chicago with her legal guardian, Chantelle's father. He brings Denita down for a visit and, happy with Chantelle's progress, says he will send Denita down for the summer if Chantelle shows she can stick with the job. May-Alice, in the meantime, has been offered her New York job back, but the role is an insulting exploitation of her disability, and she turns it down. In the end, Chantelle and May-Alice decide they need each other more than they realized, and agree to continue their living arrangement.",
      "writers": ["John Sayles"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105107/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjcyOTM0NTAzOF5BMl5BanBnXkFtZTYwNDIyMDU5._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Mary McDonnell, Alfre Woodard, Angela Bassett | See full cast and crew »"],
      "reviews": [
         "John Sayles gives the viewer a two-second break at the end of every scene in this small, perfectly-acted film. The conversations slow or stop, the action halts, sometimes the screen goes blank. The viewer has a chance to appreciate the scene, think about what just happened, savor the moment. Not every pause happens after something significant -- or was that scene important? Everyone who watches this movie will appreciate something else, I think. \"Passion Fish\" is so detailed that there is a wealth of emotional content for the audience. Watch for Alfre Woodard's excitement when she is reunited with her daughter. Was that tiny squeal in her voice just good acting or did we just witness the manifestation of a mother's spontaneous, overwhelming love that happened to take place in front of a rolling camera? And what about the hilarious monologue a soap-opera actress speaks when she related the worst role she ever played, the victim of alien medical experiments in a low-budget sci-fi picture? It has nothing to do with the plot of \"Passion Fish,\" or does it? Maybe it tells of the indignities we all go through to achieve success, love, self-respect. Can you tell that I really liked this movie?",
         "John Sayles is a truly brilliant filmmaker. This film combines great story writing with precise interpersonal direction. Both Mary McDonnel and Alfre Woodard deliver characters who develop clearly throughout the story. Mr. Sayles' depiction of Cajun culture as it crosses with Yankee cultures is really quite impressive. Although the screenplay leans towards sentimentality, it never becomes trite as so many interpersonal dramas have a tendency to do. Sayle's scathing commentary on the self-centeredness of mainstream American culture through his depiction of people associated with daytime drama while avoiding any negative commentary on southern culture is refreshing and a pleasure to watch.",
         "It's regularly noted that director John Sayles is a master at creating detailed characters; this film (like especially his earlier MATEWAN) proves his genius at capturing the oft-overlooked variety of American life: dialects, and the smallest (but most meaningful) moments of work, anger, tragedy, or sweetness. This skill was surely refined during his earlier years as a novelist, and - in maturity - makes his work (and this film in particular) far more human and gimmick-free than Amer-indie contemporaries like David Lynch or Jim Jarmusch. I first saw this when it was released, and was very impressed (it was the first Sayles film I'd seen), and after a much-belated second viewing, I'd say it's one of the great American films of the 90s. Sayles' feel for detail shows continually - the small, but continual bits of personal history revealed about all of the characters throughout; the intricacy of even incidental encounters (an afternoon of zydeco music, or the COOLEY HIGH reference that slips quickly between Angela Bassett and Alfre Woodard) is stunning. Evoking Robert Flaherty's LOUISIANA STORY, the boat-trip-to-Misere scene is particularly memorable, with well-deployed Cajun lore blending with very memorable cinematography (courtesy Roger Deakins, cinematographer for FARGO, KUNDUN, SHAWSHANK REDEMPTION & SID AND NANCY, among other recent classics) to create one of the most unforgettable moments of Sayles' career. As most of the primary characters are either outsiders, or are returning after long absences, the common problem of show-biz fake accents is avoided nicely - Sayles (and Deakins) manage to capture an image of rural Louisiana that is enveloping and authentic, while never forgetting the reality that accents will vary widely even in local areas. Thus the fact that many characters refuse to lay on the drawl - even as many others in the film nail the sound of rural Louisiana perfectly - only makes PASSION FISH stronger. Overall this is a tale of growth and friendship that moves with the speed and emotions of life - none of it feels fake or forced, and though slow-to-start (another strength, though only seen as one by the film's end), PASSION FISH quietly develops into something unique and great. At every moment where this could've degenerated into movie-of-the-week sap, Sayles instead elegantly and confidently steers the film into DeSica (or Woody Guthrie and Steinbeck) territory: there's not a sour note to be seen here.",
         "John Sayles is one of the finest film makers around, and \"Passion Fish\" ranks as his most human, funny, and provoking film. Fueled by tremendous performances by the always reliable Mary McDonnell and the extraordinary Alfre Woodard, \"Passion Fish\" takes a slow, easy pace through the Louisiana bayous and through difficult adjustments with life. David Strathairn, Vondie Curtis Hall, are McDonnell and Woodard's love interests, respectively, and add wonderful colors of both subtle and flamboyant hues. We find ourselves laughing at McDonnell's crude humor as paralyzed soap opera actress May Alice, especially in an amusing segment in which she drives away a number of interestingly characteristic nurses. Then, May Alice meets Woodard's Chantelle, a Chicago woman looking to rectify her own life. Their friendship is stunning, the ride is a pure joy. \"Passion Fish\" is a quiet film, and meant for those who enjoy those voyages through life with patience, humor, and camaraderie through the most difficult of circumstances, ultimately finding the true gifts of life.",
         "In an era of special effects and media hype, it is rare and refreshing to find a movie where only the passion of the actors and the strength of the script carries the weight. This film about a Hollywood star who needs to accept and transform her former self after a debilitating accident is not for action fans, but will appeal to those who understand that celluloid is often a tool for enlightening those who are willing to think & feel for themselves. Slow-paced doesn't always mean tedious. I was not bored a for minute.",
         "I love this movie as much today as I did when I first viewed it. The performances by the actors were wonderful, the soundtrack is really fantastic, and John Sayles' script was funny and thought provoking. I loved the whole May Alice-Rennie angle, the May Alice-Chantelle, and the Chantelle-Sugar story lines, all woven together masterfully. One of the things I love best about John Sayles' movies is his ability to add supporting characters in such a fun and useful way. And he chooses REAL actors for those parts (note Angela Bassett). I thought he really captured the feel of bayou land, LA. and friction? boy! was there ever friction!",
         "This film surprised me a lot. I liked it very much. It was well-written, acted, and worth watching Mary McDonnell who received her second Oscar nomination for this performance. Alfre Woodard should be nominated for best supporting actress. I was surprised to find two equally challenging roles for women in an almost extinct era. The relationship between the two women grows slowly. It is nice to see friendship between these two very different characters. May Alice becomes a likable person after awhile. Angela Bassett has a small role as her friend from New York City. David Straitharn plays an old flame who has since married and remain local in the Louisiana swamps of their hometown. It's a great story overall with characters that you grow to like over the time we spend with them.",
         "Writer/Director John Sayles' 1992 outing tells the tale of a soap opera star (Mary McDonell), who's been in a car accident, and is now wheelchair bound, and her unlikely friendship with her live-in nurse (Alfre Woodard). Excellent supporting roles from the great David Strathairn (A Sayles fave, star of Limbo), Vondie Curtis-Hall (who went on to direct Gridlock'd), and Angela Bassett. I gotta say this. Sayles always writes believable characters, and his dialogue is amongst the best in filmdom. I knew my wife would like this, which was my main motivation for renting it. I'd seen it before, but had forgotten just how good it is. McDonell garnered a well-deserved Oscar nomination for her role in this largely overlooked gem. 4 (of 5) stars on this one.",
         "In this current era of moviemaking, it's rare than an idea as soft, as pure as Passion Fish, will be given an opportunity to be made. Thankfully John Sayles has the ability to circumvent the \u0091by-committee' filmmaking which would have ultimately turned this wonderful little film into God know's what. Mary McDonnell will never be better-she is brilliant, than in her portrayal of May-Alice Culhane (for which she was Oscar-nominated), the once-on-top Soap Opera star to whom tragedy has taken the use of her legs, and forced a re-evaluation of her life. Alfre Woodard, as the hired home-care worker/nurse Chantelle provides the perfect complement as both these women find more of themselves through each other, then they might ever have found otherwise. Again, Ms. Woodard has rarely disappointed. The early montage of health-care applicants is clever and funny. And John Sayles always is able to find brilliance in his supporting cast: notably Vondie Curtis-Hall, Leo Burmester, and David Strathairn, as well as a small role early in the career of Angela Bassett. Sayles' script was also nominated for an Academy Award.",
         "I have only caught up with two of Sayles' directorial works \"Limbo\" and \"Passion Fish\". Though the subjects of the two films are quite dissimilar, Sayles penchant for building interesting character profiles is unmistakable in both. Both films have an interesting screenplay, developing anecdotes that seem to be strung together like beads on a necklace. In \"Passion Fish\", a somewhat successful actress watches TV soaps and makes comments. Zoom out of the situation and you realize that situation itself is close to a TV soap opera. Now directors like Robert Altman and Paul Mazursky have done similar themes with considerable success. European cinema (Claude Sautet for one) has numerous examples of what Sayles did in the US a decade before in Europe. Yet Sayles like Mazursky (\"An Unmarried Woman\",\"Harry and Tonto\", etc.) is able to instill humor and pathos into his celluloid essays with considerable felicity. What makes \"Passion Fish\" tick? At a very obvious level there is a remarkable performance by Mary MacDonnell. You need to be a stage actress to have done justice to the demanding role of a paraplegic--perhaps Billie Whitelaw or Anne Bancroft or Joanne Woodward would have fared as well as Mary. Much of Mary's acting is limited to voice modulation and restricted body movements. Two other performers stand out: Alfre Woodard and David Strathairn. I have watched Strathairn perform in other movies but he is just superb when working for Sayles. \"Passion Fish\" like \"Limbo\" has a strong musical selection. Sayles, like Michael Mann and Peter Weir, has a good ear for music and sound editing. Yet \"Limbo\" outclasses \"Passion Fish\" by a mile in this department, thanks mainly to the song sung by lead actress herself. Finally the film \"Passion Fish\" survives on a strong screenplay and above average direction. The screenplay is loaded with social comments expressed in a documentary style: comments on a \"business manager\" who never appears, race relationships, religion (\"she took to it after the second child..\"), etc. The film expects us to follow the obvious childhood sweethearts-meet-again route but interestingly does not. This is the stamp of Sayles--a filmmaker who makes a sudden twist towards the end that makes all what preceded look better than it did. He did this in \"Limbo\" with aplomb, but \"Passion fish\" seems to anticipate the more accomplished storytelling of \"Limbo\"--the dark swamp metaphor of \"Passion Fish\" seems to be heralding the cloudy sky of \"Limbo\". One thing is certain--Sayles is an important screenplay writer comparable to David Mamet and Terrence Malick. As a director one could argue that his work is not new in style (\"Limbo\" harks back to \"The Oxbow Incident\") yet he cannot be dismissed--his work stands out amongst contemporary American movies, especially independent cinema."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Atchafalaya"],
      "summaries": [
         "May-Alice Culhane was a successful soap opera star, but a car accident has left her bound to a wheelchair. She returns to her now-empty family home in the bayous of Louisiana which she had eagerly left years before. She drinks heavily and vents her bitterness on the succession of nurses who are hired to take care of her and immediately quit because she is so unbearable. Chantelle is the latest of these nurses, and May-Alice is told that Chantelle is the last nurse she'll get. Chantelle for reasons of her own, is also in a position where she badly needs the job to work out. The movie focuses on how these two women become friends and help each other heal emotionally.",
         "Soap actress May-Alice Culhane is paralyzed from the waist down in an accident. She returns to her old home in Louisiana, where she proceeds to drink quite steadily and to drive away five personal attendants in the first twenty minutes of the movie. Then she meets with Chantelle, whose stubbornness matches her own -- if only because Chantelle, herself a recovering cocaine addict, cannot afford to lose this job. Their mutual dislike gradually develops into an armed truce as the two women deal with their own problems and with each others'."
      ],
      "budget": 3330000
   },
   "movielensId": 1187,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-12-11",
      "dvdReleaseDate": "1999-03-30",
      "directors": ["John Sayles"],
      "runtime": 135,
      "movieId": 1187,
      "title": "Passion Fish",
      "mpaa": "",
      "actors": [
         "Mary McDonnell",
         "Alfre Woodard",
         "Lenore Banks",
         "Angela Bassett",
         "Vondie Curtis-Hall",
         "David Strathairn",
         "Nora Dunn",
         "Tom Wright",
         "Leo Burmester",
         "Michael Mantell",
         "Marianne Muellerleile",
         "Maggie Renzi",
         "Amanda Carlin",
         "Sheila Kelley",
         "Mary Portser",
         "Nancy Mette",
         "Michael Laskin"
      ],
      "imdbMovieId": "0105107",
      "originalTitle": "Passion Fish",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["RsugtjWFMeQ"],
      "plotSummary": "Soap actress May-Alice Culhane is paralyzed from the waist down in an accident. She returns to her old home in Louisiana, where she proceeds to drink quite steadily and to drive away five personal attendants in the first twenty minutes of the movie. Then she meets with Chantelle, whose stubbornness matches her own -- if only because Chantelle, herself a recovering cocaine addict, cannot afford to lose this job. Their mutual dislike gradually develops into an armed truce as the two women deal with their own problems and with each others'.",
      "tmdbMovieId": 41768,
      "avgRating": 3.66328,
      "releaseYear": "1992",
      "numRatings": 1231,
      "posterPath": "/xiDasTZfOZ0jEZ6O3NiapeVzUIV.jpg"
   }
}