{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "death penalty",
            "id": 2122
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "police officer",
            "id": 15090
         },
         {
            "name": "court trial",
            "id": 157107
         }
      ],
      "imdb_id": "tt0096257",
      "video": false,
      "title": "The Thin Blue Line",
      "recommendations": [
         2260,
         69480,
         26564,
         24998,
         501,
         14275,
         13958,
         899,
         32255,
         44065,
         26755,
         44445,
         77365,
         1779,
         10227,
         43003,
         16636,
         18900,
         25508,
         8740
      ],
      "backdrop_path": "/kSaEzPnNu8HAvq1TpbmqWNPKP7.jpg",
      "revenue": 1209846,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "54bb0fb192514148b000442f",
               "name": "Randall Adams",
               "profile_path": null,
               "id": 1414776,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "54bb0fc1c3a368141100418e",
               "name": "David Harris",
               "profile_path": null,
               "id": 206088,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself (Homicide Detective in Dallas)",
               "gender": 0,
               "credit_id": "54bb0fd29251416eae0003f3",
               "name": "Gus Rose",
               "profile_path": null,
               "id": 1414777,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Herself (Homicide Detective in Dallas)",
               "gender": 1,
               "credit_id": "580b6153c3a368258f001c8f",
               "name": "Jackie Johnson",
               "profile_path": null,
               "id": 1697857,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e29251416c75065c8f",
               "name": "Errol Morris",
               "profile_path": "/6ck4ws1yMg3oLlZmdONi8T35aSU.jpg",
               "id": 18533,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55155f50c3a36803da002065",
               "name": "Errol Morris",
               "profile_path": "/6ck4ws1yMg3oLlZmdONi8T35aSU.jpg",
               "id": 18533,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59bc36599251411e8b0062a4",
               "name": "Philip Glass",
               "profile_path": "/5xhnji5hjwJHbWer6nwjFdM9GAB.jpg",
               "id": 1551,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "59bc3696c3a368773f000006",
               "name": "Robert Chappell",
               "profile_path": null,
               "id": 56075,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59bc36a7c3a3687755000017",
               "name": "Stefan Czapsky",
               "profile_path": null,
               "id": 1919,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59bc37009251411947000098",
               "name": "Paul Barnes",
               "profile_path": null,
               "id": 1096254,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 6.336298,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14285,
      "vote_count": 148,
      "budget": 0,
      "overview": "Errol Morris's unique documentary dramatically re-enacts the crime scene and investigation of a police officer's murder in Dallas.",
      "similar": [
         15069,
         984,
         8090,
         96,
         807,
         4771,
         75780,
         357096,
         21484,
         10651,
         11423,
         2749,
         479,
         18587,
         26390,
         37645,
         12150,
         369300,
         1586,
         1949
      ],
      "original_title": "The Thin Blue Line",
      "runtime": 103,
      "poster_path": "/xFN3xPDzN4O7oIBmxnLIh8VROIw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel 4 Television Corporation",
            "id": 15276,
            "origin_country": ""
         },
         {
            "logo_path": "/1m2KHBvGUKWFxxanwMNbuQ7lM5h.png",
            "name": "IFC Films",
            "id": 307,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "American Playhouse",
            "id": 3906,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Third Floor Productions",
            "id": 49628,
            "origin_country": ""
         }
      ],
      "release_date": "1988-08-28",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "A softcore movie, Dr. Death, a chocolate milkshake, a nosey blonde and \"The Carol Burnett Show.\" Solving this mystery is going to be murder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Errol Morris"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Errol Morris"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0096257/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3ODAyODY3MF5BMl5BanBnXkFtZTcwMjQ5OTgyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Randall Adams, David Harris, Gus Rose | See full cast and crew »"],
      "reviews": [
         "This is an extraordinary documentary in which film maker Errol Morris shows how an innocent man was convicted of murdering a policeman while the real murderer was let off scot free by the incompetent criminal justice system of Dallas, Texas. The amazing thing is that Morris demonstrates this gross miscarriage of justice in an utterly convincing manner simply by interviewing the participants. True, he reenacts the crime scene and flashes headlines from the newspaper stories to guide us, but it is simply the spoken words of the real murderer, especially in the cold-blooded, explosive audio tape that ends the film, that demonstrate not only his guilt but his psychopathic personality. And it is the spoken words of the defense attorneys, the rather substantial Edith James and the withdrawing Dennis White, and the wrongfully convicted Randall Adams that demonstrate the corrupt and incompetent methods used by the Dallas Country justice system to bring about this false conviction. Particularly chilling were the words of Judge Don Metcalfe, waxing teary-eyed, as he recalls listening to the prosecutor's summation about how society is made safe by that \"thin blue line\" of cops who give their lives to protect us from criminals. The chilling part is that while he is indulging his emotions he is allowing the cop killer to go free and helping to convict an innocent man. Almost as chilling in its revelation of just how perverted and corrupt the system has become, was the report of how a paid psychologist, as a means of justifying the death penalty, \"interviewed\" innocent Randall Adams for fifteen minutes and found him to be a danger to society, a blood-thirsty killer who would kill again. This film will get your dander up. How the cops were so blind as to not see that 16-year-old David Harris was a dangerous, remorseless psychopath from the very beginning is beyond belief. He even took a delight in bragging about his crime. As Morris suggests, it was their desire to revenge the cop killing with the death penalty that blinded them to the obvious. They would rather fry an innocent man than convict the real murderer, who because of his age was not subject to the death penalty under Texas law. When an innocent man is wrongly convicted of a murder three things happen that are disastrous: One, an innocent man is in jail or even executed. Two, the real guilty party is free to kill again. And, three, the justice system is perverted. This last consequence is perhaps the worst. When people see their police, their courts, their judges condemning the innocent and letting the guilty walk free, they lose faith in the system and they begin to identify with those outside the system. They no longer trust the cops or the courts. The people become estranged from the system and the system becomes estranged from the people. This is the beginning of the breakdown of society. The Dallas cops and prosecutors and the stupid judge (David Metcalfe), who should have seen through the travesty, are to be blamed for the fact that David Harris, after he testified for the prosecution and was set free, did indeed kill again, as well as commit a number of other crimes of violence. The beautiful thing about this film is, over and above the brilliance of its artistic construction, is that its message was so clear and so powerful that it led to the freeing of the innocent Randall Adams. Although the psychopathic David Harris, to my knowledge, was never tried for the crime he committed, he is in prison for other crimes and, it is hoped, will be there for the rest of his life. Errol Morris and the other people who made this fine film can pride in these facts and in knowing that they did a job that the Dallas criminal justice system was unable to do. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "The last few years have been a golden age for documentaries. For better or worse, Michael Moore and his undeniable ability for manipulating the cinematic medium have brought this endangered genre into theaters and living rooms across the country. Most of today's casual moviegoers are relatively new to the non-fiction feature. In the case of director Errol Morris' The Thin Blue Line (1988), one film not only managed to free an innocent man from a lifetime in prison, but it also elicited a confession from the guilty party. After collecting dust on video shelves for over fifteen years, this groundbreaking documentary has finally arrived on DVD. Unless you're a devout cinephile or a video store clerk, you have probably never heard much about Errol Morris. As a member of the former category, I've been a fan of his since first renting The Thin Blue Line more than a decade ago. As I popped in that dusty VHS cassette and sat back, I relished what many critics and documentary purists had been hotly debating: Morris was taking the genre to exciting new places, whether people liked it or not. As with all successful movies, a good doc needs a good story. In 1976, Dallas County police officer Robert Wood and his partner were patrolling their district late one night. The two pulled a blue car over to the side of the road, most likely to warn the driver of a busted taillight. Moments later Officer Wood was lying on the ground, fatally wounded by a series of gunshots. His partner quickly ran to his aid, but was unable to accurately retain and recall certain information about the killer's vehicle. Was it a Vega or a Comet? Did the driver have bushy hair or a fur-lined collar? These and many other questions emerged during the rushed investigation to bring the mysterious cop-killer to justice. The film itself opens more than ten years after the murder took place. Randall Adams, an oddly charismatic good ol' boy sits before the camera, revealing what happened that unfortunate evening in late 1976. He admits to having shared a ride with a young kid named David Harris. The two apparently attended a drive-in double feature, where they both drank beer and smoked marijuana. Shortly thereafter, Adams claims to have been dropped off at his motel for the evening. Meanwhile, Morris shows us the aforementioned David Harris, now in his mid-20s, talking cryptically about that night's events. This real-life Rashomon confronts viewers with several versions of \"the truth.\" It's unclear whether Morris instinctively knew the truth was still out there when he decided to pursue this project, but his previous experience as a private investigator seems to have paid off as we witness his off- camera interrogation of these two men. Adams, responsible or not, was determined guilty by the courts and sentenced to death. Despite having a police record as long as his shadow, David Harris became the primary witness against Adams in the case. His testimony alone might not have hung Adams, but at the last minute a trio of eyewitnesses to the crime emerged to corroborate his story. In the world of Errol Morris, people are a truly strange lot, and his greatest technique is to simply let his subjects talk and talk until their inherent weirdness becomes painfully evident. Such is the case with the three last-minute witnesses in the Adams case. The more we hear them speak, the greater that uneasy feeling in our stomach and chest becomes. We are bearing witness to a catastrophic miscarriage of justice. Morris employs a bottomless bag of tricks in this landmark film. While much of the film does rely on the presence of talking heads, he adds other elements to the mix, such as old movie footage, a haunting score by renowned composer Philip Glass, and the granddaddy of documentary no-no's: dramatic re-enactments. The latter tends to be the most challenged aspect of The Thin Blue Line, but Morris uses it fairly and wisely. He tells this twisted tale in ways few people could. A shot of a swaying timepiece or a concession stand popcorn machine suddenly amount to much more than what we're simply seeing on the screen. All of these pieces are being put together, little by little, in the hopes that by the end we will see the bigger picture. When this movie was released in 1988, it was marketed as a non-fiction film, because the word \"documentary\" was thought to scare off ticket-buyers. The studio's attempts to pass it off as a murder mystery failed, but the movie made a minor splash once it hit video. It picked up plenty of awards from festivals and critics groups, but the Oscars didn't even bother nominating it. In fact, the Academy didn't so much as nod in Morris' direction until early 2004, when they nominated The Fog of War, his powerful, relevant look at former U.S. Secretary of Defense, Robert McNamara. That film and Morris' two previous masterpieces, Mr. Death and Fast, Cheap & Out of Control have been available on DVD for some time. His first three films, Gates of Heaven, Vernon, Florida, and The Thin Blue Line, were recently made available either individually or in a 3-disc box set. All six of these films are unique, intriguing portals into Mr. Morris' strange universe, which is not so distant from our own. If it's dramatic situations, reality TV, or simply a great movie that you want, look no further than The Thin Blue Line. As one of the greatest documentaries of our time, it is all these things and so much more. Rating: A",
         "Along with 1996's Paradise Lost, The Thin Blue Line should be mandatory viewing for those who believe that the criminal justice system eventually convicts only the guilty. It is a stark and shocking look at one man behind bars and the truckloads of evidence that point toward his innocence. Documentarian Errol Morris indirectly argues that, at the very least, this evidence should have presented a \"reasonable doubt\" to the jury, and near the end of the movie, the audience has little choice but to accept his unbelievable findings. And the film ends with a single scene of just a tape recorder and voices that should be recognized as one of the most powerful endings to a movie, ever. A documentary masterpiece.",
         "I grew up in a society that strongly believes in the death penalty - a religion injunction based on the Islamic code of justice. I remember being told a story (don't know if its true) of how the US President visited Saudi Arabia and on the last day of his visit he was treated to some public be-headings. When he questioned the morality of it, his host informed him that the handful of criminals punished represented the entirety of the criminal population for the past one year. The moral being that harsh punishments prevent crimes and caring too much about the aggressor leads to high crime rates. I personally lost faith in the prison system many years ago after reading about the Milgram and Stanford Prison Experiment findings. A harrowing Australian movie, Ghosts of the Civil Dead made me detest the prison system even more. In recent years Abu Ghraib and Guantanamo have left a bad taste in the mouth. So, is the answer really the death penalty and other physical measures that can't be reversed? After seeing The Thin Blue Line I just don't know. This film has really affected me. An innocent hitch-hiker, and from what I saw in the documentary a decent man, is caught at the wrong time in the wrong place - a former sundown town called Vidor, Dallas County. He is implicated in the murder of a cop and is obviously innocent of the crime. The entire legal system of Vidor is bent to prosecute him. The reason: the real killer is a 16-year old and there's no benefit in finding him guilty because he can't be given the death penalty. Randall Adams, in his 20's, can and must be punished because he's a stranger to these small-minded bigots and someone must pay! Shocking that people can think that way. It makes The Ox-Bow Incident and issues it raised 70 years ago valid even today. This was no more than a judicial lynching. Fortunately, in this case Randall Adams' case was reopened and he was acquitted and released, in large measure due to this documentary and the scandal it caused. The story is exceedingly well told and the end with the tape recorded last interview with David Harris is chilling. I can't say that after watching this I still have a clear opinion of what punishment should fit a crime, but it has certainly made me question the validity of the mentality present in so many Muslim countries. Who is to say there can be no similar travesty of justice there?",
         "I can imagine a lot of people sort of nodding off at the idea of a \"documentary.\" High schools show too many, on subjects like the life cycle of the loggerhead turtle. I see people snoozing at the thought of yet another educational non-fiction film. Well, I guess there was a period when they carried a bit more chic than in recent years. Flaherty made some money. And Mondo Cane, of course, if that was a documentary. But the whole field seems to have been revolutionized lately by Ken Burns and Errol Morris, the former with \"The Civil War\" series on PBS and the latter with this film. Morris had made an earlier movie, mostly about an animal cemetery, but the subject seems to have had limited popular appeal. \"The Thin Blue Line\" however is about the shooting death of a police officer and the subsequent conviction, imprisonment, and death sentence of an innocent man. The movie really IS innovative. There is no narration, for one thing. For another, the talking heads we see aren't labeled at the bottom of the screen -- \"Chester Smith, Accountant at Robbin, Cheatham, and Frisk Law Firm.\" Instead, Morris shows us close ups of newspaper clippings and other printed materials which just happen to mention the name of the person we are about to be introduced to. It's a small thing, true, but I can't recall the device's ever having been used before. It's unobtrusive and effective. (That's the sort of thing I mean when I call this film \"innovative\".) The events are restaged and presented again and again from different points of view, the whole being carefully constructed, like a jigsaw puzzle, but a jigsaw puzzle for children, easy to comprehend. And it's easy to see why Morris latched on to this topic. Not only is it interesting per se, an investigation into the justice system in Texas, in which almost all the authority figures seem intent on extinguishing forfeited lives, but the actual performers we see on screen are remarkably at ease in the presence of the camera. They smile conspiratorially, practically winking at the camera. They look dramatically towards heaven and say things like, \"It's crazy.\" But all in a pleasant Texas drawl. Nobody gets excited. Nobody breaks down and sobs. (There's innovation for you!) Nobody get angry and shouts at the camera. It's all very smooth. But although the performances are good, they are still performances. No one seems to admit having made a mistake. Everyone enters his house justified. Randall Adams, the innocent guy who was railroaded into the slams because he was 28 years old and could therefore be given the death penalty, has been in jail long enough to know what he's about when he presents his case. He has a practiced, wounded appearance and manner, although he describes his experiences as if they happened to somebody else. You pick up things in jail, along with the tattoos. David Harris, the actual perp, smiles and shrugs disarmingly, and he keeps saying \"I guess\" and \"whatever.\" As cool as an ice cube in Sweetwater. He is, in fact, a textbook-perfect example of what used to be called a psychopath. He's pleasant looking, charming, and utterly without any conscience. In some ways the most interesting character is the spaced-out blonde who claims to have eyewitnessed the killing and identifies Adams as the murderer in court. She's the most interesting because her motives are the most obscure. Everyone else's goals are clear. Adams wants to save his neck. The prosecutor wants another conviction. But this babe is really something. She's constructed an old TV detective program with herself as the central figure. Two additional points. One is that the psychiatrist known as \"Doctor Death\" spent only 15 minutes with Adams in prison before testifying that Adams was an incurable murderer. I'm laughing as I write this. Anyway, Dr. Death gave Adams two tests. The first, which Adams describes as a lot of circles and squiggly lines, is the Bender Gestalt Test which was originally designed to measure brain damage. In the second part of the examination, Adams is asked to explain the meaning of a couple of adages. \"A rolling stone gathers no moss,\" for example. It used to be thought that schizophrenics were given to \"concrete thinking\" and that they had trouble reasoning abstractly enough to interpret these old sayings. It's not used anymore. One thing always bothered me about it anyway. One of the items is \"A new broom sweeps clean\", and I could never figure out EXACTLY what that was supposed to mean. The second point is that Adams was given a new trial and released after this film was shown. In other words, Errol Morris saved Randall Adam's life, which would otherwise have been spent in prison. So what does Adams do after he's out of prison? He sues Errol Morris for having taken advantage of him! In TV interviews explaining his suit, Adams uses exactly the same bewildered expressions and gestures of helplessness that he does in this film. At least those eleven years weren't a complete waste of time because he obviously learned something, or whatever.",
         "Randall Adams was a drifter who was picked up by runaway teenager David Harris when he ran out of petrol. The two men hang out for a while, drank some beer, went to the movies, smoked some weed. At this point Adams says he went his own way to his motel with his brother, watched TV and went to sleep. Alternatively, Harris says the two men stayed together were stopped by the police when Adams took out a gun and opened fire on a police officer before driving off. This film follows the court case which charged Adams for the murder of a police officer, with the underage Harris (who was ineligible for the death penalty) as one of the main witnesses against him. I do enjoy a Perry Mason film because, after a solid hour of red herrings and question-marks, it always come down to the big reveal with Mason demanding \"isn't it true? ISN'T IT?\" as everyone gasps, the guilty confesses on the stand and justice is done. Sadly this is not a documentary but a basic TVM series and what the Thin Blue Line does so effectively is to get passed all our ideas of how justice works from films and presents a near-unquestionable miscarriage of justice. At no point does the \"guilty\" person get totally exposed (although the suggestion is very clearly there as to who it was) but instead Morris goes after the idea of reasonable doubt (which, if there is any, then the charged should not have been convicted). Starting at the very start of the fateful evening, Morris uses interviews and some reconstructions to tell the story of what happened from various points of view \u0096 initially with a focus very much on the events as the courts saw it. From here he then uses these same contributions to inject a huge amount of doubt into the vast majority of the case for the prosecution. If you want to find it, there are things in here that could be taken as anti-death penalty but for me the film is pro-justice as opposed to anti-anything as it is essentially reinforcing the importance of reasonable doubt. By virtue of doing this, everyone involved looks bad and Morris wisely doesn't need to pick on anybody in particular directly. It is fascinating as a film but I can understand the occasional claim of it being \"dull\" \u0096 I cannot agree with it but I can understand because, in a world where excess is the norm (style, action, violence, opinion) anything that is actually restrained and even handed could be taken as \"dull\". This modern moaning aside though, The Thin Blue Line is a well made film that simply and matter-of-factly condemns the justice system as it applied to Randall Adams. One of Morris' best films and worth seeking out.",
         "And thus, Dallas County, Texas, in 1977, successfully prosecuted Randall Dale Adams, a lowly hitchhiker, for a crime Adams did not commit. Adams was convicted and sentenced to death for the 1976 murder of a Dallas cop. \"The Thin Blue Line\", by Errol Morris, is a documentary that recounts this infamous case, by way of interviews and reenactments. It's the story of a terrible injustice, one that almost cost an innocent man his life. What is so frightening is the fervor of Dallas officials to inflict the death penalty on someone ... anyone ... They weren't about to let the cop murder go unpunished. Adams was the most convenient target. Eventually, the truth would come out. But Adams would spend twelve years in prison, some of those years on death row. After his release, Adams never received any monetary compensation, or even an apology, from the State Of Texas, for that injustice. Interestingly, more than one Dallas County official associated with the Adams case was also associated with the aftermath of the JFK assassination, thirteen years earlier. Morris' documentary would have been easier to follow had it had subtitles, to indicate the name of the person being interviewed. Also, some of the film's material consisted of irrelevant flashback footage and repetitive reenactments. Further, the narrative presentation was at times confusing. Nevertheless, the main issue here is the powerful true-life story. If you can get around the technical weaknesses of this film, \"The Thin Blue Line\" is a gripping documentary about a real life case of American injustice, in a city that is notorious for its history of botched criminal investigations.",
         "I first saw this film not longer after its initial release some 20 years ago and images and scenes from it have stayed with me ever since, so that it was with considerable anticipation that I re-watched it again recently. Down the years I can still recall Randall Adams drawling in his unforgettable voice \"The kid scares me\", the ever-revolving red light on the cop-car and most of all Philip Glass' wonderful, hypnotic music. The depiction of the fateful night of the cold-blooded murder of the policeman is shown from, almost literally, every possible angle, conveyed in a highly stylised way with almost every speculated remembrance of the doubtful list of every dubious (and are they ever dubious!) witness played out on the screen, the effect, in so doing, to completely explode their fantasist recollections, as was no doubt the director's aim. The reconstructions are set alongside filmed interviews of most of the main protagonists (with the main exception of the second cop in the car who witnessed the killing). As you watch these, the centrepiece clearly becomes the contrasting testimony of the almost-certain murderer David Harris with the wronged Randall Adams, the first coming across from the start as duplicitous and uncaring, the latter as bemused but reasoning. I was particularly taken with the eruditeness of Adams, who suppresses his inner rage with admirable restraint as he points the viewer time and again back to the evidence. As an indictment of the American criminal justice system, it hits home hard; it appears that investigation standards head for the hills especially when the law has a cop-killer to nail. Thankfully the miscarriage of justice was eventually resolved although it makes you grateful for the coincidence which led director Morris to change the subject course of his original project to instead highlight Adams' case culminating in his release soon after the film was first shown. The film however is more than a crusading documentary and there is much for students and admirers of the film-makers art to enjoy. Unforgettable, really, almost haunting, and proof if needed that truth really is stranger than fiction.",
         "Regarding the issue of manipulation, lets face it people, all documentaries are manipulative - every documentary filmmaker is attempting to make a point, whether or not they care to admit it. It is the documentaries that give the impression of being \"objective\" that are, in fact, the most manipulative. In the case of \"The Thin Blue Line\" the purpose of the documentary is clear, and the viewer is not tricked into believing that they are watching something objective. Instead, it is quite upfront about its purpose, and therefore is a much more honest piece of work. People should never accept anything they see in a documentary as fact, it's important to understand that documentaries are simply an attempt to present the director's perspective of a real-life situation. It is the great documentaries that present their perspective in a convincing manner, and do so without boring the viewer to sleep. Here \"The Thin Blue Line\" succeeds very well: it is powerful, it is engaging, and it's extremely convincing. Does that mean that everyone should be convinced? Lets hope not. However, it certainly should give everyone something to think about. The only real problem with the film is its over-use of re-enactments where they are not really that necessary. For example, there is an image of a clock, representing the futility of time, which is too long for its own good. The milkshake scene was also (intentionally)annoying. However, this is a minor problem, and not one that should bother most people. Overall: great film, and highly recommended.",
         "Having seen two other Errol Morris documentaries, I expected that there would be a Philip Glass soundtrack, some flashy camera work, and perhaps some reenactments during 'The Thin Blue Line'. I have long struggled with my opinions on Morris' work, mainly because I am more of a purist when it comes to documentaries. I want to see footage, photographs, interviews, etc. that are going to back up a strong story, not a lot of camera angles, stark white backgrounds, and a post-modernist score. 'The Thin Blue Line' had the latter presentation, so I immediately was slightly turned off \u0096 until the subject of the film was presented. The location is Dallas, and it is the 1970's. Late one night, a squad car pulls over a car that does not have its lights on, but as soon as the policeman reaches the driver's side door, he is shot several times and murdered. The car pulls away before the policeman's partner is able to ascertain the license plate number or even the exact make and model of the vehicle. What follows is a veritable witch hunt for the killer (or killers) that ends with one man in jail who is professing his innocence, and another man, a career criminal who gets away veritably scot-free. Through various interviews with the players involved; detectives, alleged eye-witnesses, the accused themselves, Morris seeks to find out the truth in a case that comes down to a 'he-said/he-said' situation. 'The Thin Blue Line' is expert film-making in the investigative sense. Morris does his job in presenting as many facts as possible. The case finally came to a head a couple of years after the film was finished, but it is documented as being instrumental in the reexamination of the facts. I still don't necessarily care for Morris' style, but it cannot be argued that 'The Thin Blue Line' is an excellent documentary, and that he definitely has an eye for picking very compelling subjects. --Shelly"
      ],
      "genres": [
         "Documentary",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "American Playhouse",
         "Channel 4 Television Corporation",
         "Third Floor Productions"
      ],
      "summaries": [
         "Errol Morris's unique documentary dramatically re-enacts the crime scene and investigation of a police officer's murder in Dallas, Texas. Briefly, a drifter (Randall Adams) ran out of gas and was picked up by a 16-year-old runaway (David Harris). Later that night, they drank some beer, smoked some marijuana, and went to the movies. Then, their stories diverged. Adams claimed that he left for his motel, where he was staying with his brother, and went to sleep. Harris, however, said that they were stopped by police late that night, and Adams suddenly shot the officer approaching their car. The film shows the audience the evidence gathered by the police, who were under extreme pressure to clear the case. It strongly makes a point that the circumstantial evidence was very flimsy. In fact, it becomes apparent that Harris was a much more likely suspect and was in the middle of a crime spree, eventually ending up on Death Row himself for the later commission of other crimes. Morris implies that the DA's and the judge's desire for the death penalty in this case (for which Harris would have been ineligible because of his youth) made Adams a scapegoat on whom to pin this heinous crime.",
         "A film that successfully argued that a man was wrongly convicted for murder by a corrupt justice system in Dallas County, Texas."
      ],
      "budget": 0
   },
   "movielensId": 1189,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-08-28",
      "dvdReleaseDate": "2005-07-26",
      "directors": ["Errol Morris"],
      "runtime": 103,
      "movieId": 1189,
      "title": "The Thin Blue Line",
      "mpaa": "",
      "actors": [
         "Randall Adams",
         "David Harris",
         "Gus Rose",
         "Jackie Johnson"
      ],
      "imdbMovieId": "0096257",
      "originalTitle": "The Thin Blue Line",
      "genres": [
         "Crime",
         "Documentary",
         "Mystery"
      ],
      "youtubeTrailerIds": ["CTDvQ_3VaG0"],
      "plotSummary": "Errol Morris's unique documentary dramatically re-enacts the crime scene and investigation of a police officer's murder in Dallas.",
      "tmdbMovieId": 14285,
      "avgRating": 4.09163,
      "releaseYear": "1988",
      "numRatings": 3012,
      "posterPath": "/xFN3xPDzN4O7oIBmxnLIh8VROIw.jpg"
   }
}