{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "eroticism",
            "id": 1664
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "pop star",
            "id": 3490
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "tour",
            "id": 5287
         },
         {
            "name": "concert",
            "id": 6029
         },
         {
            "name": "madonna",
            "id": 34264
         }
      ],
      "imdb_id": "tt0102370",
      "video": false,
      "title": "Madonna: Truth or Dare",
      "recommendations": [
         40496,
         25930,
         55644,
         24073,
         81619,
         86955,
         40495,
         202807,
         15850,
         53424,
         14922,
         27458,
         58048,
         22125,
         77332,
         67595,
         2078,
         41487,
         47059,
         49633
      ],
      "backdrop_path": "/hs8YZMTycZeozxYMeiprPbkkAZu.jpg",
      "revenue": 29,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "herself",
               "gender": 1,
               "credit_id": "52fe433b9251416c750087b7",
               "name": "Madonna",
               "profile_path": "/7KMAZvh8LehYpRdDuUdaUA7tevs.jpg",
               "id": 3125,
               "order": 0
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5971239b9251415e86024ef5",
               "name": "Al Pacino",
               "profile_path": "/f9tBVwcNHnawvMoyuuzmKvEhBsb.jpg",
               "id": 1158,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 2,
               "credit_id": "57448cdb925141218f000652",
               "name": "Kevin Costner",
               "profile_path": "/ePo87kGyyY8JZ3z7Zm7Z2GYdmJ8.jpg",
               "id": 1269,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "57449c1ac3a368586700003c",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe433b9251416c750087ab",
               "name": "Donna DeLory",
               "profile_path": "/kY9E6wlSgc3FD0DumFH3zxqPZAU.jpg",
               "id": 116152,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "57448ccc92514120a70006cb",
               "name": "Warren Beatty",
               "profile_path": "/1fsYRe1WhIohbfk8qHmjMcuCXeJ.jpg",
               "id": 6449,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "herself",
               "gender": 0,
               "credit_id": "52fe433b9251416c750087af",
               "name": "Niki Harris",
               "profile_path": null,
               "id": 116153,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "himself",
               "gender": 0,
               "credit_id": "52fe433b9251416c750087b3",
               "name": "Luis Camacho",
               "profile_path": null,
               "id": 116154,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe433b9251416c75008777",
               "name": "Tim Clawson",
               "profile_path": null,
               "id": 64074,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe433b9251416c7500877d",
               "name": "Madonna",
               "profile_path": "/7KMAZvh8LehYpRdDuUdaUA7tevs.jpg",
               "id": 3125,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe433b9251416c75008783",
               "name": "Jay Roewe",
               "profile_path": null,
               "id": 64075,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe433b9251416c75008789",
               "name": "Barry Alexander Brown",
               "profile_path": null,
               "id": 5289,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe433b9251416c7500878f",
               "name": "Christophe Lanzenberg",
               "profile_path": null,
               "id": 64076,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe433b9251416c75008795",
               "name": "Madonna",
               "profile_path": "/7KMAZvh8LehYpRdDuUdaUA7tevs.jpg",
               "id": 3125,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe433b9251416c7500879b",
               "name": "Robert Leacock",
               "profile_path": null,
               "id": 64077,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe433b9251416c750087a1",
               "name": "Alek Keshishian",
               "profile_path": "/wV8qWeyKEkGDiW6RoysQmEoqU8h.jpg",
               "id": 50949,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe433b9251416c750087a7",
               "name": "Mark Aldo Miceli",
               "profile_path": null,
               "id": 64073,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 2.282665,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10174,
      "vote_count": 40,
      "budget": 4,
      "overview": "From the rain of Japan, through threats of arrest for 'public indecency' in Canada, and a birthday tribute to her father in Detroit, this documentary follows Madonna on her 1990 'Blond Ambition' concert tour. Filmed in black and white, with the concert pieces in glittering MTV color, it is an intimate look at the work of the music performer, from a prayer circle with the dancers before each performance to bed games with the dance troupe afterwards.",
      "similar": [
         20575,
         6477,
         17356,
         786,
         525,
         27962,
         21804,
         6575,
         22097,
         12545,
         824,
         630,
         10545,
         18947,
         342473,
         313369,
         3902,
         2005,
         10947,
         68817
      ],
      "original_title": "Madonna: Truth or Dare",
      "runtime": 119,
      "poster_path": "/gGl1TvzDzrfA5HhRQwvwzW55CXv.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Artisan Entertainment",
            "id": 2188,
            "origin_country": ""
         }
      ],
      "release_date": "1991-05-10",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.madonna.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Alek Keshishian"],
      "runtime": 120,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102370/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0NTI4Mjc1MF5BMl5BanBnXkFtZTcwMDMwOTAwMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Madonna, Donna DeLory, Niki Harris | See full cast and crew »"],
      "reviews": [
         "I came away from \"Truth Or Dare\" feeling the way I do when someone cuts me off in traffic and then gives me the finger. On the surface, it's a competent documentary, well-edited and interestingly photographed (even the grainy backstage footage). On the other hand, the film is like having obnoxious personalities thrust at you with every turn. It wants to be a \"controversial\", no-holds-barred record of Madonna's large-scale Blonde Ambition concert tour. At the center of this carnival of hard-working but uninspired nincompoops is Madonna herself. Madonna certainly fancies herself the queen bitch, but also wants to show us that she's got a sensitive side too (like when she lies on her mother's grave in front of the camera). I had to laugh when I read other reviews that ascertained how this film shows us that Madonna is \"just another human being\". What did we think she was? An alien? A ghost? I enjoyed watching the weirdness involving Warren Beatty. Some of it is curious too, such as when the only heterosexual dancer in Madonna's troupe tries to express the fact that he doesn't like the gay guys he is working with. His words portray him as ignorant, but about his co-dancers he is right on the mark--they are irritating in the same way a nest full of twittering birds outside the bedroom window at 4am would be. The one thing that fascinates me about \"Truth Or Dare\" is that Madonna herself had control over this film, yet she comes off as a self-obsessed clod. She's like a real-life version of the Faye Dunaway character from \"Network\", interested only in success and having no depth of her own. So either she herself didn't realize how shallow it makes her look, or she knew her fans wouldn't notice it--or even stranger, perhaps they idolize her for being so self-centered and detached. Madonna has always put on airs about herself (like the faux British accent she speaks with these days), but here you can see her stumbling over her various phony images and fronts, like in her decidedly inarticulate prayer before the show that she dedicates to Keith Haring (\"...who doesn't have the luxury of being alive like we do...\"). The \"religious\" Madonna chokes on her words and seems flustered that the camera is still rolling, then reacts with a self-conscious aside. Wow, look--Madonna is sensitive! In fact she's so sensitive that her first reaction when she hears that one of her makeup staff was given a date-rape drug and sodomized is a giggle, albeit a nervous one. Then there's the infamous scene where she totally misses Kevin Costner's sense of humor and mocks him behind his back. Gad, she's so wickedly funny, isn't she? We also learn that Madonna is loyal, like when she excitedly waits to reconnect with a childhood friend, then disregards the woman when she says she'd like to name her unborn baby after Madonna. The movie also posits that Madonna is an \"artist\" and that her music is her \"art\". It's hilarious to watch Madonna and her brother, Christopher, defending the more 'risque' parts of the calculated stage show by calling it a \"journey...you have to go through all the different parts to get to the end.\" See? They HAD to do the masturbation scene. This kind of self-important stuff seems to be norm for those working with Madonna. She certainly didn't invent this kind of elaborate stage show, but you'd never know it from the way the show is discussed in this movie. Elaborate concerts like this were going on decades before Madonna, and certainly with more substantial artists involved--Pink Floyd comes to mind. Although Madonna's show is opulently staged, it ultimately has little to do with live musicianship. Although there are musicians involved, Madonna is not one of them herself, and the focus of the show is entirely on her and her sets. Yet it doesn't seem to work as theater either, since the \"journey\" it is purportedly representing is vague, at best. I can understand how Madonna managed to sell millions of records (even people less talented than Madonna have done so), but I have never understood how she has inspired long-lasting devotion in some people who seem to find greatness in her, and \"Truth or Dare\" doesn't give much insight to this. In fact, she seems to have succeeded almost in spite of her bitchy attitude and her tendency to either alienate or disregard those who have befriended her or worked with her. Her music is sometimes enjoyable, often unremarkable, and she seems to want to paint herself as an individual who is relentlessly driven to succeed and gets everything she wants, at any cost--as if ruthless ambition were something to aspire to. While it may be true that Madonna is ambitious, \"Truth or Dare\" seems to overlook the fact that Madonna is also very clearly a product of a corporate entity, a mediocre recording artist who was so heavily promoted by both herself and her record label that she was bound to catch on. At one point Madonna makes much of her so-called \"talent\" for pushing peoples buttons (as if being shocking or titillating is difficult), and this may have been one of the ways she made her money, but you can bet that a bunch of guys in suits and ties have made a lot more money off of her. Her willingness to do anything to succeed probably looked pretty good to Warner Brothers records, so they lavished her with money and promotion and let her take off like an obnoxious little kid racing a bike down a hill. The thing that \"Truth or Dare\" taught me about Madonna is that she was the little kid who probably pushed all the other kids off their bikes so she would get to the bottom of the hill first. Blonde Ambition, indeed.",
         "I watched this movie for the first time in 2009, almost twenty years after its release and this proves I am not a big Madonna fan. In fact, I never particularly liked or disliked her. I thought she was \"cool\" in \"Desperately seeking Susan\", but that was the \"Into the Groove\" time, when she had just started her rise. The \"Blonde Ambition\" tour was probably the top of Madonna's career, and this would-be documentary shows her at her most unbearable. Somebody mentioned that it shines a light on her \"human\" side (as if she was some sort of alien), but in truth she comes across as a controlling, pretentious bitch who goes out of her way to humiliate and annoy people. Hardly the best human side one can show. Even the visit to her mother's grave is disgustingly theatrical. Instead of making you feel sorry for the child of five who lost her mum it makes you feel sorry for the spoiled brat she became. Of course we all know that Madonna built her career on sex and the Catholic religion and by now I doubt anybody would be shocked by her swinging crucifix or her masturbation. However, tasteful it was not... and still isn't. The part filmed on stage is disappointing because some of songs performed are just not good, no matter how much sex is thrown in to spice them. The \"documentary\" part is embarrassing to watch. It was interesting for me to see that Madonna had a crush on Antonio Banderas, but at the time he was married with a pretty Spanish lady (who looked a lot better both of Madonna and Melanie Griffith). Warren Beatty makes the only decent comment about the whole filming, but he is also brushed off and humiliated, not to mention the poor Costner. I am not a Costner fan either, but his comment sounded rather sarcastic to me (\"Neat\" applied to the overbearing and vulgar show sounds like a sarcastic way to say \"It sucked\"), but looks like Madonna did not get the joke. She definitely takes herself very seriously when she describes herself as an \"artist\" who will not change anything in her show, even if she risks to get arrested for \"indecent exposure\" or any such like - very unlikely - charge. Finally, when she talks to her father she is so arrogant and dismissive that I felt sorry for the poor guy. She even uses the word \"chatartic\" with the intent of confuse her father; but looks like she herself had no clue as to what that word means. Madonna was an icon of the 80's and early 90's and possibly a decent singer, but for sure she was never a great actress and definitely not somebody with any sense of humor.",
         "Nothing surprising is revealed in this documentary. Perhaps ten years ago, when the film came out, it stunned many fans and non-fans. But Madonna has remained in the spotlight ever since, and thanks to magazines, interviews, MTV, VH-1, not to mention her music, video, book and film work since 1991, we've seen most of the stuff in this documentary already. Plus, Madonna shows us only what she wants us to see. There are a few moments when the camera suddenly shuts off, like when she confesses that Sean Penn was the love of her life. She also talks about her huge crush on Antonio Banderas, and when he snubs her, she jokingly admits that she will never work with him (obviously she was kidding because she worked with him in Evita). When she's playful and in good spirits, she's fun to watch. But in the end, this is really a vanity project, instead of the completely \"naked\" documentary it was supposed to be. That probably suits her diehard fans just fine, but regular viewers are hoping to see more than her \"attitude\" backstage, long footage of her explicit onstage material, constant vulgarity, and high-maintenance daily rituals.",
         "As a documentary, this movie is excellent. It takes us behind the scenes of one of the most successful and most elaborate music tours produced in recent times. We take a peek at Madonna's private life including her likes and dislikes, her friends, her hectic schedule, and her incredible ambition of staying at the top. But most importantly, we take a close look at how she influences everyone around her. Madonna fans, especially those that attended the Blond Ambition Tour, will really enjoy Truth or Dare.",
         "As a simple concert video, this one is above average. But the title is very misleading. First let's deal with the 'truth' aspect. Madonna's friends pop in on her - Warren Beatty, Sandra Bernhart - but you get little in the way of glimpses into her relationships with others. You see Madonna playing Mother Hen to her backup performers, but you get the sense that she isn't very close to any of them. Thus, even though this is supposed to be an expose of Madonna's true private life, there is so little of this on screen that the audience is denied a genuine insider's view. And when Madonna deals with the business aspects of her tour, the boardroom door closes on the camera and the audience. This aspect of the life of a performer so well known for her product-image management might potentially be the most fascinating part of the tour, but the audience is kept outside. And compared to some of what Madonna has done on the screen, this is so far below her usual standards of shock as to hardly qualify as 'daring'. It is worth a watch, but beware of a stretching of the 'truth' when it comes to packaging.",
         "Madonna is the coach that everyone wishes they could break down and talk to on the same level. Sure, nobody knows who exactly Madonna is. This is what makes her so brilliant. It is obvious she was hamming it up and portraying a \"character\" which she wanted everyone to see. If Madonna didn't act like a \"bitch\" she wouldn't be where she is today.",
         "I guess you could say that whoever saw this probably knows now what it's like to be the most famous woman in the world (or at least one of them). Madonna is being Madonna, just living her life and having fun. And in some ways, \"Truth or Dare\" revealed who the real Madonna is. She's funny, she's daring, she's odd, she's fun, and in her own way, sensitive. She's also one of the greatest entertainers of the 20th century, and she's very brilliant. After all, she has been doing what she does best for a long time without losing her creative touch! As a result to the Blonde Ambition Tour which is what this documentary is about, in my opinion, it's not theatrical, but it's exciting and it's fun. Madonna really can WOW her audience and spellbind them with every dance step (and let's not forget that \"Like A Virgin\" performance) I thought her Girlie Show tour was more theatrical. Yet what I liked the most about this movie is not the fact that you're actually experiencing Madonna's zone of privacy, but you're actually seeing the REAL Madonna! I think this was one of the smartest things she has ever done in her career despite all those nasty comments people say of her, calling her a slut which is wrong and which she isn't. I recommend \"Truth or Dare\" to all music fans, especially if you're a big Madonna fan!!! :o)",
         "From the very first second that this documentary starts Madonna is full of her own ego. She is very self-centered from the get-go. Watching this documentary I understand why none of her relationships in life last very long. And I mean more than just romantic relationships, she's had a lot of broken friendships. Anyway after 7 minutes of watching it, I decided to skip around to the Warren Beatty parts, I was really curious about him. After his scenes, I skipped towards the end. Yea I skipped around a lot in this documentary because I didn't think it was worth watching the entire hour and 59 minutes. Sure I like some of her music, but her act of using her sexuality is nothing new. Also spoiled divas are nothing new in this world. In the end she's an entertainer and nothing more. I'm not impressed with her quests for spirituality either. I skipped a lot with this documentary, I was really interested in her relationship with Warren Beatty. She's very disrespectful, she calls him up and he's supposed to meet her but there's some misunderstanding and instead of working it out like a woman, she decides to hang up on him. To Madonna people are just expendable, its all just a game to her. I don't think people should take themselves seriously but its like she mistreats people and I don't like that. I get why none of her relationships last and why her marriage probably didn't last. Warren Beatty also tries to talk to Madonna and bring her to reality, he's not mean either, he actually seems like a very nice man, he speaks in a normal voice and tries to reason with her. I can see why it took a long time for Warren Beatty to commit to a woman because with a circus trainwreck like Madonna, even the nicest guy in the world would run. Warren grew up and married Annette Bening and Madonna didn't grow up at all. Not even with kids in her life. She's going to be one of those lonely old people in the end with no one by her side when she really hits her senior years.",
         "The ersatz Madonna 'documentary' offers proof of the Material Girl's genius for self-promotion, pretending to be a candid behind-the-scenes portrait of her Blond Ambition tour when it's really just selling a lot of self-conscious backstage posturing, sandwiched between the expected MTV concert footage. Some fashionably grainy black-and-white photography gives the film a spurious air of raw slice-of-life candor, but the whole thing is one long public relations whitewash, no less calculated than her elaborate stage show and often just about as substantial. At times it seems the only purpose of the film is to reinforce the singer's image as some sort of blue-collar angel/whore, with strong maternal instincts toward her dancing troupe. Nothing else about her is revealed, except for a purely mercenary streak of exhibitionism, hardly front-page news. But there's a peculiar irony in watching Madonna (of all people) try to act natural with a camera lens constantly in her face; the effort to simply be herself can almost be called the best 'performance' of her career.",
         "Between 1987 and 1993, Madonna underwent the most controversial period of her life. This documentary highlights one of the most notorious events right in the midst of that period of controversy: her 1990 \"Blond Ambition\" tour, which spanned four months and took place in Japan, North America, and Europe. The tour was way ahead of its time, featuring innovative music, tour-de-force dance moves, magnificent sets, and dazzling costumes designed by French fashion designer Jean-Paul Gaultier. It turned out to be arguably the best concert ever (certainly Madonna's best concert to date). At the same time, the tour was considered blasphemous for involving the use of religious images and symbols, and it was called racy because of simulated sexual acts that were performed on stage. What's noteworthy about this documentary is that it shows a behind-the-scenes look at, not just the tour, but also Madonna's life during the tour's run. On stage (and backstage) she's a hard and demanding diva. Yet, this film enables viewers to see another side of Madonna, who according to Warren Beatty, doesn't want to live off-camera. You get to see Madonna surrounded by different people: her entourage, her family, and other celebrities...but you also get to see her all by herself in some scenes. In one scene you hear someone compare Madonna to a little girl lost in a storm. One can only wonder if Madonna, who although is the biggest star in the world, could be the loneliest person in the world. I saw this documentary when it played in theaters, back in 1991, and it was great to see it on the big screen. I especially enjoyed seeing the scenes of the actual concert. I now own this film on DVD. This documentary was definitely the perfect medium with which to immortalize the then-controversial, pre-motherhood Madonna at the height of her career."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Boy Toy",
         "Miramax",
         "Propaganda Films"
      ],
      "summaries": [
         "From the rain of Japan, through threats of arrest for 'public indecency' in Canada, and a birthday tribute to her father in Detroit, this documentary follows Madonna on her 1990 'Blond Ambition' concert tour. Filmed in black and white, with the concert pieces in glittering MTV color, it is an intimate look at the work of the music performer, from a prayer circle with the dancers before each performance to bed games with the dance troupe afterwards.",
         "This movie reveals Madonna as she really is, on stage and off - den mother to her family of dancers, sex goddess to her millions of fans, business woman, singer, dancer... the biggest superstar in the world of music. Join her and experience an intimate backstage look at her Blond Ambition tour.",
         "Documentary following singer Madonna on her controversial Blond Ambition tour in 1990."
      ],
      "budget": 4500000
   },
   "movielensId": 1191,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1991-05-10",
      "dvdReleaseDate": "1997-08-26",
      "directors": [
         "Alek Keshishian",
         "Mark Aldo Miceli"
      ],
      "runtime": 119,
      "movieId": 1191,
      "title": "Madonna: Truth or Dare",
      "mpaa": "R",
      "actors": [
         "Madonna",
         "Al Pacino",
         "Kevin Costner",
         "Antonio Banderas",
         "Donna DeLory",
         "Warren Beatty",
         "Niki Harris",
         "Luis Camacho"
      ],
      "imdbMovieId": "0102370",
      "originalTitle": "Madonna: Truth or Dare",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["sisn51wlWaI"],
      "plotSummary": "From the rain of Japan, through threats of arrest for 'public indecency' in Canada, and a birthday tribute to her father in Detroit, this documentary follows Madonna on her 1990 'Blond Ambition' concert tour. Filmed in black and white, with the concert pieces in glittering MTV color, it is an intimate look at the work of the music performer, from a prayer circle with the dancers before each performance to bed games with the dance troupe afterwards.",
      "tmdbMovieId": 10174,
      "avgRating": 2.88786,
      "releaseYear": "1991",
      "numRatings": 1681,
      "posterPath": "/gGl1TvzDzrfA5HhRQwvwzW55CXv.jpg"
   }
}