{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hawaii",
            "id": 1668
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "car",
            "id": 33885
         },
         {
            "name": "solar power",
            "id": 175976
         }
      ],
      "imdb_id": "tt0117427",
      "video": false,
      "title": "Race the Sun",
      "recommendations": [
         53027,
         33657,
         17949,
         24585,
         19575,
         70172,
         45249,
         71456,
         25884,
         20551,
         246011,
         3288,
         24227,
         58631,
         23531,
         16096,
         37020,
         15128,
         46702,
         19760
      ],
      "backdrop_path": "/2Y4RLhqmmiCvSzq10ixCTclJdSG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Miss Sandra Beecher",
               "gender": 1,
               "credit_id": "52fe48ddc3a36847f817d861",
               "name": "Halle Berry",
               "profile_path": "/w7HRZh4UhimZO2F6GywkYhjgAX3.jpg",
               "id": 4587,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Frank Machi",
               "gender": 2,
               "credit_id": "54639899c3a368124d00274d",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Daniel Webster",
               "gender": 2,
               "credit_id": "52fe48ddc3a36847f817d865",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cindy Johnson",
               "gender": 1,
               "credit_id": "52fe48ddc3a36847f817d869",
               "name": "Eliza Dushku",
               "profile_path": "/drQXyoKMVf4IJsCdmnOXpzhBEYL.jpg",
               "id": 13446,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jack Fryman",
               "gender": 2,
               "credit_id": "52fe48ddc3a36847f817d86d",
               "name": "Kevin Tighe",
               "profile_path": "/5Q1Z89xsrnLdQWdHLuiaraS89vV.jpg",
               "id": 17770,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Eduardo Braz",
               "gender": 2,
               "credit_id": "52fe48ddc3a36847f817d871",
               "name": "Anthony Ruivivar",
               "profile_path": "/kyXQAe5bDYGMAhs7keT8apMmAZb.jpg",
               "id": 171522,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Hans Kooiman",
               "gender": 2,
               "credit_id": "52fe48ddc3a36847f817d875",
               "name": "Steve Zahn",
               "profile_path": "/tcRHqtdi4wM8hlZ3MjPDWgePp7L.jpg",
               "id": 18324,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marco Kito",
               "gender": 2,
               "credit_id": "52fe48ddc3a36847f817d879",
               "name": "Dion Basco",
               "profile_path": "/muuEjtH5XueRV5zPdx1pIxrtMkS.jpg",
               "id": 20303,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Gilbert Tutu",
               "gender": 0,
               "credit_id": "52fe48ddc3a36847f817d87d",
               "name": "J. Moki Cho",
               "profile_path": null,
               "id": 239978,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Oni Nagano",
               "gender": 0,
               "credit_id": "52fe48ddc3a36847f817d881",
               "name": "Nadja Pionilla",
               "profile_path": null,
               "id": 239979,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Luana Kanahele",
               "gender": 0,
               "credit_id": "52fe48ddc3a36847f817d885",
               "name": "Adriane Napualani Uganiza",
               "profile_path": null,
               "id": 239980,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Uni Kakamura",
               "gender": 1,
               "credit_id": "52fe48ddc3a36847f817d889",
               "name": "Sara Tanaka",
               "profile_path": null,
               "id": 239981,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Commissioner Hawkes",
               "gender": 2,
               "credit_id": "546398b70e0a2678060028ce",
               "name": "Bill Hunter",
               "profile_path": "/zCWRTbsiCKiHapWm2JRjIUHrpbS.jpg",
               "id": 23,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Steve Fryman",
               "gender": 2,
               "credit_id": "57a7316892514117bf0009c4",
               "name": "Joel Edgerton",
               "profile_path": "/lkOkaMKSRRGLMgkLaCzR9sYgTgx.jpg",
               "id": 33192,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48ddc3a36847f817d857",
               "name": "Charles T. Kanganis",
               "profile_path": null,
               "id": 36147,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48ddc3a36847f817d85d",
               "name": "Barry Morrow",
               "profile_path": "/9woFPvak9RzR0gmexAJR3vjhZz8.jpg",
               "id": 5143,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.105711,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 55731,
      "vote_count": 25,
      "budget": 0,
      "overview": "A bunch of high school misfits in Hawaii, introduced by their new teacher, attend a science fair in which they draw up inspiration to build their own solar car and win a trip to compete in the 1990 World Solar Challenge in Australia.",
      "similar": [
         9555,
         9659,
         8810,
         9355,
         26405,
         52449,
         233063,
         437670,
         2759,
         36040,
         12445,
         34584,
         810,
         817,
         920,
         955,
         222936,
         76341,
         118,
         10830
      ],
      "original_title": "Race the Sun",
      "runtime": 100,
      "poster_path": "/2jPKKhZqbMYszH5z1cL7AZuoBiL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1996-03-22",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A dream can make all the difference under the sun.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles T. Kanganis"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Barry Morrow"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117427/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3NzgzMzgxNF5BMl5BanBnXkFtZTcwNzMyMzUyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Halle Berry, James Belushi, Bill Hunter | See full cast and crew »"],
      "reviews": [
         "For curious movie buffs, \"Race the Sun\" is a blend of \"Breaking Away\", \"Walkabout\", and \"Summer School\"; making it quite unique and considerably better than its rating. It's neither ambitious nor technically brilliant; in fact the cinematography somehow manages to NOT capture the inherent scenic beauty of a series of Hawaiian and Australian locations. But the casting and directing are solid and the story has so much charm that you don't mind it being corny and predictable. Halle Berry and James Belushi play teachers at a Hawaiian technical high school who reluctantly sponsor a team of students building a solar-powered car. \"Race the Sun\" was inspired by a group of Hawaiian students who actually entered the World Solar Challenge in 1980. The film would have been better if the cartoonish corporate villain had been replaced by some actual scientific explanations and a bit of background on the race itself. Speaking of cartoons, the solar cars look like something out of \"Wacky Races\" but there is no sign of Penelope Pitstop in this entertaining race. The school is in Hawaii, which makes for some interesting cultural details (as does the race's Austrialian setting), but for viewer identification purposes the settings could be anywhere. Thankfully the film avoids a couple of obvious traps. Berry and Belushi end up liking and respecting each other but there are no obligatory romantic sparks between them. Likewise for Casey Affleck and Elisha Dushku-who plays his step-sister. Then again, what do I know? I'm only a child.",
         "I only watched this cause I noticed Halle Berry in it. However it was a \"nice \" film, with a \"nice\" story and a \"nice\" moral....it's just so nice! It's not great and it's all been done before but it's reasonably enjoyable while it's on. You'll forget it after an hour though",
         "The theme for this movie is as old as the sun itself, but that does not prevent the viewer from caring about the outcome. The movie is harmless (think \"Rocky\" on wheels) and has a great cast, all of whom give it their all. I wouldn't run out and buy a copy but you get to see some great young actors and some nice Australian scenery.",
         "Would have liked it better without the added predictable formula add-ins. Loosely based on the Konawaena high school team. In 1989, the High School formed a team of students, faculty and community advisers. Using a grant from the State of Hawaii, the team built a final vehicle that won a three and a half day state race against five other schools. As a result of the victory, the State of Hawaii funded the team for the 1990 World Solar Challenge, a 2000 mile race from Darwin to Adelaide, Australia. The team placed 18th overall winning the World Champion high school division. The first high school to officially finish the World Solar Challenge. I give it a 5 only because they added enough non-factual elements to make many viewers unaware of the true story behind it.",
         "The funnest line in the movie I think is when Steve Zahn says There is a God, then... Well to me it's not really predictable and many times I thought that's yes something new happens, so it never ran out of surprise. I had fun watching it. And my, Gilbert's character is such a whooly-wooly.(meaning, herlarious)",
         "When I first saw the film I found it to be interesting, especially since it is set on a famous race. Story isn't bad, a bit of fun as an Australian seeing Americans deal with the conditions here (\"What's a Willy Willy?\"\"I don't know\"), kind of a fish out of water situation. My only bone of contention is the settings for filming. I am disappointed as a former South Australian, that they didn't use the proper locations of Alice Springs and Adelaide, instead using Broken Hill and Sydney respectively, and I also have a feeling they used Sydney International for the Darwin airport. Also, another inaccuracy, the race is actually run along the Stuart Highway, which is sealed for its entire length",
         "when this movie was being filmed on the streets of my Town, Broken Hill. i believe it's the scene where the main kid is offered a bribe and hes sitting under a statue. This movie was a Big Thing and when released they played it for about two and a half months....i seriously thought it was an awesome movie. and saw it three times. but now looking back i realised that it is just a regular story of the lowest rising up to the top. so its regular stuff yet pretty entertaining. mainly cause i knew what \"Road Trains\" meant. all in all it was an entertaining film. Halle Berry did very well, yet it was just a money spender all the same",
         "I saw this movie some time ago and it has stuck with me. Even though it was fictional, it was a heartwarming story. It just goes to show you what can happen when people pull together, even though you are from different heritages and backgrounds. I would recommend this to everyone, young or old. We could all learn from these kids. It is one that I will definitely purchase for my home collection. I loved the beautiful scenery too. Halle Berry, James Belushi and the rest of the cast are just terrific. If you ever wanted to see a movie that left you rooting for the underdog, this is the one to watch. I don't think you would be disappointed at all.",
         "I loved this movie. The basic story is a group of Hawaiian high school students that go to Australia for the World Solar Challenge. The young up and coming actors were very good and the story was nice. Not to mention the Australian scenery is absolutely beautiful. Great movie!",
         "What else could you expect about a movie with such a silly plot like this?. Well the truth is that you can expect light entertainment filled with predictable situations, not-so likable characters (except Halle Berry as the charming teacher, and the sexy Eliza Dushku), and silly situations. Keep in mind that this movie was made for children so it's only directed for a younger audience. I caught this one out some years ago on cable and I had mindless fun. I didn't expect much as it aired at morning so nothing else was available. Still, it isn't that bad. Watch it if you like Halle Berry or Eliza Dushku or if you want some silly entertainment."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["TriStar Pictures"],
      "summaries": [
         "Idealistic Sandra Beecher has just started working as a Science teacher at Kona-Pali High School in Hawaii, being hired for this job despite her teaching background being English. Her reason for taking the job is largely to run away from the mainland and a failed marriage. She finds that her students are an unmotivated lot, largely because there are low societal expectations of them, including from their parents and the school faculty. As such, she directs a handful of her most unmotivated students to attend a regional science fair at which there are no Kona-Pali displays to come up with their own science fair projects. An incident at the fair does spur one of her students, Daniel Webster, self-professed as not being good at most things but believing he is a good designer, to announce, with the support of his fellow students, that they want to build a solar powered car of his design as their project, and to enter that car in the upcoming Inter-island Race. American Corporate giant, CelTech, has agreed to sponsor the winner of that race for the grueling six day, 2,800km long Trans-Australian World Solar Challenge, at which the best minds in this field - corporate and academic - will be participating. CelTech expects their own financially supported entry to win the Hawaii race. Despite the odds against them, Ms. Beecher agrees, and is eventually able to convince, albeit reluctantly, the school's shop teacher, Frank Machi, to be another school supervisor on the project. The students, Sandra and Frank have to overcome many obstacles to even getting a finished product to enter the race, from self-doubt, to internal issues which may raise irreconcilable differences between the team members, to mostly everyone external to them believing they cannot achieve their goal. Their largest naysayers are their competitors, including CelTech, and current world champion, Hans Kooiman of the Euro Team, who have an elitist view of their world.",
         "A bunch of high school misfits in Hawaii, introduced by their new teacher, attend a science fair in which they draw up inspiration to build their own solar car and win a trip to compete in the 1990 World Solar Challenge in Australia.",
         "A bunch of high school misfits in Hawaii, introduced by their new teacher, attend a science fair in which they draw up inspiration to build their own solar car and win a trip to compete in the 1990 World Solar Challenge in Australia."
      ],
      "budget": 0
   },
   "movielensId": 120,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-22",
      "dvdReleaseDate": "2002-04-30",
      "directors": ["Charles T. Kanganis"],
      "runtime": 100,
      "movieId": 120,
      "title": "Race the Sun",
      "mpaa": "PG",
      "actors": [
         "Halle Berry",
         "Jim Belushi",
         "Casey Affleck",
         "Eliza Dushku",
         "Kevin Tighe",
         "Anthony Ruivivar",
         "Steve Zahn",
         "Dion Basco",
         "J. Moki Cho",
         "Nadja Pionilla",
         "Adriane Napualani Uganiza",
         "Sara Tanaka",
         "Bill Hunter",
         "Joel Edgerton"
      ],
      "imdbMovieId": "0117427",
      "originalTitle": "Race the Sun",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["w7idtZ4tsN8"],
      "plotSummary": "A bunch of high school misfits in Hawaii, introduced by their new teacher, attend a science fair in which they draw up inspiration to build their own solar car and win a trip to compete in the 1990 World Solar Challenge in Australia.",
      "tmdbMovieId": 55731,
      "avgRating": 2.88323,
      "releaseYear": "1996",
      "numRatings": 167,
      "posterPath": "/odifQ57irGc3k0x85djZ0yT2Inn.jpg"
   }
}