{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "flat",
            "id": 1439
         },
         {
            "name": "bath",
            "id": 1822
         },
         {
            "name": "darkness",
            "id": 3762
         },
         {
            "name": "uncle",
            "id": 6464
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "rural setting",
            "id": 11004
         },
         {
            "name": "cigar smoking",
            "id": 11333
         },
         {
            "name": "cottage",
            "id": 11826
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "cafe",
            "id": 14766
         },
         {
            "name": "strangulation",
            "id": 14829
         },
         {
            "name": "english countryside",
            "id": 18300
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "farmer",
            "id": 154846
         },
         {
            "name": "british pub",
            "id": 155479
         },
         {
            "name": "unemployed",
            "id": 198673
         },
         {
            "name": "actors",
            "id": 225822
         },
         {
            "name": "lake district",
            "id": 227002
         }
      ],
      "imdb_id": "tt0094336",
      "video": false,
      "title": "Withnail & I",
      "recommendations": [
         11235,
         11826,
         11159,
         11031,
         14320,
         14807,
         16307,
         10683,
         11898,
         5506,
         1485,
         12877,
         10002,
         3085,
         931,
         15598,
         32961,
         31767,
         11167,
         851
      ],
      "backdrop_path": "/ioY6kNwh1h1syTYu3ppbbYCYmwG.jpg",
      "revenue": 1544889,
      "reviews": [
         {
            "author": "LastCaress1972",
            "id": "5207b313760ee3630e23a6b8",
            "content": "Bought this on DVD for a £2 on a second-hand market stall a couple of years ago, then upgraded it to blu-ray a few months ago when I saw it on sale in HMV for a bargaintastic three quid. Yet I'd never got around to actually watching it. I'd bought it (twice) off the back of it being this enormous cult classic weighed down with critical praise (Wiki tells me that the readers of Total Film magazine voted it the third greatest comedy film of all time in 2000 and the 13th greatest British film of all time in 2004, it was ranked 38th greatest film of all time by Channel 4 in 2001 in their 100 Greatest Films poll, an Observer poll of 60 eminent British filmmakers and critics voted it 2nd best British film of the last 25 years in 2009, it ranked 118 in Empire magazine's list of The 500 Greatest Films of All Time in 2008). Anyways: This film has so far mugged me for a fiver. 2/10, and I'm being generous. What a pile of rubbish! \"Third greatest comedy\"?!? I would never EVER in a thousand years pegged it as a \"comedy\", under any measurable criteria. It wasn't just trying-yet-failing to be funny, I wasn't even aware it was trying to be funny. Literally, the ONLY funny thing about the movie was how anyone on Earth could have thought this was a good film. Basically: It's the late sixties, and two posh, \"luvvy\" actors (the titular \"Withnail\" and \"I\", played capably enough by two posh, \"luvvy\" actors: Richard E. Grant and Paul McGann, respectively), living in absolute filth like a couple of retards - I mean, they don't seem to have any understanding of how to operate, say, the kitchen sink - decide that they need to go for a break in the countryside, at a cottage owned by Withnail's gay uncle. They go, it pisses down ceaselessy, they fail to get on with the natives simply because they're such unlikeable morons, then the gay uncle shows up and spends the rest of the movie creepily and ceaselessly trying to gay off with Paul McGann's unnamed \"I\" character. They go home, they tolerate a drug-dealer and his friend who have broken into and taken up residence in their house, \"I\" gets an acting job offer and takes off. The end. Utter rubbish. In fact, I'm making it sound better than it is. Reading it back, it sounds vaguely like an admittedly particularly poor episode of Bottom played dramatically rather than for laughs, and although there are shades of the Rick/Rich character that Rik Mayall has played his entire career in Richard E. Grant's performance, Withnail & I is NOT even as good as a poor Bottom episode. And I didn't like Bottom either, especially.",
            "url": "https://www.themoviedb.org/review/5207b313760ee3630e23a6b8"
         },
         {
            "author": "Arrrrrrrach",
            "id": "58a84fdf925141569100875d",
            "content": "A beautiful, dreary and funny film.  At times subtle and others direct.  Deeply contemplative with majestic scenery and an atmosphere of grey.  Sardonic humour with believable, excellently acted characters and scenarios.  It's the greatest film about friendship and only gets better with each viewing.  The direction is purely cinematic and shows rather than tells. A Masterpiece.",
            "url": "https://www.themoviedb.org/review/58a84fdf925141569100875d"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Withnail",
               "gender": 2,
               "credit_id": "52fe45699251416c75055845",
               "name": "Richard E. Grant",
               "profile_path": "/jMnSjjPQwCOAJ1kPRXLbh0WnsPa.jpg",
               "id": 20766,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Marwood (I)",
               "gender": 2,
               "credit_id": "52fe45699251416c75055849",
               "name": "Paul McGann",
               "profile_path": "/vtp1wTbuxO9JfKP52xo0pjCOkh9.jpg",
               "id": 47654,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Montague Withnail (Uncle Monty)",
               "gender": 2,
               "credit_id": "52fe45699251416c7505584d",
               "name": "Richard Griffiths",
               "profile_path": "/hUHiJYtXgGgYt7UkHA7YgEiGNYC.jpg",
               "id": 10983,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The Poacher",
               "gender": 2,
               "credit_id": "52fe45699251416c75055851",
               "name": "Michael Elphick",
               "profile_path": "/wK3Msy7Sqo4K9xWoPENnp1pxJRY.jpg",
               "id": 1821,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Danny the Dealer",
               "gender": 2,
               "credit_id": "52fe45699251416c75055855",
               "name": "Ralph Brown",
               "profile_path": "/ksIVhmaAB5oRiOkm9mDKALVkaJk.jpg",
               "id": 53916,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Presuming Ed",
               "gender": 0,
               "credit_id": "52fe45699251416c7505585f",
               "name": "Eddie Tagoe",
               "profile_path": "/1J9ujNEgWVupIxTJ8NouIRbblvn.jpg",
               "id": 55909,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Irishman",
               "gender": 2,
               "credit_id": "5837408c925141319e0155b9",
               "name": "Daragh O'Malley",
               "profile_path": "/xHokRLUxBBKiDgzfyuJedC6nyKf.jpg",
               "id": 144863,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mr Parkin",
               "gender": 0,
               "credit_id": "583740a0925141318f0166db",
               "name": "Michael Wardle",
               "profile_path": null,
               "id": 1248746,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Mrs Parkin",
               "gender": 0,
               "credit_id": "583740b6925141319801562b",
               "name": "Una Brandon-Jones",
               "profile_path": null,
               "id": 1368909,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Isaac Parkin",
               "gender": 0,
               "credit_id": "583740c1925141319b015969",
               "name": "Michael Wardle",
               "profile_path": null,
               "id": 1248746,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "General",
               "gender": 2,
               "credit_id": "583740d1c3a36836b3016631",
               "name": "Noel Johnson",
               "profile_path": "/sbrEL7tPBF6ZbBtr7TtKevVlEkf.jpg",
               "id": 214149,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Waitress",
               "gender": 0,
               "credit_id": "583740e89251414cb9008e47",
               "name": "Irene Sutcliffe",
               "profile_path": null,
               "id": 1713662,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Tea Shop Proprietor",
               "gender": 0,
               "credit_id": "58374108925141319e01564e",
               "name": "Llewellyn Rees",
               "profile_path": "/zdjxPSwo1TUw8610WVOdhbsHZDf.jpg",
               "id": 1221507,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Policeman",
               "gender": 2,
               "credit_id": "5837411592514131a4016148",
               "name": "Robert Oates",
               "profile_path": null,
               "id": 192895,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Policeman 2",
               "gender": 0,
               "credit_id": "583741269251413192016a1d",
               "name": "Anthony Wise",
               "profile_path": null,
               "id": 1273073,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45699251416c7505585b",
               "name": "Bruce Robinson",
               "profile_path": "/mImqLKRBNPUZz8dIAzoIvkADDwS.jpg",
               "id": 8966,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45699251416c75055865",
               "name": "Bruce Robinson",
               "profile_path": "/mImqLKRBNPUZz8dIAzoIvkADDwS.jpg",
               "id": 8966,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.172645,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 13446,
      "vote_count": 205,
      "budget": 0,
      "overview": "Two out-of-work actors -- the anxious, luckless Marwood and his acerbic, alcoholic friend, Withnail -- spend their days drifting between their squalid flat, the unemployment office and the pub. When they take a holiday \"by mistake\" at the country house of Withnail's flamboyantly gay uncle, Monty, they encounter the unpleasant side of the English countryside: tedium, terrifying locals and torrential rain.",
      "similar": [
         115,
         949,
         9392,
         994,
         814,
         11826,
         4497,
         16642,
         631,
         21481,
         4787,
         12770,
         1405,
         152745,
         30931,
         31262,
         31414,
         41090,
         45318,
         43466
      ],
      "original_title": "Withnail & I",
      "runtime": 107,
      "poster_path": "/lXD5UR2dvXJF54AIBt8G2kDvYGk.jpg",
      "spoken_languages": [
         {
            "name": "Latin",
            "iso_639_1": "la"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/jDiTLxS5aaANB50g3UMZyku3cu5.png",
            "name": "The Criterion Collection",
            "id": 10932,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Handmade Films Ltd.",
            "id": 146,
            "origin_country": ""
         }
      ],
      "release_date": "1987-01-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "If you don't remember the 60s don't worry, neither can they.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruce Robinson"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Bruce Robinson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094336/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2NjQzMjg5N15BMl5BanBnXkFtZTYwNjQ3MDY5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard E. Grant, Paul McGann, Richard Griffiths | See full cast and crew »"],
      "reviews": [
         "Camden, 1969. Two unemployed actors, Withnail (Richard E Grant), and I (Paul McGann), are facing up to the reality of an empty wine cellar and a harsh comedown following a speed binge. Squalid living conditions and the prospect of life on the poverty line leads 'I' (otherwise known as Marwood), to suggest a rejuvenating break in the Lake District. After Withnail manages to persuade his bizarre uncle, Monty (Richard Griffiths) to part with the keys of his dilapidated cottage, the take the Jag north for a taste of country life. Adapting to such an alien environment is an initial challenge to the highly strung Withnail; his predicament is significantly worsened following an altercation with poacher Jake (Michael Elphick). Meanwhile, Marwood is forced to concentrate his attentions to fending off the advances of the lecherous Monty, who has inconveniently come to stay. Following an awkward evening, the pair hurriedly return to London and, after a run-in with the Metropolitan Police, return to find Danny (Ralph Brown) has made himself at home. Drugged rodents fill the oven while Presuming Ed fills the bath and Marwood is rescued from the mire - it seems he will crack the boards after all. \"Congratulations\", Withnail says emptily, as he begins to contemplate life without his straight man. Bruce Robinson deserves high praise for creating a rich, debauched world of weird thumbs, phenodihydrochloride benelex, old suits, uncontaminated urine and the Camberwell carrot. WIth a the tightest of budgets, he brings the late 1960's to life. The script is incredibly witty and eminently quotable. Both Mary Selway (casting director) and Bruce Robinson succeeded in bringing dialogue to life with an impeccable choice of actors. Richard E Grant has never come close to his performance as Withnail - his drunken performances are remarkable. Richard Griffiths is as camp as a hat as the overbearing, exuberant Monty, and Ralph Brown is frequently hilarious as the dangerous but lovable Danny. This is a film that will never be tarnished by age, and neither is it limited by repeat viewings. It is a very accessible film, despite its largely English humour, and 'Withnail' remains one of the best films about friendship. Certainly a one off, 'Withnail' is a must see film that will not disappoint.",
         "Withnail and I is set in an old, run down student flat in London's Camden Town at the end of the 1960's. Withnail and I are a couple of unemployed actors from different ends of the social spectrum. Withnail is a Harrow educated dilettante, and rather upper crust; his flatmate Marwood is a grammar school boy with a slightly more realistic outlook on life. To escape from the squalor of their grim, unemployed, existence in Camden Town, soaked in a near lethal cocktail of alcohol and drugs, the desperate pair call upon the generosity of Withnail's uncle Montague and secure the use of his cottage in the country for a weekend. Uncle Monty is an eccentric middle-aged homosexual, who prefers vegetables to flowers. He considers that 'flowers are essentially tarts - prostitutes for the bees', and wears a radish in his buttonhole in preference to a flower. He grows vegetables in pots in his Chelsea house, and makes suggestive references to 'firm young carrots'. Withnail (excellently played by Richard E. Grant), persuades Uncle Monty (a superb Richard Griffiths) to lend Marwood (a convincing Paul McGann) and him his cottage in the country for the weekend. Their exploits at the cottage, and in Penrith where they spend their Wellington boot money on booze and try to sober up in a gentile tearoom are memorable, witty and entertaining. The incongruous uncle Monty reciting Baudelaire in the Cumbrian hills, seeking carnal knowledge of Marwood (apparently coerced by the cowardly and treacherous Withnail), are testament to the writing skills and humour of author and director, Bruce Robinson. The film's soundtrack brings us 'A Whiter Shade of Pale', played by King Curtis on the Saxophone, 'My Friend' and 'Walk hand in Hand', performed by Charlie Kunz, 'Schubert's Piano Sonata in B Flat Major' performed by Leslie Pearson, 'All Along the Watchtower' and 'Voodoo Chile', by Jimi Hendrix, 'Hang Out the Stars in Indiana', performed by Al Bowlly, and 'While My Guitar Gently Weeps', by the late lamented George Harrison, who provided much of the financial backing for this memorable film. This is a thoroughly entertaining 108 minutes of humorous entertainment, a few too many drinks, a convincing 60's atmosphere, superb performances from the excellent cast, and music to make your heart, and your guitar, gently weep. Thank you, George Harrison.",
         "The first time I watched 'Withnail and I' in the late 80s I thought it was pretty good, but that's about it. Over the years, and a few more viewings, it really started to grow on me, and recently rewatching it on DVD for the first time I was struck at how brilliant and unique it is. It's a very subtle film really, and most comedy is admittedly a matter of taste, but if this movie clicks with you you'll most likely end up putting it in amongst your all time favourites. To me it's one of the greatest comedies ever. It's intelligent and sad and genuinely laugh out loud FUNNY, something you rarely see these days. The movie is episodic and seems to ramble on, but it's much more than a shaggy dog story, there's an underlying depth and melancholy to it that makes it something special. Richard E. Grant has never been better than this. Playing Withnail and writing his wonderful autobiography cement his place in film history as far as I'm concerned. Paul McGann is also excellent, and there are lovely performances from Richard Griffiths, Michael Elphick and Ralph Brown. EVERYONE is good in 'Withnail' but it's still Grant's movie all the way. He is just utterly brilliant! 'Withnail and I' is one of THE great British movies, and comes with my highest recommendation.",
         "In the late 1960'sm Withnail and our narrator are two unemployed actors who have little chance of being employed. Fed up with their lot in Camden, they flee for a restful break in Penrith in the cottage of Withnail's Uncle Monty. However the facilities, the oddball locals and the advances of Monty put their friendship under pressure. There is very little I can add to the many reviews that have rightly praised this film as one of the funniest British films ever. The basic plot is not enough to keep you watching and you should not come to this film looking for an amazing narrative - I have watched this several times and never once has it mattered where the film was going, only how it goes there. The joy of the film is a script that is rich in highly memorable and quotable dialogue that will make you laugh out loud. It is crass to let this become a list of lines but if you stood up in certain circles and declared `I demand booze' or `I want something's flesh' then it would immediately be recognised! Of course, the dialogue would not work if it were delivered badly, a problem that does not exist here. Grant is, and always will be, Withnail; no matter how many stupid adverts he does for shops this is how I will remember him. His delivery is tremendous and he brings the character to life in a spinning fireball of comedic excess! McGann has the less showy part but is equally as good and has to make his character real in order to hold the film together. Support roles are just as well scripted and just as funny - notably Griffiths (you terrible c*nt!) and the late Michael Elphick. Overall this is simply one of the best British comedies ever made and it breaks my heart to see voter's lists where things like Four Weddings top it! The delivery is great and the writing is consistently outrageous and hilarious. The only downside of this film is that director/writer Robinson has never topped this wonderful movie and looks like he never will.",
         "I have a film poster of Withnail & I that has such critical quotes as \"Hilarious!\" and \"Gloriously funny!\" and I can't say I totally agree. Don't get me wrong...I loved this film and it remains one of my favorites of all time, I just think these quotes sell the movie as some kind of Monty Python romp...and it's much more than that. I did laugh throughout, but I was also touched and found it quite sad (in a very entertaining way.) I would like to think that this is what Bruce Robinson intended...to make a dramedy...not just a silly romp. Though perhaps a bit slow for some, I thought the pace was remarkable, the acting superb. I have also heard people say that they found the plot lacking...but I argue that sometimes it's just nice to sit back and get swept away by a good character study. Interesting and thought provoking, sometimes referred to as a \"cult classic\", I say it's just a classic - period. Oh...and great soundtrack. The closing music always gives me goosebumps.",
         "Pretty superfluous to add to the praise of Withnail & I. If Oscars mattered particularly and, further, went to those deserving, surely Richard Griffiths (Uncle Monty) would receive one for his high camp, yet credible and deeply touching turn. That's the key - it's all too credible, 'cos we've done it. As an essay on the final shedding of a strange inverted innocence for the corruption of 'normal' life with its compromises, self-discipline and grind, unsurpassed, I believe. Likewise for its appreciation of the deep platonic love that can spring up between young men in the trenches of poverty and booze. Everything pitch perfect from the herniating slapstick to the pathos, from the soundtrack to the props, from the rain to the booze and all the way from Withnail... to I. 10/10.",
         "Strange to believe that WITHNAIL AND I , a film that is regarded as today one of the best British comedies ever made flopped spectacularly on its initial release in 1987 and maybe it's not too easy to see why . In the late 1980s the British film industry was in an absolute mire and the very phrase itself \" British film \" made a homegrown audience roll its eyes and think of art-house crap directed by Derek Jarman or Peter Greenaway . Any British film no matter the genre or how good it was always got tarred with the same brush in those days . Years later actor Ralph Brown ( Danny ) was asked \" Why is it a good film ? \" to which he replied \" Because there's no crap bits in it \" which simplifying the truth . WITHNAIL AND I is a very rare type of British comedy since it has been developed to its utmost potential . All too often British comedies of the last 20 years feel like they've been rush released before the script has been used to its full potential but not with this comedy classic because nearly every scene couldn't possibly be any funnier . Everyone has their favourite scene like the one in the Irish bar or the tea room or the one with bull but for me the stand out scene has got to be the urine sample down at the police station . It's also interesting to note that it's a movie without any female characters and feels both homo-erotic and laddish at the same time . It also carries an emotional and poignant impact at the end , something all of us can relate to when our best friend finds a new best friend and we become quickly forgotten All the cast are excellent but Richard E Grant is nothing short of superb and it's probably his performance as much as Bruce Robinson's smart script . You could argue that because Withnail is a camp , self centered , mincing thespian Grant is playing an extension of himself and while this may be true he's certainly enjoyable to watch here . Ironically enough I'd have thought he'd be brilliant as the title character in DOCTOR WHO but it was co-star Paul McGann who got the role in the 1996 American TVM and what a major disappointment he was . As it stands both actors will probably be best remembered for their cracking roles in this movie",
         "By far the greatest film ever made!!! Truly shows what can be done with just brilliant writing. There are no car chases, explosions, aliens or superheros. This film touches the nerves of anyone that's ever struggled for something that seemed unobtainable. That naive part of youth that makes us feel invincible. The time of your life when you don't mind going without. The time of your life where your greatest memories will come from. The freedom and irresponsibility of being young. Before settling down and having to be a responsible adult and taking the kids to school. I love this movie, it reminds of a time when all I needed was a beer...",
         "Richard E Grant is simply perfect as Withnail, the addled but undoubtedly well-equipped \"actor\" on holiday with his pal, the \"I\" in the title. His soliloquy from Hamlet in the final scene is one of the best readings of that scene anyone's done in film. This is a film with a point, and a great way of avoiding making it too emphatically. I love every character, and every line. When Withnail frantically searches for antifreeze after drinking lighter fluid in a crazed attempt to become drunk, \"I\" says, \"Everyone knows you shouldn't mix your drink!\" Superb!",
         "What a film! The one-liners, the names (Monty, Withnail...where else would you find such spectacular names?!) True it does not have much of a plot but what it lacks in plot it makes up for in sheer brilliance of dialogue and wit. I had never heard of this film and then suddenly out of the blue : the people i babysat for told me about it, my friend Sarah began raving about it and then the ultimate shove towards watching it, my sister brought the video home! Now if that is not fate i don't know what is. I will be forever grateful. Richard E. Grant is the epitome of the brilliant character actor(i would put his performance on a level such as Daniel Day Lewis, a fete not known by any other actor in my book)finding an exquisite foil in McGann. Watch this film and if you do not find it in the least bit interesting then so be it you are condemned to be boring forever. But if you do not even crack a smile at the infamous line GET IN THE BACK OF THE VAN!! then i would worry for your future in the art of film watching."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["HandMade Films"],
      "summaries": [
         "London 1969 - two 'resting' (unemployed and unemployable) actors, Withnail and Marwood, fed up with damp, cold, piles of washing-up, mad drug dealers and psychotic Irishmen, decide to leave their squalid Camden flat for an idyllic holiday in the countryside, courtesy of Withnail's uncle Monty's country cottage. But when they get there, it rains non-stop, there's no food, and their basic survival skills turn out to be somewhat limited. Matters are not helped by the arrival of Uncle Monty, who shows an uncomfortably keen interest in Marwood...",
         "London: The Sixties. Two down-on-their-luck actors (Withnail and Marwood) find solace in drink and other substances. Seeking respite from their uneventful lives they escape up north to Penrith to Withnail's uncle's stone cottage. Faced with no modern conveniences, a bunch of oddball locals, and a surprise visit from an amorous \"Uncle Monty\", their wits are tested, along with their friendship."
      ],
      "budget": 0
   },
   "movielensId": 1202,
   "movielens": {
      "languages": [
         "Latin",
         "English"
      ],
      "releaseDate": "1987-01-01",
      "dvdReleaseDate": "2001-07-10",
      "directors": ["Bruce Robinson"],
      "runtime": 107,
      "movieId": 1202,
      "title": "Withnail & I",
      "mpaa": "R",
      "actors": [
         "Richard E. Grant",
         "Paul McGann",
         "Richard Griffiths",
         "Michael Elphick",
         "Ralph Brown",
         "Eddie Tagoe",
         "Daragh O'Malley",
         "Michael Wardle",
         "Una Brandon-Jones",
         "Michael Wardle",
         "Noel Johnson",
         "Irene Sutcliffe",
         "Llewellyn Rees",
         "Robert Oates",
         "Anthony Wise"
      ],
      "imdbMovieId": "0094336",
      "originalTitle": "Withnail & I",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "xT5qhPoRS9g",
         "vGUuZJj7WwI",
         "CgHCggD8F8k",
         "0ATYtmPVtjo"
      ],
      "plotSummary": "Two out-of-work actors -- the anxious, luckless Marwood and his acerbic, alcoholic friend, Withnail -- spend their days drifting between their squalid flat, the unemployment office and the pub. When they take a holiday \"by mistake\" at the country house of Withnail's flamboyantly gay uncle, Monty, they encounter the unpleasant side of the English countryside: tedium, terrifying locals and torrential rain.",
      "tmdbMovieId": 13446,
      "avgRating": 3.83839,
      "releaseYear": "1987",
      "numRatings": 1844,
      "posterPath": "/lXD5UR2dvXJF54AIBt8G2kDvYGk.jpg"
   }
}