{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "blindness and impaired vision",
            "id": 1741
         },
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "hong kong",
            "id": 12354
         }
      ],
      "imdb_id": "tt0097202",
      "video": false,
      "title": "The Killer",
      "recommendations": [
         11782,
         11471,
         18305,
         11909,
         14537,
         576,
         12493,
         3777,
         1059,
         11368,
         18747,
         47423,
         11942,
         30368,
         13807,
         21519,
         993,
         5511,
         42120,
         379
      ],
      "backdrop_path": "/5pyfKiChqJg3cZGn1EM9rIWXALl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c895",
               "name": "Chow Yun-fat",
               "profile_path": "/6JbF55y5nPn4APoVxRzuDBMiVLh.jpg",
               "id": 1619,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Insp. Li Ying / Little Eagle",
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c861",
               "name": "Danny Lee Sau-Yin",
               "profile_path": "/nfWVMzoHe6CFKZjDLukoxUfWaTo.jpg",
               "id": 26784,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Jennie",
               "gender": 0,
               "credit_id": "52fe43bf9251416c7501c865",
               "name": "Sally Yeh",
               "profile_path": "/ebMhexM72sv8L5HGPIQ2xIdWuRg.jpg",
               "id": 67046,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Sidney Fung",
               "gender": 0,
               "credit_id": "52fe43bf9251416c7501c869",
               "name": "Paul Chu Kong",
               "profile_path": "/yGv5gXl4totYLxxx0liC3K3JIiF.jpg",
               "id": 67047,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Sgt. Tsang Yeh",
               "gender": 0,
               "credit_id": "52fe43bf9251416c7501c86d",
               "name": "Kenneth Tsang",
               "profile_path": "/6oYTIjKlp8vsyxod7nPJ1R9V8Hf.jpg",
               "id": 10885,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Hay Wong Hoi",
               "gender": 0,
               "credit_id": "53fb017fc3a368735b004464",
               "name": "Shing Fui-On",
               "profile_path": "/igXnxDdFv0VxoGeo6KrEZUMAMqo.jpg",
               "id": 119447,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Teddy Wong Hung",
               "gender": 2,
               "credit_id": "53fb01a1c3a368734c004338",
               "name": "Tommy Wong",
               "profile_path": "/xQiO2LkNL0rDxgsWeoqkCHML55r.jpg",
               "id": 1135394,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Teddy's man",
               "gender": 0,
               "credit_id": "53fb01b2c3a368735b00446c",
               "name": "James Ha",
               "profile_path": null,
               "id": 556938,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Frank Chen",
               "gender": 0,
               "credit_id": "53fb01cac3a36873550044d7",
               "name": "Ricky Yi Fan-Wai",
               "profile_path": "/krwj4hCW9QGlkjkJJMfKrTvWjLF.jpg",
               "id": 1356792,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Chief Inspector Tu",
               "gender": 0,
               "credit_id": "5742a42ec3a36818050014e1",
               "name": "Barry Wong",
               "profile_path": "/paZy6ZlXIBUmq2mZUyN0KsZKhmO.jpg",
               "id": 62412,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Inspector Chan",
               "gender": 0,
               "credit_id": "53fb01e7c3a36873520044c9",
               "name": "Parkman Wong",
               "profile_path": "/FT0quzalY5r40r97WkV9SASaHB.jpg",
               "id": 553881,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Tony Wong Tung Yuen",
               "gender": 0,
               "credit_id": "53fb0200c3a368734c00433f",
               "name": "Teddy Yip Wing-Cho",
               "profile_path": "/wX6YeWczAQTzvsNxaX2dZxQMw86.jpg",
               "id": 571521,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Sniper",
               "gender": 0,
               "credit_id": "53fb0210c3a368735e004604",
               "name": "Alan Ng Siu-Hung",
               "profile_path": null,
               "id": 1356793,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c873",
               "name": "John Woo",
               "profile_path": "/d1ovGZj05qWU1MjVKAePVj7ZMRh.jpg",
               "id": 11401,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c87f",
               "name": "Tsui Hark",
               "profile_path": "/spPu64ewZ4Gwo2UzBfKIjfAj9BT.jpg",
               "id": 26760,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c885",
               "name": "Peter Pau",
               "profile_path": "/pWDiUIJB2OpROUNgcMvcX4pZOwu.jpg",
               "id": 1633,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43bf9251416c7501c891",
               "name": "Fan Kung-Wing",
               "profile_path": null,
               "id": 67049,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a0dd191c3a36804e4000119",
               "name": "Horace Wong",
               "profile_path": null,
               "id": 1417200,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a0e6fe1c3a3686289007f7c",
               "name": "Ben Luk Man-Wah",
               "profile_path": null,
               "id": 1414316,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a0e6ff392514138ea00857b",
               "name": "Shirley Chan Koo-Fong",
               "profile_path": null,
               "id": 1924988,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a0e7001c3a3686280008d79",
               "name": "Lowell Lo",
               "profile_path": "/1VbWjOIXyrkn1jqzixYgkEhPfzK.jpg",
               "id": 238973,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a0e701dc3a3686280008da2",
               "name": "John Woo",
               "profile_path": "/d1ovGZj05qWU1MjVKAePVj7ZMRh.jpg",
               "id": 11401,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5ac1270e92514126c100a337",
               "name": "David Wu",
               "profile_path": "/ksIxFCPa4SPOjalaYxIcDZoaD06.jpg",
               "id": 29693,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 14.823918,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 10835,
      "vote_count": 233,
      "budget": 0,
      "overview": "Mob assassin Jeffrey is no ordinary hired gun; the best in his business, he views his chosen profession as a calling rather than simply a job. So, when beautiful nightclub chanteuse Jennie is blinded in the crossfire of his most recent hit, Jeffrey chooses to retire after one last job to pay for his unintended victim's sight-restoring operation. But when Jeffrey is double-crossed, he reluctantly joins forces with a rogue policeman to make things right.",
      "similar": [
         11423,
         4771,
         9873,
         10651,
         96,
         101,
         75780,
         156022,
         984,
         2142,
         58625,
         1266,
         12143,
         7007,
         15069,
         26390,
         281,
         1538,
         1572,
         2503
      ],
      "original_title": "喋血雙雄",
      "runtime": 110,
      "poster_path": "/8hTxlSqMAHBXAh1eB69ir0BXhzE.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Film Workshop",
            "id": 3618,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Golden Princess Film Production Limited",
            "id": 6213,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Long Shong Pictures",
            "id": 5551,
            "origin_country": ""
         }
      ],
      "release_date": "1989-07-06",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "One Vicious Hitman. One Fierce Cop. Ten Thousand Bullets.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Woo"],
      "runtime": 111,
      "synopsis": null,
      "writers": ["John Woo"],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0097202/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxMzA5NjY1Ml5BMl5BanBnXkFtZTYwMDIxMzU5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Yun-Fat Chow, Danny Lee, Sally Yeh | See full cast and crew »"],
      "reviews": [
         "Before seeing a genuine Hong-Kong produced John Woo movie, I thought I knew what action was, and what the action-movie genre was capable of. I was wrong. The Killer was the single most impressive, awe-inspiring, jaw-dropping action movie I had seen in years, and is now one of my favourite movies of any genre. It is #2 on my all-time list. Why? First of all, the well-known poetic violence of the super-charged action scenes make for a tremendously exciting film. These combine choreographed bloodshed (there is an almost constant stream of bullets) with raw emotion that puts even the best Hollywood actioners to shame. Look at Hollywood action movies today; almost all Hollywood action is inspired (not to mention plagiarised) from the \"heroic bloodshed films,\" the best of which is The Killer. Quentin Tarantino and Robert Rodriguez are only the most obvious examples of American directors to put Woo's trademark stylized violence to use, and neither handle it as well as Woo. But beyond this, the characters and the story are what drive this movie and what truly set it apart. The story of the relentless cop and the vicious killer is only the latest in a long line of detective stories, starting with Arthur Conan Doyle and Edgar Allan Poe in the 19th century, and continuing in every cop show on TV today. The hero and the villain are practically the same; they are only divided by an almost arbitrary line called the law. In The Killer, both \"Mickey Mouse\" and \"Dumbo\" are unrelenting, capable, though misunderstood, professionals. Their motivations differ, but they both have the killer instinct. The classic storyline of the interaction of the two characters who eventually realize their similarities and end up working together has been seen before, but never has it been used to such effect as in The Killer. Woo's familiar themes of brotherhood, betrayal and loyalty also reach their cinematic peak in this movie. The viewer not only wants to see the next pyrotechnic action scene, but is actually concerned with the lives of the characters, an element that is almost always lacking in typical Hollywood fare. Finally, the gun-battle scenes, when they come, are simply the most spectacular, mind-blowingly violent, yet strangely beautiful, action scenes ever imagined or filmed. And last but not least, is the unbelievably powerful screen presence of Chow Yun-Fat, as always cool incarnate. His effortless lead and the tension created by his playing off of co-star Danny Lee make The Killer as close as I have yet seen to the perfect action movie. I recommend it to any hard-core action fan and also suggest Hard-Boiled, though Woo's American efforts thus far have not been up to his Hong Kong works. Rating: 10",
         "The Killer is widely regarded as John Woo's best all round film, and makes an appearance on an extraordinary number of people's Top 10 lists. This may be because it was the first Hong Kong movie a lot of people saw, as it was one of the first to get any kind of widespread attention in the US. It doesn't feature in my own Top 10, but that's not because it isn't good Chow Yun Fat plays the titular killer, an assassin who begins to regret his life of violence after accidentally blinding singer Sally Yeh during an assassination. Danny Lee plays the cop on his case, who begins to find he can relate to the killer more than he can to many of his colleagues. Both men are shown to be men whose values of loyalty and honour are increasingly being forgotten by the society in which they live. THE KILLER pretty much defines the \"Heroic Bloodshed\" genre, taking the code of chivalry from the old swordplay films and bringing it into the world of guns and bullets. Woo basically started the whole genre with the seminal A BETTER TOMORROW, but THE KILLER is the most distilled vision of the concept he or anybody else in Hong Kong produced. It's a very romanticised film - even though the main characters earn their livings from violence, they're painted as very noble characters and starkly contrasted with the real villains (led by Shing Fui On in his best role ever) who kill without honour. There's a broad message of peace and restraint from violence there too, though it's somewhat conflicted with the romanticisation of some of the bloodshed. John Woo and Chow Yun Fat were serious box office gold when THE KILLER was made - apart from another Jackie/Sammo/Biao collaboration there was probably no more anticipated collaboration than this one. As such, THE KILLER was afforded a budget and shooting schedule that most Hong Kong productions could never dream of (though still no doubt miniscule compared to any Hollywood film of the time). This is evident in the quality of the production on pretty much ever level. The film has as high production values as any Hong Kong film ever made, and is surely one of the most technically accomplished. Credit for this must be shared between cinematographer Peter Pau, producer Tsui Hark and of course director John Woo. I've always suspected that the real talent behind the film was probably Tsui Hark - it's rumoured that Tsui & Woo fell out heavily because Tsui felt THE KILLER should be \"A Tsui Hark Film\" and not \"A John Woo\" film. Evidence for this is that Woo's earlier and later films have been largely lacking the substance and depth of THE KILLER (especially his Hollywood films, but everybody gets that in Hollywood). However, the interviews on the Hong Kong Legends DVD clearly show that Woo had a vision and pursuit of excellence that was the driving force in the project. He's spoken of very highly by his cast and DOP, who give him the full credit for the film's success. I'd like to hear Tsui Hark's side of the story though The attention to detail in the film is most obvious in the cinematography. This was Peter Pau's first big film, and the one that established him as one of Hong Kong's top cinematographers. He gives Woo most of the credit for the film's visual style though, describing how much thought Woo would give to the way the camera should be positioned and move to bring out the emotional quality of the scene. I don't have the knowledge/education to be able to perceive how the camerawork in the film does contribute to the emotional depth, but I can acknowledge that it's effective. Woo is often regarded by Western film makers as the best director of action in the world. I think Tsui Hark probably deserves that credit more, but Woo certainly redefined the way gunplay was choreographed and filmed. HARD BOILED is his finest work in this respect, but THE KILLER certainly comes second. The action was choreographed by Ching Siu Tung, who was evidently a little uncomfortable with choreographing gunplay when he worked on A BETTER TOMORROW 2 (sorry, but most of the shoot outs in that are just people running round randomly waving their guns at stuntmen). He'd obviously improved his skills a *lot* by the time of THE KILLER though, as the action scenes are exciting and violently beautiful. The grand finale in a church is surely one of the best gunplay sequences ever filmed, topped only by the finale of HARD BOILED. Some Western audiences find THE KILLER too melodramatic, and for an audience not raised on the swordplay and kung fu films that influenced Woo the romanticised notions of loyalty, honour and integrity may seem rather alien and strange. It's a theme that has long been found in Hong Kong Cinema though, so perhaps it reflects a more Chinese set of values than the average American or European is used to experiencing. It would be especially rare to find such emotional scenes in a Hollywood action movie, where the action genre is usually considered to be wholly distinct from drama. Perhaps it's this that makes THE KILLER such a wide hit whenever it is screened in the US. So, although I won't put THE KILLER in my Top 10 list, I definitely won't dispute the fact that it's one of the best realised films Hong Kong has produced. John Woo is unlikely to produce a film of this calibre again, and unfortunately it's unlikely Chow Yun Fat will do either. As for Danny Lee, this was undoubtedly the highlight of his career - Psychadelic Cop anyone? Sally Yeh also gives her most memorable performance, and a surprisingly convincing blind character for somebody that had no real acting training. Shing Fui On and Kenneth Tsang have never looked better either. In fact, for almost everybody involved this was probably the high point of their career. 9/10",
         "I first watched the killer on recommendation i thought i would hate it...how wrong i was.It was obvious i was watching a classic from the opening credits with a lingering shot of hong kong and a somewhat sad tune playing in the background. The story starts with ah jong an assassin hired to pull off a hit job at a nightclub during the assassination he accidentally blinds a piano singer-jenny.Feeling guilty for what he has done he decides the only way to redeem himself is too help her get a cornea transplant and the rest...you will have to find out yourself. John woo is known for directing heart pounding action sequences and these are as heart pounding as they get the final shoot out in the church is tense and exciting.The cinematography is excellent and often beautiful th camera works wonders and extreme close ups of faces are used effectively SPOILERS AHEAD.The ending of the killer is possibly the most downbeat in the history of cinema and nearly brought me too tears(ah jong's eyes explode after being shot several times).The killer is something you do not see in modern day movies...a film with a true meaning this story is of ethics honour and redemption and thats what makes it a classic.",
         "First of all, I am disgusted by some of these reviews. Modern action has been overrun by special effects and stuntmen with death wishes (not that I'm complaining), but one must consider the time and the place. It's not the world of the Matrix or the Human-Cyborg War (or whatever it's called) in the Terminator, it's Hong Kong in the 1980's with counterfeiting, hostile Chinese syndicates. It doesn't have to be a big budget feature to be great. Clerks by Kevin Smith had a minute budget, but it made Smith famous. I digress. Woo creates a sensitive and emotionally complex... assassin. To make him reconsider his job as a professional killing machine Jeffrey, the killer, blinds a lounge singer, Jenny. He swears to himself that he will end his career after one last job. Woo introduces us to the concept, like you see in A Better Tomorrow, that you can never leave a Triad even if you try your hardest. With an hour of attempting, Jeff realizes the horrible truth. Rarely does Woo bring in this feeling of absolute futility in his work. After losing his best friend, Jeff has crossed the Rubicon in his attempts and must end his ties to it by ending his everyone's but his own, excluding Jenny and Inspector Lee. Some people dislike the final shootout, but the doves and the Christian symbology adds a touch that drives religious and heroic bloodshed to the minds of the audience. On a personal note, I love it. The last few seconds depict a man, perhaps Lee, playing a harmonica in front of the church for reasons I don't know.",
         "John Woo's \"The Killer\" shows a master at the height of his powers. Woo, today working in the United States, gained fame in Hong Kong through the two \"Better Tomorrow\" films. He became popular and used his success to go to greater things. In fact, much of Woo's HK work is similar, including the work he did in the early 90's like \"Bullet in the Head\" and \"Hard Boiled\". But \"The Killer\" shows John Woo as a perfectionist, the top director of action films who can perfectly blend in over-the-top violence with emotional drama. \"The Killer\" follows John (Jeff in other versions of the film), who's played to utter perfection by Chow Yun Fat. John is a hit-man planning retirement. On one job, however, he accidentally shoots a singer (Jenny) near her eyes. She survives, but her vision is blurry. John saves her from a gang of rapist thieves, and the two ultimately fall in love with each other, despite Jenny never having seen John's face. On John's case, however, is Inspector Li, hard at work, who is intent on always getting his man. Much of the movie involves John and the results of his final job which ultimately pits him up against the entire mob, who want him dead for overexposing his identity. And the rest of the film follows John catering to Jenny's needs and helping her at every moment, all the while evading Li, who's getting closer and closer to stopping him. To make the movie the memorable film that it is, Woo perfectly orchestrates some of the best shoot-outs ever seen on film. Much of what Woo did here, he was never able to follow up. \"Hard Boiled\" was interesting, but its final shoot-out, over 20 minutes in length, just couldn't keep up. It got boring by the end. What Woo does in \"The Killer\" is give you a sample of his powers and then leave you begging for more. And that what you'll be literally doing: begging for just a glimpse of the next dude victim to Fat's two beautiful handguns. It's only sad to see that, not so much Woo doesn't do these films anymore, but that Woo rarely does good films now.(Period) He's too busy, working on ego with top stars and killer budgets. His two films that came as far as making an impact with me from his U.S. catalog will probably include \"Broken Arrow\" and \"Face/Off\", both primarily due to just how much I like Travolta (though the former was also an early film of mine that I really remember liking, since it was different from all the Disney and kid stuff I was used to). But Woo, intent on fulfilling his dreams of making a musical and captivating audiences with his powerful style, can just show the people a screening of this film. It's quoted as being \"Violence as poetry\", and that's exactly what it is. With the beautiful music adding feeling and depth to the characters and the great writing and direction, this is easily Woo's tour-de-force. 9.5/10 (****/****)",
         "Chow Yun Fat and John Woo strike again. The Killer is not your run of the mill action flick. It features characters you care about, jaw-dropping action sequences, and , best of all, Chow Yun Fat. He's always supercool. Chow and co-star Danny Lee play very similar characters but are on opposite sides of the law. It makes the film work very well. The heroes can relate to one another because they have both injured the innocent while doing their jobs. Another great actor in the film is Kong Chu in the role of Sydney, the one handed hitman. Being in the middle of the fray, he makes for an interesting character. There is a great scene involving Sydney's betrayal. Chow is so amazing with his emotions in this scene. He's not just an international action superstar, he's an underrated and incredible actor as well. That's what makes The Killer more than just another action movie. Woo's direction always helps too. The Killer boasts one of the best and most epic shootouts in film history. Woo's older films are as stylistic as they get, I mean stylistic as hell. Chow Yun Fat and John Woo make an incredible duo. Nicholas Cage is no replacement, it's high time they work together again.",
         "Warning for an action-film lovers: after John Woo's totally brilliant ultra-violent masterpiece \"Die xue shuang xiong /The Killer\", American action movie is not worth one penny. It's so great and extraordinary words can't simply describe it! I watched it twice on a movie theater. Regretfully I didn't get a chance to see it a third time on cinema but subsequently I've watched it over and over again on VHS and it still kicks ass - harder and harder every time I see it! This is the reason why I'm slightly against Woo's current career in Hollywood. He could never stretch himself to do anything like this in America! All the actors are too fantastic to be true: Danny Lee (as Lee), Sally Yeh (as Jennie), Chu Kong (as Sydney) and especially charismatic Chow Yun-Fat in the leading role as the killer Jeffrey (\"I always save the last bullet - either for myself, or my enemy\"). When he draws his guns and starts to use 'em we know who's the unconditional king of action! Intelligent and profound story is hard and unsparing but somehow truly beautiful. Score is delightful: lovely and engaging and a bit sad. Charming song as performed by Jennie captivates in an unimaginable way. Bottomless, thrilling and balletic action just gets wilder and wilder and the stupendous end sequence in the church is definitely the craziest shoot-out in the history of movies and it's so cool I almost cry when I see it in an emotional moment. That's the magic of Woo. \"The Killer\" is a spectacular masterpiece! It's just perfect as hell and above any American film ever. John Woo's \"Bullet in the head\" (1990) is the only motion picture I know that gets higher than this in my book.",
         "There is no doubt in mind that \"The Killer\" is easily the MOST ARTISTIC ACTION FLICK in the world. Not only that, it's also the BEST ACTION-DRAMA film around! Directed by John Woo (now at his popular peak with \"M:I-2\" as his vehicle), \"The Killer\" tells the story of a professional killer (Chow Yun-Fat), a cop and a lady caught in crossfire. Chow Yun-Fat's act for his character is very solid, and at the same time he perfectly fits the action sequences. Also written by John Woo, you can clearly see many of The Master's trademarks like slow-motion action, stunts, deep characterization, drama, doves, two-fisted gunplay, and missing from his Hollywood flick...gore! This movie is full of blood and gore, and from my point of view it does not make the film dirty but rather more realistic and expressive. About the action, the level of violence is very high like that of the gore. Since this is a Hong Kong-made movie, Woo had all the freedom he wants and it clearly shows why this is considered by his millions of fans as their favorite Woo flick. Two-fisted gunplay is very well presented here. Seen Tom Cruise (M:I-2), Nicolas Cage (Face/Off), Christian Slater (Broken Arrow), Dolph Lundgren (Blackjack) and John Travolta (Face/Off) all fire with 2 guns each? Well, for newcomers here, two-fisted gunplay has gotten of to a great start even before Woo directed the above-mentioned Hollywood stars. Chow Yun-Fat's 2-gun firing is simply perfect and it shows! Chow is NO MARTIAL ARTIST or STUNTMAN like Jackie Chan, but his use of guns and acting makes him exceed with quality. Chow Yun-Fat was not even a popular action star before teaming with Woo. But Woo made the difference for him and Chow's image has gotten better since. John Woo's directing is really perfect. As mentioned above, he had all the creative freedom he wanted with this movie...something missing from his Hollywood films. \"The Killer\" is considered to be his biggest teamup with Chow. Woo is known to make non-action stars look great in action...Tom Cruise is a perfect example of this when he made \"M:I-2\". Contrary to popular belief among newcomers, \"The Killer\" is an ART FILM. Those newcomers who've seen \"M:I-2\" might think that this classic is another \"blockbuster\" or brainless-action film. Anyone who understands the link between action and art will easily recognize the greatness Woo made here. Eventually, YOU'LL CARE ABOUT THE CHARACTERS AS THE STORY MOVES ON. That said, the story is not about violence and money. The story presents CHARACTER, EMOTION, SORRY and HONOR. As a viewer, you should not just look at the action scenes, but you should concentrate on the story and characters within. My conclusion: \"The Killer\" is a PURE QUALITY MOVIE THAT NEEDS TO BE SEEN BY EVERYONE. Whether you're a casual movie fan, quality viewer, blockbuster lover or whatever type of viewer you are, \"The Killer\" is film excellence as long as the viewer understands it. Want the most artistic of action? REMEMBER THE KILLER!",
         "Of all John Woo's bullet-ridden action movies, this is his greatest. You see many of Mr. Woo's \"trademarks\" (flying doves, reflections in mirrors, very strong Catholic symbolism) that appear in his inferior American directed films (save Face Off) first in this Hong Kong cinema classic. Sure the violence is over the top, the plot only adequate, the sentimentalism a little thick. The actions scenes are filmed with such, I dare say beauty, that no Hollywood 'by the numbers' action film can possibly compete. While this film is not for the squeamish or those offended by excessive and rather graphic violence, if you are in any way a fan of action films - you mush see this movie (and many other John Woo directed films during his Hong Kong days, i.e. Hardboiled, A Better Tomorrow, etc).",
         "Chow Yun Fat and John Woo teams up together with strong commitment to this highly melodramatic action film. The Killer was so ahead of its time especially with its signature shootout scenes and fast paced action sequences in its time of production in Hong-Kong. Without any special, visual or sound effects; it's a high achievement on both sound and vision. It's high on thematic values, but low on production values. Woo benefited a lot from a team of action-coordinators as part of the production crew he assigned with. 20 years from its screen release, today still there are not many action films in which the sequences are coordinated as good as in The Killer. The rest of the production was standing by its plot, which becomes unbearable due to extremely melodramatic events. Woo tries to hurt our feelings as much as he can by killing and injuring innocents so ruthlessly: Passengers on a train, children on a beach, singers at a night club etc. Lowell Lo's heart-wrenching theme and background music was one of the finest of the thematic values. Story development is also very effective that everything seems going fine at the beginning of Jong(the hit-man)'s last mission, then for he wasn't paid for his successful assassination he decides to show up back from underground with his alias: \"Jeffrey\". When he did, a stage singer ends up losing her sight and becomes blind from shot blasting. Jong helps her get well; she falls in love with him. He introduces himself as Jeffrey to her. No matter what romance they share together, no matter how close they are to each other; there is absolutely no accordance no chemistry between Sally Yeh and Chow Yun-Fat. Sally Yeh acts so poorly, especially while she keeps screaming needlessly every other scene. For whoever likes this film, I strongly advise Léon to them. The same idea also works in Luc Besson's film, too: In a hit-man's life; there is no certain way to go, there is nobody to trust, there is no repentance. In Luc Besson's film of 1994, Jean Reno and Natalie Portman builds up a better harmony using emotions but not melodrama. Additionally in John Woo's film, even though Chow Yun-Fat is not fast enough he just stands by the bullets by running, or guards himself with armchairs and seats of the cathedral which are vulnerable to bullets with the gaps between backrests. So many bullets are used... Were they shot by children or blind hitmans? How could you explain not getting shot while 4 hitmans are aiming at you running inside the cathedral and running on the beach? On the other hand, every single bullet that's used in Léon, hurts one person or another; or leaves marks, tracks and holes on walls, and in the texture of the floor. It's not an acquirement to waste 10 thousand bullets in a movie; but it's really an achievement when you configure a sub-production plan just to preview and review the bullets in both pre-production and production."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Film Workshop",
         "Golden Princess Film Production Limited",
         "Long Shong Pictures"
      ],
      "summaries": [
         "A violent Hong Kong action film, this is the story of an assassin, Jeffrey Chow (aka Mickey Mouse) who takes one last job so he can retire and care for his girlfriend Jenny. When his employers betray him, he reluctantly joins forces with Inspector Lee (aka Dumbo), the cop who is pursuing him. Together, the new friends face the final confrontation of the gangsters out to kill them.",
         "Jeffrey is an assassin who wishes to leave the business so he can take care of Jennie, the beautiful lounge singer who he inadvertently blinded during a previous assignment. Li Ying is the determined cop who will stop at nothing to bring him in, only he realizes that Jeffrey is no ordinary assassin, and wishes to help him in his quest. Only problem is that Jeffrey's employers refuse to pay him for his last job, money which is needed to restore Jennie's eyesight.",
         "A warm-hearted hitman is forced to look after a nightclub singer when he accidentally blinds her during a gunfight. Meanwhile, a hot-shot detective and a ruthless mob are on his tail.",
         "A disillusioned assassin accepts one last hit in hopes of using his earnings to restore vision to a singer he accidentally blinded, only to be double-crossed by his boss."
      ],
      "budget": 0
   },
   "movielensId": 1218,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "日本語",
         "普通话"
      ],
      "releaseDate": "1989-07-06",
      "dvdReleaseDate": "2000-10-03",
      "directors": ["John Woo"],
      "runtime": 110,
      "movieId": 1218,
      "title": "The Killer",
      "mpaa": "R",
      "actors": [
         "Chow Yun-fat",
         "Danny Lee Sau-Yin",
         "Sally Yeh",
         "Paul Chu Kong",
         "Kenneth Tsang",
         "Shing Fui-On",
         "Tommy Wong",
         "James Ha",
         "Ricky Yi Fan-Wai",
         "Barry Wong",
         "Parkman Wong",
         "Teddy Yip Wing-Cho",
         "Alan Ng Siu-Hung"
      ],
      "imdbMovieId": "0097202",
      "originalTitle": "喋血雙雄",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["OXF0R4dcU5Y"],
      "plotSummary": "Mob assassin Jeffrey is no ordinary hired gun; the best in his business, he views his chosen profession as a calling rather than simply a job. So, when beautiful nightclub chanteuse Jennie is blinded in the crossfire of his most recent hit, Jeffrey chooses to retire after one last job to pay for his unintended victim's sight-restoring operation. But when Jeffrey is double-crossed, he reluctantly joins forces with a rogue policeman to make things right.",
      "tmdbMovieId": 10835,
      "avgRating": 4.04144,
      "releaseYear": "1989",
      "numRatings": 3065,
      "posterPath": "/8hTxlSqMAHBXAh1eB69ir0BXhzE.jpg"
   }
}