{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "role of women",
            "id": 2273
         },
         {
            "name": "ladykiller",
            "id": 2336
         },
         {
            "name": "success",
            "id": 3836
         },
         {
            "name": "ladies' man",
            "id": 6779
         },
         {
            "name": "chefin",
            "id": 7769
         },
         {
            "name": "casanova",
            "id": 8642
         },
         {
            "name": "womanizer",
            "id": 9094
         }
      ],
      "imdb_id": "tt0103859",
      "video": false,
      "title": "Boomerang",
      "recommendations": [
         9085,
         10411,
         11595,
         8860,
         12158,
         10136,
         9292,
         150,
         10396,
         11896,
         10859,
         10631,
         11384,
         6522,
         11517,
         11353,
         11566,
         11856,
         11821,
         11310
      ],
      "backdrop_path": "/jIh2qW2sz7ewmNgvMqUz6aHaa6Q.jpg",
      "revenue": 70100000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marcus Graham",
               "gender": 2,
               "credit_id": "52fe43ef9251416c75023893",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jacqueline 'Jackie / Jack' Broyer",
               "gender": 1,
               "credit_id": "52fe43ef9251416c75023897",
               "name": "Robin Givens",
               "profile_path": "/sFJW5HWMK2oEYES9f59DzdFPhVh.jpg",
               "id": 59153,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Angela Lewis",
               "gender": 1,
               "credit_id": "52fe43ef9251416c7502389b",
               "name": "Halle Berry",
               "profile_path": "/w7HRZh4UhimZO2F6GywkYhjgAX3.jpg",
               "id": 4587,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gerard Jackson",
               "gender": 2,
               "credit_id": "52fe43ef9251416c7502389f",
               "name": "David Alan Grier",
               "profile_path": "/5tkt3qRZTco4sz604aTIarQ0m8W.jpg",
               "id": 58563,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Strangé",
               "gender": 1,
               "credit_id": "52fe43ef9251416c750238d3",
               "name": "Grace Jones",
               "profile_path": "/8MBh8TXQYoEGHbyf7XKRbXH7kTA.jpg",
               "id": 10661,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Tyler",
               "gender": 2,
               "credit_id": "52fe43ef9251416c750238cf",
               "name": "Martin Lawrence",
               "profile_path": "/uBVQuIdS3wGCpYaZFEeKZBuiZ2l.jpg",
               "id": 78029,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Nelson",
               "gender": 2,
               "credit_id": "549537f9c3a3681153001da4",
               "name": "Geoffrey Holder",
               "profile_path": "/bmNg7Ld2H1V3Sqz2PmxvOJOof8z.jpg",
               "id": 10225,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Lady Eloise",
               "gender": 1,
               "credit_id": "52fe43ef9251416c750238d7",
               "name": "Eartha Kitt",
               "profile_path": "/orRADHGrQwUD2H9eUcFA8wDbYNH.jpg",
               "id": 70243,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Bony T",
               "gender": 2,
               "credit_id": "52fe43ef9251416c750238df",
               "name": "Chris Rock",
               "profile_path": "/5JCYKerIL0SdiqygtLUpG9Sw37P.jpg",
               "id": 2632,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Yvonne",
               "gender": 1,
               "credit_id": "52fe43ef9251416c750238db",
               "name": "Tisha Campbell-Martin",
               "profile_path": "/8nfymZ8Ohi7P5mNGOMddRmm5pgF.jpg",
               "id": 141823,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "Christie",
               "gender": 1,
               "credit_id": "52fe43ef9251416c750238c7",
               "name": "Lela Rochon",
               "profile_path": "/9DBu3r5O4fBosSS4FnSzFCVpm0O.jpg",
               "id": 51359,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Todd",
               "gender": 0,
               "credit_id": "549537d492514130fc002094",
               "name": "John Canada Terrell",
               "profile_path": null,
               "id": 1341524,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Mr. Jackson",
               "gender": 2,
               "credit_id": "52fe43ef9251416c750238e3",
               "name": "John Witherspoon",
               "profile_path": "/mlrxal9uTk2h6i0suarNOyYGiTN.jpg",
               "id": 56902,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ef9251416c750238a5",
               "name": "Reginald Hudlin",
               "profile_path": "/jMos9yMWnCBVLE4F83Yt06CRYbI.jpg",
               "id": 68215,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ef9251416c750238ab",
               "name": "Barry W. Blaustein",
               "profile_path": "/gxV95QsO45TyPSFw9wnfk9U8L79.jpg",
               "id": 57328,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ef9251416c750238b1",
               "name": "Brian Grazer",
               "profile_path": "/yqiKX3auDuorea0BOtuB6Ifhyp6.jpg",
               "id": 339,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ef9251416c750238b7",
               "name": "Marcus Miller",
               "profile_path": "/fKurcCwpm46x6AZBXFP6fAzx9C2.jpg",
               "id": 63976,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ef9251416c750238bd",
               "name": "Woody Omens",
               "profile_path": null,
               "id": 56943,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ef9251416c750238c3",
               "name": "John R. Carter",
               "profile_path": null,
               "id": 8582,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.119835,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11066,
      "vote_count": 172,
      "budget": 40000000,
      "overview": "Marcus is a successful advertising executive who woos and beds women almost at will. After a company merger he finds that his new boss, the ravishing Jacqueline, is treating him in exactly the same way. Completely traumatised by this, his work goes badly downhill.",
      "similar": [
         2567,
         3902,
         10720,
         10765,
         1088,
         5259,
         9422,
         10164,
         11936,
         5724,
         5182
      ],
      "original_title": "Boomerang",
      "runtime": 117,
      "poster_path": "/cc9YAZq5NXiIEJsHjW7p2FaHQkp.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1992-06-30",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A Player Who's About to be Played.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Reginald Hudlin"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "Eddie Murphy",
         "Barry W. Blaustein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1NTk3NTkzNl5BMl5BanBnXkFtZTcwNTk4MjAzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Eddie Murphy, Robin Givens, Halle Berry | See full cast and crew »"],
      "reviews": [
         "After a terrible 1991 loanout to Hollywood Pictures for the weak comedy \"The Distinguished Gentleman\", Eddie Murphy returned to Paramount the following year and gave one of his all time best and funniest performances in this romantic comedy with a twist. Murphy portrays Marcus Graham, a New York advertising executive who is known by many people throughout New York for being a notorious player, a man who will date a woman, get her into bed by the end of the first date, judge her by the lovemaking and then dump her. Marcus is quite happy with having this rather low lifestyle and way of treating women. He goes around proudly reporting the previous night's results each morning to his friends (David Alan Grier, Martin Lawrence). One day, an attractive young woman (Robin Givens) becomes the advertising company's new boss. Marcus naturally feels that she will be his next target for romantic using and gets more than he ever bargained for when she winds up being the first woman ever who can see through his tricks and try to get back at him for it (hence the title). Murphy is absolutely hilarious in his role as a player who gradually learns to get lessons in treating women right and Halle Berry has a early leading film part as another work colleague who eventually comes between the Murphy/Givens love affair. Several other popular character actors and actresses make appearances here too.",
         "Reginald Hudlins Boomerang is probably Eddie Murphy last good film to date. In this story of a marketing executive who is also a player. Murphy is great in this role, funny and full of hilarious one-liners. The film is written well, very funny, direction is decent and acting is good for the most part. Although Givens is not the best female lead, Halle Berry was great in her role. Martin Lawrence and Chris Rock were absolutely hilarious, and David Alan Grier was good as well. The film is not to be taken to seriously, and although not at the caliber of Murphy favs of mine \"coming to America\" and \" beverly hills cop\", Boomerang is still a must-see for any Eddie Murphy fan. 8/10",
         "This film may have it's problems, and apparently many people saw them first hand and stayed away from the film. And I have to admit that the first time I saw this film I wasn't too enthused with it. But after I saw it a second time I fell in love with it and I now own it on video and have seen it quite a few more. And the reason is simple. First of all it is an excellent romance. Eddie really surprised me with his ability to write a story that actually had me touched. He is especially good as a player who gets played but actually falls in love. Murphy has shown a different side to him here and it is also one of his funnier films in quite some time. He is assisted in the comedy department here by two very funny guys, David Allan Grier and Martin Lawrence, the latter stealing every scene he is in. Martin Lawrence has never been as funny as he was in this film. He was great in Bad Boys, but his supporting turn here as Gerard is a classic. There is a true camaraderie here between the three friends (Murphy, Lawrence and Grier) and their conversation and actions around one another has the easy flow that longtime friends exhibit. They play jokes on each other, they make fun of each other and they are supportive of one another. But Lawrence has all the funny lines. From burning his dinner when his friends come over, to his hilarious observations about racism (the game of pool is racist because the white ball knocks the **** out of all the coloured balls, including the black one) to defending his unfortunate lack of lovemaking in the last few years, his interpretation of Tyler is just perfect. Boomerang is also blessed with a truly mellifluous soundtrack. With P.M. Dawn and Boyz To Men, among many of the stars, lending tracks to the film, it reminds me of the soundtrack to Last American Virgin in the sense that there are so many of today's superstars of music on the soundtrack. With Babyface producing, this is another winning production from him. Boomerang solidifies Eddie Murphy's return to the king of comedy. He did rebound nicely after this film and it is good to see him going back to what he knows. A very, very funny film. 9/10",
         "One of Eddie Murphy's best performances in one of his least seen films was the 1992 winner BOOMERANG. This smart and sophisticated romantic comedy stars Eddie as Marcus Graham, a womanizing advertising executive who loves the thrill of the chase where women are concerned, but once he has completed the chase, he is ready to move on. His sexual exploits have made him the center of his circle of friends (Martin Lawrence, a paranoid racist, and David Alan Grier, an insecure milquetoast)who live vicariously through him and admire his style as the ultimate player. Everything changes for Marcus when he acquires a new boss named Jacqueline (Robin Givens), Marcus is enamored of Jacqueline, but is completely thrown by the fact that Jacqueline is a female version of himself, a player who avoids commitment and uses Marcus when it is convenient for her. Throw into the mix another co-worker of Marcus named Angela (Halle Berry) who is nuts about him, but he doesn't know she's alive. Everything works here and it is so refreshing to see a movie with a predominately black cast where the characters are people with brains and real jobs. Murphy exudes mass amounts of sex appeal in one of his best roles and Halle Berry, though allegedly playing a plain Jane, just couldn't come off that way if she tried. There are some wonderful comic bits contributed along the way by Grace Jones, Geoffrey Holder, Tisha Campbell, and the legendary Eartha Kitt, memorable as an aging cosmetics queen with the hots for Marcus. A winning and original take on the Battle of the Sexes that is entertaining from start to finish.",
         "Boomerang was Murphy's last good film before he hit his slump. The film directed by Reginald Hudlin gave Murphy the chance to spit many one-liners and the chance for us to see two people who would be big ten years later Martin Lawerence and Halle Berry. If you've never seen this film check it out for some good laughs.",
         "A marketing executive quickly learns that what comes around, goes around when this Don Juan's new boss turns out to be a Don Juan-ita. Eddie Murphy gives the finest performance of his career as Marcus, a player who meets his match with Robin Givens, but finds love in Halle Berry. Murphy barely drops the F-bomb in the film and the character is well developed by Murphy himself, who had a hand in the writing credits for the film. A fun film that features a great supporting cast of David Allen Grier, Martin Lawrence and John Witherspoon.",
         "Boomerang is a very mediocre movie with a storyline that never really goes anywhere or gets very interesting but a good comedic cast.I felt like they thought they were being a very different and unique romantic comedy,and while it isn't like any other one I've seen,thats not particularly a good thing.It goes on for way longer than it needs to and I didn't feel a lot of sympathy towards Eddie Murphys character,which is difficult because we follow him for the whole film and are expected to like and feel sorry for him.The best parts were the scenes between Eddie Murphy,David Alan Grier and Martin Lawrence,they seemed to enjoy each others company and clearly got to improvise their lines together,which was great because the scripted scenes are not very funny.It has some good moments,but Boomerang dosen't succeed very much as either a comedy or romance and I wouldn't recommend it to anyone. An ambitious,womanizing ad executive meets his match when he gets involved with three different women. Best Performance: Eddie Murphy Worst Performance: Eartha Kitt If you have any recommendations on films/TV series I should watch or review,or any questions to ask me,just tweet me @DillonTheHarris",
         "Having only heard and seen clips of this movie for the last 20 years, I finally watched Boomerang on Netflix Streaming just now. Once again, Eddie Murphy got together with his writers from \"Saturday Night Live\"-Barry W. Blaustein and David Sheffield-and made another romantic comedy that turned out to be a success like their previous one in Coming to America. And once again, they got a fine supporting cast accompanying them like Lela Rochon (having previously appeared in Murphy's Harlem Nights), Robin Givens, Martin Lawrence, David Alan Grier, Chris Rock, Grace Jones, Eartha Kitt and a newcomer named Halle Berry. Oh, and Tisha Campbell also appeared before her teaming with Lawrence in his upcomimg series \"Martin\". This time the director picked was Reginald Hudlin with his brother Warrington as co-producer after their success with their debut feature House Party. Like Coming to America, this was a nice change of pace for Murphy from his previous wise-ass characters but with both funny and touching scenes. Really, I had a good time watching this. So on that note, I highly recommend Boomerang. Oh, and the person who played a commercial editor looked familiar so I looked at the cast list and found out he was played by the one and only Melvin Van Peebles!",
         "Man has this movie aged well. Boomerang was crass, raunchy, vulgar and funny as hell to boot. It was Eddie Murphy in top form just the way we like him. Plot/story: Marcus Graham(Eddie Murphy) is a marketing executive with a player mentality who meets his match with a gorgeous boss by the name of Jacqueline(Robin Givens). Marcus eventually tries to cope after getting p-whipped and played by Jacqueline. Opinion: Boomerang was funny as hell back then as it is funny now. The interactions between Eddie Murphy, David Alan Grier and Martin Lawrence characters are funny as hell. Grace Jones's character Strange' is a riot. I still lmao at the restaurant scene where Strange' loudly proclaims her favorite part of the female anatomy 20 times in front of everybody. Eartha Kitt's Lady Eloise is a hoot also. John Weatherspoon is just as funny as David Alan Grier's character's father. Boomerang works because it doesn't just rely on the comics being funny alone(like most comedies do). Its material is funny in its raunchiness and the chemistry between everybody works. I would strongly recommend this movie any day over the recent busts that Eddie Murphy has starred in. 5 stars. Rest In Peace Eartha Kitt.",
         "Marcus is a player who woos and beds women with great ease \u0096 but never settles down with any. When a company merger sees him working for the glamorous Jacqueline, he finds himself being played but still falling for her. However a relationship with the more stable Angela beckons if he can change his ways \u0096 but will Jackie allow him to leave her? Part of the Eddie Murphy come back after the years of Harlem Nights, Golden Child, Another 48 hours, BHC 2 and other weak films. This and the Distinguished Gentleman saw him try to come back with a fresh approach. Boomerang is a good film \u0096 it uses Murphy's playa persona and turns it on it's head to good effect. True some of it is plain silly and it is quite predictable but it is pretty enjoyable and quite sexy too! Murphy is good simply because he is the butt of many of the jokes via his playa image \u0096 plus it's good to see him be outdone after so many big-headed films. Givens is very good as the man-eating boss but I found Berry to be too sweet to be believed \u0096 but though she was the better looking. Lawrence and Rock are well used in small roles but Kitt and Grace are pointless and stupid cameos. Witherspoon is very funny and I personally love to see Lela Rochon in anything (and those aren't her feet). Overall it may not win any awards or being shockingly innovative but it's fun, sexy and has a good bagfull of laughs in there."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Imagine Films Entertainment",
         "Eddie Murphy Productions"
      ],
      "summaries": [
         "Marcus is a successful advertising executive who woos and beds women almost at will. After a company merger, he finds that his new boss, the ravishing Jacqueline, is treating him in exactly the same way. Completely traumatized by this, his work goes badly downhill. But then Jacqueline's more quietly attractive assistant, Angela, who has been dating Marcus' best friend, shows herself more than a little concerned by his parlous state.",
         "A successful executive and womanizer finds his lifestyle choices have turned back on him when his new female boss turns out to be an even bigger deviant then he is."
      ],
      "budget": 40000000
   },
   "movielensId": 122,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1992-06-30",
      "dvdReleaseDate": "2002-09-24",
      "directors": ["Reginald Hudlin"],
      "runtime": 117,
      "movieId": 122,
      "title": "Boomerang",
      "mpaa": "R",
      "actors": [
         "Eddie Murphy",
         "Robin Givens",
         "Halle Berry",
         "David Alan Grier",
         "Grace Jones",
         "Martin Lawrence",
         "Geoffrey Holder",
         "Eartha Kitt",
         "Chris Rock",
         "Tisha Campbell-Martin",
         "Lela Rochon",
         "John Canada Terrell",
         "John Witherspoon"
      ],
      "imdbMovieId": "0103859",
      "originalTitle": "Boomerang",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["Sr60MOJ_fhc"],
      "plotSummary": "Marcus is a successful advertising executive who woos and beds women almost at will. After a company merger he finds that his new boss, the ravishing Jacqueline, is treating him in exactly the same way. Completely traumatised by this, his work goes badly downhill.",
      "tmdbMovieId": 11066,
      "avgRating": 2.86345,
      "releaseYear": "1992",
      "numRatings": 4090,
      "posterPath": "/3dDufFHAuVXpfMdXkDUC0M0Y5TL.jpg"
   }
}