{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "moon",
            "id": 305
         },
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "missile",
            "id": 2534
         },
         {
            "name": "cheese",
            "id": 2836
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "ski",
            "id": 195732
         }
      ],
      "imdb_id": "tt0104361",
      "video": false,
      "title": "A Grand Day Out",
      "recommendations": [
         532,
         531,
         14447,
         533,
         13930,
         11898,
         13062,
         13925,
         14320,
         54825,
         13396,
         53210,
         10437,
         13926,
         67409,
         44333,
         53211,
         11533,
         211798,
         194113
      ],
      "backdrop_path": "/1ZeURMZP7GdKWhwK142IuGqGUZH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 3,
            "character": "Wallace (voice)",
            "gender": 2,
            "credit_id": "52fe424ec3a36847f8013dcb",
            "name": "Peter Sallis",
            "profile_path": "/8vMFK2SJFzQbtEIj4FU7adyhCGM.jpg",
            "id": 7317,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013dc1",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013dc7",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013dd1",
               "name": "Rob Copeland",
               "profile_path": null,
               "id": 7656,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013dd7",
               "name": "Julian Nott",
               "profile_path": null,
               "id": 7657,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013ddd",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013de3",
               "name": "Rob Copeland",
               "profile_path": null,
               "id": 7656,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013de9",
               "name": "Danny Hambrook",
               "profile_path": null,
               "id": 7658,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013def",
               "name": "Danny Hambrook",
               "profile_path": null,
               "id": 7658,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013df5",
               "name": "Adrian Rhodes",
               "profile_path": null,
               "id": 7659,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013dfb",
               "name": "Adrian Rhodes",
               "profile_path": null,
               "id": 7659,
               "department": "Sound",
               "job": "Sound Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 9.5496,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 530,
      "vote_count": 254,
      "budget": 0,
      "overview": "Wallace and Gromit have run out of cheese and this provides an excellent excuse for the animated duo to take their holiday on the moon, where, as everyone knows, there is ample cheese. The moon is inhabited by a mechanical caretaker, who is not too happy about the two visitors from earth that nibble on the moon.",
      "similar": [
         62,
         157336,
         10681,
         330459,
         7453,
         9928,
         10679,
         9598,
         19,
         126889,
         10345,
         2665,
         811,
         19761,
         532,
         531,
         10063,
         66125,
         10710,
         47354
      ],
      "original_title": "A Grand Day Out",
      "runtime": 23,
      "poster_path": "/2Lcpn1Q3Fxwb7ZHy8UTFhogWhR2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ykJbf1z5qIreJrHWfnh1ev1alkD.png",
         "name": "Aardman Animations",
         "id": 297,
         "origin_country": "GB"
      }],
      "release_date": "1990-05-18",
      "vote_average": 7.4,
      "belongs_to_collection": {
         "backdrop_path": "/huyrvVKEKa9czUY89fnvaAVAtkX.jpg",
         "name": "Wallace & Gromit Collection",
         "id": 529,
         "poster_path": "/993pCCMO9g9RQUtNDxQgE1B330H.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.wallaceandgromit.com/films/a-grand-day-out",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Park"],
      "runtime": 23,
      "synopsis": null,
      "writers": ["Nick Park"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104361/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2ODgyNDY1Ml5BMl5BanBnXkFtZTcwMDY3ODMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Sallis | See full cast and crew »"],
      "reviews": [
         "In this Wallace and Gromit short, the clay twosome voyage to the moon in order to replenish their cheese supplies. They also learn that traffic wardens have dreams too. This is stylish and funny and will leave you wanting to see more. To my mind, this is the best W&G outing. Let me explain. I agree that the characters are not as developed as they were in 'The Wrong Trousers' or 'A Close Shave' and also the plot is weaker. Some of the models are not as refined as they came to be (this is after all the first W&G film). What it has that the other W&G offerings lack is that feeling of sadness and mood that the 'The Wrong Trousers' and 'A Close Shave' replace with story telling. This is closer to Tom and Jerry than it is to Chicken Run. It has laughs sure, but the feeling I have when the credits role is of one of wistfulness and a slight melancholy. Not bad for 20 minutes of plasticine animation! See this Wallace and Gromit, then move onto the others asap.",
         "Wallace and Gromit are a phenomenon. How many stop motion animation films win Oscars, top the US and UK box office charts etc. But all that came later. A Grand Day Out was the first Wallace and Gromit film. Low budget. More or less a graduation piece. Of course the animation is less sophisticated than in the later films. Of course the plot is a little shallow. The entire story is designed to minimise the need for sophisticated animation and to maximise the excuse for shortcomings (perhaps dogs and people would move a bit like that on a cheese moon). Yet it is extraordinary to see how much of the Aardman genius is already there in this short film. Hilarious and clever references to other films. Mice in shades for take off. The rocket handbrake gag. Coin-operated machine gags (brilliantly recycled in Were-Rabbit BTW). And a machine (is it an Aga?) that daydreams about skiing when it sees Wallace's holiday magazines. Of course TWT, ACS and Were-Rabbit are better movies, but this film is so worth seeing as a sign of early genius and indeed in its own right as a crude but wonderful animated film.",
         "Nick Park has created such funny characters with Wallace and his faithful dog Gromit. This time, they run out of cheese and decide to get it on the moon, as 'everybody knows it's made of cheese'. They make their own spaceship and finally make it to the moon, where the cheese doesn't really taste like anything and they have an encounter with a local robot, whose secret dream is it to ski (as we see in a lovely dream sequence with the W&G theme playing on the background, loved that!). This short picture is so funny, I can recommend it to anyone. Maybe not as much though as the even more brilliant 'The Wrong Trousers'... oh heck, what am I talking, watch all the W&G right now! You'll be glad you did. 8/10.",
         "Although A Grand Day Out is arguably the weakest of the three existing Wallace and Gromit films, it's still very funny, and very entertaining. This was my first W and G experience. I heard the uncontrolled sounds of hysterical laughter from my family in the next room as a refrigerator on the moon dreamt of skiing down slopes (don't ask, watch.) Everyone, from ages 3-103 will be at least slightly amused by any W and G skit. I also recommend A Close Shave and The Wrong Trousers, which won an Academy Award for Best Animated Short Film.",
         "This short was nominated for the Academy Award. It introduces us to Wallace and Gromit. Interestingly, the stars are less appealing than one of the supporting characters: the little whatever-it-is they run into on their jaunt to the moon for cheese. This little critter apparently wants to be Jean-Claude Killy when it grows up. The best parts of a very fine short are with this odd little entity, whatever it happens to be. Fine beginning to a great series that's gotten better as it goes along. Recommended to those few souls who haven't seen it yet.",
         "This movie was great. I have been watching Wallace and gromit ever since i was little and i have always loved it. It is very cute. Also, very funny. It is amazing how they make the movie. It is one of my favorite movies and everyone should watch it. It is not only for little kids, but for adults to. This movie is interesting. It makes you feel very good. I loved this movie and everyone else will. Gromit may not talk, but it is amazing because you always know what he is thinking. It is mostly because of his eyebrow. He uses his eyebrow to show his emotions. Wallace and Gromit seem to be best friends and they always will be.",
         "Together with 'Wallace & Gromit: A Close Shave' and 'Wallace & Gromit: The Wrong Trousers' this is one of the funniest things I have seen. The clay animation looks great, the stories are very ingenious and the jokes are great. If you get a chance to see this, please do it. You will have a great time. I have to say that both 'A Close Shave' and 'The Wrong Trousers' are better than this one, but you will still have a great time watching this one.",
         "\"Gromit, we've forgotten the crackers!\" Wallace and Gromit are very funny, very cute little claymation characters that go on adventures so that everybody can have a good time. In this short, they go to the moon, because everyone knows it's made out of cheese, and cheese is what they want. When they get there, it's a bit different than they expected, but that doesn't stop them from exploring around and running into a little mischief with a robot thing that happens to be left there (and take Earthling money, too...). It's quite a charming little duo, this Wallace and Gromit. Wallace is the inventor with a smile on his face and the plans to do whatever he fancies, while Gromit is his concerned protector, chasing after him to make sure his master is okay. The claymation is of the finest sort, with their expressions perfect and a lot of depth to their eyes. Just remember: don't forget the crackers. --PolarisDiB",
         "Wallace and Gromit claymation shorts are always based on inventive ideas and that's where most of the appeal comes from. Look at 'The Wrong Trousers,' for example, where Wallace and Gromit are held hostage by a fugitive sheep. Here, Wallace and Gromit are on holiday, so they travel to the moon, because they were all out of cheese. And, as you know, the moon is made of cheese. So, the pair build a spaceship and prepare for travel. When they get there, they're entertained by a strange, lonely little robot man, whom they share a space adventure with. Like all Wallace and Gromit shorts, Wallace is usually preoccupied and oblivious to the trouble at hand (he's searching for some delicious cheese here), while Gromit has to protect him and save the day (Wallace usually notices when it's too late). If you have seen any of the other Wallace and Gromit shorts and enjoyed them, you're sure to enjoy this creative little adventure as well. It's always a hilarious trip.",
         "Wallace And Gromit are excellent! The film is great, it's got some excellent comedy in the film. The story is a quite odd one, but nonetheless it's great. You can't take a short film like this seriously, it's all in good fun. I think Nick Park and his crew did an excellent job with this film. I would definitely recommend this film to anyone and everyone, besides, it's only 20 minutes or so. After you watch this film, be sure to check out the other Wallace and Gromit films. If you really like this film and the others, be sure to check out \"Chicken Run\". Hope you enjoy the film, thanks for reading, -Chris"
      ],
      "genres": [
         "Animation",
         "Short",
         "Adventure",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Aardman Animations",
         "National Film and Television School (NFTS)"
      ],
      "summaries": ["Wallace and Gromit have run out of cheese and this provides an excellent excuse for the animated duo to take their holiday on the moon, where, as everyone knows, there is ample cheese."],
      "budget": 0
   },
   "movielensId": 1223,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-05-18",
      "dvdReleaseDate": "1996-10-15",
      "directors": ["Nick Park"],
      "runtime": 23,
      "movieId": 1223,
      "title": "A Grand Day Out",
      "mpaa": "NR",
      "actors": ["Peter Sallis"],
      "imdbMovieId": "0104361",
      "originalTitle": "A Grand Day Out",
      "genres": [
         "Adventure",
         "Animation",
         "Comedy",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["ablYsAGtuSM"],
      "plotSummary": "Wallace and Gromit have run out of cheese and this provides an excellent excuse for the animated duo to take their holiday on the moon, where, as everyone knows, there is ample cheese. The moon is inhabited by a mechanical caretaker, who is not too happy about the two visitors from earth that nibble on the moon.",
      "tmdbMovieId": 530,
      "avgRating": 4.00534,
      "releaseYear": "1990",
      "numRatings": 9172,
      "posterPath": "/yfQNvSA0xIFWzJRFgp7sdOMBLHq.jpg"
   }
}