{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "ex-girlfriend",
            "id": 1595
         },
         {
            "name": "drug smuggle",
            "id": 3391
         },
         {
            "name": "girlfriend",
            "id": 5490
         },
         {
            "name": "snack bar",
            "id": 6618
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "hong kong",
            "id": 12354
         },
         {
            "name": "pineapple",
            "id": 180294
         },
         {
            "name": "expiration date",
            "id": 185265
         },
         {
            "name": "flight attendant",
            "id": 185266
         }
      ],
      "imdb_id": "tt0109424",
      "video": false,
      "title": "Chungking Express",
      "recommendations": [
         11220,
         18311,
         18329,
         843,
         844,
         40751,
         24163,
         25538,
         3782,
         45706,
         16672,
         5910,
         108,
         109,
         14537,
         110,
         2000,
         36265,
         16642,
         1600
      ],
      "backdrop_path": "/o45YcrzLOuPmKS0hA3BuECFeATz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Woman in blonde wig",
               "gender": 1,
               "credit_id": "52fe43f89251416c75024925",
               "name": "Brigitte Lin",
               "profile_path": "/t1rhY7b63WaZ3FuajV5CQLCgiNR.jpg",
               "id": 56830,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Policeman 663",
               "gender": 2,
               "credit_id": "52fe43f89251416c75024929",
               "name": "Tony Leung Chiu-Wai",
               "profile_path": "/xSEwMBLHdiKjyG4YVCsjpaT5fgD.jpg",
               "id": 1337,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Faye",
               "gender": 1,
               "credit_id": "52fe43f89251416c7502492d",
               "name": "Faye Wong",
               "profile_path": "/ilh67E59qUrPQp8vATq0AY2YYPj.jpg",
               "id": 12671,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "He Zhiwu, Cop 223",
               "gender": 2,
               "credit_id": "52fe43f89251416c75024931",
               "name": "Takeshi Kaneshiro",
               "profile_path": "/ci0hluuIRGFGqSDp2kkqXczvywD.jpg",
               "id": 43661,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Air Hostess",
               "gender": 0,
               "credit_id": "52fe43f89251416c75024935",
               "name": "Valerie Chow",
               "profile_path": "/x8iHKdwsgrnPkMu7APjZnGD9rcP.jpg",
               "id": 119875,
               "order": 4
            },
            {
               "cast_id": 29,
               "character": "Owner of eatery",
               "gender": 0,
               "credit_id": "573409b6c3a3681e3d00062f",
               "name": "Piggy Chan",
               "profile_path": "/gCl0Unlf3o4zdoa8hymOmqGrYAE.jpg",
               "id": 1618663,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "May",
               "gender": 0,
               "credit_id": "52fe43f89251416c7502493d",
               "name": "Kwan Lee-Na",
               "profile_path": null,
               "id": 119877,
               "order": 6
            },
            {
               "cast_id": 30,
               "character": "K store clerk",
               "gender": 0,
               "credit_id": "57340a5cc3a3681eb6000535",
               "name": "Wong Chi-Ming",
               "profile_path": null,
               "id": 1618664,
               "order": 7
            },
            {
               "cast_id": 31,
               "character": "Replacement for Cop 663",
               "gender": 0,
               "credit_id": "57340a73c3a3682a180016d8",
               "name": "Leung San",
               "profile_path": null,
               "id": 1407506,
               "order": 8
            },
            {
               "cast_id": 32,
               "character": "Stewardess' new boyfriend",
               "gender": 2,
               "credit_id": "57340a9dc3a36850cd00152f",
               "name": "Rico Chu Tak-On",
               "profile_path": "/rtfbtYb7yLaMsSvBg5cPwAJWlH0.jpg",
               "id": 1591060,
               "order": 9
            },
            {
               "cast_id": 28,
               "character": "Complaining Customer (Uncredited)",
               "gender": 1,
               "credit_id": "54f0983ac3a3686d58008020",
               "name": "Lynne Langdon",
               "profile_path": null,
               "id": 68560,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "Bar Maid (Uncredited)",
               "gender": 1,
               "credit_id": "54f0981a92514179710083c7",
               "name": "Vickie Eng",
               "profile_path": "/tMOywh9r30ZQBYNS8OGeqRjvfDj.jpg",
               "id": 208316,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c750248f7",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c750248fd",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c75024903",
               "name": "Michael Galasso",
               "profile_path": null,
               "id": 12454,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c75024909",
               "name": "Roel A. García",
               "profile_path": null,
               "id": 68029,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c7502490f",
               "name": "Christopher Doyle",
               "profile_path": "/u7xRErdN6ya9qzOG8PVa2QshZFC.jpg",
               "id": 1357,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c75024915",
               "name": "Andrew Lau",
               "profile_path": "/7jPFuUNPJp09XKPRBjudYy6TIRx.jpg",
               "id": 65994,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c7502491b",
               "name": "Hai Kit-Wai",
               "profile_path": null,
               "id": 68030,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c75024921",
               "name": "Eric Kwong",
               "profile_path": null,
               "id": 64490,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c75024943",
               "name": "Jeffrey Lau",
               "profile_path": "/uyHSy9QyXb9pwZPG2Rd4jI7fPIV.jpg",
               "id": 57617,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c75024949",
               "name": "William Chang",
               "profile_path": "/u1rSUvhCQSo0z7bPaDoi1pyntFb.jpg",
               "id": 45818,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c7502494f",
               "name": "Yi-kan Chan",
               "profile_path": null,
               "id": 1117959,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c75024955",
               "name": "Pui-wah Chan",
               "profile_path": null,
               "id": 987991,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c75024967",
               "name": "Frankie Chan Fan-Kei",
               "profile_path": "/jQ2wfYUiG5IGEB1eC5BmNxayBCJ.jpg",
               "id": 1011224,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 10.134167,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 11104,
      "vote_count": 302,
      "budget": 0,
      "overview": "Two melancholy Hong Kong policemen fall in love: one with a mysterious female underworld figure, the other with a beautiful and ethereal server at a late-night restaurant he frequents.",
      "similar": [
         435126,
         8669,
         179826,
         3309,
         168055,
         227961,
         84333,
         37178,
         171248,
         52345,
         286071,
         18377,
         44125,
         175193,
         121493,
         34474,
         53879,
         327312,
         253283,
         48658
      ],
      "original_title": "重慶森林",
      "runtime": 102,
      "poster_path": "/yQUjZTzwgskqOJdr3jhwQ4yTkvb.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Jet Tone Production",
         "id": 540,
         "origin_country": ""
      }],
      "release_date": "1994-07-14",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "What a difference a day makes",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kar Wai Wong"],
      "runtime": 98,
      "synopsis": "The movie comprises two different stories, told one after the other, each about a romance involving a policeman. Aside for a brief moment when the first story ends and the second begins, the two stories do not interconnect. However, the three main characters from the second story each momentarily appear during the first. First story The first story concerns Taiwan-born cop He Qiwu, also known as Cop 223 (played by Kaneshiro). Qiwu's girlfriend May broke up with him on April 1 (April Fool's Day). His birthday is May 1 and he chooses to wait for May for a month before moving on. Every day he buys a tin of pineapple with an expiration date of May 1. By the end of this time, he feels that he will either be rejoined with his love or that it will have expired forever. Meanwhile, a woman in a blonde wig (played by Brigitte Lin) tries to survive in the drug underworld after a smuggling operation goes sour. On May 1, Qiwu, looking for romance, approaches the woman in the blonde wig at a bar (the Bottoms Up Club). However, she is exhausted and falls asleep in a hotel room, leaving him to watch movies alone. She leaves in the morning and shoots the drug baron (played by Thom Baker) who had set her up. Qiwu goes jogging and receives a message from her on his pager wishing him a happy birthday. He then visits his usual snack food store where he collides with a new staff member, Faye. At this point, a new story begins. Second story In the second story, the unnamed Cop 663 (played by Tony Leung) is similarly dealing with a breakup, this time from a flight attendant (Valerie Chow). He meets Faye, the new girl at the snack bar (played by Faye Wong). She falls for him in secret, and frequently breaks into his apartment during the day to redecorate and \"improve\" his living situation. Gradually, her ploys help Cop 663 to cheer up, and he eventually realises that Faye likes him and arranges a date at the restaurant 'California'. However, Faye stands him up after a last-minute decision to see the world before settling down; she leaves him a fake boarding pass with a date a year from now. In the last scene, Faye arrives back in Hong Kong, now a flight attendant; she finds that Cop 663 has bought the snack bar and is converting it into a restaurant. Their future however always remains ambivalent.",
      "writers": ["Kar Wai Wong"],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0109424/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5MTc3NDE2MV5BMl5BanBnXkFtZTcwMDM5MTk5MQ@@._V1_SY317_CR21,0,214,317_AL_.jpg",
      "actors": ["Stars: Brigitte Lin, Takeshi Kaneshiro, Tony Chiu Wai Leung | See full cast and crew »"],
      "reviews": [
         "Every day we interact with people. Within the course of 24 hours we can influence someone's life (for better or worse) so deeply that they will never forget us. Is it possible that the next person you fall in love with could be a notorious heroin smuggler or the counter girl at the express luncheonette counter? Wong Kar-Wai, the writer/director of Chungking Express seems to think so. The film is broken into two tales. The first story is mainly about the sadder side of love. Love comes and brings us light and joy, but it also goes and leaves us feeling empty and needing fulfillment. The two main characters in this half of the film, a police officer played dolefully by Takeshi Kaneshiro, and a heroin smuggler played icily by Bridgitte Lin, interact for only ten percent of the story, but their meeting leaves them both with memories that will last life time. The story ends on a high note that shows us that a simple act of kindness can bring the most unreceptive people to appreciate the beauty hidden in life. The second (and far stronger) story centers around two people and their interaction at a fast food counter in the Kwaloon section of Hong Kong. Tony Leung plays the part of a rejected lover perfectly and gives of the air of being sad without ever really being pathetic. Faye Wang's quirky portrayal of the free-spirited counter girl who helps Leung forget about his ex-girlfriend, is exactly what the film needed to counter-balance its darker first half. These characters and their bizarre relationship illustrates that love can manifest itself in any number of ways, many of them unconventional. The mechanism that allows these seemingly disjointed stories together is the camera work. Wong Kar-Wai uses a decidedly unique filming technique for much of the first half of the film; a blurry hand-held technique (think Blaire Witch on drugs) used during the chase scenes. The recurring style in the second half is a time-lapse type shot with people around the main subjects moving very fast and the subjects themselves moving in slow motion (a really cool effect). The camera styles add a common surreal element to each of the stories, while still keeping them somewhat independent. Perhaps the most striking element of the film is the interconnectedness of the characters and situations. There are many establishing shots showing characters inhabiting the same places at different times, and even the same places at the same times without noticing each other. This style of filming can alter the viewer's perception of reality, daring us to believe that we are all extras in somebody else's movie.",
         "I love this film. There, that is as simple as I can make it out. I am not going to go into any details about the plot (some people have accused it of not having one)or what takes place in the film, just want to say that this is the real deal. A film about love that is mired in reality (though shot through the lens of alcehmist - truly a visual experience to be savoured)though not gritty reality, just every day boring life and love, the sort of love we go through each day ourselves, the kinda incomplete love where two people touch each other briefly and spend more time dreaming of what could be rather than it actually taking place. A film that is romantic in all the right places, in all the right ways (believe me it will make you smile not reach for the sick bucket - Hollywood take note)and has a deft light comic touch that leaves you smiling in recognition at the heartbreak rather than crying over it. The acting and script are both first rate - tony leung can do no wrong in my book - and overall it leaves you hungry for more little gems like this. (Either that or wishing you were in love...)",
         "Awesome. Amazing film; the second half of which far outweighs the first. Beautiful. Wong Kar Wai's film fills you with the kind of warmth that only Amelie can bestow. Fast-paced but with incredible cinematography and soundtrack. Well worth checking out; if only to say you've seen one of Quentin Tarrantino's favourite films. It's this type of film that puts others to shame. This is how a film should be; exhilarating, exciting and beautiful to-boot. The stories are told with such depth that you can't help but pick out new things every time you view it. A film like this is one that never gets boring; no matter how many times you've seen it. (I'm on my 8th)",
         "Flawless tale of brief encounters and abstract moments. Far superior than most of Hong Kong's bullet ridden action fests, Chungking Express takes you on an emotional journey of love, loss, and chance excursions. Cinematography and editing is groundbreaking as this drama unfolds soap-opera-like stories without all the overacting and melodrama. Wong Kar-Wei has sealed his place in cinematic history with this tour de force.",
         "Wong Kar Wai triumphs stylistically in Chungking Express, a beautiful movie that places two fingers right on the throbbing pulse of what it means to be lovesick. Some viewers will not appreciate the director's decision to fracture the narrative into two distinct stories, but multiple viewings should cure any doubts. Hypnotic editing and camerawork capture a mood and tone that is equal parts Blade Runner and Breathless, and the principal performers are all delightful to watch. Memorable use of music additionally adds to the film's strength, along with a number of unique vignettes and quirks of character (think expired canned pineapple, a toy airplane and new additions to a fish tank, for example) that take unsuspecting audiences by surprise.",
         "Masterful Hong Kong film-maker Wong Kar Wai understands that love is about the unspoken moments between people, the hidden gestures betraying loneliness. Chungking Express is a unique expression of such notions of love. The film doesn't pretend that love is all-embracing and constant, in the way so many predictable films would suggest. Love, for the protagonists of this film, comes and goes between subtle glances - always elusive. Indeed if a level of contentment can be reached at all for these characters - it is a fleeting moment, a memory of a song, the way that somebody smells. There are so many essential moments in this film - when Dinah Washington's 'What a difference a day makes' plays over two lovers cavorting, the moments when characters talk to inanimate objects to overcome their loss of love, the brief glances between the second policeman and the waitress across the counter of the fast-food restaurant. It has been dismissed as an exercise in style over substance by many, mainly due to the hypnotic way in which the film is shot and the lack of a real story as such. I don't feel the need to defend it from these accusations because the beauty of the film is there on the screen and nothing I have said or could say could really do it justice. It breaks my heart every time.",
         "Director Wong Kar-Wai quickly established himself among art house cinema circles worldwide as a new voice in Asian film with this unconventional set of tales about modern love in Hong Kong. Before then, he and other Hong Kong directors had stuck mostly with 'kung fu' flicks, using the formulas popularized by Bruce Lee with young audiences worldwide. 'Chungking Express' took a new direction, sweeping the 1995 Hong Kong Film Academy awards and gaining attention at other festivals in Europe and the USA. The first of the two tales portrays a policeman and his thwarted infatuation with a mysterious femme fatale. It mostly rambles inconclusively but introduces us to exuberant, flashing Hong Kong as the setting for the second and much more satisfying love story. Another police officer orders the same meal every day in his lunch break at a little coffee shop, 'Chungking Express.' His quiet, somber manner attracts the attention of the pretty, energetic, but lonely waitress. Then an airline hostess comes to the café and gives her an envelope for him. She peeks inside to see a farewell note and returned keys to his apartment. The waitress proceeds on an outrageously funny quest to become part of his life. She reseals the envelope and returns only the note to him. After learning his address, she goes to his apartment when she knows he's at work and proceeds to use the keys to come in and make herself at home\u0085.cleaning and re-arranging\u0085.when he's not around. He's so depressed from his breakup that he takes little notice of the changes in his place. Then, one day, he unexpectedly comes back home and opens the door. They are equally startled to face each other. 'What are you doing here?', she demands. 'What do you mean\u0085\u0085I live here!!' 'Now you shout and scare me so much I can't move my leg,' she complains. 'Help me to the couch\u0085.oh, oh, it hurts!!\u0085\u0085.' This zany exchange introduces us to a delightful love story. Faye Wong as the waitress ('Faye') has a special charm, bringing Audrey Hepburn to mind. Faye is feisty, mischievous, moody......and completely irresistible. The policeman ('Badge 223') is her perfect counterpart, steadfast and honorable but badly needing someone like her for energy and affection. After many twists and some setbacks, they find each other. At the end, we have high hopes for their happiness, even in the crowded, lonely city of Hong Kong with all its insecurities and uncertainties.",
         "Stunned. Chungking Express should be seen at least once for the experience. Caution: may cause smiling and frequent laughter. What a contrast to Fallen Angels which was the first Wong Kar Wai film I've seen. Talk about polar opposites. The characters here are your everyday working people living ordinary lives. I love the idea of the people we walk and pass by everyday. Who knows what a random meeting will lead to? The chemistry between the actors is key. Takeshi Kaneshiro (I never thought of jogging that way) and Tony Leung are both great as two fellows going through a down of sorts. No one wants to be alone. Or have you ever thought to yourself and asked, \"What do I want in life? Where do I want to go?\" If anyone can relate to that, Wong Kar Wai captures that in his film. Also, I love the contrast between the leading ladies; Brigitte is mysterious as the enigmatic blone and she still shines through. On the other hand, Faye's charismatic, bouncy personality is so infectious and definitely made her my favorite. It all comes out through her facial expressions, her dancing, her bright eyed look and super smile is awesome! My mindset is fixed with that song by the Mama and the Papas and Faye. That and her Cranberries' tribute. When she and Tony are onscreen together, it's magic. My favorite thing about Tony is for all the different roles he's played, he always comes off as himself. I'm sure the ladies love his scenes in the apartment! I wouldn't consider this a great Hong Kong movie. This is a great film PERIOD. Chungking Express has replay value and there's so much more to love and appreciate upon later viewings. Definitely see it for Faye!",
         "Giving an 11 would be more fair to this masterpiece. Trying to get satisfied with 10 points breaks my heart as much as the stories in the film did which are based on two men suffering from love, like the other millions on the planet. The main difference between this one and other romance films is Chong qing sen ling doesn't picture eternal love, people holding hands in hands, kissing or crying and moaning in pain when it's is over. It's more about lead characters just trying to get over the pain and discovering that undying love was never that strong indeed. Talking about getting over the pain, since it's a Kar Wai Wong nobody will dare thinking a typical work. At the first time i watched Chong qing sen ling, what hit me was director's original style in telling his stories, how he could make me feel exactly the same mood with the characters and still no tears in the whole movie. (Besides who needs tears while you can get rid of them by making some sports?) In fact if you are terribly under the influence of this film and you are dumbed by your lover too, don't be surprised when you find yourself drinking five or ten glasses of water in a row or something equally stupid as that. Because stupidity is what we are expected to do when messed with love anyway. Before, through or after the relation, it really doesn't matter, does it? After you watch Chong qing sen ling you won't be the person you used to be. At least California Dreaming will have a special place in your heart, i guarantee that!",
         "WARNING: SMALL SPOILERS MAY BE GIVEN BELOW Today being a lazy Sunday, I finally got around to watching Chungking Express. This film is something which has always been on my lengthy cinema bucket list.I am joyous that I took the the time viewing into this film as it was both uplifting and meditative amongst the chaos. The film's plot revolves around two separate narratives regarding two policemen working within Chungking,both of whom have gone through recent break ups. Their stories are told sequentially and are both running in chagrin until they encounter a new woman. For the first story, we become acquainted with He Qiwu, a man who pines over his most recent relationship with a girl called May. Whilst the May of which his relationship recently ended with has no screen time, there is plenty of monologue spoken from He Qiwu and interaction with other characters regarding her that as an audience we can feel his pain. (I mean, who hasn't been there before?) He Qiwu goes on the rebound and seeks out a girl after much self pity. It is at bar that he encounters a certain femme fatale. The femme fatale is not issued a name in this story segment however it just adds to the sense of mystery she aesthetically displays by the \"costume\" of which she wears: A Blonde Wig and Glasses. It becomes quickly evident within the first fifteen minutes of the film that she is a dangerous presence as we see her organizes an illegal drug smuggling operation. When He Qiwu and the woman with the blonde wig cross paths, it is not because he is after her. It is because he found himself out at a bar on the prowl and as we as viewers are sure of, the ineluctability of them meeting together is certain. They are not united together as lovers, however there is a slither of hope given to He Qiwu after their encounter and in his current position, a morale booster. In the second story, the unnamed Cop 663 is going through the motions post break up with an air stewardess. We see that the stewardess had decided to visit a snack counter which he frequents and gave a letter to the owner regarding her wishes to break up and keys to the apartment. This is all caught by the exuberant Faye, a worker at the counter. As Cop 663 does not wish to look at the envelope being fully aware of what the letter will detail, Faye falls him for and uses the keys to start rearranging the house while he is at his day-shift unaware. From there, the story builds around the meetings between of both Faye and Cop 663. Throughout both stories there are reoccurring motifs that we take in such as expiry dates, the name of May, a model airplane, California Dreamin' by The Mamas & Papas, a Garfield stuffed toy and more which have been omitted from this review. The symbolism behind these help build the strength of both stories and also slightly relate them. The setting of Chungking is a multicultural place and in being so it is interesting to hear dialog hear dialog in Mandarin, Cantonese, Japanese and Indian throughout the film. It is hard for the setting to not draw you in. However, despite the streets being as flooded with populace as they are, we are left with the contrast of the characters usually being in isolated locations. Taciturn and with a running self monologue. The soundtrack should be a key player in any film watched and in The Chungking Express it is not something which is not to be ignored. Most notably the soundtrack is dominated by California Dreamin' during the second half of the movie. The highlight song for me personally is a delightful Cantonese cover version of the song \"Dreams\" originally performed by the Cranberries sung by no other than Faye Wong, main actress of the second segment. In regards to the cinematography, it is hard to believe that shots being taken are not being done so under natural lighting. In a scene where the Indians are assembling clothes and toys, we get various cutaway shots and amazing editing. (In particular one shot of shoes filled with cocaine/heroin being put away is shot upside down which for unknown reasons I really love) The editing is quick and fast paced, rarely lingering. Through the use of shaky held hand camera during chase scenes and the busy streets we feel disorientated and just as lost as the characters on screen. I believe this film is an equally a comfort to those in love as to those who are out of love. Don't give up."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": ["Jet Tone Production"],
      "summaries": [
         "Wong Kar-Wai's movie about two love-struck cops is filmed in impressionistic splashes of motion and color. The first half deals with Cop 223, who has broken up with his girlfriend of five years. He purchases a tin of pineapples with an expiration date of May 1 each day for a month. By the end of that time, he feels that he will either be rejoined with his love or that it too will have expired forever. The second half shows Cop 663 dealing with his breakup with his flight attendant girlfriend. He talks to his apartment furnishings until he meets a new girl at a local lunch counter.",
         "Two stories, two lovelorn cops, two objects of desire: one a big-time heroin dealer in deep trouble with her boss after the cargo disappears, the other a seriously flaky take-out waitress who inadvertently gets hold of the keys to her admirer's apartment, all shot in a breathless kaleidoscope of color and hand-held camera work to create a mesmerizing portrait of Hong Kong in the 1990s.",
         "Two melancholy Hong Kong policemen fall in love: one with a mysterious female underworld figure, the other with a beautiful and ethereal server at a late-night restaurant he frequents."
      ],
      "budget": 0
   },
   "movielensId": 123,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "日本語",
         "普通话"
      ],
      "releaseDate": "1994-07-14",
      "dvdReleaseDate": "2002-05-21",
      "directors": ["Wong Kar-wai"],
      "runtime": 102,
      "movieId": 123,
      "title": "Chungking Express",
      "mpaa": "PG-13",
      "actors": [
         "Brigitte Lin",
         "Tony Leung Chiu-Wai",
         "Faye Wong",
         "Takeshi Kaneshiro",
         "Valerie Chow",
         "Piggy Chan",
         "Kwan Lee-Na",
         "Wong Chi-Ming",
         "Leung San",
         "Rico Chu Tak-On",
         "Lynne Langdon",
         "Vickie Eng"
      ],
      "imdbMovieId": "0109424",
      "originalTitle": "重慶森林",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["ZkyRcGGeq8E"],
      "plotSummary": "Every day, Cop 223 buys a can of pineapple with an expiration date of May 1, symbolizing the day he'll get over his lost love. He's also got his eye on a mysterious woman in a blond wig, oblivious of the fact she's a drug dealer. Cop 663 is distraught with heartbreak over a breakup. But when his ex drops a spare set of his keys at a local cafe, a waitress lets herself into his apartment and spruces up his life.",
      "tmdbMovieId": 11104,
      "avgRating": 3.98525,
      "releaseYear": "1994",
      "numRatings": 2814,
      "posterPath": "/yQUjZTzwgskqOJdr3jhwQ4yTkvb.jpg"
   }
}