{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "wish",
            "id": 4896
         },
         {
            "name": "guard",
            "id": 5369
         },
         {
            "name": "stalker",
            "id": 6844
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "strugatsky",
            "id": 10128
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "zone",
            "id": 199047
         }
      ],
      "imdb_id": "tt0079944",
      "video": false,
      "title": "Stalker",
      "recommendations": [
         593,
         895,
         1396,
         3782,
         797,
         614,
         1394,
         25237,
         31442,
         24657,
         1092,
         548,
         490,
         405,
         11878,
         204,
         422,
         11645,
         16672,
         110
      ],
      "backdrop_path": "/j8dIick5mrI9ylQ50gPKjCQxk8D.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Infra",
         "id": "59be648cc3a3681bd402949e",
         "content": "This movie is like an onion, has multiple layers. To understand it, you have to be very careful and pacient. You have to focus on movie and not doing anything else while you watch it, because if you don't, you won't understand it. \r\n\r\nhttp://cinematol.ro/pareri-filme-stalker-calauza-1979/",
         "url": "https://www.themoviedb.org/review/59be648cc3a3681bd402949e"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Stalker",
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f15f",
               "name": "Aleksandr Kaydanovskiy",
               "profile_path": "/1Sh6H65KpCMzzwPYCwH3IVaStIZ.jpg",
               "id": 28078,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Writer",
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f17f",
               "name": "Anatoliy Solonitsyn",
               "profile_path": "/mTz5gtiX2Y8B5TajEjQbnTTXlgP.jpg",
               "id": 8475,
               "order": 1
            },
            {
               "cast_id": 20,
               "character": "Professor",
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f187",
               "name": "Nikolay Grinko",
               "profile_path": "/aa90cr3ZfY65ZZaYynFKw8dUXFD.jpg",
               "id": 1190992,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Stalker's Wife",
               "gender": 1,
               "credit_id": "52fe42f3c3a36847f802f17b",
               "name": "Alisa Freyndlikh",
               "profile_path": "/psK6Vqmz2e6DAjxfZb9HJuBbtWd.jpg",
               "id": 28079,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Martha, Stalker's daughter",
               "gender": 1,
               "credit_id": "52fe42f3c3a36847f802f183",
               "name": "Natasha Abramova",
               "profile_path": null,
               "id": 28080,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f143",
               "name": "Andrei Tarkovsky",
               "profile_path": "/cEfzcvS6ZfSlpdn4SHsxZsVG0a3.jpg",
               "id": 8452,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f165",
               "name": "Aleksandra Demidova",
               "profile_path": null,
               "id": 28081,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f16b",
               "name": "Aleksandr Knyazhinsky",
               "profile_path": null,
               "id": 28082,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f171",
               "name": "Lyudmila Feiginova",
               "profile_path": null,
               "id": 8463,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f177",
               "name": "Raisa Lukina",
               "profile_path": null,
               "id": 28083,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "535189710e0a2655fe0018a8",
               "name": "Arkadiy Strugatskiy",
               "profile_path": "/6cu4H4iXqpcPrDD30eGXR9zGHfI.jpg",
               "id": 150634,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "599a08469251414a0d005c83",
               "name": "Andrei Tarkovsky",
               "profile_path": "/cEfzcvS6ZfSlpdn4SHsxZsVG0a3.jpg",
               "id": 8452,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "599a08739251414a21005ae4",
               "name": "Leonid Kalashnikov",
               "profile_path": null,
               "id": 47917,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "599a08959251414a0600592f",
               "name": "Aleksandr Boym",
               "profile_path": null,
               "id": 1585388,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56d4ff13c3a3681e44017e3a",
               "name": "Eduard Artemev",
               "profile_path": null,
               "id": 1204438,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "56d4ff23c3a36870ac0024d1",
               "name": "Shavkat Abdusalamov",
               "profile_path": null,
               "id": 1584740,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56d4ff2a9251413932002315",
               "name": "Rashit Safiullin",
               "profile_path": null,
               "id": 1584741,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56d4ff33c3a3682cef004753",
               "name": "Nelli Fomina",
               "profile_path": null,
               "id": 8467,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56d4ff3ac3a3682cef004756",
               "name": "Vitaliy Lvov",
               "profile_path": null,
               "id": 1584742,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56d4ff459251410bd1003f5e",
               "name": "Evgeniy Tsymbal",
               "profile_path": null,
               "id": 591945,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56d4ff4dc3a3682cef004762",
               "name": "Larisa Tarkovskaya",
               "profile_path": null,
               "id": 8471,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56d4ff55c3a3681e4a0155db",
               "name": "Mariya Chugunova",
               "profile_path": null,
               "id": 1584743,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "599a08be92514149cc005d6f",
               "name": "Vladimir Sharun",
               "profile_path": null,
               "id": 1584744,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "599a0832c3a3683a07005646",
               "name": "Boris Strugatskiy",
               "profile_path": null,
               "id": 1774308,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "599a089dc3a3683978005899",
               "name": "Andrei Tarkovsky",
               "profile_path": "/cEfzcvS6ZfSlpdn4SHsxZsVG0a3.jpg",
               "id": 8452,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.658757,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 1398,
      "vote_count": 466,
      "budget": 0,
      "overview": "Near a gray and unnamed city is the Zone, a place guarded by barbed wire and soldiers, and where the normal laws of physics are victim to frequent anomalies. A Stalker guides two men into the Zone, specifically to an area in which deep seeded desires are granted.",
      "similar": [
         20424,
         49849,
         137113,
         228161,
         602,
         16866,
         840,
         34851,
         348,
         601,
         607,
         608,
         10200,
         47933,
         19995,
         299687,
         126889,
         563,
         2675,
         7453
      ],
      "original_title": "Сталкер",
      "runtime": 163,
      "poster_path": "/lUE0Bp7wH0EterJ44qMRsqtKFnp.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
         "name": "Mosfilm",
         "id": 5120,
         "origin_country": ""
      }],
      "release_date": "1979-04-16",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": "RUR ",
      "directors": ["Andrei Tarkovsky"],
      "runtime": 163,
      "synopsis": "A \"stalker\" is a guide who takes people through \"The Zone,\" a place located outside an unidentified city, the result of an extra-terrestrial incursion. The State has closed it off from the outside world with barbed wire and it is closely guarded by armed police and soldiers. Inside The Zone there is \"The Room,\" which is said to grant ones deepest wish to anybody who enters it. \"Stalker\" opens with the credits rolling on the background showing of a shabby bar. An atmosphere of despair is reinforced by a strange electronic music. Soon after, Professor Wallace tells about the sudden appearance nearby of a miracle of miracle: The Zone. The next scene shows a dingy room where three figures, a man, a woman, and a child, are asleep together in a wrought iron bed. Next to the bed is a pair of crutches. The man slowly gets up, dresses, goes to the kitchen sink and washes himself. The woman, his wife (Alisa Frejndlikh), joins him and scolds him for returning to his old ways, which will surely land him back in jail. The man argues briefly for her to let him go, that he must go, and he finally pushes her aside and leaves the room. As he leaves, his wife curses the day she ever met him and reproaches him for having begotten such a child. She falls to the ground, weeping. The man, Stalker (Aleksandr Kajdanovsky), goes to the waterfront to meet with a couple, a well-dressed woman and a man, Writer (Anatoli Solonitsyn). He rudely dismisses the woman and, together with Writer, walks back to the bar shown in the opening of the film, where a third man, Professor (Nikolai Grinko), is waiting for them. No sooner as these two men meet that they start bickering with each other. Stalker will guide these two men through The Zone. Writer explains that the reason for his trip is to recover his lost inspiration while Professors motivation is purely scientific curiosity. Stalker and the two men leave the bar for their dangerous mission into The Zone. They drive through a desolate urban landscape of broken down and abandoned buildings, littered potholed streets, carefully avoiding police patrols. After sometime, sneaking behind a train, they enter through open gates the buffer area of The Zone. They hide for a while, and following the train again through another check-point, and all the while being shot at, they penetrate into The Zone itself. Having taken refuge in an abandoned building, they regroup, and Stalker sends Writer ahead to look for a railway flatbed car, which will take them inside The Zone itself. Writer loses in nerves and turns around right away, having second thoughts about continuing the trip, so Professor calmly volunteers for the mission. All three men journey on the flatbed car silently and solemly through changing landscape in a single three-and-a-half minute odesey to the The Zone. As they reach, the film turns from sepia color to full color. There is a striking contrast between the lush green, but littered landscape of The Zone and the dilapidated surroundings previously encountered. The atmosphere is still except for the calls of cuckoo birds heard in the far. \"There we are... home, at last,\" says Stalker and proceeds to talk about another stalker, his mentor, Porcupine. Before absenting himself for a while, Stalker hands Professor some white cloth and some steel nuts and tells him to tie a piece of this gauze to each of the nuts. During his absence, Professor relates the story of Porcupine and of The Zone. When Stalker rejoins the group, their journey through The Zone begins, with Stalker every so often throwing one of the nuts to indicate the path to follow. All along, Stalker relates how dangerous and tricky The Zone is, and that it demands respect. Rules that apply outside The Zone are no longer valid inside it. For example, the shortest path between two points is no longer a straight line, but a convoluted path. As they soon arrive in view of The Room, Writer rebels against this rule and proceeds straight on toward The Room, but stops short when he hears a voice warning him: \"Stop, don't move.\" Writer returns precipitously to Stalker and Professor who swear that they had not spoken a word. Professor suggestion that Writer scared himself starts another argument interrupted by Stalker who again reiterates the danger in The Zone, full of deadly traps, and what kind of persons is allowed to enter The Room. Professor now gets apprehensive and refused to go on, but Stalker dissuades him, and the group continues on. Professor, having forgotten his knapsack, wants to go back to fetch it. Stalker tells him it is impossible because it is too dangerous. Stalker and Writer continue their journey, wading knee-deep toward a waterfall. Arriving at the cascade, Stalker notices that Professor is missing. Since it is not possible to retrace ones path in The Zone, they proceed and as they passed through an archway in a tiled wall, they meet a serene Professor having a drink by a fire, with his knapsack nearby, just where he had previously left it. Stalker recognizes this as a trap. Another argument ensues during which Professor and Writer throw biting insults at each other. A long, puzzling and complex scene follows, during which a mysterious dog appears. This long scene is complex in so far as the positions and the spatial relationships between the three characters keep changing in unnatural ways. The background of electronic music adds to the strangeness of the scene. Writer and Stalker talk about the redemptive power of art. A voiceover, that may be Stalkers wife, recites some biblical passage, and so does Stalker. A quick cut shows the group arriving at the \"meat grinder,\" a dark tunnel, dimly lit through hole in the ceiling, and a floor covered with puddles. Writer is designated in a draw to go first, while the rest of the group follows at a safe distance. When Writer reaches a door, he pulls out a pistol, but Stalker convinces him to throw it away. They continue through the door, wadding chest-deep in filthy water, up a stairway, and into a room filled with moguls of sand. Writer, who had proceeded in the wrong direction, standing next to a deep well where he has just dropped a large stone, delivers a long monologue about the emptiness of his life and the meaninglessness of work. Stalkers deliver a poem, which was actually written by Arseny Tarkovsky, about fate. In the following scene, the trio finds itself in one of the small rooms bordering a pool full of refuse, and in which there is a telephone (note that this is not The Room). A heated discussion begins regarding each of the mens real objectives for wanting to reach The Room. Stalker leads the two men through an opening in the wall and stop at the threshold of a brightly illuminated room, and, chocked with emotions, he tells his companions that they are now about to experience the greatest moment in their lives. In The Room, they will be able to fulfill their most sincere wish. Writer refuses to go in first, as he does not want to humiliate himself by prostrating himself. Professor produces a hand held nuclear bomb he had carried all along in his knapsack, as he does not want the power of The Room to be used by the wrong people for the wrong reasons. Stalker struggles with Professor trying to take the bomb away, with Writer intervening several times, tearing Stalker away from the Professor. Writer brings all sorts of accusations against Stalker, questioning his motives and his honesty. To which a tearful Stalker responds that he is a failure and that all the people he brings to The Room are also failures, but he can nevertheless help them. Eventually, Professor takes his bomb apart and throws the pieces in the water. The last scene shows, the three men sitting on the floor, outside The Room, with Writer, his arm over Stalkers shoulder, and Professor leaning against their backs. In the next scene, in black-and-sepia film, we are back into the bar with the trio standing around the table, almost as at the opening of the film. Outside are Stalkers wife and his daughter, Monkey (Natasha Abramova). The wife enters the bar and leaves together with Stalker and the dog, leaving Professor and Writer behind. Stalker is carrying his daughter on his shoulders. They walk along a polluted river, with the power plant in the background belching toxic smoke. Once at home, Stalker is very depressed, and his wife reassures him of his worth. Direct to the audence, she delivers a long monologue, saying that in spite of all the adversities she has endured over the years, she does not regret having married Stalker. She professes that their marriage was blessed, because if there would have been no sorrow, there could have been no happiness either. The final shot, in color, is an enigmatic one. Monkey is heard in a voice-over reading a poem by Fyodor Tyuchev. She then appears to move through telekinesis three glasses which are on the table. A train passes, rattling The the, its rambling mixing up with segments of Beethoven's \"Ode to Joy,\" as the film fades away on Monkey's vacant face.",
      "writers": [
         "Arkadiy Strugatskiy",
         "Boris Strugatskiy"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0079944/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDY2NjU0NDAxOF5BMl5BanBnXkFtZTgwNjQ4MTI2MTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Alisa Freyndlikh, Aleksandr Kaydanovskiy, Anatoliy Solonitsyn | See full cast and crew »"],
      "reviews": [
         "Some have claimed that \"Stalker\" is not a science fiction film. I'd say it's more of a science fiction film than most of what Hollywood passes off as part of the genre, most of which are simply action films with a sci-fi bent. Stalker is science fiction in the vein of the genres greatest writers like Phillip K. Dick and Stanislaw Lem. It's pure science fiction, based on science, metaphysics and speculation, not some action fantasy or space opera that fits into the genre on the technicality that it takes place \"in the future\" or \"a long, long time ago\". The film is slow...very slow but it has to be to put you into the mindset of the film. After the opening 30 minutes the pacing actually draws you into the film in a more personal way more than any Cyborg-post-apocalyptic-hell crap Hollywood could spew out. This film is truly sci-fi, and truly great sci-fi.",
         "Andrei Tarkovsky is a rarity among filmmakers in that he creates films that resemble elaborate (and always smartly written, beautifully shot and superbly acted) puzzles. The pieces are always scattered, and Tarkovsky relies on his viewer to bring the final element of the puzzle along with him. SOLARIS explores the boundaries of consciousness and the sense of grief (and it uses the titular planet as a metaphor for God). ANDREI ROUBLEV is a multi-layered voyage into religious belief. STALKER, however, is far more spiritual and existential than both of them. A teacher and a scientist wish to go to a restricted patch of nature - the mythical conscious \"Zone\" - to make their wishes come true. To enter the area and survive its numerous danger, they hire a man sensible to the Zone's thoughts and actions, a Stalker. What they find there turns out to be very different from what they expected, as they come to discover who they truly are. There's only so much you can say without getting drowned in details that would appear heavy-handed on paper but flow seamlessly on screen. Quite often, Tarkovsky reduces his characters to silence, letting their movements and eyes convey their thoughts and feelings and letting the viewer bring his own thoughts and beliefs to the film. One of STALKER's many treats is that it invites you to get carried away into your own thoughts, flowing with the images as it provides new questions to ponder... In that sense, the film is very much like a philosophical poem: a very simple surface covering innumerable layers of meaning. Yet the images Tarkovsky provides - whether filming landscapes or wide-shots or simply peering into his actors' extraordinary faces - make this almost hypnotic. STALKER is a treasure: an invitation to go on a mental ride with a poet and philosopher. A film that makes you wonder more about yourself yet without making you anxious. The few existing films like STALKER are the reason why cinema is called \"art\"!",
         "For me, it's, quite simply, the best film ever made; Don't you find you can pause any Tarkovsky film at any moment and the art on your screen is good enough to have as a poster on your wall for life ? With Stalker it is doubly true. The first time I experienced the tunnel scene my heart nearly stopped. This was in 1984 I watched the TV listings in England for 20 years waiting for a repeat - finally buying the DVD in 2004, though I couldn't really afford it. Proof that a SCI-FI film does not need tons of effects to work. In a science fiction film book I read years ago they rated Stalker as the only film ever made deserving full marks in all 3 sections. Imagine if Tarkovsky had made a film of one of PKD's novels ?! OK, I'm dreaming ?! We are lucky to have been blessed by his genius. The good die young. All the best, Rich (English, 38 yrs, Paris)",
         "i want to say somethings about the most poetic,philosophical and intuitive director, tarkovsky and his movies ,especially Stalker. first of all, we must all know that, tarkovsky is not for all. his poetic understanding of life and human and putting this understanding to his movies is unique in the world for my opinion. one of the most poetic and philosophical movies of him, Stalker is that kind of movie. it is like a poem written with objects. we must feel before we try to understand. opening sequence of film contains some kind of expressionist objects with related the moral and inner conditions of the people living in the town . the \"dirty\" black and white take gives the viewers ,the mood of people having nothing to live, nothing to believe and nothing to give others.and the aggressive green take in the \"zone\" gives another vision of the life. the camera moves very slow to make us to go into to film and feel the film. tarkovsky's usage of objects and colours is very different and that is why i think he was a cinema poet. on the other hand, in addition to this \"poem written with objects\", the film also has very deep philosophical content. what is life,what is human, what is goodness, what is selfishness, what is devotion, what are the bases of our civilizations etc. and people are made to think all these things, not mostly with dialogs but with objects and colours and complete vision. for example, the three objects shown while the camera goes into the water ,but actually to the heart of human being and we see one cringe, one gun and one religious icon. and these are the metaphors of the human civilizations for my opinion. and all the journey into to the \"zone\" and finally \"room\" , actually done into the human being. into our selfishness,into our subconsciousness, our badness,our goodness, our weak and strong parts. actually i can feel that , the things searched in this movie are our lost innocence . the stalker is the only people who believes something and needs to believe .and actually the journey itself is a fake. to go to the truth,faith,justice, goodness are being related with innocence in that movie. the microcosms shown poetically in the water is another metaphor shows human being's selfish behaviour. because human, destroys the things,destroys the innocence, destroys the world living around them.our today's civilization broke our strong cooperation with nature and changed this relationship to a nature disaster. the movie gives the message of the need of mercy to all the living and even non-living things in our nature. because human being's salvation is only related with that. and the need of hope, need of believe is human being's basic needs. and our modern world destroyed all the hopes and believes. the movie contains metaphors making us to feel and think about those needs.and the most critical thing is felt in the film that self-denial is the basic need in our world.and unfortunately this value is lost and needed to be re-gain. i can tell about all the metaphors in the movie but no need. because every person understand those things different like kafka's novels. and we just need to watch the movie with no prejudice but with open heart. i recommend this film to all the cinema-lovers. i recommend also not to try to understand this film. only leave yourself to this great poem and it will give you all you need.",
         "It seems to me that I see Tarkovsky' movies differently from many other people. For me this film is not \"too long\" or boring. For me this is one of the best movies ever made. Western culture has a very long tradition of film-making. Usually typical western movie is focused on \"story\". (Of course - not always) The sharpness and tension of the movie are achieved by the big number of cuts or by the fast varying of shots or by the sudden varying of plans or by some surprising angle of camera etc. Tarkovsky don't like cuts. The number of cuts is minimal. His camera is moving like in dream (Bergman envied Tarkovsky for that), it has no angles at all. Colours are pale, \"dirty\", very tender, soft, almost black-and-white. In a typical western movie dialog is followed by the camera. Picture is illustrating text and is subordinated to it. In Stalker text and visual image are coexisting, cooperating with each-other. Both are moving on their own ways but at the same time, somehow - harmonically. Text and picture are not subordinated, they are both independent. Why is Tarkovsky using such a weird language? Surely not only because he wants to opposite the dogmas of western cinema. He has a positive message too. Audience of his films has to understand his films not only at the level of thinking or emotions, but at the level of much deeper consciousness. Therefore watching his movies means rather meditation than watching-TV-and-eating-popcorn. The purpose of Tarkovsky's films is to loose the mind of audiences, to wake it up to much deeper attention. So that audiences can simply watch and see. Stalker is not an entertainment and is not supposed to be. It means there is no sense at all to watch Stalker, when you need some amusing entertainment. Stalker is a serious movie. It is very narrow-minded to evaluate movies on the assumption of entertainment only. Of course, we live in the world of movie-consumers, produced by powerful film-companies, demanding more and more and more exciting entertainment. Consumer doesn't understand this movie. For him it is big bore.",
         "The Region 2 Artificial Eye DVD includes interesting interviews with the cameraman and production designer. The production designer reveals that the film was completed only to be destroyed because it had been shot on experimental Kodak and couldn't be developed - a whole year's work was ruined. He proposes the possibility that the authorities of the time didn't want it to be developed. The incident nearly destroyed Tarkovsky. He was finally persuaded to go back and film a new Stalker, this time on a shoestring budget. What does the film mean? Ask me again when I've watched it maybe ten times. Certainly the Zone means more to Stalker than the Room. The Room is his living, but the Zone is an escape, a sanctuary from the noisy, industrial rusting slum where he lives (captured brilliantly in metallic sepia). In the Zone everything eventually returns to nature - like a pastoral coral reef growing on a battleship lichen and mosses engulf factory buildings and tanks. His first action on arriving there is to leave the other two occupied while he communes with the natural things growing in the zone, the grasses, the dew, the soil, the tiny worm that dances head-over-tail down his hand. A beautiful, great and puzzling film. But then if it revealed all its secrets straight off then, apart from the beautiful visuals and the soundtrack it would be pointless watching it again. Great art only leaches out its secrets gradually and only to those with the desire to learn them.",
         "There have been some comments about this film's length. I am initially reminded of the scene in \"Amedeus\" where Mozart is told that his composition has \"Too many notes\" to this he replies \"There are just enough...\" This film offers great insight into the inner workings of not just the creative mind but the social will of mankind. If you are a viewer who enjoys film please disregard the whining of those who don't enjoy investigating thoroughly the possibility of a well thought out and concise perspective and please watch this masterpiece of modern film. The director leads the viewer through some profound aspects of humanity with such brilliance and in my opinion swiftness that to pass it by would be a shame.",
         "The characters at the heart of Tarkovsky's \"Stalker\" are people who embark on an arduous journey only to discover that they had no idea what they wanted to gain from it. The central character is a \"stalker,\" a man who makes a living by illegally escorting people through a restricted area to The Room, a place where their greatest wish will supposedly come true. Exactly why the area is restricted is never made perfectly clear; in the novel this film is partially based on, \"The Roadside Picnic,\" it was a site where aliens briefly landed, and The Room was an object they left behind almost as if it were refuse. But Tarkovsky would rather not settle for such a flat explanation. To him, The Room is a place that means different things to the people who journey there, and the stark, ravished landscape they must journey through consists of the phobias and anxieties that they can hardly bear to face. The expedition the men experience is a long and often maddening one, and there are many scenes where the camera lingers on a beautifully composed shot so that the viewer can take time to understand how the characters fit into the settings and how those settings form both natural and supernatural obstacles. Andrei Tarkovsky was an artist who did not like giving solid answers to the questions his films posed. He sculpted his stories so that viewers who had the patience and self-discipline to stay attentive all the way through could draw their own conclusions. If there is any specific meaning to \"Stalker,\" it is that we have to fully understand anything for which we are willing to alter our lives.",
         "Tarkovsky's direction for this film is nearly flawless. The film mainly focuses on three characters and their basic goodness of each other. The photographic colors are brilliantly choreographed to the mood of character and viewer. The visionary landscapes are mesmerizing beautiful. The survival techniques the characters in the film achieve is unlike anything I've seen in film. Much like Kubrick in terms of directive style and character study, Tarkovsky puts the viewer in a kaleidoscopic landscape of mood and emotion. No clichés here though. I have not read the story which the movie is based upon, but from what I understand the characters in the film all develop a healing understanding of each other. That is when you know [as a viewer] that you will watch something unique and exceptional. If you are into complex, psychological science fiction in the same vain of say {The Andromeda Strain, Solaris, 2001:a space odyssey} than you shall enjoy \"Stalker\".",
         "Stalker (1979)***½ Stalker is rich, spiritual and contemplative journey through the fantastic inner world of human's hope, desire, disillusions and believes. Main characters, Writer (as incarnation of irrational, imaginative and emotional aspects of our nature or subconsciousness) and Scientist (rational, logic forces or consciousness) are guided by Stalker (symbolizing our desire, will and everlasting search of meaning) to the mysterious Zone (which may represent all our spiritual goals, meanings, struggles to achieve them and barriers in our path). Breathtaking and mesmerizing images and sounds, witty dialog and strong concept are the major virtues of this feature. Writer's monologues are among the most meaningful, thought-provoking and spiritual moments I ever experienced in any art. But the movie is overlong losing its powerful initial momentum and becoming inconsistent in it's final message (by final I don't mean last in chronology but overall). Tarkovsky's earlier SF drama \"Solaris\" is more structured and fully developed. Nevertheless, Stalker is an outstanding piece of art movie that puts its director among the few true cinema masters. Rating: 8.5/10"
      ],
      "genres": [
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": ["Kinostudiya ''Mosfilm''"],
      "summaries": [
         "Near a gray and unnamed city is the Zone, an alien place guarded by barbed wire and soldiers. Over his wife's objections, a man rises in the early morning and leaves her with their disabled daughter to meet two men. He's a Stalker, one of a handful who have the mental gifts (and who risk imprisonment) to lead people into the Zone to the Room, a place where one's secret hopes come true. His clients are a burned out popular writer, cynical, and questioning his talent; and a quiet scientist more concerned about his knapsack than the journey. In the deserted Zone, the approach to the Room must be indirect. As they draw near, the rules seem to change and the stalker faces a crisis.",
         "A guide leads two men through an area known as the Zone to find a room that grants wishes."
      ],
      "budget": 6000000
   },
   "movielensId": 1232,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1979-04-16",
      "dvdReleaseDate": "2002-10-15",
      "directors": ["Andrei Tarkovsky"],
      "runtime": 163,
      "movieId": 1232,
      "title": "Stalker",
      "mpaa": "",
      "actors": [
         "Aleksandr Kaydanovskiy",
         "Anatoliy Solonitsyn",
         "Nikolay Grinko",
         "Alisa Freyndlikh",
         "Natasha Abramova"
      ],
      "imdbMovieId": "0079944",
      "originalTitle": "Сталкер",
      "genres": [
         "Drama",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "xB7jVTut3-g",
         "RfT2P9krPm4"
      ],
      "plotSummary": "Near a gray and unnamed city is the Zone, a place guarded by barbed wire and soldiers, and where the normal laws of physics are victim to frequent anomalies. A Stalker guides two men into the Zone, specifically to an area in which deep seeded desires are granted.",
      "tmdbMovieId": 1398,
      "avgRating": 4.06411,
      "releaseYear": "1979",
      "numRatings": 2644,
      "posterPath": "/lUE0Bp7wH0EterJ44qMRsqtKFnp.jpg"
   }
}