{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "life and death",
            "id": 314
         },
         {
            "name": "depression",
            "id": 894
         },
         {
            "name": "age difference",
            "id": 965
         },
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "suicide attempt",
            "id": 1252
         },
         {
            "name": "birthday",
            "id": 1421
         },
         {
            "name": "banjo",
            "id": 1790
         },
         {
            "name": "cliff",
            "id": 1792
         },
         {
            "name": "life planning",
            "id": 1904
         },
         {
            "name": "dead wish",
            "id": 2643
         },
         {
            "name": "arranged marriage",
            "id": 2692
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "wealth",
            "id": 10329
         },
         {
            "name": "midnight movie",
            "id": 11487
         }
      ],
      "imdb_id": "tt0067185",
      "video": false,
      "title": "Harold and Maude",
      "recommendations": [
         10322,
         396,
         11787,
         3085,
         3063,
         198,
         11898,
         16305,
         26617,
         25188,
         993,
         940,
         982,
         10633,
         28580,
         3529,
         596,
         3116,
         702,
         851
      ],
      "backdrop_path": "/fKVS7oPfdjFam3YbgDjOHivTkGU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Maude",
               "gender": 1,
               "credit_id": "52fe423ac3a36847f800dddb",
               "name": "Ruth Gordon",
               "profile_path": "/155Pa9jPlWEaPK7qZQFWH6kol5A.jpg",
               "id": 4970,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Harold Parker Chasen",
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800dddf",
               "name": "Bud Cort",
               "profile_path": "/mwCVkL9BG1ZCF9icbcKjE8TCS7H.jpg",
               "id": 4971,
               "order": 1
            },
            {
               "cast_id": 21,
               "character": "Mrs. Chasen",
               "gender": 1,
               "credit_id": "52fe423ac3a36847f800de2f",
               "name": "Vivian Pickles",
               "profile_path": "/9IPTFdu9SldCL7Obff5Zo5xsvQA.jpg",
               "id": 19616,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Glaucus",
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800dde3",
               "name": "Cyril Cusack",
               "profile_path": "/5d6OeKNqpRSMhwXd1FHV9KeX4WS.jpg",
               "id": 4973,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Uncle Victor",
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800dde7",
               "name": "Charles Tyner",
               "profile_path": "/6OHlhUQcMXIMIkqIskBw4tK2Mp7.jpg",
               "id": 4974,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sunshine Doré",
               "gender": 1,
               "credit_id": "52fe423ac3a36847f800ddeb",
               "name": "Ellen Geer",
               "profile_path": "/abGO91Hj5EGEkVdMFKAVRAkuWug.jpg",
               "id": 4975,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Candy Gulf",
               "gender": 1,
               "credit_id": "52fe423ac3a36847f800ddf7",
               "name": "Judy Engles",
               "profile_path": "/uWyN2f9QWemnjJd2iw7v3bQ8NIs.jpg",
               "id": 4978,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Edith Phern",
               "gender": 1,
               "credit_id": "52fe423ac3a36847f800ddfb",
               "name": "Shari Summers",
               "profile_path": null,
               "id": 4979,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Priest",
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800ddef",
               "name": "Eric Christmas",
               "profile_path": "/dCs1h8vhRjNNfmJeHuVgcVE6ZwI.jpg",
               "id": 4976,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Psychiatrist",
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800ddf3",
               "name": "G. Wood",
               "profile_path": null,
               "id": 4977,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Motorcycle Officer",
               "gender": 2,
               "credit_id": "54f81f689251416ee400352b",
               "name": "Tom Skerritt",
               "profile_path": "/fVuxSZ8VoPxRJDm3VohtDDz5x8l.jpg",
               "id": 4139,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800ddd1",
               "name": "Hal Ashby",
               "profile_path": "/5VRhD4ZMsTyoAsMmxkNuTg41Sta.jpg",
               "id": 4964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800ddd7",
               "name": "Colin Higgins",
               "profile_path": "/gL19DuEboHBxoq9dlrpY2PSFsme.jpg",
               "id": 4967,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de01",
               "name": "Colin Higgins",
               "profile_path": "/gL19DuEboHBxoq9dlrpY2PSFsme.jpg",
               "id": 4967,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de07",
               "name": "Charles Mulvehill",
               "profile_path": null,
               "id": 3222,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de0d",
               "name": "John A. Alonzo",
               "profile_path": "/7HN8Ifyp5hNBhBurx0q3rlsQX8r.jpg",
               "id": 1153,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de13",
               "name": "William A. Sawyer",
               "profile_path": null,
               "id": 4980,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de19",
               "name": "Edward Warschilka",
               "profile_path": null,
               "id": 4981,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de1f",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de25",
               "name": "Michael D. Haller",
               "profile_path": null,
               "id": 4982,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ac3a36847f800de2b",
               "name": "Yusuf Islam",
               "profile_path": "/7NmczpBadFXRQcSIu4yskfaUev2.jpg",
               "id": 7445,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.682912,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 343,
      "vote_count": 344,
      "budget": 1200000,
      "overview": "The young Harold lives in his own world of suicide-attempts and funeral visits to avoid the misery of his current family and home environment. Harold meets an 80-year-old woman named Maude who also lives in her own world yet one in which she is having the time of her life. When the two opposites meet they realize that their differences don’t matter and they become best friends and love each other.",
      "similar": [
         746,
         20453,
         881,
         470,
         70,
         334,
         284,
         2652,
         284276,
         43923,
         1371,
         422,
         842,
         9621,
         309,
         261,
         221902,
         10995,
         590,
         175
      ],
      "original_title": "Harold and Maude",
      "runtime": 91,
      "poster_path": "/xqay68babjK46U9WBFD2TmtnGcx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1971-12-20",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "They were meant to be. But exactly what they were meant to be is not quite clear.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Hal Ashby"],
      "runtime": 91,
      "synopsis": "Harold Chasen is a nineteen-year-old boy obsessed with death so much so that he torments his mother (Vivian Pickles) with elaborately staged fake suicides. Harold meets Maude, 79 years old, at a funeral. The pair form a bond, with Maude slowly opening Harold to the sensual pleasures of music and art and the general anarchy of living for the moment and doing whatever one pleases. Their relationship turns sexual, despite Harold's mother's best attempts to get her son to settle down with someone she considers appropriate. Upon Maude's 80th birthday at a surprise party Harold has thrown for her Maude reveals that she has taken poison and will be dead by midnight. She restates her firm belief that 80 is the proper age to die. Harold has Maude rushed to the hospital, but it is too late. In the final sequence, it appears that a grief-stricken Harold drives his car (a Jaguar he had earlier transformed to look like a hearse) off a cliff. The final shot, however, reveals Harold with the banjo Maude gave him strapped around his shoulder upon the cliff. He walks away, picking out on his banjo the notes to Cat Stevens' \"If You Want to Sing Out, Sing Out\".",
      "writers": ["Colin Higgins"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067185/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxMjMwODMxMl5BMl5BanBnXkFtZTYwMDA3MDE5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ruth Gordon, Bud Cort, Vivian Pickles | See full cast and crew »"],
      "reviews": [
         "I only saw this film quite recently but it hopped straight to my number one film of all time. It is beautiful. Bud Cort is charming as Harold and Ruth Gordon - dare I say cute? As Maude. If I look like her when I'm eighty I'll be out there nicking cars and fluttering my eyelashes at policemen too! Maude wrenches Harold free from his morbid and lonely existence to show him how lush and amazing the world can be and he emerges from his experiences a happy man. This is definitely one of the films that (along with say, Fight Club, American Beauty and The Rocky Horror Picture Show) show you can be who you want to be, and you needn't let anyone oppress you. It's brilliant. Everyone should know a Maude. It has inspired me to buy a banjo and play Cat Stevens songs.",
         "HAROLD AND MAUDE is one of the quirkiest comedies ever made, both heartwarming and hilarious. Just recently, it made the AFI's Top 100 Funniest Movies of All Time (#45). Not that the list means anything, it didn't include DUMB & DUMBER the funniest damn movie ever made, but I agreed with this choice. Bud Cort is Harold, a morbid teenage boy neglected by his rich mother (Vivian Pickles), who spends her time trying to match him up with blind dates. Harold delights in pretending to kill himself to get attention from his mother and pulls some gruesome tricks out of his sleeve to scare away his blind dates. He goes to funerals as a hobby and while there, he meets Maude (Ruth Gordon), a carefree elderly woman. Maude helps to teach Harold the beauty of life and the two slowly fall in love. HAROLD AND MAUDE was ever nominated for any Oscars, but it should have been. Bud Cort and Ruth Gordon are both brilliant in their roles; unfortunately, this would be the last good film either of them made. Cort was recently reduced to a bit part in THEODORE REX and Gordon died in 1985. But both here are at shining moments in their careers. Vivian Pickles is right on-target as Harold's rich, prissy mother who tries to run Harold's life for him until he breaks free. Maude is certainly one of the most heartwarming characters in cinema history; her philosophies are so very true that I couldn't help but apply them to my life after the movie was over. Some viewers may be disgusted at the thought of a teenage boy and an elderly woman being a hot item, but the idea and execution of it is more an act of respect and love for one another as people than an act of lust and romance, making this in my opinion the most romantic film of all time. HAROLD AND MAUDE is also told very realistically, making the story unfold gracefully and the twist ending is both poignant and reassuring. HAROLD AND MAUDE is certainly one of the funniest movies of all time, but is also one of the most important human stories as well.",
         "If so irreverent a story were to be told today, how would one react? As was probably the case when the film was released, people would probably find the theme edgy, if not inappropriate. Such is the case with the cult film `Harold and Maude.' It openly explores themes of suicide, love, death and life with a fresh perspective. The interesting part is how this film will likely find you. In most societies, an older man will likely fall for a woman years his junior. However, Harold (Bud Cort)-a shy teenager with an affinity for death-meets his 80-year-old true love Maude (Ruth Gordon), not at a dance or social event, but at funerals. The meeting almost seems reminiscent of Edward Norton's character's support group addiction in `Fight Club.' Harold loves the attention he gets from staging fake suicides to frighten his obtuse and superficial haute-culture mother. In a reaction, she enlists him in a computer dating service in a vain matchmaking attempt to fix him up with Beetle-driving yuppies-to-be. The beauty is he frightens off all his prospective mates with cleverly staged fake suicides. At the same time, he meets Maude, a free-spirited senior who teaches him to appreciate life. After spending more time with her, he finds himself in love with her. However, a barrage of authority-i.e. priests, army-loving uncles and a psychiatrist-urge him not to follow through with his relationship. `Harold and Maude' plays on '60s-esque themes of anti-establishment and open minds. Harold's militaristic uncle comes across as comical in his war-mongering vices-right down to his armless right sleeve that salutes when he pulls the string. Harold seems unhappy though he's surrounded by extravagance that rivals anything on MTV's `Cribs.' Not only that but his mother's lack of sense and indifference to her son mirrors her addiction to affluence. In addition to the swarm of brides-to-be, she tries to pacify him with material possessions-including a spanking-new Jaguar convertible, which he converts into a hearse. Cat Stevens' open-air, acoustic-driven rock 'n' roll provides the soundtrack for the film. It gives the film a decent organic sound indicative of its demeanor. This is a film that chases happiness wherever it can be found with a Woodstock-sense of responsibility. Maude's vices of vehicular larceny and bong smoking match Harold's love of fake hara-kiris and hearses. In a way, this movie comes across as a bit dated in that time has indeed erased the '60s anticipation of The Age of Aquarius and replaced it with `Fight Club' desperation. However what the film lacks in reality, it makes up for in heart. This movie is not meant to be taken seriously; it's only to break down paradigms of societal thought.",
         "I want to BE Maude when I am older. Ironically, I have never seen a movie that was so full of life and joy. There are many little things in this movie, little details and gags, that increase the movie's replayability. The acting is amazing. Ruth Gordon and Bud Cort have wonderful chemistry,which is a tribute to the their acting ability, as well as the tight writing and solid direction. I was sad that this movie did not garner more recognition than it did when it was released. I am also disappointed that Bud Cort has not starred in more things since this movie. Oh well. This is a good Hal Ashby movie to start with, but if you get a chance you should watch as many as possible. They are quirky, thoughtful and wonderful. \"Harold and Maude\" is a paean to life and love, even if it's in the weirdest places.",
         "I love this film. I saw it when it first came out and I was a teenager. I bought the VHS version and I watch it every-so-often. It is great! I have decided that I want to be like the character Ruth Gordon plays in this movie when I get older. She is eccentric. She loves life. She is in touch with herself. I LOVE HER!!! And Bud Cort...what a wonderful, dry, cool, suave young fellow. Believable. He wants to control his own life. His mama is, well... rich and determined. He is...young and confused. You won't believe this. I laugh every time I play it. And I search myself every time it ends. You can watch it one hundred times and still find something new. It's not normal, it's not predictable, and most of all, it's not a waste of time.",
         "'Harold & Maude' is one of those 'sleeper' films that just seems to resonate that bit more with every passing year. Harold, played by the criminally under-utilized Bud Cort, is the quintessential disaffected rich kid wanting to find some meaning in a vacuous life who hooks up with the devil-may-care Maude through their mutual love of attending funerals (Joyce's word 'fun-for-all' springs readily to mind in those scenes). There is plenty to love about this film, the slower pace and the lampooning of easy targets, the 'gung-ho' military uncle and the fetishist priest for example. Here is a film that really stands up well to repeated viewings.",
         "This art house favorite is a timeless classic and recommended viewing for all post-Catcher In the Rye teenagers. To modern viewers, the Ruth Gordon creation of Maude probably seems trite, but her Maude was fresh, original and daring in 1970 and the pre-Sophie's Choice twist in her history that Harold discovers was likewise unanticipated by early viewers. Unfortunately, Ruth Gordon went on to recreate this character in lesser films throughout that decade and the character of the eccentric old lady has become rather shopworn. The Cat Stevens soundtrack is probably one of the most effective use of pop music in film ever.",
         "Ashby was Ashby from the word go. Pristine without being precious, intelligently beautiful without being french, funny, funny, funny, bitter, provoking and sad. You can mix all of that and quite simply call it Ashby. What a delight! Elizabeth Bergner was suppose to play the part, marvelously written by Colin Higgins. Hal Ashby flew to London for a meeting with her, she didn't quite get it, she said aloud she couldn't work with a director who looked like Jesus Christ. Well sorry for her, but lucky for Ruth Gordon and lucky for us. As I saw the film after Rosemary's Baby I was kind of worried for Bud Cort for a little while. Ruth Gordon made her name as Dolly Levy in Thornton Wilder's \"The Matchmaker\" got an Oscar for Rosemary's Baby, wrote Adam's Rib with husband Garson Kanin. She was a woman for the ages and \"Harold and Maude\" is her present, her own tribute to an extraordinary life. I've shown the film to kids, 10, 12 years old and they fall in love with her. Bud Cort is the perfect foil for her designs. Cat Stevens and a scrumptious performance by Vivian Pickles, the unforgettable Isadora of Ken Russell's film of Duncan's life, wrap up this exquisite Hal Ashby masterpiece.",
         "The self-destructive and needy wealthy teenager Harold (Bud Cort) is obsessed by death and spends his leisure time attending funerals, watching demolishing of buildings, visiting junkyards, simulating suicides trying to get attention of his indifferent, snobbish and egocentric mother and having sessions with his psychologist. When Harold meets the anarchist seventy nine year-old Maude (Ruth Gordon) at a funeral, they become friends and the old lady discloses others perspectives of the cycle of life for him. Meanwhile his mother enlists him in a dating service and tries to force Harold to join the army. On the day of the eightieth anniversary of Maude, Harold proposes her but he finds the truth about the end of the cycle of life. The cult \"Harold and Maude\" was a huge success in Brazil for people of my generation with a refreshing and funny exposition of themes like death, love and life through the friendship and love of a teenager and a septuagenarian woman. The complex Harold is a young man that needs the attention of his indifferent mother. He found in his childhood the only moment that she really seemed to be worried about him after a serious accident in school and he uses to fake suicides trying to have the same attention back. Maude is an anarchist old woman not attached to material stuff like properties or collections that steals cars for self-locomotion. Along a few days, Maude gives a lesson of life to Harold, changing his behavior and feelings forever. The performances of Ruth Gordon and Bud Cort in this weird love story are unforgettable and the soundtrack with Cat Steven's songs is another plus. Unfortunately \"Harold and Maude\" has been forgotten in Brazil by the distributors and neither the VHS nor the DVD has been released in my country; I just have a tape recorded from the cable TV. My vote is eight. Title (Brazil): \"Ensina-me a Viver\" (\"Teach me to Live\")",
         "Over 30 years have passed since Harold and Maude premiered. Since then, there hasn't been a more \"different\" and enjoyable love story about two completely odd people. The story is so unique, it is held in a category all its own. A man, who only feels alive when he's dead is introduced to a woman who is planning on death but lives life day to day. The moral of the movie is to live and to be. I am hoping for a sequel where Harold becomes the old man and influences a young woman who reminds him of the child he once was to live life to the very fullest."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Mildred Lewis and Colin Higgins Productions",
         "Paramount Pictures"
      ],
      "summaries": [
         "Self-destructive and needy but wealthy teenager Harold is obsessed with death and spends his leisure time attending funerals, watching the demolition of buildings, visiting junkyards, simulating suicides trying to get the attention of his indifferent, snobbish and egocentric mother, and having sessions with his psychologist. When Harold meets the anarchic seventy-nine-year-old Maude at a funeral, they become friends and the old lady discloses other perspectives of the cycle of life for him. Meanwhile, his mother enlists him in a dating service and tries to force him to join the army. On the day of Maude's eightieth birthday, Harold proposes to her but he finds the truth about life at the end of hers.",
         "Harold is a depressed, death-obsessed 20-year-old man/child who spends his free time attending funerals and pretending to commit suicide in front of his mother. At a funeral, Harold befriends Maude, a 79-year-old woman who has a zest for life. She and Harold spend much time together during which she exposes him to the wonders and possibilities of life. After rejecting his mother's three attempts to set him up with a potential wife, and committing fake suicide in front of all of them, Harold announces that he is to be married to Maude. However, Maude has a surprise for Harold that is to change his life forever.",
         "Young, rich, and obsessed with death, Harold finds himself changed forever when he meets lively septuagenarian Maude at a funeral."
      ],
      "budget": 1200000
   },
   "movielensId": 1235,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-12-20",
      "dvdReleaseDate": "2000-06-27",
      "directors": ["Hal Ashby"],
      "runtime": 91,
      "movieId": 1235,
      "title": "Harold and Maude",
      "mpaa": "PG",
      "actors": [
         "Ruth Gordon",
         "Bud Cort",
         "Vivian Pickles",
         "Cyril Cusack",
         "Charles Tyner",
         "Ellen Geer",
         "Judy Engles",
         "Shari Summers",
         "Eric Christmas",
         "G. Wood",
         "Tom Skerritt"
      ],
      "imdbMovieId": "0067185",
      "originalTitle": "Harold and Maude",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "u-cOukYeGVM",
         "u5zQYSLy3ec",
         "bVF0o9S5Ex4"
      ],
      "plotSummary": "The young Harold lives in his own world of suicide-attempts and funeral visits to avoid the misery of his current family and home environment. Harold meets an 80-year-old woman named Maude who also lives in her own world yet one in which she is having the time of her life. When the two opposites meet they realize that their differences don’t matter and they become best friends and love each other.",
      "tmdbMovieId": 343,
      "avgRating": 3.96283,
      "releaseYear": "1971",
      "numRatings": 9888,
      "posterPath": "/xqay68babjK46U9WBFD2TmtnGcx.jpg"
   }
}