{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0103130",
      "video": false,
      "title": "Trust",
      "recommendations": [
         47122,
         40156,
         58886,
         29932,
         28526,
         91873,
         33310,
         81931,
         94664,
         226594,
         144994,
         67298,
         73994,
         42657,
         41834,
         39327,
         46986,
         25699,
         47866,
         307692
      ],
      "backdrop_path": "/dxWO4V86N2P4z08XwFoz7TL86i4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Maria Coughlin",
               "gender": 1,
               "credit_id": "52fe463a9251416c9104d7e9",
               "name": "Adrienne Shelly",
               "profile_path": "/2Fdo025mnY9AtniyComSTdKtidC.jpg",
               "id": 66496,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Matthew Slaughter",
               "gender": 2,
               "credit_id": "52fe463a9251416c9104d7ed",
               "name": "Martin Donovan",
               "profile_path": "/bNS43B8maD5A4UYSWy4UjgHru1a.jpg",
               "id": 42993,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jean Coughlin",
               "gender": 0,
               "credit_id": "52fe463a9251416c9104d7f1",
               "name": "Merritt Nelson",
               "profile_path": null,
               "id": 188510,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jim Slaughter",
               "gender": 2,
               "credit_id": "52fe463a9251416c9104d7f5",
               "name": "John MacKay",
               "profile_path": null,
               "id": 170991,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Peg Coughlin",
               "gender": 1,
               "credit_id": "52fe463a9251416c9104d7f9",
               "name": "Edie Falco",
               "profile_path": "/3cPF1o5oag20UXtCYkZeCTtcTFx.jpg",
               "id": 36190,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Anthony",
               "gender": 2,
               "credit_id": "52fe463a9251416c9104d7fd",
               "name": "Gary Sauer",
               "profile_path": null,
               "id": 120674,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ed",
               "gender": 2,
               "credit_id": "52fe463a9251416c9104d801",
               "name": "Matt Malloy",
               "profile_path": "/ian5yLWKo8Ttz8kEZIv9GLNCz2c.jpg",
               "id": 19208,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Diner Guy",
               "gender": 0,
               "credit_id": "58920d739251412dc500969d",
               "name": "Chris Cooke",
               "profile_path": null,
               "id": 188721,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Uncle Leo",
               "gender": 0,
               "credit_id": "58920d919251412dcd0091d7",
               "name": "Leo Gosse",
               "profile_path": null,
               "id": 1748666,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Robert",
               "gender": 0,
               "credit_id": "58920df49251412dd4008b21",
               "name": "Jeff Howard",
               "profile_path": null,
               "id": 1195367,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe463a9251416c9104d7df",
               "name": "Hal Hartley",
               "profile_path": "/iDOwoscPZqn8VUEoxawerZRBXJd.jpg",
               "id": 91343,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe463a9251416c9104d7e5",
               "name": "Hal Hartley",
               "profile_path": "/iDOwoscPZqn8VUEoxawerZRBXJd.jpg",
               "id": 91343,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5763151fc3a36808170000c0",
               "name": "Jerome Brownstein",
               "profile_path": null,
               "id": 1534634,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5763152bc3a36807df0000da",
               "name": "Hal Hartley",
               "profile_path": "/iDOwoscPZqn8VUEoxawerZRBXJd.jpg",
               "id": 91343,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5763153b9251410b480000b6",
               "name": "Bruce Weiss",
               "profile_path": null,
               "id": 54893,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5763155a9251410b3c0000be",
               "name": "Nick Gomez",
               "profile_path": "/aBMQnvk2zayzgfWrp0rS0Ji1xIs.jpg",
               "id": 84760,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57631575c3a36807f70000f0",
               "name": "Nick Gomez",
               "profile_path": "/mpV7F62c83IcRNjm4ei6ZMwRtfQ.jpg",
               "id": 17278,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57f2d0c49251410c25002ded",
               "name": "Michael Spiller",
               "profile_path": null,
               "id": 65506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "58920e1fc3a3680970008e26",
               "name": "Kelly Reichardt",
               "profile_path": "/7pZjIomEh70Dkhr52aKpAqhx3mQ.jpg",
               "id": 56383,
               "department": "Costume & Make-Up",
               "job": "Wardrobe Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.055059,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 37291,
      "vote_count": 38,
      "budget": 700000,
      "overview": "After being thrown away from home, pregnant high school dropout Maria meets Matthew, a highly educated and extremely moody electronics repairman. The two begin an unusual romance built on their sense of mutual admiration and trust.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         97630,
         101,
         205,
         141,
         339692,
         281957
      ],
      "original_title": "Trust",
      "runtime": 107,
      "poster_path": "/kAO8LRlMUUXJHuQOwA4TNDdgjTG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zenith Entertainment",
            "id": 3644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Republic Pictures (II)",
            "id": 10348,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "True Fiction Pictures",
            "id": 37909,
            "origin_country": ""
         }
      ],
      "release_date": "1990-09-09",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "A slightly twisted comedy",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Hal Hartley"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Hal Hartley"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103130/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTQxMjM2MjQ0OF5BMl5BanBnXkFtZTcwMzYzMzYyOQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Adrienne Shelly, Martin Donovan, Rebecca Nelson | See full cast and crew »"],
      "reviews": [
         "Trust me, this is one of the best made movies of all times. I cannot believe that more people don't know about this movie. It has a great story, brilliant acting and it's really funny. This is like the best Inde movie ever. But just see it for yourself and if you like it tell someone about it, because although it is a small film, it is great American art and should be recognized.",
         "I didn't understand it right after the first viewing, but 'Trust' certainly is of Hal Hartley's finest works, excelled only by the somewhat more conventional drama 'Henry Fool'. As with many other of Hartley's earlier works, it takes a while to let the film sink into you. But with the second viewing one starts to appreciate the film's subtilities, both the dry absurd humour and the fine, deeply compassionate portraits of the characters. The story starts up with a scene typical for Hartley: rebellious teenager Maria Coughlin informs her parents that not only will she drop out of high school, she is also pregnant. A quarrel takes place, and when her father calls her 'slut' she slaps him in the face. He drops down dead. The movie can begin. Things get ugly for Maria. Her boyfriend, a chauvinist pig, leaves her when she informs him that she's pregnant, claiming he's not the father anyway. And at home her mother waits for her and coolly claims that since Maria's killed her husband, she is now forever in her mother's debt and have to work for her. Never again will she do housework... This is when she meets up with Matthew Slaughter, a truly gifted engineer but with a somewhat sociopathic behaviour, and filled to the brim with anger and hatered. Martin Donovan truly does an outstanding portrait of Matthew, and perfectly manages to forge his paradoxal feelings of extreme anger and vulnerability into a fully working unit. A deeply moving story of two scarred, somewhat maladjusted souls manage to find each other, told in a low-key mood that doesn't get to you immediately. But eventually it does, and when it does...you're hooked. 8/10",
         "I had the honor of viewing this, one of Hal Hartley's first films, last night. This being 2006, needless to say it has been some time since my first viewing of this very special film. This is the kind of movie that I recommend to certain friends and younger people I know (I first viewed it when very young). So many moments sit in my mind unnoticed until another viewing years after the last. An amazing tale of growth and awakening in a world that often does not present itself as being conducive to growth. The dialog is pure Hartley (if you are unfamiliar with his films I would recommend this as a good place to start). Halfway between John Hughes and Samuel Beckett. The actors portray their awakenings delicately and with precision. Please see this film!",
         "I stumbled across this movie about midway through on IFC one morning...I was hooked! I couldn't look away. I had to see it from the beginning, all the way through, as it was meant to be viewed. I studied the IFC programming schedule well into the future in order to see this movie again. Eventually I did. Several times. And even now I'm still haunted by it. Some films don't stand up to repeated viewings very well however this one does. This movie has moved me as much as any movie ever has in my life. Do a friend a favor, turn em on to this one, but don't tell them ANYTHING about it beforehand(need that really be said?), let em experience it for themselves. My next goal is to own this movie in some form or another one day. It'll be a welcome addition to my collection.",
         "I first saw this film in 1990 while I was in college and I loved it. I watched it over and over on VHS. I told everyone that this was my favorite movie of all time and watched every Hal Hartley movie I could find. Last night I stumbled across Trust on Netflix Instant and I thought I'd check it out to see if this film that I was so passionate about when I was 20 years old held up over time or if the 40 year old me would find it silly or dated. To my surprise I was blown away all over again by how ridiculously great it is. The smart stylized dialog, the music, the starkness, the silences, the camera framing, all of the whacked out but fully human characters, Martin Donovan and Adrienne Shelly so young and beautiful. As the final, simple, beautiful, frame of the film disappeared and credits rolled I was left sitting on the couch in a state of shocked amazement at the effect this film still has on me. Hands down my favorite movie of all time!",
         "TRUST (1990) *** Adrienne Shelly and Martin Donovan shine as a pregnant, naive teen who is befriended by troubled loner-type, respectively, in this sharply written satire/black comedy/and at times gimmicky bloodless acting (but that's also the warped appeal) that brings into question the monotony of dreary jobs, thankless relationships and bad parenting. Directed by Hal Hartley in his signature solemnity.",
         "I caught this movie on the television network Bravo. I didn't see the very beginning but found myself glued to the machinations of the Matthew Slaughter character. I felt the performance of Martin Donavan was wonderful and I enjoyed the odd way the characters spoke with one another. The lines were rapid-fire, almost like \"Moonlighting\", but with a different nuance which I can't quite put my finger on. The movie was funny, but the best word for it is \"interesting\". It truly was a movie unlike any other I had seen, with a Coen Brothers sense of humor. I wish I knew more people who had seen it, because it is a movie that warrants discussion afterward.",
         "Watching Hal Hartley's Trust for the second time 15 years later is exhilarating and somewhat disappointing. The characters are contrived and overintellectualized, and the conflict between parent and child here doesn't ring true (it seems to have the usual bitterness of college sophomores). Also the gestures and dialogue are stagy and slightly pretentious. Never mind that; you're missing the point. The film is not aiming at realism; it's aiming at conveying the emotional turbulence of young adult struggling to break free from the orbit of their parents. Plot and incident flow naturally and often end up in unexpected places. There's lots of surprises, many of them comic. The film is about throwing characters together and watching how they react. The moment where the girl messes up the kitchen makes you wonder, how will the father react? The dialogue (reminiscient of Stoppard or Mamet) is curt and enigmatic and challenging. And always entertaining. People are learning from one another and changing..possibly improving. The movie Trust is less about plot than a certain attitude toward life--how much trust should we place in family, friends, peers? People don't have secrets or histories; they have metaphysical complaints and frustrated dreams. Martin Donovan and Adrienne Shelly are not only young charismatic actors, they act and react with subtlety and focus. Yet both have chemistry with one another and manage to sustain this intensity without going too far (Kudos to Mr. Hartley for not aiming for sympathy or making motives too transparent). Donovan seems adept at playing characters about to boil under, but manage to hold it in (He's at his best in the film Surviving Desire,). Adrienne, that moment when you put on your glasses at the end was a great cinematic moment. Hopeful, assertive and maybe even cocky. Your fans will always have that moment to remember you by. If you liked Trust, you'd also enjoy: Hartley's Surviving Desire (although it's more arty), Jill Sprecher's 13 Conversations about One Thing and her earlier film, Clockwatchers).",
         "This is the film that made the film world (well, a tiny corner of the film world, anyway) sit up and take notice of an up-and-coming filmmaker named Hal Hartley. Trust exists as a unique little motion picture, a movie which creates a world which manages to be both ridiculous and real at the same time, a mixture mirroring the absurdity which, often times, dominates the structure of actual life. The most remarkable thing about this movie, though, is its ability to craft a charmingly sweet love story in the center out of what seems to be utter emptiness. Martin Donavan and Adrienne Shelley portray two characters, the likes of which I would challenge you to find carbon copies of anywhere in celluloid history. They are real, honest sketches of humanity, and with them Hartley is able to explore why and how we fall in love, and whether you agree with his interpretation of what is love, his love story comes across loud and clear. I once had a professor who claimed there are no new stories to be told. Well, I think Mr. Hartley may have stumbled across one...no, make that, calculatedly made one.",
         "I had heard about this film but never got myself around it to watch it. But one night I had nothing to do so I decided to rent a movie. I came across Trust and rented it and I loved it. It had a great story, brilliant acting and character development. The direction was excellent. It is a movie that is pretty hard to desribe and I am not the one who should be writing to many words about it but I really liked the movie and recomend every movie fan to see it."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Republic Pictures (II)",
         "True Fiction Pictures"
      ],
      "summaries": ["When high school dropout Maria Coughlin announces her pregnancy to her parents, her father drops dead on the floor. Her mother kicks her out of the house and her boyfriend dumps her, so Maria is left alone and homeless. This is when she meets Matthew Slaughter. Matthew is an educated high school graduate with a great talent for fixing electronic devices, but he can't hang on to a job because of his principled attitude towards quality. When Maria accepts Matthew's offer to help her, they begin to form a relationship with each other in which both of them begin to change."],
      "budget": 700000
   },
   "movielensId": 1236,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-09-09",
      "dvdReleaseDate": null,
      "directors": ["Hal Hartley"],
      "runtime": 107,
      "movieId": 1236,
      "title": "Trust",
      "mpaa": "R",
      "actors": [
         "Adrienne Shelly",
         "Martin Donovan",
         "Merritt Nelson",
         "John MacKay",
         "Edie Falco",
         "Gary Sauer",
         "Matt Malloy",
         "Chris Cooke",
         "Leo Gosse",
         "Jeff Howard"
      ],
      "imdbMovieId": "0103130",
      "originalTitle": "Trust",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["pIgv4Tvx3V0"],
      "plotSummary": "After being thrown away from home, pregnant high school dropout Maria meets Matthew, a highly educated and extremely moody electronics repairman. The two begin an unusual romance built on their sense of mutual admiration and trust.",
      "tmdbMovieId": 37291,
      "avgRating": 4.02248,
      "releaseYear": "1990",
      "numRatings": 1023,
      "posterPath": "/kAO8LRlMUUXJHuQOwA4TNDdgjTG.jpg"
   }
}