{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "scotland",
            "id": 388
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "village life",
            "id": 1842
         },
         {
            "name": "petrol",
            "id": 5175
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "millionaire",
            "id": 33626
         }
      ],
      "imdb_id": "tt0085859",
      "video": false,
      "title": "Local Hero",
      "recommendations": [
         21764,
         11898,
         14320,
         32961,
         28580,
         32255,
         38291,
         851,
         28162,
         26748,
         976,
         198,
         26516,
         8816,
         14675,
         695,
         3085,
         1888,
         13697,
         15598
      ],
      "backdrop_path": "/c1CCYZpuXF58G0ebPnzolnxtxRI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Felix Harper",
               "gender": 2,
               "credit_id": "52fe44179251416c750287b9",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mac",
               "gender": 2,
               "credit_id": "52fe44179251416c750287bd",
               "name": "Peter Riegert",
               "profile_path": "/yPgaRZBMVy9eoNNuiPIm0wzG9sD.jpg",
               "id": 20899,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe44179251416c750287c1",
               "name": "Fulton Mackay",
               "profile_path": "/7fHiboXoEr2zPZGvD33Ln3VWSrH.jpg",
               "id": 68686,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Urquhart",
               "gender": 2,
               "credit_id": "52fe44179251416c750287c5",
               "name": "Denis Lawson",
               "profile_path": "/nxPR7KIlJ4CPPI2hniTUk6bu9fA.jpg",
               "id": 47698,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Moritz",
               "gender": 2,
               "credit_id": "52fe44179251416c750287e7",
               "name": "Norman Chancer",
               "profile_path": "/qLKyW9MHMT4TU00CyQt14pSsJzM.jpg",
               "id": 116123,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Oldsen",
               "gender": 2,
               "credit_id": "52fe44179251416c750287eb",
               "name": "Peter Capaldi",
               "profile_path": "/elySeUbCxDkBq83GwinPnfcLs5t.jpg",
               "id": 12982,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Watt",
               "gender": 2,
               "credit_id": "52fe44179251416c750287ef",
               "name": "Alex Norton",
               "profile_path": "/6NBHkySxy9byJypdTFUJmAZ9f4W.jpg",
               "id": 2451,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Marina",
               "gender": 1,
               "credit_id": "52fe44179251416c750287f3",
               "name": "Jenny Seagrove",
               "profile_path": "/9hdSZS8XnJkGpn89BiNpwoxxbyo.jpg",
               "id": 36820,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Stella",
               "gender": 1,
               "credit_id": "52fe44179251416c750287f7",
               "name": "Jennifer Black",
               "profile_path": null,
               "id": 116125,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Victor",
               "gender": 2,
               "credit_id": "52fe44179251416c750287fb",
               "name": "Christopher Rozycki",
               "profile_path": "/o4LRcXy77DAujwG4mMav1cPhvaZ.jpg",
               "id": 116126,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Rev Macpherson",
               "gender": 0,
               "credit_id": "52fe44179251416c750287ff",
               "name": "Gyearbuor Asante",
               "profile_path": null,
               "id": 116127,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Cal",
               "gender": 2,
               "credit_id": "52fe44179251416c75028803",
               "name": "John M. Jackson",
               "profile_path": "/cgBh0ds37j0Ek58UruzLWpg4wly.jpg",
               "id": 116128,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Donaldson",
               "gender": 2,
               "credit_id": "52fe44179251416c75028807",
               "name": "Dan Ammerman",
               "profile_path": null,
               "id": 116129,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Roddy",
               "gender": 0,
               "credit_id": "52fe44179251416c7502880b",
               "name": "Tam Dean Burn",
               "profile_path": "/9KvZPsDzvP58t1vIvEK0m1x36YZ.jpg",
               "id": 116130,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Ricky",
               "gender": 2,
               "credit_id": "52fe44179251416c7502880f",
               "name": "John Gordon Sinclair",
               "profile_path": "/aXTPbcgvx7INee8DIqwuZztYVq7.jpg",
               "id": 97884,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Geddes",
               "gender": 0,
               "credit_id": "52fe44179251416c75028819",
               "name": "Rikki Fulton",
               "profile_path": null,
               "id": 105964,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Iain",
               "gender": 2,
               "credit_id": "52fe44179251416c7502881d",
               "name": "Jimmy Yuill",
               "profile_path": "/zeuinVj4XOYzWSty96mM3SaD1mB.jpg",
               "id": 151797,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44179251416c750287cb",
               "name": "Bill Forsyth",
               "profile_path": "/1Rj3G4XohiUGF9h8axgQecrS7tl.jpg",
               "id": 68687,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c750287d1",
               "name": "David Puttnam",
               "profile_path": null,
               "id": 8967,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c750287d7",
               "name": "Mark Knopfler",
               "profile_path": "/ovtwGIDrKHFyW7XkMTBBavtDSK2.jpg",
               "id": 8271,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c750287dd",
               "name": "Chris Menges",
               "profile_path": null,
               "id": 8969,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c750287e3",
               "name": "Michael Bradsell",
               "profile_path": null,
               "id": 23865,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5727944e9251415f10000be0",
               "name": "Bill Forsyth",
               "profile_path": "/1Rj3G4XohiUGF9h8axgQecrS7tl.jpg",
               "id": 68687,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57279460c3a3681da2000469",
               "name": "Iain Smith",
               "profile_path": "/3jhs9gdWhLBsKgOIKzmWnrkX0xD.jpg",
               "id": 8374,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "572794829251417744006af4",
               "name": "Roger Murray-Leach",
               "profile_path": null,
               "id": 8936,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5727948ec3a3685871003aec",
               "name": "Adrienne Atkinson",
               "profile_path": null,
               "id": 1484143,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5727949a9251415f10000bf0",
               "name": "Frank Walsh",
               "profile_path": null,
               "id": 37301,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "572794d19251417744006b0c",
               "name": "Ian Watson",
               "profile_path": null,
               "id": 1402392,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.392453,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 11235,
      "vote_count": 100,
      "budget": 0,
      "overview": "An American oil company sends a man to Scotland to buy up an entire village where they want to build a refinery. But things don't go as expected.",
      "similar": [
         197,
         11069,
         9362,
         10829,
         97370,
         11780,
         1049,
         10891,
         276488,
         91902,
         880,
         208708,
         890,
         43355,
         5179,
         10573,
         32032,
         135990,
         10864,
         77517
      ],
      "original_title": "Local Hero",
      "runtime": 111,
      "poster_path": "/elpcU8vLuxq92qDJD2tBrwTtH4a.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Enigma Productions",
            "id": 7049,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Goldcrest Films International",
            "id": 500,
            "origin_country": ""
         }
      ],
      "release_date": "1983-02-17",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill Forsyth"],
      "runtime": 111,
      "synopsis": null,
      "writers": ["Bill Forsyth"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0085859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMzE1NDg2NV5BMl5BanBnXkFtZTcwNjg2ODIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Burt Lancaster, Peter Riegert, Fulton Mackay | See full cast and crew »"],
      "reviews": [
         "I have no idea what provoked me to see this film in the theatre lo those many years ago, but I am grateful to the serendipity which has brought this piece of magic into my life. I am constantly amazed that a piece of fiction (and not even a written one) could have such an impact on my heart and soul. From the edgy humor of Happer's encounters with his analyst (I will always consider this to be Mr. Lancaster's most charming performance in a body of excellent work) to the poignant scene in which (an albeit drunken) Mac confesses his coveting Gordon's life, this film draws me in like no other. Whenever I am asked my favorite film, I answer Local Hero without hesitation - there is never a question of its position on my list. I must confess, I am surprised there are no other reviews of Local Hero by women. I've always found the lyrical nature of the film to have a distinctly female sensibility. But on the other hand, I don't know any other women beyond myself who have seen it (or recall having seen it). The best recommendation I can make for this film is, when I find the world closing in on me, I watch Local Hero. I smile. I laugh. I even cry a bit. But most importantly, I come away knowing that I might someday find that very possible magic in my life.",
         "A real sleeper of a movie. I rented it without knowing anything about this film beforhand and was taken prisoner from start to finish. I honestly didn't want the movie to end. Full of interesting and amusing characters, a terrific musical score, wryly satirical without being demeaning of anyone; it invites you into a totally believable world where you begin to care about the fate of everyone and there are no false notes in the script, direction or performances. If anyone ever doubted the importance of a screenplay in the success of a movie or thought that a big budget, lots of pyrotechnics and loads of special effects could cover up a movie's shortcomings - see this film. It should be required at all film schools as an example of what can be accomplished on a little budget but with good ideas and lots of talent. A perfect 10 - times 2!",
         "I consider this one of the 10 best movies I've ever seen (and to paraphrase John Cleese from LIFE OF BRIAN, I've seen a few). It is definitely the funniest movie of the 80's, just ahead of RAISING ARIZONA. And although LOCAL HERO and RAISING ARIZONA are quite dissimilar films, they do share one distinction: they were both made in the 80's, yet they go totally against the grain of movies made during that decade. All the shallow, cheap, go for the simple-minded lowest common denominator audience garbage that was so much a part of the 80's is missing here. What is most special about LOCAL HERO to me is how it not only respects it's audience, but seems to show an against-all-odds affection for humanity that INCLUDES the audience. Bill Forsyth cares about every character that inhabits his film, and in a very gentle, open-handed way he seems to want to share his characters with the audience so that the audience might see the best of themselves in some aspect of those characters. I can understand why Forsyth didn't develop into a major moviemaker in Hollywood, in the same way that I can understand why some people find this movie boring. But somehow, to me, keeping this movie alive along with all its' other fans is part of a cockeyed optimism about people that, these days, seems to be very much against-the-grain.",
         "Some may be turned off by the apparent disregard of plot. Amazing characters, scenery and music make this a truly brilliant movie. It's a movie that may not be fully appreciated until you've seen it three or four times. Burt Lancaster steals the show in a small role. Peter Riegert is perfectly cast as a lost American who finds a place where he belongs. The memorable scenes are countless: the aurora borealis show, the eccentric beachcomber who offers to sell for a dollar per grain of sand in his hand, the injured rabbit, Riegert proposes to trade places with Gordon, etc., etc., etc. Mark Knofler's music is worth the price of admission alone. Definitely one of my all-time favorites.",
         "I first saw this movie 1,000 miles from home. I was on business, staying in an outlying hotel, no car, no evening plans. So I walked 1/2 mile to a local 2-plex (!) theater. The choices were Max Dugan Returns and, starting 15 minutes later, Local Hero. The theater manager said the first one was a real good comedy, and he didn't know what Local Hero was about. I said I'd start with Dugan and switch if I didn't like it, and he said OK. The Neil Simon, Jason Robards, Marsha Mason movie was ho-hum, totally predictable, formula claptrap, so I ducked into Local Hero. WHAT A SURPRISE !!! I was alone in the theater, laughing continuously, thrilled by this wonderful movie. What a joy! When I left, still smiling, the manager asked me how I liked it. I told him it was a sure Oscar winner (wrong, alas) and the best film I'd seen in years. He was amazed. I hope he sat in on it. I hope you do too. Here's the key - - EVERY TIME I encounter this movie on TV I stop what I'm doing and watch it. I once arrived at a hotel after midnight, tired and with a meeting at 8:00 am. I flipped on the TV while I unpacked and there it was, just a little past the beginning. I sat on the end of the bed for an hour, then pulled up a chair. I finished unpacking when it was over! Just whose baby is that, anyway? You'll find out! {:-)",
         "Simply my favorite movie ever. Never fails to warm my heart, even after many, many viewings. Beautifully written, filmed, acted- everything works. I loved the whole movie, but especially the last scene. It just sums up the whole movie for me- friendship, not the material, is ultimately all that matters. Great writing; a dozen well-developed characters. Gentle good humor, without demeaning anyone. A beautiful score, that fit the mood of the movie perfectly. Can't say enough about this movie- see it, see it, see it!",
         "I really cannot praise Local Hero enough; it is simply one of the best films ever made and certainly, without any shadow of doubt, my number one favourite movie of all time. Fans of Ealing Comedy will relate to this film instantly. The humour is extremely subtle, going for the quirkiness of human behaviour rather than prefabricated belly-laughs. For example, the two farmers arguing which is the better vehicle for transporting winter lambs, Massarati or Rolls Royce. And the African preacher who has to explain that he's \"not Scottish either\" but still has the surname McPhearson. At first glance, the story of Local Hero is hardly one which would engage fevered interest. A big Texan oil company wants to buy a huge chunk of Scottish coastline and a representative is flown over to close the deal. Chosen because it's thought he is of Scottish origin, McIntyre (Peter Riegert) complains to a colleague that he could do the deal over the wires in an afternoon and that his parents chose the surname when they got off the boat from Hungary because they thought it sounded American. But what grabs the attention and is the fundamental beauty to the film is \"Mac's\" journey from a materialistic Texan yuppie to one who falls in love with the simple things of life and by the film's end, when Mac returns home, has been changed forever by his trip. Mac plays his part very well from a character who depends on his expensive suits, his Porsche, quad hi-fi and personal health insurance to one who collects shells on a Scottish beach and drinks 40 year-old malt whisky in the bosom of the small community that he suddenly finds himself a part of. Burt Lancaster plays the wonderfully eccentric oil company CEO who is more concerned with dicovering a comet of his own than making millions of dollars. Then of course there is Denis Lawson as the estate agent / taxi driver / hotelier, Peter Capaldi as the bungling company trainee and Jenny Seagrove who prefers being underwater to life on land, along with all the various yokels and locals that give this film its very unique charm. And the plot twist? A fabulously subtle one-liner that gives the whole thing away. But of course, one cannot talk about this movie without mentioning the soundtrack. Many years ago I felt compelled to watch this movie because (being a big Dire Straits fan at the time) i had the soundtrack and was instantly hooked. Mark Knopfler does sterling work in adding musical flavour to the film. Lazy acoustic guitars match perfectly the breath-taking scenary that the director, Bill Forsyth, has captured of the Scottish Highlands. Overall, I would have no hesitation in recommending this film to people. Every recommendation I've made has been met with the same response: a gem of a movie that simply cannot be ignored. Local Hero will be my own personal number one for ever! 10/10",
         "I first saw this film in 1985 only because I had heard that Mark Knopfler did the soundtrack. After watching Local Hero, however, I was ready to pack my bags and move to a picturesque seaside village on the coast of Scottland. I fell in love with this movie. There is subtle humor, gorgeous scenery, a great story, and memorable characters. When the TV show Northern Exposure came out, I was amazed at the similarities between the show and Local Hero. An American professional accustomed to fast paced city living finds himself in a quirky town in the middle of nowhere. Even the resemblance of Peter Riegert playing Mac and Rob Morrow as Fleishman is striking. But when the episode of Northern Exposure aired where the famous Russian comes to town and performs in the local bar while the female store owner swoons, I nearly laughed myself off the couch. There was an identical scene in Local Hero. Local Hero captured a certain magic and mystery; haunting and poetic while remaining lighthearted and warming. One could not blame the creators of Northern Exposure for wanting to capture that same magic, but they could have been just a little more original. I love Bill Forsythe's movies. He is truly a master of the simple movie that tells a terrific story. Less is more. Also, Mark Knopfler delivers some of his finest music ever.",
         "This cinematic piece of enchantment has been aptly praised in the other reviews preceding this one. I really didn't know what to expect when I saw this on cable, but it became an instant favorite. It is so true, so touching, that I felt pangs of sadness when it came to an end. A hopeful end, to be sure. I used to wonder about the casting of Peter Riegert in the lead (I think Dennis Leary would have been perfect in this role). But after several viewings, I have grown to like and appreciate Riegert's performance very much. (I'm one of those superficial twits who perfer good-looking leading men like Sam Neill and Brad Pitt.) And Riegert's non-Scottish appearance is taken care of in the script. Any movie that can raise the consciousness of its audience without preaching is a rarity, and this beautiful film manages to do just that. Certainly one of the best films ever made.",
         "A refreshing change of pace; a whimsical, off-beat comedy with just enough plot to keep it going, just enough surprises in it to keep it interesting, and lots of great characters played by actors who really deliver. The music by Mark Knopfler of Dire Straits adds richness to the experience, and the cinematography vividly contrasts tangled, sterile, modern-day Houston with the cool, gorgeous, emerald green Scottish landscape and the peaceful, pristine coastal village of Furness. Well worth the trip."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Enigma Productions",
         "Goldcrest Films International"
      ],
      "summaries": [
         "Oil billionaire Happer sends Mac to a remote Scotish villiage to secure the property rights for an oil refinery they want to build. Mac teams up with Danny and starts the negotiations, the locals are keen to get their hands on the 'Silver Dollar' and can't believe their luck. However a local hermit and beach scavenger, Ben Knox, lives in a shack on the crucial beach which he also owns. Happer is more interested in the Northern Lights and Danny in a surreal girl with webbed feet, Marina. Mac is used to a Houston office with fax machines but is forced to negotiate on Bens terms.",
         "An American oil company sends a man to Scotland to buy up an entire village where they want to build a refinery. But things don't go as expected."
      ],
      "budget": 0
   },
   "movielensId": 1238,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-02-17",
      "dvdReleaseDate": "1999-09-21",
      "directors": ["Bill Forsyth"],
      "runtime": 111,
      "movieId": 1238,
      "title": "Local Hero",
      "mpaa": "PG",
      "actors": [
         "Burt Lancaster",
         "Peter Riegert",
         "Fulton Mackay",
         "Denis Lawson",
         "Norman Chancer",
         "Peter Capaldi",
         "Alex Norton",
         "Jenny Seagrove",
         "Jennifer Black",
         "Christopher Rozycki",
         "Gyearbuor Asante",
         "John M. Jackson",
         "Dan Ammerman",
         "Tam Dean Burn",
         "John Gordon Sinclair",
         "Rikki Fulton",
         "Jimmy Yuill"
      ],
      "imdbMovieId": "0085859",
      "originalTitle": "Local Hero",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["nufb3JysCgY"],
      "plotSummary": "An American oil company sends a man to Scotland to buy up an entire village where they want to build a refinery. But things don't go as expected.",
      "tmdbMovieId": 11235,
      "avgRating": 3.95991,
      "releaseYear": "1983",
      "numRatings": 3355,
      "posterPath": "/6uYYGXYZluoxloY7uIpFkvKwq8z.jpg"
   }
}