{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         },
         {
            "name": "graduate",
            "id": 171206
         },
         {
            "name": "rape accusation",
            "id": 171219
         }
      ],
      "imdb_id": "tt0061722",
      "video": false,
      "title": "The Graduate",
      "recommendations": [
         3116,
         642,
         903,
         654,
         10774,
         284,
         599,
         9277,
         990,
         829,
         968,
         3090,
         239,
         9576,
         702,
         1092,
         475,
         963,
         1051,
         288
      ],
      "backdrop_path": "/sEWKMIlgUCCb2n5mT0Mf71DRKLR.jpg",
      "revenue": 104945305,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ben Braddock",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d0a7",
               "name": "Dustin Hoffman",
               "profile_path": "/3pZx8NB30KIw31rBAT62TUDQFEb.jpg",
               "id": 4483,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Mrs. Robinson",
               "gender": 1,
               "credit_id": "52fe46369251416c9104d0a3",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Elaine Robinson",
               "gender": 0,
               "credit_id": "52fe46369251416c9104d0ab",
               "name": "Katharine Ross",
               "profile_path": "/y1cEn3cLcUd5hnfSwqUdhUsDbiG.jpg",
               "id": 9594,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mr. Robinson",
               "gender": 0,
               "credit_id": "52fe46369251416c9104d0af",
               "name": "Murray Hamilton",
               "profile_path": "/zSkAeg5lGbyZWwYZYunl3HR8jHb.jpg",
               "id": 8608,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Taft Hotel Desk Clerk",
               "gender": 0,
               "credit_id": "52fe46369251416c9104d0b3",
               "name": "Buck Henry",
               "profile_path": "/1RVDoUYK85mynMCU7mom7B1TQqC.jpg",
               "id": 7795,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Carl Smith",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d0b7",
               "name": "Brian Avery",
               "profile_path": "/2JUIGCOgpAgqbpuWtR9tVQjvJZ9.jpg",
               "id": 30050,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mr. McGuire",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d0bb",
               "name": "Walter Brooke",
               "profile_path": null,
               "id": 94402,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mr. Braddock",
               "gender": 0,
               "credit_id": "52fe46369251416c9104d0d1",
               "name": "William Daniels",
               "profile_path": "/1SCR6im2maiASfTD5h7r0g9dU78.jpg",
               "id": 10775,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Mrs. Braddock",
               "gender": 0,
               "credit_id": "52fe46379251416c9104d0f3",
               "name": "Elizabeth Wilson",
               "profile_path": "/p3i4swng6y0s31ktDXMrwjvejM0.jpg",
               "id": 10776,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Mr. McCleery",
               "gender": 2,
               "credit_id": "52fe46379251416c9104d0f7",
               "name": "Norman Fell",
               "profile_path": "/dRXygz30GtDPswkF59iJUSJCBT7.jpg",
               "id": 14064,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Mrs. Singleman",
               "gender": 1,
               "credit_id": "52fe46379251416c9104d0fb",
               "name": "Alice Ghostley",
               "profile_path": "/jXaAaXmnO0ozyot4tNnsCBk0dYZ.jpg",
               "id": 8495,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Miss DeWitte",
               "gender": 1,
               "credit_id": "52fe46379251416c9104d0ff",
               "name": "Marion Lorne",
               "profile_path": "/vnKNE0UIQhnzbgpde9ByQ7cG8PB.jpg",
               "id": 12501,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Woman on Bus",
               "gender": 0,
               "credit_id": "52fe46379251416c9104d103",
               "name": "Eddra Gale",
               "profile_path": null,
               "id": 5687,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Boarding House Student",
               "gender": 2,
               "credit_id": "5aa0d49b0e0a2644d80011ef",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46369251416c9104d0c1",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46369251416c9104d0c7",
               "name": "Calder Willingham",
               "profile_path": null,
               "id": 10769,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46369251416c9104d0cd",
               "name": "Buck Henry",
               "profile_path": "/1RVDoUYK85mynMCU7mom7B1TQqC.jpg",
               "id": 7795,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46369251416c9104d0d7",
               "name": "Charles Webb",
               "profile_path": null,
               "id": 959701,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe46379251416c9104d0dd",
               "name": "Robert Surtees",
               "profile_path": "/6CuhH7m0KvjbR088xyaJurddfZH.jpg",
               "id": 10005,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe46379251416c9104d0e3",
               "name": "Sam O'Steen",
               "profile_path": null,
               "id": 12015,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46379251416c9104d0e9",
               "name": "Richard Sylbert",
               "profile_path": null,
               "id": 12017,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe46379251416c9104d0ef",
               "name": "Patricia Zipprodt",
               "profile_path": null,
               "id": 961075,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 27.660452,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37247,
      "vote_count": 1066,
      "budget": 3000000,
      "overview": "Benjamin, a recent college graduate is very worried about his future, he then finds himself in a love triangle with an older woman and her daughter.",
      "similar": [
         11931,
         10030,
         50124,
         226,
         72207,
         796,
         86331,
         19913,
         979,
         263472,
         277547,
         1259,
         8469,
         1643,
         427900,
         288036,
         24,
         319,
         320,
         1826
      ],
      "original_title": "The Graduate",
      "runtime": 106,
      "poster_path": "/AuFvrbtWSPiBPIv9ewH2DV4nhCD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lawrence Turman",
         "id": 8793,
         "origin_country": ""
      }],
      "release_date": "1967-12-21",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "This is Benjamin. He's a little worried about his future.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Nichols"],
      "runtime": 106,
      "synopsis": "The film explores the life of 21-year-old Ben Braddock ( Dustin Hoffman) shortly after earning his bachelor's degree from an unnamed college in the Northeast. The school is widely believed to be Williams College, Webb's alma mater (in the opening sequence of the movie, Dustin Hoffman, playing Benjamin Braddock, is wearing a Williams College tie). Benjamin is seen arriving at LAX International Airport over the opening credits. The movie really begins at a party that same evening celebrating his graduation at his parents' house in Pasadena, a suburb of Los Angeles. Benjamin is visibly uncomfortable at the party attended by his parents' friends. He remains aloof while his parents deliver accolades and neighborhood friends ask him about his future plans. Benjamin escapes from each person who comes to congratulate him, exposing his seeming embarrassment at all the honors he had won at college. Mrs. Robinson ( Anne Bancroft), the neglected wife of his father's law partner, asks Benjamin to drive her home, which he reluctantly does. We never learn Mrs. Robinson's first name (or, indeed, the first names of any of Benjamin's and Elaine's parents) during the course of the film (in the novel, we are told that the initial of Mrs. Robinson's first name is G). Arriving at her home, she pleads for Benjamin to come inside, saying that she doesn't like to enter a dark house alone. Once inside, she forces a drink on him, and later exposes herself to him offering to have an affair with him. This scene, known as the \"Mrs. Robinson, you are trying to seduce me\" scene, as said by Benjamin, is said to be one of the most iconic scenes in the film. She, for no clear reason, does attempt to seduce him, removing her clothing. Mr. Robinson arrives home a few minute later, but does not see or suspect anything. Initially flustered and shocked by her advances, Benjamin flees into the night. A few days later Benjamin contacts Mrs. Robinson and clumsily organizes a tryst at a hotel beginning their affair. A now confident and relaxed Benjamin spends the summer drifting around in the pool by day and seeing Mrs. Robinson at the hotel by night. Benjamin is clearly uncomfortable with sexuality, but he is drawn into the affair with the older, but still attractive, Mrs. Robinson. Their affair appears to last most of the summer. All of their scenes pass in a musically-backed montage, showing the endless pass of time. One scene is edited so that it appears Benjamin is walking directly from his parents' dining room into the hotel room he shares with Mrs. Robinson. This seems to accent the separation of he and his parents, though they still live under the same roof. Benjamin discovers that they have nothing to talk about but, she refuses to talk and only wants sex. After pestering her one evening, Mrs. Robinson tells Benjamin that she was forced to give up college and marry someone she didn't love when she became pregnant with her daughter Elaine. Meanwhile, Benjamin is hounded by his father to select a graduate school to attend. Benjamin, clearly not interested in pursuing his studies, shrugs off his father's wishes and spends his time lounging about and sleeping with Mrs. Robinson. His affair may serve as an escape from his lack of direction or ambition, and his fear and anxiety of his impending future. Mr. Robinson, unaware of his wife's budding affair, encourages Benjamin to call on his daughter, Elaine ( Katharine Ross). Benjamin's parents also repeatedly encourage him to date her. During one liaison, Mrs. Robinson forces a promise from Ben to never date Elaine. Whether out of fear of Mrs. Robinson, or sensing that getting involved with the daughter of his lover could be disastrous, he tries to avoid it. However, because of the three parents' persistent intervention, he is essentially forced to date her. Therefore, he tries to ensure his date with her will be a disaster so she would not want to pursue a relationship with him. He drives recklessly, practically ignoring Elaine, and then takes her to a strip club where she is openly humiliated and silently begins to cry. After making her cry he relents and explains he was mean only because his parents forced him to ask her out. He awkwardly kisses her to try and cheer her up and they go and get a burger at a drive-in. Benjamin discovers that Elaine is someone he is comfortable with and that he can talk to her about his worries. From here, Benjamin's life falls apart. The jealous Mrs. Robinson threatens to reveal their affair to destroy any chance Benjamin has with Elaine, so Benjamin rashly decides he has to tell Elaine first. Upset over hearing about Benjamin's tryst with her mother, Elaine returns to Berkeley refusing to speak with Benjamin. Benjamin decides he is going to marry Elaine in order to have a future with her and goes to Berkeley where he rents a room in a local flop house, and begins to stalk her. He contrives a meeting on a bus while she is on her way to a date with her classmate Carl. The next day, an angry Elaine bursts into Benjamin's room and demands to know what he is doing in Berkeley after he \"raped\" her mother by taking advantage of her while she was drunk that evening of his graduation party. Shocked by what Elaine said, Benjamin tells her it was her mother who seduced him that night, but Elaine refuses to believe him and doesn't want to hear the fact that her mother is a crafty vixen. Benjamin says he will leave Berkeley and go somewhere else for her sake. Elaine tells Benjamin not to leave until he has a definite plan at what he wants to do with his life. The next day, Elaine comes into Ben's apartment in the middle of the night and asks him to kiss her. Over the next few days, the two hang out in Berkeley while Benjamin keeps pressing her to get blood tests so that they can get married. Elaine is unsure about this and tells him she had told Carl she might marry him. Mr. Robinson, who has found out everything about Benjamin and his wife's affair, goes to Ben's apartment in Berkeley where he threatens Benjamin with violence and forces Elaine to drop out of school and takes her away to marry Carl. Benjamin tells Mr. Robinson that his wife is the bad person and she manipulated him into having an affair with her. But Mr. Robinson also is skeptic and refuses to belive Benjamin. Benjamin is left with just a note from Elaine saying that she loves him but that her father is really angry and it can never work out. Benjamin drives back to Pasadena and arrives at the Robinson house that evening looking for Elaine. After getting no response by knocking on the front door, goes around to the back of the house and forces open a screen door. Benjamin quickly sees that Elaine is not there, but finds Mrs. Robinson instead. She coldly tells him he won't be able stop Elaine and Carl's wedding and she immediately calls the police and play-acts by claiming that a man broke into her house and is assaulting her. Finally seeing the sociopath that Mrs. Robinson really is, Benjamin flees and drives back to Berkeley to hide out there. The next morning, Benjamin goes to the Delta Chi Fraternity house to look for Elaine or Carl where he learns from Carl's frat brothers that the wedding is in Santa Barbara that very morning. Benjamin then speeds off towards Santa Barbara, stopping only at a gas station to ask for directions to the church. Benjamin is in such a hurry that he rushes off without refueling. Consequently, Ben runs out of gas and must sprint the last few blocks. He arrives at the church just as the bride and groom are about to kiss. Thinking he is too late, he bangs on the glass at the back of the church and screams out \"Elaine!\" repeatedly. Elaine turns around, hesitates by looking at her parents and her would-be husband, but then screams out \"Ben!\" and starts running towards him. A brawl breaks out as everyone tries to stop her and Benjamin from leaving. Elaine manages to break free from her mother, who claims \"It's too late!\" for Elaine apparently already said her marriage vows, to which Elaine replies, \"Not for me!\" Benjamin holds everybody off by swinging a cross ripped from the wall, then using it to jam the outside door while the pair escape. They run down the road and flag down a bus. The elated and smiling couple take the back seat. But in the final shot, Benjamin's smile gradually fades to an enigmatic, neutral expression as he gazes forward down the bus, not looking at Elaine. Elaine also seems unsure, looks lovingly across at Ben but notices his expression and turns away with a similar expression as the bus drives away, taking the two lovers to an uncertain future.",
      "writers": [
         "Calder Willingham",
         "Buck Henry"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061722/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0ODc4MDk4Nl5BMl5BanBnXkFtZTcwMTEzNzgzNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dustin Hoffman, Anne Bancroft, Katharine Ross | See full cast and crew »"],
      "reviews": [
         "The Graduate (1967/Mike Nichols) If ever a song were more appropriate for a film, besides 'All Along the Watchtower' for \"Apocalypse Now\", it is 'The Sounds of Silence' preformed by Simon & Garfunkel in Mike Nichol's \"The Graduate\". The song, nearly word for word, describes the inner turmoil that the characters of \"The Graduate\" face. They are lost and confused, stuck on the bridge of life, two crossing into adulthood, and one into old age. And that's just one way to look at it. \"The Graduate\" is one of the best films I have ever had the pleasure to witness, and I only wish I were alive when it was first released. Dustin Hoffman, in his first major film role, plays Benjamin Braddock: the epitome of the confused and isolated young adult male. He sits in his room and does nothing. He lies around in his parent's pool for hours on end. Ben, who has just graduated from college, is home for the summer. Then, after an awkward sexual encounter with a friend of his parents named Mrs. Robinson, a one night stand turns into a summer romance. But betrayal soon follows as Benjamin falls for Mrs. Robinson's daughter, Elaine. Nichol's directorial genius (he won an Oscar for the film) really shows in the opening party sequence celebrating Ben's arrival home. There is a close-up of Ben's face as he stumbles his way through the event, listening to advice and shaking hands with the faceless (much like his future) masses. The camera moves in such a way that a feeling of claustrophobia comes over the viewer. They are overcome by what is going on around them, much like Benjamin is at this crossroads in his life. Another example is when Ben first arrives at the fateful hotel where he meets Mrs. Robinson for sex. He walks around the lobby, suspicious that the desk clerk is on to him, and then he attempts to walk into a room. Only a large group of the elderly walks out, and Benjamin stands there holding the door for them. Then he proceeds inside, only to be passed by a group of high school students. This image once again reinforces the crossroads that Ben is at in his life. After finally viewing this classic, I realized that many of my favorite directors to emerge from the 90's (mainly Wes Anderson) were greatly influenced by this film. What's more interesting is that \"The Graduate\" was a landmark film for American cinema and the decade in which it was released, sharing the same themes that Benjamin experiences throughout the film. Most of American cinema was very conventional up until the 60's. Nothing extremely scandalous was shown in a film, and many serious topics were not widely addressed through cinema\u0085yet. \"The Graduate\" is the perfect mix of old and new. It's the 'bridge' that separates the standard American films from the more experimental ones that would emerge all throughout the 1970's. The same can be said for the decade of the 1960's. America lost its innocence the day Kennedy was assassinated on November 22, 1963. For the next five years, the country went through a spiral of events that led to the sexual revolution of the late 1960's. And \"The Graduate\" separates the white picket fences of the 50's and early 60's from the Rock and Roll and drugs of the late 1960's and early 70's. It's a crossroads in the middle of the most turbulent time in American history. In one of the films most ironic images, a tired and lonesome Benjamin slumps on a bench on the Berkley campus (an important place for the sexual revolution) under an American flag blowing in the wind. The flag still waves, but Benjamin is beat. He represents the fall and eventual metamorphosis of the American dream. But aside from all its serious themes and deeper meanings, \"The Graduate\" is a comedy at its heart. It contains one of the funniest and most exciting climaxes in cinema. And the final image is a knockout. It shows Benjamin and Elaine sitting at the end of a bus filled with elders, looking ahead blankly, at the road and at their future. Then the bus drives off in the distance. They do not know where their future is headed, or where the bus is even going. It was the same circumstance for America in 1967. The film closes with the same song it opened with: \"The Sounds of Silence\".",
         "What a ride....This is a perfect example of what art can generate if one puts soul and wit into it. Firstly, I find human emotions and life issues depicted in a bitter-comic manner to be a charming combination.Love,sex,insecurity,family relationships,shyness,deception are treated with great humor and witty dialog in this movie.Long and elaborated shots,incredible story-telling creativity (like 1-st person camera views,long still frames,distance frames),video-clip like sequences (beautifully sustained by Simon and Garfunkel's heart-warming poetry and sad irony).There is enough creative film work in The Graduate to suffice for 10 movies.The dialog is excellent and the acting pure genius.And, oh...the time frame...the sixties...don't get me started.The 2000's are like an insurance seminar compared to that... No need to praise this movie anymore, it speaks for itself.It is not,however,a movie for the masses.This is no Ben-Hur type of flick,with spectacular imagery and epic storyline.It is an epic of the inner soul.It requires a bit of meditation, it is only entertaining if you get in touch with your inner self and not expect to watch the screen and BE entertained. Despite its comic appearance,I always felt that it touched a sensitive somehow sad chord in me.It's kinda like:\"Haha very funny, but I felt those type of emotions and they didn't seem funny then.\"It's also so easy to laugh at other people's feelings,torments and emotions, but when you realize that you are also part of that old human comedy and drama, your laughing becomes more restrained.More mature.I always connected with this movie, and with Mike Nichols.Too bad they don't make'em like this anymore.We live in an era where people like John Woo and Michael Bay are starting to dictate what we will be watching more and more.What a shame....",
         "Here's to you Mrs. Robinson. Was it the song by Simon and Garfunkel made popular by the film, or did the film entrench the song into popular culture? Who's to say either way? It's a matter of opinion, and it's irrelevant really. The fact is, it's a great song and a great movie and the two compliment each other like peanut butter and jelly, ham and swiss or May and December. This movie is for anyone who's ever wondered what they are going to do with their future, anyone who's been in love with someone their parents didn't approve of, or anyone who's had an affair with one of their parent's friends. Granted, not many will fall in the latter category, but it throws an interesting spin on the film. The film perfectly encapsulates and portrays the feelings of self-doubt, alienation, disenchantment and unwanted pressures and expectations for a twenty-something just out of college. Dustin Hoffman is the only person we can possibly imagine in the role of Benjamin as his imprint and superb acting makes this film a great one. As reflected on in an interview with Dustin Hoffman on the DVD, \"The Graduate at 25\", his life changed after this film, propelling him into something of a superstar status as his incredible talent found wide recognition. When I saw \"Rushmore\" I had a similar feeling about young Jason Schwartzman in the lead role. For him, time will tell. Although \"Rushmore\" isn't the time tested success that \"The Graduate\" is, anyone who enjoyed \"Rushmore\" would likely enjoy \"The Graduate\" if they haven't already seen it. They are, however, distinctly different films. This comedy is something of a benchmark in many ways. Not many films of a comedic nature are so socially relevant and of such high quality that they make the A.F.I.'s top ten of all time. The film by many standards is more than just a contemporary comedy. It is quite possibly the best one ever made, given its widespread appeal. It is well shot with interesting sequences and hilarious segments that hold up against the test of time. It has been a long-time favourite of mine, and I can scarcely imagine growing tired of it.",
         "(This review concerns itself solely with a specific discussion of the latter half of the movie, so if you have not already seen it, you probably won't want to read this either.) This is my second write-up for The Graduate \u0096 it's kind of hard for me to shut up about this movie; it's one of my all-time favorites, and I find more and more to like every time I watch it. What I want to talk about specifically, though, is the second half of the movie \u0096 that is, everything past the point where Elaine Robinson finds out Benjamin and her mother have been having an affair. The film builds to a kind of climactic moment with that revelation, almost a mini-ending (complete with a long shot and a fade to black). Indeed, for many people, the film actually *does* end right about there: it has long been a foregone conclusion in critical circles that the film never completely finds its way back on track from this point on. That is, once the focus shifts from the relationship of Ben and Mrs. Robinson to that of Ben's pursuit of Elaine, The Graduate simply runs out of gas. It's not my intention to argue too strenuously against this consensus: I don't believe there can be any doubt that the first half of the movie is much sharper, funnier, more intense, and just all-around more involving than the second half. (Though I do believe that by the first part being *so* strong, and involving us so well, it does tend to make the weaknesses of the second part less jarring than they should be: we already know and care about these characters \u0096 Benjamin, anyway \u0096 and want to follow them anywhere, no matter how sketchy and unfocused their stories begin to seem.) No, the point I want to make here is that, though The Graduate becomes a different *kind* of film in the second half (a romance, versus the sex farce/comedy of manners that was the first half), it never ceases being jaundice-eyed and satirical about its characters. I say this because it is an easy enough assumption to make that the film makers expect us to take Benjamin's love for and quest of Elaine at face value: to believe that they were `meant for' each other, and that their ultimate triumph is a resolution to be sincerely wished for. In reality, it is nothing of the sort. Ben and Elaine barely know each other \u0096 at least not in any meaningful way \u0096 when he begins his intense courtship of her (`stalking' might be the better term). There's something undeniably creepy and unsettling about Benjamin's fixation on Elaine: it's as if he's on a quest to woo and win her, but he's doing it primarily for the sake of being on a quest (and perhaps as a way of jump-starting himself out of the rut that his relationship with Mrs. Robinson has become). There's nothing specific about Elaine that is spelled out for the audience as to why she might appeal to Ben so much \u0096 save for the simple fact that she's NOT Mrs. Robinson. This lack has often been attributed to poor screenwriting and a flawed conception and, while that's an understandable conclusion to draw given the second half's other failings, I don't believe this is actually the case. Whatever you may think of it as a thematic strand, I believe this sense of blankness in the relationship between Ben and Elaine was deliberate on the part of the filmmakers - ie. they knew what they were doing, and what point they were trying to make. And that point relates directly to the fallacy of romantic love. We see many scenes of Ben viewing Elaine longingly from afar (to the omnipresent strains of Simon and Garfunkel), the camera's soft-focus making it all seem like something out of a fable, or (more likely) a Harlequin romance. But, as an audience, we are so used to (just as much today as back in 1967) accepting these kinds of shots and poses as a shorthand for deep love, and a feeling that the two characters in question were `meant' to be together, that we are easily fooled into thinking that that is just what the film makers have in mind for these two. In reality, it's an insightful (visual) comment upon just how such `shorthand' \u0096 in not only film, but any of the arts (literature, song, painting, etc.) \u0096 screws up young people such as Ben and Elaine, giving them the illusion of love and passion being there when they aren't. Which explains the film's ending \u0096 that is, its very last shot. It should be joyous and celebratory, as Ben has succeeded in his goal \u0096 snatching his beloved away from the altar and claiming her for himself (and she going along willingly, even giddily). But after the initial enthusiasm wears off, the smiles on the two of them dissipate and our final image of them is one of sheer dejection and confusion. And it must be so, because they have been duped by years of pop culture hogwash into believing that this is what true love is; the realization hits them hard that they don't have the slightest idea what they're doing together. And so Ben's dilemma of what to do with his `future' continues: he has wound up in exactly the same place he was at the beginning of the movie \u0096 only now with an equally confused human being as an appendage. As I say, all this may not make you *like* the second part of the movie any better than you do (I can appreciate it, but on a different, somewhat lesser, level than the first part). But I think it's at least important to be clear what the film makers were after, and to judge it according to how well it hits *that* mark, rather than the one we may have been *fooled* into thinking they were going for.",
         "What a wonderful time capsule. Not being old enough to grasp the entire \"Swinging 60's\" movement, I can't help but think this was pretty true to form to what was going on back then. Dustin Hoffman is of course great, but Ann Bancroft steals the movie, dominating every scene even when she's not in it. It must have been quite a risk for her to not only play an \"older woman,\" especially in age conscious Hollywood, but also to play so much against \"type.\" The music, the clothes, the houses all harken back to when America was discovering not every one lived like Ozzie and Harriet, and that a stiff martini could certainly loosen ones morals. The sexual energy this movie projects oozes across the screen and makes one feel like a voyeur.",
         "Dustin Hoffman is outstanding in his breakthrough role as a troubled young adult who is worried about his future. His awkwardness is endearing and universal. To this day, there are people who can relate to his Ben Braddock. The music is one of the biggest accomplishments of this film. Simon and Garfunkel perfectly depict Ben's moods throughout the movie with their timeless classics. Overall, this movie is well-written, well-played, and well-directed. It is a humorous and sensitive account of the difficulties of a young adult. It is definitely worth viewing.",
         "\"The Graduate\" scourges the shallowness of the sixties, kicks against its smug and sanctimonious middle classes: xenophobic, materialistic and spoiled. Mrs. Robinson is the epitome of the devil-may-care LA bourgeoisie and represents the darker side of America's American Dream that is sedated by pills, desensitized by liquor, mind dulled by television, sanitized by the latest Tupperware and gleaming colors to sugarcoat the humdrum of suburban life (Mr. McGuire: I want to say one word to you. Just one word. - Benjamin: Yes, sir. - Mr. McGuire: Are you listening? - Benjamin: Yes, I am. - Mr. McGuire: Plastics.). The adulterous relationship between Mrs. Robinson and Ben is sex for sex only and is cast in terms of indifference, coldness and vulgarity. Mrs. Robinson is like a beast of prey, hungering for sex, absorbing young men's bodies to fight off the specter of old age, hysterically suppressing the anxiety that it causes, keeping her young daughter, whom she regards as her competitor and therefore, adversary, neurotically at bay. The true love between Elaine and Ben, on the other hand, surpasses the tasteless, the absurd and offers hope of a better generation to come (Mr. Braddock: What's the matter? The guests are all downstairs, Ben, waiting to see you. Benjamin: Look, Dad, could you explain to them that I have to be alone for a while? Mr. Braddock: These are all our good friends, Ben. Most of them have known you since, well, practically since you were born. What is it, Ben? Benjamin: I'm just... Mr. Braddock: Worried? Benjamin: Well... Mr. Braddock: About what? Benjamin: I guess about my future. Mr. Braddock: What about it? Benjamin: I don't know... I want it to be... Mr. Braddock: To be what? Benjamin:... Different.) Truly, a bridge over troubled water...",
         "I saw this film for the first time in September 1968, after working for just one year as a professional cinematographer. I rapidly saw it five more times, in order to observe technical details of the photography of the film, but every time I completely forgot to look at those details, since I became so absorbed by the film every time. Now, after more than 35 years as a cinematographer and film teacher, I still marvel at Mike Nichols' and Robert Surtees' work every time I see the film. Almost everything you can do with a camera can be seen in this film, and everything is perfectly right for the story. The Graduate is groundbreaking in more areas than the photography. The casting, writing, acting, picture and sound editing are all exceptionally good, and have influenced film-making ever since. I was very happy when I saw that The Graduate reached the 7th position in the American Film Institute's voting of the best American films in history.",
         "I'm 16. I am of the world-weary, cynical 90s generation, yadda yadda. Did I like the film? I loved it. It's a film which can speak to young people, regardless of era. How better to depict the pressure, the confusion we sometimes feel, than that scene where Benjamin dons scuba gear and is urged to get in the water...he is pushed into the water repeatedly...finally sinks deep in... The cinematography is fantastic. The *way* the film was shot...that in itself pushes the film above \"average\". It's true Benjamin is too naive/plain-crazy to be \"real\". But Benjamin is supposed to be viewed as a symbol of confused youth, of being unsure...lost. Hoffman was great (though I found it difficult to believe he was a star athlete!). In fact, I think the whole cast was wonderful. The scene I...remember the best, has to be the last scene. The couple has dashed onto the bus, full of adrenaline, passion. Then they sit down and... are silent. Not even looking at each other. The bus takes them God-knows-where...and the last shot, of their two heads through the back windows of the bus, separate from each other...one of those times you understand the phrase \"a picture paints a thousand words\". Oh, and that cross-waving scene is way cool. :)",
         "I love this film. I mean I really loved \"The Graduate\". After all the high reviews, I finally watched it. And may I say it lived up to it's reviews and even higher for me. \"The Graduate\" is a great film that should be watched by everyone. And Dustin Hoffman is a great performer in the film. I loved the whole seduction scene with him and Mrs. Robbinson. They were both brilliant together. The way Ben reacted to her was very funny. And the marriage scene, how many parodies have I seen? This is a film that should be watched by everyone. I'm not kidding. I would highly recommend it to anyone. One of the best films to come out of the 60's. 10/10"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Lawrence Turman"],
      "summaries": [
         "Ben has recently graduated college, with his parents now expecting great things from him. At his \"Homecoming\" party, Mrs. Robinson, the wife of his father's business partner, has Ben drive her home, which leads to an affair between the two. The affair eventually ends, but comes back to haunt him when he finds himself falling for Elaine, Mrs. Robinson's daughter.",
         "Benjamin Braddock returns home to California after successfully completing college. He gets a hero's welcome from his parents but Ben isn't quite sure what to do with the rest of his life. He is soon seduced by Mrs. Robinson, the wife of his father's partner, who methodically pursues the inexperienced young man. Soon, they are meeting regularly in hotel rooms. Warned by her to stay away from her daughter Elaine, his father goads him into taking her out on a date. He finds he quite likes Elaine but when she learns he's been having an affair with her own mother, she'll have nothing to do with him. He's smitten however and pursues her.",
         "After a successful stint away at an eastern college, twenty-one year old Benjamin Braddock returns to his parents' Los Angeles area home a graduate. Although the world should be his oyster, Ben is instead in a state of extreme anxiety as he has no idea what to do with his life, which is made all the more difficult since everybody asks him what he plans on doing or tells him what he should do. In his confused state during which he would rather be alone to wallow in self-pity, he is easy prey for the aggressive Mrs. Robinson, the wife of his father's business partner who he's known all his life and who seduces him. Thinking about and then eventually succumbing to her advances only adds to his anxiety and confusion as he hides what they're doing from the rest of the world, and as he needs more than just sex in a relationship, sex which is all she wants from him. His confusion is lessened but his life becomes more complicated when he is reacquainted with Elaine Robinson, the Robinsons' daughter who too is home from college at Berkeley and who he has not seen since high school. Despite a rocky start directed largely by the wants of Mrs. Robinson, Ben and Elaine start to fall for each other. In this complicated situation, Ben has to try to figure out how at least to start to strive for what he believes should be that successful post-graduate life.",
         "The action is mainly seen through the eyes of Benjamin Braddock, a confused twenty-one year old, who is worried about his future but who does not simply want to follow the commercial path of his affluent family and their friends. His life becomes complicated when he is embroiled in an affair with an older woman, Mrs. Robinson, the wife of his father's business partner. It becomes impossible when he falls in love with Mrs. Robinson's daughter, Elaine.",
         "Recent college graduate Benjamin Braddock is trapped into an affair with Mrs. Robinson, who happens to be the wife of his father's business partner and then finds himself falling in love with her daughter, Elaine."
      ],
      "budget": 3000000
   },
   "movielensId": 1247,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-12-21",
      "dvdReleaseDate": "2005-04-05",
      "directors": ["Mike Nichols"],
      "runtime": 106,
      "movieId": 1247,
      "title": "The Graduate",
      "mpaa": "",
      "actors": [
         "Dustin Hoffman",
         "Anne Bancroft",
         "Katharine Ross",
         "Murray Hamilton",
         "Buck Henry",
         "Brian Avery",
         "Walter Brooke",
         "William Daniels",
         "Elizabeth Wilson",
         "Norman Fell",
         "Alice Ghostley",
         "Marion Lorne",
         "Eddra Gale"
      ],
      "imdbMovieId": "0061722",
      "originalTitle": "The Graduate",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "FxZN8XKw2Hs",
         "7QEnWhJkKZc",
         "XxJDOkr_UhE",
         "ZP3Bcte2mjo",
         "6cKafIqhEvk"
      ],
      "plotSummary": "A recent college graduate finds himself in a love triangle with an older woman and her daughter.",
      "tmdbMovieId": 37247,
      "avgRating": 4.03662,
      "releaseYear": "1967",
      "numRatings": 20521,
      "posterPath": "/AuFvrbtWSPiBPIv9ewH2DV4nhCD.jpg"
   }
}