{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "resistance",
            "id": 836
         },
         {
            "name": "japanese",
            "id": 907
         },
         {
            "name": "river",
            "id": 1261
         },
         {
            "name": "prisoner of war",
            "id": 1968
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "bridge",
            "id": 3450
         },
         {
            "name": "officer",
            "id": 3776
         }
      ],
      "imdb_id": "tt0050212",
      "video": false,
      "title": "The Bridge on the River Kwai",
      "recommendations": [
         903,
         947,
         3090,
         5925,
         11202,
         642,
         963,
         654,
         9277,
         288,
         596,
         1092,
         665,
         821,
         1051,
         1654,
         488,
         5924,
         387,
         576
      ],
      "backdrop_path": "/d23XXntJrVwNENvdriJdqlW1ae6.jpg",
      "revenue": 27200000,
      "reviews": [{
         "author": "John Chard",
         "id": "579dc60dc3a3684b8a000476",
         "content": "Colonel Bogey's Barmy Army.\r\n\r\nOK! Lets get it out there right away, for historical facts of the real Bridge on the River Kwai story, one should research elsewhere, this film is a fictionalised account of the said events. Sadly there are those out there who simply refuse to judge this purely as a piece of cinematic art - and cinematic art it is.\r\n\r\nA squad of British soldiers are held in a Japanese POW camp in the Burmese jungle. The respective Japanese and British leaders clash but an understanding is finally reached to build a bridge across the River Kwai. The importance of which could prove crucial in more ways than one...\r\n\r\nIt won 7 Academy Awards and 4 BAFTAS, and it was the film that saw the great David Lean enter his epic period. And what a start it is. Kwai is a masterful piece of cinema, it has a magnificently intelligent and complex screenplay - with tough edged dialogue in the script, is bursting at the seams with high quality performances, and beautifully photographed (filmed in Ceylon). Thematically it's about the folly and psychological madness of war, which in turn is ensconced in sub - plots of genuine worth. It all builds to a tremendous finale, where everything we have witnessed is realised with a deftness of talent from across the board. 10/10",
         "url": "https://www.themoviedb.org/review/579dc60dc3a3684b8a000476"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Cmdr. Shears",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022aa5",
               "name": "William Holden",
               "profile_path": "/6sa5f8p1KBhYxJDEmCLxn7QLcBe.jpg",
               "id": 8252,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Col. Nicholson",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022aad",
               "name": "Alec Guinness",
               "profile_path": "/nv3ppxgUQJytFGXZNde4f9ZlshB.jpg",
               "id": 12248,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Maj. Warden",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022aa9",
               "name": "Jack Hawkins",
               "profile_path": "/lqyKg1O0YTdrZ3gzogfqBNECv0f.jpg",
               "id": 10018,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Col. Saito",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ab1",
               "name": "Sessue Hayakawa",
               "profile_path": "/LLtMGKvp3k4LiesKdUwXhugEfE.jpg",
               "id": 12249,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Maj. Clipton",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ab5",
               "name": "James Donald",
               "profile_path": "/37GWNFPrHxo6RZf8uY0bdk47BD8.jpg",
               "id": 12250,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Lt. Joyce",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ab9",
               "name": "Geoffrey Horne",
               "profile_path": "/z4A17m3q9u8ScZIwTMPF3nIQVeP.jpg",
               "id": 12251,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Col. Green",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022abd",
               "name": "André Morell",
               "profile_path": "/3YpAUiuLp9ZXL67W99W2XYdJ3se.jpg",
               "id": 10029,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Capt. Reeves",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ac1",
               "name": "Peter Williams",
               "profile_path": "/urZztHCeApsdgxeo4JZOcYODMjG.jpg",
               "id": 12252,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Major Hughes",
               "gender": 0,
               "credit_id": "52fe427dc3a36847f8022ad1",
               "name": "John Boxer",
               "profile_path": "/7i914AsImDLfYAUxQG1kqX2AnhE.jpg",
               "id": 1075445,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Grogan",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ad5",
               "name": "Percy Herbert",
               "profile_path": "/5ZUj6cyhZ237SbeyF5fwAv2jvjD.jpg",
               "id": 33220,
               "order": 9
            },
            {
               "cast_id": 29,
               "character": "Baker",
               "gender": 0,
               "credit_id": "52fe427dc3a36847f8022aeb",
               "name": "Harold Goodwin",
               "profile_path": "/gLhjtadSsrzrdpYrBhV9mZ4uAs5.jpg",
               "id": 1208202,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "52fe427dc3a36847f8022ad9",
               "name": "Ann Sears",
               "profile_path": "/pdTG6k7kUl7nCeu1UTQLWsIc5vm.jpg",
               "id": 964548,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Captain Kanematsu",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022add",
               "name": "Heihachirô Ôkawa",
               "profile_path": "/kGHkcP5u9DjGX8RBSawWLfdaEVX.jpg",
               "id": 1075446,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Lieutenant Miura",
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ae1",
               "name": "Keiichirô Katsumoto",
               "profile_path": null,
               "id": 1075447,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "Siamese Girl",
               "gender": 0,
               "credit_id": "58912baf9251412dd400027e",
               "name": "Vilaiwan Seeboonreaung",
               "profile_path": "/fFoGUPAOX6TE3KEBspoKs42vkYm.jpg",
               "id": 1748362,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022a77",
               "name": "Pierre Boulle",
               "profile_path": null,
               "id": 12240,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022a7d",
               "name": "Carl Foreman",
               "profile_path": "/vwIDp3VXgWahmRjeOTlpjMPerGG.jpg",
               "id": 4066,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022a83",
               "name": "Sam Spiegel",
               "profile_path": "/zM5qW22AbzXUE626uZD0OXNzDWD.jpg",
               "id": 6594,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022a89",
               "name": "Malcolm Arnold",
               "profile_path": null,
               "id": 12241,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022a8f",
               "name": "Jack Hildyard",
               "profile_path": null,
               "id": 12242,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022a95",
               "name": "Donald M. Ashton",
               "profile_path": null,
               "id": 12243,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022a9b",
               "name": "John Cox",
               "profile_path": null,
               "id": 12246,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe427dc3a36847f8022aa1",
               "name": "John W. Mitchell",
               "profile_path": null,
               "id": 12247,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ac7",
               "name": "David Lean",
               "profile_path": "/iUTtDo1gl0Phe342xxoPq2w643R.jpg",
               "id": 12238,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022acd",
               "name": "Stuart Freeborn",
               "profile_path": null,
               "id": 11837,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "52fe427dc3a36847f8022ae7",
               "name": "Michael Wilson",
               "profile_path": "/bvIoOE2bASGvE2g7IlLUYP28QuU.jpg",
               "id": 13267,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 20.091106,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 826,
      "vote_count": 708,
      "budget": 3000000,
      "overview": "The classic story of English POWs in Burma forced to build a bridge to aid the war effort of their Japanese captors. British and American intelligence officers conspire to blow up the structure, but Col. Nicholson , the commander who supervised the bridge's construction, has acquired a sense of pride in his creation and tries to foil their plans.",
      "similar": [
         1904,
         227306,
         423,
         11948,
         2253,
         5925,
         409,
         346,
         616,
         15121,
         324786,
         64686,
         369885,
         7555,
         149870,
         978,
         8741,
         3683,
         58857,
         548
      ],
      "original_title": "The Bridge on the River Kwai",
      "runtime": 161,
      "poster_path": "/vtPR6tSHeu35rF6qTDw3Yjr9eDg.jpg",
      "spoken_languages": [
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "ภาษาไทย",
            "iso_639_1": "th"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Horizon Pictures (II)",
            "id": 11356,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1957-10-02",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "It spans a whole new world of entertainment!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David Lean"],
      "runtime": 161,
      "synopsis": "[this synopsis is primarily from the wikipedia article The_Bridge_on_the_River_Kwai] Two prisoners of war are burying a corpse in the graveyard of a Japanese World War II prison camp in southern Burma. One, American Navy Commander Shears ( William Holden), routinely bribes guards to ensure he is put on the sick list, which allows him to avoid hard labour. A large contingent of British prisoners arrives, marching in defiantly whistling the Colonel Bogey March under the leadership of Colonel Nicholson ( Alec Guinness). Because they were ordered by their superiors to surrender, Nicholson states that they should be obedient and cooperative prisoners. The Japanese camp commander, Colonel Saito ( Sessue Hayakawa), addresses them, informing them of his rules. He insists that all prisoners, regardless of rank, will work on the construction of a bridge over the Kwai River as part of a railroad that will link all Burma. The next morning, when Saito orders everyone, including officers, to work, Nicholson commands his officers to stand fast. He points out that the Geneva Conventions state that captured officers are exempt from manual labour. Saito is infuriated and backhands Nicholson in the face, but the latter refuses to back down, even after Saito has a machine gun set up threatening to shoot all the officers. Saito is dissuaded from shooting by Major Clipton ( James Donald), a British medical officer prisoner, citing an inquiry and scandal should Saito carry through with the murder of officers. Instead, the Japanese commander leaves Nicholson and his officers standing in the intense heat. As the day wears on, one of them collapses, but Nicholson and the rest are still standing defiantly at attention when the prisoners return from the day's work. After Colonel Nicholson is beaten in Saito's quarters, the British officers are sent into a punishment cage and Nicholson into his own box for solitary confinement. When Clipton requests to be allowed to check the officers, Saito agrees on the condition that Clipton persuade Nicholson to change his mind. Nicholson, however, refuses to budge, saying \"if we give in now there'll be no end to it.\" In the meantime, construction of the railroad bridge falls far behind schedule, due in part to many \"accidents\" purposely arranged by the British prisoners. Saito has a deadline; if he should fail to meet it, it would bring him great shame and oblige him to commit seppuku (ritual suicide). Saito reluctantly releases Nicholson, telling him that he has proclaimed an \"amnesty\" to commemorate the anniversary of Japan's great victory in the Russo-Japanese War, using it as an excuse to exempt the officers from work. Upon their release, Nicholson and his officers proudly walk through a jubilant reception. Saito for his part breaks down in tears in private. Having recovered from his ordeal physically, but not mentally broken, Nicholson sets off on an inspection of the bridge and is shocked to find disorganization, shirking and outright sabotage on the construction site. He decides to build a better bridge than the Japanese soldiers. He orders Captain Reeves ( Peter Williams) and Major Hughes ( John Boxer) to come up with designs for a proper bridge, despite its military value to the Japanese. He wants to demonstrate to his captors what he considers superior British ingenuity and to also keep his men busy, which he feels would be better for morale than sitting around doing nothing in prison. Meanwhile, three men, one of them the American Shears, attempt to escape. Two are killed; Shears is shot, falls into the river and is swept downstream. After many days in the jungle, he stumbles into a Siamese village, whose residents help him recover and get back to safety. He's given food, water and an outrigger boat to make his way down the river. Shears runs out of water during the trip and is forced to drink the water from the river, which makes him ill. However, he makes it to the mouth of the river and is picked up by British forces and shipped to a British hospital in Colombo, Sri Lanka (at the time, Ceylon). While recuperating, he dallies with a lovely nurse ( Ann Sears). Major Warden ( Jack Hawkins), a member of the British Special Forces, asks to speak with him. He informs Shears that he is leading a small group of commandos on a mission to destroy the Kwai bridge. He asks Shears to volunteer, since he knows the area. Shears refuses, finally admitting that he is not Commander Shears at all, but a Navy enlisted man. Shears recounts that he and a Navy Commander survived the sinking of their ship, but the Commander was subsequently killed by a Japanese patrol. \"Shears\" switched dog tags with the dead officer, hoping to get preferential treatment in captivity. It didn't work, but then he had no choice but to continue the impersonation. Warden tells him that the military already knew about it. To avoid bad publicity, the U.S. Navy loans him to the British. Warden offers him a deal: in exchange for his services, he will be given the \"simulated rank\" of major on the mission and avoid being charged with impersonating an officer, an offense punishable by death. Thus, Shears reluctantly \"volunteers\" with the understanding that should he survive, he'll get to keep his officer status. They are to be joined by Lieutenant Joyce ( Geoffrey Horne), a young eager officer with no combat experience who insists that he won't fold under pressure should he have to kill someone on the mission, and a fourth officer. Back in the camp, Nicholson explains to the Japanese through engineering principles that they've selected a poor site for the bridge. Finally convinced, the original bridge is abandoned and construction of a whole new bridge is commenced 400 yards downriver. Clipton watches in bewilderment as Nicholson maniacally drives his men to complete the project by the deadline. Ironically, he even volunteers his junior officers to assist with the physical labor, something he had refused to consider earlier in the standoff with Saito - provided that the Japanese officers are willing to pitch in as well. Meanwhile, the commandos parachute in. The fourth officer dies due to a bad landing. The rest make their way to the river, assisted by native Burmese women porters and their village chief, Yai ( M.R.B. Chakrabandhu). The commandos come upon a Japanese patrol whom they try to kill without firing shots, but Joyce freezes when confronted by one in the jungle. Warden jumps in front of him and kills the Japanese soldier, but gets shot in the foot as a consequence. This slows him down, but Shears refuses to leave him behind and the trio make their way to the bridge with the Burmese helpers. As the prison camp celebrates the completion of the bridge on time with a party for all, Shears and Joyce wire explosives to it under cover of darkness. The next day, a Japanese train full of soldiers and important officials is scheduled to be the first to use the bridge; Warden wants to blow it up just as the train passes over, accomplishing two missions at once. As dawn approaches, the trio notice with horror that the river has receded and the wires and explosives that were hidden the night before are now exposed. Nicholson proudly walks up and down his bridge making a final inspection, and notices the wires. The train can be heard approaching. Nicholson and Saito frantically hurry down to the riverbank, pulling up and following the wire towards Joyce who is waiting by the detonator. When they get too close, Joyce breaks cover and stabs Saito to death. Nicholson yells for help and then tries to stop Joyce (who cannot bring himself to kill Nicholson) from getting to the detonator. A firefight erupts as Warden fires upon the approaching Japanese soldiers; Yai is killed in the gunfight. When Joyce is hit, Shears swims across the river to finish the job, but he too is shot just before he reaches Nicholson. Recognizing Shears, Nicholson suddenly comes to his senses and exclaims, \"What have I done?\" Warden desperately turns the mortar fire in their direction, killing Shears in the blast and mortally wounding Nicholson. The colonel stumbles over to the detonator plunger and falls on it with his dying breath, just in time to blow up the bridge and send the train hurtling into the river. Warden, feeling guilty for killing Shears and Nicholson in the face of shocked stares from the Burmese women, pleads, \"I had to do it! They might have been taken alive! It was the only thing to do!\" Meanwhile, Major Clipton, the British medical officer who has witnessed all the carnage unfold from his vantage point on the hill, shakes his head incredulously, \"Madness! ... Madness!\".",
      "writers": [
         "Pierre Boulle",
         "Carl Foreman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050212/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2NzA0NTEwNF5BMl5BanBnXkFtZTcwMzA0MTk3OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Holden, Alec Guinness, Jack Hawkins | See full cast and crew »"],
      "reviews": [
         "I am normally an admirer of David Lean. But it is difficult to understand why he chose to base this film on a real event at the River Kwai, as it grossly misrepresents the real \"Colonel Nicholson\" and caused considerable distress to both him and the River Kwai veterans. The Colonel Nicholson character is based on the allied camp commander, Lieutenant Colonel Philip Toosey, who was a remarkable officer by any standards. Awarded the DSO for heroism during the defence of Singapore, he refused an order to join the evacuation so he could remain with his men during captivity. In the hellish conditions of the camp, he worked courageously to ensure that as many of his men as possible would survive. He endured regular beatings when he complained of ill-treatment of prisoners, but as a skilled negotiator he was able to win many concessions from the Japanese by convincing them that this would speed the completion of the work. Behind their backs, however, he did everything possible to delay and sabotage the construction without endangering his men, and also helped organise a daring escape, at considerable cost to himself. For his conduct in the camp, he won the undying respect of his men. After the war, he showed great generosity of spirit by saving the life of Colonel Saito, second in command at the camp and a relatively decent officer, when he spoke up for him at the war crimes tribunal. He worked for the veterans all his life, and became President of the National Federation of Far Eastern Prisoners of War. He refused repeated requests by the veterans to speak out against the film, being much too modest to seek any glory or recognition for himself. However you will find his achievements documented in a book by Professor Peter Davies entitled \"The Man Behind the Bridge\". Toosey hoped that no one watching the film would believe a British Army officer could be so stupid in real life. But with the film being rated on this site as one of the top 50 movies of all time, this hope may have been misplaced. Enjoy the film by all means as a work of fiction, but it is surely important to set the record straight and recognise the heroism of the real man involved.",
         "Within the Conflict that was World War II, there were many more smaller, more personal conflicts which, when added up, made a significant impact on the outcome of the War; though trying to explain them, or war in general, is like attempting to decipher the indecipherable. In `The Bridge On the River Kwai,' director David Lean takes you deep into the Burmese jungle to examine some of these deeper conflicts, and the effects of extraordinary circumstances on some ordinary men: British Colonel Nicholson (Alec Guinness) is a man of rigid principles and ideals, to whom acquiescence in any quarter is not an option; Japanese Colonel Saito (Sessue Hayakawa) lives by an inflexible code of conduct and is adamant in his adherence to it, through which he maintains his dignity and honor; American Navy Commander Shears (William Holden) just wants to make it through the war alive and get back home. As an integral part of their war effort, the Japanese have ordered a strategic bridge to be built across the Kwai River to facilitate the transport of troops and equipment. This monumental task has been given to Saito, the commandant of an allied prisoners-of-war camp; and not only must he build it, it must be completed by a specific date. And time is short. Toward that end, Saito has pressed into service every prisoner, including officers, whom according to the Geneva Convention of 1864 (which established rules for the humane treatment of prisoners of war), are to be excluded from any manual labor. When a fresh contingent of British prisoners arrives to bolster his complement of workers, Saito finds himself up against a formidable opponent, Nicholson, who immediately informs Saito that his officers will not work, in accordance with the rules of the Geneva Convention. And it's the beginning of another war-- a war of wills-- between two men determined to win at any cost. To Saito, this is more than just another assignment, it's an obligation, and failure is not an option. If he does not succeed in having the bridge built-- and on time-- he will be forced to take his own life, in accordance with his own moral code. Nicholson, on the other hand, is unyielding to the point of madness, and will die before he accedes to Saito's demands. Meanwhile Shears has managed by some miracle to escape and has made his way back to Ceylon. And he's home free-- after some recuperation time at Mount Lavinia Hospital, he'll be on his way back to the states. Or so he thinks. But unbeknownst to him, the British are aware of the bridge being built on the Kwai, and are planning a commando raid to destroy it. And Shears has something they need: First hand knowledge of the precise location, and of the jungle through which he made his miraculous escape. Subsequently, the Navy agrees to `loan' Shears to the British, to aid them with their mission. So instead of a ticket home, Shears is faced with another arduous trek through an uncompromising jungle, all for a mission of which the odds against success are nearly incalculable. From the beginning of the film to it's spectacular climax, Lean builds and maintains a subtle tension that underscores the drama, which makes this a compelling, unforgettable motion picture. Lean is the Master of epic films such as this, filling them with sweeping visuals while integrating them with the emotional involvement of his characters perfectly. Lean knows what he wants and how to get it, and he takes a terrific story (and this definitely is one) and tells it by using every bit of space--visually and audibly-- at this disposal. And most importantly, he knows how to get the kind of performances from his actors to put it all across so convincingly and believably. Alec Guinness deservedly received the Oscar for Best Actor for his role of Nicholson, whom he embodies from the inside out, disappearing so utterly into the character that the actor is forgotten, leaving nothing but the real man in his stead. It's a superlative piece of acting from one of the truly great actors of all times. Holden, as well, delivers an outstanding performance as Shears, capturing that somewhat embittered, off-handed sarcasm and resignation of a man trapped by circumstances beyond his control, who nevertheless does what he can to make the most of it, while awaiting the first opportunity for escape that affords itself. Holden's work here is Award-worthy, as well, but was destined to forever remain in the shadows of what is probably the definitive Guinness performance. And what a rare treat, having two performances of this caliber in a single film. Other notable performances include Hayakawa, entirely convincing as the tormented Saito, and Jack Hawkins, as demolition expert Major Warden, the absolute personification of the undaunted British stiff-upper-lip. The supporting cast includes James Donald (Clipton), Geoffrey Horne (Joyce), Percy Herbert (Grogan), Ann Sears (Nurse) and Andre Morell (Green). Beautifully filmed and expertly crafted and delivered, `The Bridge On the River Kwai' is one of David Lean's masterpieces. It's an emotionally involving, dramatic action/adventure that offers some real insight into the determination and tenacity of the human spirit. This film (especially the ending) is one you will never forget; a classic in every sense of the word, it exemplifies the magic of the movies. I rate this one 10/10.",
         "I heard a film critic once say that there really aren't \"war movies\"; there are only \"anti-war\" movies. I'm still not sure what I think of that claim, but having seen - The Bridge on the River Kwai- enough times in the past several years, I think I'm persuaded that it's at least half right. -Kwai-, I believe, is both a \"war\" and \"anti-war\" movie, and, in my view, it succeeds admirably at both. There is almost no element of -Kwai- that is not praise-worthy. David Lean's direction is tight and evocative. The cinematography is great (even though the color seems increasingly drained in film versions that I have seen). The acting is top-notch. I honestly believe that this is Alec Guiness's best performance, and Sessue Hayakawa is also highly sympathetic and believable. William Holden and Jack Hawkins round out the cast nicely. The musical score is also right on. Simply put, -Kwai- is an excellently constructed film made by people who obviously cared a great deal about it. As a result, the viewer comes to care a great deal about it as well. Clearly -Kwai- is an anti-war film. There is no glorification here. War is brutal, period. It's brutality is not captured here in terms of gory carnage or senseless battles. Instead, the psychological dimension of brutality comes across clearly. Yet, -Kwai- also shows the resilience of the human spirit as well as its complexity. One is left wondering if participation in World War II not only psychologically brutalized the characters played by Guiness, Hayakawa, and Holden but also if it simultaneously uplifted them. The paradox is striking to me each time I view this film. War can act both as a positive and negative catalyst, and it can do both of these things at the same instant. So, is -The Bridge on the River Kwai- a war movie or an anti-war movie? I think Lean clearly preferred the latter, but the subject matter and his approach to it may have landed somewhere in between. Regardless, -Kwai- is a fantastic film experience and is not to be missed. It is, simply put, my very favorite film--bar none.",
         "First off, what is so amazing about this film is that, for the time that it was made, how modern it looks. David Lean certainly had the eye of any modern director and managed to direct a visual masterpiece at a time when many films were still being shot in black and white. William Holden gives one of his finest performances as a cynic of warfare , citing for us the insanity and absurdity that the combatants often convey. And he hates the war, but he cannot avoid been thrown back into it again and again. We wish he could stay on the beach with his nurse lover, but he is a man destined for a tragic doom for his country, whether he wants to or not. Alec Guiness also delivers a fine performance as a bold general whose own pride is, at the same time, his most noble quality as well as his greatest fault. He is uncompromising, yet when the Japanese submit to his demands, he begins overseeing the construction of the bridge with great esteem. Eventually, for him, the bridge becomes a manifestation of his belief of the superiority of the British Army, which he follows like a religion. And in putting all his pride into this bridge, he loses sight of even the British's own true agenda. Truly, his sense of overwhelming honor is, at the same time, his downfall in a descent to a loss of morality, and a sense of good and evil. And yes, by the end of this film, we learn a great lesson of the horrors of war. Not only does it take the lives of many good men, but the utter failure and despair that accompany it make it an unbearable existence. And this message has only recently been re-evaluated with the also-brilliant masterpiece \"Saving Private Ryan.\" But, keep in mind that it took forty years to regain the power that this film inspired so long ago.",
         "About as Oscar-worthy as any film made in the '50s is David Lean's gripping BRIDGE ON THE RIVER KWAI. Based loosely on a real-life incident, it tells the story of an imprisoned British officer (Alec Guinness) who loses sight of his mission when forced to build a bridge for the Japanese that will enable the enemy to carry supplies by train through the jungle during World War II. Guinness plays the crisp British officer to perfection, brilliant in all of his scenes but especially in his confrontations with Sessue Hayakawa. William Holden has a pivotal role as one of the prisoners who escapes and enjoys his freedom for awhile before being asked to return with a small squadron to destroy the bridge. Jack Hawkins and Geoffrey Horne have colorful roles too and all are superb under David Lean's direction. The jungle settings filmed in Ceylon add the necessary realism to the project and there is never a suspension of interest although the story runs well over two-and-a-half hours. The film builds to a tense and magnificent climax with an ending that seems to be deliberately ambiguous and thought provoking. Well worth watching, especially if shown in the restored letterbox version now being shown on TCM. Some of the best lines go to William Holden and he makes the most of a complex role--a mixture of cynicism and heroism in a character that ranks with his best anti-hero roles in films of the '50s. He brings as much conviction to his role as Alec Guinness does and deserved a Best Actor nomination that he did not get.",
         "I have watched this movie several times and it is just getting better and better all the time. Why? Because this movie actually has a message built-in, this isn't a violent story, like \"Saving Private Ryan\" - also a good movie with a message - but it is still not a slow story. When I last saw it, I realised that there was something in the movie that I had never understood, this isn't a movie about war, torture or how it was to be a prisoner of war; this is a movie about madness and pride. The pride shows both in Saiko and Colonel Nicholson, they are so full of it that it is almost impossible for them to come to a civil-conclusion with the problems they have with each other. The madness is shown in Colonel Nicholson and Holden's character - here they are, two prisoners of war and they don't want to help each other out, instead they try to reach separate goals, and they are both willing to die for it. After you have watched this movie one is amazed by the performances made by Alec Guinness and William Holden and I must say that this is therefore one of the best War/Drama movies ever made My vote? 9 out of 10 naturally.",
         "After years of more intimate British films and just discovering the joys of location shooting with 1955's \"Summertime\", master director David Lean made his first actual widescreen epic with 1957's \"The Bridge on the River Kwai\", an acknowledged classic that deserves attention from a new generation of viewers and another visit from the rest of us who love perfectly executed films by an unparalleled craftsman. Recently, this movie has been overshadowed by his 1962 follow-up epic, the comparatively more elaborate \"Lawrence of Arabia\", but this richly textured WWII-set adventure is special enough on its own terms. While it has its share of action and suspense presented in exacting detail, the film is even more resonant as a psychological drama about the test of wills between mission-driven officers amid the perils of wartime survival. The plot takes place in 1943 when after surrendering in Singapore, Col. Nicholson marches his ragged British company into a Japanese prisoner work camp in the Burmese jungle (this is where the famous whistling of \"Colonel Bogey March\" is first heard). The erudite Col. Saito runs the camp and demands that the new prisoners build a massive railway bridge, a critical juncture between Rangoon and Malaysia. In a classic stand-off, Nicholson finally forces Saito to respect Geneva Convention and not allow his officers to do manual labor on the construction. Upon his ironic Pyrrhic victory, Nicholson slowly descends into the madness of seeing the completed bridge as a potential morale booster for his battle-weary men. Meanwhile, shortly after Nicholson's arrival, U.S. Navy Cmdr. Shears escapes from the camp only to be later blackmailed into joining a British commando mission led by do-or-die Maj. Warden and hesitant Lt. Joyce with the sole goal of blowing up the bridge. Through Peter Taylor's thoughtful film editing, the movie breathlessly alternates between the parallel story lines of the bridge construction and the jungle commando mission until the exciting climax. Lean's accomplishments are many with this memorable film - the authenticity of the Burmese jungle locations (filmed in Sri Lanka), the seamless integration of the two story lines, the masterful handing of the final scenes, and in particular, the gradual metamorphosis of Nicholson from a by-the-book British officer to Saito's willing collaborator. A frequent participant in Lean's films, Alec Guinness gives his career-best performance as Nicholson providing all sorts of unexpected shades to his complex characterization. As Shears, William Holden does what he did best in the 1950's, concurrently exude natural bravado and a conflicted soul and then added a layer of cynicism that dares to challenge the viewer to support him. The 68-year old Sessue Hayakawa came out of retirement to play Saito and delivers a subtle performance of unbending discipline and pained humiliation. Jack Hawkins and Geoffrey Horne lend sturdy support as Warden and Joyce respectively. With the same expert eye he lent to \"Summertime\", Jack Hildyard provides the superbly expressive and composed cinematography. Michael Wilson and Carl Foreman, both blacklisted at the time, wrote the brilliantly developed screenplay. This is essential viewing. The two-disc 2000 Limited Edition DVD set has a pristine print transfer with great sound making the entire experience feel surprisingly fresh upon viewing. There is a nearly hour-long documentary on Disc Two, \"The Making of The Bridge on the River Kwai\", produced for the DVD and full of intriguing insight into the production logistics. There are a couple of shorter featurettes produced around the time of the film's original release, the first is a black-and-white teaser for the film itself and the second a rather pedestrian lesson in Film 101 produced by USC grad students and introduced by Holden. Director John Milius provides a respectful tribute to the film in another short.",
         "David Lean's \"The Bridge on the River Kwai\" like Jean Renoir's \"Grand Illusion\" is an anti-heroic war film, set in a prisoner of war camp environment... But there, the point of resemblance came to an end... \"The Bridge on the River Kwai\" is an adventure film in which the nature of World War II is explored... And if in \"Grand Illusion\" the characters were described by a great artist who treasures their common humanity, in \"The Bridge on the River Kwai\" they are forced to carry out their destinies by an officer who cannot bear to see his bridge blown up... Escape is almost impossible from the Japanese camp located near the Kwai River in Burma... The prisoners are badly treated by cruel guards... The camp commander is a rigid psychopath... Conditions are hard to bear... Psychological state of the war British prisoners in constant alteration... Into the presumptuous situation comes Colonel Nicholson (Alec Guinness in a fascinating performance), a strict, serene, dedicated British Officer, deeply concerned for the welfare of his men... Nicholson is under severe pressure from the stubborn Japanese Colonel Saito (Sessue Hayakawa) for insisting on his attachment to the Geneva convention and refusing to allow his officers to be used on the construction of the strategic bridge... Nichilson survives the oppressive punishment imposed on him, but his obsession has risen to near-madness... He agrees to help the Japanese build their bridge, and in his determination to find victory in defeat, he ignores that the bridge, which he insists must be a 'proper bridge,' will serve the Japanese objectives against the British troops... In addition to the powerful rules of a prison camp picture, captors against captives and an interesting moral respect to a military code, a third element, in the story, is introduced: a small commando team led by Major Warden (Jack Hawkins) and an American sailor (William Holden) whose mission is to destroy the strategic bridge.. The film leads swiftly to a suspenseful climax: a Japanese train and a Commando force directed to a same goal, the Brige of the River Kwai... Each character, in the motion picture, has a valid reason for what he is doing, and each elaborates a relationship to the bridge revealed to be obsession and insane... \"The Bridge on the River Kwai\" hits with 'war' in a compelling logic of events, the indulgence of self-destruction. With a great visual beauty and terrific whistling tune March, \"The Bridge on the River Kwai\" is a great dramatic entertainment of the wills of men...",
         "Of all war movies this is the one with the best idea behind it. Think how easy it is to make a bad war movie. A group of people must blow up a bridge, and this is the story of their quest ... Actually, that DID serve as the premise for a film: it was called `Force Ten from Navarone', and it was dire. Or how about this one: we see close up the brutalities of war. (Then we see them again. Then we see some more of the brutalities of war. Then we see the credits.) Or how about this: a humble American soldier, with the pragmatism native to his breed, rejects his superiors' highfalutin talk of honour and glory and asserts his basic humanity in trying to stay alive. Or this one: we see English prisoners of war maintain their dignity in the face of Japanese brutality. They're all present, in a sort of a way: but ALSO present is a magnificent, long, suspenseful, tight story, around which these apparent clichés wrap naturally. If the clichés don't wrap naturally then they, not the story, are bent out of shape. Just when we think that the American pragmatist will turn out to be the hero, we see him cut a rather shabby figure, and it seems that there really WAS something to that highfalutin talk of honour and glory, after all. But then we discover that he has standards of his own, and they appear to be better ones. But THEN it seems that ... I could go on indefinitely, since there are many people here with something to be said for them, and it requires some thought to see who has the most to be said for him in the end. There's almost no need to mention the excellent performances, photography and music. The only thing one might have qualms about is historical accuracy. Nothing like this ever happened. Still, that makes the movie much less dishonest than those that base themselves on historical events, and then proceed to get them all wrong. You can only be misled by `The Bridge on the River Kwai' if you don't know that it's pure fiction. Well - you know now.",
         "This film is long (161 minutes), is almost 40 years old, and yet still is terrific, still holds up and will forever, I suspect, be considered one of the greatest war movies ever made. 'Kwai' is particularly amazing in that there is very little action in it, yet it consistently entertains - during the actual movie and no matter when you see it. It entertained me when I saw in the theater as a 12- year-old as years later as a 50-something-year-old seeing it on DVD. I say this to encourage younger people to check this film out, and give it a chance. Anyone who is fascinated with character studies might find this particularly interesting with Alec Guiness' role in here as Colonel Nicholson. He was mesmerizing in his role. William Holden, Sessue Hayakawan, Jack Hawkins and the rest of the cast are all excellent, with the four mentioned above perhaps playing the roles of their lives. The gorgeous countryside of Ceylon is photographed beautifully. David Lean, one of the all-time great directors, did this film, too, so it certainly has good credentials. A winner of seven Oscars, this great movie has stood the test of time."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Horizon Pictures (II)"
      ],
      "summaries": [
         "The film deals with the situation of British prisoners of war during World War II who are ordered to build a bridge to accommodate the Burma-Siam railway. Their instinct is to sabotage the bridge but, under the leadership of Colonel Nicholson, they are persuaded that the bridge should be constructed as a symbol of British morale, spirit and dignity in adverse circumstances. At first, the prisoners admire Nicholson when he bravely endures torture rather than compromise his principles for the benefit of the Japanese commandant Saito. He is an honorable but arrogant man, who is slowly revealed to be a deluded obsessive. He convinces himself that the bridge is a monument to British character, but actually is a monument to himself, and his insistence on its construction becomes a subtle form of collaboration with the enemy. Unknown to him, the Allies have sent a mission into the jungle, led by Warden and an American, Shears, to blow up the bridge.",
         "During WWII, the Japanese have set up a POW camp in Indochina on an island on the banks of the Kwai River. The primary purpose of this location is so that the Japanese can use the labor of the POWs to construct a railway bridge over the river, the bridge which will be a vital link for the Japanese forces in the war. It needs to be completed in five month's time. The camp is presided over by Colonel Saito, a man ruled by a mixture of Japanese cultural tradition and the need to win the war at any cost, even if it includes torture and other measures against the Geneva Convention. Among the officers at the camp are Colonel Nicholson, the senior British officer for who the principle of the matter is foremost regardless of the consequences; Major Clipton, the pragmatic medical officer; and US Navy Commander Shears who is more concerned about his own well being and that of those around him than he is about the big picture of the war. Against the assertions of its futility by both Saito and Nicholson, three POWs try to escape - among them being Shears - with all being shot. Everyone believes Shears is dead, but he manages to survive and make it out of the jungle back to safety. At the camp, a battle of wills ensues between Nicholson and Saito, specifically regarding the illegal use of POW officers as laborers to build the bridge. Nicholson wins the respect of the POWs because of this standoff. But Nicholson ultimately has other thoughts, namely taking control of the building of a proper, well made bridge to replace the haphazard one currently being directed by Saito. Nicholson's rationale is that it will raise the morale of the POWs by giving them something constructive to do, while demoralizing the enemy by showing them the superiority of the British. Meanwhile, as Shears is convalescing at a beach-side military hospital in Ceylon, he is certain he will get his wish of a medical discharge. His plans are disrailed when he is asked to participate in a British led four man commando mission to destroy the bridge under the command of Major Warden, the antithesis of Shears in that he can only see the big picture without seeing the personal cost to those around him. This offer is one that Shears cannot refuse. The four understand the risks - the perils of the jungle and the Japanese - but they may not fully realize that their biggest threat for carrying out the mission successfully is Nicholson's pride.",
         "After settling his differences with a Japanese PoW camp commander, a British colonel co-operates to oversee his men's construction of a railway bridge for their captors - while oblivious to a plan by the Allies to destroy it."
      ],
      "budget": 3000000
   },
   "movielensId": 1250,
   "movielens": {
      "languages": [
         "日本語",
         "ภาษาไทย",
         "English"
      ],
      "releaseDate": "1957-10-02",
      "dvdReleaseDate": "2000-11-07",
      "directors": ["David Lean"],
      "runtime": 161,
      "movieId": 1250,
      "title": "The Bridge on the River Kwai",
      "mpaa": "PG",
      "actors": [
         "William Holden",
         "Alec Guinness",
         "Jack Hawkins",
         "Sessue Hayakawa",
         "James Donald",
         "Geoffrey Horne",
         "André Morell",
         "Peter Williams",
         "John Boxer",
         "Percy Herbert",
         "Harold Goodwin",
         "Ann Sears",
         "Heihachirô Ôkawa",
         "Keiichirô Katsumoto",
         "Vilaiwan Seeboonreaung"
      ],
      "imdbMovieId": "0050212",
      "originalTitle": "The Bridge on the River Kwai",
      "genres": [
         "Drama",
         "History",
         "War"
      ],
      "youtubeTrailerIds": ["cfPqA9DUCd8"],
      "plotSummary": "The classic story of English POWs in Burma forced to build a bridge to aid the war effort of their Japanese captors. British and American intelligence officers conspire to blow up the structure, but Col. Nicholson , the commander who supervised the bridge's construction, has acquired a sense of pride in his creation and tries to foil their plans.",
      "tmdbMovieId": 826,
      "avgRating": 4.08295,
      "releaseYear": "1957",
      "numRatings": 14600,
      "posterPath": "/vtPR6tSHeu35rF6qTDw3Yjr9eDg.jpg"
   }
}