{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new zealand",
            "id": 2658
         },
         {
            "name": "collector",
            "id": 4295
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "chainsaw",
            "id": 12394
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "fast food",
            "id": 157748
         },
         {
            "name": "testosterone",
            "id": 157764
         }
      ],
      "imdb_id": "tt0092610",
      "video": false,
      "title": "Bad Taste",
      "recommendations": [
         763,
         1694,
         7219,
         8216,
         27813,
         18111,
         14510,
         9538,
         8408,
         10692,
         9696,
         19204,
         22244,
         14029,
         20481,
         10070,
         27814,
         24920,
         11503,
         11415
      ],
      "backdrop_path": "/sg3Enbal9aQJa8T6j5qLO0A7eqC.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "furious_iz",
         "id": "5a4c7daa9251415a56006687",
         "content": "So it begins...\r\n\r\nMade on a shoestring budget, starring friends and shooting on the weekends, this is how NZ's blockbuster director Peter Jackson got his start.\r\n\r\nGross, silly, with terrible masks and effects, weird acting and bad overdubbing, this film is an utter classic in DIY splatter.  The sheer passion and ingenuity oozes from every frame.  Hasn't dated too well, but it still has serious charm, and I am pleased to have grown up watching it.\r\n\r\nFor fans of late night B films",
         "url": "https://www.themoviedb.org/review/5a4c7daa9251415a56006687"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Ozzy",
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a85",
               "name": "Terry Potter",
               "profile_path": "/q3HadibJLq2lLHyx3AqRA9gfcF6.jpg",
               "id": 61590,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Barry",
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a89",
               "name": "Pete O'Herne",
               "profile_path": "/lUHJVizxy58QOdyd5tMIUOqsA93.jpg",
               "id": 61591,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Giles",
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a8d",
               "name": "Craig Smith",
               "profile_path": "/z1Jj40YYswXwdbVcFPqrHej63ga.jpg",
               "id": 61592,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a91",
               "name": "Mike Minett",
               "profile_path": "/3h1fWPsPlxLJvy7dO2IBxL4WSmo.jpg",
               "id": 61593,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Derek / Robert",
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a95",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Lord Crumb",
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a99",
               "name": "Doug Wren",
               "profile_path": "/bEYOS0BJ7RPGItzXLvaRg9cbXoU.jpg",
               "id": 81884,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Coldfinger",
               "gender": 2,
               "credit_id": "57d44849c3a368556d006938",
               "name": "Tony Hiles",
               "profile_path": "/4IqSGNROJheurHduyHk396eWVjP.jpg",
               "id": 93386,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "3rd Class Alien",
               "gender": 2,
               "credit_id": "57d4472ac3a368557a005918",
               "name": "Garry A. Brown",
               "profile_path": "/kSxXFzOBBRRIWQ8bSBniePYPtH3.jpg",
               "id": 1193909,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "3rd Class Alien",
               "gender": 0,
               "credit_id": "57d446899251416099005eca",
               "name": "Ken Hammon",
               "profile_path": null,
               "id": 1677187,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "3rd Class Alien",
               "gender": 0,
               "credit_id": "57d44b93c3a368556a006640",
               "name": "Michael Kane",
               "profile_path": null,
               "id": 7264,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a5d",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a63",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a69",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a6f",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a75",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4552c3a36847f80c7a7b",
               "name": "Jamie Selkirk",
               "profile_path": null,
               "id": 1390,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4552c3a36847f80c7a81",
               "name": "Michelle Scullion",
               "profile_path": null,
               "id": 61575,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.242615,
      "production_countries": [{
         "iso_3166_1": "NZ",
         "name": "New Zealand"
      }],
      "id": 9964,
      "vote_count": 259,
      "budget": 25710,
      "overview": "A team from the intergalactic fast food chain Crumb's Crunchy Delights descends on Earth, planning to make human flesh the newest taste sensation. After they wipe out the New Zealand town Kaihoro, the country's Astro-Investigation and Defense Service is called in to deal with the problem. Things are complicated due to Giles, an aid worker who comes to Kaihoro the same day to collect change from the residents. He is captured by the aliens, and AIaDS stages a rescue mission that quickly becomes an all-out assault on the aliens' headquarters.",
      "similar": [
         341006,
         769,
         588,
         948,
         381288,
         8810,
         36647,
         170,
         4141,
         60304,
         9373,
         10781,
         45132,
         765,
         398175,
         527,
         1991,
         1690,
         185,
         8456
      ],
      "original_title": "Bad Taste",
      "runtime": 91,
      "poster_path": "/wopLobnRKqvxA4yycQIvquMx1yn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "WingNut Films",
            "id": 11,
            "origin_country": "NZ"
         },
         {
            "logo_path": null,
            "name": "New Zealand Film Commission",
            "id": 294,
            "origin_country": ""
         }
      ],
      "release_date": "1987-12-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": "NZD ",
      "directors": ["Peter Jackson"],
      "runtime": 91,
      "synopsis": "The New Zealand Astro Investigation and Defence Service (AIDS) sends Derek, Frank, Ozzy, and Barry to investigate the disappearance of everyone in the town of Kaihoro, North Island, New Zealand. They find the town has been overrun by space aliens disguised as humans. Barry kills one of the aliens and is attacked by others weilding sledge hammers. After Derek notifies Frank and Ozzy (whom are traveling on the road towards Kaihoro), he begins torturing Robert, an alien they captured earlier. Robert's screaming attracts a number of aliens in the area. Derek kills the would-be rescuers, but he is attacked by Robert and falls over a cliff, to his presumed death. Meanwhile, a charity bill collector named Giles is passing through Kaihoro. He is attacked by Robert, who has been eating the brains of the alien killed earlier by Barry. Giles escapes in his car and stops at a nearby house for help. Another alien (dressed as a chef) answers the door and captures Giles. He later wakes up in a tub of water and is told he is about to be eaten. Derek also wakes up to find that he landed in a seagull's nest. He also finds that his brain is leaking out the back of his head, so he stuffs it back in and uses a hat to hold it in place. That night, Frank, Ozzy, and Barry sneak into the aliens' house and find a room filled with bloody cardboard boxes. They kidnap an alien and Frank wears its shirt to infiltrate an alien meeting. He finds out that the residents of Kaihoro have been harvested for alien fast food for this intergalatic fast food chain called 'Crum's Country Delights'. Robert vomits into a bowl, which the aliens dine on, including the disguised (and disgusted) Frank. He escapes and tells the team members of the plan. They sneak out to save Giles as the aliens sleep. At sunrise, they try to leave but are attacked by the aliens. A long and climatic gun battle breaks out with dozens of ailens (wieling AK-47 assault rifles and various automatic weapons) battle the four humans. Derek joins in on the battle only to have his hat shot off, and he starts losing more of his brain, so he uses his belt as a headband. He grabs a chainsaw from the boot of his car and heads for the alien house. As the boys leave with Giles, the alien leader (Lord Crumb) and his followers transform into their true form and follow. Ozzy uses a rocket launcher to blow up Frank's car, which has been overrun by aliens. Frank and Ozzy hunt for Lord Crumb and kill a lot of more aliens along the way. Meanwhile, Derek kills an alien with his chainsaw and replaces the missing parts of his brain with alien brain. An alien prepares to shoot Frank and Ozzy, but it is beheaded by Derek after he bursts through the wall behind it. Frank and Ozzy are shocked to see him alive. As they run, Lord Crumb shoots Ozzy in both of his legs and Frank fires his rocket launcher at the leader, but it misses and almost hits Derek, finally taking out a sheep in a nearby meadow. Derek is knocked out by the alien leader and the house transforms into a giant space ship, which blasts off into space with Derek still aboard. On board, Derek looks out the window to see that he is leaving Earth. Lord Crumb hears a strange, loud noise and investigates. He is killed by Derek, who ambushes him and cuts the alien in half with his chainsaw. Derek proclaims into his phone: \"I'm born again! I'm coming to get you bastards!\" He then puts on the alien leader's skin, laughing maniacally as he rockets towards the alien planet where he will presumably kill the rest of the alien race (with just his one chainsaw). On Earth in the final shot, Frank, Ozzy, Giles, and Barry drive away into the sunset in Derek's car.",
      "writers": [
         "Peter Jackson",
         "Tony Hiles"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092610/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4Mzc4ODMxOF5BMl5BanBnXkFtZTcwMzAwODEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Terry Potter, Pete O'Herne, Craig Smith | See full cast and crew »"],
      "reviews": [
         "It seems fitting that in the wake of the excellent Lord of the Rings films, that we should have a look at just what started director Peter Jackson on the road to being one of the worlds greatest visionaries. Before LOTR's, Jackson's biggest financial hit was the Michael J. Fox horror comedy 'The Frighteners', and his biggest critical success being the haunting 'Heavenly Creatures', starring a then not-so-famous Kate Winslet. But it wasn't an easy ride getting to be the director of the most anticipated trilogy since Star Wars. Jackson started small, very small, and clawed his way up the movie ladder using nothing more than pure determination and a raw talent for film-making. Jackson's first feature was Bad Taste, a low, low-budget horror comedy movie made over two years about aliens killing humans for their fast-food business back in space. No real plot, no real actors, no real crew. Only an insane imagination and devoted friends willing to help out. There's not even much of a script, because what Jackson sets out to do is sicken his audience with some of the most gruesome deaths ever seen and make them laugh until the back of their heads fall off. And he succeeds. Narrative and plot structure are not on the vile menu here. Instead, Bad Taste is a testament to sick jokes, low-budget gore and technical brilliance on a shoestring. Jackson made his own steadicam, crane and other camera rigs to create the impression of a bigger-budgeted movie (he fails to do so, unfortunately) and even undertook the task of making all of his own make-up and prosthetic effects, including mechanised masks and realistic machine guns. This is an even greater achievement when you consider just how much gore there is in the film, but the finale, in which a huge mansion is rocketed into space, defies the rules of its low budget and minimal crew. Even the cast were so minimal that the same aliens can be seen, if you look hard enough, being killed over and over again throughout the film, and Jackson himself takes on two roles; the unstable Derek and a mad alien called Robert. In one scene, Derek and Robert engage in a cliff-top fight with each other, balanced precariously on the edge and with no indication that one is a body double. Jackson's creativity and knowledge of movie trickery is undoubtedly on display here, but the low-rent sickness and bloody gore on display would suggest otherwise. At first it is hard to imagine that Jackson would go on from this to directing one of the best films of all time, but when you look closely, examine just what Jackson could do with no money and no crew, you begin to realise that a true genius was at work here. Bad Taste is a delirious testament to the 'just-get-out-there-and-do-it' school of film-making, as that is literally what Jackson did. Shooting whenever he had the money for film stock and making props and special effects in his parent's garage. Apparently, one of Jackson's greatest problems was keeping his actors consistent in appearance over the two-year period, making sure haircuts remained the same and that one actor had a permanent five-o'clock shadow. Bad Taste is true to the spirit of independent film-making, one man making the film he wants, when he wants and with whom he wants. In fact, it would never and could never have been made under the supervision of a studio, and even if it had the spirit would have been killed off. Bad Taste works for me because I admire the way in which it is made. When I first saw it I was in my teens and I liked it because it was a demented, gruesome, funny film, so maybe the teen crowd is the right one for Jackson's brain-eating, vomit-spewing, chuck-up-a-thon, or maybe it's also for twenty-somethings after a night on the lash. Either way, Bad Taste should be seen as an example that if you want to make a movie and know how - there is usually a way",
         "This extremely bloody and hilariously funny gore comedy from the director of \"Braindead\" and \"Meet the Feebles\" is about some aliens,who gather in a small New Zealand town to harvest human beings as a food source for their struggling intergalactic fast food.Four agents of the Alien Investigation and Defense Sector(A.I.D.S)are called on to stop them.\"Bad Taste\" was filmed on a shoestring budget over a period of four years,using second hand equipment,and produced by and starring all Jackson's friends and work colleagues.The amount of bloodshed in this film is really high,but the gore is presented in such a way that it just makes you laugh hysterically.There's vomit eating,brain eating,exploding heads,flying guts and even exploding sheep.A must see for horror,splatter and gore fans!",
         "When it comes to splatter-flicks it's hard to find a bigger milestone than \"Bad Taste\". I laugh my ass off when I think of the ignorant and unaware Tolkien-fans who are about to watch it in order to check out what Peter Jackson has done before \"The Lord of the Rings\". If they haven't seen \"Bad Taste\" they're in for a bit of a surprise even though mere name says it all. The foolish plot of \"Bad Taste\" is unessential - film is made to show audience as much everything that's sickening and repulsive as it's possible from an alien that splits into two pieces when its being hit by a car and then fiddles his own entrails, hero who's squeezing pieces of brain back into a cracked head and a bunch of lunatics from outer space who are eating steamy and lumpy vomit. This is not the most disgusting flick ever made. That's because luckily the gore effects are so hilariously clumsy that instead of making you throw up they make you laugh hard. This is still a bloody disgusting film. I love \"Bad Taste\" and I've seen it too many times but obviously it's impossible for me to judge people who don't like it. Peter Jackson has directed so much better movies after this with more money and real actors. Nevertheless, in one way \"Bad Taste\" will always be his very best work - no matter what he has done and will do in the future. Jackson had mom and dad (!) as special assistants to the producer and his pals as an actors. You have to respect a movie that was originally made during several years with no bigger commercial motives - just because of the fun of making a motion picture. This is a film that is good because it looks cheap, clumsy and stupid and has a ridiculous plot, awful script and absolutely terrible actors. Usually those are faults and the main reasons why a film is lousy but in this case it's all part of the fun. Movie history has rarely seen as horrible acting as especially Terry Potter and Mike Minett as Ozzy and Frank are having. Actually Doug Wren who's playing the alien leader is the only one who I can call an actor with a bit of a talents. Peter Jackson's own unhealthy character Derek who forces himself through alien's anus with a chainsaw is an amusing bloke too. Taste couldn't possibly get any worse, so if you don't possess an extremely sick and perverse sense of humor don't bother. Phenomenal trash: 10/10.",
         "Bad Taste is one of the weirdest, stupidest, most idiotic, b (if that) movies I've ever seen. Why then do I own this movie? Because Peter Jackson has created one of the funniest splatterfests period (especially the hilarious machine gun scene and the pine cone tossing). It takes a while for the hilarity to start but so did Dead Alive (another Jackson great). Enjoy as Derek, Ozzy (wearing a Tales From the Crypt t-shirt), and the rest of the boys take on extra-terrestrial buggers who've come to Earth in search of meat. The plot is also a little hard to follow the first time around. After watching Bad Taste many times however, I have no idea how he was chosen to direct the Lord of the Rings (which rocked). So, Peter Jackson, for that...I salute you.",
         "BAD TASTE, the worldwide cult hero Peter Jackson's first picture, concerns four bumbling government agents whose job it is to rid scenic New Zealand of any alien scum that may be invading their otherwise peaceful country. After being called upon to explore an entire town that has been mysteriously deserted, the men fall upon a shocking discovery: aliens from outer space have abducted much of the human race and are planning on using their flesh for intergalactic hamburger meat! It seems humanoids are the newest taste sensation all throughout the galaxy. Now, our heroes, with the aid of the city's one surviving human, are on a mission to save Earth from these extraterrestrials' fiendish plot--in the bloodiest, slapstick-iest, most outlandish ways imaginable. BAD TASTE took four years, a shoestring budget, and a tiny devoted cast and crew to complete. Shooting took place mainly on weekends, while the amateurs tended to their daily lives the rest of the week. The unmitigated commitment the crew had towards the production of the film really shows, as they all must've given their utmost towards not just getting the movie complete, but making it look spectacular. Jackson's camera-work and special effects are nothing short of mind-blowing, and the fast-paced editing really gives this 16mm wonder a big-budget, professional look while still maintaining a goofy, campy feel. Sure, the acting may be a bit over-the-top, and the meandering script does seem largely improvised, but these \"shortcomings\" only add to the picture's fun, crazy atmosphere, helping to make it even funnier. The soundtrack is oftentimes a little overbearing and awkward as well, but again, it doesn't in any way detract from the overall enjoyment of the film. All in all, if you're a fan of gore movies, alien romps, or just good ol' fashioned black comedy, then you don't want to miss BAD TASTE. Just make sure you have the stomach for it, or it might just get torn out and eaten!",
         "Being a fan of films high on the gore scale, and reading many reviews for this film, I finally decided to give this film a whirl...to this day, I still don't regret it! If you like gore, this is for you. If you like comedy, this is for you. If you liked the \"Evil Dead\" series, no doubt you will LOVE this film! For the full-effect, pick up the limited edition DVD. I swear, even if you have to pay 25 or even 40 bucks for this version, it's worth every penny! However, if you hate getting songs stuck in your head, then don't listen to the end theme! It's a cool eighties-style song, really good for a low-budget pic, but IT WILL GET STUCK IN YOUR HEAD!!! The entire film has great pacing, never slowing down for one second! This is also a great film for those, like myself, who want to get into filmmaking. This is one of those few films you never get bored watching, whether it's ten times or a thousand times!!! This is a must have for everybody!!!",
         "Directed by the New Zealand king of low-budget gore - Peter Jackson, who also takes the starring role in his debut film as 'Derek', the leader of the alien prevention group 'Alien Investigation and Defence Service' - A.I.D.S(!), who are called into action when a group of aliens land on earth with the intention of kidnapping humans and using them as the main ingredient for their fast food restaurants! Naturally Derek and his crew are none too happy about this and set about stopping them in the only way they know how - violently. As you can imagine with a plot like this and with Peter Jackson involved you can expect extreme gore mixed with extreme cheese, for example there is this one part where an alien has been severed in two from being hit by a car, his remaining top half fends off Jackson's attacks with a chainsaw by throwing pine cones at him! Also throughout the film Derek becomes increasingly demented after having a particularly nasty fall off a 90ft cliff, although miraculously surviving this, he has a nasty crack on the back of his head which keeps flapping open and letting bits of brain fall out (nice) and at one point he replaces his emptying skull with an alien's intestines who he has just slaughtered! As you can probably tell from these examples this film is pretty gross and if your like me you will find it very funny as well. Watch this film even if it is only to see one of Derek's compadres' rip off an aliens head with his bare hands and drop-kick it successfully out of a window to which he casually comments \"The old magic is still there.\"",
         "It's all about the aim in this tongue-in-cheek (or should I say, tongue in cranial cavity) shock-horror gross-out fest from early in Pete Jackson's career. It's hard to imagine how Mr. Jackson went from this to incredibly campy comedy of guts and brain chunks to the brilliant Lord of the Rings Trilogy in 20 years, but, if you take a look at the films he made along the way - Meet the Feebles, Heavenly Creatures, Dead Alive, etc - you will see the common threads. Like most of Jackson's work, this film sets out to make the best possible use of the available talent, sets and budget, and does so with verve. In this case, Jackson worked with very little of these three elements, and yet managed to pull off a hilarious bit of campy horror-comedy, with remarkable no to low budget special effects and plenty of the slapstick (with cow blood and chicken guts) that characterizes most of his early films. To describe the plot with more than two or three sentences would require spoilers. In other words, there isn't much of one. The film opens with a group of mulleted New Zealand special agent security guys investigating a massacre of an entire village by aliens which first appear to be extras from a living dead movie, then later somehow become more intelligent, agile, and.... inhuman. The film is decorated with an amazing array of creative gore and slapstick death scenes, and once the bullets start flying, the alien's demonstrate their fatal flaw - they have less talent with guns than the average criminal in a Matt Damon film. To his credit, Jackson knew what he could get away with considering what he had on hand, and didn't try to make a serious film. The camera work is, as always, excellent, and the make-up compliments the absurdity of the plot quite nicely. The result is hilarious, but only if you grock his sense of humor. I would recommend Dead Alive first, because it's humor is more (literally) in your face and obvious. This is definitely worth an evening, but, unlike the rest of Jackson's repertoire, it is a disposable film - worthy of one or two viewings, max.",
         "Goofy and ridiculously exaggerated horror-comedy, obviously made by a group of unprofessional movie-lovers and friends. Dig this: big potato-headed aliens slice up an entire little town in order to serve them in an intergalactic chain of fast-food restaurants! Four eccentric lowlifes are after them (they form a government agency called A.I.D.S \u0096 Alien Investigation and Defense Service). Peter Jackson (yes, THE Peter Jackson) desperately tries to hide the fact that he doesn't have the story by showing a whole lot of nasty gunfights and immature butchering. Buy hey\u0085who's complaining? Bad Taste is great fun and one of the most hilarious horror-comedies ever. Nobody in the cast knows how to act, the make-up effects are cheesy and the cinematography is laughable. Jackson himself plays Derek, an obsessive freak that constantly has to re-install his own brain after he lost some cells in a fall of a cliff. There isn't one `scary' moment to detect in Bad Taste, but the vulgarity and nastiness-level is pretty high\u0085 Chainsaw dismemberments, crushed skulls\u0085you name it and Peter Jackson shows it! Even drinking someone's fresh vomit is possible in his wicked imagination! As Jackson's budget slowly increased, so did his filmmaking skills. He continued to make fresh New-Zealand horror with `Meet The Feebles' (brilliant and imaginative puppet adventure) and `Braindead' (perhaps the goriest film ever). When you see him here in Bad Taste, you'd never say he'll win an Oscar for best director once but it only gives more cult-value to the film. This is an ideal motion picture to watch with a group of friends, with lots and lots of alcohol and pizza. You're not missing out on anything if you haven't seen it yet, except for a real good time.",
         "Gore: Oh yeah. Acting: Who cares? Action: Sure. Humor: What's funnier than life-sized Sgt. Pepper cut-outs of the Beatles in a car? Nuff said. 10/10"
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "New Zealand Film Commission",
         "WingNut Films"
      ],
      "summaries": [
         "Derek and his friends must investigate the missing people in a small village. Then they find out its human formed aliens that are really big headed monsters that used all the people in the small village into their snack burgers. Now, Derek must save the day and the world with his chainsaw before the meat eaters strikes the whole planet. Will Derek kill all the aliens?",
         "Four dim-witted men from the New Zealand National Air and Space Defense League arrive in a small New Zealand fishing town to investigate a report of landing UFO's and take on a batallion-sized army of aliens who have massacred the town's population as part of their plans to use humans as part of their main ingredient for their intergalactic fast-food chain.",
         "A team from the intergalactic fast food chain Crumb's Crunchy Delights descends on Earth, planning to make human flesh the newest taste sensation. After they wipe out the New Zealand town Kaihoro, the country's Astro-Investigation and Defense Service is called in to deal with the problem. Things are complicated due to Giles, an aid worker who comes to Kaihoro the same day to collect change from the residents. He is captured by the aliens, and AIaDS stages a rescue mission that quickly becomes an all-out assault on the aliens' headquarters.",
         "The population of a small town disappears and is replaced by aliens that chase human flesh for their intergalactic fast-food chain."
      ],
      "budget": 200000
   },
   "movielensId": 1255,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-12-01",
      "dvdReleaseDate": "2001-11-20",
      "directors": ["Peter Jackson"],
      "runtime": 91,
      "movieId": 1255,
      "title": "Bad Taste",
      "mpaa": "R",
      "actors": [
         "Terry Potter",
         "Pete O'Herne",
         "Craig Smith",
         "Mike Minett",
         "Peter Jackson",
         "Doug Wren",
         "Tony Hiles",
         "Garry A. Brown",
         "Ken Hammon",
         "Michael Kane"
      ],
      "imdbMovieId": "0092610",
      "originalTitle": "Bad Taste",
      "genres": [
         "Action",
         "Comedy",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "88NkEpxF6PU",
         "cTdNNw6me1w"
      ],
      "plotSummary": "A team from the intergalactic fast food chain Crumb's Crunchy Delights descends on Earth, planning to make human flesh the newest taste sensation. After they wipe out the New Zealand town Kaihoro, the country's Astro-Investigation and Defense Service is called in to deal with the problem. Things are complicated due to Giles, an aid worker who comes to Kaihoro the same day to collect change from the residents. He is captured by the aliens, and AIaDS stages a rescue mission that quickly becomes an all-out assault on the aliens' headquarters.",
      "tmdbMovieId": 9964,
      "avgRating": 3.42854,
      "releaseYear": "1987",
      "numRatings": 2211,
      "posterPath": "/wopLobnRKqvxA4yycQIvquMx1yn.jpg"
   }
}