{
   "tmdb": {
      "original_language": "ar",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0111055",
      "video": false,
      "title": "The Silences of the Palace",
      "recommendations": [
         140032,
         147307,
         146345,
         166710,
         128300,
         148037,
         49470,
         163370,
         147393,
         166707,
         195024,
         166708,
         56689,
         157109,
         163384,
         128330,
         147601,
         154413,
         199177,
         49168
      ],
      "backdrop_path": "/8uAVnt8nVhMc9Kyzj9XZhUKoxpn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Khedija",
               "gender": 0,
               "credit_id": "535471070e0a26560300579f",
               "name": "Amel Hedhili",
               "profile_path": null,
               "id": 1311669,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Khalti Hadda",
               "gender": 0,
               "credit_id": "5354713d0e0a2656140054aa",
               "name": "Najia Ouerghi",
               "profile_path": null,
               "id": 1311670,
               "order": 1
            },
            {
               "cast_id": 1006,
               "character": "Mroubia",
               "gender": 0,
               "credit_id": "535471740e0a2655fe0055b6",
               "name": "Fatima Ben Saïdane",
               "profile_path": null,
               "id": 1311671,
               "order": 2
            },
            {
               "cast_id": 1007,
               "character": "Habiba",
               "gender": 0,
               "credit_id": "5354718d0e0a2656030057b2",
               "name": "Zahira Ben Ammar",
               "profile_path": null,
               "id": 1311672,
               "order": 3
            },
            {
               "cast_id": 1008,
               "character": "Schema",
               "gender": 0,
               "credit_id": "535471b30e0a2656030057b8",
               "name": "Sabah Bouzouita",
               "profile_path": null,
               "id": 1311673,
               "order": 4
            },
            {
               "cast_id": 1020,
               "character": "Young Alia",
               "gender": 1,
               "credit_id": "59951b9f92514107d0009155",
               "name": "Hend Sabry",
               "profile_path": "/3WYkYwRA16Tr2o9aDH15gOcJigx.jpg",
               "id": 226438,
               "order": 5
            },
            {
               "cast_id": 1021,
               "character": "La Jneina",
               "gender": 0,
               "credit_id": "59f7ab0992514169a50004ab",
               "name": "Sonia Meddeb",
               "profile_path": null,
               "id": 1914676,
               "order": 6
            },
            {
               "cast_id": 1022,
               "character": "Fella",
               "gender": 0,
               "credit_id": "59f7ab17c3a368607e00054d",
               "name": "Hélène Catzaras",
               "profile_path": null,
               "id": 1436422,
               "order": 7
            },
            {
               "cast_id": 1023,
               "character": "Adult Alia",
               "gender": 1,
               "credit_id": "59f7ab2392514169c500047e",
               "name": "Ghalia Lacroix",
               "profile_path": null,
               "id": 1066722,
               "order": 8
            },
            {
               "cast_id": 1024,
               "character": "Memia",
               "gender": 0,
               "credit_id": "59f7ab2fc3a368609300047a",
               "name": "Michket Krifa",
               "profile_path": null,
               "id": 1347000,
               "order": 9
            },
            {
               "cast_id": 1025,
               "character": "Si Bechir",
               "gender": 2,
               "credit_id": "59f7ab3992514169c500049e",
               "name": "Hichem Rostom",
               "profile_path": "/prlf8PsNdIAWUdyNoSJlMwyNDXk.jpg",
               "id": 5477,
               "order": 10
            },
            {
               "cast_id": 1027,
               "character": "Sid' Ali",
               "gender": 0,
               "credit_id": "59f7ab53c3a368606d000507",
               "name": "Kamel Fazaa",
               "profile_path": null,
               "id": 1914677,
               "order": 12
            },
            {
               "cast_id": 1028,
               "character": "Lofti",
               "gender": 2,
               "credit_id": "59f7ab5ec3a368607e0005a3",
               "name": "Sami Bouajila",
               "profile_path": "/yhO2glkC0jqzPAWjJePHdMByRP3.jpg",
               "id": 20667,
               "order": 13
            },
            {
               "cast_id": 1029,
               "character": "Salim",
               "gender": 0,
               "credit_id": "59f7ab69c3a368602e000538",
               "name": "Hattem Berabeh",
               "profile_path": null,
               "id": 1914678,
               "order": 14
            },
            {
               "cast_id": 1030,
               "character": "Houssine",
               "gender": 2,
               "credit_id": "5a34f1f4c3a36814ae03a61d",
               "name": "Kamel Touati",
               "profile_path": null,
               "id": 1447075,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4681c3a36847f8102e91",
               "name": "Moufida Tlatli",
               "profile_path": "/C2dz8Ap9z1df4zcxgoJ6bKpDKF.jpg",
               "id": 239321,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5354703ac3a3681d7b004dfc",
               "name": "Moufida Tlatli",
               "profile_path": "/C2dz8Ap9z1df4zcxgoJ6bKpDKF.jpg",
               "id": 239321,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5354705bc3a3681d93004d18",
               "name": "Nouri Bouzid",
               "profile_path": null,
               "id": 1176075,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "570d0ac8c3a3684c010025a1",
               "name": "Ahmed Baha Attia",
               "profile_path": null,
               "id": 1604799,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570d0adc92514108c4000ec5",
               "name": "Richard Magnien",
               "profile_path": null,
               "id": 1315532,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570d0af9c3a3684c010025a6",
               "name": "Anouar Brahem",
               "profile_path": null,
               "id": 1604800,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "570d0b0ac3a3684c0a002b32",
               "name": "Youssef Ben Youssef",
               "profile_path": null,
               "id": 1604802,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "570d0b1ac3a3684c0d0029d5",
               "name": "Camille Cotte",
               "profile_path": null,
               "id": 1036648,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570d0b309251414d9f0007b7",
               "name": "Karim Hammouda",
               "profile_path": null,
               "id": 1604803,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570d0b42c3a3684c1b002a49",
               "name": "Moufida Tlatli",
               "profile_path": "/C2dz8Ap9z1df4zcxgoJ6bKpDKF.jpg",
               "id": 239321,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570d0b52c3a3684c15002d08",
               "name": "Claude Bennys",
               "profile_path": null,
               "id": 1604806,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "570d0b68c3a3684c0d0029e0",
               "name": "Chedli Chaouachi",
               "profile_path": null,
               "id": 1604808,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "570d0b7bc3a3684bf900291e",
               "name": "Faouzi Thabet",
               "profile_path": null,
               "id": 1576609,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "570d0b8f92514108c4000ed8",
               "name": "Fatma Jaziri",
               "profile_path": null,
               "id": 1576616,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.542948,
      "production_countries": [
         {
            "iso_3166_1": "TN",
            "name": "Tunisia"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 44284,
      "vote_count": 7,
      "budget": 0,
      "overview": "The death of a prince brings a young woman back to the palace where she was born into servitude. The lingering legacy of the harem is brought into light from behind frosted windows and velvet curtains.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "صمت القصور",
      "runtime": 116,
      "poster_path": "/3M4bH7A2L6wrHeueTUwr5PKYkfS.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canal Horizons",
            "id": 22029,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mat Films",
            "id": 22618,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinétéléfilms",
            "id": 71842,
            "origin_country": ""
         }
      ],
      "release_date": "1994-09-30",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Tunisia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Moufida Tlatli"],
      "runtime": 127,
      "synopsis": "Undereducated but wised up by time, Khedija (Amel Hedhili) is a typical strong woman who strives to live the life's burden. This beautiful housemaid (good at belly dancing and comes from some unclear lineage--something not uncommon among the poors who live in a culture in which people are commonly traded) has a daughter, Alia (Hend Sabri/Ghalia Lacroix). She realizes that her irressistable appeal to men, besides giving her some welfare and security insurance, one too many times tends to invite troubles--something she always wishes will never happen to Alia. With the setting of 1950's Tunisia (when the French's backed-up monarch almost comes to an end), the story take us to see the world from Alia's eyes: the childhood with all its joys and unprejudiced free spirit, adolescence with its sensitivities and curiousities, up to when she reaches adulthood--the time when life dares her to choose her own destiny.",
      "writers": [
         "Nouri Bouzid",
         "Moufida Tlatli"
      ],
      "originalLanguage": "Arabic",
      "imdbLink": "http://www.imdb.com/title/tt0111055/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NTI3MTY4MF5BMl5BanBnXkFtZTcwNzI0MzcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Amel Hedhili, Najia Ouerghi, Hend Sabri | See full cast and crew »"],
      "reviews": [
         "Assimilated into the Turkish Ottoman Empire in the 16th century, Tunisia became a French protectorate in 1881 until President Habib Bourguiba, leader of a two-year guerrilla war for independence, declared Tunisia a republic in 1957, ending the rule of the former Ottoman Beys. Winner of the Cannes Jury Prize in 1994, Tunisian director Moufid Tlatli's Silences of the Palace depicts the oppressive nature of the male-dominated palaces and the price that women servants had to pay. Required not only to cook and clean, but to serve the sexual needs of the princes, Silences shows the consequences in the lives of two strong-minded but vulnerable women: Khedija (Amel Hedhili) and her young daughter Alia (Hend Sabri). The film opens in the 1960s. Alia (Ghalia Lacroix), is now 25 and performing as a night club singer. Though she is nominally free, she is beholden to a man who refuses to marry or have children. When she learns of the death of Prince Sidi Ali (Kamel Fazaa) she returns to the palace in which she grew up to pay a condolence call to Ali's near-blind widow (Najia Ouerghi), a visit that opens the floodgates of memories. Told in flashbacks, the film shows Alia as a pre-adolescent becoming increasingly aware of her own body and sadly, of her mother's true role in the palace. Alia is a gifted singer and the musical numbers in the film are hauntingly beautiful but nothing can hide the torment the young girl faces in trying to find out who her father is and to sort out where she belongs. The performance of Ms. Sabri is wondrous as she conveys the confusion of coming of age in a non-nurturing environment while still maintaining her charm and enchanting us with her songs. Tlatli, in her first feature film, never shoots outside of the palace interior, conveying the sense of oppression and isolation though the servants listen on the radio to news about the growing struggle for independence. The women are strong and resilient, however, in spite of what they must face each day. Though Khedija tries to protect her daughter from the same fate she suffers, she knows that her power is limited. \"If a man touches you, run away,'' she tells her, \"Your place is with me in the kitchen.\" When Alia suggests that they both leave together, her mother can only respond \"Where would we go? This is the only home I've ever known.\" While Tlatli bravely challenges the institutions that led to male dominance, there is a tone of resignation and acceptance in the silences that suggests the subservient role many women play in Moslem countries to this day. Silences of the Palace is a lovely film but one that left me with a sense of aching loss.",
         "The best film ever made in the Arab World really isn't a superlative that would be difficult to attain, but this film is really a masterwork. Aliya a singer with an superb voice but little success is invited to the palace where she spent her childhood as the daughter of a servant. She never really got to know who her father was, that she has been invited back to the palace after the head of the household, member of the Turkish ruling family of pre-independence Tunisia has died is no accident. Back in the palace all her childhood memories come back to Alia. She remembers her mother being the concubine of the deceased. His wife was barren, and she becomes sure that she is his daughter. She also remembers how her love for music helped her to gain prestige in the palace. But the songs she sang were not just entertainment. The melodies of Umm Kulthum were broadcasted by Radio Cairo to spread the message of Arab awakening and the longing for independence. Albeit its political aspects also the ruling family, a puppet on the strings of the French, enjoys the music. But for the masses the songs also become a symbol for the longing for freedom. falls in love with one student who is an independence activist. He is hiding in the palace where his aunt is another servant. He promises her a brilliant future but already at the beginning of the film we are told that the promise was not to be kept. The film is a ingenious ridiculization of political rhetoric and seldom ever has Oriental music bee integrated in a film so brilliantly (except perhaps Ray's Jalsaghar). You will enjoy it even if Arab music doesn't mean anything to you.",
         "Let us begin by discussing this film's title \"The Silences of the Palace\".This catchy title is an absolute misnomer as in real terms there are no silences in the palaces.Most of the palaces featured in the film are full of sounds but a feeling of silence is deliberately implied as there is no one willing to hear these sounds.Moufida Tlatli is an important name in the realm of both Arab as well as Tunisian cinema.She finished her cinema studies at famous French film institute IDHEC.Many famous Arab films bear her name as she did editing work for many prominent Arab film makers.Her debut film \"The Silences of the Palace\" is about the last days of Tunisian aristocracy.It was a time of confusion as Tunisian rulers were worried about their fate as the nation was looking forward to an imminent freedom.As portrayed in this film the plight of the common people including women has not changed as they are being continually forced to remain in silence.Moufida Tlatli dedicated this film to her mother who was a constant source of inspiration to her while she was drafting this film.If a list of best Arab films is drafted,this film by Moufida Tlatli will surely be there.",
         "This film is a powerful story about economic and sexual oppression, and is equally interesting as a sort of history of underrepresented people during the French occupation as it is a comment on women's rights in Tunisia. I don't like what the commenter from Germany said- 'best film made in the Arab world wouldn't be a difficult superlative to obtain'? There are many great films that have been made in the Arab world, and whatever else you said about the film is worthless to me when you make that kind of statement because it tells me how many of the great Arab films you must have seen to judge it by- not many. I would agree, it is without doubt one of the best Arab films I've seen- but I would have to see literally thousands of Arab films before I could be comfortable making such an outrageous generalization.",
         "This film is a gateway to Tunisian culture as it was when the country became independent. The principal character is a young girl who lives in a palace, but she is not a princess. In fact, her mother is some kind of a slave who works there without beeing paid for it and having any chance to get out of the palace. She doesn't want to tell her daughter, who her father is. Outside, the country is aiming to get loose of the French power. This is a story about strong women who live and work together and take care of each other. They are not beautiful like the American or European film stars, but still somehow sexy and very feminine. They are afraid of their sexuality, because they cannot control the desire it awakes in the powerful men around them. Their only hope to get out of the palace is marriage, but very few men see them inside the walls of the palace. One could think that the movie is very pessimistic. In the contary, the love of the women and of music create an atmosphere of hope and the new generation has a possibility to choose...",
         "-THE WOMAN SERVANTS The women working in the palace of the last Bey are united in their situation. Their main duty being the upkeep of the house and the preparation of meals, they also serve as sexual servants to the princes. From the outside, then, the palace is a revered place of grandeur and importance; on the inside, however, we see a harem of clandestine activity and unspoken shame. These are the 'silences' referred to in the film's title. We get a good impression of the women's tiring and monotonous work maintaining the palace, although Tlatli also places considerable focus upon their role as sexual servants, as it is so destructive to the morale of the women, robbing them of identity and self-worth. The servants are cut off from the outside world and therefore unable to improve their situation - we hear how one servant's cousin came to visit her at the palace but was turned away. The women are prisoners of the palace, having no life beyond its walls. -THE NATIONALIST MOVEMENT AND ITS EFFECT ON THE SERVANTS The film is set at a time of great political and social uncertainty. Tunisian independence is imminent, and a quick transfer of authority from the French to the Tunisian government - as happened in some other Maghreb countries - will undoubtedly lead to sudden and drastic changes in Tunisian society. The women of the palace listen to news bulletins about the nationalist movement whenever they can. On one hand, they do not feel directly affected by it due to their insular existence within the palace walls: their detached world within the palace gives them a sense of security, just like long-serving prison inmates. On the other hand, the nationalist movement carries optimism for the women: it is the only source of hope for eventual liberation from their pitiful situation. With no legal status or identity, the servants are not even recognised members of society. -KHADIJA AND ALIA We see numerous examples of the frustration and despair that the women suffer throughout the film. Khadija, Alia's mother, has lived and worked as a servant to the Beys - and as a sexual slave to Sidi Ali - for her whole life. She cannot leave as she has nowhere else to go. She places all her hopes for the future in her daughter. As Alia grows up, Khadija fears for her daughter's safety against the sexual desires of her masters. She is desperate for Alia to avoid the suffering that she has lived with, and therefore nourishes her daughter's ability and enthusiasm for music, in the hope of liberating Alia. Khadija puts her small earnings towards the purchase of a lute. Alia has an independent spirit, which most clearly manifests itself in her love for singing and playing the lute. We are made to feel optimistic for Alia as she grows up. She develops hope in the nationalist movement through her teacher (and later her lover) Lotfi. Unlike her mother before her, Alia has a belief that she must withstand the pressures imposed upon her by her situation in the palace. Her personal struggle is, however, ultimately tragic: we see her at the end having lost confidence in her music and in herself, due in part to her tragic miscarriage. Portraying the women of the palace as she does - and particularly through the character of Alia - Tlatli draws upon a need for Tunisian women to come to terms with the pains of the past. By constructing a scenario whereby Alia relives the painful memories of her childhood by revisiting Khalti Hadda and the deserted palace, Tlatli underlines the repression that women suffer. Without coming to terms with their personal trauma and tragedy, Tunisian women cannot improve their status, despite the nation's independence and political stability."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Canal Horizons",
         "Cinétéléfilms",
         "Mat Films"
      ],
      "summaries": [
         "As Alia, the daughter of a beautiful servant Khedija, grows up in the Kings Palace at the end of the French colonial rule in Tunisia, she realizes the sexual favours required of her mother and other servants.",
         "As she grows up, Alia (the daughter of housemaid Khedija) learns the secrets of the peaceful palace where she and her mother live."
      ],
      "budget": 0
   },
   "movielensId": 127,
   "movielens": {
      "languages": [
         "العربية",
         "Français"
      ],
      "releaseDate": "1994-09-30",
      "dvdReleaseDate": null,
      "directors": ["Moufida Tlatli"],
      "runtime": 116,
      "movieId": 127,
      "title": "The Silences of the Palace",
      "mpaa": "",
      "actors": [
         "Amel Hedhili",
         "Najia Ouerghi",
         "Fatima Ben Saïdane",
         "Zahira Ben Ammar",
         "Sabah Bouzouita",
         "Hend Sabry",
         "Sonia Meddeb",
         "Hélène Catzaras",
         "Ghalia Lacroix",
         "Michket Krifa",
         "Hichem Rostom",
         "Kamel Fazaa",
         "Sami Bouajila",
         "Hattem Berabeh",
         "Kamel Touati"
      ],
      "imdbMovieId": "0111055",
      "originalTitle": "صمت القصور",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["2Vmtb6B6nTs"],
      "plotSummary": "The death of a prince brings a young woman back to the palace where she was born into servitude. The lingering legacy of the harem is brought into light from behind frosted windows and velvet curtains.",
      "tmdbMovieId": 44284,
      "avgRating": 3.21569,
      "releaseYear": "1994",
      "numRatings": 51,
      "posterPath": "/3M4bH7A2L6wrHeueTUwr5PKYkfS.jpg"
   }
}