{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "pimp",
            "id": 1667
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "louisiana",
            "id": 3134
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "conviction",
            "id": 199483
         }
      ],
      "imdb_id": "tt0090967",
      "video": false,
      "title": "Down by Law",
      "recommendations": [
         469,
         339,
         11305,
         883,
         922,
         204,
         9343,
         695,
         10227,
         11368,
         405,
         37997,
         26617,
         144,
         2000,
         4816,
         11222,
         655,
         779,
         4485
      ],
      "backdrop_path": "/nnP2m2MuHZmC5aeqlL5fRD0G149.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "57e48115c3a3687597009e24",
         "content": "Jim Jarmusch's work can be either intimidating or off-putting, and in equal measure, to cinephiles because it feels so relaxed--almost as if it was a spur-of-the-moment, off-the-cuff precursor of reality-TV, an inside-joke with everyone involved slipping a nod and a wink, as if on a drunken dare, a mickey of JD passed back and forth along with a pack of Marlboros. This brought to mind many good memories of one of the oddest residents of The Criterion Collection: 'Fishing with John' (an exemplary and hilarious six-part mini-series in which John Lurie goes on fishing expeditions with five American cinematic greats, his partners-in-crime here, Jarmusch and Tom Waits amongst them; one that I'd love to see both get a blu upgrade as well as more episodes, now 25 years later). Also, clearly Jarmusch had a fine rapport with his actors, for this is by far the best and most restrained work I have ever seen from Roberto Benigni.\r\n\r\nOne of Jarmusch's more atypical films, 'Ghost Dog: The Way of the Samurai', is still my personal favourite, but this is right up there alongside. It would also make an intriguing double-bill with Jeff Nichols' stellar, though more serious in tone, recent film, 'Mud'.",
         "url": "https://www.themoviedb.org/review/57e48115c3a3687597009e24"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Zack",
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f8032139",
               "name": "Tom Waits",
               "profile_path": "/3XXe20xrdgUaOchQt5YOQqqSH6u.jpg",
               "id": 2887,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f803211d",
               "name": "John Lurie",
               "profile_path": "/izPEjdTrWUy3gPEdJ8f2OOnBW3f.jpg",
               "id": 6394,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Roberto",
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f8032121",
               "name": "Roberto Benigni",
               "profile_path": "/v2C2JVPVRg0zwgrI0yqeanUxVLa.jpg",
               "id": 4818,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Nicoletta",
               "gender": 1,
               "credit_id": "52fe42fdc3a36847f8032125",
               "name": "Nicoletta Braschi",
               "profile_path": "/KVd8Wj5PXrZ4XhtnWzbdqvQLIu.jpg",
               "id": 9235,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Laurette",
               "gender": 1,
               "credit_id": "52fe42fdc3a36847f8032129",
               "name": "Ellen Barkin",
               "profile_path": "/i4WSy0da6KaA3xvETtXqZtUMoRP.jpg",
               "id": 6913,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Gig",
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f803213d",
               "name": "Rockets Redglare",
               "profile_path": "/ytzTZMZifn86lpZhMCc8UhFbVz3.jpg",
               "id": 6401,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f8032107",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f803210d",
               "name": "Robby Müller",
               "profile_path": "/d9Fz3vBIBBYUXYbPTIxo2FwYGSL.jpg",
               "id": 1632,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fdc3a36847f8032113",
               "name": "Alan Kleinberg",
               "profile_path": null,
               "id": 17519,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f8032119",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f803212f",
               "name": "John Lurie",
               "profile_path": "/izPEjdTrWUy3gPEdJ8f2OOnBW3f.jpg",
               "id": 6394,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f8032135",
               "name": "Tom Waits",
               "profile_path": "/3XXe20xrdgUaOchQt5YOQqqSH6u.jpg",
               "id": 2887,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "5aa5237f0e0a26075101e497",
               "name": "Claire Denis",
               "profile_path": "/bifT0inBvrNxLbLslWdgAfsajuF.jpg",
               "id": 9888,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.992159,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 1554,
      "vote_count": 199,
      "budget": 0,
      "overview": "A disc jockey, a pimp and an Italian tourist escape from jail in New Orleans.",
      "similar": [
         398175,
         10651,
         28110,
         483,
         1701,
         769,
         281,
         339692,
         507,
         445954,
         39927,
         2142,
         5971,
         3134,
         294963,
         431,
         2832,
         681,
         107846,
         298312
      ],
      "original_title": "Down by Law",
      "runtime": 106,
      "poster_path": "/r4HxZPAhfg2akFaixpVIAM83GCY.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Island Pictures",
            "id": 3492,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Black Snake",
            "id": 21612,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Grokenberger Film Produktion",
            "id": 42043,
            "origin_country": ""
         }
      ],
      "release_date": "1986-09-20",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "It's not where you start - It's where you start again.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Jim Jarmusch"],
      "runtime": 107,
      "synopsis": "(spoilers!!!!) the movie starts out with Zack, an out-of-work cant be pleased with anyone or anything radio DJ who has just gotten kicked out of his girlfriends apartment. Angry and upset, he gets nearly wasted and stays out in front of a local bar, where a mob boss gives him 2000 dollars to drive \"a clean car\" from Point A (The Bar) to Point B (the next city over), little does Zack know that inside of the trunk contains a dead body. Because Zack is drunk, the cops pull him over, search the car, and take him directly to prison. Cut to a scene of a local pimp named Jack, attempting to cut a deal with a customer. This man is big stuff around the city and has lots of enemies. Cut to the next scene where the phone rings, and one of Jacks enemies tells him of a girl whos interested in \"working for him\". Jack goes to the hotel to find that the girl is a little child, and that this was a police set-up to nail Jack. Cut to the next scene where Zack, sitting in jail is introduced to Jack the pimp. And later on we meet Roberto, an Italian man who committed manslaughter. After months of rotting in prison, Roberto finds a way for the men to escape. The rest of the movie is them running from the law, and how they escape and the fate of the three men",
      "writers": ["Jim Jarmusch"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090967/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NjA0OTIxMV5BMl5BanBnXkFtZTYwNDQ3NTk4._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Waits, John Lurie, Roberto Benigni | See full cast and crew »"],
      "reviews": [
         "One of the most frequently heard criticisms of Jarmusch's work is that the pace is slow. I would like to make a case for patience. After all, if true beauty and grace were delivered in one massive hit, our poor brains and hearts would not withstand the blow. In Down By Law, Jarmusch invites us to take some time, some real time and devote it to getting deeply involved with his characters. Men in crisis. Misfits, jailbirds, heartbreakingly human. We accompany them on their journey, their escape from their confines. It is a truly epic journey on a small geographical scale. We watch as they begin to mirror one another, as their individual egos become inextricably enmeshed in one another. We watch a friendship form. And how can we begrudge the time Jarmusch takes for this glorious exposition? How can we do anything but marvel at the fine detail in which the scenes are drawn, at the subtle movements of our heroes? Every gesture signifies worlds of meaning and consequence. And Jarmusch does it better, with more skill and with more compassion than anyone. If you are prepared to get involved, if you are brave enough to commit to the journey, you will be rewarded with a kind of epiphany that few films can offer.",
         "A cult classic - and yet still relatively little known. Jim Jarmusch is a master when it comes to creating atmosphere (and nobody uses stretches of silence to better comedic effect than he does). Shot in beautiful black and white, this tale of three prisoners who make for very unlikely companions is all mood, deadpan humour and practically no action. Don't expect a story - just enjoy the ride, the dialogues (consisting mainly of the word 'F***' - unless it's Benigni talking: his chaotic, broken English lines are another highlight of the film) and the fantastic soundtrack by John Lurie and Tom Waits. Perhaps the epitome of a cult movie, this one goes down like a cool beer on a hot summer evening (and as with all cult movies, it is best seen with an audience that already knows and loves the film). A minimalistic comedy masterpiece. 9 stars out of 10. Favorite Films: http://www.imdb.com/list/ls054200841/ Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/ Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/",
         "Wow, what a movie. Far away from Hollywood, Jim Jarmusch creates a world where you don't need drama, pathos and action to fascinate the watcher. Because fascinating is exactly what this movie is. A plot in the classical sense is almost completely missing; the scenes, in their simplicity sometimes reminding of theater, follow each other without ever creating real suspense; neither griping action nor complex dialogues are there to excite the spectator. And still, with ease Jarmusch fills more than a hundred minutes with a story you won't take your eyes off. It is hard to tell what the atmosphere of the movie is really based on, the characters, the setting, entirely in black and white, the music - probably all of it. Again, like in Jarmusch's later movie \"Dead man\", speed is an important factor: everything moves slowly, without haste, as there is no dramatic climax you could hurry towards; yet, boring is a word that certainly doesn't fit this piece of cineastic art. On the other hand, though some of the scenes seem quite surrealistic, it is not a really artistic movie breaking with all the traditional concepts of filmmaking; it is more a movie in classic shape with an unconventional story, not trying to shock, to confuse or even to make you think so much; this movie doesn't need all this to get your complete attention. You could probably speculate a lot about the meaning of the movie; to me, this seems highly unnecessary. Just let it unfold its atmosphere. Judge yourselves, but I was excited in a very special way by every scene of this motion picture, giving me one of my best cineastic experiences of the recent time.",
         "This movie was a total surprise to me. I'm sure it's very famous, but somehow had never seen it before. From the beginning scenes, I was expecting a gritty low life, wind up in the gutter, down and out kind of crime movie and that was fine with me, especially if set in New Orleans. At the same time there was a surprising freshness about it, that caught my attention, like a wake up call. Literally, there was writing on the wall that signaled \"this is not that kind of movie!\" The opening scenes reminded me of the opening of Sopranos -- the rolling shot of a neighborhood with an ominous sounding song in the background. (Were the Sopranos producers inspired by this film?) But once Roberto Benigni appeared on the scene, announcing that \"Life is Sad and Beautiful\" the whole story began to feel more like a strange fairy tale. Throughout the film, I appreciated the way the director took his time, letting the story evolve slowly, giving the characters time to develop their tenuous bonds. I could watch this again and again, knowing I would keep discovering hidden meanings, references, and ironies. Loved it!!!!",
         "I first saw Down By Law when it first came out, and loved it. I watched it again recently, and it really hasn't aged at all. In fact, it has gotten even better. I'm not sure there's another movie like it (unless the other Jarmusch ones are -- I haven't seen them). There are very few movies that spend so much time on character development that still have great plots. Like the \"Big Easy\" where it is filmed, this one takes its time but has an easy charm once the plot gets where it was going. The dialogue is wonderfully written, and better acted. Each scene is like a work of art in how it is staged. The soundtrack uses one of the best albums ever recorded, \"Rain Dogs\" by Tom Waits, who stars. One of my all time favorites.",
         "Jim Jarmusch trusts his camera, his directing, his writing, and most of all his performers. This is a gem of a film, without pretense. The story and film just move, sluggishly chugging forward to an ending that is really more of a dissolve. The story is ultimately of little importance, just enough movement to show us a bit of the big jokester in the skies irony. I was struck by the similarity's to Dead Man, similarities quite aside the black and white photography. The enigmatic character at the center, the drifting in and out of the main characters, the use of the boat, the disposal of the usual plot devices, the cutting away of obvious scenes (like the \"how' of the escape) I wish more films displayed this sort of ease with themselves. Great stuff, 8/10.",
         "Down by Law is a film that has mesmerized me for years. The first time I saw it, it sunk into me like the smile from a homeless person. It told me something I should've already known. I've heard people use the word \"quirky\", when drawing comparisons to a Jarmusch character, but, I like the phrase: \"Spot On\". He has captured man's fear within himself, and, the ability to hide that fear. It takes a director of great courage and knowledge of self to pull that one off without boring you. If you're a fan of Joel Schumaucher or James Cameron, this is not the film for you. But if your a fan of people, and, the human condition, the mirror reflects back, 2 hours at a time, and Jarmusch is right behind it.",
         "I've seen a couple of Jarmusch movies and except for Dead Man (which I thought was an incredible bore), they were all great. Down By Law is probably one his best known flicks and is a very good low budget movie. It features Tom Waits, who's not only a fine musician but proves to be a decent actor as well; John Lurie, who also wrote the excellent soundtrack (Waits delivered the opening and end-credits track btw); Roberto Benigni, who nowadays is most famous for directing the Oscar-winning Italian film \"La Vita E Bella\". The movie deals about three guys who meet in prison and escape. It reminded me of \"O Brother Where Are Thou?\" and, perhaps because of it being filmed in black and white, of old 40's movies about escaping prisoners (can't think of a good example, but you get the picture). Three things I liked very much about this movie: 1. It's incredibly funny, especially Benigni made me laugh every time he opened his mouth - He irritated me highly in \"La Vita E Bella\" so that must mean something.... 2. The frame of the camera is very well used. Look at the scene where Lurie counts the money and a hooker is laying behind him on the bed and the scene after that. Another example is when Benigni is dancing with a lady and the other two guys are continuing their breakfast in the back. 3. It's very hard to pinpoint when the story takes place; it's timeless in more than one way, obviously helped by the lack of color. All in all, this one comes highly recommended.",
         "If i had to describe any aspect of this flick i'd say it was \"crafted\". Utterly sublime direction from Jarmusch, with a sense of desolation in the landscape that is captured so well, it's almost surreal. Waits is, simply put, a genius, and puts in a performance which would silence any who feel that \"you can't be both an actor and a musician\". Benigni and Lurie are both a delirius joy and deliciously despicable respectively. The use of Waits' music within the film only heightens the sense of dusty Americana, and hip oddball style. It reminds me that indie-film snobs have actually got something right for a change, and its cult classic status is rightly deserved. Exquisitely shot, with an excellent soundtrack and sterling performances. Highly recommended, especially for fans of Waits and Benigny. Also, it's the only film that makes me want ice cream....",
         "Tom Waits, John Lurie, and Roberto Begnini share a Louisianna prison cell together, and a prison escape film, with all of the actual escape parts cut out. Funny, wonderful performances, stunning black and white cinematography, great music, a human story, an oddly heart warming ending about people coming together and moving apart. There's subtle poetics at work here, with all of Robert Frost, Walt Whitman, references, but somehow it all falls together naturally. Still though I appreciated it more than I actually enjoyed it, but with time I can see myself coming back in the future. Great dry comedy, and beautiful everyday images."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Black Snake",
         "Grokenberger Film Produktion",
         "Island Pictures"
      ],
      "summaries": [
         "DJ Zack and pimp Jack end up in prison for being too laid-back to avoid being framed for crimes they didn't commit. They end up sharing a cell with eccentric Italian optimist Roberto, whose limited command of the English language is both entertaining and infuriating -but rather more useful to them is the fact that Roberto knows an escape route",
         "In Louisiana, Laurette has an argument with her boyfriend, DJ Zack a.k.a. Lee Baby Simms, and breaks up with him. The upset Zack drinks alcohol on the street and his acquaintance Preston offers him US$ 1,500 to drive a Jaguar to the other side of the city. However, there is one problem - a man is locked up in the trunk of the car. Zack is arrested and sent to the Orleans Parish Prison. Meanwhile the pimp Jack is framed by his acquaintance, arrested and put in the same cell as Zack. When an Italian Roberto, a.k.a. Bob, who does not speak English very well joins them in the same cell, the trio develops a strange friendship. Bob proposes a means of escape from prison.",
         "The story of three different men in a Louisiana prison and their eventual journey."
      ],
      "budget": 1100000
   },
   "movielensId": 1273,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1986-09-20",
      "dvdReleaseDate": "2002-10-22",
      "directors": ["Jim Jarmusch"],
      "runtime": 106,
      "movieId": 1273,
      "title": "Down by Law",
      "mpaa": "",
      "actors": [
         "Tom Waits",
         "John Lurie",
         "Roberto Benigni",
         "Nicoletta Braschi",
         "Ellen Barkin",
         "Rockets Redglare"
      ],
      "imdbMovieId": "0090967",
      "originalTitle": "Down by Law",
      "genres": [
         "Crime",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "fS6Id_TJc6E",
         "-luts3zs0b0"
      ],
      "plotSummary": "A disc jockey, a pimp and an Italian tourist escape from jail in New Orleans.",
      "tmdbMovieId": 1554,
      "avgRating": 4.01197,
      "releaseYear": "1986",
      "numRatings": 3049,
      "posterPath": "/r4HxZPAhfg2akFaixpVIAM83GCY.jpg"
   }
}