{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "romantic rivalry",
            "id": 4516
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "polygamy",
            "id": 6751
         },
         {
            "name": "concubine",
            "id": 8754
         },
         {
            "name": "wealth",
            "id": 10329
         },
         {
            "name": "intrigue",
            "id": 34038
         },
         {
            "name": "oppression",
            "id": 158455
         },
         {
            "name": "1920s",
            "id": 207876
         }
      ],
      "imdb_id": "tt0101640",
      "video": false,
      "title": "Raise the Red Lantern",
      "recommendations": [
         10997,
         38143,
         31439,
         36210,
         976,
         1939,
         851,
         43364,
         16672,
         678,
         33319,
         934,
         833,
         12276,
         843,
         777,
         16305,
         887,
         20530,
         3782
      ],
      "backdrop_path": "/uqKrCval4hQe6Urh0CVQjN0UZfO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Song Lian",
               "gender": 1,
               "credit_id": "52fe43689251416c7500f385",
               "name": "Gong Li",
               "profile_path": "/dgGWKMAP5vbgACkXTazZXt3JQoT.jpg",
               "id": 643,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Chen Zuo Qian",
               "gender": 0,
               "credit_id": "52fe43689251416c7500f3b9",
               "name": "Ma Jing-Wu",
               "profile_path": "/7kGZQBWfm9c9FUIe6H9MzM7OebE.jpg",
               "id": 1139069,
               "order": 1
            },
            {
               "cast_id": 22,
               "character": "Mei Shan",
               "gender": 0,
               "credit_id": "5330e844c3a3686a7f0006f1",
               "name": "He Saifei",
               "profile_path": "/f5ZBBpd7QKw1s1wSQ7DgXJbLVtP.jpg",
               "id": 64987,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Zhuo Yun",
               "gender": 0,
               "credit_id": "52fe43689251416c7500f3c1",
               "name": "Cao Cui-Fen",
               "profile_path": null,
               "id": 64988,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Yan'er",
               "gender": 0,
               "credit_id": "52fe43689251416c7500f3c9",
               "name": "Kong Lin",
               "profile_path": null,
               "id": 1183504,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Yu Ru",
               "gender": 0,
               "credit_id": "52fe43689251416c7500f3cd",
               "name": "Jin Shu-Yuan",
               "profile_path": null,
               "id": 1183505,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Fei Pu",
               "gender": 0,
               "credit_id": "57401305c3a3680745000f52",
               "name": "Chu Xiao",
               "profile_path": null,
               "id": 1623396,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "Mother Song",
               "gender": 0,
               "credit_id": "57401314c3a368563c0006d2",
               "name": "Ding Wei-Min",
               "profile_path": null,
               "id": 1623397,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Old servant",
               "gender": 0,
               "credit_id": "5740131ec3a3685f0e0005ec",
               "name": "Cao Zeng-Yin",
               "profile_path": null,
               "id": 1342859,
               "order": 8
            },
            {
               "cast_id": 26,
               "character": "Dr Gao",
               "gender": 0,
               "credit_id": "5740132ac3a36807490010d7",
               "name": "Cui Zhi-Gang",
               "profile_path": null,
               "id": 1623398,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43699251416c7500f3d1",
               "name": "Li Bao-Tian",
               "profile_path": "/iakW6UTcQG2utvTdvBlE6IsAa0p.jpg",
               "id": 146097,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "",
               "gender": 0,
               "credit_id": "5740133e92514177f200109a",
               "name": "Xu Wei",
               "profile_path": null,
               "id": 1067113,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43689251416c7500f38b",
               "name": "Zhang Yimou",
               "profile_path": "/uU5vECl94jDQYjiRk4eOpVRMEi9.jpg",
               "id": 607,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43689251416c7500f391",
               "name": "Su Tong",
               "profile_path": "/ojFZkL1bnABxkkF5WZ0X7UB4qas.jpg",
               "id": 64216,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe43689251416c7500f397",
               "name": "Ni Zhen",
               "profile_path": null,
               "id": 64217,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43689251416c7500f39d",
               "name": "Fu-Sheng Chiu",
               "profile_path": null,
               "id": 64991,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43689251416c7500f3a3",
               "name": "Hou Hsiao-hsien",
               "profile_path": "/lIr03NsssQ8i6pbujxKfanr4a07.jpg",
               "id": 64992,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43689251416c7500f3a9",
               "name": "Wenze Zhang",
               "profile_path": null,
               "id": 64993,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43689251416c7500f3af",
               "name": "Naoki Tachikawa",
               "profile_path": null,
               "id": 64994,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43689251416c7500f3b5",
               "name": "Jiping Zhao",
               "profile_path": null,
               "id": 65285,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5896087ec3a368089800c91b",
               "name": "Zhao Fei",
               "profile_path": null,
               "id": 28001,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 14.426286,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         },
         {
            "iso_3166_1": "TW",
            "name": "Taiwan"
         }
      ],
      "id": 10404,
      "vote_count": 183,
      "budget": 0,
      "overview": "China in the 1920s. After her father's death, 19 year old Songlian is forced to marry the much older lord of a powerful family. With three wives already, each living in a separate house within the great castle, there is fierce competition for his attention and the privileges that are gained. This competition gets out of hand...",
      "similar": [
         12102,
         55721,
         87567,
         164251,
         12771,
         842,
         16085,
         8998,
         16553,
         450417,
         28571,
         206296,
         18190,
         22152,
         133919,
         157380,
         53896,
         102057,
         45938,
         4974
      ],
      "original_title": "大红灯笼高高挂",
      "runtime": 125,
      "poster_path": "/34FoAUoBCV3XdPngd0wF8rgszpP.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ERA International",
            "id": 21329,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "China Film Co-Production Corporation",
            "id": 2269,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Century Communications",
            "id": 21330,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Salon Films",
            "id": 21331,
            "origin_country": ""
         }
      ],
      "release_date": "1991-12-20",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yimou Zhang"],
      "runtime": 125,
      "synopsis": "The film is set in 1920s China during the warlord era, years before the Chinese Civil War. Nineteen-year-old Songlian ( Sònglián, played by Gong Li), whose father has recently died and left the family bankrupt, marries into the wealthy Chen family, becoming the fourth wife or rather the third concubine or, as she is referred to, the Fourth Mistress ( Sì tàitai) of the household. Arriving at the palatial abode, she is at first treated like royalty, receiving sensuous foot massages and brightly-lit red lanterns, as well as a visit from her husband, Master Chen (Ma Jingwu), the master of the house, whose face is never clearly shown. Songlian soon discovers, however, that not all the concubines in the household receive the same luxurious treatment. In fact, the master decides on a daily basis the concubine he will spend the night with; whomever he chooses gets her lanterns lit, receives the foot massage, gets her choice of menu items at mealtime, and gets the most attention and respect from the servants. Pitted in constant competition against each other, the three concubines are continually vying for their husband's attention and affections. The First Mistress, Yuru (Jin Shuyuan), appears to be nearly as old as the master himself. Having borne a son decades earlier, she seems resigned to live out her life as forgotten, always passed over in favor of the younger concubines. The Second Mistress, Zhuoyun ( Zhuóyún, Cao Cuifen), befriends Songlian, complimenting her youth and beauty, and giving her expensive silk as a gift; she also warns her about the Third Mistress, Meishan ( Méishn, He Caifei), a former opera singer who is spoiled and who becomes unable to cope with no longer being the youngest and most favored of the master's playthings. As time passes, though, Songlian learns that it is really Zhuoyun, the Second Mistress, who is not to be trusted; she is subsequently described as having the face of the Buddha, yet possessing the heart of a scorpion. Songlian feigns pregnancy, attempting to garner the majority of the master's time and, at the same time, attempting to become actually pregnant. Zhuoyun, however, is in league with Songlian's personal maid, Yan'er ( Yàn'ér, played by Kong Lin) who finds and reveals a pair of bloodied undergarments, suggesting that Songlian had recently had her period, and discovers the pregnancy is a fraud. Zhuoyun summons the family physician, feigning concern for Songlian's \"pregnancy\". Doctor Gao ( Go-yshng, Cui Zhigang), who is secretly having an illicit affair with Third Mistress Meishan, examines Songlian and determines the pregnancy to be a sham. Infuriated, the master orders Songlian's lanterns covered with thick black canvas bags indefinitely. Blaming the sequence of events on Yan'er, Songlian reveals to the house that Yan'er's room is filled with lit red lanterns, showing that Yan'er dreams of becoming a Mistress instead of a lowly servant; it is suggested earlier that Yan'er is in love with the Master and has even slept with him in the Fourth Mistress' bed. Yan'er is punished by having the lanterns burned while she kneels in the snow, watching as they smolder. In an act of defiance, Yan'er refuses to humble herself or apologize and thus remains kneeling in the snow throughout the night until she collapses. Yan'er falls sick and ultimately dies after being taken to the hospital. One of the servants tells Songlian that her former maid died with her mistress's name on her lips. Songlian, who had briefly attended university before the passing of her father and being forced into marriage, comes to the conclusion that she is happier in solitude; she eventually sees the competition between the concubines as a useless endeavor, as each woman is merely a \"robe\" that the master may wear and discard at his discretion. As Songlian retreats further into her solitude, she begins speaking of suicide; she reasons that dying is a better fate than being a concubine in the Chen household. On her twentieth birthday, severely intoxicated and despondent over her bitter fate, Songlian inadvertently blurts out the details of the love affair between Meishan and Doctor Gao to Zhuoyun; who later catches the adulterous couple together. Following the old customs and traditions, Meishan is dragged to a lone room on the roof of the estate and hanged to death by the master's servants. Songlian, already in agony due to the fruitlessness of her life, witnesses the entire episode and is emotionally traumatized. The following summer, after the master's marriage to yet another concubine, Songlian is shown wandering the compound in her old schoolgirl clothes, having gone completely insane.",
      "writers": [
         "Su Tong",
         "Ni Zhen"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0101640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNjY5NDcwNV5BMl5BanBnXkFtZTcwNzEwMzg4NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Li Gong, Jingwu Ma, Saifei He | See full cast and crew »"],
      "reviews": [
         "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.) Raise the Red Lantern is one of the most extraordinarily beautiful movies I have ever seen. The sets are exquisite tableaux carefully arranged, decorated and framed, and then shot from an attractive angle. The scene as they drag the third mistress, kicking and screaming to the tower of death, with the snow falling so peacefully onto the rooftops was chilling in its effect. The startling blaze of color, light and detail within the houses set against the drab simplicity of the courtyards, continually provided a contrast between life within the protection and at the favor of the master, and life without. This dichotomy is symbolized in the vibrant red lamps and the somber blue hue of the lamps when they are covered. In this manner, the mistresses are controlled. I was also struck by the sonorous beauty of the accompanying Chinese music. But more compelling than the beauty of the film is the story Director Zhang Yimou tells, a tale of paternity and imperious privilege set in early twentieth century China. He begins with the newly arrived fourth mistress, 19-year-old Songlian, a university student who, because of the death of her father, is forced to quit school. She chooses to marry a man of wealth. She is warned by her stepmother that she will be a concubine. She replies, isn't that our fate? Her cynicism and then her robust energy in seeking her ascendancy over the other sisters engages us and we identify with her struggle. What is extraordinary about Zhang's direction is how easily and naturally the personalities of the characters are revealed. The first mistress (\"big sister\") is too old to be of any sexual interest to the master, yet she is the mother of the eldest son. The second mistress, who has given the master only a daughter, still dreams of having a son. Her devious schemes and plots are hidden by smiles and fake good will toward her sisters. The third mistress, an opera singer still vibrant and beautiful (in a fascinating performance by the intriguing Caifei He), uses her allure in vying for the master's attention. Songlian, in spite of herself, finds herself caught up in the competition with the others. Gong Li, who plays Songlian, is very beautiful with a strength of character that one quite naturally admires. She has the gift, as does, for example, Julia Roberts, of being able to express a wide range of emotion with just a glance of her very expressive face. Serving as a foil to the mistresses, and perhaps as the most poignant victim of the concubine system, is the servant girl Yan'er, played with a compelling veracity by Kong Lin. She is occasionally (how shall I say this for Amazon?) \"touched,\" to use Songlian's term, by the master, and so she dreamed of being the fourth mistress. But when the fourth mistress arrives, her dreams are shattered, and in her jealousy she hates Songlian and plots against her. One of the most memorable scenes in the movie is when Songlian, thinking Yan'er has stolen her flute, forces open the servant girl's room and finds it flooded with.... Well, you should see. Note well that the master is only hazily observed. He is a personage, a man of wealth. That is enough to know about him. He is as interchangeable as the harem masters on a beach of elephant seals. But because he has wealth, he can engage concubines who must compete with one another through him to find their station in life. One gets a sense of what it might be like in the harem system practiced by gorillas and the sheiks and warlords of old. One pleases the master not because one loves the master (although one does of course because humans tend to love their masters) but because in pleasing the master one rises above the others. Thus the triumphant call, \"Light the lanterns in the third house!\" Most people no doubt lament the life of the mistresses. Yet women in poor places may wish such a life upon themselves. But concubines are just prostitutes, really, one might say, trapped by a system of male privilege. But I would remind those who see only that, that for every wife the \"master\" has, that is one wife another man will not have. The system does NOT favor males. It favors wealth and privilege. In such a system there are many men without wives, fomenting unrest, which is why modern states forbid polygamy. What does a man do with the capital he accumulates or inherits? If the system allows, he spends it on women and the assurance of his paternity. And why is that possible? Because many women--Songlian is our example--would rather be the fourth wife of a rich man than the first and only wife of a poor man. Many women would rather be used by a man of wealth than rule the household of a nerd. This is the way humans are, and any sexist interpretation of this movie misses this truth. The real horror depicted here, though, is in the brutality used to maintain the system, not in the polygamy itself. The women who follow the rules and beget the master's children, especially if they are sons, enjoy a pampered and secure existence Those who do not are dealt with severely, branded as mad, or even murdered. Note the similar experience of the wives of Henry VIII, for example, within the English system of serial monogamy. This is a great movie, like a timeless novel fully realized, directed by a visual genius, from a script of great psychological power. Don't miss this one. It's one of the best ever made.",
         "In response to the comments that this film is boring, shallow or without a character to identify with: Please study some Chinese history before you make such judgments. The story we see is a visual treat but overlays a much deeper story of China in myriad aspects. Perhaps you are unaware that films and books of the period had to tread lightly on topics that were not merely taboo but could result in danger for all connected. Thus, a slight symbolic representation often took place. Sort of poetic shorthand. Not unlike Chinese art that may seem to be about the season of autumn but is actually about death or change or loss. Nevertheless, any film must stand on its own regardless of the background. This film includes acting scenes that are incredibly forceful and still so gentle. The photography, costumes, sound and music blend into a cinematic work of art. I found the character completely believable, a woman bound in a tradition from which she found no escape except death or madness. And for those who sneer at the opera singer, imagine how the music you enjoy would sound to someone who has a completely different background. Please accept cultural diversity and let your mind and heart be enlarged!",
         "Every frame of this film explodes with excellent acting, cinematography, music and art direction. I never thought I would see something so beautiful in a foreign film since Ingmar Bergman's work. This is by no means, an art film this is a human film, while holding an ethnic background these people portrayed in the film are all of us and is probably what we would call a fable on the cruelty of humanity. I'am disgusted to discover this film isn't on video or DVD in america. It seems as if its popularity has run thin since the 90's but this is a masterpiece people!",
         "My interest was maintained throughout every minute of this rather long film. I don't remember when I've seen another film in which every single role was played to perfection. (Incidentally, this wonderfully believable acting seems to occur in at least some, if not most, of the roles in every Chinese movie I see, from the mainland or otherwise.) The story is one of classical simplicity, in in large part presented with the same classical, clear quality. The interplay of passion, jealousy, and revenge is reminiscent of Shakespeare, but, for me, more entertaining--if it's proper to speak of such ultimately somber and even horrifying subject matter as entertainment. I unhesitatingly gave a vote of ten, and noticed that a full 33% of voters so far had done the same--very unusual. When Roger Ebert called \"Raise the Red Lantern\" \"breathtakingly beautiful,\" he wasn't exaggerating. But beyond its beauty, its moral seriousness, the fact that not for a moment is it \"dumbed down\" in the regrettable Hollywood fashion, its superb acting, and its almost unbelievably perfect pacing, make it a rare, rare experience. \"Red Sorghum,\" the only other Zhang Yimou film I've seen so far, I found somewhat propagandistic but gripping and visually stunning (even more so than \"Raise the Red Lantern.\") I will be making an effort to see more of this director's fairly extensive body of work. It's a shame major theater chains don't schedule movies of this caliber instead of the torrent of commercialized Hollywood trash they foist on the public, which, alas, seems only too eager to wallow in more and more of it.",
         "I can certainly understand why this film is so critically acclaimed. Raise The Red Lantern is one of the only Chinese movies I've seen, but I'll definitely admit that it's unusual to see a film this stylistically masterful come out of Hollywood (although it can happen -- The Thin Red Line, for example). A lot of what makes this film work is Zhang Yimou's outstanding directorial style; his use of color against bleak background is especially effective. It's his hypnotic visuals that keep you interested throughout the slow progression of the story. And the amazing acting by most of the performers doesn't hurt, either; everything feels completely real. I think of this as one of those movies that you aren't supposed to enjoy; it shocks you, and leaves you just as disturbed as, considering the subject matter, you should be. The miserable story of Yan'er, the servant girl, is especially painful to watch, and the same goes for the unfolding of the last few scenes. But I think the fact that I was so unsettled by this movie probably just goes to show how well it gets its points across. And along with the remarkable acting and directing, that's definitely something to be respected.",
         "\"Raise the Red Lantern\" is set at a Chinese baronial estate, the time, the 1920s. But, as the family-servant dynamics are placed on display, the viewer begins to feel it could be a thousand years earlier. The story is shown through the eyes of a young college-dropout played by Gong Li. Family misfortune has forced her into concubinage as the \"fourth mistress\" of the Chinese lord. A headstrong woman, her relationship with the lord's household, especially the other three mistresses, form the basis of the story. But it's telling is as important as the story itself. This is a beautiful, well-acted, well-directed movie. Slow-paced, it ingratiates itself with you, drawing you in deeper and deeper. I can't think of anything that warrants improvement. A masterpiece.",
         "I don't care what anyone says, this film belongs in the top 10 films of the 90s worldwide...the story, the implicit attacks on the Communist regime, cinematography, direction, and acting (Gong Li was superb) coelesced into one extraordinary piece of cinema magic that transcends both cultural and language differences. The film was so refreshing and exciting for me, yet it was also quite a dark film. Not a lot of \"conventional action\", instead, the intensity of the film comes from the actor's and their emotions. A very powerful film, and disturbing one at that. Job well done...Zhang Yimou was brilliant with this one. If you're a lover of great cinema, then this is a must. I'm already hounding at Criterion to take on this film.",
         "This movie has it all, betrayal, conflict and tragedy. I have to say that I couldn't live without it, effectively anyway. The political criticisms tear at the spine of the film and the beauty of it in such an intimate setting is outstanding. The use of such a rich, three dimensional setting defies what we have been taught by the mainstream as being beautiful and sets a standard on a budget that I would love to be aware of, that all Hollywood movies should aspire to. It shows us that film, real film that is, does not need $100 million to look good, rather the combination of a haunting setting in the middle of vastness and the equally haunting beauty of it's star, Gong Li, but at it's heart the house itself resembles a claustrophobic pot, boiling over the surface. This is in my opinion, Zhang Yimou's greatest film, it is a triumph in film form and narrative. The haunting sounds of flutes, a significant visual and audio element that has a mythical quality due to it's importance to Songlian and becomes an unattainable item of the gods when it is removed from existence when it is burned, becoming a tragic reminder on the attempts to vanquish the personalities of not only Songlian but all of the concubines. It's slow burning nature may repel the masses but anyone who can get a copy, do so without fail, you will never regret it. I cannot stress the importance of this film, we may see it as a study on the oppression of women in China, but this is universal, we westerners once did the same thing not too long ago. For me the cinematography is what sells the film, it is the best I have ever seen and ever will. If there is ever a film to promote the use of the three strip technicolour process once again, this is it. Long after you have finished your post film analysis, the light from the red lanterns will still be searing in your eyes.",
         "Zhang Yimou solidifies his standing as one of cinema's most brilliant craftsmen with Raise the Red Lantern, a heartbreaking and fascinating look into the life of a young, well-educated woman who gives up her future to become the fourth wife of a wealthy landowner in 1920s China. Gong Li, the director's longtime muse, delivers a performance nearly unsurpassed by anyone, male or female, in the 1990s (and many other decades, as well). Her opening close-up is an indelible image of sorrow and resignation capable of drawing tears out of a statue. Zhang Yimou makes films as exquisitely composed as any master's painting, and his palette extends beyond the obvious beauty of Gong Li to include the details of the courtyards, lanterns, silks, and rooftops with an inexplicable mixture of tranquility and austerity.",
         "Gong Li is utterly perfect as Songlian, the youngest 4th wife of a great landowner in 1920's China. When she joins the household of the Master, with his 3 other wives and numerous servants, she is little prepared for the infinite under-currents and jealousies of the wives and the continuous baiting of the servants. She is put in a house of her own off the main courtyard of the rambling estate, a vast maze of connected buildings. But the wives are not quite out of earshot of each other, and what can be overheard feeds the hate among them. When the Master has chosen the wife he wishes to spend the night with, huge red lanterns are lit and hung around the outside and inside of the house of that wife and she is given a foot massage with small weighted silver hammers whose castanet-like sounds echo through the entire complex, and they serve as an overt display to the others that they were not good enough on that day to win his affections and must try harder the next day. As each jockeys for the Master's attention, Songlian is at first expertly played against the other women but eventually learns to scheme and conspire as well as they. She is never sure exactly which of the other wives is her enemy or her friend, and the situation seems to change daily. After she makes a grand power play that fails, in part because of a jealous young female servant, she is effectively in exile for a time. However, a terrible, centuries-old custom will unfold in one of the topmost, locked rooms of the complex during her exile, and Songlian eventually discovers the dreadful secret. This is a masterful film which only gets better on each viewing."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "ERA International",
         "China Film Co-Production Corporation",
         "Century Communications"
      ],
      "summaries": [
         "China in the 1920's. After her father's death, nineteen year old Songlian is forced to marry Chen Zuoqian, the lord of a powerful family. Fifty year old Chen has already three wives, each of them living in separate houses within the great castle. The competition between the wives is tough, as their master's attention carries power, status and privilege. Each night Chen must decide with which wife to spend the night and a red lantern is lit in front of the house of his choice. And each wife schemes and plots to make sure it's hers. However, things get out of hand...",
         "A young woman becomes the fourth wife of a wealthy lord, and must learn to live with the strict rules and tensions within the household."
      ],
      "budget": 0
   },
   "movielensId": 1280,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1991-12-20",
      "dvdReleaseDate": "2006-02-14",
      "directors": ["Zhang Yimou"],
      "runtime": 125,
      "movieId": 1280,
      "title": "Raise the Red Lantern",
      "mpaa": null,
      "actors": [
         "Gong Li",
         "Ma Jing-Wu",
         "He Saifei",
         "Cao Cui-Fen",
         "Kong Lin",
         "Jin Shu-Yuan",
         "Chu Xiao",
         "Ding Wei-Min",
         "Cao Zeng-Yin",
         "Cui Zhi-Gang",
         "Li Bao-Tian",
         "Xu Wei"
      ],
      "imdbMovieId": "0101640",
      "originalTitle": "大红灯笼高高挂",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["vivaoPZhIH8"],
      "plotSummary": "China in the 1920s. After her father's death, 19 year old Songlian is forced to marry the much older lord of a powerful family. With three wives already, each living in a separate house within the great castle, there is fierce competition for his attention and the privileges that are gained. This competition gets out of hand...",
      "tmdbMovieId": 10404,
      "avgRating": 4.11546,
      "releaseYear": "1991",
      "numRatings": 3590,
      "posterPath": "/34FoAUoBCV3XdPngd0wF8rgszpP.jpg"
   }
}