{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "time travel",
            "id": 4379
         },
         {
            "name": "playwright",
            "id": 10965
         },
         {
            "name": "1910s",
            "id": 210184
         }
      ],
      "imdb_id": "tt0081534",
      "video": false,
      "title": "Somewhere in Time",
      "recommendations": [
         10631,
         236,
         20096,
         17956,
         21468,
         12235,
         22292,
         11521,
         246882,
         11415,
         56120,
         47359,
         12187,
         2107,
         3033,
         34376,
         2612,
         2565,
         14845,
         11980
      ],
      "backdrop_path": "/4hqhzKb7yheP1BPnfXphIqnWWKT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Richard Collier",
               "gender": 2,
               "credit_id": "52fe46e19251416c7508695d",
               "name": "Christopher Reeve",
               "profile_path": "/9D4L3XeklsMc4r8FybZSTKON3HR.jpg",
               "id": 20006,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elise McKenna",
               "gender": 1,
               "credit_id": "52fe46e19251416c75086961",
               "name": "Jane Seymour",
               "profile_path": "/tBWYbLSieHshqVhy1EXlv12mBjs.jpg",
               "id": 10223,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "William Fawcett Robinson",
               "gender": 2,
               "credit_id": "52fe46e19251416c7508697d",
               "name": "Christopher Plummer",
               "profile_path": "/fauMGxa6dc86nHNenQ8X6DlE6YV.jpg",
               "id": 290,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Laura Roberts",
               "gender": 1,
               "credit_id": "52fe46e19251416c75086981",
               "name": "Teresa Wright",
               "profile_path": "/1J7IOy7S8krsTK22agsFLm2dYXU.jpg",
               "id": 7663,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Arthur Biehl",
               "gender": 2,
               "credit_id": "52fe46e19251416c75086985",
               "name": "Bill Erwin",
               "profile_path": "/b0O9XSBfgWh2CBhV2gHKvPGpOS.jpg",
               "id": 26044,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Dr. Gerald Finney",
               "gender": 2,
               "credit_id": "583387e0c3a3683387000d79",
               "name": "George Voskovec",
               "profile_path": "/5whdVXSJTKgwztARJsspJdDufgm.jpg",
               "id": 5254,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Older Elise",
               "gender": 1,
               "credit_id": "583387f59251412742000e9e",
               "name": "Susan French",
               "profile_path": "/zOdoHSIBGGnyYh1YLVJKVa5qYo5.jpg",
               "id": 16200,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Arthur's Father",
               "gender": 2,
               "credit_id": "58338813925141272d000e4b",
               "name": "John Alvin",
               "profile_path": "/2CSAGmnWFTRwK6jmY2wjSdHmnJl.jpg",
               "id": 113704,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Genevieve",
               "gender": 0,
               "credit_id": "5833882b9251412739000f58",
               "name": "Eddra Gale",
               "profile_path": null,
               "id": 5687,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Richard's Date",
               "gender": 0,
               "credit_id": "5833883ac3a36833a2000dd4",
               "name": "Audrey Bennett",
               "profile_path": null,
               "id": 1712328,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Critic (as W.H. Macy)",
               "gender": 2,
               "credit_id": "5833885b9251412739000f94",
               "name": "William H. Macy",
               "profile_path": "/cYmHYCGxkOVZgu2oDyhF6lKgfaj.jpg",
               "id": 3905,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Critic",
               "gender": 0,
               "credit_id": "5833894cc3a3683395000f3f",
               "name": "Laurence Coven",
               "profile_path": null,
               "id": 1712329,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Penelope",
               "gender": 0,
               "credit_id": "58338961c3a368338d000ebf",
               "name": "Susan Bugg",
               "profile_path": null,
               "id": 1712330,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e19251416c75086967",
               "name": "Jeannot Szwarc",
               "profile_path": "/mIW7mgLr83qyGovTWAigrPX66v3.jpg",
               "id": 16187,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e19251416c7508696d",
               "name": "Richard Matheson",
               "profile_path": "/qpcAG1Rpic5EWY8LMPN3e1R6TKs.jpg",
               "id": 12415,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e19251416c75086973",
               "name": "Richard Matheson",
               "profile_path": "/qpcAG1Rpic5EWY8LMPN3e1R6TKs.jpg",
               "id": 12415,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e19251416c7508698b",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "530dade7925141141e001f61",
               "name": "Isidore Mankofsky",
               "profile_path": "/gLrjaey4s0ZsQoVkVwNBxi5v8Ly.jpg",
               "id": 68459,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5833862cc3a368338d000c66",
               "name": "Jennifer Shull",
               "profile_path": null,
               "id": 8426,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "58338664c3a3683387000c60",
               "name": "Seymour Klate",
               "profile_path": null,
               "id": 1476027,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "583386719251412739000dc0",
               "name": "Jeff Gourson",
               "profile_path": null,
               "id": 12865,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5833867c925141273c000dc6",
               "name": "Mary Ann Biddle",
               "profile_path": null,
               "id": 1370939,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5833868ac3a3683399000d52",
               "name": "Jean-Pierre Dorléac",
               "profile_path": null,
               "id": 33847,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "583386e3925141272d000d2a",
               "name": "Ulla Bourne",
               "profile_path": null,
               "id": 1712326,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "583386fe9251412739000e3c",
               "name": "Melinda Wickman",
               "profile_path": null,
               "id": 1712327,
               "department": "Camera",
               "job": "Still Photographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.69313,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16633,
      "vote_count": 135,
      "budget": 5100000,
      "overview": "Young writer, Richard Collier is met on the opening night of his first play by an old lady who begs him to, \"Come back to me.\" Mystified, he tries to find out about her, and learns that she is a famous stage actress from the early 1900s. Becoming more and more obsessed with her, he manages – by self-hypnosis – to travel back in time where he meets her. They fall in love, a matching that is not appreciated by her manager. Can their love outlast the immense problems caused by their 'time\" difference, and can Richard remain in a time that is not his?",
      "similar": [
         206487,
         14337,
         23048,
         41154,
         24420,
         871,
         141,
         283366,
         59436,
         127585,
         433310,
         122906,
         7551,
         817,
         869,
         1954,
         196,
         1934,
         63,
         165
      ],
      "original_title": "Somewhere in Time",
      "runtime": 103,
      "poster_path": "/2ZCInnOBrGJzEPIYJkYWylvKdPz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Rastar Pictures",
         "id": 2070,
         "origin_country": ""
      }],
      "release_date": "1980-10-02",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Beyond fantasy. Beyond obsession. Beyond time itself... he will find her.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jeannot Szwarc"],
      "runtime": 103,
      "synopsis": "Celebrating the success of his first play, Richard Collier (Christopher Reeve) is approached by an elderly woman who presses an antique pocket watch into his hand and whispers, \"Come back to me.\" A few years later, during a period of writer's block, he sees a photograph in a hotel museum, and learns that this elderly woman was once a talented and lovely actress. Drawn mysteriously to the expression on the woman's face in the photograph, he turns to a former professor for insights on time travel. For he must find her, even if he has to go back to 1912 to do so. Self-hypnosis, and removing reminders of the modern present are the keys, and Collier eventually awakens the day before Elise McKenna's (Jane Seymore) August 1912 performance at the Grand Hotel. McKenna's manager, William Robinson (Christopher Plummer) is an obstacle. There are hints that he is clairvoyant, and he fears the man who will change McKenna's life. His attempts to separate the couple, however, backfire, causing his protogee to resent him. Elise and Richard press on, and are eventually able to declare their love for each other. A tiny forgotten object from 1980 pulls Richard away from his beloved, and all his attempts to re-hypnotise himself and return to 1912 fail. His grief overwhelms him, and he dies. On the \"other side,\" the young Elise is waiting to welcome him, and the lovers are reunited.",
      "writers": [
         "Richard Matheson",
         "Richard Matheson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081534/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3MTI4MzE3MV5BMl5BanBnXkFtZTcwOTMzNzAwMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Reeve, Jane Seymour, Christopher Plummer | See full cast and crew »"],
      "reviews": [
         "Christopher Reeve takes on the role of (Richard Collier) a successful Chicago playwright who is approached (in May 1972) by a very old woman (Susan French) who will alter the course of his life eternally... The thoughtful old lady presses a classic pocket watch, from a past existence, into his right hand and intensely whispers four haunting words 'Come back to me,' which will affect him forever... Eight years have passed and Richard is seeing his work incredibly sterile, gently afflicted with a case of lesser inspiration... So he packs his luggage and heads out to an island of enchanting beauty, to the Grand Hotel on the Straits of Mackinac waterfront... While waiting for the huge dining hall to open, he tours the grand old building's museum, and sees a portrait of a lovely woman... He becomes obsessed about finding the truth behind the old photograph and begins questioning the people that knew her past... What emerges is a wonderful woman who is the first American stage actress in 1912 to create a mystique in the public's eye... She is the same lady who visited him that night at the premier of one of his plays... Richard finds himself intrigued... There is so much to hear... People who knew Elise McKenna when she was young said that she was quick and bright and full of fun... Strong, willful, not at all the way she was later... Seeking help from an old philosophy teacher who had written a book about 'Travels through time,' Richard attempts to disassociate himself entirely from the present, move everything out of sight that could possibly remind him of it, hypnotize his mind, and transport himself backward into the past, into June 27, 1912, into the life of the stunningly beautiful and talented Elise McKenna (Jane Seymour). Nominated for Best Costume Design, the motion picture is a romantic fantasy that avoids any use of machinery in action... The time travel theory is completely non-scientific... The film captures the idea of a fine young man moving back among other time periods, and affirms that love is an undeniable force which goes beyond us, a force with no limit to the spiritual power, with no end to the potential of spiritual expansion...",
         "There are those few movies that make you sit back and just be amazed at the artistic excellence you've just seen. Citizen Kane, Casablanca, 2001: A Space Odyssey, Star Wars, The Godfather, Ben Hur, and The Lord of the Rings trilogy are a few of these. Somewhere In Time is not a blockbuster actioner, but is perhaps the finest fantasy love story ever made. The cast is perfect. Christopher Reeve is extremely believable. Jane Seymour is gorgeous as the young actress, as is Teresa Wright as her older self. Christopher Plummer is great as Elise McKenna's manager, and Bill Erwin affords himself fine as Arthur. The setting, music, story, and acting are all top notch! We are slowly drawn (and it's just great to take one's time to get involved) into this mysterious romance as the paradox pair of the watch and the time travel gets our hero to \"come back to me.\" Simply Superb! If you are one of the very few who has not seen this movie, please get it and watch it one time. I've seen it at least 10 times and enjoy it as much each time.",
         "Being one who always seems to enjoy time-travel stories, it's no wonder I like this movie so much, but it isn't the interesting \"time\" angle that draws me in: it's also the fact that this is one of the most touching love stories I've ever seen. I'm not usually a big fan of romance stories, but this one has always moved me, maybe because, as another reviewer points out, it's from the man's point of view. The film is a wonderful old-fashioned type of story with a really nice feel for the period (1912) and is simply a pleasant, leisurely-paced story I found comfortable. Would kids of today like this? No. Too slow for them. Too bad, because I found the movie moved pretty well. The 100 minutes went by quickly. Christopher Reeve is the star of the film but personally I found Jane Seymour and Christopher Plummer far more entertaining. The theme song, \"Somewhere In Time,\" is one of the prettiest songs ever and that adds to the sad and frustrating romance angle of the story. The language also is quite tame. Yes, it's a bit \"sappy\" at times, but for sentimental people, this is a nice film to keep. My only real complaint is I've never seen a sharp transfer put on a DVD yet. There have been two DVDs out and both have that grainy look to them. That's disappointing because this would really look nice with a clear picture. The film deserves better treatment. NOTE: A Blu-Ray of this film was released in March of 2014 and finally does this great film justice!",
         "I am a young man who grew up loving horror, action, and kung-fu movies. I hated the Victorian books we were forced to read in school. However, the one exception to the rule has been this movie. I LOVED this movie. The story line was solid. The direction was superb. And the acting was so good, that I have always wondered why Reeves & Seymour's career didn't catapult after this film. I have watched it many times since it came out, and ever time I am captivated. If you can't relate to this movie, I think you must have a heart of cold stone. This gets a strong KBONE rating of 10 on a scale of 1 to 10. Pay special attention to Seymour's soliloquy during the play and Reeve's facial expressions during that time as well Reeve during the last 10 minutes of the movie. I really can't say enough about this masterpiece.",
         "Somewhere in Time is a movie any sensitive person with a heart will love, I guarantee you. From the opening at the theater to the unbelievably moving final scene, I have never seen a film so passionately and yet so innocently depict the power of absolute, all-encompassing, unconditional love. The story is so simple, yet therein lies the beauty. Richard Collier, a man with no love in what otherwise seems like a nice enough life, becomes enchanted at the sight of Elise McKenna's painting and with only the power of his heart travels back to her time. Once there, he looks for Elise, and finds her. Elise is confused and does not immediately respond because of her manager W.F. Robinson, but she quickly returns Richard's love. I will not say anymore, other than that the ending made me feel so warm and yet made me want to cry. You will be hard pressed to find a movie lighter on plot, and there are many questions left unanswered, but that's perfect because Somewhere in Time is very surreal, and dreamlike even. The emphasis is not on watching events, but on simply feeling love, and this is as close as anyone has ever come to making a movie out of pure emotion. Jane Seymour looks radiant while on screen but this is Christopher Reeve's movie. Reeve, after amazing everyone with his talent, good looks, and charisma in one of the biggest blockbusters ever, could have become one of Hollywood's all-time great leading men. Instead, a series of horrible decisions about what roles to take and not take made it so that he had to do TV movies to pay the bills by the late 1980s. To this day, to 99% of the public he is the paralyzed Superman and nothing more. But this is the one movie that shows what should have been. He very convincingly depicts Richard first as goofy kid, then as empty older man, then as someone simply awestruck by love and determined to let nothing stop him from getting the breathtaking Elise. Then, in the final scenes, he portrays his anguish so remarkably it is wrenching to watch. Also deserving of special mention is Christopher Plummer, who seems to be an extraordinary actor on the basis of the two films I've seen him in (the other is The Insider). A lesser actor would have made Robinson into a mustache-twirling villain, and brought the whole production down to the level of a soap opera. Plummer, however, with his nuanced performance, makes us hate Robinson, but also makes us his feel his pain. Through his subtle mannerisms, we see that Robinson himself deeply longs for Elise's love, but has probably never been loved and never will be loved by anybody. We thus realize how incredibly lucky Richard is. I personally saw Robinson as perhaps someone whose father never loved him and whose mother died when he was very young, and he has spent his whole life wanting to truly take care of someone like Elise but it is as if he has been rendered incapable. He is still contemptible for the things he does to Richard, but he is also a tragic figure, and the script has nothing to do with that-it's all Christopher Plummer. John Barry's score is also among the most enchanting in movie history, in my opinion. I have never heard a score which so wonderfully conjured up feelings of timeless love. Jeannot Szwarc may not be a well known or otherwise accomplished director, but he does this one perfectly. This movie in the wrong hands could so easily come across as corny and trite, but instead it is such an absorbing masterpiece. Every element in this movie is just perfect, and it should be universally considered one of the greatest love stories of all time (if not the greatest, like I think it is). As it is most people have never heard of it, but it is nice to know that a small devoted following gives it the recognition it deserves. I hope it continues to win people's hearts for generations to come.",
         "One day i was going through my friend's movies and i was picking some of the really good ones to watch. His wife grabbed somewhere in time and told me that it was good. I was very unsure about the movie but i watched it anyways. By the end of the movie i was in awe. The acting is excellent. The story was creative. The dialogue was extravagant. The music was fantastic. The cinematography was terrific. This movie was awesome. Yes it is a romance movie for all you people who hate romance movies but if you have to watchan origina and entertaining love story then i recomend this one. Tust me guys it not your typical love story!",
         "Somewhere In Time is not only a fantasy story. It is romance, science fiction, and fantasy rolled into one, based on Richard Matheson's novel, Bid Time Return, (Matheson also wrote the screenplay and has a cameo appearance in the film). Shot in 1980 and released by Universal Studios, it is a wonderful and, I feel, classic film that has stood the test of time. I am often surprised at how many persons of adult age have seen it. I cannot understand why Somewhere In Time has been panned by the critics since its release. Filmed on location in Chicago and Mackinac Island, Michigan, Somewhere In Time is a little long at 104 minutes. However, the story never drags so this is not a big liability. Directed by Jean Szarc, the cast is first rate, starring Christopher Reeve, (what a standard of personal courage he has set for us in recent years!) as the playwright Richard Collier, Jane Seymour, one of the loveliest ladies to ever grace either the large or small screens, as the actress Elise McKenna, and the fine character actor Christopher Plummer as the mean-spirited W.S. Robinson, McKenna's agent. The story begins in May, 1972. Playwright Collier is visited by a very old woman at a party he is attending at Millfield College, close to the Grand Island Hotel on Mackinac Island, which will be so important to the story later. She approaches and hands him a pocket watch. Cryptically, she says, \"Come back to me.' We now fast forward eight years to Chicago, 1980. The restless Collier, who has recently broken up with his lady friend, is drawn to The Grand Hotel. Collier drives up to Mackinac Island and checks into the hotel. The kind-hearted Arthur, who has lived and worked at the hotel for 70 years, asks him if \"they had met before.\" Collier assures him they have not. Collier chances upon an old photo of the turn of the century actress Elise McKenna in the hotel museum and is mesmerized by her. Arthur tells him that she appeared in a play at the hotel in 1912. Collier's obsession quickly grows and he begins research on her life. He comes across a photo of McKenna as an old woman and remembers her as the mysterious lady he met at the party. He discovers from her housekeeper that McKenna died eight years previous, on the very night she made herself known to him, and that something happened during her hotel appearance in 1912. After that, according to the housekeeper, she was never the same. During his visit to McKenna's home, he discovers a book on time travel that Elise read \"again and again.\" After visiting with the book's author and, finding his own name in an old Grand Hotel register from 1912, Collier makes an intense effort to slip into the past, and succeeds. Soon, he meets Elise in the hotel, (he has transported himself to the time when Elise McKenna is staying in the hotel, preparing for her performance), and the scene where he and she meet is quite moving. At this point, the story becomes even better because Reeve does not have to carry it by himself. Seymour and Plummer step in and, what had been a good picture, becomes an excellent one for the duration. Richard and Elise quickly become drawn to each other, much to Robinson's unease. Robinson, who loves her but will not admit it, has a genuine concern when the playwright Richard Collier cannot name any of his work that he is familiar with. There is an unhealthy tension between these two strong-willed men until film's end. There are many interesting segments through this portion of the story. Entering the hotel restaurant, Collier seems to walk forever. The shot of the beautiful Elise, sitting at her makeup table with hair down and thrown over one shoulder, daydreaming of Richard, is enough to take the breath out of any man, (certainly this one!). The kiss first between Richard and Elise is very gentle and tender, and another lump forms in the throat when Elise again unpins her hair as Richard closes the door to room 117. But, perhaps the best scene in the entire film is when Elise, caught up with emotion, seems to ad-lib directly to an equally emotional Richard, sitting in the audience, during the hotel performance. Now is a good time to note that Jane Seymour possesses an interesting combination of hesitation and come-hither in look and demeanor. Ms. Seymour is something you do not come across often: an extremely alluring woman but very much a lady. The wholesome Reeve played off of her extremely well. The furious Robinson loses control of himself and has Richard beaten by thugs, causing him to lose credibility with his star forever. However, fate deals a cruel hand to the star-crossed lovers as, just when they have admitted their love for one another, Richard is abruptly returned to 1980, waking up in the same bed he was originally transported from. I won't give the story's very touching finale away, I will just say that the emotionally devastated Richard spends the final few minutes of the story attempting to return to 1912 and Elise. A few final comments. For fans of romance, fantasy and science fiction, Somewhere In Time will indeed be a special treat. (That the music is hauntingly beautiful only enhances the mood). It was pleasing to see Richard Matheson, author of such hard-edged tales as The Omega Man and The Shrinking Man, (to name but two), and who is seen as an astonished viewer during Elise McKenna's Grand Hotel performance, turn out such a powerful love story. I noticed only one glaring editing mistake, and that is an excellent accomplishment for a period story of this length. Near film's end, the heartbroken Richard lies listless and semi-comatose in a Grand Hotel guest room, pining for Elise, for a full week. When Arthur, (The gentleness of the lifelong hotel servant impressed me. I wish I could meet a few Arthur types at hotels I stay in!), finds him, the fact that he has had little food or water for days and is dangerously close to death is impressed upon us. However, when we see his face, he is clean-shaven and way too bright-eyed for a man under such a self-imposed ordeal! I hope that perhaps someday Christopher Reeve's health is such that he can once again co-star with the ever beautiful Jane Seymour. Mr. Reeve's physical limitations notwithstanding, I believe they would still make a terrific screen team.",
         "---\"Somewhere In Time\" is one of the most romantic films ever. It is also a wonderful period film. Shot at the Grand Hotel on Mackinaw Island, the 1800's hotel and grounds, the background of the Great Lake and lighthouse, just enhances the romantic atmosphere. It sure made me HAVE to visit the island and spend a magical day walking around, having lunch and visiting Jane Seymore's picture in the museum room, just like in the film. Have any two people ever been filmed so beautifully? The period dresses Jane wears are so lovely. And has a score, by John Barry, ever been more romantic? Perfectly enhances the romanticism of the story. Superman Christopher Reeve is all boyish charm and wonder; when he walks towards Jane by the lake and she says \"Are you the one?\" Well, it takes your breath they are so gorgeous. Any romantic can't help but have a lump in the throat at the lovely ending - white on white - no beginning and no end - they are together \"Somewhere In Time.\" 9/10",
         "This is one of those films I can watch again and again even though one knows the final outcome. I recently acquired the collector's edition on DVD and my only regret is that the picture quality is not up to scratch but there again, the film seems to have been shot anyway through a sort of haze to give it a certain atmosphere. I have always loved films that involve time travel ( there are all too few of them ) such as this one, Time after time, philadelphia experiment, Final Countdown etc. This one is unique as that it all takes place in Collier's mind and not due to some fantastic machine due to whip across the space-time continuum. The fact that Collier is brought back to reality due to the sight of a present-day object is - though frustrating and heart searing for the spectator - a good one and a way of closing the film. For those of you who love this film as myself, I would recommend the DVD collectors edition as there are long interviews with Jeannot Swarc, Christopher Reed et alia. During the interviews, Reed explains that following his terrible accident, he was given a drug which caused his \" soul to start leaving his body \" and he explains that at the time he immediately thought of this film !! Incredible.",
         "In 1984, this movie got a second life on cable after its initial release to theaters and subsequent bombing at the box office in 1980. We should all be thankful for cable! This is a classic film in every respect...well directed and acted.... but would it have had the same impact without John Berry's absolutely beautiful score? At any rate, it is a classic film and enjoys an enormous cult following as well as an annual gathering at the Hotel where many of the actors have come to participate. \"God bless you Chris Reeves, rest in peace\""
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": ["Rastar Pictures"],
      "summaries": [
         "Young writer Richard Collier is met on the opening night of his first play by an old lady who begs him to \"Come back to me\". Mystified, he tries to find out about her, and learns that she is a famous stage actress from the early 1900s, Elise McKenna. Becoming more and more obsessed with her, he manages, by self hypnosis, to travel back in time where he meets her. They fall in love, a matching that is not appreciated by her manager. Can their love outlast the immense problems caused by their \"time\" difference? And can Richard remain in a time that is not his?",
         "The movie opens with college student Richard Collier gathering rave reviews for his new play. At the party, he comes face to face with an old woman who presses something in his hand and whispers, \"Come back to me.\" He opens his hand to find an old pocket watch. Cut to several years later. Playwright Collier is in the midst of a break-up and writers block. He leaves the city for awhile to think things out and finds himself near his alma mater at the Grand Hotel. While wandering around the hotel, he finds a photograph of a beautiful young woman. Richard is entranced, and tries to find out all he can about her. During the course of his research he learns she was Elise McKenna, an actress from the turn of the century. He also discovers that she was the mysterious old woman who gave him the watch. Finally determining that he must meet her somehow, he employees self-hypnosis and wills himself back to 1912. He meets Elise and they fall in love, which does not make her manager, William Fawcett Robinson, happy at all. Will their love survive Robinson's disapproval? Will Richard be able to stay in 1912?",
         "A Chicago playwright uses self-hypnosis to find the actress whose vintage portrait hangs in a grand hotel."
      ],
      "budget": 5100000
   },
   "movielensId": 1286,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-10-02",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Jeannot Szwarc"],
      "runtime": 103,
      "movieId": 1286,
      "title": "Somewhere in Time",
      "mpaa": "PG",
      "actors": [
         "Christopher Reeve",
         "Jane Seymour",
         "Christopher Plummer",
         "Teresa Wright",
         "Bill Erwin",
         "George Voskovec",
         "Susan French",
         "John Alvin",
         "Eddra Gale",
         "Audrey Bennett",
         "William H. Macy",
         "Laurence Coven",
         "Susan Bugg"
      ],
      "imdbMovieId": "0081534",
      "originalTitle": "Somewhere in Time",
      "genres": [
         "Science Fiction",
         "Drama",
         "Fantasy",
         "Romance"
      ],
      "youtubeTrailerIds": ["9uicvPZSKIM"],
      "plotSummary": "Young writer, Richard Collier is met on the opening night of his first play by an old lady who begs him to, \"Come back to me.\" Mystified, he tries to find out about her, and learns that she is a famous stage actress from the early 1900s. Becoming more and more obsessed with her, he manages – by self-hypnosis – to travel back in time where he meets her. They fall in love, a matching that is not appreciated by her manager. Can their love outlast the immense problems caused by their 'time\" difference, and can Richard remain in a time that is not his?",
      "tmdbMovieId": 16633,
      "avgRating": 3.56732,
      "releaseYear": "1980",
      "numRatings": 2332,
      "posterPath": "/2ZCInnOBrGJzEPIYJkYWylvKdPz.jpg"
   }
}