{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "technology",
            "id": 1576
         },
         {
            "name": "civilization",
            "id": 2163
         },
         {
            "name": "human vs nature",
            "id": 2763
         },
         {
            "name": "living together",
            "id": 3676
         },
         {
            "name": "rural setting",
            "id": 11004
         },
         {
            "name": "social commentary",
            "id": 11479
         },
         {
            "name": "nature",
            "id": 18330
         },
         {
            "name": "environment",
            "id": 33577
         },
         {
            "name": "no dialogue",
            "id": 156596
         },
         {
            "name": "lost civilization",
            "id": 197052
         }
      ],
      "imdb_id": "tt0085809",
      "video": false,
      "title": "Koyaanisqatsi",
      "recommendations": [
         21925,
         24348,
         14002,
         26317,
         43878,
         5991,
         42112,
         216,
         58129,
         25237,
         39266,
         980,
         3059,
         777,
         833,
         198,
         662,
         18493,
         3063,
         89708
      ],
      "backdrop_path": "/yTE8fOjmGmF8sRuurMb2aoGYmHh.jpg",
      "revenue": 1723872,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Himself (uncredited)",
               "gender": 0,
               "credit_id": "52fe44249251416c7502a383",
               "name": "Lou Dobbs",
               "profile_path": null,
               "id": 104598,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Himself (archive footage) (uncredited)",
               "gender": 0,
               "credit_id": "52fe44249251416c7502a387",
               "name": "Ted Koppel",
               "profile_path": null,
               "id": 1192360,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44249251416c7502a35b",
               "name": "Godfrey Reggio",
               "profile_path": "/j4Q3OIg2NFLj3ziZ9MfMg3DBnDm.jpg",
               "id": 68993,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44249251416c7502a361",
               "name": "Ron Fricke",
               "profile_path": "/8oQUhdKZV7uT53s0XRTCraFgntv.jpg",
               "id": 68994,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44249251416c7502a367",
               "name": "Ron Fricke",
               "profile_path": "/8oQUhdKZV7uT53s0XRTCraFgntv.jpg",
               "id": 68994,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44249251416c7502a36d",
               "name": "Philip Glass",
               "profile_path": "/5xhnji5hjwJHbWer6nwjFdM9GAB.jpg",
               "id": 1551,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44249251416c7502a373",
               "name": "Ron Fricke",
               "profile_path": "/8oQUhdKZV7uT53s0XRTCraFgntv.jpg",
               "id": 68994,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44249251416c7502a379",
               "name": "Godfrey Reggio",
               "profile_path": "/j4Q3OIg2NFLj3ziZ9MfMg3DBnDm.jpg",
               "id": 68993,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44249251416c7502a37f",
               "name": "Francis Ford Coppola",
               "profile_path": "/vEGwqahu7UlI6OwELy92xbXk9Kd.jpg",
               "id": 1776,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "599f18be9251410e0c001f45",
               "name": "Godfrey Reggio",
               "profile_path": "/j4Q3OIg2NFLj3ziZ9MfMg3DBnDm.jpg",
               "id": 68993,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "599f18c69251410e62001efb",
               "name": "Michael Hoenig",
               "profile_path": null,
               "id": 52953,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "599f18d1c3a3683ee4001fe3",
               "name": "Alton Walpole",
               "profile_path": null,
               "id": 1018091,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "599f18ee9251410e5b001d62",
               "name": "Alton Walpole",
               "profile_path": null,
               "id": 1018091,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "599f190c9251410e0c001f9c",
               "name": "Steve Maslow",
               "profile_path": null,
               "id": 928942,
               "department": "Sound",
               "job": "Sound Mixer"
            },
            {
               "gender": 2,
               "credit_id": "599f191fc3a3683f25001ced",
               "name": "Randy Thom",
               "profile_path": "/gENCvbLHHHtxeZcPJIHcSq6Y4BW.jpg",
               "id": 42267,
               "department": "Sound",
               "job": "Sound Effects"
            },
            {
               "gender": 2,
               "credit_id": "59ac48d4c3a3682c620327fd",
               "name": "Philip Glass",
               "profile_path": "/5xhnji5hjwJHbWer6nwjFdM9GAB.jpg",
               "id": 1551,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 8.781452,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11314,
      "vote_count": 192,
      "budget": 0,
      "overview": "Takes us to locations all around the US and shows us the heavy toll that modern technology is having on humans and the earth. The visual tone poem contains neither dialogue nor a vocalized narration: its tone is set by the juxtaposition of images and the exceptional music by Philip Glass.",
      "similar": [
         1781,
         14211,
         11120,
         124075,
         183392,
         83539,
         977,
         29440,
         18274,
         22716,
         285176,
         21742,
         79172,
         419402,
         256362,
         277797,
         206671,
         187241,
         301301,
         8093
      ],
      "original_title": "Koyaanisqatsi",
      "runtime": 87,
      "poster_path": "/hxL6Obbbbh9KPvGpXX7F1Oc9Fft.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "IRE Productions",
            "id": 16644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Santa Fe Institute for Regional Education",
            "id": 16645,
            "origin_country": ""
         }
      ],
      "release_date": "1982-04-28",
      "vote_average": 7.8,
      "belongs_to_collection": {
         "backdrop_path": "/2pRLc3z0jE1WkFJLCZyITtYjo08.jpg",
         "name": "Qatsi Collection",
         "id": 173344,
         "poster_path": "/AlE6QJc87zH5vYw6AI779ywRZG6.jpg"
      },
      "tagline": "Until now, you've never really seen the world you live in.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Godfrey Reggio"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Ron Fricke",
         "Michael Hoenig"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0085809/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzkyMjIyNDgzNV5BMl5BanBnXkFtZTcwMzA5ODg0NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lou Dobbs, Ted Koppel | See full cast and crew »"],
      "reviews": [
         "Godfrey Reggio's Koyaanisqatsi (1983) is a film with no actors, no storyline, and no dialogue. The only things we see during the experimental documentary's 87 minutes are natural landscapes, images of cities, and real people going about their regular lives. Yet from the very beginning, when we see the title of the film appear in blood-red characters and hear the voice of a bass soloist chanting the title like an incantation, it is difficult not to be swept away in captivation. Filmed between 1977 and 1982, Reggio's film was noticed by directing great Francis Ford Coppola who eventually agreed to finance the project and give it chances for distribution. Minimalist composer Philip Glass was optioned to compose the score, and the result was, quite simply, astounding. Koyaanisqatsi is a collection of familiar images presented through tinted lenses (figuratively speaking). The experimental nature of the project can be seen in the reduced and augmented speeds of images, the use of carefully manipulated edits, and the use of Glass's score to create ambience. There are times when the film exhibits an almost surreal quality more indicative of a twisted, futuristic, dystopian sci-fi epic than of our mundane world. This is, however, what makes Koyaanisqatsi so successful. In presenting our world in a disquieting, unflattering light, the film forces us to ruminate on our place in the universe and the consequences of many of our actions. The film starts with serene, austere images of mountains, oceans, and forests, and the repetitiveness of Glass's score does not bore us nor call attention to itself, but simply washes over us, entrancing us and instilling a sense of tranquility. It is not long before the untainted images are replaced by nuclear power plants, highways, skyscrapers, rubble, fire and ash, and hoards of ant-like beings (humans, of course) scurrying through modern urbanity. Most times, humans are filmed at low-frame settings (making for faster speeds), and as a result, they seem frenzied, compulsively making their way through the cities in a manner that seems more conditioned than voluntary. Glass's score responds by heightening its tension and adding a semi-brutal nature to its repetitiveness. It is somewhat aversive, but at the same time exhibits a humorous and mocking quality. By cramming together so many images of humans behaving more like lab rats than higher, thinking beings and increasing the satirical nature of the score, the film invites us to consider just how depersonalized, mechanized, and out-of-control many aspects of our life are. The conclusion of the film contrasts against the blackly comic nature of the previous section by instilling a sense of mourning and warning. As such, there is undoubtedly a political and environmental component inherent in this film, but this is the aspect that is, in my mind, most often misunderstood. Many critics (mostly detractors) have interpreted Koyaanisqatsi as a call to action, an invective that demands that we atone for the rape-like pillaging the human race has thrusted upon the natural environment. Following from this, these critics claim that the film's message is that we would enjoy the planet more if we were not here at all, thus presenting a contradiction, since we would not be here to enjoy it. In my own personal view, the flaw here resides in viewing the film as a tirade and a call to action. I find Koyaanisqatsi very clearly to be not a cry for reform, but a demand for awareness and meditation. There is an inevitability in the actions of human beings and their disregard for the care of their surroundings, and the wonderful thing about this film is that it forces you to experience the consequences and at least take notice of what each of us is contributing. It does not let you get away with indifference and nonchalance. For me, however, the political component is less important than the stylistic component, which is one near and dear to my heart: the use of music to enhance the forcefulness of images. I acknowledge the fact that some will not be able to stand the repetitiveness of Philip Glass's score (and it is very repetitive at some points). But if one can consider the motive behind the repetition, the music ceases to be oppressive and becomes sublime and entrancing. The score adds impact to an already stunning array of unforgettable images, the details of which I will not go into, so that one may see the film with fresh eyes. I saw Koyaanisqatsi for the first time at a performance in which the visuals were projected onto a giant screen with the soundtrack being supplied by Glass and his ensemble, who had come for a live performance. I had barely made it in time, since I struggled to find a parking space and was drenched from running in the rain. The moment the film started, however, all of the accumulated tensions in my body completely dissipated. It was not at all a cerebral experience, but an instinctive one in which I enjoyed the images and sounds for their own sakes. When I left the performance, I was in a hypnotic daze, transfixed by what I had just seen. My initial impressions haven't changed to this day. I loved this film, and while the political and environmental concerns it addresses are important, what really makes this film for me is the instinctive, visceral power of its images and sounds. Koyaanisqatsi maroons its audience in an alternate version of reality that sheds disturbing light on our lives, and yet at the same time, it produces an unforgettable cinematic experience that is pervasively engrossing.",
         "Make no mistake -- you need to get into the right mood to properly enjoy this film. Try watching it with your cynical or populist friends and they'll pour scorn upon it. Don't try to convince others to 'get it' as they won't. The best thing to do is to turn off all of the lights, pump up the sound and absorb yourself in the spectacle that unfolds on the screen. If you do this, you'll experience one of the most breathtaking, moving and exciting pieces of art ever. There are few films that reach these heights -- 2001: A Space Odyssey is the only one that instantly comes to mind. Don't analyse it until it's finished. Talking through it will ruin it. I've found that the film works best on an emotional level so switch your brain off and just watch and listen. By the time it's finished, you'll feel like you've been on an exhausting and exhilarating journey that you'll want to take again not long afterwards.",
         "A welcome assault on the senses, 'Koyaanisqatsi' is not for the impatient or nervous. You have to give it time because it is slightly dull in the very beginning, as the music and landscapes are fairly ordinary. Once it gets going, its really fascinating. Some gorgeous images, none generated by a computer I might add, and a soundtrack to match the intensity makes this a unique movie experience. I saw it on the big screen when it was first released, and it was MUCH better than on my not-that-big television. One of the things I also like about this movie is the fact that since there is no dialogue, it can be shown in any country in the world unchanged. We would all see it the exact same way. I like the idea of that very much.",
         "Godfrey Reggio's magnificent documentary \"Koyaanitsqatsi\" was an amazing experience when it first came out more than twenty years ago. Watching for a second time, this time in DVD format, one realizes how this movie makes the case that it must be seen in the big screen in order to get all the brilliant cinematography in its proper perspective. Even watching it in a 32 plasma screen, one realizes it pales in comparison when projected on a larger movie theater screen. The images that are presented in the film are just beyond belief. The fantastic music score by that genius, Phillip Glass, compliments and enhances our experience. This film will live forever in spite of some of the comments submitted to this forum, because it deals with universal themes that will stay with us on this planet while human life will exist. This was pioneer movie making that later on became main stream. The originality being in the way the director presents the different sections in the film with some unusual photography that, while imitated, remains the standard for comparison with any new so called latest technique and innovation. Kudos to Mr. Reggio, Mr. Glass and the people behind this gorgeous film.",
         "Koyaanisqatis is an extremely unusual film, and by far one of the most unusual I have ever seen. It takes on the daunting task of portraying the history of the world until modern times (or the early 80s, at least) entirely without dialogue. It is a documentary of sorts, in that it is amazingly informative, but it is filmed like a Hollywood film. Expertly framed shots and flawlessly smooth camera movement and shot composition. There is an unbelievable amount of talent behind this film, both in the fascinating images that are presented and the mesmerizing score by Philip Glass. It is a very slow moving film, but it manages to keep your attention because, in many cases, it is just so interesting to see the things that are portrayed and the way that they are shown. This is the only film, for example, where you can see a shot of a 737 approaches directly toward the camera over a hot runway in a shot that is possibly over a minute long with no movement other than the sluggish lumbering of the massive plain. Godfrey Reggio takes Glass's score and places images over it that add to the sound and create an experience that is far greater than, as they say, the sum of its parts. The shots contain camera movement or lack movement, are sped up or slowed down, and have live sound or no live sound depending on the desired effect, and the end result is absolutely hypnotic. This is a wonderful cinematic experience for people of all ages, and possibly my favorite thing about this film and it's successors is that, because they have no dialogue, they can be shown in any country in the world and not have to worry about subtitles or even altered meanings. This is a film for humanity.",
         "\"It is up for the viewer to take for herself what Koyanisqaatsi means. For some people it's an environmental film, for some people it's an ode to technology, for some people it's a piece of sh-t, for other people it moves them deeply. It depends on who you ask\" - Godfrey Reggio So, Koyanisqaatsi. Boring junk to some, an involving masterpiece to others, and God knows what other adjective-noun combinations are out there (you can probably guess my opinion from the rating above). Most of these descriptions are fairly subjective, but it would definitely be wrong to regard Koyanisqaatsi as anti-cinema. It is anything but. Cinema, in its purest form, is a marriage of sound and visuals; everything else is just decoration. Dialogue? Storyline? Koyanisqaatsi harks back to an age when cinema was simply a filmed record of a situation. Was it not the Lumiere brothers who are generally regarded as the first pioneers of cinema? And is it not the case that their films comprised of nothing more than situations like a couple feeding their baby, workers leaving a factory, or the (in)famous Train Leaving A Station, which went down in folklore as causing people to flee the auditorium in panic thinking they were about to be hit by a train as it approached them on-screen? Koyanisqaatsi is cinema returning to its roots, to the days when the possibilities for film as an art form were wide open, free of commercial constraints and fickle audiences too narrow in scope to accept anything other than what they view as the given norm. In a way it's fairly irrelevant what Koyanasqaatsi meant to me on a personal level, though I might get to that later. What's important is what Koyanasqaatsi represents. It's an interesting attempt (and a successful one in my view) to illustrate how a narrative can be created simply by editing together seemingly loosely related scenes and images. It reminds me of another cinematic milestone, the Kuleshov experiment, in which two separate images where edited together to create a third meaning, and which helped establish what is now known as Russian montage (and speaking of the Russian montage tradition, anyone who has seen Vertov's The Man With The Movie Camera will no doubt find traces of it in Koyanisqaatsi and vice versa). Koyanisqaatsi takes it one step further, perhaps even to its logical conclusion, using editing to create a new meaning for the entire narrative as a whole. It works on a gut level and sparks an emotional response, in a way it demands a response, be it boredom, amazement... it really depends on the person (as illustrated by the Reggio quote above). As such it's an example of cinema at its most subjective. Coming back to the influence Man With A Movie Camera no doubt had on this film, I think what Godfrey Reggio has done here is take this specific style of film-making and turn it into what I, personally, view as a cinematic statement on humanity- and our technology's relationship with the environment around us. It's a pessimistic film, filled with Cold War anxiety (though it hasn't lost any of its relevance) - and in retrospect, I also found it reminiscent of an age when America still had a strong avantgarde movement in the shape of people like Reggio or Laurie Anderson (and in a way it's an interesting coincidence that 1983 also gave birth to another experimental documentary, Chris Marker's Sans Soleil, which is equally rich in scope and tackles the same philosophical issues, albeit from a slightly different angle). I really wonder if the western world could produce a film like this today, in an age where cinema audiences are more fickle than ever, demanding a cut every three seconds and some sort of \"surprise twist\" at the end, with hardly a niche left for the Godrey Reggios of this world. But in a way I suppose it doesn't really matter. Koyanisqaatsi, to me at least, is one of the richest cinematic experiences anyone could possibly hope to have, and I doubt I'll see a film which will move me quite like this for a long time to come.",
         "This is a stunningly beautiful movie. The music by Phillip Glass is just a work of pure genius. I can watch this movie again and again. The final sequence of the Hobi legend's judgment where the container falls from the sky is just unbelievable. How was it filmed? It's so amazing. If you have not seen this film watch it - again and again! This must be the only movie which in a powerful way, far better than, say, \"Apocalypse Now\", sums up why our current \"civilization\" might be heading for destruction. Moreover, \"Koyaanisquatsi\" \"defamiliarizes\" the world and humanity allowing the viewer to benefit from a \"verfremdung\" viewpoint. In other words, we learn so much about our own life and life in general by watching it from this entirely new viewpoint of \"Koyannisqautsi\", where fast motion is used extensively. What is mankind about? Why are we moving so fast? Towards what goal? What is nature? What is the driving force of nature? What is the pulse of the earth? What is our relation with ourselves, nature and other people and animals? Moreover, I think this movie is better than the sequel \"Powaquatsi\". Anyway, I cannot emphasize enough how brilliant \"Koyaanisqatsi\" is. Watch it! Watch it! Watch it!",
         "This film communicates to you from the realm beyond words. If you want to muck up the purity of the experience by letting the infernal adjective machine stamp out labels and reactive prose poems through its 80 some minutes and afterward, you may not have been the ideal candidate to see this film. It begins with Russian Orthodox style basso profundo voices enunciating the title over images of petroglyphs, and then begins its journey: From the places beyond things, rock and sky, to the things we have girded ourselves in, cities. It is a wordless, feeling thing. Ten stars. Pity it wasn't an IMAX.",
         "KOYAANISQATSI remains a profound statement over twenty years after its original release. the point then is the point now. one of the great things about this film is that while the intrusion of man is initially presented as profane and abhorrent, ultimately there is found a symmetry to the human experience that is as organic as anything found in the `natural' world. i used to be tempted to perceive humans as the only species on the plant that didn't fit, that threw everything out of balance, as it were. but over time it has become apparent that even the blight of man on earth is a naturally occurring phenomenon. the evolution of life is the destruction of life. the circle is unbroken.",
         "This movie has no script, just visions and music. It is very nice to watch. The photography is amazing. This, along with the music, make it a very surreal experience to watch. I bought the DVD and just love it. The music is terrific and the commentary in the special features section is just out of this world."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "IRE Productions",
         "Santa Fe Institute for Regional Education"
      ],
      "summaries": [
         "This documentary looks at the world and more specifically the effect man has had on the landscape and the environment. Without narration, the film shows the world in a pristine condition and untouched: blue skies, beautiful landscapes and endless vistas. The man-made world is much less appealing. Essentially a montage using a variety of film techniques to provide a visually stunning montage of images.",
         "Koyaanisqatsi is a documentary (of sorts). It is also a visual concert of images set to the haunting music of 'Phillip Glass'. While there is no plot in the traditional sense, there is a definate scenario. The film opens on ancient native American cave drawings, while the soundtrack chants \"Koyaanisqatsi\" which is a Hopi indian term for \"life out of balance\". The film uses extensive time lapse photography (which speeds images up) and slow motion photography to make comparisons between different types of physical motion. In one of the first examples, we see cloud formations moving (sped up) intercut with a montage of ocean waves (slowed down) and in such a way we are able to see the similarities of movement between these natural forces. This technique of comparison exists throughout the film, and through it we learn more about the world around us. The film progresses from purely natural environments to nature as affected by man, and finally to man's own manmade environment, devoid of nature yet still following the patterns of natural flow as depicted in the beginning of the film, yet in chaos and disarray. Through this the film conveys its key message, which is Koyaanisqatsi: life out of balance; crazy life; life in turmoil; life disintegrating; a state of life that calls for another way of living.",
         "This movie was designed to have no plot. Meaning is to be created by the viewer, and only the viewer can give value to the images and music. That said, there is a central idea behind the movie, and according to the director it is this: The greatest event in the history of mankind has occurred recently, and has been largely missed by both the media and academia. Beyond the headlines and every day crises of international events, a deeper shift in human affairs has occurred: Humanity no longer exists in the natural world, we are no longer connected to it. It is not that we are now users of technology, but rather that we exist within technology, we are part of it and it is part of us. The natural world now exists only to support the artificial one in which we live.",
         "A collection of expertly photographed phenomena with no conventional plot. The footage focuses on nature, humanity and the relationship between them."
      ],
      "budget": 0
   },
   "movielensId": 1289,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-06-06",
      "dvdReleaseDate": "2002-09-17",
      "directors": ["Godfrey Reggio"],
      "runtime": 87,
      "movieId": 1289,
      "title": "Koyaanisqatsi",
      "mpaa": "NR",
      "actors": [
         "Lou Dobbs",
         "Ted Koppel"
      ],
      "imdbMovieId": "0085809",
      "originalTitle": "Koyaanisqatsi",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["1jM2WA2WbDc"],
      "plotSummary": "Takes us to locations all around the US and shows us the heavy toll that modern technology is having on humans and the earth. The visual tone poem contains neither dialogue nor a vocalized narration: its tone is set by the juxtaposition of images and the exceptional music by Philip Glass.",
      "tmdbMovieId": 11314,
      "avgRating": 3.94521,
      "releaseYear": "1982",
      "numRatings": 3194,
      "posterPath": "/hxL6Obbbbh9KPvGpXX7F1Oc9Fft.jpg"
   }
}