{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "teen movie",
            "id": 11870
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "tomboy",
            "id": 156928
         },
         {
            "name": "female drummer",
            "id": 207970
         }
      ],
      "imdb_id": "tt0094006",
      "video": false,
      "title": "Some Kind of Wonderful",
      "recommendations": [
         12714,
         11522,
         14370,
         8428,
         24548,
         27590,
         12919,
         17362,
         11557,
         2028,
         16620,
         18282,
         26255,
         13105,
         20242,
         11718,
         47045,
         13346,
         40156,
         29355
      ],
      "backdrop_path": "/k7EhJms7VoWvyCLVW3Tbs0BYJgW.jpg",
      "revenue": 18553948,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Keith Nelson",
               "gender": 2,
               "credit_id": "52fe463d9251416c75071e5b",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Watts",
               "gender": 1,
               "credit_id": "52fe463d9251416c75071e5f",
               "name": "Mary Stuart Masterson",
               "profile_path": "/jQLmmJWumj0MsxE2DjvMHbf5ysz.jpg",
               "id": 31140,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Amanda Jones",
               "gender": 1,
               "credit_id": "52fe463d9251416c75071e63",
               "name": "Lea Thompson",
               "profile_path": "/gaZhgJdLmWkEdqkkfomnBQn16uo.jpg",
               "id": 1063,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mia",
               "gender": 1,
               "credit_id": "52fe463d9251416c75071e67",
               "name": "Chynna Phillips",
               "profile_path": "/yTPav5Tnm0JNTzQOmZMyBaMbY9M.jpg",
               "id": 77940,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Hardy Jenns",
               "gender": 2,
               "credit_id": "52fe463d9251416c75071e77",
               "name": "Craig Sheffer",
               "profile_path": "/q2y5cm3RoCsztmuLqJie4cOrLBH.jpg",
               "id": 4138,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Cliff Nelson",
               "gender": 2,
               "credit_id": "52fe463d9251416c75071e7b",
               "name": "John Ashton",
               "profile_path": "/omfIdOt1F8LDkb7AMZTtLDiyJ3O.jpg",
               "id": 778,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Skinhead",
               "gender": 2,
               "credit_id": "52fe463d9251416c75071e7f",
               "name": "Elias Koteas",
               "profile_path": "/11pXICpcdGJxGG8H8g1Bk3qc66V.jpg",
               "id": 13550,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Laura Nelson",
               "gender": 1,
               "credit_id": "52fe463d9251416c75071e83",
               "name": "Maddie Corman",
               "profile_path": "/358wSv3l3FPhNTcpcalQvRVXQB4.jpg",
               "id": 121757,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Shayne",
               "gender": 1,
               "credit_id": "57dc83a59251414a15001c64",
               "name": "Molly Hagan",
               "profile_path": "/xfqpbt6U5dROCbhX31IwfNUqsUq.jpg",
               "id": 58045,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe463d9251416c75071e6d",
               "name": "Howard Deutch",
               "profile_path": "/68Vae1HkU1NxQZ6KEmuxIpno7c9.jpg",
               "id": 26502,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59401565c3a36851f8004b9b",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56c127f7c3a36817ef00d838",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56c12814c3a36817fd00d009",
               "name": "Michael Chinich",
               "profile_path": null,
               "id": 7185,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56c12822c3a36817ef00d83f",
               "name": "Ronald Colby",
               "profile_path": null,
               "id": 63714,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "59401551c3a36851c4004ddd",
               "name": "Jan Kiesser",
               "profile_path": null,
               "id": 43529,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5940157dc3a368517f0052d1",
               "name": "Bud S. Smith",
               "profile_path": null,
               "id": 23914,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "594015a8c3a368040a0100b3",
               "name": "M. Scott Smith",
               "profile_path": null,
               "id": 23926,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "594015be92514105f7002ead",
               "name": "Judith Weiner",
               "profile_path": null,
               "id": 29708,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "594015cec3a36803b401195a",
               "name": "Josan F. Russo",
               "profile_path": null,
               "id": 1822892,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "594015ddc3a368149d002f1b",
               "name": "Marilyn Vance",
               "profile_path": "/tdNcz7CYAFFKoaYm4EvWec4z3gv.jpg",
               "id": 7719,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "594015e79251414aee011a7e",
               "name": "Linda Spheeris",
               "profile_path": null,
               "id": 39110,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "594015f2c3a36851f8004bfb",
               "name": "Gregory Pickrell",
               "profile_path": null,
               "id": 1394918,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "594015fe9251414afb011375",
               "name": "Pamela Alch",
               "profile_path": null,
               "id": 1344278,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "59401610c3a368040a0100fd",
               "name": "Joyce Rudolph",
               "profile_path": null,
               "id": 74992,
               "department": "Camera",
               "job": "Still Photographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.135291,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15143,
      "vote_count": 131,
      "budget": 0,
      "overview": "A young tomboy, Watts, finds her feelings for her best friend, Keith, run deeper than just friendship when he gets a date with the most popular girl in school.",
      "similar": [
         376660,
         272693,
         449176,
         13523,
         286565,
         121875,
         37735,
         8363,
         10625,
         4951,
         9655,
         40807,
         76726,
         85350,
         2108,
         10229,
         207,
         9880,
         1259,
         37725
      ],
      "original_title": "Some Kind of Wonderful",
      "runtime": 95,
      "poster_path": "/t5trXgQn0B6Un8JeGGWhwek95f6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hughes Entertainment",
            "id": 477,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1987-02-27",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Before they could stand together, they had to stand alone.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Howard Deutch"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["John Hughes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094006/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzM5ODExMjc5MV5BMl5BanBnXkFtZTgwODc3MjEyMDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Eric Stoltz, Mary Stuart Masterson, Lea Thompson | See full cast and crew »"],
      "reviews": [
         "It's refreshing to have a movie about teens in love that doesn't rely upon sex to gain the viewer's interest. I love this movie, have probably seen it a a few dozen times, especially in the original, unedited version (that wasn't shortened to fit into a two-hour TV time-slot). It's a classic story, but told from a timeless perspective---the movie first ran in 1987, yet there's extremely little in it that would make it seem \"dated.\" Mary Stuart Masterson is, as always, superb in her performance. While this is one of her early films, it shows her enormous ability and potential. She plays a playful, feisty, street-smart character that also has a sensitive, shy, and deeply loving side. Mary Stuart's kissing scene is one of the most wonderfully romantic and intense kissing scenes on film that I've seen, yet it has an innocent quality that makes it all the more special. Eric Stoltz and Lea Thompson give excellent performances as well, with good acting and both are able to highlight dialogue with subtle nuances. However, I feel that Mary Stuart's character is the most interesting and emotionally sensitive, enough that she'll bring tears to your eyes. This is an excellent film. It came out at a time when there were a lot of teen movies (Pretty in Pink, The Breakfast Club, etc.), but this is a story that never grows old and is a pleasure to watch again.",
         "Some Kind Of Wonderful tanked at the box office when it came out, but the truth is this sleeper hit was actually good. And I will even go far saying that this reverse Pretty In Pink is better than Pretty In Pink itself. Why? Good, honest performaces. Hughes decides to leave his Brat Packers behind and went with great choices in Eric Stoltz (who could've gave John Cusack a run for his money in the Teen Angst movie department), Lea Thompson and Mary Stewart Masterson, who steals the show as Watts. Sure the story is run of the mill, but it is the acting that pulls it through. Another good thing is that Thompson's character of Amanda Jones doesn't come off as being a snooty brat (for use of a better word). She is from the same part of town like Keith and tries to fit in with the 'cool' clique. Another good supporting performance is Duncan, the headbanger who is a regular in detention. I love how they forge a friendship through their art. And who can forget how Duncan and the lifers help Keith make his date with Amanda a success? One other thing I like is the soundtrack. It doesn't sound commerical like in other Hughes films. The music really suits every scenes it shows up in (especially the end credits that feature Lick The Tins take on 'Can't Help Falling In Love'). Molly Ringwald reportedly turned down a role in this film, but it's good that she did because I couldn't picture her in this classic. Great film.",
         "I know it's not as well known, but this film came together so well that it can't be denied. A great mix of comedy and teen melodrama, this film perfectly combined all the best elements of a John Hughes film. By switching the sexes- Eric Stoltz as Molly Ringwald, and Mary Stuart Masterson as Jon Cryer- of \"Pretty in Pink\", the film delves deeper than \"The Breakfast Club\"- almost accidentally. The chemistry between Stolz and Masterson is powerful and real, something missing in almost all John Hughes films, and it pays off. This one has stayed with me since it came out, and I've watched it since and it holds up really well. Great supporting actors like John Ashton and Elias Koteaus provide fun comedy breaks, and little Candace Cameron as the little sister is terrific too- she went on to great TV fame. But the strength of the film is the fine acting. Stoltz has the harder more thankless role, and gives it a depth and charm that are a relief to see, and Masterson all but steals the movie. Together they are John Hughes best couple, even though he didn't direct this film.",
         "I seen this film when it first came out and I was 15 years old... it always stuck with me. I guess because the story was a lot like my own life and I could really relate to Mary Stuart Masterson's character SO much. I was best friends with a boy in my class, we were both into music, theater and art and did'nt fit in with the \"popular-preppy\" kids in school and really did'nt fit in with the \"pot-head-troublemakers\" either. We just did'nt fit in anywhere.. but we always had one another and hung out all the time. I was totally in love with him (still am to this very day, he will always be a part of my life and in my heart)... well, he just did'nt have a clue that I cared about him in that way and all I ever heard was how much he \"loved\" one of the cheerleaders. She never gave him the time of day and he still had this \"thing\" for her... Our story was'nt as happy though, he never found out how I felt for him.. I got married to someone else later on and so did he and we have since lost touch and I have been looking for him. Guess the first time I seen this movie, I liked it just because it was SUCH a good movie but a few years later seeing it, it really hit me in the face and to this day I always watch it whenever I get the chance and remember my friend...",
         "As a twelve year old girl, I had a hard time finding role models. I lived on the outskirts of what was basically a country club neighborhood, but was not that kind of gal. So I found it wonderfully refreshing to find a role model in the pre-\"Girl-Power\" girl power of Watts. I fell in love along side her (and to this day, harbor a special place in my heart for Eric Stoltz), begged my parents to let me learn the drums, and knew every line by heart. She was tough, witty, and (according to my older brother) incredibly sexy. Eric Stoltz is dreamy in a working class kind of way and puts in a performance of true depth and character. This movie has heart without being sickly sweet. It delves into family relationships, friendships, and romance. Most notably, it tackles something that the current teen fair seems to lack, social consciousness. It's not afraid to break stereotypes or point out social injustice. Not to mention, it has one of the best soundtracks of the '80s. I give it an A++!!!",
         "This is the best of the eighties 'US High School/Teen Angst' movies. There were loads, but none to match this one. There's a character in here for each of you to associate with, be it the nerdy Keith, with the bossy younger sister and the unattainable crush, or Duncan, the kind-hearted skinhead. If you only ever watch two of these movies again, make them 'The Breakfast Club' and this one.",
         "Mary stuart Masterson plays a girl who has a crush on Eric Stoltz who has been friends with her for a long time but she never has told her feelings. When Stoltz starts hanging around with the rich crowd and falls for the snobby beauty queen Lea Thomson Masterson fears she may lose him. A well scripted comedy romance drama slice of life that John Hughes does right every now and then. on a scale of one to ten..8",
         "This movie makes my top 10 list. This movie tells the basic story \"things aren't always as they seem.\" This movie shows just how hard it is to open up yourself an let someone know how much you care and also stresses how sometimes one can be blind and not see love in front of their eyes. This is simply a great movie.",
         "This is one of those films which creeps up on you. On the surface, it is a romantic cliche, but it is extremely well done. The main characters, especially Watts (a very young Mary Stuart Masterson), turn in superb performances, and lift this way above the ordinary. Good comic-relief from the support cast - watch especially for the scenes with Keith's sister Laura, and the one between Watts and her admirer - which is a real hoot! For sheer romantic escapism, this film is close enough to perfect. And can be seen over and over. Enjoy.",
         "Some Kind of Wonderful is by far the best movie I have ever seen in my whole life! John Hughes has written yet another excellent story about a classical tale of teen romance. The first time I saw this movie was on t.v. at 2:00 in the morning. And I stayed up for every last minute of it. First of all, the cast is great. Howard Deutch pulled together some really remarkable actors and actresses for the roles of this movie. Lets start with Lea Thompson playing the popular girl, Amanda Jones. She did a fine job playing the poor girl who hangs out with all the rich kids. This role must of been really hard for her because she didn't look like a poor girl at all. I mean its Lea Thompson for christ sake! And in my opinion we have to give her alot of credit for having the guts to do this role. She came through with it and that is all that matters! Next is Craig Sheffer acting as the antagonist, Hardy Jenns. This guy did a pretty good job of acting as the rich, handsome, popular school boy who went out with Amanda Jones. In fact he did such a good job at acting his part that I wanted to punch the t.v. when I saw his face pop up on the screen. Hardy was a real a**hole! The shy kid Keith Nelson acted by Eric Stolz, definintley reminds me of myself. That is one of the reasons why this movie really inflicted a lot of trauma on me from the beginning. We are both shy, independent, nice guys. I also look alot like him too! Except I have green eyes! Kinda scary if you dont mind me saying. Anyway, Eric does a marvelous performance as the protagonist of this film. Good job man! Last but not least we have the beautifull,breathtaking,astonishing, Mary Stuart Masterson! This movie was the first time I saw her. And she took my breathe away!!!!! Playing the short blonde haired tomboy Watts, she has got some real talent. After I saw her in this movie,I knew I must see the rest of her movies she has been in. And I must say, she looks the best in this movie without a dout. Its just the fact that you can see that face of her's and see her smile. She definitley has the best smile I have ever seen in my entire life! And that is saying a lot for someone I don't even really know that well. Maybe sometime later in life I can meet her in person. I think we would do well together. No offense Damon. LOL! But in all the movies I have seen, Some Kind of Wonderful touches me from the heart and reminds me about life and all the hard times that come with it. This is a landmark movie that will never leave my shelf. Rating:10/10 stars"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Hughes Entertainment",
         "Paramount Pictures"
      ],
      "summaries": ["A young tomboy, Watts, finds her feelings for her best friend, Keith, run deeper than just friendship when he gets a date with the most popular girl in school. Unfortunately, the girl's old boyfriend, who is from the rich section of town, is unable to let go of her, and plans to get back at Keith."],
      "budget": 0
   },
   "movielensId": 1290,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-02-27",
      "dvdReleaseDate": "2002-08-20",
      "directors": ["Howard Deutch"],
      "runtime": 95,
      "movieId": 1290,
      "title": "Some Kind of Wonderful",
      "mpaa": "PG-13",
      "actors": [
         "Eric Stoltz",
         "Mary Stuart Masterson",
         "Lea Thompson",
         "Chynna Phillips",
         "Craig Sheffer",
         "John Ashton",
         "Elias Koteas",
         "Maddie Corman",
         "Molly Hagan"
      ],
      "imdbMovieId": "0094006",
      "originalTitle": "Some Kind of Wonderful",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["aNmP7z1Eemo"],
      "plotSummary": "A young tomboy, Watts, finds her feelings for her best friend, Keith, run deeper than just friendship when he gets a date with the most popular girl in school.",
      "tmdbMovieId": 15143,
      "avgRating": 3.54648,
      "releaseYear": "1987",
      "numRatings": 2582,
      "posterPath": "/t5trXgQn0B6Un8JeGGWhwek95f6.jpg"
   }
}