{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "washington d.c.",
            "id": 521
         },
         {
            "name": "usa president",
            "id": 840
         },
         {
            "name": "identity",
            "id": 1284
         },
         {
            "name": "policy and organisations",
            "id": 1474
         },
         {
            "name": "autism",
            "id": 1646
         },
         {
            "name": "impotence",
            "id": 2496
         },
         {
            "name": "botanist",
            "id": 4003
         }
      ],
      "imdb_id": "tt0078841",
      "video": false,
      "title": "Being There",
      "recommendations": [
         343,
         993,
         93,
         11898,
         10403,
         1480,
         198,
         678,
         396,
         3083,
         3090,
         821,
         1859,
         204,
         3063,
         592,
         596,
         16305,
         284,
         3116
      ],
      "backdrop_path": "/5I7C0bX6mKRC7Kj6hnNxz1ywvjQ.jpg",
      "revenue": 30177511,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chance",
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce67",
               "name": "Peter Sellers",
               "profile_path": "/sCVIv2DGoC9U16anTjLwMxKBPZ.jpg",
               "id": 12446,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eve Rand",
               "gender": 1,
               "credit_id": "52fe43599251416c7500ce6b",
               "name": "Shirley MacLaine",
               "profile_path": "/faG5S4EOVaGHNf1CwZryGcHCE4e.jpg",
               "id": 4090,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Benjamin Rand",
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce6f",
               "name": "Melvyn Douglas",
               "profile_path": "/to1UafQjBjZcN31AAS4fjmubk9Q.jpg",
               "id": 19550,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "President 'Bobby'",
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce73",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Dr. Robert Allenby",
               "gender": 2,
               "credit_id": "52fe43599251416c7500ceb3",
               "name": "Richard Dysart",
               "profile_path": "/uYWgsPAjJ2VyhVwGuBkVxmwB2wt.jpg",
               "id": 15413,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Vladimir Skrapinov",
               "gender": 2,
               "credit_id": "52fe43599251416c7500ceb7",
               "name": "Richard Basehart",
               "profile_path": "/EwbxGHlgK2nojHYGu5A3mpxFd2.jpg",
               "id": 5403,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Louise",
               "gender": 1,
               "credit_id": "52fe43599251416c7500cebb",
               "name": "Ruth Attaway",
               "profile_path": null,
               "id": 20160,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Thomas Franklin",
               "gender": 2,
               "credit_id": "52fe43599251416c7500cebf",
               "name": "David Clennon",
               "profile_path": "/sUZ6eL77Eh0aNYSx2NaB9NEZeCf.jpg",
               "id": 15412,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Sally Hayes",
               "gender": 1,
               "credit_id": "52fe43599251416c7500cec3",
               "name": "Fran Brill",
               "profile_path": "/lEGaGUNLt7X8A19JcYmH9Q3SXQD.jpg",
               "id": 164131,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Johanna Franklin",
               "gender": 0,
               "credit_id": "52fe43599251416c7500cec7",
               "name": "Denise DuBarry",
               "profile_path": "/tIpVXXrmtC3doDK2ocIJYvmeRko.jpg",
               "id": 1192920,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "First Lady",
               "gender": 1,
               "credit_id": "52fe43599251416c7500cecb",
               "name": "Alice Hirson",
               "profile_path": null,
               "id": 14106,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Gary Burns",
               "gender": 2,
               "credit_id": "52fe43599251416c7500cecf",
               "name": "Jerome Hellman",
               "profile_path": "/pw7HLpbqZ8WXySS4atQCOrZcrEV.jpg",
               "id": 30571,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Sidney Courtney",
               "gender": 2,
               "credit_id": "52fe43599251416c7500ced3",
               "name": "John Harkins",
               "profile_path": "/4dn1qyY6a8Vrw1a0u7yTb8E4h1b.jpg",
               "id": 68897,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Kaufman",
               "gender": 2,
               "credit_id": "543b41ddc3a368199c0044fb",
               "name": "James Noble",
               "profile_path": "/fly8G2L1fhDQEWTaMsn7LK4rKgt.jpg",
               "id": 152699,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce79",
               "name": "Hal Ashby",
               "profile_path": "/5VRhD4ZMsTyoAsMmxkNuTg41Sta.jpg",
               "id": 4964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce7f",
               "name": "Jerzy Kosinski",
               "profile_path": "/2w2IVYWOgXeCfi3sf2TvYrjWVhD.jpg",
               "id": 64822,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce85",
               "name": "Jerzy Kosinski",
               "profile_path": "/2w2IVYWOgXeCfi3sf2TvYrjWVhD.jpg",
               "id": 64822,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce8b",
               "name": "Robert C. Jones",
               "profile_path": null,
               "id": 21012,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43599251416c7500ce91",
               "name": "Andrew Braunsberg",
               "profile_path": null,
               "id": 29875,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500ce97",
               "name": "Charles Mulvehill",
               "profile_path": null,
               "id": 3222,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43599251416c7500ce9d",
               "name": "Jack Schwartzman",
               "profile_path": null,
               "id": 10932,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500cea3",
               "name": "Johnny Mandel",
               "profile_path": null,
               "id": 9796,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500cea9",
               "name": "Caleb Deschanel",
               "profile_path": "/2TsYnZibZRfHY3vcmEdLTJSR4kl.jpg",
               "id": 8750,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43599251416c7500ceaf",
               "name": "Don Zimmerman",
               "profile_path": null,
               "id": 15005,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.089477,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10322,
      "vote_count": 311,
      "budget": 0,
      "overview": "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television.",
      "similar": [
         66,
         9386,
         586,
         11679,
         9798,
         75,
         9772,
         37137,
         9440,
         10523,
         301348,
         13969,
         11566,
         17795,
         842,
         14844,
         9895,
         10187,
         10858,
         9776
      ],
      "original_title": "Being There",
      "runtime": 130,
      "poster_path": "/bgTFBMBuh4jA45l0DYyHC2GTq8X.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lorimar Film Entertainment",
            "id": 1176,
            "origin_country": ""
         }
      ],
      "release_date": "1979-12-19",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "Getting there is half the fun; being there is all of it!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hal Ashby"],
      "runtime": 130,
      "synopsis": "Chance (Peter Sellers) is a middle-aged gardener who lives in the townhouse of a wealthy man in Washington D.C. Chance seems very simple-minded and has lived in the house his entire life, tending the garden, with virtually no contact with the outside world. His cultural and social education is derived entirely from what he watches on the television sets provided by the \"Old Man,\" who raised him. The only other person in his life is Louise, the maid who cooks his meals and looks upon him as nothing more than a child who has failed to grow up. When his benefactor dies, Chance is visited by attorneys handling the estate. Chance tells them that he has lived his whole life inside the house. He was apparently abandoned as a baby and left in a basket outside the front door where the \"Old Man\" lived, who took him in and raised him. The lawyers force him to leave the townhouse and he discovers the outside world for the first time. Chance wanders aimlessly through a wintry and busy Washington dressed in conservative, old-fashioned business attire, a homburg hat, suitcase, umbrella and a television remote from his former home. Although finely-tailored many years ago, his clothes are of the style which has now come back into fashion, and so others presume he is an expensively well-dressed man of means. That evening, as he wanders, Chance happens upon a TV store. He sees his own image in one of the TVs captured by a camera in the shop window. While watching himself he backs into the street and is struck by a car owned by Ben Rand (Melvyn Douglas), a wealthy businessman. Rand's wife Eve (Shirley MacLaine), who is inside the limo, invites Chance to their home to recover from his injured leg. After being offered alcohol for the first time in his life, Chance coughs after he is asked his name. He says, \"Chance the Gardener\", but due to his cough those listening interpret his name to be \"Chauncey Gardiner.\" During dinner at the Rands' home, Chance describes the attorneys coming to his former house and shutting it down where he lived his whole life after the death of \"the Old Man\". Judging by his appearance and overall demeanor, Ben Rand automatically assumes that Chauncey is an upper class, well-to-do, highly-educated business man. Although Chance is really describing being kicked out of the home where he tended to the garden after the death of his legal guardian, Ben Rand perceives it as attorneys shutting down Chance's business because of financial problems after the death of his long-term boss and mentor \"the Old Man\". Ben even assumes it must have been caused by \"kid lawyers from the SEC,\" obviously attributing it to have occurred at a higher, more sophisticated level than a tax/IRS problem, as most persons would likely have assumed. Sympathizing with him, Ben Rand takes Chance under his wing. Chance's personal style and seemingly conservative and insightful ways embody many qualities that Ben admires. His simplistic, serious-sounding utterances, which mostly concern the garden, are interpreted by virtually everyone as allegorical statements of deep wisdom and knowledge regarding business matters and the current state of the economy in America. Ben Rand is also the confidant and adviser of the U.S. President (Jack Warden), whom he introduces to \"Chauncey.\" Chance's remarks about how the garden changes with the seasons are interpreted by the President as economic and political advice, relating to his concerns about the mid-term unpopularity that many administrations face while in office. Chance, as Chauncey Gardiner, quickly rises to national public attention. He becomes a media celebrity and appears on a national television talk show. He rapidly joins the A-list of the most wanted in Washington society. Public opinion polls start to reflect just how much his \"simple brand of wisdom\" resonates with the jaded American public. At an upscale Washington cocktail lounge, two important, older, well-dressed men are discussing Chauncey; one says to the other, there is a rumor \"he holds degrees in medicine as well as law.\" Rand, dying of aplastic anemia, encourages his wife to become close to Chance, knowing Eve is a fragile woman. Rand's doctor (Richard A. Dysart) makes a few inquiries of his own. Even after acquiring Chance's fingerprints and a photo of him, the physician can't find a record of him anywhere, including elementary, middle, or high schools, colleges, nor employment or a police record. Rand's doctor concludes that Chance is actually a simpleton gardener, totally oblivious and unaware to the ways of the world. But he sees that Chance has helped Rand to accept his final illness and pending death. The doctor is hesitant to say anything that will upset Rand. He also sees that Chance possesses no guile, no intent to deceive, or any interest which would adversely impact Ben or Eve, or have any adverse effect upon Eve, or the estate, following Ben's death. Just days before his death, Rand amends his will to include Chauncey. At his funeral, the President gives a long-winded speech full of bon mots and quotes by Rand. Rand's pallbearers, all influential citizens and members of the board of Rand's several companies, hold a whispered discussion over potential replacements for the President in the next term of office. As Rand's coffin is about to be interred in the family Masonic pyramid-like mausoleum, they unanimously agree on \"Chauncey Gardiner.\" Chance, oblivious to all this, wanders away from the funeral and through Rand's wintry estate. Ever the gardener, he straightens out a pine sapling and then walks up to the edge of a pond and then onto its surface. He pauses, dips his umbrella deeply into the water next to him, and then continues to walk further out into the pond. Rand's quote \"Life is a state of mind\" is stated in voiceover .",
      "writers": [
         "Jerzy Kosinski",
         "Jerzy Kosinski"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078841/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MjI4OTA3OV5BMl5BanBnXkFtZTYwNjUwODI5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Sellers, Shirley MacLaine, Melvyn Douglas | See full cast and crew »"],
      "reviews": [
         "The original \"Forrest Gump\" came out in 1979 when Hal Ashby's \"Being There\" was first released. A quietly brilliant, hilarious, heart-wrenching and heart-warming motion picture that showed how great Peter Sellers (Oscar-nominated) was and how limitless his range was. He stars as a gardener at an old mansion in Washington, D.C. who has never been outside of the owner's small piece of property. When the owner dies, he has to leave the only home he has ever known. Sellers has no knowledge of anything except what he sees on television and he has a strange sort of child-like innocence that endears him to all he comes into contact with. After a minor accident, Sellers is taken to the home of a ridiculously wealthy political lobbyist (Melvyn Douglas in his second Oscar-winning performance) who is literally being kept alive as he has a rare form of cancer. Douglas immediately takes a liking to Sellers and so does his much-younger wife (Shirley MacLaine). Sellers is now in the spotlight though as he gets to meet the president (Jack Warden) and slowly starts to gain popularity and political support from those around him. Of course Sellers does not realize any of this as his understanding of such things are beyond his somewhat limited mental capabilities. A simply brilliant film that is carried by Sellers' amazing personal best performance. Everyone else is adequate, but this is Sellers' show. Douglas won the Oscar mainly due to sympathy votes, but surprisingly Sellers would die before Douglas as he passed away less than six months after receiving his Oscar nod of a massive heart attack. As good as Dustin Hoffman was in \"Kramer vs. Kramer\", I still wish that Sellers would have won the Oscar for this role which is one of the finest performances ever throughout the entire history of the cinema. 5 stars out of 5.",
         "This film is an absolute jewel. The main character, played by Peter Sellers, is the exact opposite of the film itself. Chauncey/Chance is simple, vapid, unconcerned and utterly unselfconscious, yet he radiates an image of being ponderous, calculating, and complex. The film is deceptively straightforward and uncomplicated on the surface, but is rich and complex upon reflection. The film is very enigmatic (even the title seems to make no sense, even though it seems like it should) and lends itself to interpretation. This is one of those films that you have to talk about after seeing it, and you'll find endless points of view to consider. More than that, however, this film is historically fascinating. Taken as a whole, the movie, the book, the behind the scenes intrigue, the place it holds in the careers of the Stars, the writers and the directors, makes this an exceptionally interesting and enjoyable film.",
         "Peter Sellers should have taken home the Academy Award for his role in Being There. A lifetime of comedies behind him, Sellers ended his career as an actor and a comic legend with this classic. Hard to believe that this was made over 20 years ago, it is still as funny as ever. Since then, no other comedian has captured the raw talent of comedy that Sellers could create. The silent comedy and the physical comedy that Sellers made was not only timeless but funnier than most of the comedy we see in film today. Second to maybe his role in Lolita and in the Pink Panther series, Sellers is not only funny, but gives his best performance in Being There. A terrific story with interesting and real characters, Being There is a delight.",
         "When I first saw Being There I was all of 10 years old, and for some reason, I loved it. And yet I could never exactly say why. Several years latter while looking for another movie, I happen across this video and read the review. Chance Gardner played charmingly by Peter Sellers, ( I think that is what the reviewer wrote) stumbles his way into the upper crest where he is mistaken for someone with deep knowledge of the world. Other reviews point out this movie is cynical characterization of self absorbed people in politics and media. As a kid I didn't get that, and now on further reflection what I liked about this movie was how these people where drawn to Chances innocence. In some ways Forrest Gump tried to attempt to tell this story line, but only manages to rehash old stereotypes. Being There depicts in clever, real characters who use a veil of politeness to cover up a cynicisim they have of their world and their own power. But for a kid and maybe why it has a cult following is because the heart of the show, whats addicting about is no matter how self absorbed we become, our best nature is drawn to a simple life, absent of complications. After watching the movie again, the dark comedy is more apparent, but I am happy to say that in the \"Life and death of Peter Sellers\", Sellers himself interpreted the character as I thought of it when I was kid. Gardner is a man who is sublimely content with no past and no future, and therefore no worries. As a kid I kind of new that as innocence. So if you rent this movie don't just see it as a black comedy, but also see it how a kid might, and for that matter how Peter Sellers saw it.",
         "To learn that Peter Sellers spent the last ten years of his life dedicated to producing this film, reluctantly taking parts in the Pink Panther series to gain enough money to do so, is dedication enough to tell you that this film meant a lot to Sellers. It is sad that Sellers died just one year after completing the film, which to me stands as a testament to his talent. Being There was not a successful film, indeed many people have never heard of it. If you haven't seen it, track it down. It is one of the most touching films I have ever seen.",
         "\"To see me as a person on screen would be one of the dullest experiences you could ever wish to experience\" - quote from Peter Sellers. Peter Sellers had many quotes like this in which he spoke of his near self-hatred, hated seeing himself, and that when he was not doing comedy, he was dull and unfunny. That makes his portrayal of Chauncey Gardner that much more amazing, because he portrays a very simple man totally comfortable within himself. Being There is a great film. It deals with a simple premise - if you act in a certain way, people will make unquestioned assumptions about you. Chauncy is slow witted and has the mind of small child, and all that he knows in gardening. However, he dresses in nice suits, has impeccable manners and is not shy, so he is accepted into social circles. When he speaks of gardening, his ramblings are mistaken for metaphors and he is instantly considered an economic genius. This is wrapped around a beautiful film, in which Chauncey wanders from one circumstance into another, never changing his demeanor, never faltering. I an reminded of Mr Magoo walking blindly down a succession of steel girders thinking they are stairs. Essentially, he is not in peril because he does not know he is in peril. The charm of this film exists in Chauncey's unwavering personality, and how it affects the world of phonies and bureaucrats he has come to inhabit. Although the film sometimes comes across as forced, and some of the encounters with Eve (Shirley MacLaine) come off forced, the film is still a masterpiece. Its theme and Sellers' stunning performance lauch it into the catoegory of greatness. There is much debate amongst the lovers of this film over its final scene. If you have not seen it, rent it, and draw your conclusions. Like many great movies steeped in mood and metaphor, we are left to draw our own conclusions. The phrase \"I like to watch\" has become so famous from this movie - it refers to Chauncey's love for TV and the fact that it is his reference point for his existance. (Such has when he tries to click a remote to thwart off muggers). But there is a great deal more to Being There. It is a Top 10 Selection of 70s, Hal Ashby's best film and Peter Sellers greatest performance. **** out of ****.",
         "Even as a kid I loved this movie and upon seeing it again as an adult I found much to re appreciate in this marvelous sleeper of a film. Sellers is in top form as are the supporting cast--the shear farce of it all makes the improbable seem probable--and as a vehicle for political/social commentary it ranks as one of the best dark comedies ever made. The inclusion of all the 70's TV clips make Being There an invaluable period piece and provide the film with some of it's funniest scenes. The movie also provides an interesting portrayal of the trappings of the super wealthy and it's portrayal of the workings of power and money are reminiscent of some of Kubrick's better work. Check out the all seeing eye of the Illuminati on the apex of the pyramid of \"Rand's\" mausoleum during the funeral scene. Pretty powerful stuff--makes Being There all the more an important and revealing work--as well as spiritual. Like the protagonist, Chauncey Gardner, there's something about this film that makes you feel better about life and , yeah, even about death. Kosinski's, Ashby's and Seller's gift to us all.",
         "Melvyn Douglas as Ben Rand and Shirley MacLaine as Eve Rand were only two examples of the great casting in this film. The best casting of course was to place Peter Sellers in the role of Chauncey \"Chance\" Gardener. I have watched this film many times and each time I see something else to enjoy in Peter Sellers' performance along with something else to mourn for his passing. In \"Being There\" Sellers abandons the crowd pleasing slapstick which attracted the droves for the \"Pink Panther\" series to offer a far more sincere performance that to me is flawlessly in-character and ultimately believable. I am constantly debating with myself whether \"Dr. Strangelove\" or \"Being There\" was Sellers' best work. \"Being There\" is very enjoyable and I never seem to get tired of it. Apart from Sellers standout performance, \"Being There\" from every angle is an extremely well made film that holds up well to remain engaging 25 years later and is no doubt a source of pride for all involved in any regard. In short, this is a movie that, \"I like to watch!\"",
         "WARNING: SPOILERS! This is an astonishing film. I sat through 'Being There' chuckling at Seller's wonderful 'Zen-like' performance, enjoying its gently satirical look at the vacuous nature of political debate, safe in the knowledge that I was in on the joke: Chance is an idiot but the real idiots are almost everyone else in the film who see profundity when they're given pap. And then, in a scene that completely flips the film on its head, Chance walks on water! That scene is the cinematographic equivalent of staring at one of those stereograms when the hidden 3D image suddenly leaps out at you. It's a shocking moment, beautifully handled, and you're immediately forced to question everything you've seen in the film and your assumptions about it: why does Chance have no concept of time? Is it because an eternal being wouldn't need one? When Eve makes a pass at Chance is he being tempted by, and tested against, original sin? Was the Washington Cop who, we assume, is calling in a report of a simpleton on the loose, actually compelled to do exactly what Chance told him to do? Does Chance speak Russian? How? Is this because all the tongues of man are as one to him? Does Chance have the power to decide when the time is right for Ben to die? Did the 'old man' meet a similar fate, and does Chance lay his hand on the old man's forehead to see if he is cold or to bless him? If we accept that Chance has indeed revealed his divinity to us then the whole film flips once more and takes on a far darker aspect. Is the decline in the Presidents powers linked to the rise of Chance? Is his TV broadcast the modern equivalent of the 'sermon on the mount'? And, crucially, is all his talk of gardening a chilling metaphor for the immanent fate of mankind? A shepherd might be content to tend his flock, but Chance is a gardener, and he might have a great deal of pruning and weeding to do before Eden \u0096 his garden - is restored to its former glory. A great film that fully deserves its high ranking. 9/10.",
         "On the face of it, this was always going to be a cinematic treat. Hal Ashby, who in my opinion had the greatest sense of humour in Hollywood directing Peter Sellers, one of the finest comic actors of all time. What i didn't expect was an excellent supporting cast with superb performances from Shirley MacLaine and Melvyn Douglas and a watertight script from Kosinski. What gave me the biggest pleasure was Ashby's subtle portrayal of his own politics. Sellers' character's rise and rise is set against, in the beginning at least, images of the socially deprived. In most of Ashby's films there is a strong sense of the anti-establishment but what is brilliant in this movie is that Ashby gets inside the establishment to ridicule it and yet at the same time bring across a strong sense of humanity in the richer character's isolation and loneliness. Politics or not Ashby's perfect pacing bring the best out of Sellers whose film career, Strangelove aside, was hit and miss. This movie is definitely a hit from the most underrated film director Hollywood has ever had the arrogance to forget to miss."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "BSB",
         "CIP",
         "Lorimar Film Entertainment"
      ],
      "summaries": [
         "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television. After a run in with a limousine, he ends up a guest of a woman (Eve) and her husband Ben, an influential but sickly businessman. Now called Chauncey Gardner, Chance becomes friend and confidante to Ben, and an unlikely political insider.",
         "Chance is mentally challenged, those that know him who would probably call him simple. He doesn't know how to read or write. For as long as he can remember, he has worked as the gardener for his long time employer Mr. Jennings, has never stepped off the property of Jennings' brownstone in Washington DC, has only known Jennings and the only other household servant, a maid/cook named Louise who tends to all his meals, and has only had contact to the outside world indirectly via television, the channels on which he is frequently changing as he watches. Conversely, no one but Jennings and Louise know that he lives there. He only fully understands the world of his garden, all else, including what he sees on TV, he not comprehending in their entirety. His wardrobe consists largely of Jennings' discarded but well appointed clothes. After Jennings dies, Chance is sent \"into the world\" not truly understanding what his new situation means. By chance, he eventually meets wealthy Eve Rand, who, out of circumstance, invites him to her and much older ill husband's house. Her husband, Ben Rand, is a financier, who will probably imminently pass from his aplastic anemia. Not fully comprehending what Chance is truly saying, they believe his name to be Chauncey Gardiner, and that he is a man of wealth and straightforward deep insight. As such, they introduce him to their rich and powerful friends - some very rich and extremely powerful - who believe, largely because Ben Rand says so, that Chauncey is brilliant in a down home way, his brilliance which they state in public. The question then becomes whether anyone will notice that the emperor has no clothes (to use an old adage), even after background checks on \"Chauncey Gardiner\" come up empty and especially if their public praise of him has gone too far to go back.",
         "A simple, sheltered gardener becomes an unlikely trusted adviser to a powerful businessman and an insider in Washington politics."
      ],
      "budget": 0
   },
   "movielensId": 1292,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-12-19",
      "dvdReleaseDate": "2001-04-03",
      "directors": ["Hal Ashby"],
      "runtime": 130,
      "movieId": 1292,
      "title": "Being There",
      "mpaa": "PG",
      "actors": [
         "Peter Sellers",
         "Shirley MacLaine",
         "Melvyn Douglas",
         "Jack Warden",
         "Richard Dysart",
         "Richard Basehart",
         "Ruth Attaway",
         "David Clennon",
         "Fran Brill",
         "Denise DuBarry",
         "Alice Hirson",
         "Jerome Hellman",
         "John Harkins",
         "James Noble"
      ],
      "imdbMovieId": "0078841",
      "originalTitle": "Being There",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "FcPQ9gww_qc",
         "Mo_WilWo9LY",
         "J38YRxjXC1U"
      ],
      "plotSummary": "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television.",
      "tmdbMovieId": 10322,
      "avgRating": 3.96028,
      "releaseYear": "1979",
      "numRatings": 7276,
      "posterPath": "/bgTFBMBuh4jA45l0DYyHC2GTq8X.jpg"
   }
}