{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "berlin wall",
            "id": 292
         },
         {
            "name": "paranoia",
            "id": 2340
         },
         {
            "name": "wall",
            "id": 4372
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "adult animation",
            "id": 161919
         }
      ],
      "imdb_id": "tt0084503",
      "video": false,
      "title": "Pink Floyd: The Wall",
      "recommendations": [
         25771,
         10322,
         993,
         11031,
         10537,
         1480,
         36107,
         13820,
         821,
         3116,
         12498,
         10774,
         884,
         994,
         3063,
         14320,
         309,
         614,
         5924,
         4543
      ],
      "backdrop_path": "/sofxsyR4Br8CdKLCZzzITvdrU4g.jpg",
      "revenue": 22244207,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Pink's Mother",
               "gender": 1,
               "credit_id": "52fe44b59251416c7503e457",
               "name": "Christine Hargreaves",
               "profile_path": null,
               "id": 71247,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Pink's Father",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e45b",
               "name": "James Laurenson",
               "profile_path": "/fW9gq3GzJGjICmTIgmzzGQ4fQyz.jpg",
               "id": 71248,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Pink's Wife",
               "gender": 1,
               "credit_id": "52fe44b59251416c7503e45f",
               "name": "Eleanor David",
               "profile_path": "/dKteIvo8aA346HFl6msa9jO3O5N.jpg",
               "id": 71249,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Pink",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e48d",
               "name": "Bob Geldof",
               "profile_path": "/dAep2VIft4YPs5gYZnXyIdsC8ae.jpg",
               "id": 47991,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Schoolteacher",
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e491",
               "name": "Alex McAvoy",
               "profile_path": null,
               "id": 994272,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "American Groupie",
               "gender": 1,
               "credit_id": "52fe44b59251416c7503e495",
               "name": "Jenny Wright",
               "profile_path": "/scz1dQwtwyFDej8zCAbk6p5bqdp.jpg",
               "id": 64056,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Young Pink",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e499",
               "name": "Kevin McKeon",
               "profile_path": null,
               "id": 980082,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Rock and Roll Manager",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e49d",
               "name": "Bob Hoskins",
               "profile_path": "/mIgAC6q5HcHHxZUIiCOvE6mHLGs.jpg",
               "id": 382,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Little Pink",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e4a1",
               "name": "David Bingham",
               "profile_path": null,
               "id": 980076,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "English Doctor",
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4a5",
               "name": "Ellis Dale",
               "profile_path": null,
               "id": 201569,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Lover",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e4a9",
               "name": "James Hazeldine",
               "profile_path": "/k6vaCPahjp4msGqVl36hFatL4V1.jpg",
               "id": 135101,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Playground Father",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e4ad",
               "name": "Ray Mort",
               "profile_path": null,
               "id": 249810,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Teacher's Wife",
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4b1",
               "name": "Margery Mason",
               "profile_path": "/A1nJN61RozmvjqJQrHXfHM7F03W.jpg",
               "id": 213222,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "American Doctor",
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4b5",
               "name": "Robert Bridges",
               "profile_path": null,
               "id": 172953,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Hotel Manager",
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4b9",
               "name": "Michael Ensign",
               "profile_path": "/nyTn32fU0E1pQpIUeuiTAehaAee.jpg",
               "id": 1080265,
               "order": 14
            },
            {
               "cast_id": 28,
               "character": "Paramedic",
               "gender": 2,
               "credit_id": "57f80257c3a36874fe000bec",
               "name": "Vincent Wong",
               "profile_path": "/r09FygOv9rWFFNtT2FcRepS6v1y.jpg",
               "id": 1257821,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e44d",
               "name": "Alan Parker",
               "profile_path": "/vABD5OnVL9TcuxLHae6EOTDfWiW.jpg",
               "id": 9168,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e453",
               "name": "Roger Waters",
               "profile_path": "/fsYU6JmY42ZEipmpQJU13buJeM6.jpg",
               "id": 67273,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e465",
               "name": "Alan Marshall",
               "profile_path": null,
               "id": 7726,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e46b",
               "name": "Stephen O'Rourke",
               "profile_path": null,
               "id": 71250,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e471",
               "name": "Bob Ezrin",
               "profile_path": null,
               "id": 71251,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e477",
               "name": "David Gilmour",
               "profile_path": "/57vWit6SSOGl94Bh9vYtkEhHFPi.jpg",
               "id": 71252,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e47d",
               "name": "Roger Waters",
               "profile_path": "/fsYU6JmY42ZEipmpQJU13buJeM6.jpg",
               "id": 67273,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e483",
               "name": "Peter Biziou",
               "profile_path": null,
               "id": 10717,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e489",
               "name": "Gerry Hambling",
               "profile_path": null,
               "id": 9163,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4bf",
               "name": "Nick Mason",
               "profile_path": "/qVrfHpRRp5pi3LA4yL5rETprD4h.jpg",
               "id": 108122,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "55951e9d9251416317001bfe",
               "name": "Margery Simkin",
               "profile_path": "/dCyAWZGEaW1OlGgh5ALiqGfsbpb.jpg",
               "id": 6347,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Music",
         "id": 10402
      }],
      "popularity": 9.846808,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 12104,
      "vote_count": 445,
      "budget": 12000000,
      "overview": "A troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
      "similar": [
         20575,
         786,
         525,
         450794,
         6477,
         1091,
         3902,
         11827,
         624,
         6575,
         10186,
         14831,
         8873,
         31802,
         37896,
         193613,
         63973,
         468775,
         17000,
         13576
      ],
      "original_title": "Pink Floyd: The Wall",
      "runtime": 95,
      "poster_path": "/jshxdvf8A7oQqBAH3GFwXRwDyCX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Goldcrest Films International",
            "id": 500,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tin Blue",
            "id": 8834,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1982-07-14",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "The Memories. The Madness. The Music... The Movie.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Parker"],
      "runtime": 95,
      "synopsis": "The film depicts the construction and ultimate demolition of a metaphorical wall. Though the film's symbolism is open to interpretation, the wall itself clearly reflects a sense of isolation and alienation. Pink (Bob Geldof), the protagonist (and unreliable narrator) of the film, is a rock star, one of several reasons behind his apparent depressive and detached emotional state. He is first seen in a quiet hotel room, having trashed it. The opening music is not by Pink Floyd, but is the Vera Lynn recording of \"The Little Boy that Santa Claus Forgot\". During the following scenes, it is revealed that Pink's father, a British soldier, was killed in action during World War II during Pink's infancy. The reference is almost certainly to the death of Roger Waters' real-life father, Eric Fletcher Waters, who died in combat in Italy during Operation Shingle (the Battle of Anzio) in February 1944. The movie then flashes back to Pink as a young English boy growing up in the early 1950s. Throughout his childhood, Pink longs for a father figure after he learns his father died in the war. At school, he is humiliated by his mean and stern teacher for writing poems in class. The poems that the teacher seizes from him and reads aloud are lyrics from \"Money\" from the Pink Floyd album Dark Side of the Moon. Pink is also affected by his overprotective mother who spoils him by giving him whatever he wants. As an adult, Pink eventually gets married as his fame as a rock star grows, but he and his wife grow apart and she has an affair while Pink is on tour. When Pink learns of the affair, he compensates with expensive materialistic possessions and turns to a willing groupie (Jenny Wright), whom he brings back to his hotel room only to trash it in a fit of violence, causing her to flee the room in terror. Pink slowly begins to lose his mind to metaphorical \"worms\". He shaves off all of his body hair (an incident inspired by former bandmate Syd Barrett, who appeared at a 1975 recording session of Wish You Were Here, having shaved his eyebrows and body hair) and, while watching The Dam Busters on television, morphs into his neo-Nazi alter-ego. Pink's manager (Bob Hoskins), along with the hotel manager (Michael Ensign) and some paramedics, break into the hotel room and discover Pink. They take him away into a waiting limousine outside the hotel and inject him with drugs to enable him to perform. The drugs cause Pink to hallucinate and he fantasises that he is a neo-Nazi dictator, his concert is a rally. His followers proceed to attack ethnic minorities and rape the white girlfriend of a black man. Later, Pink holds a rally in suburban London, singing \"Waiting for the Worms\". The scene is inter-cut by images of animated marching hammers that goose-step across ruins. Pink screams \"Stop!\" and takes refuge in a bathroom stall at the concert venue, reciting poems which would later be used as lyrics on Pink Floyd's \"Your Possible Pasts\" from The Final Cut album and \"5:11 AM (The Moment Of Clarity)\" from Roger Waters' The Pros and Cons of Hitch Hiking. In a climatic animated sequence, Pink puts himself on trial. He is depicted as a small, pink rag doll that rarely moves. The judge is a giant pair of buttocks, with two backward facing legs, an anus for a mouth and a scrotum for a chin. The lawyer is a tall, menacing, vulturelike man and the schoolmaster is an abusive, hateful marionette. After hearing from the parties and witnesses (Pink's wife and mother), the judge orders the wall to be torn down. The wall explodes and shows a montage of events from the entire film. The film concludes with three children cleaning up a pile of debris after an earlier riot. It is unknown whatever has happened to Pink, leaving the viewer to decide.",
      "writers": [
         "Roger Waters",
         "Roger Waters"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084503/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxMDAzNDk2M15BMl5BanBnXkFtZTYwNDE4MDg4._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Bob Geldof, Christine Hargreaves, James Laurenson | See full cast and crew »"],
      "reviews": [
         "I have seen the movie several times now and every time I watch it I see something new, something I haven't seen or heard before. Some unsung line, some lost message... Every time I watch the movie I seem to dig deeper into this complex work of art. However, I cannot tell you how disappointed I am that this movie is so underestimated, and, above all, misunderstood. How many times have you heard someone say something like: \"You can't watch 'The Wall' unless you're really drunk or really high\" ? I have heard this line probably from every single person that has seen the movie and it hurts me so much that nobody really tries to understand the movie. The key to understanding the movie is in the lyrics. The movie is not just a long series of video clips that accompany the album. The images are just a final piece of the puzzle, the final touch on a magnificent piece of art. The first time I saw this movie I felt very embarassed. Yes, embarassed, because I felt like a fool for hearing the album so many times and not realizing what it was about. The movie made me appreciate the lyrics of a rock song for the first time in my life. The week after seeing \"The Wall\" for the first time I bought Pink Floyd's \"The Final Cut\". Do you know what was the first thing I did when I opened the CD case? I read the lyrics, from the first to the last word. And I actually tried to understand what the album was about. \"The Wall\" is so much more than you think it is. The only solution to not understaning the movie is watching it again and paying more attention. Once you get it, you will never forget it.",
         "What can you possibly say except that this movie is amazing? \"The Wall\" is one of the few movies out there that has a powerful effect on the people are receptive to its message. Told with practically no dialogue, the only guide to the bizarre, frightening, and strange images is the incredible music by Pink Floyd, from their equally good double album. A considerable number of the songs were re-recorded for this movie, and one song (the heart-wrenching \"When the Tigers Broke Free\") was added. The new versions of the songs are sometimes worse than the album (Waiting for the Worms), and sometimes better (Mother, In the Flesh). \"The Wall\" isn't a pleasant movie, nor is it a simplistic or banal movie. It is brutal, cynical, and disturbing, but it has moments of flesh-tingling beauty and an uplifting message in the end, if you persevere. I recommend both it and the album to anyone who enjoys a powerful movie. In my opinion, \"The Wall,\" along with a few other albums, represents the pinnacle of rock music.",
         "\"Pink Floyd The Wall\" is a great film, based on the already great album by Pink Floyd! I was stunned by the use of imagery, combined with the great soundtrack of the album, which gave us a strange, drugged up vision of what a burnt out rock star would see. It's really crazy! Yet it shows how these famous rock stars are bombarded with fame and applause, and how insane it can drive an already disturbed person. \"The Wall\" itself, is the isolation and separation from society and saneness, which is a place that can easily be avoided if only people gave us a fair chance to. The depressing part about the film is that none of this is the rock star's fault. He was driven to it by loneliness in his growing up years(since he lost his father to the war), along with psychological torment by his teachers, parents, and above all, his sexually controlling wife. The movie is twisted because this is how the lead character sees the world. Worse yet, after he has already been driven to the edge of his own sanity, in his mind, the people who drove him to that edge, come back to testify against him. It's weird the first time you watch it, and looks a lot like a crazy music video that was pulled out of MTV. The only difference is that this one is telling a story, and has been transferred to the big wide screen. Alan Parker has directed the film, but Roger Waters seems to be in charge here, because it's his album, his story, and his conception. All that's really been done here is transforming the album to celluloid. I in some ways, like this better than the album, because now we have images to reinforce the songs and the story. I wish I could have seen this on the big screen, because the variety of images and the loud music seem compressed and compacted on a small TV set. You might not understand this the first time, especially if you haven't heard the album yet. But it really is a great film, and it actually has a story and a point that most music videos today unfortunately lack! I think that this film will teach people the reasons why these talented individuals suffer and lose their minds. The people that have guided and taken care of them while they grew up, often take away their ability to happily and normally function on their own. And the album and film's lesson is for not only the people who drove him to his wall to back off, but for him to pull himself out.",
         "The opening tracking shot of a hotel hallway that resembles a prison should clue you in as to what awaits. There are so many things to like and be fascinated by in this movie. And for all of its avant-garde leanings, this is actually a very classically designed story. An iconoclastic music star, Pink Floyd, tries/tries not to think about his past and how he got to where he is, which is borderline psychotic. And because he's so disturbed, he can't even think in a linear way, so the journey we take into his mind is necessarily whacked-out. We also get to see how fascism is born from misdirected hate and idolatry. As a rock star, Floyd has seen the adulation of his audiences, so he's familiar with the phenomenon. But at the same time, he detests them for buying into his act. It's like the old Groucho Marx joke about refusing membership to any group who would let you in. He knows he's a fake (his teachers and people like his wife have told him so), so everyone else who thinks he's real must be fakes also. It's a big cyclic game. So he can't let any of them in, behind his wall, because they are, by definition, phony. It's interesting, also, to think about how he has turned full circle into fascism. It's just part of his dream and how he deals with his anger, but it's also an interesting reaction to the absent father. Had there been no homosexuals or Jews etc., there would have been no need for a Hitler, and therefore there would have been no need for his father to die. But instead of hating Nazis, he hates the people that \"provoked\" the Nazis. (I could go on for days with stuff like this, but I'll stop here.) Just watch the movie and be impressed with the way it works on so many levels.",
         "Alan Parker has always had a gift for the integration of music and film, and his efforts over the years have reflected that. Movies like \"Fame\" & \"The Commitments\" have made him a director more remembered for his music video skills than his storytelling, even though he directed gripping controversial more seriously films, like \"Midnight Express,\" and \"Mississippi Burning.\" \"The Wall\" tells the account of a rock star's breakdown, Pink Floyd slowing down into madness... Pink's madness is illustrated with living flashbacks of his life... He has visions of his childhood from a baby held in the cradle to his present moment... We have little Pink suffering from alienation for the death of his father in the war, and taken under the care of his mother... We have also rock and roll star Pink, who is destroyed by his evident insanity and is driven over the edge by his wife's infidelity and we have a blown insane Pink, a Nazi dictator under the Hammer Regime leading a series of occurrences like raping, breaking and pillaging... Alan Parker translates the music into memorable images that are insensible to love or pity... All of Pink's life is projected on the screen... We see and hear songs altered from an abstract concept into a disgusting vision of students being thrown into a meat grinder... Pink constructs the wall by building up tension... In mixing up sexuality and violence, he creates a new window into Pink's character... The animated sequences that reflected Pink's foolishness are important and influential... Alan Parker's direction moves the story cleverly from the present into the past and into a possible future, drawing a warning, but still contemplating traumas of a child with hurtful effects on the fully grown man... The result is a mad piece of cinema, a kind of a bad dream becoming even worse than usual... The film exploits great special effects, some frightful and impossible to understand... The music praises the film so well from declaring noisy rock and roll music to quiet ballads of insanity... Bob Geldof is amazing as Pink, the British rock star broken in pieces under the psychological pressure of an American Tour... Pink Floyd-The Wall is a bizarre animation reinforcing its vision of an insane, inhumane, unjust and cruel world, not easy to follow... The film stands out as one of the classic in the teenage scene, specially teenagers who take or receive narcotic and due to its psychedelic nature leaves you greatly depressed...",
         "If for whatever reason you should find yourself in the company of aliens from the planet Nietsche , a planet whose inhabitants have gone beyond what can be described as human nature so much so that they have no knowledge of what being human is , then show them this film that explains everything The story starts with the Anzio landings that sees the death of Pink's father . As Plato said \" Only the dead have seen the end of war \" and that is bitterly true , man will always be man and man will always kill man until the end of time Pink goes to school and education is a double edged sword . It has the potential to educate young humans but as often happens these young humans find themselves being used as victims of whatever mood the teacher is in . Someone must pay for authorities inaquequacies Pink leaves school and falls in love , but love is the sharpest and most double edged sword in all of creation . It inspires but it also destroys us . Despite hundreds of millions of human beings being killed in wars , genocide and purges there is nothing so personally painful or as cruel as the betrayal by a lover . The darkest pits of Hell can not be as hellish or as sadistic as infidelity As Pink descends further into his personal madness we see him take his revenge . Humans are sexual beings and perhaps this is what makes us both demons and avenging angels . Irony is to the fore as he stops becoming a victim and turns into unfeeling fascist dictator . Someone must pay for all the wrongs Pink has endured and it's the innocent that must suffer You could go to the planet Nietsche with all the written works of every human philosopher who ever lived and that still wouldn't be enough to explain what it's like to be human . As it stands Alan Parker and Roger Waters have made a cogent film explaining why humans are the way they are and how they react to the surrounding universe . It's a film whose soundtrack is every bit as powerful as the human condition",
         "Roger Waters has weaved a compelling visual of the journey of a disturbed and misled mind. Though the viewer is sometimes left to sort out obscure animations and confusing images, it is not without direction. Subsequent viewings of this film reveal substance that only a genius could imbue in his writing. Character development through such subtle action in places casts a light upon Roger Waters as a person who understands the frailty of the human mind. The main character, Pink, portrays angles of the human condition we all face at some point by embodying a victimized character: sick over the loss of his father to the war; negatively spotlighted at school for talents that are apparently unfavorable at the time; unable or just unwilling to relate to his wife; and ultimately shut off from effectively relating to others because of an inability to express himself in ways that others understand. Not only is the story captivating, but the music is such that it will always be noted as not only ahead of its time, but timeless. The Wall is a masterpiece of storytelling, but not in the traditional sense. One must not watch this film expecting everything on a silver platter. Symbolism and metaphors abound, leaving a great deal of interpretation and adaptation to the viewer. Sit with an open mind and let Waters' character help you read into yourself.",
         "Whether you're sober, buzzed, high, or fully baked this movie is enjoyable. Anyway you look at it. Some people will naturally say you can only watch it high for it to make sense. Ignore those pothead hippies. Don't get me wrong I love pot as much as the next guy but what they say is untrue. Maybe it's more enjoyable baked or drunk but what isn't? If you're under the age of 30 and over the age of 12 and haven't seen it feel free to join your generation anytime now. What you missing is a great movie about isolation, depression, and anger. And for those of you too baked for any amount of attention span put the movie on anyways cause the soundtrack rules. However if you ever run across a chance to see it at a theater, as a midnite matinee or just a run of old movies, pay any amount for admission it'll be worth it. For those of you who enjoy getting stoned and watching movies see Story Of Ricky. It's nearly as good as this. For those of you looking for insanity on video see Taxi Driver.",
         "If you like Pink Floyd, you'll love the movie regardless of what you think the cinematic value of the film is. To me, Roger Water's ability to express himself is outrageously smart. He is a genius. His English is masterful and the way he expresses how he feels is just mind-blowing. I am sure that every one of us has felt exactly the same as Pink/Roger felt at some point of our life but have never been able to successfully explain it. It is therefore my opinion that the lyrics are what make this film great. As a movie, it also translates those feelings well. All the actors were superb. Alan Parker managed to pull the whole thing together cleverly and all in all it is an excellent choice for a late night stoner's kick back - brilliant.",
         "A film made in the 80's � for children of the 60's. Pink Floyd's The Wall is arguably the best `rock opera' ever. � But the angst and societal issues that the album addresses only seem aged now. The film, by blending the original music plus skilful re-mixes and new tracks tells a simple story, but the imagery used is dark and disturbing and relates to the social issues of the time. The film was made when the fears expressed in the novel 1984 were still a threat, (as an aside, while the film was being made in England there was a political campaign comparing the then conservative government of M. Thatcher to the Orwellian fascist world of 1984.) But, as much as I and other members of my generation can relate to this film, does it have a message for today's youth. I think that it definitely does. The issues today may be different from those of the late 70's, but, the sentiment and the dangers are the same. We have huge segments of alienated people, we have bigotry and hate, and we have governments which operate in secret. We have movements that preach rigid conformity and hate, we have religions that have lost the message of caring and we have schools that only want to turn out mindless corporate robots. In fact, I think that this film, and therefore the message behind the music, is MORE important today. The issues we as a society face now are far more dangerous to personal freedoms than when it was first released."
      ],
      "genres": [
         "Animation",
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Goldcrest Films International",
         "Metro-Goldwyn-Mayer (MGM)",
         "Tin Blue"
      ],
      "summaries": [
         "The movie tells the story of rock singer \"Pink\" who is sitting in his hotel room in Los Angeles, burnt out from the music business and only able to perform on stage with the help of drugs. Based on the 1979 double album \"The Wall\" by Pink Floyd, the film begins in Pink's youth where he is crushed by the love of his mother. Several years later, he is punished by the teachers in school because he is starting to write poems. He slowly begins to build a wall around himself to be protected from the world outside. The film shows all this in massive and epic pictures until the very end where he tears down the wall and breaks free.",
         "The life of the fictional rock star \"Pink\" is the subject of the visually evocative cult film based upon the music and visions of the group Pink Floyd as portrayed in the album of the same title. Relationships, drug abuse, sex, childhood, World War II and fascism combine in a disturbing mix of episodic live action and lyrical animation drawn by British caricaturist Gerald Scarfe.",
         "A confined but troubled rock star descends into madness in the midst of his physical and social isolation from everyone."
      ],
      "budget": 0
   },
   "movielensId": 1298,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-07-14",
      "dvdReleaseDate": "1999-12-02",
      "directors": ["Alan Parker"],
      "runtime": 95,
      "movieId": 1298,
      "title": "Pink Floyd: The Wall",
      "mpaa": "R",
      "actors": [
         "Christine Hargreaves",
         "James Laurenson",
         "Eleanor David",
         "Bob Geldof",
         "Alex McAvoy",
         "Jenny Wright",
         "Kevin McKeon",
         "Bob Hoskins",
         "David Bingham",
         "Ellis Dale",
         "James Hazeldine",
         "Ray Mort",
         "Margery Mason",
         "Robert Bridges",
         "Michael Ensign",
         "Vincent Wong"
      ],
      "imdbMovieId": "0084503",
      "originalTitle": "Pink Floyd: The Wall",
      "genres": ["Music"],
      "youtubeTrailerIds": [
         "ZIhW1XIAY9M",
         "2DjTytB1Smo"
      ],
      "plotSummary": "A troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
      "tmdbMovieId": 12104,
      "avgRating": 3.71171,
      "releaseYear": "1982",
      "numRatings": 7529,
      "posterPath": "/jshxdvf8A7oQqBAH3GFwXRwDyCX.jpg"
   }
}