{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0112364",
      "video": false,
      "title": "Angela",
      "recommendations": [
         41747,
         199291,
         3010,
         100017,
         41499,
         60158,
         42088,
         102691,
         24826,
         32086,
         45614,
         45167,
         50071,
         95866,
         13432,
         25112,
         163957,
         47889,
         145623,
         90042
      ],
      "backdrop_path": "/rpZ6VoHMWDE2SJrGo4UV2JkgM1O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "52fe44de9251416c9101faaf",
               "name": "Miranda Rhyne",
               "profile_path": null,
               "id": 143151,
               "order": 0
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "52fe44de9251416c9101fab3",
               "name": "Charlotte Eve Blythe",
               "profile_path": null,
               "id": 196180,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Mae",
               "gender": 1,
               "credit_id": "52fe44de9251416c9101fab7",
               "name": "Anna Levine",
               "profile_path": "/A3oxT1n8ecpl0uYomHaMUWGBivu.jpg",
               "id": 3711,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 2,
               "credit_id": "556764f992514156bb00027d",
               "name": "John Ventimiglia",
               "profile_path": "/ws3R1TndkITQMGBariX3UaUjqXP.jpg",
               "id": 87707,
               "order": 3
            },
            {
               "cast_id": 22,
               "character": "Sam",
               "gender": 1,
               "credit_id": "56e6b76a92514115a200332c",
               "name": "Io Tillett Wright",
               "profile_path": "/dsRmZCQULTB1KihfAoQrEzEewxw.jpg",
               "id": 1590957,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44de9251416c9101fa51",
               "name": "Rebecca Miller",
               "profile_path": "/gegphPh4ITZPYIuVrhigTLRD3C2.jpg",
               "id": 41670,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44de9251416c9101fa57",
               "name": "Rebecca Miller",
               "profile_path": "/gegphPh4ITZPYIuVrhigTLRD3C2.jpg",
               "id": 41670,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44de9251416c9101fa5d",
               "name": "Ron Kastner",
               "profile_path": null,
               "id": 234846,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101fa63",
               "name": "Lemore Syvan",
               "profile_path": null,
               "id": 234847,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44de9251416c9101fa69",
               "name": "Michael Rohatyn",
               "profile_path": null,
               "id": 105669,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44de9251416c9101fa75",
               "name": "Melody London",
               "profile_path": null,
               "id": 6406,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44de9251416c9101fa7b",
               "name": "Cindy Tolan",
               "profile_path": null,
               "id": 119179,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe44de9251416c9101fa81",
               "name": "Daniel Talpers",
               "profile_path": null,
               "id": 234848,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101fa87",
               "name": "Caroline Seckinger",
               "profile_path": null,
               "id": 234849,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101fa8d",
               "name": "Todd Thomas",
               "profile_path": null,
               "id": 234850,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101fa93",
               "name": "Valerie Gatchell",
               "profile_path": null,
               "id": 234851,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101fa99",
               "name": "Kelly Gleason",
               "profile_path": null,
               "id": 234853,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101fa9f",
               "name": "Todd Thomas",
               "profile_path": null,
               "id": 234850,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101faa5",
               "name": "Glenn Carbutt",
               "profile_path": null,
               "id": 234854,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe44de9251416c9101faab",
               "name": "Lemore Syvan",
               "profile_path": null,
               "id": 234847,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 1,
               "credit_id": "56258351c3a3680e10013061",
               "name": "Ellen Kuras",
               "profile_path": "/4q0al0rnELLMn9vt9sMyAEqfxeo.jpg",
               "id": 313,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.748472,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32622,
      "vote_count": 10,
      "budget": 0,
      "overview": "A ten year old girl named Angela leads her six year old sister, Ellie, through various regimens of 'purification' in an attempt to rid themselves of their evil, which she believes to be the cause of their mother's mental illness. Precocious, to say the least, Angela has visions of Lucifer coming to take her and her sister away, and one of her remedies for this is for them to remain within a circle of their dolls and toys until they see a vision of the virgin Mary come to them. But such thinking can only lead to an ending befitting of her own mental state.",
      "similar": [
         11421,
         376660,
         112160,
         244772,
         376867,
         258480,
         36040,
         43923,
         12793,
         45153,
         27586,
         8272,
         10735,
         11216,
         8967,
         84892,
         858,
         14,
         141,
         598
      ],
      "original_title": "Angela",
      "runtime": 99,
      "poster_path": "/dw5RWgSSDV5h3ZKS0oSzPe6A26p.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-01-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rebecca Miller"],
      "runtime": 99,
      "synopsis": "Ten-year-old Angela ( Miranda Rhyne), her six-year-old sister, Ellie ( Charlotte Eve Blythe), and their parents Mae ( Anna Levine) and Andrew ( John Ventimiglia) move into a new house. It is clear that Mae and Andrew, former musicians who have left the business, seem to be having marriage problems. Mae also appears to be slipping into mental illness as her mood swings from depression to manic happiness. Angela believes the reason for her mother's bad moods is the girl's sins. She comes up with stories and magical rituals designed to purify herself and Ellie so that her mother will become well. She creates these rituals by snatching pieces of different religions and folk stories she has heard and tries to assemble them into something that makes sense to her. (Typical of these rituals is sitting in the circle of toys watching for the Madonna or heading down to the local pond to bath naked and cover themselves in mud) She has a vision of Lucifer ( Peter Facinelli) as a beautiful winged angel on top of her bedroom dresser and fears he will take Ellie and herself to hell. Her father is forced to commit her mother to a hospital after she attempts suicide. In order to watch the girls during the day while he works he engages the services of a pregnant, but unmarried, teenager named Darlene ( Hynden Walch). Darlene takes the girls back to her parent's house, but suddenly goes into labor and Angela and Ellie slip out of the house during the confusion. Angela then takes her sister on a journey through the neighborhood looking for signs that will lead them to heaven. As they meet people in the neighborhood Angela pronounces them either to be bad or good angels. She thinks the good angels will help the girls find the way to heaven. By evening the children reach a local carnival where they run into a child molester ( Henry Stram). Angela pronounces him a good angel and eagerly follows him to a secluded location where he kisses her. Her willingness to do anything he commands, however, spooks him and he takes off without hurting the children. The girls find their way back home that night to an upset father. He is angry at Angela, but also realizes that part of the problem is that he has not been around for her. He tells her the next day they will do whatever she wants and is perplexed when she chooses to be baptized at a church service run by the a local preacher ( Vincent Gallo) held at a nearby river. Angela sees this as another way to cleanse herself of sin and get her mother back. Andrew and the girls go to visit Mae at the hospital, but Mae is angry at Andrew for committing her and refuses to talk to him. The visit is cut short to the disappointment of the girls. Angela thinks she has finally found a way to cleanse she and Ellie of sin and takes her sister down to the river where she was baptized. The girls submerge themselves in the water, but Angela, in her enthusiasm to get herself clean of sin, goes too deep and is swept away by the current and drowns as Ellie watches. Ellie, watching her sister from the river, suddenly and inexplicably, finds herself magically levitating in the air. The film ends.",
      "writers": ["Rebecca Miller"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112364/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1OTIyODc1MF5BMl5BanBnXkFtZTcwNzUxMjkzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Miranda Rhyne, Charlotte Eve Blythe, Anna Levine | See full cast and crew »"],
      "reviews": [
         "The two girls playing the lead parts here are total amateurs who act better actors' studio veterans. 'Level of belief beyond what any adult actors could achieve' is right, as Rebecca Miller, the director and writer, put it herself in her introduction on IFC. 'Jessica' is the story of a sort of modern day, adventurous, 'Huckleberry Finn type 10 year old girl living in the boondocks (Poughkeepsie?) with parents who are apparently former aspiring entertainer/artists who have now resigned themselves to the loss of their dreams and are having some weird, not quite clearly stated (but better for it being so)problems in their relationship. The mother succumbs to mental illness and Jessica, in order to cope creates an imaginary universe of 'order' based on the odd mixture of beliefs she's been taught in the (Christian Scientist?)household. Her only disciple is her little sister Ellie who follows her around as they do things to absolve themselves from whatever 'sins' they have committed, and 'go to heaven.' The wonderfully eccentric plot is beside the point though, because what emerges here is a unique perspective from the vantage point of a (quite mature but not vulgar) 10 year old, which automatically takes the viewer back to the forgotten soul of the 10 year old in themselves (not the silly Star Wars junkie type 10 year old soul, but the unspoiled , down-to-earth-in-its-flights-of-fancy, ten year old imagination that exists to whatever degree in all kids before it is forever eradicated). This is not easy; it is not like making a Disney movie. It requires super-involved naturalistic acting on the level of Brando and DeNiro from children. What Miller knows to her great credit is that children are much more likely to become 'themselves living in a different world' and therefore, a 'character' because they do not yet have the inhibitions that block most adult actors from believing the film world is real! The film world is as 'real' to them, as anything else once they get used to it. Jean-Pierre Leaud (for instance) has never again achieved the level of realism, as an experienced adult actor, that he did in 'The 400 Blows.' I'm glad I recorded this beautiful little film (since it's not available on video and is only shown once in a long while on IFC)because it clearly belongs in the same class of No-BS movies about childhood exemplified by 'The Little Fugitive,''Forbidden Games,''400 Blows,' and 'Au Revoir Les Enfants.'",
         "This is an amazing if bizarre film. The acting of the two little girls is superb and far surpasses those of child actors in big budget studio films. I've read some disturbing posts accusing this film of child exploitation, particularly in the use of nudity. The nudity in this film is as innocent as a baby on a bearskin rug, but too many narrow-minded morons with internet access confuse this with pornography. The use of nudity in this film is a bit artsy, but very natural and represents the only beauty in these girls lives. Swimming nude with their mother the only time in their lives they've experienced joy. But the religious views of Angela makes her see herself as sinful, and her sister as unclean. This film could have been improved by more nudity to show how this budding adolescent views her own body. She already has a negative view of sexuality. But it's an issue no American filmmaker would dare explore, and I don't blame them. This is where the film becomes a near-satire of the dangers of blind faith in fear-based religions. This view of sin and uncleanliness leads Angela down a dangerous path but in her innocence, she doesn't view her actions as having negative consequences on her sister. Without giving any spoilers, Ellie experiences true freedom at the end only by experiencing, in the director's words, \"an intense emotional experience.\" The only negative comment I have is I already know ahead of time how society views films of this nature. I'm surprised to see that few religious nuts who have seen this film never recognized it as a criticism of their faith. No one seems to be able to get over the sight of a naked baby to be able to do that. tlyoung88",
         "ANGELA whisks the viewer away into the nightmare of a young girl threatened with the loss of her very world through the crumbling psychology of her mother. Rebecca Miller's film brings thoroughly to bloom the essence of a dangerous imagination which plays out like a Greek tragedy in the lives of Angela and her little sister on a quest to save themselves from the devil. The devil himself white as chalk and winged appears to warn them that he soon will claim the family. A helpless father cannot bind together the broken bridges and fallen stars of his wife, a Marilyn Monroe-like singer who can only perpetuate the failures of her life, spreading them like termites to envelope any stability her family could muster. It seems then to ANGELA that she in her innocence must bear that burden and find by way of a stray horse a black cat who she believes give her messages to where she can find the holy grail of her family's salvation, and this to a desperate end.",
         "Beautifully conceived and executed, this movie touches on something rarely seen\u0097the testing and rituals imagined by a child to address the destruction of the world she knows. Angela (Miranda Stuart Rhyne) senses the presence of sin and angels in the house where her mother Mae (Anna Levine) is falling deeper and deeper into madness as their father (John Ventimiglia) watches helplessly. She and her little sister Ellie wander through the neighbourhood, meet a lot of strange people, and try to find a way to clean their souls of sin, ultimately with tragic results. They summon the Virgin Mary, but the one who hovers outside the window is probably not genuine or safe. The moments when their mother cycles back to something approximating normal make the girls happy again, but these moments do not last and the happy face becomes drawn and stricken. The sleepwalker next door, always checking her mailbox at night, is not an angel and cannot tell Angela the way to heaven. Angela is drawn to pity Lucifer, who lets her see him pale and writhing in the cellar, pleading softly, the stumps of his wings still bleeding. The river where simpler people are baptized cannot help her as she tries to expiate for sins that she does not understand and that she has never committed. The young actor who plays Angela is riveting, her sister open and appealing, the mother a powerful example of the dissolution of personality, the father gentle but strained far beyond his limits. The key concept--that children faced with unbearable facts, can internalize them and try to bear a family's burdens, and that the intelligent, sensitive, and imaginative child is more likely to enter into this struggle completely--is brilliantly conveyed.",
         "Rebecca Miller's haunting tale of a young girl driven by her religious obsessions into a frightening world of hallucinogenic images and superstitious delusion. There are touching performances by the two principal girl actors, Miranda Stuart Rhyne and Charlotte Eve Blythe. Rhyne, in particular, is engaging as the young protagonist caught in a heavenly struggle between good and evil to save her mentally ill mother. She convincingly portrays Angela as a determined and feisty but naive and vulnerable child in equal measure; someone who is headstrong but literally open to abuse. There is a fine director's commentary on the DVD narrated by Miller exploring the themes and motivations that went into the making of the film.",
         "I caught ANGELA on IFC a couple of years ago; it's been in the back of my mind since then. ANGELA is about two young girls who create their own realities in order to deal with the painful reality of their mother's manic depression. It pinpoints and explores the relationship between the interior self and the subjective world--the process by which we create meaning when meaning runs riot in the \"objective\" world. Its direction by Rebecca Miller is impeccable -- she coaxes sensitive, complex performances out of each and every character, most notably in the young protagonist and in her even younger sister. Such fine performances are a tribute the script, as well. From cinematography to art direction to costumes, it manages to convey a truly unified, important, tender and thought-provoking vision... The world would be a better place with more films like this one. Thank you, Ms. Miller!",
         "The movie Angela, although entertaining in its beginning as a lyrical commentary on the precariousness of childhood, eventually puzzles and disappoints as it declines into David Lynch-like lines and imagery that really don't add anything (except perhaps atmosphere) to the film. In the first half of the film, Rebecca Miller provides us with glimpses and feelings of childhood that trigger vague remembrances of half-forgotten feelings of our own childhood -- the seemingly contradictory juxtaposition of the helplessness of being a non-adult forced to deal with adult problems (e.g., irresponsible or sick parent), with the powerful strength that comes from an ability to believe in worlds that cannot be seen. Unfortunately, the second half of the movie degenerates into cryptic dialogue and confusing imagery and scenarios that are reminiscent of Lynch at less than his best. Mixed in with an increasingly prominent religious-hysteria-in-young-girl story line, the movie just left me feeling annoyed that I'd invested my time in such an unsatisfying film. The main character also began to alienate me, and ultimately cause real antipathy in me, during this second half, where she continues to drag her sister along in her quest for salvation, appropriating other people's property (e.g., horse, family's picture) without compunction because they are \"signs\" of some holy grail that only she can detect. And although this may seem contradictory to my earlier comment about the cryptic dialogue and imagery, I found the second half to be much too intellectualized. It seems that the filmmaker was trying to tie in the fall of Satan/Lucifer with the fall that every human must experience in his/her maturation process -- through the realization of one's sexuality (signified by Angela's clothing and a particular event), and through the realization of one's own mortality (signified by Angela's search for the way to heaven). But I found these efforts to be generally unmoving (perhaps because they were so confused) and thus, as previously stated, ultimately taking away from the enjoyment of the movie. (Also, I thought a 10-year-old was a bit too young to illustrate these themes, and the film would have been better off staying away from them altogether.) Consequently, the latter half of the movie became a rambling essay on the painful awakenings each child must experience on the road to adulthood, rather than the poem or short story it could have been on the terrible beauty of childhood in an imperfect world.",
         "I happened to see this on late night swiss TV(!); as far as I'm aware it was never released in Europe, where it would surely strike a note. Anyway: beautiful in every respect, true poetry in the photography and styling, the two girls are spellbinding, the whole thing is magical. Complimenti to R. Miller - eagerly awaitng your next movie.",
         "After a slow start this film was like throwing a pebble into still waters and watching the ripples widen. Written, produced and directed by Rebecca Miller with insight, sensitivity and humour there are strong overtones of the magical and the sinister, the angelic and the devilish and performances from the two child actors which are entrancing. The sisters, aged nine and six, create a world of fantasy which is partly induced by longing for a happy family life and partly by a desperate desire by the older girl to find salvation through spirituality. Their mother, a pale and ravaged shadow of her former self, with distinct similarities to Marilyn Monroe (who was married to Arthur Miller, Rebecca Miller's father) barely notices the girls as they drift in and out of her line of vision and her drunken haze. Their father is totally focused on her unpredictable behaviour and his job in a car scrap yard. There is a strong sexual frisson between the two. When the film starts we see the family move in an old pick- up truck to a rambling and abandoned house with metal beds and dirty curtains. Through a grill in the floor the girls watch their parents making love below, a scene of mystifying and disturbing violence. \"It looks as if it hurts\", the older sister says to her little sister when she tries to prepare her for when she has to kiss boys and \"do it\" in order to have a baby. The little sister is, as is the case with siblings, in awe of her big sister and hangs on her every word, believing the increasingly bizarre and black rituals that she is told she must perform in order to \"Go into the Big Nothing\". There are terrifying moments, funny moments and wonderful cameos - like the next door neighbour who sleep walks every night and looks for a letter in her mail box, always dressed in her nightie and with curlers in her hair. There is a wonderful scene of a baptism in the nearby lake and a night time visit to a fairground where a young man with dangerous intentions almost gets his way. I found it riveting, worrying, delightful, believable and a completely brilliant portrayal of the power of the imagination that children have, which is sadly so little encouraged.",
         "This is a complex story about insanity, and the thin line between insanity and religious superstition. Two little girls are neglected by their parents, and the older girl (Angela) imagines or hallucinates seeing and talking to the devil. The younger girl has a scary moment imagining or hallucinating too. Nobody teaches these kids about reality, and in the end that lack of attention becomes a horrible disaster. The ending has such impact that the second time I saw the film I turned it off before the ending. The girls are absolutely adorable and the photography does them justice. There is one nude scene (body suits?) that is completely innocent. The two girls are portrayed realistically most of the time, so that you don't really mind the occasional lapses in realism. The children are so lovable that the ending is doubly tragic: you want the story of their lives to go on forever. A great scene is when the two girls sneak away from the adults, find their way to a carnival, and meet a young man who is apparently a pedophile. They unwisely follow him to a somewhat secluded place, and he kisses Angela. But the child imagines he is an angel, and tells him \"I know who you are.\" The poor guy is frightened to death that he's about to be arrested and runs away! There are many other great moments of comedy and irony in this film. Despite the lack of high-budget action or special effects, there isn't a boring moment in the whole movie. The writer/director is a creative genius, and the music is beautiful too! - Frank Adamo, author of the documentary \"Girl Becomes Woman.\""
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Tree Farm Productions"],
      "summaries": ["A ten year old girl named Angela leads her six year old sister, Ellie, through various regimens of 'purification' in an attempt to rid themselves of their evil, which she believes to be the cause of their mother's mental illness. Precocious, to say the least, Angela has visions of Lucifer coming to take her and her sister away, and one of her remedies for this is for them to remain within a circle of their dolls and toys until they see a vision of the virgin Mary come to them. But such thinking can only lead to an ending befitting of her own mental state."],
      "budget": 0
   },
   "movielensId": 130,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": "2002-11-26",
      "directors": ["Rebecca Miller"],
      "runtime": 99,
      "movieId": 130,
      "title": "Angela",
      "mpaa": "",
      "actors": [
         "Miranda Rhyne",
         "Charlotte Eve Blythe",
         "Anna Levine",
         "John Ventimiglia",
         "Io Tillett Wright"
      ],
      "imdbMovieId": "0112364",
      "originalTitle": "Angela",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["cooYPruKl78"],
      "plotSummary": "A ten year old girl named Angela leads her six year old sister, Ellie, through various regimens of 'purification' in an attempt to rid themselves of their evil, which she believes to be the cause of their mother's mental illness. Precocious, to say the least, Angela has visions of Lucifer coming to take her and her sister away, and one of her remedies for this is for them to remain within a circle of their dolls and toys until they see a vision of the virgin Mary come to them. But such thinking can only lead to an ending befitting of her own mental state.",
      "tmdbMovieId": 32622,
      "avgRating": 3.16667,
      "releaseYear": "1995",
      "numRatings": 45,
      "posterPath": "/dw5RWgSSDV5h3ZKS0oSzPe6A26p.jpg"
   }
}