{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114089",
      "video": false,
      "title": "Parallel Sons",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Seth Carlson",
               "gender": 2,
               "credit_id": "52fe4ccdc3a36847f823f461",
               "name": "Gabriel Mann",
               "profile_path": "/zxnzL9nXYJ4hja69CG3LTJJFatG.jpg",
               "id": 32458,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Knowledge Johnson",
               "gender": 2,
               "credit_id": "52fe4ccdc3a36847f823f465",
               "name": "Laurence Mason",
               "profile_path": "/lYWBLjfpeZS84FhwzrBWFMe3c3C.jpg",
               "id": 65141,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sheriff Mott",
               "gender": 2,
               "credit_id": "52fe4ccdc3a36847f823f469",
               "name": "Murphy Guyer",
               "profile_path": "/vOuj13cuNCpKTewqN0pBG36Il4l.jpg",
               "id": 155547,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Peter Carlson",
               "gender": 0,
               "credit_id": "52fe4ccdc3a36847f823f46d",
               "name": "Graham Alex Johnson",
               "profile_path": null,
               "id": 1161700,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Kristen Mott",
               "gender": 1,
               "credit_id": "52fe4ccdc3a36847f823f471",
               "name": "Heather Gottlieb",
               "profile_path": null,
               "id": 153867,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Marty",
               "gender": 2,
               "credit_id": "52fe4ccdc3a36847f823f475",
               "name": "Josh Hopkins",
               "profile_path": "/4FF6p6G6SAUDJcfOx6GSFQrfTfq.jpg",
               "id": 31532,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Francine",
               "gender": 0,
               "credit_id": "52fe4ccdc3a36847f823f479",
               "name": "Maureen Shannon",
               "profile_path": null,
               "id": 197607,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Sally Carlson",
               "gender": 0,
               "credit_id": "52fe4ccdc3a36847f823f47d",
               "name": "Julia Weldon",
               "profile_path": null,
               "id": 121955,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ccdc3a36847f823f483",
               "name": "John G. Young",
               "profile_path": null,
               "id": 227875,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ccdc3a36847f823f489",
               "name": "John G. Young",
               "profile_path": null,
               "id": 227875,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ccdc3a36847f823f48f",
               "name": "Matthew M. Howe",
               "profile_path": null,
               "id": 56221,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [],
      "popularity": 0.605232,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 168450,
      "vote_count": 1,
      "budget": 0,
      "overview": "Seth is a youth with artistic leanings, a fascination with Black pop culture, and a dead-end life in an Adirondack village. He's alternatively sensitive and brutal with Kristen, who wants a sexual relationship that he explosively rejects. Late one night, as he's closing the cafe where he works, a young Black man attempts to rob him at gun point but faints from illness. Seth takes the man, Knowledge, an escapee from a nearby prison, to a family cabin where he nurses him and they begin a tentative friendship. When the sheriff learns of Seth's harboring a fugitive, a confrontation looms. Relationships between fathers and their children dominate the subplots.",
      "similar": [],
      "original_title": "Parallel Sons",
      "runtime": 93,
      "poster_path": "/dJELQa4E08UrkKhO7q1ySWqkUmO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John G. Young"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["John G. Young"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114089/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxMTc4NjgzN15BMl5BanBnXkFtZTcwNTcyNTY1Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gabriel Mann, Laurence Mason, Murphy Guyer | See full cast and crew »"],
      "reviews": [
         "You can count the number of gay films that have featured black actors as main characters (I actually know of four: two of which were documentaries and two were German films by Fassbinder). That's enough reason to make anyone sit up and take notice of this film even if it were bad. But the sad thing - in correlation to this obscure rating at IMDb - is that this is not a bad film. It's actually quite good. A young white male is having a hard enough time being gay in a rural town, on top of that he is obsessed with Afro-American culture, and African-American men. When a black man does show up on the lam from the law, the white guy takes him in and cares for him (the black man had been shot escaping from the police). This plot is in essence sort of an old-fashioned fairy tale, usually fashioned for a lonely young woman who takes in the misguided but non-dangerous criminal, nourishing him back to health. But despite the rather pat plot (why does the black guy always have to be a criminal?), there is an authenticity to the characters and to the town that surrounds them. You feel their desperation and sense of alienation. It's an old-fashioned movie with a 'modern' sensibility, but it thankfully never gets self-conscious about its black-gay twist. It's too busy being honest to the emotions of the characters (to all the characters - no one in the small town is stereotyped). At a time when gay films are becoming as bland and predictable as Hollywood films, and black films assume there are no black men who are gay, this film is a very bold, original experience.",
         "This is a very underrated drama about an encounter between two young, gay men, one black, one white, in a mountain town in New York's Adirondacks, in which the \"parallels\" between the two men's lives, and their tragic outcome plumb depths of several fundamental issues: growing up gay in a hostile society, racism, gun violence, and adolescent independence. While the sleepy little town's exterior calm is shattered by the appearance of a black escapee from a state mental facility for convicts, this same escapee provides a solution to Seth Carlson's search for his deepest yearnings. At the same time, Seth provides a solution for the escapee's (Knowledge's) life-and-death emergency, bringing the two together through an amazing process of derring-do and cultural and sexual bonding. The story is told with just enough hometown realism to make it thoroughly believable, if ultimately tragic. The two main characters are acted with stellar sensitivity by Gabriel Mick (Seth) and Laurence Mason (Knowledge). Mick's casting is particularly apt. The film takes full advantage of the glorious mountain setting as well as the rural mores and the isolation of its small-town, upstate subject community. This film is a must-see for all young, gay American men!",
         "I never give a film 10 stars, as I have yet to see the perfect movie. But if ever a film deserved 9 stars, this is it. The basic themes of this film are so subtle as to be almost imperceptible, and I will leave the individual to draw their own conclusions. Arguably, its primary message may be a simple morality tale on the consequences of both internal and external homophobia, but, like any good film, there are other lessons and conclusions to be drawn, depending upon the viewer's own opinions and experience. The script is extremely lean, and although we are presented with enough information to make the plot crystal clear, I was thankful to the end that it avoided the clutter of too many details. The characters are drawn so skillfully, and the story told so plainly, that I was amazed at the amount of story, drama and conflict that the filmmaker was able to squeeze into 93 minutes of screen time. By the end, I was exhausted, exhilarated, outraged, moved and thoroughly satisfied. I had to think about what it all meant, but after replaying the film in my head after it was over, I sat back completely astonished at the talent of all involved in this extraordinary film. Many of the scenes depicted in this movie would have been totally unbelievable in the hands of less skilled filmmakers. Too often films that credit both writing and directing to the same person wind up as a narrow opinion piece or worse; the sharing of both writing and directing duties frequently signifies an amateur production. Even if well produced, the result all too often comes off at best as a narcissistic indulgence. Occasionally, a film is enriched by one person assuming the dual role of screenwriter and director, as any film can indeed benefit greatly from having a director who wholly appreciates the writer's vision. Happily, this is the case with Parallel Sons. Many times during the unfolding of the story, I caught myself musing at how ridiculous many plot points were, and at the same time, marveling at the utter believability of it all. It is also easy to misinterpret the climax as standard melodrama; it took a minute for me to realize that the tragic ending had more to do with intent than accident, and it was almost as an after thought that I managed to reconcile seemingly unimportant revelations from one key scene with the shattering climax. Suddenly the meaning of the title became clear, and my satisfaction with this gripping piece was complete. There is the danger that many will be unable to appreciate this timely and innovative story, but those who do are in for a thought provoking experience. If I have one quibble with this picture, it was not with the film itself, but the DVD packaging. Once again we have a film that is being marketed aggressively to a gay male audience, and once again the distributors have found it necessary to place a photo of a naked muscular torso on the box, as if gay men could not consider purchasing a film for its dramatic intensity unless it also offers a naked hunk or two. In Parallel Sons, it's absurd; there is no one in this film who remotely resembles the beefcake on the cover. I didn't expect that there would be, and having read reviews and a synopsis of the plot before I bought it, I had no expectations of any erotic content. One more time I would like to point out that I buy comedies to laugh and documentaries to learn and dramas to be emotionally and intellectually stimulated. It's an insult to assume that I would not purchase a film in any of these genres unless it included a generous helping of eye candy.",
         "The premise of PARALLEL SONS seems a bit of a stretch on first hearing. Seth, a white boy from a small Adirondak town is besotted with Black culture. He is direction-less, somewhat artistic and grieving for his late mother. One day, Knowledge, a Black man escaped from a correctional institution, stumbles into his small town after being shot in the arm during his escape. Seth harbors Knowledge in his mother's cabin in the woods, where the two slowly begin to appreciate their differences and a friendship emerges. What makes this 'far fetched' premise so compelling is the excellent acting and direction. The script is sparingly written, leading the viewer through the story without over-explaining every detail. The sexuality of the two is also beautifully handled, with the most intimate scene one of quiet confessions, not steamy sex. The film's final reel takes on a decidedly Shakespearean tone, as the fated pair must face the consequences of their actions. PARALLEL SONS manages to take a somewhat specific story and shed some light on important facets of human relationships through solid portrayals, sensitive writing and insightful direction. Definitely worth a look!",
         "At the end of this movie I sat in silence absorbing the impact of the movie. Although I have only seen the movie once, back in 1996, it still stays with me. It is a story that is beautifully filmed and very well told. It is impossible to describe the details of this movie other than to say that it struck me as very true to life.",
         "PARALLEL SONS is a very fine piece of work, a film ahead of its time, a film that may yet surface in the theaters since the success of 'Brokeback Mountain'. It deserves that kind of attention. Writer Director John G. Young (The Reception) takes on razor-sharp issues, molds them in a natural, non-exploitational way, and finishes his message with a calm clap of thunder. This little film contains more food for thought and hopefully for discussion than most of the last ten years since it was first released. Seth Carlson (Gabriel Mann) lives in the Adirondacks in a little town closed off form progressive society. He is a gentle soul, a closeted gay out of necessity, a budding artist and a young man infatuated with African American culture, so much so that he wears his blond hair in dread locks and paints muscular Black men and African American symbols. His father barely tolerates his oddities, his little sister shares his secrets, and Seth longs to leave the choking little town for New York City. Seth briefly views a Black man in custody in the sheriff's car: an eye to eye connect occurs. That night in the diner in which Seth works the Black man Knowledge Johnson (Laurence Mason) sneaks into the diner and robs Seth at gunpoint, only to collapse from a wound inflicted during his escape from a correctional facility. Seth is drawn to Knowledge, and when Knowledge faints, Seth sequesters him in a little cabin where he nurses him back to health. In the process of the healing the two men bond and become sexually committed to each other. Knowledge sees his only hope for survival as an outlaw being an escape across the Canadian border and the two plan for this adventure, Seth suffering setbacks from a town turned against him, and it is in the escape attempt that the tragedies occur that leave the story with many subtexts. The film is beautifully shot by Matthew M. Howe and scored by Emile Menasche, but it is the acting skills of Mann and Mason that allow director Young to make this understated film work so well. The supporting cast is also very good, each underplaying roles to the benefit of the progression toward the devastating ending. By remaining to a sensitive story, economically written for the screen, Young is able to bring the audience to face some frighteningly real issues about bigotry and prejudice that tangentially includes color and sexuality. Highly recommended, Grady Harp",
         "This movie has a very deep meaning to a person who has lost a love a fell in love again. A few twists and turns towards the end. .....The ending is a scorcher!!!! Probably, in my opinion, one of the best alternative lifestyle,interracial love movies of all time.",
         "I myself am half way through writing a screenplay that I hope to direct, and I was tremendously inspired by Parallel Sons. The story is deep and multi-layered, without being confusing, it treats the audience with respect. The DVD cover image does not do this movie justice, as movie is everything more than soft porn. I will not try and categorize Parallel Sons as a character study or put it in any other genre. All the characters had soul, with the revelation of Seth and Knowledge being the most developed, and occurring much like when one gets to know real people in real life. The story revealed a lot about the world too, and particularly about race relations in the USA and the moral dilemmas it breeds for it's citizens. A picture paints a thousand words. I could watch this one again straight away. Obviously for all this to work the acting, music, sound and production design have to be top notch. A lot of love went into making Parallel Sons.",
         "I really didn't know what I was going to see - and I never read IMDb reviews before watching - but this movie really did something to me. I think I could end up in the same situation as Seth did (well... 35 years ago...). Yes, I do think so. Forget about the \"black music/culture/people fascination\" of Seth, this is just a love story, as it could happen everywhere. The 2 main characters did a very, very good job, very intense. I also liked the little sister... The story is very believable, the circumstances also. This is just a beautiful story, in which the 2 protagonists happen to be gay, and in which one happens to be black, the other white... A very entertaining movie, well worth your time.",
         "Audacious in its mawkishness and implausibility, this gay-themed indie is about a small-town \"wigger\" in upstate New York with a thing for street art, hip hop and a taste for thugs, who harbors an escaped black fugitive who holds him up at his diner job, threatens to kill him and then collapses from blood loss on the floor. Instead of calling the police, the white boy shelters the fugitive and nurses him back to health. Which is what ones does when someone hot threatens you with a gun. Oh, and the fugitive just happens to be gay, too. During his convalescence, they separately harbor erotic attraction toward one another, though they only consummate it late in the movie after the wigger breaks his leg falling from a cliff as they're escaping the police crossing the border with Canada. I did not make that up. They bond by sharing painfully, glacially delivered tragic bits and bobs from their life stories. There are so many absurd plot turns in this movies that I was dizzy from my eyerolls. It's a shame that the script is so bad and the direction so clueless because the cast is not. Halfway way through I checked the remaining time and groaned with boredom."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Black Brook Films",
         "Eureka Productions (II)"
      ],
      "summaries": ["Seth is a youth with artistic leanings, a fascination with Black pop culture, and a dead-end life in an Adirondack village. He's alternatively sensitive and brutal with Kristen, who wants a sexual relationship that he explosively rejects. Late one night, as he's closing the cafe where he works, a young Black man attempts to rob him at gun point but faints from illness. Seth takes the man, Knowledge, an escapee from a nearby prison, to a family cabin where he nurses him and they begin a tentative friendship. When the sheriff learns of Seth's harboring a fugitive, a confrontation looms. Relationships between fathers and their children dominate the subplots."],
      "budget": 0
   },
   "movielensId": 1309,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": "2005-09-06",
      "directors": ["John G. Young"],
      "runtime": 93,
      "movieId": 1309,
      "title": "Parallel Sons",
      "mpaa": "",
      "actors": [
         "Gabriel Mann",
         "Laurence Mason",
         "Murphy Guyer",
         "Graham Alex Johnson",
         "Heather Gottlieb",
         "Josh Hopkins",
         "Maureen Shannon",
         "Julia Weldon"
      ],
      "imdbMovieId": "0114089",
      "originalTitle": "Parallel Sons",
      "genres": [""],
      "youtubeTrailerIds": ["LuvNJVbNqG4"],
      "plotSummary": "Seth is a youth with artistic leanings, a fascination with Black pop culture, and a dead-end life in an Adirondack village. He's alternatively sensitive and brutal with Kristen, who wants a sexual relationship that he explosively rejects. Late one night, as he's closing the cafe where he works, a young Black man attempts to rob him at gun point but faints from illness. Seth takes the man, Knowledge, an escapee from a nearby prison, to a family cabin where he nurses him and they begin a tentative friendship. When the sheriff learns of Seth's harboring a fugitive, a confrontation looms. Relationships between fathers and their children dominate the subplots.",
      "tmdbMovieId": 168450,
      "avgRating": 3.19118,
      "releaseYear": "1995",
      "numRatings": 34,
      "posterPath": "/dJELQa4E08UrkKhO7q1ySWqkUmO.jpg"
   }
}