{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "boy",
            "id": 5202
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "ireland",
            "id": 14985
         },
         {
            "name": "flashback",
            "id": 187844
         },
         {
            "name": "troop ship",
            "id": 208501
         }
      ],
      "imdb_id": "tt0113107",
      "video": false,
      "title": "Frankie Starlight",
      "recommendations": [],
      "backdrop_path": "/yBO6Un72De0bTLVyvCT9xXYux3a.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Terry Klout",
               "gender": 2,
               "credit_id": "52fe488ac3a368484e0fe011",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Frank Bois",
               "gender": 0,
               "credit_id": "52fe488ac3a368484e0fe015",
               "name": "Corban Walker",
               "profile_path": null,
               "id": 567972,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Jack Kelly",
               "gender": 2,
               "credit_id": "52fe488ac3a368484e0fe019",
               "name": "Gabriel Byrne",
               "profile_path": "/lFIH4De52Eg21m7pScPMXezZDUh.jpg",
               "id": 5168,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Bernadette",
               "gender": 1,
               "credit_id": "52fe488ac3a368484e0fe01d",
               "name": "Anne Parillaud",
               "profile_path": "/d1mUo65Q1ZQLpK7idJEG95MMzkX.jpg",
               "id": 57298,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Handy Paige",
               "gender": 2,
               "credit_id": "5460e1740e0a262ca2002ef3",
               "name": "Niall Toibin",
               "profile_path": null,
               "id": 140230,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Senior Customs Officer",
               "gender": 2,
               "credit_id": "5460e181c3a368535800bb19",
               "name": "Owen Roe",
               "profile_path": null,
               "id": 17024,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Young Man In Cinema No. 2",
               "gender": 2,
               "credit_id": "59e1a82b92514172bb00bcde",
               "name": "Colin Farrell",
               "profile_path": "/pgMM9r5ll99RXSmz1J4sj8zaddW.jpg",
               "id": 72466,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe488ac3a368484e0fdffb",
               "name": "Michael Lindsay-Hogg",
               "profile_path": null,
               "id": 125543,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe488ac3a368484e0fe001",
               "name": "Ronan O'Leary",
               "profile_path": null,
               "id": 254800,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe488ac3a368484e0fe007",
               "name": "Chet Raymo",
               "profile_path": null,
               "id": 567970,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe488ac3a368484e0fe00d",
               "name": "Chet Raymo",
               "profile_path": null,
               "id": 567971,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe488ac3a368484e0fe023",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe488ac3a368484e0fe029",
               "name": "Paul Laufer",
               "profile_path": null,
               "id": 56517,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe488ac3a368484e0fe02f",
               "name": "Joan Bergin",
               "profile_path": null,
               "id": 567973,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.184619,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         }
      ],
      "id": 73067,
      "vote_count": 5,
      "budget": 0,
      "overview": "The quirky story of a young boy's adventures growing up with his stunningly beautiful mother and the two very different men who love her.",
      "similar": [
         51828,
         340666,
         83770,
         824,
         44826,
         258230,
         2501,
         2503,
         2898,
         4347,
         167073,
         346685,
         50014,
         2757,
         252178,
         2323,
         23168,
         22971,
         11216,
         11224
      ],
      "original_title": "Frankie Starlight",
      "runtime": 101,
      "poster_path": "/1cPX7MWnEYG21tSdEpWlFygZUwY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Bórd Scannán na hÉireann",
            "id": 1898,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         }
      ],
      "release_date": "1995-11-22",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Sometimes the brightest star is the one that shines within.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Lindsay-Hogg"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Ronan O'Leary",
         "Chet Raymo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113107/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMzU0MzI0OF5BMl5BanBnXkFtZTcwMjI3MzMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Matt Dillon, Anne Parillaud, Gabriel Byrne | See full cast and crew »"],
      "reviews": [
         "This is one of the great \"unknowns\" in the movie world: a great film seen by very few people. I'm still waiting for the DVD but not holding my breath. Thankfully, my VHS is still good. But like anything good, we'd like to share this with others and most people have never heard of this movie. For those sensitive souls who enjoy a fascinating portrait of an unusual person or persons that is both sad and uplifting, this is your ticket. It has both, in spades.....a haunting film you can't forget. It's a tragic tale yet has a happy ending of sorts and leaves you feeling satisfied. What it is, and I can't remember if it is based on real-life situation, is the story of a woman who has a dwarf for a son and what happens to the two of them, beginning in France, moving to Ireland, over to the United States and then back to Ireland. Along the way, the mother, played so sadly by French actress Anne Parillaud (the original La Femme Nikita), gets involved with two men: Gabriel Byrne and Matt Dillon. All three of these adults are really interesting, likable people, but nothing like the dwarf, who is played magnificently by two actors. Alan Pentony plays \"Frankie\" has a child and a more lovable kid would be hard to find. Corbin Walker does a great job of playing the adult \"Frankie.\" Trust me: you will not forget either of them. Walker narrates the film, telling it mostly in flashback style, from his best-selling book. In addition to his mom and the two father-figures in his life, is a short story of Frankie's love affair with astronomy and the stars, hence \"Frankie Starlight.\" The only profane character in the movie is the book publisher who has two short scenes. That, and two quick sex scenes, give it the \"R\" rating. Otherwise, this is wonderful old-fashioned storytelling, the kind that makes you really care about the characters.",
         "Byrne's work, usually excellent, blends in subtly here, works its power through understatement, underplaying. His character's kindness lights and lifts Frankie to the stars, literally and figuratively, but Frankie's star shines brightest. \"Frankie Starlight\" begs description; the type of beautiful, warm story that just isn't made anymore, that isn't believable, even when it's a true story, as this one is. These movies just don't exist, we're told. I liked \"My Left Foot\" which received more critical attention and did better at the box office than \"Frankie.\" But \"Frankie\" -- for no good reason, none I can state --left a warmer, happier impression; maybe because its heroics were less dramatic; it's a simpler story. A \"Little, Big Man\" without cowboys and Indians, and in this case a really little \"little, big man\" -- how do you sell such a film? What's that? He's not an American, either? Too bad. Got art-film house written all over it. Yada yada yada. Yet I want to see \"Frankie\" again -- and then read him, too. Learn a lot more. A fine film, generally low-key, sotto voce -- and so much more powerful because it is.",
         "This is a beautiful movie that captured my heart. Anne Parillaud (the most adorable, most beautiful woman in the world) character in this film is an innocent young girl who seems lost throughout the film searching for something, maybe love. This movie was supposed to be about a dwarf named Frankie when in fact it is really about a lost beautiful young woman named Bernadette searching for happiness. A beautiful but sad movie... This movie deserves an 8 but I give it a 10 out of 10 because I just adore Anne Parillaud and most of her work.",
         "A wonderful story about human triumph over adversity, about good things happening to good people, (after a period of sufficient suffering to make the reward that much sweeter), transcending superficiality and the stupidity of the masses, glimpses into human weakness and vulnerability, super steamy sex, all issues related to growing up: growing up strange, love: real love demonstrated, between strangers, and between family, between lovers, also GREAT acting, historical accuracy, great screenplay, great casting, beautiful camera work, plot pacing, well rewarded suspense, and beautiful people. One of the best aspects of the film is how the general history of WW II was interwoven with the personal experiences of the characters. Highly recommended overall.",
         "Saw this film on TV last night, and was blown away by the performances of Alan Pentony and Corban Walker, as the child and adult Frankie. When I read the credits and saw an Acting Coach listed for them, I guessed they were first-time actors. This was confirmed by the Showcase movie host after the film, and makes their achievements even more impressive. Kudos to director Michael Lindsay-Hogg! Gabriel Byrne was also wonderful - charming and tender - the farewell scene in the park was heartbreaking in its understated simplicity. I'm not a big fan of Anne Parillaud - I saw her in \"La Femme Nikita\" and an amusing American vampire/cop comedy whose title I can't recall - and the charm of that doe-eyed silent gaze wears off after you've seen it a few times. Still, she conveys the mysterious allure necessary for this role, and it's easy to see why these men fall for her. Overall, \"Frankie Starlight\" is a lovely movie, and it's a shame it didn't do better at the box office. Anyone who loves the music of an Irish accent, as I do, will be charmed by that, even if nothing else in this beautiful story (which has a happy ending, by the way!) catches your fancy. Plus, the score under the closing credits was a gorgeous piano and cello combination which kept the mood to the end.",
         "Corban Walker and Alan Pentony are both wonderful (would love to see more performances by both) and give the nuanced portrayals that give the title character life and depth that linger past the end of the movie. Gabriel Byrne also is particularly good as one of the two \"fathers\" that give Frankie all the love and acceptance of which they are capable; the flaws of these men show their compassion that much more clearly. The central figure of Frankie's mother remains elusive (purposefully) and one of her chief motivations is let drop mid-way through the film; but the resolutions of the film are perfect and the astronomy theme provides a setting for most of the actors to portray greater depth for their characters.",
         "Elmer Bernstein's music for this outstanding motion picture is superb. The main character displays courage in the face of what life has given him (dwarfism and family despair). As for the girl he loves and adores in his early life, she too overcomes the horrors of a traumatic experience (seeing her father with another woman) during her early childhood. The supporting cast did just that (magnificent support to make the main characters believable). And for a change, even though there are so many sad moments in the life of Frankie, the conclusion is a happy one for those who persevere. Love doesn't conquer all, but it makes life beautiful.",
         "Spoilers. This is the sort of story that Southern writers used to be good at. Carson MacCullers, say, or Harper Lee, if they'd have thrown in a bit of travelogue. Maybe it comes from living in small, homogeneous communities in which the slightest of individual quirks draw attention to themselves. Somebody is a deaf-mute, or intellectually challenged, or a Jew. And the question the presence of such people raises is an interesting one: How can such marginal persons establish anything resembling normal relationships with others? In Ireland, when it rains gently, it is called \"a soft day,\" and this entire movie is rather like that sort of Irish weather. The story briefly: Bernadette leaves a ruined post-war France on an American troopship and is impregnated on board before disembarking in Ireland, where she gives birth to a dwarf. I don't know that the dwarf really \"stands for\" anything, as did a similar figure in \"The Tin Drum.\" The rest of the film alternates between Bernadette's early abortive attempt to escape her dreary life in Dublin and move to Texas with an ex-soldier who remembered her from the troopship, a nice guy really, and the story, set in the present, of Frankie, her son, who has grown up and become a successful author. After their return to Ireland, Bernadette is depressed and decides to end her distress. Frankie finds happiness with a girl he loved during childhood and now, reencountering her at a book signing, courts briefly and marries. All of the performances are more than adequate. The actor playing Frankie as a child is especially effective, with a frank, open, lovable face and a shock of red hair atop his truncated body and limbs. He's also smart, sensitive, and talented, and it's possible to see easily how he matured into an accomplished artist, though he carries his anguish and self-consciousness with him into adulthood. Bernadette seems to be in an understandable state of shock during the entire story, moved by whim and circumstance rather than deliberation. Matt Dillon's part is less complex than most of the others. He really loves Bernadette and adores Frankie the child and loses them both. leaving him with his own two children and a wife who has the temperament and moral values of a black hornet. The happy ending, if that's what it is, isn't tacked on willy nilly but evolves naturally out of preceding events. It's a nicely done fairy tale. It's low keyed in almost every way and insinuates itself into your involvement only with the passage of a bit of time. Patience is called for. I enjoyed it and, unless you have hunger pangs for explosive fireballs, you may enjoy it too. A warning, though -- these days I find myself enjoying almost every movie that doesn't have high speed car chases and explosive fireballs.",
         "\"Frankie Starlight\" is a sensitive, plaintive, wistful and sometimes ethereal drama about the life of a man and his struggle with dwarfism. The film brings together an solid cosmopolitan cast as it tells the story of Frankie as both a man and a boy with scenes of each interleaved. Though the film is not evocative or compelling, it is mildly entertaining and well shot, directed, and acted. Good easy going stuff with little to fault.",
         "\"Frankie Starlight\" will delight most viewers, and those who love the stars, who appreciate their magic and mystery, will especially like this work. I've just begun to read the novel it's based on, \"The Dork of Cork\" by Chet Raymo. Neither the film nor the novel are based on a true story. They're fiction. So my comments about it being \"true\" -- are untrue. There's much \"of truth\" in the story -- but it must be appreciated for what it is. Corban Walker as Frankie gives an outstanding performance. And there's no question as to Walker's reality. I was correct in writing that \"My Left Foot\" was based on a true story. The error was linking these two films in memory too closely -- plus a little wishful thinking, perhaps. Readers' comments on another site about the novel \"Dork of Cork\" include some, evidently people from Cork or who have travelled there, who were disappointed more about Ireland or Cork wasn't in the book. I don't wish to similarly mis-direct people who like biographical films -- or \"historical re-creations\" -- to \"Frankie Starlight.\" See it and enjoy it, as many will, as a grand, lyrical creation of art. Rewatching recently, I also realized the story was richer than I'd remembered, more complex. It moves through many times and places, across seas and continents. Tales of love and tragedy interweave masterfully. The themes of being exiled and of seeking a place to belong to run throughout. Frankie and his mom each make such a search -- for a true home, both in the cosmos and in the heart."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Bórd Scannán na hÉireann",
         "Canal+",
         "Channel Four Films"
      ],
      "summaries": [
         "This is a story of a man (Walker), suffering from dwarfism, who writes an autobiographical account of his life. In flashbacks, we see how he was conceived to a woman (Parillaud) at the end of WWII as she attempts to smuggle herself to America on a troop ship. Caught, she is put ashore back in her homeland of Ireland where she struggles to bring up her dwarfed child. Then comes an ongoing affair with a man (Byrne) who becomes a surrogate father to the boy, teaching him about the stars and planets... and calling him \"Frankie Starlight.\" After that affair she meets with a man (Dillon) who takes her and the boy to America, but they are misfits in the prairie lands of the West and soon return home to Ireland where the boy grows to manhood as a writer.",
         "This is an enigmatic story of a man (Walker), suffering from dwarfism, who writes an autobiographical account of his life. In flashbacks, we see how he was conceived to a french woman (Parillaud) at the end of WWII as she attempts to smuggle herself to America on a troop ship. Caught, she is put ashore in Ireland where she struggles to bring up her dwarfed child. After a short lived affair with Jack Kelly(Byrne)an officer from the ship she stowed away on, who becomes a surrogate father to the boy, teaching him about the stars and planets... After that affair she meets with Terry(Dillon), a drifter who also remembers her from the ship. He takes her and the boy to America, but they are misfits in the prairie lands of the West and soon return home to Ireland where the boy grows to manhood as a writer. An interesting twist at the end brings it together beautifully."
      ],
      "budget": 0
   },
   "movielensId": 131,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-22",
      "dvdReleaseDate": null,
      "directors": ["Michael Lindsay-Hogg"],
      "runtime": 101,
      "movieId": 131,
      "title": "Frankie Starlight",
      "mpaa": "",
      "actors": [
         "Matt Dillon",
         "Corban Walker",
         "Gabriel Byrne",
         "Anne Parillaud",
         "Niall Toibin",
         "Owen Roe",
         "Colin Farrell"
      ],
      "imdbMovieId": "0113107",
      "originalTitle": "Frankie Starlight",
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": ["2vrYABGERJw"],
      "plotSummary": "The quirky story of a young boy's adventures growing up with his stunningly beautiful mother and the two very different men who love her.",
      "tmdbMovieId": 73067,
      "avgRating": 3.30556,
      "releaseYear": "1995",
      "numRatings": 198,
      "posterPath": "/1cPX7MWnEYG21tSdEpWlFygZUwY.jpg"
   }
}