{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "santa claus",
            "id": 1991
         },
         {
            "name": "millionaire",
            "id": 33626
         },
         {
            "name": "christmas",
            "id": 207317
         },
         {
            "name": "1990s",
            "id": 210608
         }
      ],
      "imdb_id": "tt0117550",
      "video": false,
      "title": "Santa with Muscles",
      "recommendations": [
         35810,
         46963,
         143569,
         39479,
         157036,
         28720,
         120557,
         30709,
         42158,
         61418,
         118991,
         36796,
         38560,
         22976,
         109394,
         78529,
         141822,
         163921,
         89791,
         95083
      ],
      "backdrop_path": "/gjguKG8EbDBbDRz6HDdMBPSp504.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Blake",
               "gender": 2,
               "credit_id": "52fe44799251416c91011fb9",
               "name": "Hulk Hogan",
               "profile_path": "/jDWQ3FLbbPSIHPgfOdmuUaWWnON.jpg",
               "id": 16620,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe44799251416c91011fbd",
               "name": "Mila Kunis",
               "profile_path": "/6Lp9qPkMO740Hcp8NBYZZLWWvJF.jpg",
               "id": 18973,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Lenny",
               "gender": 2,
               "credit_id": "546b6cb8c3a3680d75001df0",
               "name": "Don Stark",
               "profile_path": "/M4zP41qHZvDkIFVJ7YM6v0s7oy.jpg",
               "id": 130129,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Leslie",
               "gender": 1,
               "credit_id": "546b6cc2c3a3680d7d001d4b",
               "name": "Robin Curtis",
               "profile_path": "/pHOmW0od8GD3PUC1Yd1jBDr2aD4.jpg",
               "id": 1819,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Clayton",
               "gender": 2,
               "credit_id": "546b6ccf92514101ef001f0d",
               "name": "Garrett Morris",
               "profile_path": "/2Sd1njRdKzWEHNY2AqFZGTv1xtT.jpg",
               "id": 83187,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "546b6cdd92514117ea001b0a",
               "name": "Aria Noelle Curzon",
               "profile_path": "/efuqPjw5LNmgo43ICBQtAMhkz0l.jpg",
               "id": 1303010,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Taylor",
               "gender": 2,
               "credit_id": "546b6cecc3a3680d7d001d55",
               "name": "Adam Wylie",
               "profile_path": "/qSeYVaE3HKf62J4WQY12mEAKjbz.jpg",
               "id": 21402,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Helen Chu",
               "gender": 0,
               "credit_id": "546b6cf9c3a3680d75001dff",
               "name": "Jennifer Paz",
               "profile_path": "/pRPKfHLrNzke0Mjuz7mOyj3K9Fh.jpg",
               "id": 1386672,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Hinkley",
               "gender": 2,
               "credit_id": "546b6d08c3a3680d6c001d93",
               "name": "Clint Howard",
               "profile_path": "/d9QW5feIgNwDRdkKK1j7gmmOQXT.jpg",
               "id": 15661,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ebner Frost",
               "gender": 2,
               "credit_id": "546b6d18c3a3680d75001e06",
               "name": "Ed Begley Jr.",
               "profile_path": "/au4qlxxeHitgPDHmt7WhWTA7Znb.jpg",
               "id": 42157,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Cop With Bazooka",
               "gender": 0,
               "credit_id": "56ad52419251417e29006e46",
               "name": "Brian J. Williams",
               "profile_path": "/dYm5IuOx12977wMGXOiKpCpXuoD.jpg",
               "id": 203950,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Baldie",
               "gender": 2,
               "credit_id": "5727bae2c3a3681da20009ed",
               "name": "Troy Robinson",
               "profile_path": "/vvF5gwuAyPtbGXGkNJBrz7cSx5m.jpg",
               "id": 1367499,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44799251416c91011fc3",
               "name": "John Murlowski",
               "profile_path": null,
               "id": 110834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "546b6c7892514101e2001f15",
               "name": "Jonathan Bond",
               "profile_path": null,
               "id": 1386669,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "546b6c8292514101f2001f72",
               "name": "Fred Mata",
               "profile_path": null,
               "id": 1386670,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.974272,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31388,
      "vote_count": 25,
      "budget": 0,
      "overview": "Penurious but muscle-bound Blake Thorne has made a vast fortune marketing health food and health supplements. He once was a nice fellow, but as his wealth increases, he becomes increasingly self-centered and decadent. One day, he gets in a great paint-gun fight that goes too far. Blake escapes the cops by running into a shopping mall, quickly donning a Santa Suit and pretending to be St. Nick. A head injury causes Blake to suffer amnesia, and an opportunistic \"elf\" decides to convince Blake that he is indeed Santa. This leads \"Santa\" to help save an orphanage, filled with adorable moppets, from the machinations of a greedy, insane doctor.",
      "similar": [
         9479,
         11395,
         13673,
         11881,
         1585,
         10147,
         13377,
         18147,
         17979,
         323262,
         287903,
         51052,
         5825,
         10872,
         5255,
         772,
         1581,
         8871,
         10719,
         364
      ],
      "original_title": "Santa with Muscles",
      "runtime": 93,
      "poster_path": "/jwDKHs9kempAkOrXY8cvTy90omT.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hit Entertainment",
            "id": 6893,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cabin Fever Entertainment",
            "id": 21304,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cineplex Odeon Films",
            "id": 35535,
            "origin_country": ""
         }
      ],
      "release_date": "1996-11-08",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "He's arrived in the St. Nick of time!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Murlowski"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Jonathan Bond",
         "Fred Mata"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117550/",
      "coverLink": null,
      "actors": ["Stars: Hulk Hogan, Don Stark, Robin Curtis | See full cast and crew »"],
      "reviews": [
         "Hollywood Hulk Hogan. A name synonymous with fake wrestling, baldness, and bad acting. Well, scratch the bad acting; Hulk's acting during a wrestling match is Anthony Hopkins-esque compared to the tripe in this \"film\", and notice I use the term VERY carefully..... After a \"plot\" involving a rich guy hitting his head while putting on a Santa outfit while running from the police {Why didn't he just give up? The guy was supposed to have millions of dollars, you'd think he could spare a hundered for bail}, he wakes up imagining he is, indeed, Santa. As if he couldn't take one look in the mirror and realize Santa is neither balding nor a steroid junkie. Then, of course, there's the usual Stooge-style violence and a precocious Elven helper. Unless you want to share the same fate as \"Hollywood\" Hulk Hogan's acting career, I suggest you skip this and watch Hulk's classic \"Thunder in Paradise\" instead.... wait, did I just say that? Better skip that one, too.",
         "And then you will reach for the nearest dull razor, or butterknife on your property and attempt to gouge your eyeballs out. I've heard through word of mouth how aweful this \"film\" was, which inspired me to make a bid for it on an internet auction. I should have known I was in over my head when \"free, or best offer\" was the opening bid. Paintball with the cops, fierce battles using styrophome candy canes, exploding crystals, an orphanage with only 3 kids-this \"movie\" has it all. If you have the opportunity to give this one as a gift, go for it. That lucky someone in your life will be begging for coal this coming holiday season.",
         "This movie is so bad, it's actually considered cruel and unusual punishment under the U.S. Constitution. I wish I was exaggerating. If you want a Christmas movie, go watch Miracle on 34th Street or something. Just stay far, far, FAR, I can't emphasise this enough, FAR AWAY from this horrifyingly bad film. You've heard the phrase \"So bad, it's funny\"? Well, this transcends \"So bad, it's funny\" and ends up just being horrible.",
         "Let me first say that this is a film which I gave a 1/10 stars, but it was one of those \"so bad, it's good\" types, which is why I must say that it was an enjoyable painful film experience. \"Santa with Muscles\" was just plain bad for a number of reasons... Let's Begin. Acting- You know the acting will be subpar when the star of the film is Hulk Hogan. Hogan is a likeable character, but only in the ring, not the movie industry. You would hope that the director would soften the blow to the movie by placing Hogan in a cast that he could learn from and play off of - but in this case, he was cast in a miserable selection of actors and actresses that undoubtedly regret becoming a part of this movie. All acting was bad, but there were some enormously bad acting jobs by Steve Valentine and Kevin West. Plot- Intro to characters was brief and rediculous. Viewers are supposed to buy into unbelievable situations, and are supposed to relate to characters that could be replaced with cardboard cutouts. So the plot is off to a bad start. It could still recover though... but it doesn't! No surprize. So it is something like this - rich dude goes to mall, hits head, thinks he's santa, saves the day against hapless thugs, finds orphanage with only 3 kids, wants to save orphanage from evil guy, beats people up, hits head (on soft garbage), recruits his staff, kicks butt, saves the day, orphanage now looks like a scene from Richie Rich. RRiiiiigggggghhhhhhhtttttt. Continuity Problems- There are an incredible number of continuity problems in this film. Ranging from car damage, to car order, room setups, time of day, etc. Was there even an editor hired for this film? Other Issues I Had with the Movie- 1. Blake falls down a multi-story trash shoot (which by the way leaves to the floor and not a trash bin) and wakes up seconds later, later he falls into soft trash and doesn't wake up until at least hours later. Hmmmmm... 2. It was so nice that even after her bedtime Sarah manages to get ahold of Blake's santa suit and totally alter it overnight. 3. An orphanage with three kids (unbelievable itself) uses a facility that it could never afford. 4. A white guy plays the sumo-type thug characters. interesting, maybe they were low on cast members. 5. Odd that the state allowed an orphanage to exist in the facility that had open access to old catacobs (complete with plastic skeletons!!), and even more odd that the kids were allowed to have a club in the catacombs by their inresponsible caretakers. 6. Once Blake gets his memory back, he fails to remember his childhood! But luckily, one photo brings it all back. facinating. 7. Frost's posse includes a geologist, a Canadian chemist, and an electifyingly ugly woman. Not to mention a sumo thug, several guys with t-squares as weapons, and a \"doctor.\" 8. Blake stops a truck moving at 40+ miles an hour, or at least it is supposed to be that speed, but the obvious fastforward and then rewind effects didn't work too well. 9. Hapless police carry rocket launchers, fire at will, miss, and then make no attempt to chase after the hummer with a butler, chef, and driver hanging out the top. 10. My favorite... the HORRIBLE one-liners that filled the dialouge of the movie. Bar none the worst was \"Santa Sleigh Me.\" I nearly peed my pants when I heard that. I'll admit, I bought this movie online (used) after I saw it on the IMDB bottom 100. The reviews had me in tears, and I had to experience this movie. Even the reviews couldn't prepare me for a cinema experince of this low quality. It is a poorly thought out, poorly directed, poorly acted, poorly produced, poorly scripted, poorly casted movie that you have gotta see. 1/10 Stars",
         "Okay, first things first. Upon renting or viewing any Hulk Hogan movie, one should never set their sights very high. You have the constants of bad acting, senseless and cartoonish violence, and groan-worthy puns. You can also pretty much expect a super-contrived happy ending. However, even taking these aspects for granted, Santa with Muscles still will leave you stunned. It isn't quite the worst movie I've ever seen (Manos, Hootch County, and Ninja Wars beat it there) but it's definitely down there. The Hulkster stars as Blake Thorne, a big dumb prig with more money than he knows what to do with, so he spends his days playfully tormenting his house-servants. (The 'Stop and smell the roses!' line is a hoot!) Through a ludicrous turn of events, Blake gets amnesia and is convinced by a jerk named Lenny that he is the real Santa Claus. Hijinks, fistfights and eye-rolling sappiness ensue. Watch for two-count 'em-TWO instances of giant candy canes being used as weapons, a horrible song by Hulk and the little whiny girl, the equally stupid 'Blake's rules' and 'Santa's rules', and what is perhaps the most ridiculous McGuffin I've ever seen-but I'll leave that for you to discover. I can only recommend Santa with Muscles if you happen to have great patience and a high threshold of pain. I wondered about half-way through, \"Has this been over 2 hours yet?\"...but despite what you may feel it is only a bit over 1 1/2. Not a very merry way to spend your Christmas.",
         "I am sure most of the posters here are not wrestling fans. Therefore, I will clue you in on a couple of things. Hulk Hogan is an ego maniacal jackass that demands creative control over anything he is involved in. This movie might not have been a classic when it was first written, but I will be fair and say it had average potential(a rating of 5). The movie probably had a different title at first until......Hulkamania arrived. Hulk Hogan has this remarkable ability to turn something good or average into unwatchable garbage. Original title may have been \"When Santa got Rich\" or \"Santa CEO\" or something slightly stupid. Hogan looks at the title and says \"no way brother, my fans don't know nothing about no CEO(the first true words to come out of the mouth of the Hulkster in twenty years). So he called it \"Santa with Muscles\" because no project involving Hogan is allowed to go 5 seconds without referring to the \"24 inch pythons\" After adding scenes where blow up candy canes are used by Hogan with results comparable to the bomb dropped on Hiroshima, Hogan finally has gotten his wish. He ruined what might have been an enjoyable movie experience for two year olds and those who are \"mentally challenged\" or retards as Hogan's faithful redneck fans may call them. I am not surprised at how bad this film turned out. Wrestling fans with half a brain have hated Hogan for years. He exercises creative control when he is told that he is going to lose and this ends up boring anyone with a below average iq on up to tears. Hogan may have turned wrestling into a million dollar industry with a lot of help from the master marketing machine named Vince Mcmahon. Many good people sacrificed their wrestling careers by falling prey to Hogan's trademark \"leg drop of doom\" and now some poor director is probably living under a bridge in Los Angeles damning the day he got involved with Hulk Hogan. Hogan may have helped turn wrestling into mainstream entertainment, but he also singlehandedly destroyed the same industry(his tired act help put WCW into the ground) he helped build by never learning more than three moves. Punch, back scratch, high boot and leg drop. Oops that is four moves. Some things never change. In the ring the bad guy always loses to Hulk via leg drop. In the movies, Hogan expands his creative horizons by having the bad guy lose via Plastic candy Kane.",
         "This just goes to show that Hogan is a bad on the big screen as he is in the squared circle. How this film could ever have been commishoned is beyond belief. I hope someone was fired or even tortured for the production of this film. It is only a shame that the scoring system on the vote doesn't start at 0 because 1 is far to good for this film. This goes to show that Hogan should never be allowed to make any films EVER EVER AGAIN. Thanks for your time and please don't ever feel the need to watch this film to win a bet or if you are contemplating suicide. It will push you over the edge.",
         "Is to use any and all copies of this film as Yule Logs, though it would likely leave a lingering stench for weeks to come. Everyone has summed up this film pretty accurately; it makes the Christmas turkey that Scrooge bought for Bob Crachit look like a spring chicken. The film stars that great thespian Hulk Hogan. He has made some pretty awful films, but even he should have used an alias for this one. Not to be missed is his costume, which is pure Village People Santa (it's a shame they didn't record a song about the holiday joy of sitting on Santa with Muscle's lap). Granted, I am not a geologist, but any crystals that have the ability to explode if barely jostled can be used for sword fights later on in the film, well, your script editors have some continuity issues. Remember the old saying, that if you put 1000 monkeys into a room with 1000 typewriters, that one of them will eventually write Shakespeare? They might not get to Shakespeare, but this film is evidence that they will churn out a steaming pile of reindeer crap. If you truly want to spread Christmas cheer, get yourself a caroling book and a few friends and hit the streets. The only thing this film is good for is as a substitute for coal in a Christmas stocking.",
         "One word: FORGETTABLE! That's it! Its best use is a substitute for a lump of coal in your stocking! Angry Johnny would thank Santa for it, and because he's been a naughty boy all his life! Don't let this be next year's X-mas present under your tree!!!",
         "\"Santa With Muscles\" is an absolutely appalling film. It stars WCW wrestler Hulk Hogan who after getting amnesia thinks he is Santa Claus (like a grown man actually believes in Santa whether he has amnesia or not). He then goes onto beating the bad guys in typically corny Hulk Hogan fashion. I give it a 1/10 and that is being generous."
      ],
      "genres": [
         "Family",
         "Comedy"
      ],
      "productionCompanies": [
         "Cabin Fever Entertainment",
         "Cineplex Odeon Films",
         "Hit Entertainment"
      ],
      "summaries": ["An evil millionaire (Hulk Hogan) gets amnesia and then belives that he is Santa Claus."],
      "budget": 0
   },
   "movielensId": 1311,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1996-11-08",
      "dvdReleaseDate": null,
      "directors": ["John Murlowski"],
      "runtime": 93,
      "movieId": 1311,
      "title": "Santa with Muscles",
      "mpaa": "PG",
      "actors": [
         "Hulk Hogan",
         "Mila Kunis",
         "Don Stark",
         "Robin Curtis",
         "Garrett Morris",
         "Aria Noelle Curzon",
         "Adam Wylie",
         "Jennifer Paz",
         "Clint Howard",
         "Ed Begley Jr.",
         "Brian J. Williams",
         "Troy Robinson"
      ],
      "imdbMovieId": "0117550",
      "originalTitle": "Santa with Muscles",
      "genres": [
         "Action",
         "Family",
         "Comedy"
      ],
      "youtubeTrailerIds": ["0RsN6bAtZ9U"],
      "plotSummary": "Penurious but muscle-bound Blake Thorne has made a vast fortune marketing health food and health supplements. He once was a nice fellow, but as his wealth increases, he becomes increasingly self-centered and decadent. One day, he gets in a great paint-gun fight that goes too far. Blake escapes the cops by running into a shopping mall, quickly donning a Santa Suit and pretending to be St. Nick. A head injury causes Blake to suffer amnesia, and an opportunistic \"elf\" decides to convince Blake that he is indeed Santa. This leads \"Santa\" to help save an orphanage, filled with adorable moppets, from the machinations of a greedy, insane doctor.",
      "tmdbMovieId": 31388,
      "avgRating": 2.57012,
      "releaseYear": "1996",
      "numRatings": 164,
      "posterPath": "/jwDKHs9kempAkOrXY8cvTy90omT.jpg"
   }
}