{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "judge",
            "id": 934
         },
         {
            "name": "daydream",
            "id": 5779
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "rope",
            "id": 6399
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "insecurity",
            "id": 15320
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "crucifix",
            "id": 41380
         },
         {
            "name": "lipstick",
            "id": 156651
         },
         {
            "name": "tightrope",
            "id": 156770
         },
         {
            "name": "cutter",
            "id": 156771
         },
         {
            "name": "peony",
            "id": 156772
         },
         {
            "name": "mastercard",
            "id": 156773
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116293",
      "video": false,
      "title": "Female Perversions",
      "recommendations": [
         123067,
         291964,
         134018,
         25985,
         10613,
         41127,
         42707,
         106222,
         465,
         26195,
         47889,
         77936,
         194077,
         117233,
         21630,
         41667,
         13164,
         69035,
         32513,
         51363
      ],
      "backdrop_path": "/4QZnAr5Np666pfN8n11p2zVoTqV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Evelyn Stephens",
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df07d",
               "name": "Tilda Swinton",
               "profile_path": "/eGNo9qwlunvAi4kCVUEFtQFM5X.jpg",
               "id": 3063,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Madelyn Stephens",
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df085",
               "name": "Amy Madigan",
               "profile_path": "/pNdNJPKRdl3veCRH8fZv3H76ywJ.jpg",
               "id": 23882,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Renee",
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df095",
               "name": "Karen Sillas",
               "profile_path": "/kjvCblLqywvFknAxmQgHAtKabPx.jpg",
               "id": 135162,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Annunciata",
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df08d",
               "name": "Frances Fisher",
               "profile_path": "/248IbuAi6RQG5l94a4hClUswbA5.jpg",
               "id": 3713,
               "order": 3
            },
            {
               "cast_id": 2,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe45dec3a36847f80df079",
               "name": "Clancy Brown",
               "profile_path": "/xBVifBW0riMSbedEQ27hObjPqVw.jpg",
               "id": 6574,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Mrs. Stephens",
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df081",
               "name": "Marcia Cross",
               "profile_path": "/5y6Xybye8h2CqP1TUVJZdp5ZrMN.jpg",
               "id": 127171,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Jake Rock",
               "gender": 2,
               "credit_id": "52fe45dec3a36847f80df089",
               "name": "John Diehl",
               "profile_path": "/hDUvgqpIv753skoeRGjVw6gYp7A.jpg",
               "id": 4942,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Langley Flynn",
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df091",
               "name": "Paulina Porizkova",
               "profile_path": "/4qdxeeAIHkNXNeBQQTHHydApoCI.jpg",
               "id": 82406,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Emma",
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df09f",
               "name": "Laila Robins",
               "profile_path": "/3QChgzUKpoqcK1WD5mLb5eBpMju.jpg",
               "id": 27260,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45dec3a36847f80df09b",
               "name": "Susan Streitfeld",
               "profile_path": null,
               "id": 135163,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "53969cca0e0a266dc20083f5",
               "name": "Julie Hébert",
               "profile_path": "/62gPyUKkQRMxJPvEVGPfUV7AR35.jpg",
               "id": 417131,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "53969cd70e0a266dbb008724",
               "name": "Susan Streitfeld",
               "profile_path": null,
               "id": 135163,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53969ce70e0a266dca008549",
               "name": "Louise J. Kaplan",
               "profile_path": null,
               "id": 1329278,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.052772,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 41801,
      "vote_count": 14,
      "budget": 0,
      "overview": "An ambitious female attorney wallows in excess and meaningless sex with both male and female partners, while dealing with her personal life problems including helping her kleptomaniac sister.",
      "similar": [
         244772,
         258480,
         8272,
         11421,
         370663,
         401898,
         9813,
         12793,
         45153,
         468,
         4170,
         44925,
         8967,
         773,
         858,
         873,
         112160,
         80752,
         141,
         634
      ],
      "original_title": "Female Perversions",
      "runtime": 119,
      "poster_path": "/1BpcbWgw6sX1oTb4M0qgGUPljwg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kinowelt Filmproduktion",
            "id": 2051,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mindy Affrime",
            "id": 60710,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Degeto Film",
            "id": 986,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-22",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Dare to let yourself go where you've never been before.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Susan Streitfeld"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Louise J. Kaplan",
         "Julie Hébert"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116293/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2OTk1NDA3NF5BMl5BanBnXkFtZTYwNTY1MTA5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tilda Swinton, Amy Madigan, Karen Sillas | See full cast and crew »"],
      "reviews": [
         "The idea that a career driven woman finds herself disconnected from emotions, vacant in today's society, is the subject of at least one daytime television program daily. The presentation of Evelyn Stevens (Tilda Swinton, of Orlando fame) in Female Perversions, is not the sugar-coated world of The View, but a carefully crafted life-study (accurate to the minute details). Evelyn is an attractive woman, she believes herself a beautiful one. She inappropriately wonders through a shop while trying on a revealing piece of underwear, but the only one available is a disinterested octogenarian. She is a competent attorney, yet she represents herself as a premier legal strategist. Her credit card is rejected while making the simplest of purchases, she drives a SAAB 900 Turbo-the whole thing is perfect. Further insight to Evelyn's internal monsters are seen though the film's portrayal of her sister, Madelyn-the good soul to Evelyn's evil one. She has chosen a more bohemian existence, and calms her internal monsters through adventures in kleptomania. Let's recap: Driven woman, faux life, dysfunctional family, bad credit cards, soon to be made a judge (with no one to tell, and no one who cares). There is only one place left for her to go. To a deeply invested lesbian encounter. Where else can she go? Her entire life as it stands is moments from implosion. The realization that the new lawyer entering her firm (her \u0091replacement') is prettier (Paulina Porizkova, no less), smarter, and likely more stable further pushes Evelyn to the inevitable. Wonderfully cast with Amy Madigan (as the sister), Karen Sillas (as the Doctor/Lesbian love interest), and Clancy Brown (as the boyfriend) in a rarely seen beefcake role. Throw in Frances Fisher and Laila Robins for good measure. Must for all art film fans. Highly recommended for the more mainstream tastes who like a small distraction now and then.",
         "This is a terrific film about women struggling to discover a way to find and develop their identity. While some of the allusions and metaphors can be a bit heavy handed, they are effective. Eve (Tilda Swinton) is a lawyer about to be nominated for a judgeship. While her professional life is as much as she could wish, her personal life is a mess. She is involved with an architect (male) and a psychotherapist, Renee. But she is unable to connect with either. Her upbringing, devotion to her work, and desperate desire for control have left her emotionally stunted, unable to make a real connection to anyone around her. One day, her sister is picked up for shoplifting. Eve rides to her rescue, and spends several days in the middle of nowhere, with an exotic dancer, a young girl just entering puberty, and a brilliant but shattered friend. Many critics hated this movie (most guides give it just 2 or 3 stars) but I think they couldn't get past Eve's coldness. But this movie is a study in coldness, in emotional death and rebirth. But it is not Eve who is reborn. See it and judge for yourself.",
         "Half of \"Female Perversions\" was of interesting female images a la Jane Campion and half was turgid and incomprehensible. Several people gave up and walked out in the middle. Interestingly, while my friend and I had come as we were in the mood for a dose of strong feminism and possible male-bashing, the pretty full audience for a matinée was 80% male definitely attracted by the beautiful naked female bodies casually on display throughout the movie, including quite a bit of explicit lesbian sex, which tends to put me to sleep as it did in \"Go Fish.\" (You do get to see a glimpse of a naked Clancy Brown). We were the only ones sitting through the credits trying to figure the movie out and exchanging ideas about what the heck the images, let alone the story line meant. Best were the fantasies and nightmares as images of a successful woman's underlying insecurities. But what a cop-out to do what seemingly all contemporary fiction does this days - blame it all on parental child sexual abuse. And I thought the sexual interpretation of kleptomania had been discredited 50 years ago (at the turn of the century women shoplifters were cured with hysterectomies!). (originally written 5/24/1997)",
         "I find it interesting that only one or two of the 17 comments here are by women. I'm not sure whether that reflects the proportions of those who saw the movie - or merely those who were (generally) irritated enough to comment on it. The movie is confused. **** SPOILERS **** Very early on, we hear a ludicrous argument by the protagonist in court, one that would provoke laughter in any courtroom, yet there are only sober gazes in response. Why? No one would ever say \"We must smash him, crush him\" etc. unless they wanted to torpedo any sympathy toward their client. The argument is so funny - yet no one laughs. Why? Later, we hear the protagonist's partner's assessment that the protagonist is a \"killer\" and therefore a desired judicial appointee. The viewer laughs again - we've seen how poor a lawyer the protagonist is (though briefly) and the idea that the \"killer\" nature of the lawyer in a civil suit would somehow cause anyone to predict how she would be as a criminal judge - is again ludicrous. (Later, we learn that the Governor is so FAR from eliciting hard-line responses from his potential judicial nominee, that he happily talks about the joy of his five daughters!). So, the viewer assumes we are meant to believe that the protagonist and her partner are deluded in their assessments of legal realities - yet we learn nothing further to confirm the protagonist is a poor lawyer and the partner a deluded man. Why? We see some bizarre store in which only a few articles hang on hangers -and in which old men sit in the lingerie section watching women who parade in front of him (and the mirror). Why are old men allowed to sit there? And again, since the protagonist is an extremely thin woman, when she asks time and again whether the garment is too small - and hears voices telling her she's fat - we are again distanced from the protagonist's sense of reality. We can't trust what she believes about anything later in the movie. We see a sweet and charming new associate interviewing at the firm - however she speaks negatively about the new lipstick she (and the protagonist) have bought - and has therefore brought down the enduring deep loathing and profanity of the protagonist. This is rather funny since lipstick color is perhaps one of the least important decisions in anyone's life. So, of course it distances us from the hating protagonist - yet why should the movie so want us to be distanced from the protagonist? To see her as a foul-mouthed, promiscuous, person easily roused to hatred by superficialities, who has deluded views of reality? A running and repetitious home movie is seen of a woman acting sexually aggressively with a man who wants to read. He finally pushes her away - she falls. I've no idea what this is supposed to represent. (E.g., imagine the aggression taking place on the man's part - his wife wants to read, he undresses, pushes himself upon her - she finally pushes him away, he falls. What would we be supposed to be making of that?). The movie can't be asking us to condemn the man since he was rather obviously showing a lack of interest and the woman was the aggressor - yet the protagonist says \"yet I want up to my father\" after her mom had fallen. Yes, so? Would she not have gone to her mother if the situation were reversed and the father had been the aggressor climbing upon a mother who had shown she wanted no part of sex that night? What are we supposed to make of this? We are informed by one unstable character that the reason for her persistent crimes is sexual thrill. Yet of course all criminals get sexual thrills from their defiance of society and morality. E.g., think of Leopold and Loeb and the use Hitchcock made of this in \"Rope\". Yet somehow the protagonist (about to be named a judge!) has never heard of this - and dismisses the citations from psychological treatises read by the criminal. Again, it distances us from the protagonist - why this ignorance? There's certainly nothing related to gender about this. Ask any teenage delinquent of either gender who has stolen something from a store -- or another child -- whether it was thrilling - sure. Crimes are almost always thrilling - so? And what are we to make of the protagonist's ignorance about this? We are shown several scenes establishing a sexual relationship between two women (the protagonist and the psychiatrist). The protagonist has instigated the relationship. After staying through the night, at one point, the psychiatrist leaves the protagonist's home to go somewhere. In the last scene between the two women, the psychiatrist says she wants a different kind of relationship. In what way? We have no idea. The psychiatrist doesn't offer and the protagonist doesn't ask. The music tells us that this is somehow a bad thing - but why? We see a mother (divorced? widowed? never married? We never know - and it would have helped to know) who designs and sells wedding dresses -- she becomes disappointed that her recent relationship has soured. But we know so little of her that we don't know why the relationship has really ended - the cited argument is far too slight to end a relationship that had so progressed that the mother anticipated a proposal - or why this should be important. There are just bizarre instances of human behavior throughout the movie - i) middle aged sisters sharing baths and beds, ii) kleptomaniacs throwing in garbage cans, the object of their theft in full view of the store (but only sometimes - we don't know why she kept some articles and tossed others), iii) absolute rage at having to spend just a few nights in a rural jail despite knowledge of criminal guilt, iv) middle aged lawyers wearing short skirts who continue to sit with their legs over the chair arm -- while engaged in conversation with the partner, v) prospective appointees to the appellate bench who care more about wearing their \"lucky suit\" than anything else in life, vi) drunken revels by whole office staffs in state office building lobbies, vii) adolescent girls who slash with a razor at clothing everywhere they find it, viii) crazed lawyers sending flowers to themselves with non-romantic notes of congratulation so it can be found by their secretaries, ix) purportedly successful lawyers being able to drop all other matters in an instant to handle their sister's larceny case. The resemblance to real life is zero - but what are we to make of this? We don't know. Incidentally, I'm pretty sure that's reporter, author, editor Bob Woodward playing the Governor - why isn't he or anyone else listed in the credits in the part? Did he wants his name withdrawn? **** SPOILERS END **** The movie is just a mess. I watched it because several actresses I like (Sillas, Porizkova, Madigan, Robins, Cross) were in it. And the acting was fine (particularly a very unusual turn by Frances Fisher) but you'll find yourself resisting a fast-forward throughout the movie. When the mess ends, it's a relief. Better luck to these actresses next time.",
         "\"Female Perversions\" is short on story and long on character as it peers into the life of an ambitious attorney (Swinton) who is far more confident in a courtroom than in her own insecure and sexually needy personal life. Apparently a sort of testament to the female condition, this flick by women about women surrounds Swinton with a conglomeration of neurotic females as it plods doggedly through a maze of peculiar behavior. On the upside, this deep character study offers some excellent performances as it explores its dark and aberrant landscape. On the downside, the film is a little over-the-top and glommed up with symbolism, dream sequences, and excursions into the surreal. Lacking in story, unpleasant in subject, and artsy-fartsy in execution, the common filmgoer may find this flick unsatisfying. However, for those into deep character studies and psychodramas, an interesting watch awaits. (B)",
         "I am somewhat surprised by the scathing reviews posted for what I found a provocative and entertaining work. I do guess that is what makes horse races. I rated the work a 10 and recommend it to anyone looking for something unconventional that requires you to think. I can see not agreeing with the filmmaker's perspective, but that it HAS a perspective is more than most films, and sets this little work apart. The performances were well crafted. Tilda Swinton does what she does best - gets under your skin and makes you squirm a bit. She is thoroughly uncomfortable to watch, by design I believe, and very effective. I think this is a fine little film.",
         "While viewing FEMALE PERVERSIONS, I began to wonder if I was losing my mind. For whom was this film made? Who put up the money to make this film? FEMALE PERVERSIONS is pretentious piece of clap trap masquerading as something deep and meaningful. Woman have it rough competing in male dominated society and men are responsible for all of woman neurosis seems to be the message. Ho Hum! Where have we heard that before? Just about every character in this film is angry, nasty, neurotic, and unpleasant, except for teenage \"Tomgirl\" named Ed, who is just a little mixed up. The scenes of Eve's dreams and hidden memories are down right laughable, like the kind of stuff found in some over indulgent student film. The film has not coherent plot, just a lot of incidents. And would somebody please explain the ending? There are some people who praise this film because it deals with characters searching for their identity, but most of the characters come across as so self absorbed that they evoke no sympathy. The film puts an emphasis on getting in touch with ones \"feelings.\" But when one constantly dwells on his/her feelings, its leads to selfishness and hedonism, a point the films makers seem not to be aware of.",
         "[Spoilers Ahead] This film concerns various womens' quests for the meaning of their collective angst. To be sure, the scapegoat is found, and he his man (i.e. male). This silly tripe masquerades as an \"art\" film. It is not. Rather, \"Perversions,\" is a polemic which uses tired dream sequences (poorly done), and suppressed memories (silly in their recreation) to create artificial sympathy from the audience to the women leads. I'm not buying it. A poignant example is the confused youth who has recently begun her period. She marks each monthly occasion with faux burials of non-existent children. How is she cured? With a hug of course. And she is probably the sanest of the bunch. Please don't be fooled by the bizarre plot line. You are apt to laugh through many of this movie's zany scenes. I was constantly thinking of Ed Wood. He would have loved this film. Had he made it, it would have been better. This joker of a Berkely masterpiece for me, rates the dubious film one out of ten. I think, after thousands of reviews, I've doled out the infamous one rating only twice before. Well, \"Perversions\" is in good company now. This film is bunk extraordinaire.",
         "The title of this film is dangerously misleading because the film might be thought to be pornographic, and many people who might otherwise find it interesting will not see it. (The contrary is also the case, that all the wrong people will want to watch it because they are titillated by the title. They will also react with violent antipathy, in the wake of their disappointment. The choice of title seems to have been a deliberate act of provocation.) The German title, translated, is 'Fantasies of a Woman', which is rather milder. The film is a feminist essay, and the title is intended to be ironical, the 'female perversions' referred to being those imposed upon women by a conventional male-dominated society, so that for instance being a housewife is regarded as one type of 'female perversion'. It seems somehow natural that the wildly experimental Tilda Swinton would have to be in this film: indeed, how could she say no? How could such a film be made without her? She seems to be everywhere that people and films are pushing the envelope. As usual, she is breathtakingly brilliant. A surprising addition to the cast is Frances Fisher, who made such an impact as Angie, the red-headed waitress in the diner, in the intriguing television series 'Strange Luck' in 1995-6, at about this same time. Here she does some rather unnerving 'exotic dance' routines, which all goes to show something, I'm still trying to decide what, but whatever the reason for this is, she does it very well and one would think she had been a stripper or a showgirl all her life if one did not know she had instead been an actress. Tilda Swinton is electric here as a career gal who is so tense she might snap like a wire stretched too taut. She is about to be made a judge, God help us! (Many judges are crazy or weird anyway, but she would be more so than most, as the film makes all too clear.) Tilda Swinton portrays an extreme neurotic, and 'looking good' is essential to her, so she is always doing and re-doing her lipstick (an insecure woman's last refuge). She is a control freak and insanely superstitious. For instance, if she cannot wear her white suit for an interview with the Governor of California (not Arnie, a fictional one) for a judgeship, because it is 'lucky', she falls apart. Her kleptomaniac sister sees to it that she cannot wear the suit to the interview. Things are pretty tense like this throughout, and there are many fantasy elements to this film written, produced, and directed by women with women for women. I don't believe this film can really be excused by a 'women searching for their identities' justification, and if one approaches it earnestly from that angle (which may have been the earnest intention of the makers, for all I know), it is a failure which verges on parody sometimes, and has pretentious aspects. The merits of the film are different, and concern the intensity of portrayal and the mysterious depths of character revealed, especially of hidden or suppressed motivations. The lesbian aspects of the film are not central, but merely a part of the evolving self-realization of Tilda Swinton's character. I am firmly convinced that men can never understand women and women can never understand men. I first came to realize this in my teens when the novelist Pearl Buck said to me that 'men and women are completely different species and can never hope to understand one another'. That shocked me a lot, I never forgot it, and it has been repeatedly verified. I have now come to the conclusion that Nature has designed things this way. The imperative of Nature is the propagation of the species. If men and women understood each other, that would get in the way of propagation, and many fewer babies would be born. Consequently, evolutionary pressures have seen to it that this can never happen, in order to safeguard the future of the species. That is why men like myself who do not regard women as inferior beings (as many of my gender definitely do) are so intrigued by 'the mystery of women' and interested to see attempts to make films like this one where women contemplate women and try to understand themselves. It is true that there are no admirable characters on offer here, and that they are all pretty horrible people. Nevertheless, this film manages to be fascinating, although it is understandable that it would cause a lot of contradictory reactions, some of them violently opposed to it, and some admiring and appreciative. If we want films to punch us in the ribs instead of putting us to sleep, this one certainly qualifies. This is what is called 'independent film making', and long may it continue.",
         "Tilda Swinton is a marvelous actress, but she's at a real loss here playing a high-powered attorney, operating under a mass of neuroses, who is on her way to becoming a judge yet sidelined by family issues. Adaptation of Louise Kaplan's book gets a quasi-art-house treatment by director Susan Streitfeld, who wants desperately to make points out of symbolism but is far too heavy handed in her approach to involve an audience. Amy Madigan does some solid work as Swinston's petty thief sister, but Swinton herself is impossible to get a grip on. Changing her hairstyles and overall appearance like a chameleon, Swinton is icy and aloof. There's a good actress under all this artifice, but Streitfeld is too concerned with showing off, and everyone suffers as a result. * from ****"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Mindy Affrime",
         "Degeto Film",
         "Kinowelt Filmproduktion"
      ],
      "summaries": [
         "Dresses, lipsticks, sex - the \"perversions\" (and neuroses) of Eve, a young, very successful lawyer. Her days are a tightrope act between extreme eloquence and frosty toughness on the one side, and scaring vulnerability on the other. The climax of her career shall be the possibly forthcoming appointment as a judge, but this step seems to be interrupted by her kleptomaniac sister Mad who is arrested after one of her raids. Eve travels to Mad's town to stand by her in the jail. Their struggle about Mad's illness evokes suppressed conflicts. Eve stays at her sister's flat where she meets a girl who fights with her budding femininity.",
         "An ambitious female attorney wallows in excess and meaningless sex with both male and female partners, while dealing with her personal life problems including helping her kleptomaniac sister."
      ],
      "budget": 0
   },
   "movielensId": 1312,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-22",
      "dvdReleaseDate": "2001-11-27",
      "directors": ["Susan Streitfeld"],
      "runtime": 119,
      "movieId": 1312,
      "title": "Female Perversions",
      "mpaa": "R",
      "actors": [
         "Tilda Swinton",
         "Amy Madigan",
         "Karen Sillas",
         "Frances Fisher",
         "Clancy Brown",
         "Marcia Cross",
         "John Diehl",
         "Paulina Porizkova",
         "Laila Robins"
      ],
      "imdbMovieId": "0116293",
      "originalTitle": "Female Perversions",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "I-nq8ELLr6w",
         "Ke_9_ZZVmqs"
      ],
      "plotSummary": "An ambitious female attorney wallows in excess and meaningless sex with both male and female partners, while dealing with her personal life problems including helping her kleptomaniac sister.",
      "tmdbMovieId": 41801,
      "avgRating": 3.52676,
      "releaseYear": "1996",
      "numRatings": 355,
      "posterPath": "/1BpcbWgw6sX1oTb4M0qgGUPljwg.jpg"
   }
}