{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116953",
      "video": false,
      "title": "Mad Dog Time",
      "recommendations": [
         33374,
         38132,
         250622,
         69900,
         9987,
         27224,
         134048,
         87704,
         211587,
         5733,
         35118,
         340855,
         14530
      ],
      "backdrop_path": "/NbV5vUOeeNfay1pEEDoeUbWuaO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Vic",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7733",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rita Everly",
               "gender": 1,
               "credit_id": "52fe4726c3a368484e0b7737",
               "name": "Ellen Barkin",
               "profile_path": "/i4WSy0da6KaA3xvETtXqZtUMoRP.jpg",
               "id": 6913,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mickey Holliday",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b773b",
               "name": "Jeff Goldblum",
               "profile_path": "/t812WlNdP6F2ksRj21JF68DUiwz.jpg",
               "id": 4785,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ben London",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7745",
               "name": "Gabriel Byrne",
               "profile_path": "/lFIH4De52Eg21m7pScPMXezZDUh.jpg",
               "id": 5168,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Grace Everly",
               "gender": 1,
               "credit_id": "52fe4726c3a368484e0b7749",
               "name": "Diane Lane",
               "profile_path": "/81fhEMQlbhQ3mbI5ghq9RUrjkLB.jpg",
               "id": 2882,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "'Wacky' Jacky Jackson",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b774d",
               "name": "Burt Reynolds",
               "profile_path": "/g5AyPAhdr5OtHVRGLD3i8Gw4oas.jpg",
               "id": 16475,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7751",
               "name": "Larry Bishop",
               "profile_path": "/blmoGBCRnKtkatY4F6aB7uCfWzz.jpg",
               "id": 34721,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr. Gottlieb",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7755",
               "name": "Joey Bishop",
               "profile_path": "/eAdeniMPGSxT5k2rwgXCLiISmEV.jpg",
               "id": 4361,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Jake Parker",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7759",
               "name": "Kyle MacLachlan",
               "profile_path": "/ykDb80YOPY2HLuRClLDpSYxUCPX.jpg",
               "id": 6677,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Gabriella",
               "gender": 1,
               "credit_id": "52fe4726c3a368484e0b775d",
               "name": "Angie Everhart",
               "profile_path": "/n4coY7os9hPRRLAzcpr4clpLVh1.jpg",
               "id": 58312,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Sleepy Joe Carlisle",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7761",
               "name": "Henry Silva",
               "profile_path": "/wSDmsMhQ95utBggMaHOCALMM9CC.jpg",
               "id": 14731,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Red Mash",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7765",
               "name": "Michael J. Pollard",
               "profile_path": "/pZzGaBrDi27Ve7X4BCzslgt2mZi.jpg",
               "id": 6451,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Jules Flamingo",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7769",
               "name": "Gregory Hines",
               "profile_path": "/rvvQWFQGeGR14WFVNe0Qg1J7uVY.jpg",
               "id": 66804,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Lee Turner",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b776d",
               "name": "Billy Idol",
               "profile_path": "/m34UfaHkKBPA18zT4LMIHclXbIg.jpg",
               "id": 80117,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Wells",
               "gender": 2,
               "credit_id": "52fe4726c3a368484e0b7771",
               "name": "Billy Drago",
               "profile_path": "/5KAkTHIYc9L3CMWJvKEHCeYUcFm.jpg",
               "id": 1275,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4726c3a368484e0b7741",
            "name": "Larry Bishop",
            "profile_path": "/blmoGBCRnKtkatY4F6aB7uCfWzz.jpg",
            "id": 34721,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.215822,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 66034,
      "vote_count": 14,
      "budget": 0,
      "overview": "With his boss in the madhouse, a mobster is temporary boss of the criminal empire just as vicious rivals threaten the control of the empire.",
      "similar": [],
      "original_title": "Mad Dog Time",
      "runtime": 93,
      "poster_path": "/rF7JPTZRkf3ysaAx99JqtDb0abu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bruin Grip Services",
         "id": 5330,
         "origin_country": ""
      }],
      "release_date": "1996-11-08",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Larry Bishop"],
      "runtime": 93,
      "synopsis": "By appearing first in a bathrobe, Vick the gangster boss, is aping the headlines of that era. We were seeing a Mafia chieftain in New York City appearing for his court appearances in a bathrobe, trying to cop a plea by appearing insane. Richard Dreyfuss and a herd of aging actors make this a fascinating study for what happens when actors go over the hill. The exception to the rule is Ellen Barkin, playing a sexy, really hot gangster's moll to Jeff Goldblum's professional hitman. With the name of Holliday, Jeff gives us a great clue to the action as murder draw-downs follow murder draw-downs. Definitely a quixotic movie with no moral, whatsoever but fun to see.",
      "writers": ["Larry Bishop"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116953/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NzU0MDc5OV5BMl5BanBnXkFtZTcwNjgxMjA0MQ@@._V1_.jpg",
      "actors": ["Stars: Ellen Barkin, Gabriel Byrne, Richard Dreyfuss | See full cast and crew »"],
      "reviews": [
         "... his version of \"My Way\" is hysterical (especially after I read somewhere that he truly thought - before he heard himself later - that it was Paul Anka that was out of tune and not himself!) and he gets all the best lines. That said, I thought Jeff Goldblum was also excellent - more understated than the rest of the characters which was a good foil for them. The film is just simply great fun. It's not a classic, clever masterpiece of its time, but it is immensely enjoyable and well worth seeing at least once.",
         "Despite the disparaging comments by other reviewers here, and the savaging this film received by mainstream critics, I've got stand by my original assessment of the piece which I made in 1996 on its release. This is a taut, sardonically funny, very well done flick, and I think it's detractor's may be missing the point a bit by pointing out that it plays like a rough draft. Were not many of the so called `Rat Pack' movies nothing more than hastily thrown together vehicles for whatever `Packer' happened to be starring? Of course it's rough around the edges! Of course it never seems to be getting its own joke! Unfortunately the joke ends up being on the film itself because it does its job too well. It looks at the genre from the coatroom, behind a row of smoke-scented overcoats. If it looks and feels like the reels were left on a smoky card table for a few weeks before being run - then it's doing its job. It's that very patina that gives Mad Dog Time it's credentials as a well done and mutli-faceted darkly funny movie that belongs not so much with it's erstwhile Rat Pack brethren as has been suggested so often, but rather with The Player and other movies whose joy, in part, is the fact that the players are so clearly having a ball making the thing. Goldblum and Dreyfuss stand out from an altogether superb cast. Goldblum for his ability to keep the audience guessing as to whether or not he really feels as confident as his character acts throughout and Dreyfuss for proving that nobody in the business can look both smugly amused and supremely confused at the same time as well as he. That's all I have to say. Now I think I'll hop home, pack my bags and leave town.",
         "If you are used to seeing Gabriel Byrne in serious roles such as Tom in Millers Crossing or Keaton in The Usual Suspects I recommend you take a look at this film. Even if you are not a fan of Gabriel Byrne in particular, all the actors in this film give really great performances. If you've got about eleven bucks (that is close to nine quid) I say order it online, or rent it from you favorite movie rental place. Guaranteed to make you laugh, whether or not you normally like gangster type movies. Mad Dog Time/Trigger Happy is one of those movies you never forget, and find yourself watching over and over. You will talk about it so much your friends will be begging to borrow it.",
         "The world is a terrible place. But this movie is farce and it's fun. And if you don't like it... you don't get it... and if you don't get... it doesn't matter. It's up to you if you want to play along. Every actor in this one had fun. It's only a joke. And that's good enough for me. Gabriel Byrne is priceless. Byrne and Paul Anka doing MY WAY is, as \"Vic\" puts it, \"...the best version ever\". Okay... it's no masterpiece, but it's not bad. I was warned against seeing it, but I'm sure glad I did...",
         "Not a movie for everyone, but this movie is in my top 10. I am a lover of black comedy. With a cast including Richard Dreyfus (Vic), Jeff Goldblum (Mick), Larry Bishop (Nick) and Gabriel Byrne (Ben 'Brass Balls' London) in the leads, the lines can't help but be dry. The supporting cast is nearly dead center. Counting the minor flaws in the movie: Ellen Barkin's make-up gave her face has a washed out look; there were a couple of gimme cameos by Joey Bishop and Richard Pryor that served no purpose, and Michael J. Pollard's screen time was too short. Over all, the cast was just incredible without egos to wreck a fine script. If you have seen Larry Bishop's (writer, director) film, Underworld (a dark crime flick), you will enjoy this one. His next outing (writer, director, actor) is Hell Ride with Michael Madsen and Quentin Tarantino.",
         "This a superb self-contained work that is unconnected with anything before or after. Brat Pack crooning and club exclusivity are not my biscuits of choice, but in this law-free world they make an alluring ambiance. The film is packed with Our Guys, distinctive actors who add distinction to this work with winning performances. The dialogue is a joy. In fact it's a new vernacular. One of the few films that can be watched repeatedly with deepening appreciation. Highpoints include Billy Idol's British loutishness, Ben London's vulturine brassware, Kyle's squirmishness, and the survey of ad hoc philosophies.",
         "When seeing this movie you should take notice to that it´s not a normal movie. It has no real story just characters, a bunch of gangster characters who come together in a perfect harmony. The dialogue is wonderful, you can just lay back and listen. The movie stands out thats why it´s hard to find a right way of describing it. Thats why the user comments on this movie is so mixed. I for one love the movie and recommend it to all who love one-liners and things that differ from the \"normal\". You can´t really put the finger on what´s so wonderful about it it´s just a comical world where gangsters rule. A place of love and danger. A movie that you can see more than one time.",
         "If the Godfather can be rated as the greatest of realistic crime or gangster movies then Mad Dog Time should be rated as the greatest of surrealistic movies. This is a film which takes the serious reality of the mob world of killers and shows them in a strange weird way that should rate this film as one of the great films of the cinema art. It is like watching mobsters in a way the painter Picasso viewed reality with his famous Cubism. In some ways it is Film Noir but in other ways it is comic and even romantic. If you want to see a different kind of crime movie that is well acted and whose meaning may be no more than the art of strange film or showing what creative film making can do, then catch this one.",
         "This movie is great. Simply. It is rare that you find a comedy with levels, and this is a bloody good example of such. When I saw this movie first, as the credit rolled, a friend and I looked to one another and asked... 'did you just catch that?' For those doubters, look at the levels. See the comparisons between Vick and the people in the club, the DNA! See the diverse characters, each jostling for position, and if you see nothing else, see the connection between the cure of Vick and the path through the film. IT'S ALL IN VICK'S HEAD! The opening line about Vick's world. The closing scene with the camera going into Vick's head, and inside, a whole universe! Thoroughly quotable, wonderful cartoon gangsters, beautiful, beautiful, beautiful!",
         "Why this film was savaged when it was released is beyond me. It's a comedy for Pete's sake, not Macbeth. I'll admit the structure is a little strange and the characters are quirky to say the least. But it reminds me of Barton Fink in style. Maybe you have to be in a certain mood to really enjoy it. But give it a chance. There's a bit of everything here; Henry Silva doing a great Burt Reynold's laugh right to Burt's face; Ellen Barkin as sexy and nutty as ever; Richard Dreyfuss as the manic mob boss; and last but not least Gabriel Byrne as the flunky who would be king. Maybe I'm mistaken, but I think the critics got this one waaaay wrong. So, watch it and make up your mind."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Bruin Grip Services",
         "Dreyfuss / James Productions",
         "Skylight Films"
      ],
      "summaries": [
         "Mob boss Vic returns to business from madhouse. Meanwhile his best and quickest assistant Mickey Holliday is having an affair with Vic's girl Grace Everly and, at the same time, with her sister Rita Everly. What will Vic do? Whom will he kill? Is he really insane and weak? Many other mobsters, including Jake Parker, WackyJacky Jackson and Ben London think he's not so powerful anymore and hope to take his place.",
         "With his boss in the madhouse, a mobster is temporary boss of the criminal empire just as vicious rivals threaten the control of the empire."
      ],
      "budget": 8000000
   },
   "movielensId": 1313,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-08",
      "dvdReleaseDate": "2004-03-02",
      "directors": ["Larry Bishop"],
      "runtime": 93,
      "movieId": 1313,
      "title": "Mad Dog Time",
      "mpaa": "",
      "actors": [
         "Richard Dreyfuss",
         "Ellen Barkin",
         "Jeff Goldblum",
         "Gabriel Byrne",
         "Diane Lane",
         "Burt Reynolds",
         "Larry Bishop",
         "Joey Bishop",
         "Kyle MacLachlan",
         "Angie Everhart",
         "Henry Silva",
         "Michael J. Pollard",
         "Gregory Hines",
         "Billy Idol",
         "Billy Drago"
      ],
      "imdbMovieId": "0116953",
      "originalTitle": "Mad Dog Time",
      "genres": [
         "Drama",
         "Action",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "With his boss in the madhouse, a mobster is temporary boss of the criminal empire just as vicious rivals threaten the control of the empire.",
      "tmdbMovieId": 66034,
      "avgRating": 2.78862,
      "releaseYear": "1996",
      "numRatings": 123,
      "posterPath": "/rF7JPTZRkf3ysaAx99JqtDb0abu.jpg"
   }
}