{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "vaudeville act",
            "id": 190427
         }
      ],
      "imdb_id": "tt0116601",
      "video": false,
      "title": "I'm Not Rappaport",
      "recommendations": [
         24826,
         55893,
         41589,
         77073,
         83105,
         49345
      ],
      "backdrop_path": "/m4ShLMiUDPxeC7hfU1B5VUZ9w1p.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Nat Moyer",
               "gender": 2,
               "credit_id": "52fe4656c3a368484e08b42f",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Midge Carter",
               "gender": 2,
               "credit_id": "52fe4656c3a368484e08b433",
               "name": "Ossie Davis",
               "profile_path": "/9oVewASbQrzqENeKJX5CGLVzq3U.jpg",
               "id": 15531,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Clara Gelber",
               "gender": 1,
               "credit_id": "52fe4656c3a368484e08b437",
               "name": "Amy Irving",
               "profile_path": "/4SMrIcyYmJecUzIsipIrO4vGXxQ.jpg",
               "id": 27563,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hannah",
               "gender": 1,
               "credit_id": "52fe4656c3a368484e08b43b",
               "name": "Marin Hinkle",
               "profile_path": "/cdSW58BExmrfRCfcOfKPZblDSxI.jpg",
               "id": 65760,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sol",
               "gender": 0,
               "credit_id": "53e2f1d00e0a262b8f002dee",
               "name": "Irwin Corey",
               "profile_path": "/rLpmlAF4SVjjUX1mv3KIbDSV8qn.jpg",
               "id": 28035,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Parking Lot Customer",
               "gender": 2,
               "credit_id": "55aa3780c3a3682ff600568c",
               "name": "Bobby Cannavale",
               "profile_path": "/o3xnmePoOUCw7sjoZ4xM4W5DL26.jpg",
               "id": 21127,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4656c3a368484e08b42b",
               "name": "Herb Gardner",
               "profile_path": null,
               "id": 144256,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546cfffbc3a3680974002004",
               "name": "Herb Gardner",
               "profile_path": null,
               "id": 144256,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "546cffffc3a36809700022d6",
               "name": "Herb Gardner",
               "profile_path": null,
               "id": 144256,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.858326,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61536,
      "vote_count": 10,
      "budget": 0,
      "overview": "Old Nat Moyer is a talker, a philosopher, and a troublemaker with a fanciful imagination. His companion is Midge Carter, who is half-blind, but still the super of an apartment house. When he is threatened with retirement, Nat battles on his behalf. Nat also takes on his daughter, a drug dealer, and a mugger in this appealing version of a really 'odd couple'.",
      "similar": [
         3134,
         298312,
         8810,
         281,
         948,
         4638,
         10212,
         11564,
         43923,
         133805,
         2142,
         12162,
         1359,
         4771,
         431,
         8923,
         10285,
         23483,
         97630,
         101
      ],
      "original_title": "I'm Not Rappaport",
      "runtime": 135,
      "poster_path": "/b83Z9btqnOMawlBdh6QbKgaCnZl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Greenestreet Films",
         "id": 2150,
         "origin_country": ""
      }],
      "release_date": "1996-12-24",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Herb Gardner"],
      "runtime": 135,
      "synopsis": null,
      "writers": [
         "Herb Gardner",
         "Herb Gardner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116601/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MTczMjgzNF5BMl5BanBnXkFtZTcwNTg2MzYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Walter Matthau, Ossie Davis, Amy Irving | See full cast and crew »"],
      "reviews": [
         "In I'm Not Rappaport, a film by Herb Gardner based on his Tony award winning play, two octogenarians Nat (Walter Matthau) and Midge (Ossie Davis) meet regularly on a park bench in New York's Central Park. The film centers on their relationship as they reminisce about past loves, talk about unions and bosses, old age, and idealism. Nat is a chameleon who assumes the role of spy, lawyer, or consumer advocate, depending on the situation at hand. `I was one person for 80 something years,' he says. `Why not be a hundred for the next five?' Midge, now nearly blind, has worked as a building superintendent for forty years and has had to make compromises just to keep his job. The film takes its title from the old vaudeville joke in which a comic walks across the stage and encounters a straight man with surprise: `Rappaport! What happened to you?' he says. `You used to be a short, fat man and now you're a tall, skinny man.' `I'm not Rappaport,' says the straight man. And this goes on for a couple of minutes until the comic says, `Rappaport, you used to be so well dressed and clean and now you're dressed in filthy old clothes.' `I'm not Rappaport,' says the straight man. `So you changed your name too!' says the comic. Nat's most vivid remembrance is that of a meeting when he was five years old in which a passionate woman, Clara Lemlich (Elina Lowensohn), summoned the Ladies Garment Workers Union to participate in a general strike. He is a follower of radical left-wing causes who focuses his remaining energy and considerable wit on helping others facing injustice. Midge doesn't want any part of social activism but, when the spokesman for the tenant's committee threatens to eliminate his job and apartment dwelling, Nat pretends that he is Midge's lawyer and intervenes, making clear that the issue is a society that underestimates and mistreats its senior citizens. In another sequence, Nat pretends he is a consumer spokesman and brazenly marks down the price of meats and groceries in the local supermarket until he is thrown out on his ear. Things take on a darker tone, however, when a local hood, J.C. (Guermo Diaz) seeks protection money from the elderly. The pair also becomes involved with drug dealer \"Cowboy\" (Craig T. Nelson) who threatens street artist Laurie (Martha Plimpton) with physical harm if she doesn't pay him the money she owes for drugs. These two episodes are the least effective in the film and do not add much to our understanding of the characters. The most touching sequence, however, is when Nat's schemes are revealed as a desperate attempt to maintain his independence from his daughter Clara (Amy Irving) who wants greater control over his life. While his activities seem harmless, Clara is fearful of her father's visits to the park and wants him to live with her or in a managed care facility. \"I'm not going to live in Siberia in Great Neck\" with her, he tells her, then makes up a story about a long-forgotten daughter who has invited him to live with her in Israel. While ostensibly I'm Not Rappaport is essentially a two-man show, in reality Matthau grabs the spotlight and never lets go, reducing Davis' role to film fighting off Nat's outlandish talks and schemes and playing straight man for his comic routines. While the film is a comedy, there is sadness in the fact that a once powerful set of beliefs is now reduced to pathetic gestures by sentimental old men. Even when Gardner pays tribute to the Jewish tradition of social action, the Bolshoi Chorus belting out the Internationale seems to mock their passion. For these men, old age does not bring security, status, or emotional fulfillment, only longing for the society that might have been and the men they could have become. For them, there is little left to cling to except a wistful kind of grace.",
         "This is a gentle heart warming film, that to me has a quintessential qualities that make Walter Mathau such a great actor. It is not the comedy in which he excelled at in films like 'The Odd Couple'. It is the way he bullies the script and the camera. This he does well but with not as much aplomb in 'The Sunshine Bys'. To see a film where the script is paramount is wonderful, and to have an actor such as Mathau at the centre of it conducting it with all his mastery skill is a delight to watch. The supporting cast around Mathau equip themselves well. They are not overpowered by his fame or skill. At times it feels as though you are actually there watching events unfold. This is a credit to the director who while keeping it looking like the good film it is, also brings you in as though you are the only person in the world watching the film. Although I have only watched the film on the television, I feel that I would have felt the same effect had I been watching the film in the cinema. This is a rare effect, too many times films can have that distant feel. It is the directors's skill, and the skill and art of the actors that this is never lost. I watched this film, when I had to fill half an hour of time. The result was that I was glued to the seat unable to pull myself away.",
         "What a great movie! With a great script, a pair of huge actors, and a beautiful scenery, this movie can touch anyone's heart. Don't miss it!",
         "Actually, I not only smiled, I laughed out loud. I'm 70 and did not feel that this movie is sad, as some of the other reviewers have suggested. Those two old guys were making the best out of the time they had left,an encouraging message for us old folks. Unlike so many of today's movies, there was an engaging plot and solid character development. So many of the movies I see these days substitute visual effects,sex scenes,violence, and vulgar language for plot and character development. Also, although it was 130 minutes long,those minutes moved quickly. Three cheers for Walter Matthau! Three cheers for Ossie Davis! Three Cheers for Herb Gardener!",
         "Walter Matthau was great as an aging man who lives to hang out in Central Park and tell outrageous lies. He strikes up a relationship with a man whom he drives nuts with his outlandish yarns. Matthau tries a con on several people trying to help them and himself out, but they all backfire. This film had a story that had me riveted to my chair. The entire production was filmed in Central Park, the scenery was beautiful, with many shots of the surrounding buildings. Wonderful movie - 5 stars.",
         "In CITIZEN KANE, Kane's most faithful associate and friend, Mr. Bernstein (now Chairman of the Board of Kane's empire) tells the reporter that aging is the only disease that nobody looks forward to the cure of (i.e. death). I'M NOT RAPPAPORT is a look at just how ultimately dreary and awful old age becomes for most of us. Yet it is a comedy - because in humor we manage to find reason to survive and even flourish a little. I was lucky to see the play on stage with Judd Hirsch and the late Clevon Little. It was a good production, and had less slow spots than the film (which occasionally slows down to try to find something visual to satisfy the viewing audience - sometimes it works and sometimes it doesn't). Hirsch and Little had good rapport in the roles of Nat and Midge, the elderly Jewish radical and the elderly African-American super. Both are now considered out-of-date and expendable. In short they are old, and at best are part of the background, and at worst bandied about by careless or vicious younger people. Midge is suffering from reoccurring cataracts and glaucoma. He is the still smart engineer of his apartment's boiler room (and he demonstrates a remarkable ability to pinpoint a car engine's problems too). But he is 81 or so and the building is turning coop. They don't need an antiquated super for their new image (they are even getting a new boiler so they don't need his expertise!). Nat is in a similar position, but he is imaginative and clings to a fanatical devotion to the socialist-and communist labor viewpoint that permeated the Jewish districts of the lower East Side and Brooklyn from 1900 to 1947. He is able to demonstrate an inventiveness to promote the defense of people's rights. But frequently (too frequently) he does not realize that his actions might injure the people that he thinks he is helping. As he was dying Frederick Douglas yelled to remember to always \"agitate!\". He was right. But Douglas realized you had to agitate for change that was possible. Nat can't realize this, as he falls under the romance of his various guises and lies. The play and film covered actually three months, but the first act and second were in the course of a single pair of days. Midge (here Ossie Davis) faces dismissal from the spokesperson of the tenant's group taking over the building (Danford - Boyd Gaines). But Danford is really a softy, and even is willing to try to get a severance package for Midge that is larger than the one he offers. Just as they are about to agree Nat (Walter Matthau) shows up and pretends he is a labor union lawyer nicknamed \"the cobra\" who will destroy Danford unless he retains Midge in the job. For awhile this works...until a member of the tenant's group eventually finds out Nat lied. Then Midge gets even less than he was supposed to. Nat (who actually was once a waiter - nothing else) similarly manages to harm Laurie (Martha Plimpton), a recovering addict and artist, who owes $2,000.00 to Cowboy (Craig T. Nelson) for drugs. He pretends to be a \"Godfather\" with Midge as his bodyguard. Cowboy is not fooled, but is seriously annoyed. So it goes with all Nat's plans and attempts to spread the zeal of activism. For nobody really cares outside of their immediate self-interest. As his drained but loving daughter (Amy Irving) tells Nat, the old fights are just that...old fights. Nobody cares about them anymore. And yet the fervor in Nat's voice, recalling an historic rallying point in New York Labor history in 1909, or the sudden care and bravery of Midge when Nat is in danger show these men are worthy of respect. Only one person really comes close to respecting them...Danford. He is younger by decades, but he is aware (in his late 30s) that he lacks the physical strength he only had five years earlier. When Matthau basically says that Davis's only sin is his old age, Matthau reminds Danford that one day he too will be a member of the old age club. Danford is very aware of that. Matthau brings to Nat his mad vitality (as Hirsch brought a type of intellectual memory to the same role). Davis is not as energetic as Little was on stage, but he does bring a degree of comfort to the role - an African-American of 80 years who knows what is expected by society of his type, but has found ways to circumvent it as much as possible. Irving makes Nat's daughter his tragic, loving victim - caring for him, but finding him rejecting her overtures to care for him. People aware of Nelson as \"Coach\" will be amazed by his vicious streak - but he is still able to be a good deadpan/straight-man to Matthau at the end. And Gaines certainly makes Danford more thoughtful than one could imagine. Oh...Willie Howard. \"I'm not Rappaport\" is an old routine of that Broadway clown, where he drives a stranger crazy insisting he is Rappaport, although he does not resemble the gentleman in any way. Howard never was a Hollywood star, so it is nice that the play resurrected his memory a little here.",
         "A sensitive approach to the \"getting old\" problem on the big cities. The main character is a modern version of Dom Quixote, who tries to keep his ideas and principles alive assuming to be imaginary people which had more interesting histories than he had on his own life. The movie is beautiful and amusing. Walter Matthau is splendid.",
         "very slow, very long, very quiet, which is perfect considering the film is about two old men trying to battle their age.the pace and mood of the film fits perfectly into its content. it is a very artistic movie with just enough reality to keep it Sincere yet enough adventure to keep it enjoyable.although a major plot in the movie is that of drugs and drug addiction, it seems to take a rather light hearted approach to it which keeps the issue of age close at all times, the relationship between that of Nat and his daughter is one that i have seen all to often in life and leaves you with a sense of pity.this is a subject that isn't touched on enough when it comes to film. it truly is a must see movie",
         "Nat Moyer ( Walter Matthau ) may be several persons for the others: consumer protector, working class counselor, FBI agent, movie industry mogul, ... But Nat was in his entire life, essentially, the man who never forgot Clara Lemlich calling a general strike at the textile workers Union meeting. Matthau'interpretation was worth an Oscar. The movie has the marks of the original play. A gentle satire about the dreams and the death of communism.",
         "Though I have worked in almost all aspects of the theater business, I do not agree with many of my colleagues when it comes to film tastes. I do not like film adaptations of stage plays because the origins are most of the times in evidence, but that seems to be what my friends enjoy more: to be remembered that they watch filmed theater. But this one (winner of New York's Tony award) I liked quite a lot, although it is also the case: in spite of the efforts to emphasize its outdoors setting, it is based on word interchange, and most of the action is verbal and static, depending mostly on criss-cross editing. This time though you have two exceptional actors, with the additional plus that they are not of the kind that goes around with a sign on his/her face or chest that reads \"I'm the Greatest Actor\" (and I can think of quite a few). You don't find plays everyday in which the main characters are a Jewish militant of the Left and a black janitor, both very old. These people are not glamorous, their lives were not full of heroics, and old age is not epic, but one spends a good time with these two folks, even if a couple of subplots could have been omitted. Perhaps, due to the fact that Herb Gardner the playwright adapted his work and also directed it, the film is overlong. But one day when you are not in a rush, and have time for Matthau and Davis, enjoy them. It is better than watching aimless young Germans in Portugal for two hours, in something called \"Body Rice\"..."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["GreeneStreet Films"],
      "summaries": ["Old Nat Moyer is a talker, a philosopher, and a troublemaker with a fanciful imagination. His companion is Midge Carter, who is half-blind, but still the super of an apartment house. When he is threatened with retirement, Nat battles on his behalf. Nat also takes on his daughter, a drug dealer, and a mugger in this appealing version of a really 'odd couple'."],
      "budget": 0
   },
   "movielensId": 1317,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-24",
      "dvdReleaseDate": "2004-08-03",
      "directors": ["Herb Gardner"],
      "runtime": 135,
      "movieId": 1317,
      "title": "I'm Not Rappaport",
      "mpaa": "PG-13",
      "actors": [
         "Walter Matthau",
         "Ossie Davis",
         "Amy Irving",
         "Marin Hinkle",
         "Irwin Corey",
         "Bobby Cannavale"
      ],
      "imdbMovieId": "0116601",
      "originalTitle": "I'm Not Rappaport",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["ainKV-c-Mho"],
      "plotSummary": "Old Nat Moyer is a talker, a philosopher, and a troublemaker with a fanciful imagination. His companion is Midge Carter, who is half-blind, but still the super of an apartment house. When he is threatened with retirement, Nat battles on his behalf. Nat also takes on his daughter, a drug dealer, and a mugger in this appealing version of a really 'odd couple'.",
      "tmdbMovieId": 61536,
      "avgRating": 3.20173,
      "releaseYear": "1996",
      "numRatings": 347,
      "posterPath": "/b83Z9btqnOMawlBdh6QbKgaCnZl.jpg"
   }
}