{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "callgirl",
            "id": 550
         },
         {
            "name": "san francisco",
            "id": 582
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "murder",
            "id": 9826
         }
      ],
      "imdb_id": "tt0113451",
      "video": false,
      "title": "Jade",
      "recommendations": [
         8744,
         34314,
         4911,
         9455,
         26258,
         9057,
         19760,
         2087,
         10383,
         32669,
         41779,
         47608,
         18621,
         9054,
         9625,
         18550,
         12518,
         31220,
         31640,
         6071
      ],
      "backdrop_path": "/vr1pq6Mjvh1rwOXb3H8SH62GT0C.jpg",
      "revenue": 9851610,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "David Corelli",
               "gender": 2,
               "credit_id": "52fe44959251416c75039f27",
               "name": "David Caruso",
               "profile_path": "/i251LGpMkOeOqRmqlCpKkNoGdni.jpg",
               "id": 16560,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Katrina Gavin",
               "gender": 1,
               "credit_id": "52fe44959251416c75039f2b",
               "name": "Linda Fiorentino",
               "profile_path": "/aKadq5uC9CjCKtkMYPYECNcGz3s.jpg",
               "id": 9625,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Matt Gavin",
               "gender": 2,
               "credit_id": "52fe44959251416c75039f2f",
               "name": "Chazz Palminteri",
               "profile_path": "/d9VkmkEO50zP0kww6aLLFpu5Ovh.jpg",
               "id": 9046,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Bob Hargrove",
               "gender": 2,
               "credit_id": "55640cb8925141060800071e",
               "name": "Michael Biehn",
               "profile_path": "/uZvJIfVirbv32OK4nba5bMZ6t9G.jpg",
               "id": 2712,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Governor Edwards",
               "gender": 2,
               "credit_id": "52fe44959251416c75039f33",
               "name": "Richard Crenna",
               "profile_path": "/nWtMvMnLqGjlIGWNXjshgxsHDih.jpg",
               "id": 16554,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Patrice Jacinto",
               "gender": 1,
               "credit_id": "52fe44959251416c75039f5b",
               "name": "Angie Everhart",
               "profile_path": "/n4coY7os9hPRRLAzcpr4clpLVh1.jpg",
               "id": 58312,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Karen Heller",
               "gender": 1,
               "credit_id": "55640cc8c3a36806c8000d42",
               "name": "Donna Murphy",
               "profile_path": "/tUQp54rrkCJ9u9Ygy8IYiq9DvMk.jpg",
               "id": 2517,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Bill Barrett",
               "gender": 2,
               "credit_id": "589f8b69925141337b00342f",
               "name": "Holt McCallany",
               "profile_path": "/5Mw4StSwWwTLyBapXz9nOg7iUl5.jpg",
               "id": 7497,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Pat Callendar",
               "gender": 2,
               "credit_id": "589f8bdac3a3684fe400326c",
               "name": "David Hunt",
               "profile_path": "/m0geuygvWrekfQMVGR6ltaQLFXy.jpg",
               "id": 47932,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "D.A. Arnold Clifford",
               "gender": 2,
               "credit_id": "589f8cc1c3a3684fd70037cc",
               "name": "Kevin Tighe",
               "profile_path": "/5Q1Z89xsrnLdQWdHLuiaraS89vV.jpg",
               "id": 17770,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Mr. Green",
               "gender": 2,
               "credit_id": "589f8cdac3a3684fd70037e0",
               "name": "Robin Thomas",
               "profile_path": "/seivBO3KRFAKqNgL3wnvpwxHwKz.jpg",
               "id": 41465,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Sandy",
               "gender": 0,
               "credit_id": "589f9635925141336b003e57",
               "name": "Victoria Smith",
               "profile_path": "/o55kEk4WH80XWFhEG8v4zPKxTYY.jpg",
               "id": 1755979,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Executive",
               "gender": 2,
               "credit_id": "589f96c89251413378004233",
               "name": "Drew Snyder",
               "profile_path": "/xW8V4eZaFRm0J2FCNNrcojN8yOg.jpg",
               "id": 52188,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Assistant District Attorney",
               "gender": 1,
               "credit_id": "589f980ec3a3684fd4003e85",
               "name": "Sandy Berumen",
               "profile_path": "/kzrKAYM3xTbNoVnihyXdkuiz1PH.jpg",
               "id": 1457926,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Assistant District Attorney",
               "gender": 2,
               "credit_id": "589f9913925141336b0040cb",
               "name": "Buddy Joe Hooker",
               "profile_path": "/gTgymZkBBvwI7wnsoPTWC28gzLU.jpg",
               "id": 8432,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Assistant District Attorney",
               "gender": 2,
               "credit_id": "589f99adc3a3684fca00427f",
               "name": "Bobby Bass",
               "profile_path": "/dhYgomMBGKdEoIuYqMP0XUNZi9q.jpg",
               "id": 16659,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Assistant District Attorney",
               "gender": 2,
               "credit_id": "589f9c12925141336b004337",
               "name": "Dick Ziker",
               "profile_path": "/wvAre0IvrqfO0aUFZAC8AJN6nIY.jpg",
               "id": 161787,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Mr. Wong",
               "gender": 2,
               "credit_id": "589f9a46925141337400438a",
               "name": "Victor Wong",
               "profile_path": "/70vAqnH2QFhLOenNQCVcaG1JhN3.jpg",
               "id": 11395,
               "order": 17
            },
            {
               "cast_id": 26,
               "character": "Corporate Man",
               "gender": 2,
               "credit_id": "589f9a7f925141336e004400",
               "name": "Kenneth Tigar",
               "profile_path": "/sSdACkgPQYBJVQnd8B6uWpQPjMY.jpg",
               "id": 87128,
               "order": 18
            },
            {
               "cast_id": 27,
               "character": "Technician",
               "gender": 2,
               "credit_id": "589f9ac7925141337e0045ef",
               "name": "Ron Yuan",
               "profile_path": "/7mmuII6M3JGDg5hC9Bl4nORPwEV.jpg",
               "id": 61703,
               "order": 19
            },
            {
               "cast_id": 29,
               "character": "Cop",
               "gender": 2,
               "credit_id": "589f9ec8c3a3684fd400442a",
               "name": "John Wyman",
               "profile_path": "/lGudB77HPoaaWJ2F7dP18b9BkxJ.jpg",
               "id": 10506,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039f39",
               "name": "William Friedkin",
               "profile_path": "/1iBd92izRHpkSH4hOhcUBmF2cv7.jpg",
               "id": 15175,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039f3f",
               "name": "Joe Eszterhas",
               "profile_path": null,
               "id": 10492,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039f45",
               "name": "James Horner",
               "profile_path": "/oLOtXxXsYk8X4qq0ud4xVypXudi.jpg",
               "id": 1729,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039f4b",
               "name": "Andrzej Bartkowiak",
               "profile_path": "/K2pgHC907AUCim8WOkHOJpqERC.jpg",
               "id": 10765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039f51",
               "name": "Robert Evans",
               "profile_path": "/pSzHgQKT3qnCuAFyh3IpilopKt0.jpg",
               "id": 12288,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44959251416c75039f57",
               "name": "Augie Hess",
               "profile_path": null,
               "id": 57326,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.610147,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11863,
      "vote_count": 60,
      "budget": 50000000,
      "overview": "Someone does a nasty hatchet job on a San Fransisco big noise and the Assistant D.A. takes charge of the investigation. Through a web of blackmail and prostitution involving the Governor, an old lover of the law man emerges as a prime suspect and he has to deal with his personal feelings as well as the case.",
      "similar": [
         984,
         357096,
         8090,
         1949,
         979,
         807,
         395834,
         445954,
         25376,
         3134,
         45569,
         10651,
         15069,
         2749,
         37645,
         369300,
         2832,
         1586,
         65754,
         1572
      ],
      "original_title": "Jade",
      "runtime": 95,
      "poster_path": "/koKHFZ0FYd7yG1g3RphU6TQRVOg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-10-13",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Some fantasies go too far.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["William Friedkin"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Joe Eszterhas"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113451/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NzI3MTQ2Nl5BMl5BanBnXkFtZTYwNzM5NDQ5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: David Caruso, Linda Fiorentino, Chazz Palminteri | See full cast and crew »"],
      "reviews": [
         "To say Friedkin's career has had its ups and downs is an understatement, his eighties filmography inarguably has enough bombs to sink a oil tanker. Yet eschewing their performances at the box office, many of his films yearn to be rediscovered, from \"Cruising\" to \"Deal of the Century\" to \"Rampage\". Let's not kid ourselves, \"Jade\" is not a great film, and this is the fault of one man and one man alone - Joe Esterhas. If trash had a messiah, it would be him. For a fleeting moment in the nineties, Esterhas was paid by the bucketload to write formulaic movies for guys, and the erotic thriller has him to thank for its continuing lugubrious existence. \"Jade\" is interesting however, it is an erotic thriller without the erotic part. While Paul Verhoeven filled \"Basic Instinct\" chock full of the sleaze he had become renowned for, Friedkin's films are notable for primarily dealing with male characters, and are subsequently about as erotic as as a bowl of cereal. \"Jade\" is not about sex; it is about sexual jealousy. The talent of Linda Fiorentino cannot be underestimated here, giving depth to a part that amounts to no more than a typical male fantasy - part good girl, part whore - that's right, it's \"Crimes of Passion\" without Anthony Perkins and his bag of dildos. The leads are well cast and all give adequate performances, and Friedkin throws in all his usual directorial touches (subliminal images and, you guessed it, yet another bloody car chase). \"Jade\" is an enjoyable film, with delightfully silly twists and over-the-top violence (come on, you know you want to see Angie Everhart get run over again), and is given some class from it's cast and director, but, in the end, proves itself to be a guilty pleasure that makes one feel more guilt than pleasure.",
         "I think this movie has the lowest IMDB user vote rating of any movie that I like. It is really an entertaining movie and I am not sure why it is getting such poor ratings here. It is not perfect and may have a few plot holes, but it is definitely worth seeing. There must be an anti-Caruso IMDB splinter cell operating in cyberspace and conspiring to drop the IMDB user rating for all his movies about 2 to 3 points. Check it out and see what you think. Linda Fiorentino is truly hot and well cast as the steamy babe. Caruso's performance is very believable. Richard Crenna is underrated and good here too. Angie Everhart and Donna Murphy are pleasing to look at and also give good performances in smaller roles. Ignore the anti-Caruso crowd, who must be a band of closet NYPD Blue freaks that are still upset that he left that show to make films.",
         "Jade got a bad rap when it showed in theaters and still appears to be getting one now from the comments here, so I didn't expect much when I caught it on cable. It never hurts to have low expectations, but I was quite pleasantly surprised and have watched it a few more times since then. No, the plot isn't especially tight nor the story original, and it can be hard to follow at some points, but it's still an exciting, kinky, disturbing ride nonetheless. I think the main reason I enjoyed it was the actors involved - Caruso and Palminteri were both very skilled (and surprisingly sexy - I hadn't found either to be that way in any roles I had seen them in previously, including NYPD Blue). And most of all Fiorentino smokes up the screen whenever she's on it. Sensual, damaged, brilliant. She's amazing when given a good script like the Last Seduction, but even with a flawed effort such as Jade, she still sets the house on fire. The cinematography and art direction were the other thing that made this film. I loved the lavish sets and especially the eerie lighting during the final scene. And as far as the comparisons to Basic Instinct, I see it as being about equal, suffering from the opposite problems as Jade; while the story was far more interesting the acting was pendantic at best. But maybe that's just my personal bias; I find Michael Douglas pompous and annoying and Sharon Stone shallow and vain.",
         "Don't believe all the negs about this pix. It's not just another \"Basic Instinct,\" either. Chaz and Linda are the consummate couple. V-e-r-y classy. The set decorations are fantastic. I absolutely vote Linda the quintessential queen of soft porn (or was it \"hard\"--I haven't yet seen the uncut version). Was it Linda or was it Memorex? Whoever it was, her legs are fabulous! Angie Everhart's sultry soliloquy describing her passion for LF (Trina) was like butter melting on a hot lobster. I found myself replaying that scene over and over just to capture the full essence of the moment. The hit-and-run scene was extremely graphic, (wow,what a stunt!) except to Friedkin fans who expect a certain amount of gratuitous violence. The final scene with CP and LF was perfect. I could feel the sexual tension jump out from the screen. The beautifully haunting song, \"Mystic Dream,\" by Loreena McKennitt fit the dark mood perfectly. I still don't know why I love this movie; to borrow a line from the film, it must be \"hysterical blindness.\" Go see this movie with a date, and have a great time together afterwards!",
         "\"Jade\", written by Joe Eszterhas, has enough sex, nudity, and violence to keep it from ever becoming boring. Millionaire Kyle Medford is murdered and Assistant D.A. David Corelli is assinged the case, and all clues point to his former flame Katrina Gavin as the prime suspect. Katrina is now married to David's best friend, hot shot lawyer Matt Gavin. Every time Corelli uncovers a new witness, they are wiped out leaving him with no clues to go on, and it now appears Katrina may also be a prostitute catering to rich men under the alias of Jade. The ending is quite unexpected, and you'll never guess who the killer is. Try to see the unrated version because it adds a lot of footage cut from the R version and has a better ending. \"Jade\" is Unrated for strong aberrant sexual content, nudity, graphic violence, gore, and for adult language. NOTE: \"Jade\" is also available in an Unrated version that includes 12 minutes cut from the R-Rated version. It has extra scenes of dialog, stronger sex and nudity, and a much better and less choppy ending.",
         "I think this may have been successful in its day, simply because of the sex. There is the appearance of some sex acts on the screen presented in a couple voyeuristic contexts, but I think the target was a much deeper appeal: a whole world driven by insatiable, conventionally deviant female sex drive. The writer had previously cashed in with this idea and Hollywood chose to try again but with a real director. This formula isn't just about sex, its about turning the noir mechanics on its head. Noir depends on an outside fate that arbitrarily throws strangers together in situations that are designed for and controlled by the values of watching, outside the world of the action. Here, everyone knows each other beforehand. There are essentially no strangers. The driving force is supernatural as in noir, but it is rooted in and owned by the people we see. Its simple sexual desire, lust. The story is ordinary, the sex unconvincingly simulated. Even the automotive stunts are limp. There's some craft in how it is put together visually though, enough to keep me engaged. But there is one remarkable feature. The score is hypnotizing. It is bicameral, both halves based on prototypical themes. The male theme: lustful, uncontrollable and apt to be violent is from (almost directly) Stravinski's Rite of Spring. Its wildly erotic, threatening, dangerous. The female side (until the end that is) is a Celtic anthem, soft, passive, receptive, drifting. I do not ever recall something so directly cast, so borrowed and yet so effective. I saw this close to a film (Duel at Diablo) where the score was literally canned bits from old movies and the dialog all dubbed). This part is fun, and much more tantalizingly erotic than what you will see. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "I'm shocked by the huge number of negative comments. This film is great, obviously written before Showgirls was released (when the screenwriter's ego was still intact.) Between Joe's deliriously entertaining B-movie dialogue and Friedkin's rock-solid direction, I find this movie fascinating and fun, the only downpoint being the lackluster ending. Jade has the greatest car chase I've seen in any film since the last time this director tackled one, and it's full of cute little references to the rest of his career. There is even a blatant homage to \"Cruising\" (Al Pacino) for those of you who were really paying attention. When David Caruso takes those cufflinks out of the drawer and looks in the mirror as we fade to the beach skyline...shot for shot and beat for beat it's the last two shots of Cruising, and it even conveys a similar meaning. This movie is clever, raunchy, sexy and fun. It's not the greatest film ever made, but it certainly deserves a lot more credit than it is receiving here. When did film lovers become such humorless prudes? (And why did Friedkin insist that the DVD be released only in a fullscreen version? Why, why, why???)",
         "\"Jade\" hasn't got enough in the way of memorable scenes or entertaining dialogue to be a thriller. My impression is of a \"that'll do, let's get it in the can\" attitude towards the script, the direction and the lack luster air of some of the cast. The video cassette I have says on the packaging:\"An Erotic Thriller\". There is quite a lot of what could be called sex in this movie, but the last thing it has is eroticism. I bought my copy from the special offers rack at a local store, reduced 70% from retail. There is a hung jury on whether or not I wasted my money! Two of the leading players, David Caruso \"David Corelli\" and Linda Fiorentino \"Trina Gavin\" look uncomfortable in every scene they do. When David Caruso left east coast cop TV to make movies in Hollywood I imagine this by the numbers effort wasn't the sort of thing he had in mind. Linda Fiorentino has made better appearances too. I prefer to remember her in \"The Last Seduction\" and \"Body Count\". \"Body Count\" also provides an opportunity to see David Caruso doing much better work. Perhaps fortunately, Chazz Palminteri and Richard Crenna seem completely at home with their roles of \"Matt Gavin\" and \" Lew Edwards\" respectively. The MG characterization is well done. Chazz Palminteri's interpretation, with its calculated cordiality and sinister edge, makes a decent job of unexceptional material. LE is Governor of California. Richard Crenna gives him just the right amount of ruthless deviousness to be entirely believable as a career politician. Other things about \"Jade\" are worth a mention - at least they interest me, anyway! The set dressing of the rich man's house has been done in impressive style by people who clearly know how to create visual atmosphere. Some of the soundtrack music is also better than routine. The closing credits are accompanied by an excellent, haunting vocal, \"The Mystic Dream\", performed by Loreena McKennitt. At least I think that's the lady's name, the credit is fuzzy on my tape. Being few and far between, the good bits don't save the movie.",
         "Make no mistake: (1) this IS a sordid crime story and (2) is is FAR better than the national critics - and the ones here - would have you believe. I have found it fascinating the three times I've watched it and look forward to seeing it again. It surprises me each time, being better than I remembered. It's nicely photographed, too. Why I can't get a widescreen DVD of this, I don't know, but all that seems to be available is full screen. William Friedkin directed this which usually means (1) a riveting story; (2) stylish cinematography. That's the case here. I rate this movie so high mainly because it's so entertaining. And it doesn't overstay it's welcome at a short hour-and-a- half. There are some stunning action scenes with cars hitting people, cars hitting cars and a long, wild car chase through a parade in San Francisco's Chinatown. My only complaint is the normal Liberal in-your-face bias that Hollywood always seems to show. They just can't help giving you their pro-Democrat, anti- Catholic, anti-authority bias. Early scenes provide some cheap shots on Nixon and Reagan and later we see the film's two male starts talking irreverently in church. The governor is a sleaze in the story and the cops are corrupt. I've just come to except these modern-day film clichés and not let it interfere with my enjoyment of the film. Speaking of actors and characters, David Caruso and Chazz Palminteri are the two male leads I referred to in the previous paragraph. They are both good. Why Caruso didn't make it in the movies must have been due to the roles he took, not his acting. Linda Fiorentino does what she does best - plays a whore. There isn't a moral person in here, at least with the lead actors. That's no surprise since \"sleaze king\" Joe Eszterhas wrote the script. Nonetheless, those three actors are very good with Caruso, as the cop, the best. It's a crude story at times (there was a NC-version available of this, as well), but it's very interesting start-to-finish, has some memorable scenes, nice San Francisco scenery and a nice soundtrack from Celtic singer Loreena McKennitt.",
         "This is a Basic Instict rehash plain and simple, actually it's a pre draft of basic instict. The directing is a mess, I can't believe this guy shot the french connection. But now he's old and where he tries to be different here, he is instead just plainly bad...Tight close ups for no reasons, boring set scenes, saturated photography...the cast is decent but with such a trite script...the dialog is worse than trivial. Its only saving grace is an unintended one, and maybe with that meditation in mind this can actually become a good film: Because the grotesqueness, blandness and stupidity in the realisation and script of this film reflects the world of powerless unsexual morons acting all powerful and sexual. Obviously this is unintended as this tries to be edgy, erotic and smart. It tries to be a murder mystery, a who done it on coke a la BI, but it ends up being a who gives a ..., I 've never been so emotionally detached at the end of any mystery. But in this way it poetically conveys within it's form the artificiality of power and sex, the dead end that is pleasure without sentiments and sensibility. A bland, derivative, tasteless film about power, sex and wealth, that fails so miserably that its failure becomes a medium of expression and gives the film an unintended second narrative level. It's also starkly realist, because what can be more real than a failed Hollywood flop on sex, money and power. You don't see people doing realistic actions, but you see people acting, directing badly, writing scripts badly. The epitome of decadence. It could even be quite a good sobering experience, even weirdly lyrical if one watches it with that in mind."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Someone does a nasty hatchet job on a San Fransisco big noise and the Assistant D.A. takes charge of the investigation. Through a web of blackmail and prostitution involving the Governor, an old lover of the lawman emerges as a prime suspect and he has to deal with his personal feelings as well as the case.",
         "When the assistant district attorney of San Francisco investigates the mysterious death of an important millionaire he discovers that the first suspect in this case is a friend of his who is married to an important lawyer. Now it is difficult for him to distinguish between what is reality and what should be reality.",
         "A bright assistant D.A. investigates a gruesome hatchet murder and hides a clue he found at the crime scene. Under professional threats and an attempt on his life, he goes on heartbroken because evidence point to the woman he still loves."
      ],
      "budget": 50000000
   },
   "movielensId": 132,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-13",
      "dvdReleaseDate": "1999-02-16",
      "directors": ["William Friedkin"],
      "runtime": 95,
      "movieId": 132,
      "title": "Jade",
      "mpaa": "R",
      "actors": [
         "David Caruso",
         "Linda Fiorentino",
         "Chazz Palminteri",
         "Michael Biehn",
         "Richard Crenna",
         "Angie Everhart",
         "Donna Murphy",
         "Holt McCallany",
         "David Hunt",
         "Kevin Tighe",
         "Robin Thomas",
         "Victoria Smith",
         "Drew Snyder",
         "Sandy Berumen",
         "Buddy Joe Hooker",
         "Bobby Bass",
         "Dick Ziker",
         "Victor Wong",
         "Kenneth Tigar",
         "Ron Yuan",
         "John Wyman"
      ],
      "imdbMovieId": "0113451",
      "originalTitle": "Jade",
      "genres": [
         "Action",
         "Thriller",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Someone does a nasty hatchet job on a San Fransisco big noise and the Assistant D.A. takes charge of the investigation. Through a web of blackmail and prostitution involving the Governor, an old lover of the law man emerges as a prime suspect and he has to deal with his personal feelings as well as the case.",
      "tmdbMovieId": 11863,
      "avgRating": 2.76791,
      "releaseYear": "1995",
      "numRatings": 2206,
      "posterPath": "/koKHFZ0FYd7yG1g3RphU6TQRVOg.jpg"
   }
}