{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "mirror",
            "id": 46951
         },
         {
            "name": "ghost",
            "id": 162846
         }
      ],
      "imdb_id": "tt0103678",
      "video": false,
      "title": "Amityville 1992: It's About Time",
      "recommendations": [
         33519,
         41848,
         55377,
         52263,
         27771,
         26959,
         26962,
         44909,
         27214,
         38499,
         28344,
         26957,
         223732,
         110588,
         153998,
         35978,
         27345,
         25395,
         93886,
         26740
      ],
      "backdrop_path": "/zKQ6yUCmcaaHNUfNopSB9R27CTH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jacob Sterling",
               "gender": 2,
               "credit_id": "5372ff14c3a3681530000a13",
               "name": "Stephen Macht",
               "profile_path": "/wK0IYAaQHugT8UpdN7Fvzz8bjxp.jpg",
               "id": 41274,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Andrea Livingston",
               "gender": 1,
               "credit_id": "5372ff5bc3a3681509000aa5",
               "name": "Shawn Weatherly",
               "profile_path": "/OxVpJuoNdjnEUjvy1JT9oublN7.jpg",
               "id": 83459,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lisa Sterling",
               "gender": 0,
               "credit_id": "5372ff71c3a368150f0009fe",
               "name": "Megan Ward",
               "profile_path": "/tkdBrtF2uq5v9d2g32JRnoKQFji.jpg",
               "id": 64999,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rusty Sterling",
               "gender": 2,
               "credit_id": "5372ff8fc3a3681539000a59",
               "name": "Damon Martin",
               "profile_path": null,
               "id": 101298,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Leonard Stafford",
               "gender": 2,
               "credit_id": "55f0a1d0c3a3683b0d0000a4",
               "name": "Jonathan Penner",
               "profile_path": "/aozmzC0PU3UImUZXVElVcagk9hT.jpg",
               "id": 226651,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Iris Wheeler",
               "gender": 1,
               "credit_id": "55f0a1f6c3a3683b230000cb",
               "name": "Nita Talbot",
               "profile_path": "/agvQPPZk7niCQZpJfgAo7NWp0CP.jpg",
               "id": 83436,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Andy",
               "gender": 2,
               "credit_id": "55f0a2059251410e230000b3",
               "name": "Dean Cochran",
               "profile_path": null,
               "id": 105686,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Officer #1",
               "gender": 2,
               "credit_id": "55f0a22ac3a3683b190000d8",
               "name": "Kevin Bourland",
               "profile_path": null,
               "id": 155967,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Officer #2",
               "gender": 1,
               "credit_id": "55f0a24dc3a3683b230000da",
               "name": "Margarita Franco",
               "profile_path": null,
               "id": 80284,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "55f0a2789251410e170000da",
               "name": "Willie C. Carpenter",
               "profile_path": "/700iIf7ntH8ilYFustxOxzpASZv.jpg",
               "id": 20760,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mr. Anderson",
               "gender": 2,
               "credit_id": "55f0a2ad9251410e230000c7",
               "name": "Dick Miller",
               "profile_path": "/c2lakgh0bCckVoDxDplqTvMLVZ4.jpg",
               "id": 102441,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5372fddfc3a3681518000a4f",
               "name": "Tony Randel",
               "profile_path": "/4YUKLri68yTJdfMdqu8Qhok9cht.jpg",
               "id": 52194,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5372fe7a0e0a267c55000c60",
               "name": "Christopher DeFaria",
               "profile_path": "/lnR60TTNnX3sLqzK2ZRG6J4rmYz.jpg",
               "id": 66897,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5372fe910e0a267c6a000bfa",
               "name": "Antonio Toro",
               "profile_path": null,
               "id": 110839,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.703729,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41671,
      "vote_count": 27,
      "budget": 0,
      "overview": "When an old clock arrives at home as a gift, strange things begin to happen. The family that proudly assigned a privileged place to the clock in the living room, is unaware that this thing is a link to an old and evil house...",
      "similar": [
         91586,
         77949,
         10014,
         288158,
         2655,
         620,
         335796,
         157547,
         201085,
         452507,
         416160,
         441701,
         19592,
         4011,
         8839,
         166271,
         79694,
         23827,
         1562,
         9552
      ],
      "original_title": "Amityville 1992: It's About Time",
      "runtime": 95,
      "poster_path": "/nJiglOtMoWIwBpiGLxMRVqk2GGG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "VPS Studios",
            "id": 84937,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Steve White Productions",
            "id": 35872,
            "origin_country": ""
         }
      ],
      "release_date": "1992-07-16",
      "vote_average": 3.8,
      "belongs_to_collection": {
         "backdrop_path": "/kPfuozrsE7pmFFolkR0xFicZDJT.jpg",
         "name": "The Amityville Collection",
         "id": 397842,
         "poster_path": "/stPXPasI1lvxJRJJuDCKBr6X836.jpg"
      },
      "tagline": "The terror returns... with a vengeance!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tony Randel"],
      "runtime": 95,
      "synopsis": "Jacob Sterling (Stephen Macht) is an architect who has just returned home from a business trip in Amityville. Jacob lives in California in Burlwood, California in a suburban housing development. Jacob's ex-girlfriend, art student Andrea Livingston (Shawn Weatherly) is watching Jacob's two teenage kids, naive Lisa (Megan Ward) and troubled Rusty (Damon Martin), while he's gone. When Jacob returns, he informs them that Amityville wants his company to develop a new neighborhood with a timeless concept. Jacob has also brought home an old, mantle clock that he found in the remains of an old house in Amityville. Jacob puts it on the fireplace mantle, stating that it's \"what our house has been missing\". Once it's on the mantle, however, things take a turn for the worst. It turns out the clock's ticking is incredibly loud, even so it can be heard upstairs. Unknown to the family, the clock attaches itself to the mantle, preventing it from being moved. But the strangest of all, Rusty goes downstairs in the middle of the night and turns on the living room light switch. Everytime he flips the switch, the living room is replaced with an ancient looking torture chamber. This happens until the lightbulb finally burns out. The next morning, after Lisa and Rusty leave for school (though we later learn Rusty actually skipped school that day), Jacob decides to go jogging. As he reaches the end of the jog his digital watch mysteriously stops. He turns around to find his neighbor Mrs. Tetmann (Terrie Snell) and her dog, Peaches, standing there ominously. Mrs. Tetmann lets go of Peaches and Peaches attacks Jacob, viciously mauling Jacob's leg. Jacob manages to escape by slashing Peaches's face with a broken bottle. At the hospital, the doctor (Willie C. Carpenter) mistakens Andrea for Jacob's wife. He tells her that Jacob's wound will have to be cleaned and rebandaged every few hours. Andrea agrees to stay with Jacob for a few more days until he's able to walk. At home, Jacob doesn't take care of his wounded leg, and refuses to let Andrea clean it out. Meanwhile, Rusty (skipping school) visits the neighbor, Iris Wheeler (Nita Talbot). He tells her about what he saw in the living room last night. She assumes that what Rusty saw was an evil force. It was afraid of Rusty and was trying to win him over. She says it would only go to their home because where it used to be is gone: \"It must find a new home\". When Rusty gets home, Andrea and him go to Mrs. Tetmann's house to ask if Peaches was vaccinated. Mrs. Tetmann doesn't know what they're talking about and says that she and Peaches never even left the house that day. She even shows them Peaches face and there's no trace of a cut. Rusty spends a lot of time thinking about what Iris said. Jacob, rather than resting, is busy designing a model for a new neighborhood. At dinner, Andrea asks Rusty to go get the phone book from the living room, which usually only takes a minute or two. However, when Rusty (who was talking the whole time) gets back into the living room, three hours have passed. Lisa lets Andrea have her room for the night and she sleeps on the couch in the living room. But the loud ticking from the clock keeps Lisa awake all night. Finally, near 3:00 AM, she asks Andrea if she can sleep with her. Andrea says yes and tells Lisa to get her pillow from The living room. But when Lisa gets her pillow, the living room doors slam shut and lock. In Andrea's room, she hears the door open and something gets in bed with her. She finds the other side of the bed drenched in black slime. She turns the light on, but it's not there. Andrea goes downstairs and unlocks the living room doors, letting Lisa out. She suspects that Rusty may have locked them, but he tells her he went for a walk. The next morning, Andrea learns that Peaches was murdered the night before and a swastika has been drawn in blood on Mrs. Tetmann's house. The police suspect that Rusty may have had something to do with it. That night, Andrea's boyfriend Leonard visits and had a hallucination of Jacob shooting him with a gun. The next day, Rusty visits Iris' house and describes to her the things he had seen in his living room and telling her that it all began the night his father had returned home from Amityville. Iris later figures out that it is the clock that's causing everything to go wrong but on her way to warn Rusty she is killed by duck status that falls from the roof. Meanwhile, at the Sterling residence things starts to go terribly wrong with Lisa's boyfriend Andy melting into the floor, Leonard encountering goo and a zombie that rises out of the bathtub, and Jacob acting aggressively. Andrea manages to overcome Jacob's attack but is unable to destroy the clock before it rewinds back to the first night Jacob brought the clock home. This time however, Andrea smashes the clock when Jacob comes home with it and when Jacob asks her \"What the hell was that all about?!\", She replies, \"It's about time that's what!\" and the credits roll.",
      "writers": [
         "John G. Jones",
         "John G. Jones"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103678/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NTQ3MTc2OF5BMl5BanBnXkFtZTcwODEzMjEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Stephen Macht, Shawn Weatherly, Megan Ward | See full cast and crew »"],
      "reviews": [
         "This one is probably one of the better sequels, and though it doesn't really live up to the classic standards, it sure packs a punch. Unlike the fourth and seventh and eighth sequels, this one delivers far more suspense, though a lot of it is typical and expected, such as the declining sanity of the buyer of anything related to Amityville. But it's well-done/well-put-together, and the idea of an Amityville-possessed clock is far more ominous than a stupid lamp, mirror, or a doll-house, you've got to admit. It even has some real gore thrown in there... what a surprise... Also, this is the first Amityville that really relies on lies, cons and deceits of people and how things like that can tear families and attachments into shreds. It's a decent sequel, I suppose.",
         "After the special effects heavy '3-D,' the hokiness of 'The Evil Escapes,' and the barely related 'The Amityville Curse,' the haunted house series that started in 1979 either needed a permanent rest or a shot of life in the arm. In 1992 Republic Pictures released the sixth installment straight to video and after the blandness that was the previous installment I don't imagine it was met with much enthusiasm. And lets be honest, the world really didn't need another 'Amityville' sequel did it? But to the surprise of some viewers this sequel was actually not too bad. In fact it's actually rather good; more than it has any right to be. Pros: Has some of the best writing in the series. Strong performances from everyone involved. A really nice score from Daniel Licht, who kind of made a career out scoring direct-to-video sequels in the 90s. Moves at a fine pace. Some creative and graphic death scenes. Excellent work on the special and make-up effects. A couple really intense and scary sequences. Predictable is not a word I would use when describing this film. Cool twist ending. Cons: Though not a bad directing job it's nothing spectacular, especially compared to Tony Randel's work on 'Hellbound: Hellraiser II.' The finale is exciting, but also maybe a bit too over-the-top. Lacks the feeling of dread and sharp scares of the first two. Final thoughts: I'd always enjoyed the first four films in this series, but never thought that highly of them. I also never expected this sequel to be as good as it is. Nowadays the majority of sequels that go straight to the video store shelf aren't watchable and a complete waste of time and money, but 'Amityville 1992' is one of those rare examples of one done right. My rating: 4/5",
         "For the sixth installment, the Amityville series is back in California, as in Amityville: The Evil Escapes (\"Amityville 4\"). This time, Jacob Sterling (Stephen Macht), a single father and an architect, brings the \"Amityville Curse\" home with him by way of a possessed clock that he picked up on a business trip to Amityville. The fact that the clock is the source of the burgeoning evil our cast of characters encounters is one that they don't really figure out for themselves until near the end of the film, but it's not a spoiler to reveal that to readers, because it's clear from the very first scene that the clock means trouble. So this is one of those films where the audience will be egging characters on to figure out something that the audience already knows, and which it often seems the characters should more easily discern. Director Tony Randel seems to have chosen the setting of the film to invite associations with the Poltergeist series. The suburban neighborhood of Amityville 1992: It's About Time, or \"Amityville 6\", looks very similar to the neighborhood in Poltergeist; for all I can remember of Poltergeist at the moment, it may very well be the same location. But it doesn't matter if it isn't, the desire is still there to latch on to same kinds of archetypes, so that evil invades generic U.S. suburbia, with the hope of making the fears more relatable and immediate for the audience. That's not the only film reference that Randel makes. One of the odder and more enjoyable ones, for which I still haven't figured out the symbolism, is a fairly literal quoting of Ed Wood's famous footage of Bela Lugosi in front of Lugosi's home, walking out of the front door with a black cape on (of course), and slowly going over to smell a flower. Wood shot the footage without a specific use in mind. It ended up in Plan 9 from Outer Space (1959). Randel recreates the scene (minus the flower in a direct way) with Iris Wheeler (Nita Talbot), one of the more interesting, although a bit underused, elements of Amityville 6. The appropriately named Iris is something of a \"seer\". She has visions of evil invading the Sterling household almost immediately. Later on, she functions as a plot facilitator in a number of useful ways--she provides a link to a more esoteric, supernatural world while simultaneously anchoring, catalyzing and supporting our more grounded/realistic characters' mounting beliefs, she provides important historical information, and she is the first to be dispatched by the evil presence. Her death scene manages to be amusingly ironic, and maybe even a bit absurd, but without bringing the film into a humorous mode; it veers towards but doesn't quite visit campiness, as do many subsequent events. The twisted relationship dynamics in the film are particularly interesting. Jacob returns from his trip to Amityville to greet his children and Andrea Livingston (Shawn Weatherly), a former live-in lover who was watching the kids. Jacob quickly reinitiates their physical relationship, but Andrea makes no bones about wanting to get back to her boyfriend, Dr. Leonard Stafford (Jonathan Penner). Jacob suggests that Andrea have Leonard stay at the house, and eventually, this does happen. Meanwhile, Jacob is supernaturally devolving into a George Lutz-styled monster, from the same forces that got to George, but Jacob is also physically transforming--or deteriorating more accurately--in a more literal way. There is complex love triangle material between the three throughout much of the film, and Randel executes most of it so it works on two levels--as a straightforward but twisted soap opera and as horror with a strong psychological edge. This is reflected in Leonard's job--he's a psychiatrist, and appropriate to one of the popular stereotypes about psychiatrists, Leonard is the character who falls apart psychologically in response to the Amityville curse. The Amityville force has often been about unhinging deeply suppressed \"dark\" feelings and desires in its victims. That works as a catalyst for the twisted relationship dynamics, including between Jacob's kids, Rusty (Damon Martin) and Lisa (Megan Ward). Lisa is the one with more hedonistic suppressed desires, which might seem surprising given the initial character development of the two kids, but on the other hand, Rusty is more outwardly expressive from the beginning, so maybe it's not so surprising after all. The more purely supernatural aspects of Amityville 6 are both a bit understated and charming in their own way. As suggested by the subtitle, \"It's About Time\", time and especially time manipulation provides the theme for much of the supernatural material. This enables characters to be placed in alternate realities and it gives Randel and his writers another way to explore elements of characters' subconscious minds, including their fears, of course. Maybe more could have been done to work the time theme into the film in various surrealistic ways, as when that material occurs, it's certainly one of the films' strengths, but the decision to take a subtler track and stay closer to soap-operatic realism wasn't a bad one.",
         "Being number six in a long line of AMITYVILLE sequels, AMITYVILLE 1992 (well it seems like it could actually be!) was never really going to be any good. Supernatural horror sequels never really seem to work, no matter how much of a classic the originals were. Look how the OMEN series depleted rapidly in quality, gasp as Freddie Kreuger becomes less of the ultimate evil and more like that old geography teacher that everyone used to play up to - vomit as the EXORCIST franchise went from classic to jurassic... Number six just doesn't sound good! And IT'S ABOUT TIME really doesn't do anything to argue this matter. Some nice ideas are here, don't get me wrong, but the film just lollops along with a pace that starts to feel like time is stopping altogether! The only gratification I got (and the only reason why I held out) was the wonderful scene where the lovely Megan Ward experiences her 'para-sexual' awakening. Great cinema - I can't really complain! So make of this review what you will - AMITYVILLE is not nearly as bad as some from this genre, and it is not entirely unenjoyable. Just plan something else to do at the same time - this film requires only a fraction of your attention (about 10 minutes halfway through actually!), so your brain might start to drum its bio-rythmical thumbs...",
         "Amityville 1992: It's About Time (1992) ** (out of 4) Jacob Sterling (Stephen Macht) returns from a business trip in NY and has an antique clock with him. It turns out that this clock has a bad history including being present in the infamous Amityville house. Soon all sorts of bad things are going on so Jacob's son (Damon Martin) and girlfriend (Shawn Weatherly) must try and destroy the clock. This here was the sixth film in THE AMITYVILLE HORROR series and it was one (of many) that went direct-to-VHS back in the day. I think what really hurts this film's reputation is the \"Amityville\" title because I'm sure there are fans of the original three movies (why I don't know) who come to this cheap horror film and are disappointed that it's really not connected. Like HALLOWEEN III, if this film was released on its own and not part of a series then perhaps it would be enjoyed more. With that said, no one should mistake this for a good movie because it's not. However, it's still better than your typical low-budget film. The story itself isn't the greatest in the world but I think there are enough interesting ideas to where you can stay entertained. The film also benefits from some pretty good special effects and you're going to be shocked at how good they are compared to most movies like this. We get a rather vicious dog attack that looks quite real and the leftover impact of the attack is on full display throughout the rest of the movie as the wounds continue to ooze blood and other stuff. There are also a few other creative death scenes but one is without question really bad and I'm not going to spoil it but it's something that happens after an almost death by car. You won't miss the scene. The performances are also better than normal with Weatherly really coming across good as the girlfriend. AMITYVILLE 1992: IT'S ABOUT TIME shouldn't be looked at as a masterpiece or any sort of good cinema but it's certainly much better than most films in the series.",
         "'It's About Time' rehashes a concept last seen in 'Amityville IV: The Evil Escapes', in that an artifact from the infamous Long Island house is relocated into the home of another family, where it soon begins to take over their lives with its demonic intentions. Hardly surprising, given that John G. Jones was the scribe for both installments. This, I have to say, is the better attempt, and it goes a long way towards rebuilding the damage done by the painful and indeed execrable 5th film, 'The Amityville Curse'. This time around, the artifact is a clock, and its hellish influence not only possesses both the house and its occupants (naturally), but plays around with time itself, breathing at long last some new ideas into the franchise. The tension is reasonably well-paced, allowing for a gradual build until all hell breaks loose. At the same time however, 'Amityville 1992' still suffers from a fairly silly and uneven storyline, aggravated by sloppy editing choices that prevent the overall effort from meshing together seamlessly. Add to this some rather hammy acting from veteran performers Steven Macht and Nita Talbot, along with some just plain bloody awful acting from Jonathan Penner, and it becomes difficult to take the film seriously. Thankfully the principal lead is Shawn Weatherly, who avoids the obvious temptation the script offers to go over-the-top and gives a creditable performance under the circumstances, as does Damon Martin, in what looks to be his final film. Nonetheless, 'It's About Time' makes a far better effort to remember its roots than its two predecessors. With minimal rewrites, IV and V could very easily just be standalone horror flicks, but the plot of VI rests upon the apparently again-destroyed Amityville house's past history. On the one hand, it has no conscious ties to the DeFeo murders, but in the universe of the film franchise, these were supposed to be influenced by the house's long-present demonic incumbents, and it is here where 'It's About Time' builds its story. In the process, it grafts yet another unnecessary centuries-old European explanation for its dark history which I didn't really buy into, but I can let it slide since new ground is being explored. After all, I also have to put aside the obvious fact that if this clock has been in the house all along, why does it only manifest its powers now? Yet this is the most interesting aspect of the film, and if anything, Jones should have really let fly with the time distortion element and tried harder to pull it together into what could have been an even better and possibly mind-bending tale. At any rate, 'It's About Time' pulls the franchise out of the mire that the previous installment dumped it into. It's still fairly silly, but a great improvement nonetheless.",
         "A decent straight to video sequel to a \"popular\" franchise. \"It's About Time\" centers on a possessed clock that happens to be from the original Amytiville house. A family with intentions to renew their life, move to a beautiful mansion. Unfortunately for them, they buy the possessed clock and that's when things start to get horrible. This is probably the second best sequel in the franchise, following \"The Possession\", a sinister sequel. \"It's About Time\" obviously centers on the possession topic and has the occasional poltergeist scenes provoked by the clock's evil glow. This movie scared me when I first rented it (I was 8 or 9) because it has a dark, creepy atmosphere. The mansion is scary enough for a movie like this. The f/x are below average but it's normal for a direct to video sequel. If you are a fan of haunted house or possession flicks, this is a very good option that exploits the greatness of direct to video.",
         "There's not an original moment in Amityville 1992: It's About Time. It's one cliché after another but they're so well produced and cleanly presented horror fans will swallow them whole, like comfort food. Director Tony Randel does the best he can with this direct to video sequel about a possessed clock from the house at 112 Ocean Avenue which finds it's way to a new home in sunny California. Soon time warps and otherworldly dimensions causes chaos for a land developer and his attractive family. Randel also made the inventive horror pic Hellbound: Hellraiser II and he lends the clockwork logic of Amityville 1992 with that Lamarchand puzzle box vibe. Arguably no better or worse than The Amityville Horror.",
         "Jacob Sterling brings home an ancient clock as a gift for his family in a suburban neighborhood and everything begins to fall apart for the Sterling's. It doesn't help that Jacob is estranged from his family to begin with. It is up to Jacob's ex, Andrea to try to keep things civilized, but the house is now full of pure evil. I can't believe it... Hell has frozen over. After so many awful Amityville sequels, I have finally found one that is actually enjoyable. The 4.1 rating unjustly gives this film a bad reputation. What really helps propel this movie is the creativity. Whenever this movie shows signs of growing stale, it has another trick up its sleeve. This movie is pretty low-budget but doesn't lack imagination, that's for sure. At this juncture, they were running out of things to do with the Amityville house itself, so they started using inanimate objects, such as lamps, mirrors, and clocks. The Amityville house isn't really feature in this movie, aside from a couple of visuals here and there. I really liked the innovative things they did with time. It keeps you on the edge of your seat and manages to be shockingly unpredictable with it. I dug the surprising amount of gore. I'm not gonna spoil all the surprises, but nasty dog bites, severed dog head, and a scene involving Megan Ward are the highlights. There is also some decent character development in this one. Even though the family is very persnickety and snobbish, they are developed rather well. Stephen Macht is excellent as the arrogant father. His intense performance was a lot of fun to watch. Shawn Weatherly is solid for the most part as Andrea. She had a few off moments, but came through when all was said and done. Megan Ward almost had me drooling all over my carpet. Her sex appeal is out of this world. Wait until you see her infamous mirror scene. It is a major treat. Damon Martin is a tad annoying as Rusty. I didn't care for his nonchalant attitude. Jonathan Penner talks like he's on crack as Leonard. I couldn't stand him. His character was a smug idiot. Nita Talbot provides some class in her role. The ending is extremely creative and well done. It makes you ponder with a lot of things about this movie. Final Thoughts: I think it is the best movie in the entire series, with Amityville II: The Possession being right up there. It makes up for the low budget with creativity and delivering on it's ambitions. There is plenty to delve into if you're a horror fan. Don't be fooled by the low rating or the bad reviews. This is a bit of a gem 6.9/10",
         "Another straight-to-video sequel in the terrible Amityville franchise. This one is about an architect (Stephen Macht) who brings home a clock that was in the Amityville house. Little does he know it's haunted! Ridiculous on every level. This crapper is probably best known today (if it's known at all) for featuring Jonathan Penner of Suvivor fame in an early acting role. It's pretty much pure garbage. I was sad to see veteran actress Nita Talbot in this. Gotta pay the bills I guess. Most hilarious scene is probably where the daughter's boyfriend melts. Also liked how they managed to fit the title of the movie into the dialogue in a way I'm sure some hack screenwriter thought was clever."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Steve White Productions",
         "VPS Studios"
      ],
      "summaries": [
         "When an old clock arrives at home as a gift, strange things begin to happen. The family that proudly assigned a privileged place to the clock in the living room, is unaware that this thing is a link to an old and evil house...",
         "A widowed father Jake Sterling returns home from a business meeting in Amityville. He brings home a gift for his two teenage kids: an eerie looking old mantle clock. What he doesn't know, is the clock has an evil past being created by a 15th century French necromancer (eater of the dead). The clock is tied to the evil past of Amityville. Soon after placing it on the fireplace mantle, he is attacked by the local neighborhood dog, leaving his ex-girlfriend Andrea to take care of him. As Jake's son and a neighbor get closer to finding out the legend of the clock, all hell breaks loose as hedges are set on fire, the dog is murdered, time begins to skip hours and slow down, Jake's daughter becomes seductive, and many people around them begin to die. Now, no one is safe from the terror as the clock begins to become the house itself.",
         "A wall clock from the infamous haunted house in Amityville finds its way into a family's suburban home where the evil in the mystical clock is soon released, driving all the family members insane by making them see hideous visions and ghostly apparitions.",
         "Jacob Sterling brings home a mysterious clock from the infamous Amityville house, not knowing that it's haunted by demonic spirits."
      ],
      "budget": 0
   },
   "movielensId": 1322,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-07-16",
      "dvdReleaseDate": "2005-10-11",
      "directors": ["Tony Randel"],
      "runtime": 95,
      "movieId": 1322,
      "title": "Amityville 1992: It's About Time",
      "mpaa": "R",
      "actors": [
         "Stephen Macht",
         "Shawn Weatherly",
         "Megan Ward",
         "Damon Martin",
         "Jonathan Penner",
         "Nita Talbot",
         "Dean Cochran",
         "Kevin Bourland",
         "Margarita Franco",
         "Willie C. Carpenter",
         "Dick Miller"
      ],
      "imdbMovieId": "0103678",
      "originalTitle": "Amityville 1992: It's About Time",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["3OPpFp4ZtGo"],
      "plotSummary": "When an old clock arrives at home as a gift, strange things begin to happen. The family that proudly assigned a privileged place to the clock in the living room, is unaware that this thing is a link to an old and evil house...",
      "tmdbMovieId": 41671,
      "avgRating": 1.76623,
      "releaseYear": "1992",
      "numRatings": 308,
      "posterPath": "/nJiglOtMoWIwBpiGLxMRVqk2GGG.jpg"
   }
}