{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "haunted house",
         "id": 3358
      }],
      "imdb_id": "tt0085159",
      "video": false,
      "title": "Amityville 3-D",
      "recommendations": [
         55377,
         16235,
         41848,
         33519,
         41671,
         52263,
         26962,
         26959,
         26956,
         32595,
         29794,
         26957,
         38499,
         26960,
         27816,
         26958,
         35945,
         33061,
         27815,
         13559
      ],
      "backdrop_path": "/xRWwI4l1jYrf0HaoBeMg1LNkstk.jpg",
      "revenue": 6333135,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Baxter",
               "gender": 2,
               "credit_id": "52fe4534c3a368484e04e09d",
               "name": "Tony Roberts",
               "profile_path": "/iyJWLl7vKNaEnhKu0CsAu4iRgsA.jpg",
               "id": 10555,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nancy Baxter",
               "gender": 1,
               "credit_id": "52fe4534c3a368484e04e0a1",
               "name": "Tess Harper",
               "profile_path": "/gJT9fBX04LjmbOzOzYcNbA2ZLF1.jpg",
               "id": 41249,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Elliot West",
               "gender": 2,
               "credit_id": "52fe4534c3a368484e04e0a5",
               "name": "Robert Joy",
               "profile_path": "/xh5eb9p379k9w3NOGRjEyAw2yrP.jpg",
               "id": 19976,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Melanie",
               "gender": 1,
               "credit_id": "52fe4534c3a368484e04e0a9",
               "name": "Candy Clark",
               "profile_path": "/6pGZGgHa09ktPwEcFWNAU3PLFdi.jpg",
               "id": 12407,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Emma Caswell",
               "gender": 1,
               "credit_id": "52fe4534c3a368484e04e0ad",
               "name": "Leora Dana",
               "profile_path": "/rLZFb3BseMB6PndPu7kOlR9lnhv.jpg",
               "id": 76980,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Harold Caswell",
               "gender": 2,
               "credit_id": "52fe4534c3a368484e04e0b1",
               "name": "John Beal",
               "profile_path": "/kxMgHUfeNYN42XadzGM2aUBEU5g.jpg",
               "id": 97314,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Clifford Sanders",
               "gender": 2,
               "credit_id": "52fe4534c3a368484e04e0b5",
               "name": "John Harkins",
               "profile_path": "/4dn1qyY6a8Vrw1a0u7yTb8E4h1b.jpg",
               "id": 68897,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Susan Baxter",
               "gender": 1,
               "credit_id": "52fe4534c3a368484e04e0b9",
               "name": "Lori Loughlin",
               "profile_path": "/vz0O132QhxEWkGOzCiODP2RSZ77.jpg",
               "id": 92509,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe4534c3a368484e04e0bd",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe4534c3a368484e04e0c1",
               "name": "Neill Barry",
               "profile_path": null,
               "id": 97315,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4534c3a368484e04e0c7",
               "name": "Richard Fleischer",
               "profile_path": "/pChGBiYPxqPfozB7GlDFCIjCQxs.jpg",
               "id": 2087,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4534c3a368484e04e0cd",
               "name": "William Wales",
               "profile_path": null,
               "id": 139848,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.466059,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27214,
      "vote_count": 47,
      "budget": 0,
      "overview": "To debunk the Amityville house's infamous reputation and take advantage of a rock-bottom asking price, skeptical journalist John Baxter buys the place and settles in to write his first novel. But as soon as the ink on the deed has dried, people who have come into contact with John and the house begin to meet with shocking fates. Is it all just coincidence, or is the house really the gateway to hell?",
      "similar": [
         2655,
         288158,
         102283,
         381032,
         243688,
         91586,
         77949,
         201085,
         452507,
         380124,
         305615,
         259392,
         11618,
         620,
         50497,
         609,
         416160,
         10756,
         423536,
         11601
      ],
      "original_title": "Amityville 3-D",
      "runtime": 105,
      "poster_path": "/nttiT4ebfMQXYS0hJ0YdTzikZMq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "De Laurentiis Entertainment Group (DEG)",
         "id": 484,
         "origin_country": ""
      }],
      "release_date": "1983-11-18",
      "vote_average": 4.1,
      "belongs_to_collection": {
         "backdrop_path": "/kPfuozrsE7pmFFolkR0xFicZDJT.jpg",
         "name": "The Amityville Collection",
         "id": 397842,
         "poster_path": "/stPXPasI1lvxJRJJuDCKBr6X836.jpg"
      },
      "tagline": "WARNING: in this movie you are the victim.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Fleischer"],
      "runtime": 105,
      "synopsis": "After exposing a pair of con artists with his partner Melanie (Candy Clark) in the infamous 112 Ocean Avenue house in Amityville, Long Island, New York, recently divorced Reveal magazine employee John Baxter (Tony Roberts) purchases the haunted house after being persuaded to by real estate agent Clifford Sanders (John Harkins). While preparing the house for John, Clifford goes into it alone and, hearing footsteps in the attic, goes upstairs to investigate and is locked in the room, where he is swarmed by flies and is found dead of a presumed heart attack or stroke by John. Thinking nothing of Clifford's death, even after Melanie shows him some photos she took of the real estate agent before his death which depict him as a rotting corpse, John moves into the house and lives there, adamant that the house is normal and telling Melanie to later meet him there. While John works (and experiences elevator trouble presumably caused by the house from afar) Melanie goes to the house and makes her way inside, eventually finding the maid and is spooked; the maid leaves shortly afterward. Left alone, Melanie goes down into the basement to check the fuse box when she feels a strange breeze; frightened, she heads back upstairs when the door to the basement flies open on its own and blasts her with an Arctic gale. She is found later that night by John, cowering and hysterical against the wall. Her attempts to convince John that something is inside the house falls on deaf ears. Later, while looking over blowups of the photos of Clifford, Melanie discovers a demonic-looking face in the pictures and rushes to reach John, but crashes her car and dies when the photographs burst into flames and burn her to a charred skeleton, the car going up in flames shortly afterward. Melanie's death is ruled accidental by everyone, including John, who remains oblivious to the evil in his home. While John is away one day his daughter Susan (Lori Loughlin) and her friend Lisa (Meg Ryan) (who is obsessed with the history of the house, claiming it was built on an Indian burial ground) take some boys to the house and use a Ouija board in the attic, but stop the game when the board tells them Susan is in danger before the glass they were using smashes itself against the wall. Susan's friends assume she was playing a prank. Growing bored, Susan and the others go out in John's motorboat while Susan's mother Nancy (Tess Harper) searches the house for her daughter, who walks in the door drenched moments later. After Nancy calls out at her, Susan turns and smiles at her, then ignores Nancy and makes her way upstairs, locking herself in her room. Outside John arrives with groceries and, seeing a commotion on the docks, goes to see what is wrong and finds Susan's lifeless body being tended to, her friends telling him she fell out of the boat. When Nancy arrives at the scene John tells her what happened, causing Nancy to go into hysterics and tell him she saw Susan in the house moments ago before rushing back inside, convinced Susan is either still there or will be shortly, refusing to leave, even for Susan's funeral. After having nightmares about the old well in the basement (a supposed gateway to Hell) John, unable to deal with Nancy's delusions that Susan is still alive, consults his friend Doctor Elliot West (Robert Joy) about what he should do. West suggests that John allow him and a team of paranormal investigators to set up in the house, to help prove if Nancy actually saw something or not, which John agrees to. As Elliot, John and the team wait, Nancy sits by Susan's bed and is soon confronted by a spectral being speaking in Susan's voice, which goads her into following it into the basement, where the old well has filled with liquid. Following Nancy and the being, John and Elliot begin trying to goad whatever is in the well to reveal itself and let Susan (who they believe can come back) go. While near the well Elliot is burned and dragged into the depths by a demon and Susan's specter disappears as John and Nancy flee upstairs, telling Elliot's team to run. As the house quakes and starts coming apart, freezing on the inside, most of Elliot's team is killed by flying and exploding objects while John and Nancy and several others escape out a window just before the house blows up. While the remaining paranormal investigators flee, John and Nancy watch as the rubble of the house burns to the ground and the old well bubbles ominously. A fly is later seen emerging from it and disappears.",
      "writers": ["William Wales"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0085159/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNjYyNjU2OV5BMl5BanBnXkFtZTcwNzU2NzgyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Tony Roberts, Tess Harper, Robert Joy | See full cast and crew »"],
      "reviews": [
         "Why would anyone want to live in the Amityville house? It's got a bilious basement with a bottomless pit, a lethal living room, and feral flies that swarm in the attic. The sinks don't work either. In fact, this house is going straight to Hell - literally! Into this questionable piece of real estate moves Tony Roberts, a skeptical journalist who doesn't believe the horror stories concerning the house (or hasn't learned anything from the first two movies) and is determined not to let `superstition' get the better of him. But get the better of him it does\u0085 This is in no way a great movie \u0096 but it keeps me entertained every time I watch it, the hallmark of good low-budget horror fun. And dig that neat poster \u0096 great horror movie graphics! There's also some amusement to be had due to the presence of a few future stars in the cast \u0096 such as Lori Loughlin as the daughter of the journalist, who would trade in her haunted house for a Full House. And then there's Meg Ryan, touring the Amityville residence and pondering the joys of sexual relations with ghosts. Whatever floats your boat, Meg!",
         "Probably the best movie of the series, I think. Okay, that's not saying much, but it's actually quite enjoyable. And probably the strongest, plot wise. A magazine writer who happens to debunk psychics ends up buying the infamous house for cheap, blackmailing the current owner (a realtor, who is worried about his reputation, he had leased the house to two fake pyschics). And wackiness ensues. But it's not over the top at first, more general creepiness. There's nothing really special effect wise until the end, at which it does get a bit silly, but it's quite a finish. It was originally in 3-D, and so you see a lot of shots that were intended to capitalize on this - frisbees thrown at the camera, flying swordfish, etc. Also notable about this movie, it's the source for a quote frequently sampled by My Life With the Thrill Kill Kult.",
         "***SPOILERS*** Hell literally freezes over in this third and final chapter of the infamous Amityville House by the river with the place being blown to bits taking an entire crew of ghost investigators, or busters, and ghost detectives along with it. I wondered watching the movie unfold if it was the two investigative reporters for the skeptical Reveal Magazine John & Melanie, Tony Roberts & Candy Clark, trying to be too smart about their ability to expose psychic frauds that lead to the horrors that happened to them as well as everyone else in the movie. Doing their job in exposing psychic frauds both John & Melanie flush out the Caswells, John Beal & Leora Dana, in a phony and staged psychic reading that they gave them for their dead young son Ricky in, of all places, the Amityville Horror House. Feeling good about himself in his job as a \"Ghost Exposer\" John really goes overboard by buying the dangerous and haunted house himself since no one wants to not only live in it but even live next to it. With John about to move into the haunted house strange things begin to happen. The real estate agent Clifford Sanders, John Harkins,who sold the house to John is found dead by John on the steps of the house from an apparent heart-attack. Melanie who took a number of photos of John and Sanders finds that the photos of Sanders have a strange smug on them that when it's magnified the smug looks like a little devil. Things start to get out of hand with Melanie ending up dead in a car crash where she burned to a crisp and John's daughter Susan, Lori Loughlin, drowning in the river outside the house. To the surprise of her mom Nancy Baxter, Tess Harper, she's seen alive walking up the stairs to her room dripping wet with a weird smirk on her face. John himself has a few close calls with death in an elevator in the building where he works and in his bathroom when he's confronted with live steam gushing out of the bathroom faucets and the walls in the bathroom closing in on him. With his co-worker , Melanie, roasted to death his daughter, Susan, drowned and his wife, Nancy, going insane John gives in and decides to have his house checked out by a \"Ghost Buster\" team lead by psychic expert and investigator Eillot West, Robert Joy, to find out and see if there's something to all this tragedy that struck John his family and friends. What the team finds out isn't pretty in that before their through checking out the Amityville House the Amityville House will be through with them. Passable horror movie that does have it's moments and at least tries to make some sense to it's audience of what's happening on the screen with a very young Lori Loughlin and Meg Ryan as Susan Baxter and Susan's best friend Lisa who's also a armature medium and psychic in the film.",
         "Journalist moves himself and his family into the infamous Amityville house after a fake senace thinking all the rumors about the house are fake. Well....when his family starts to die and weird things begin to happen, he discovers that the house may be haunted after all. Horror film may have had some merit on the big screen in 3-D, but on video it comes off as slow paced, dull, and boring. Only point of interest is some early appearances by Lori Loughlin & Meg Ryan.",
         "There must have been a law in the 1980's that stated that if you are to make a third film to a set of horror movies you must make them in 3-d as this was one of them, along with other such fine films as Jaws 3-D and Friday the 13th part III in 3-D. Sad to say, but I enjoyed all these movies even though I know in my heart of heart they were all bad movies. However, just because a movie is bad does not make it non-entertaining. Well at least to me it does not...perhaps to a more mainstream viewer, I admit I am a little more offbeat than most people to say the least. This story has a guy moving into the Amityville house for whatever reasons after he proves this one little group of people are fake psychics. Through a series of events though he begins to find out just how real the horrors are in the house that has had cast evil upon all those who lived there. I have to say the movie is not as graphic as the second movie, but it has a lot more to it than the first movie in the ways of scares and such and it has a nice conclusion too. Still the movie has to many 3-D moments too to be a really good movie. You know the scenes, pointless scenes where they aim something directly at the camera and such. Still, the movie runs at a fast clip and is entertaining to watch, plus you get to see a young Meg Ryan in one of her first roles.",
         "Whether you believe the events depicted in both the novel and film entitled 'The Amityville Horror' or not, you've got to admit it's a great story. One that, frankly, has yet to be adapted faithfully to the big screen. Oh well, maybe some day. Meanwhile, the 1979 film adaptation was followed by one of the biggest slews of sequels in horror movie history. Like with most other franchises, the sequels really aren't necessary, but at the same time that doesn't make them bad films or no fun. This is the case with this second sequel, which took advantage of the 3-D movie craze of the early 1980s. Know what that means? You guessed it, a no-brainer excuse for state-of-the-art special effects to be thrown at the audience. In the case of this movie, that's not a totally bad thing. Pros: The pace never drags. Each cast member, except for maybe Tess Harper, gives the best performance they can with the material and at least seem to be enjoying themselves. Howard Blake, replacing 1 & 2's Lalo Schifrin, composes a decent, spooky score. Director Fleischer does a good job of making the old house look menacing and gets a few other good shots too. At least a couple good chilling moments. Some of the special effects are pretty good. A powerhouse finale. Cheesy fun if you don't take it at all seriously. Cons: Lacks real scares. The plot is super thin and really just an excuse for the filmmakers to use flashy effects. Loaded with haunted house clichés. Some cheap effects, especially that one big fly. Tess Harper is the only actor in the film who seems to be uncomfortable and therefore gives a mostly stiff performance. Final thoughts: Won't stand up well to classics like 'Poltergeist' and the original 'The Haunting,' but this second sequel to the 1979 chiller is good clean fun if you're looking for nothing more than an hour and a half of entertainment. Though I enjoyed this on some level, I can see why the subsequent sequels went straight to video because the series was starting to turn into self parody at this point. My rating: 3/5",
         "Surprisingly, this second sequel to the supposedly fact based thriller \"The Amityville Horror\" is a worthy installment in the otherwise wretched series of shockers. Richard Fleischer, a Hollywood veteran whose directorial credits include such diverse fare as \"The Vikings\" and \"The Boston Strangler,\" brings a skill to the proceedings that were conspicuously absent from the original film, which was more notable for the laughably bad performances of James Brolin and Rod Steiger than it was for inducing chills. The performances in \"Amityville 3-D,\" or \"Amityville: the Demon\" as it is known on television, didn't deserve Oscar consideration, but they are professional and, in the case of Candy Clark's suspicious photographer, almost inspired. The movie opens in typical haunted house fashion: a seance is being held in the notorious Long Island house where, in earlier films, toilets backed up (shudder!), marching bands played in the dead of night (shudder again!), and a giant red-eyed pig named Jody roamed the premises and engaged in small talk with children (Babe in an early role?). The seance produces mysterious apparitions and odd noises, all of which are exposed by two of the participants--a reporter and his photographer-- as a hoax. The realtor denies any involvement in the souped-up spookiness and explains to the reporter (Tony Roberts on holiday from Woody Allen's repertory company) that the house's infamous reputation is such that he's willing to sell it at a bargain rate. Roberts, newly divorced and eager for a peaceful environment in which to write his great American novel, buys it, all the while ignoring the warnings of his less courageous colleague, the delightful Miss Clark. Roberts, a stubborn type who sneers at the supernatural, moves in and continues his sneering even as anyone who sets foot in the house experiences terror and, ultimately, death. But, dumbo that he is, he continues to pooh-pooh any notions that the house is cursed. Some talented performers are on view in this film, and if not for their admirable abilities to keep a straight face, the movie would be a lot funnier than it's supposed to be and sometimes is. Roberts is his usual non-plussed self, refusing to accept any supernatural explanations for the bizarre circumstances taking place around him. The special-effects are adequate, but they do the trick, and probably worked better in 3D, which is the way the film was presented theatrically. The process is evident in the use of so many scenes in which hands are extended toward the camera and, in one scene, a frisbee is tossed directly at the audience. \"Amityville 3D\" will never take its place beside the greats of the horror genre, but neither will its two predecessors. However, unlike those failed shockers, number 3 succeeds on its own modest terms, providing, amid the occasional unintended chuckle, a few moments of genuine suspense and a thrill or two. It's a satisfying spook show on the same level as the William Castle flicks of the late 50s and early 60s (\"The Tingler,\" \"House on Haunted Hill,\" et al).",
         "This is not like the horror movies that were coming out around the time this was released. Everyone says how bad it is, but if this were made in the sixties, it would be one of the greatest horror movies of all time. It has awful special effects, but it contains ideas, like most good movies should. I suggest you rent, or even buy it if you stumble across a copy.",
         "At this point the true events that took place in the house are no longer relevant. This is an entirely different story concocted by the screenwriters and I must say it's the best work of fiction on film that involves the Amityville house. The cinematography is great, the music, while not Schifrin, is still chilling, the acting is very very good. And there are some really scary moments in the film. The overall story I think engulfs the viewer. It's really interesting because the main character believes it's all a hoax, (much like a portion of the people do today) and he comes to find out that things in Amityville are much more unsettling than he thought they'd be. The only thing (as with all 80's 3-D films) is that there are obvious things going on which were supposed to lurch out at the audience. It seems rather silly when the camera stays on a certain image for more than five seconds when it is no longer presented in it's 3-D image. It induces a chuckle when ever this happens, but it doesn't detract from the film itself.",
         "A new dimension in ultimate evil has been added to the story to what has probably become the world's most notorious haunted house in America. A magazine writer's investigation into a séance turns to horror when an abandoned well beneath the basement floor turns out to be the gateway to hell. This film starred: Tony Roberts, Tess Harper & Meg Ryan In my opinion this wasn't one of best entries in the Amityville film series, not the worst but no where near the best. It had a bad plot about the gateway to hell being a well in the basement. 93 minutes wasted in my opinion, it had a couple of entertaining scenes but nothing special. **/***** Poor."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["De Laurentiis Entertainment Group (DEG)"],
      "summaries": [
         "A man who is separated from his wife moves into the infamous Amityville House. Their daughter dies in a boating accident (after being told that she is not allowed to go to the house) and now the mother sees her deceased daughter \"alive\" in the house. Mr. Baxtor calls a paranormal investigator in to help and the investigator finds out the source of the household problems.",
         "A reporter moves into the ominous Long Island house to debunk it of the recent supernatural events and becomes besieged by the evil manifestations which are connected to a hell-spawn demon lurking in the basement."
      ],
      "budget": 0
   },
   "movielensId": 1323,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-11-18",
      "dvdReleaseDate": "2005-04-05",
      "directors": ["Richard Fleischer"],
      "runtime": 105,
      "movieId": 1323,
      "title": "Amityville 3-D",
      "mpaa": "PG",
      "actors": [
         "Tony Roberts",
         "Tess Harper",
         "Robert Joy",
         "Candy Clark",
         "Leora Dana",
         "John Beal",
         "John Harkins",
         "Lori Loughlin",
         "Meg Ryan",
         "Neill Barry"
      ],
      "imdbMovieId": "0085159",
      "originalTitle": "Amityville 3-D",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "Gvh8En7ISsY",
         "rW7qb_ez1ks"
      ],
      "plotSummary": "To debunk the Amityville house's infamous reputation and take advantage of a rock-bottom asking price, skeptical journalist John Baxter buys the place and settles in to write his first novel. But as soon as the ink on the deed has dried, people who have come into contact with John and the house begin to meet with shocking fates. Is it all just coincidence, or is the house really the gateway to hell?",
      "tmdbMovieId": 27214,
      "avgRating": 1.63567,
      "releaseYear": "1983",
      "numRatings": 457,
      "posterPath": "/nttiT4ebfMQXYS0hJ0YdTzikZMq.jpg"
   }
}