{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "occult",
            "id": 156174
         },
         {
            "name": "dollhouse",
            "id": 161750
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "amityville horror",
            "id": 194834
         }
      ],
      "imdb_id": "tt0115535",
      "video": false,
      "title": "Amityville: Dollhouse",
      "recommendations": [
         33519,
         41848,
         55377,
         41671,
         40344,
         27214,
         110588,
         312131,
         153998,
         27345,
         44909,
         276530,
         39862,
         30654,
         27771,
         48836,
         28660,
         140750,
         74006,
         80201
      ],
      "backdrop_path": "/xCtK8ny3aDTY9GKcF9ISZ7FhKUW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Bill Martin",
               "gender": 2,
               "credit_id": "52fe4821c3a36847f81592a1",
               "name": "Robin Thomas",
               "profile_path": "/seivBO3KRFAKqNgL3wnvpwxHwKz.jpg",
               "id": 41465,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Claire Martin",
               "gender": 1,
               "credit_id": "52fe4821c3a36847f81592a5",
               "name": "Starr Andreeff",
               "profile_path": null,
               "id": 97881,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Todd Martin",
               "gender": 2,
               "credit_id": "52fe4821c3a36847f81592a9",
               "name": "Allen Cutler",
               "profile_path": null,
               "id": 154492,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jessica Martin",
               "gender": 1,
               "credit_id": "52fe4821c3a36847f81592ad",
               "name": "Rachel Duncan",
               "profile_path": null,
               "id": 114028,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jimmy Martin",
               "gender": 2,
               "credit_id": "54678d9422136e1e100003f0",
               "name": "Jarrett Lennon",
               "profile_path": null,
               "id": 10438,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Jimmy's Father",
               "gender": 2,
               "credit_id": "58d6546dc3a368121b0395cf",
               "name": "Clayton Murray",
               "profile_path": null,
               "id": 1783347,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Tobias",
               "gender": 2,
               "credit_id": "58d6547a9251411fd503e14b",
               "name": "Franc Ross",
               "profile_path": null,
               "id": 116233,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Aunt Marla",
               "gender": 1,
               "credit_id": "58d65485c3a368127c03ba12",
               "name": "Lenore Kasdorf",
               "profile_path": "/zyU2cEF8RUC8Zx11SmVBYIPQ62a.jpg",
               "id": 78184,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Dana",
               "gender": 1,
               "credit_id": "58d6548e9251411fd503e159",
               "name": "Lisa Robin Kelly",
               "profile_path": "/nXl7WqMMPUlKNijjay3VxmyHOcq.jpg",
               "id": 154529,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "57c9f5aac3a36860df001261",
               "name": "Steve White",
               "profile_path": null,
               "id": 1673596,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4821c3a36847f815929d",
               "name": "Joshua Michael Stern",
               "profile_path": "/asACKiJSAZzhF7sDO1fFXlpyCG9.jpg",
               "id": 64139,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57c9f5a392514155ac0013dd",
               "name": "Steve White",
               "profile_path": null,
               "id": 1673596,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58d654f0c3a368121b03962f",
               "name": "Sean Cohen",
               "profile_path": null,
               "id": 1676193,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 2,
               "credit_id": "58d655239251411fd503e1be",
               "name": "Mark Allen",
               "profile_path": null,
               "id": 1783348,
               "department": "Sound",
               "job": "Sound Effects Editor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.950558,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52263,
      "vote_count": 22,
      "budget": 0,
      "overview": "A dollhouse that is a replica of the infamous Amityville haunted house is given to a little girl. Soon after, all sorts of horrible unexplained accidents start to happen. The family must work together to fight off the terrifying evil that has inhabited their lives.",
      "similar": [
         91586,
         409297,
         19592,
         77949,
         561,
         10014,
         79694,
         288158,
         2655,
         620,
         335796,
         9552,
         201085,
         565,
         588,
         622,
         452507,
         396422,
         416160,
         259693
      ],
      "original_title": "Amityville: Dollhouse",
      "runtime": 93,
      "poster_path": "/e2h6nV7RAUiNQNeK4dqbmqbEorF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zeta Entertainment",
            "id": 5333,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Promark Entertainment Group",
            "id": 25690,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Spectacor Films",
            "id": 28277,
            "origin_country": ""
         }
      ],
      "release_date": "1996-10-02",
      "vote_average": 3.6,
      "belongs_to_collection": {
         "backdrop_path": "/kPfuozrsE7pmFFolkR0xFicZDJT.jpg",
         "name": "The Amityville Collection",
         "id": 397842,
         "poster_path": "/stPXPasI1lvxJRJJuDCKBr6X836.jpg"
      },
      "tagline": "Home is where the Horror is...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve White"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Joshua Michael Stern"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115535/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwOTg1ODE5MV5BMl5BanBnXkFtZTcwNTczNjcyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Robin Thomas Grossman, Starr Andreeff, Allen Cutler | See full cast and crew »"],
      "reviews": [
         "Bill Martin (Robin Thomas) builds a house to raise a new family of his own with his teenage son Todd (Allen Cutler), his daughter Jessica \"Jessie\" Martin (Rachel Duncan), and Claire Martin (Starr Adreeff) and her nerd son Jimmy (Jarrett Lennon), an outcast boy that misses his father (Clayton Murray) and has the mouse Max as his only friend. Todd has a girlfriend, Dana (Lisa Robin Kelly), who is frequently with him. Bill finds a doll house in the garage that is a replica of the infamous Amityville haunted house and he gives it to Jessie on her birthday. Soon the family experiences evil accidents and Bill's sister Marla (Lenore Kasdorf) and her husband Tobias (Franc Ross) discover that the doll house is possessed by demons that are threatening their lives. \"Amityville: Dollhouse\" is another story of the franchise \"Amityville\" with a reasonable plot and terrible conclusion. I saw this movie for the first time on 15 Dec 1999 on VHS and today I have just seen it again. It is unacceptable that Tobias sacrifices his life to save the Martin family and Bill and Claire end the movie laughing, after losing their friend and all possessions in the fire. My vote is five. Title (Brazil): \"A Casa Maldita\" (\"The Damned House\")",
         "This family have just moved into a normal house, this family has a mother named Claire who as one son called Jimmy , Claire is Married to Bill who has daughter Jessica and she as a older brother Todd but Jimmy (who is very annoying) dose not seem to like his step family, however the other do like like then step-mum. When Bill goes to the shed he find the doll house that is the Amityville House. Soom strange thinks start to happen in the house, the haunted doll house break the daughter bike they were going to give her for her Birthday so they end up giving the doll house instead but she soon finds out that the doll house is evil. Jimmy is also affected by evil force as they got his dad back from the dead to see him, at first his happy to see his dead dad that look like a Zombie but soon starts to get scared of him as he think he dead dad is going kill step dad. My favourite scene is this movie as to be when Jimmy Mouse goes to Jessica room and enter the doll house and as the mouse goes in the doll house goes under the bed in that in the doll house and then Jessica bed starts shake and she see an enormous white mouse appears under her bed. I really liked that scenes it was really well made, I enjoyed that scene and the whole movie, it was very entertaining from start to the end and it was not boring or predictable like previous movies at all. I liked the way the the movie ended and acting great in this movie. I am going to give this movie 8 out of 10",
         "Needing a present for his daughter's birthday, a father finds an old dusty doll house and decides to clean it up to make it presentable. What he doesn't realize, this doll house isn't for innocent little playthings, this house holds evil spirits inside! Unknowingly, the little girl releases the evil inside and the spirits are free to wreck havoc. A pretty good sequel that contains some good, eerie and creepy moments throughout. Out of all the sequels the original 'Amityville Horror' has spawned, this is one of the better ones. This is an entertaining film with a good concept. So sit back and enjoy.",
         "Well, if you're like Miss Otis here, there is nothing that you like better than sitting down with a big ole bowl of popcorn and making fun of bad horror movies. For those of you that enjoy MST3K_ing (no that isn't a word) movies, this one is a real treat. There's bad acting, a convoluted plot, and even a darling scene where a small boy runs to embrace his long dead, badly decomposed daddy - isn't that just precious?! You CAN have a lot of fun with this movie - if you approach it with the right attitude.",
         "I know I wrote a review of this some time back, but it appears to have disappeared. So here we go again. This final sequel, shot for cable or video, follows at least two other STV sequels to the original. One involved a haunted clock or lamp, the other a haunted mirror. This one involves a haunted dollhouse, with some truly creepy inhabitants. Very little gore or scares, and only one death, but still fun to watch if you're in the mood. My favorite part has the reasonably sexy stepmom, a Terry Farrell lookalike, coming onto her hunky stepson. There's also a pretty decent-looking demon near the end. But overall bad acting and a boring middle almost does this in. Stick with it for the fireplace sequence. You'll know it when you see it.",
         "A perfect late-night sci-fi channel movie, and far more entertaining (for me) than the original Amityville. The way the dollhouse creates different demons for each character, and the cheap but effective sfx, reminded me very much of the Creepshow or Graveyard Shift movies. Also, the 'fright' scenes skip along at a respectable pace and frequency, as opposed to other films which often plod through the middle. Sure, the script contains some appalling lines and characterisation, and there are a few moments where more highly strung viewers would be screaming at the stupidity of the characters. I just smile. With 15-20 years of further advances in sfx, and the cultural tendency of under 30's to confuse sarcasm with valid criticism, I can see why this film has such a low score on the IMDB. Individually, the elements don't stand up to a whole lot of scrutiny, but taken as a whole on its own merits (compared to similar films of the same period), I really enjoyed it. A few better lines, and better known actors, and there's no reason why people wouldn't look on this with the same sort of affection reserved for Poltergeist. Don't miss if it's on TV.",
         "Mini version of the Amityville house that behaves like the one of legend causes trouble for a newly minted family (newly married couple with pre-existing kids)that moves into a new house where the doll house resides. Really stupid premise sinks what might have been an okay extremely by the numbers haunted house story. Come one a haunted doll house from Amityville? Oh please. Whats worse what it causes to happen is so incredibly stupid as to be laughable. I made it not much past when the scares started as the film just slid right into the toilet. One of the dumbest horror films I've run across.",
         "\"Amityville VIII: Dollhouse\" is a better entry than it should be with a few problems. **SPOILERS** Moving into a new house, blended-family Bill Martin, (Robin Thomas) his wife Claire, (Starr Andreeff) and their children Jessica, (Rachel Duncan) Todd, (Allen Cutler) and Jimmy, (Jarrett Lennon) find their familiar differences start immediately when they arrive. Cleaning up around the property, they find a large doll-house tucked away in a gardening shed and decide to fix it up as a special gift. After giving it, they soon start to experience a weird series of events and freak accidents that appear to be accidents but are soon convinced something is wrong. Learning that the doll-house given as a gift resembles a mysterious house from Amityville, New York that housed a Satanist before being engulfed by a fire, and when Uncle Tobias, (Franc Ross) and Aunt Marla, (Lenore Kasdorf) inform them that there was several bits of wood from the house used to build the doll-house, and it's causing the manifestations. With the visions getting worse, they try to stop it before it takes on further stress for the family. The Good News: This one has some really nice moments to it that make it really exciting. The main thing this gets right is that there's a return to the house's look, as the doll-house is the original to a tee. The looming windows that set off a pair of eyes, the distinct chimney, and there's some good parts that come along from the house's appearance. The look is still there, and even there it isn't the centerpiece of the film, it still has enough to get the point and fear across. The film also works well with it's cheese, and there's some great amounts of it in here. The ending half of the film, where the full powers of the house are unleashed and monsters, demonic spirits and more are unleashed, ushering a large, grand series where big spectacle, special effects style scenes make this one really fun and entertaining. The monsters are fun and inspired, the action is good and it's all done with a great sense of fun. The film also manages to spread it through the rest of the film, mainly in the form of a complete gaggle of shock cuts that come along, making it feel like a rather traditional entry of a horror film. It has even more fun in here with a deliciously sleazy subplot where the mother starts having sexual desires after being around the step-son, and in one fantastic scene begins to rip her clothes off and pleasure herself after an encounter, and when interrupted by her husband, switches over and initiates a more intimate encounter to cover her tracks. It's a great scene, and is certainly helped by a sex scene earlier that helps along the sleazy action. There's also a lot of fun to be had from just how it exploits that much fun, and the cheesiness here is something that is just overwhelming and makes it so entertaining. These here all make the film entertaining. The Bad News: This one doesn't have a whole lot of flaws, but there are a few. The sheer ridiculousness of it all manages to be the biggest one here, since it manages to, at once, point out the idiocy of the premise and how it turns it into something that really should've been gone over a little more carefully. Building a house on the site of an accident that tore the first one down is bad enough, then to find a small shack that has survived is merely conspicuous, and then to ignore what's a few inches away that will clearly lead to a bad idea is something that is just confusing. It has a real lack of interest from it's plot because of this difference from the plausibility from the story, and it's too ridiculous, and combined with the cheese, makes it feel like there's a problem to overcome due to the cheese it has. There's also a flaw in here with the story about the dead father. Frankly, it's way too unrealistic to think that a nine-year old kid wouldn't be afraid of a decomposing, rotting corpse shambling into his room in the dead of night, even though it's a familiar sight to them. The request is unnatural, and the acceptance of it from the start is unreasonable. These here are the film's few flaws. The Final Verdict: A little cheesy, but still fun entry in the series that has some fun to it but has a couple of flaws to keep it down. Give it a shot if you've come this far in the series or are in the mood for a simple, harmless film that provides some fun, but if you haven't got much interest in the series give this one a pass. Rated R: Graphic Violence, Language, Nudity and a sex scene",
         "Bill Martin (Robin Thomas) and his new wife Claire (Starr Andreeff) move into the new house he built in the California mountains. In a shed outback he finds a cute little dollhouse designed just like the famous Amityville, NY abode. How this got here or who built it is never explained. This is no Barbie Dream House though as this dollhouse crushes Bill's gift bike for his daughter's birthday and the parents resort to the \"this should make a great gift\" routine. The eighth and final Amityville flick before they did the remake. After part 3, the producers felt they could circumvent the whole Amityville house thing by having various possessed items from the house be the gateway to terror. So we had a lamp (AMITYVILLE: THE EVIL ESCAPES), a confessional (THE AMITYVILLE CURSE), a clock (AMITYVILLE: IT'S ABOUT TIME) and a mirror (AMITYVILLE: A NEW GENERATION). So I guess a dollhouse isn't that ridiculous. This is actually a two-for-one deal as we get a possessed recycled fireplace too (there is general confusion as the house was built on foundation of an old house that blew up to suggest it was the Amityville house, but this is clearly set in California). I'm just glad they stopped with this one or we would have ended up with the likes of possessed toaster in AMITYVILLE: YOU'RE TOAST. Or an evil stove in AMITYVILLE: YOUR BLOOD BOILS. One thing this sequel does that is surprising is bring back the taboo sex angle from part 2, along they play it a bit safer with the stepmom lusting for the stepson. Other than that, it is pretty routine stuff with the occasional cool effect here and there (like the progressively rotting dad who haunts his young son a la John Landis' werewolf classic).",
         "\"Amityville Dollhouse\" is your average low budget B-horror movie, but it isn't too bad in my opinion. It follows a suburban family who moves into a new house the father built, so it seems that there's no way the house could be haunted. But the Amityville evil finds it's way in there, after they discover a dollhouse replicating the Amityville house. They decide to give the dollhouse to their youngest daughter for her birthday, and that's where it all begins. The dollhouse begins to exert an evil force upon the family. I tend to have a soft spot for low budget, cheesy type horror films of this type. Even though they may not be top notch quality, I find most of them entertaining, and they still manage to be alright in my book. Most of the cast here are unknowns, I only recognized one actress: Lisa Robin Kelly, who plays Eric's sister, Laurie Forman, on That '70s Show (my favorite television show by the way). The whole dollhouse idea is kind of dumb, I don't know what a dollhouse really has to do with \"Amityville\", but in the context of the movie it seems to work. There aren't really any scary moments, and when it tries to be scary, it comes off more as campy, but I don't really take this film so seriously. Granted it is a campy, low-budget horror flick, but \"Amityville Dollhouse\" still finds a way to entertain you, despite the cheap effects and minimal scares that it provides. Some may think I'm crazy, but I was entertained by this flick. It's nothing special and I wouldn't go too far out of your way to see it, but it's an okay corny horror movie. Like I said, nothing special, but not too bad. 5/10."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Promark Entertainment Group",
         "Spectacor Films",
         "Zeta Entertainment"
      ],
      "summaries": [
         "A dollhouse that is a replica of the infamous Amityville haunted house is given to a little girl. Soon after, all sorts of horrible unexplained accidents start to happen. The family must work together to fight off the terrifying evil that has inhabited their lives.",
         "Bill Martin builds a house to raise a new family of his own with his teenage son Todd, his daughter Jessica \"Jessie\" Martin, and Claire Martin and her nerd son Jimmy, an outcast boy that misses his father and has the mouse Max as his only friend. Todd has a girlfriend, Dana, who is frequently with him. Bill finds a doll house in the garage that is a replica of the infamous Amityville haunted house and he gives it to Jessie on her birthday. Soon the family experiences evil accidents and Bill's sister Marla and her husband Tobias discover that the doll house is possessed by demons that are threatening their lives.",
         "A children's doll house, which is a miniature of the infamous haunted Long Island house, is given to a young girl where the demonic evil soon comes out to cause more terror."
      ],
      "budget": 0
   },
   "movielensId": 1324,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-02",
      "dvdReleaseDate": "2004-08-17",
      "directors": ["Steve White"],
      "runtime": 93,
      "movieId": 1324,
      "title": "Amityville: Dollhouse",
      "mpaa": "",
      "actors": [
         "Robin Thomas",
         "Starr Andreeff",
         "Allen Cutler",
         "Rachel Duncan",
         "Jarrett Lennon",
         "Clayton Murray",
         "Franc Ross",
         "Lenore Kasdorf",
         "Lisa Robin Kelly"
      ],
      "imdbMovieId": "0115535",
      "originalTitle": "Amityville: Dollhouse",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["iwfMpLdkDYs"],
      "plotSummary": "A dollhouse that is a replica of the infamous Amityville haunted house is given to a little girl. Soon after, all sorts of horrible unexplained accidents start to happen. The family must work together to fight off the terrifying evil that has inhabited their lives.",
      "tmdbMovieId": 52263,
      "avgRating": 1.81944,
      "releaseYear": "1996",
      "numRatings": 252,
      "posterPath": "/e2h6nV7RAUiNQNeK4dqbmqbEorF.jpg"
   }
}