{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "halloween",
            "id": 3335
         },
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "long island",
            "id": 9398
         },
         {
            "name": "paranormal",
            "id": 9853
         },
         {
            "name": "new home",
            "id": 33467
         },
         {
            "name": "exorcist",
            "id": 159940
         },
         {
            "name": "psychotronic",
            "id": 164218
         },
         {
            "name": "indian burial ground",
            "id": 173099
         },
         {
            "name": "newspaper article",
            "id": 173103
         },
         {
            "name": "haunted",
            "id": 230191
         },
         {
            "name": "religious horror",
            "id": 239680
         }
      ],
      "imdb_id": "tt0078767",
      "video": false,
      "title": "The Amityville Horror",
      "recommendations": [
         16235,
         27214,
         10823,
         11298,
         9638,
         9529,
         16337,
         9725,
         11503,
         11133,
         24913,
         10306,
         16281,
         26515,
         9003,
         794,
         15516,
         36599,
         16180,
         16288
      ],
      "backdrop_path": "/s2z4t3y5gvFKId09smKOUq8I8gK.jpg",
      "revenue": 86432000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George Lutz",
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5ad",
               "name": "James Brolin",
               "profile_path": "/8SGPpN3ieM3K0mHjD8bbQIRD6x.jpg",
               "id": 9274,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kathy Lutz",
               "gender": 1,
               "credit_id": "52fe44429251416c7502e5b1",
               "name": "Margot Kidder",
               "profile_path": "/98HrmSMx8FhMCeoKEODs3OSGYyv.jpg",
               "id": 20011,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Father Delaney",
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5b5",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Father Richard Bolen",
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5b9",
               "name": "Don Stroud",
               "profile_path": "/7jT8523HL3myVWDXPpNOqf9Ubp0.jpg",
               "id": 69494,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Father Ryan",
               "gender": 0,
               "credit_id": "53ebf6890e0a2605f1000222",
               "name": "Murray Hamilton",
               "profile_path": "/zSkAeg5lGbyZWwYZYunl3HR8jHb.jpg",
               "id": 8608,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Farther Nuncio",
               "gender": 2,
               "credit_id": "53ebf6af0e0a2605d70001d2",
               "name": "John Larch",
               "profile_path": "/dshTTCylpXofjXYsTefOOa9WSSe.jpg",
               "id": 95564,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Amy",
               "gender": 1,
               "credit_id": "53ebf6c40e0a2605e0000227",
               "name": "Natasha Ryan",
               "profile_path": null,
               "id": 106054,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Greg",
               "gender": 0,
               "credit_id": "59d4144d9251414b99007ad2",
               "name": "K.C. Martel",
               "profile_path": null,
               "id": 1328167,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Matt",
               "gender": 2,
               "credit_id": "59d414419251414b70007bb1",
               "name": "Meeno Peluce",
               "profile_path": null,
               "id": 98233,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "550d17ea925141469c004e31",
               "name": "Michael Sacks",
               "profile_path": null,
               "id": 41278,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Aunt Helena",
               "gender": 1,
               "credit_id": "550d17cbc3a3684877004cbe",
               "name": "Irene Dailey",
               "profile_path": "/4m6RsRiuIhakWXOGMUvMtHolIs6.jpg",
               "id": 179383,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Carolyn",
               "gender": 1,
               "credit_id": "59d4147dc3a36845610081ca",
               "name": "Helen Shaver",
               "profile_path": "/7DlGkBDdRcKPlPAXuoo6xz6hSAU.jpg",
               "id": 4160,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Jackie",
               "gender": 1,
               "credit_id": "59d41488c3a368451b007078",
               "name": "Amy Wright",
               "profile_path": "/mEV42JRtrTTZg92GjyjRkQSXpsn.jpg",
               "id": 87007,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "59d41493c3a36844e1007de0",
               "name": "Marc Vahanian",
               "profile_path": null,
               "id": 98596,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Mrs. Townsend",
               "gender": 1,
               "credit_id": "59d4149dc3a3684528007ab3",
               "name": "Elsa Raven",
               "profile_path": "/4pxbeI6yZyAMmeikbM7DzPex4z4.jpg",
               "id": 172280,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "59d414a8c3a368456100820b",
               "name": "Hank Garrett",
               "profile_path": "/mnnUSRsf7DGCwHHCh37YTwpx5PG.jpg",
               "id": 129663,
               "order": 15
            },
            {
               "cast_id": 14,
               "character": "Coroner",
               "gender": 2,
               "credit_id": "53ebf6700e0a2605dd0001bb",
               "name": "James Tolkan",
               "profile_path": "/mB9vHaDMzy5Z5pPWOliA6MJ3gTq.jpg",
               "id": 1072,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5bf",
               "name": "Stuart Rosenberg",
               "profile_path": null,
               "id": 13859,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44429251416c7502e5c5",
               "name": "Jay Anson",
               "profile_path": "/jQIfwGJrAc49w6grnfjmqYmxxs.jpg",
               "id": 62719,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5cb",
               "name": "Sandor Stern",
               "profile_path": null,
               "id": 46000,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5d1",
               "name": "Samuel Z. Arkoff",
               "profile_path": null,
               "id": 30904,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5d7",
               "name": "Elliot Geisinger",
               "profile_path": null,
               "id": 69495,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5dd",
               "name": "Ronald Saland",
               "profile_path": null,
               "id": 69496,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5e3",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5e9",
               "name": "Fred J. Koenekamp",
               "profile_path": "/yxTbBWproHj24o8yrTLEjtzlF9u.jpg",
               "id": 19102,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44429251416c7502e5ef",
               "name": "Robert Brown",
               "profile_path": null,
               "id": 14339,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.674708,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11449,
      "vote_count": 240,
      "budget": 0,
      "overview": "George Lutz and his wife Kathleen, move into their Long Island dream house with their children only for their lives to be turned into a hellish nightmare. The legacy of a murder committed in the house gradually affects the family and a priest is brought in to try and exorcise the demonic presence from their home.",
      "similar": [
         565,
         91586,
         201085,
         290637,
         8839,
         10065,
         2655,
         609,
         10756,
         11601,
         380124,
         19592,
         166271,
         79694,
         288158,
         10779,
         150202,
         10439,
         306964,
         474104
      ],
      "original_title": "The Amityville Horror",
      "runtime": 117,
      "poster_path": "/orociMcS1GExIcuiGbYYHlRlcL8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "American International Pictures (AIP)",
         "id": 9266,
         "origin_country": ""
      }],
      "release_date": "1979-07-26",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": "/kPfuozrsE7pmFFolkR0xFicZDJT.jpg",
         "name": "The Amityville Collection",
         "id": 397842,
         "poster_path": "/stPXPasI1lvxJRJJuDCKBr6X836.jpg"
      },
      "tagline": "For God's Sake, Get Out!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stuart Rosenberg"],
      "runtime": 117,
      "synopsis": "\"The Amityville Horror\" (Released July 1979) is based on the true story of George Lee Lutz (James Brolin, of \"Marcus Welby, MD\") and Kathy Lutz (Margot Kidder, fresh from the success of \"Superman\") who bought a charming Dutch Colonial home in Amityville, on the coast of Long Island NY, in 1975. A sign in front of the house gives its name as \"High Hopes.\" The film is based on the book of the same title, by Jay Anson, published in 1977. (Anson did not work extensively with the couple, but worked from hours of taped conversations between George and Kathy, which they had turned over to him.) The home features the Dutch gambrel (barn-shaped) roof design, and a pair of quarter-circle windows, on the end, on the 3rd floor, up near the roof. These are illuminated to look like the home's eyes. Filmmakers modified a house in New Jersey to look like the actual home in Amityville, and it is surprisingly close. It is a documented fact that a troubled young man, 28, had shot his entire family to death in the house, on 11/13/1974, including father, mother, two brothers and two sisters. Thus, in the film, the history of the house allows the Lutz's, in the fall of 1975, to make an offer of $80,000 on the home, which, we are told, is easily worth $120,000. Despite full disclosure of the home's past, by the realtor, the couple proceeds with the purchase, and moves in. George appears not to be strong of faith, but Kathy is at least a nominal Catholic. The couple turns to Father Delaney to bless the home. Father Delaney (Rod Steiger) encounters troubles in trying to bless the home, including a room full of flies, out of season, violent stomach sickness, and later, blisters on his palm when trying to make even a phone contact with Kathy at the home. In his further efforts to confront the evil, he suffers a car wreck from brake and steering malfunction, a lack of support by his superiors in the diocese as he describes the occult things he's seen, and ultimately, blindness and a mental breakdown. It is most moving when he, at the altar of the church, is praying, \"Give them strength of mind and body, that they may do Your will,\" and a high-mounted statue begins to crumble and drop dust down in the chancel area. Refusing to run, he continues the prayer at a scream, \"Oh, Lord, give them strength of mind and body, that they may do Your will!\" weeping at the seeming triumph of evil over good. After this, we are shown Father Delaney, sitting in an outdoor garden area, in a totally unresponsive state. Presubably, his mind is gone. George begins to be more sullen and angry over perceived cold in the house, and obsesses with splitting logs and keeping the fireplace stoked. One of the two boys suffers a crushed hand when a sash window falls on it, and the little girl has an imaginary friend, Jody, who seems to be of a malevolent nature. Mom, Kathy, catches a glimpse of two red, swine-like eyes, outside the daughter's 2nd story window. The family dog, Harry, a black labrador, obsesses over a secret room in the basement. George's land surveying business begins to suffer with his lack of attendance, and his partner is concerned. The business partner's wife, very sensitive to the paranormal, is at once both revulsed and intrigued by the things she feels when at the house. \"Boy are these vibes ever strong!\" she says at one point. The Lutz's witness a black, bubbling substance coming up in the toilets, an \"ooze\" coming down from nail holes in the walls, a babysitter being trapped in a closet despite its not having a locking doorknob, the disappearance of $1,500.00 cash, and Kathy's Aunt, a nun, running from the house and vomiting. Kathy observes George's persistant waking at 3:15 am, feeling he must go check on the boathouse, and other unsettling incidents. Kathy has nightmares in which she is given details about the killings of the home's prior family. Their research at the library and at the county records office suggest that the house is built atop a tribal burial ground, and that a known devil worshiper named Ketcham had once lived on the land. Finally, the paranormal events drive the family to flee the house one night, in the pouring rain, no longer even worried about their posessions. The final titles tell us that, \"Today the Lutz's live in another state.\"",
      "writers": [
         "Sandor Stern",
         "Jay Anson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078767/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0NDMyNTU3M15BMl5BanBnXkFtZTcwMjM0MTgwNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Brolin, Margot Kidder, Rod Steiger | See full cast and crew »"],
      "reviews": [
         "George (James Brolin) and Kathleen Lutz (Margot Kidder) buy a \"dream house\" in Amityville, New York for a \"dream price\". Unfortunately, the price was low because just a year before, the house was the location of the Ronald DeFeo Jr. murders--he killed his entire family while they were sleeping. As a priest, Father Delaney (Rod Steiger), blesses the home, he realizes with horror that something evil is lingering there. The dream house is turning into a nightmare. Sometimes our affection for or aversion to an artwork that we've been exposed to a number of times over the years is inextricably enmeshed with our historical, emotional experiences, whether we admit this or not. For example, I strongly dislike soap operas, or indeed any dramas that resemble soap operas. This is probably due to the fact that for years my only exposure to soap operas was when I was home sick from school as a kid. These were the days before cable television and home video. In the middle of a weekday afternoon, you either watched soap operas or you didn't watch television. Subconsciously, I associate soap operas with a feeling of illness. Likewise, Jay Anson's Amityville Horror novel appeared when I was still a teen. I loved it. I can still remember reading it in one long sitting--something I rarely did--in the family car as we drove from Florida to Ohio to visit relatives. I was excited when the film appeared, and liked it a lot at the time. So although I can see many faults with Amityville Horror now, I still have a deep affection for it that triggers my brain to go into an apologetic mode and defend the film. I just can't bring myself to give it lower than an 8 out of 10, and even that seems low to me. But I can easily see how audiences lacking a history with the film might dislike it. It is relatively slow, uneventful and meandering--with a modern perspective, the pacing and \"subtlety\" are reminiscent of some recent Asian horror. At the same time, maybe paradoxically, scenery chewing has only rarely had a greater ally. Just a couple days ago MGM released newly remastered widescreen versions of Amityville 1, 2 and 3. I haven't seen the film look this good since seeing it in the theater in 1979, and it probably didn't even look this good then. The first thing that struck me was how incredible much of the cinematography is. Director Stuart Rosenberg had an amazing knack for finding intriguing angles for shots and imbuing them with beautiful colors. Unlike recent trends, Rosenberg's colors are not narrowed down to a single scheme. For example, in some shots, such as some of the interiors of the famed Amityville house, we get fabulous combinations of pale greens and yellows. In others, such as many exterior shots near the house, we get intense combinations of fall foliage colors. There are also a number of beautiful shots of the famed \"eye window\" exterior of the house in differently tinted \"negative\" colors. Rosenberg evidences a great eye for placing his cast in the frame and shooting scenes to create depth and symbolism via objects that partially block or surround the frame. He also has a knack for creating winding, receding patterns of objects that enhance depth through perspective. My affection for this aspect of the film has little nostalgic attachment, as I didn't pay attention to such things as a kid (I didn't start noticing them more until I started painting, far into my adult years), and the positive aspects of the cinematography were hardly discernible on the previous, ridiculously bad pan & scan VHS release. Of course, most people aren't watching a film like this for the aesthetics of the visual composition. This is one of the most famous haunted house films, after all. The horror is handled somewhat awkwardly, occasionally absurdly, but it still works well enough for me, as understated as it is (I'm not referring to the acting, just the horror \"objects\"). Aspects such as the ubiquitous flies reminded me of similar motifs, such as water, in Hideo Nakata's horror films (such as Ringu, 1998 and Dark Water, 2002). The beginning of the film, showing the Defeo murders, still has a lot of shock value, despite its relative post-Tarantino tameness. Most of the horror elements are more portentous, but they're regular and interesting enough to hold your attention, as long as you don't mind subtlety. Subtlety, however, was the furthest thing from the cast's minds. Brolin, Kidder and especially Steiger shout their lines more often than they speak them. \"Overacting\" is not in their vocabularies. Kidder comments on an accompanying documentary that the horror genre walks a fine line between intensity and camp. That may or may not be true in general, but in Amityville Horror, camp is frequently broached. For me, it has a certain charm. I'm a fan of camp and \"so bad it's good\"; Amityville's performances often attain both. The commentary on the new DVD is amusing given the 1970s publicity that the book and film depicted a true haunting and the subsequent, thorough debunking by persons such as Stephen Kaplan. Hans Holzer, a parapsychologist who has been involved with the story since the early days, and the author of a book upon which Amityville II was based, provides the commentary. He presents himself as an academic, but he obviously seems to have little concern for \"objectivity\" or skepticism. He not only still talks about the story as true, he invents supernatural excuses for the DeFeo murders and then some, barely mentioning detractors such as Kaplan. If you haven't seen the film yet, you should base your viewing decision on whether you have a taste for deliberately paced horror as well as a tolerance for extremely over-the-top performances. The film is historically important in the genre, as well.",
         "Excited about the remake I decided to go out and just but the original Amityville Horror. Being a huge horror buff, I just had to and besides I had only seen some of it's absurd sequels. hearing mixed reviews from friends and critics from terrifying to hilarious I turned it on with my boyfriend at the time and prepared myself for something scary. I must say that I was quite impressed. And although slightly disappointed in some of the films scenes ultimately I must say this is one old fashioned scary flick! I can hugely recognize the appeal it had in it's it's hey day. With the exception of Texas chainsaw Massacre, Evil Dead, the Omen and some others I rarely see what people did in their horror classics nowadays. Like The Exorcist, pretty damn boring and funny in my opinion. But getting back to this film. It builds a creeping mood filled with fright inducing suspense. The effects are simple but effective and the performances are somewhat over the top but necessarily wacky. The film's overall lasting appeal has little to do with the film's apparent campiness. it has more to do with the real terror inducing legend that inspired it. Like the Chainsaw remake the new ones looks to amp up the horror and intensity which would be greatly welcomed. Although a great horror classic Amityville's finale is somewhat anti climactic and after a long and impressively scary build-up it fails to deliver the end goods. But whoa some of the scenes from the imaginary friend Jody flying out the window, to the visitor at the door, to the voice in the house and just everything in the basement this film is all about delivering some authentic chills. 8/10",
         "George and Kathy Lutz are looking for a place to anchor down and raise a family. The Lutz's and their children (Kathy's from a previous marriage) settle on an impossibly cheap, large and beautiful shore house. But 28 days later the macabre and scary happenings force them to leave\u0085leaving all their earthly possession behind. During the course of those 28 days, the family goes through all kinds of hell a room full of flies, demonic voices and a pig with glowing red eyes. What kind of past does that house have that would make everything horribly wrong. Based on a true story. Real or hoax, you decide but \"The Amityville Horror\" has all the trappings of an excellent haunted house story. Too bad that the filmmakers falter a bit with a lack of character development that also ends up stifling the actors in the film, that would have helped out immensely. A creepy music score (the one rejected for \"The Exorcist\") and several good set-pieces help out but the end of the second act kind of gets stale. A good supernatural thriller.",
         "True, the special effects aren't so special these days. True, the girl with the braces brings tears of laughter rather than terror. But nonetheless, this movie remains a creepy gem from my young days... Everyone misses the point that the real 'star' of the movie is the house! The building is both attractive and sinister - truly gothic in the importance of the setting. Whether the story is true or not, if you want a movie to snuggle on the couch in the dark, eating popcorn, feeling the thrill of a ghost story scare, this is one for you...",
         "I was but a timid lad of 14 when taken to a drive-in theater to see this incredibly effective horror film.There is no better monster to create a film around than the Devil himself.When Rod Steiger's character,Father Delaney is in the process of blessing the house,and was greeted by a resounding shout of \"Get Out!\",I almost took it literally,it was that effective.The Devil is indeed one unwelcome houseguest that is very hard to kick out,as you will see when you watch this film.James Brolin and Margo Kidder head a young family who are the new inhabitants of a home where brutal murders had taken place years before.Soon,strange happenings begin to haunt the family,as the house has trouble letting go of what had happened there.This movie is definitely in my top 10 horror films that I have seen,and if you enjoy being scared out of your wits,this film will do it for you.Give it a look!",
         "Stuart Rosenberg's \"The Amityville Horror\" should have catapulted him to the throne of the King of the Surreal, because this disjointed, shrill, and inexplicable flick is just as weird, if not weirder than, the oddest work of current King David Lynch. I'm not sure what the hell was going on in Rosenberg's life at the time, but this same year he directed another weird, cartoonish-yet-lethargic genre film, the Charles Bronson revenge vehicle, \"Love and Bullets.\" Also both \"Horror\" and \"Bullets\" share totally inappropriate and WAY over the top performances by the great & unique Rod Steiger. VERY MINOR POSSIBLE SPOILERS AHEAD(if such is possible with a movie that makes no sense) Nothing much happens in \"Amityville Horror\" until the climax, just a lot of odd little things. But when that climax comes, and the movie suddenly ends, you realize that it answered no questions and, more importantly, made no sense at all! The film has no logic but dream logic--perfect surrealism. Characters float about aimlessly in search of some kind of coherent story, crying, screaming, chopping wood. The secondary characters appear and disappear without having any impact on the plot and without really doing anything, much the way characters in a dream come and go, shift and change for no reason. A psychic has visions--nothing comes of it. A cop has suspicions--he does nothing with them. a child has an imaginary ghost friend who may be at the root of it all--or not. A priest's life is ruined--because there were flies on the window! And--there's an evil pig in the window! I'll repeat myself--There's AN EVIL PIG IN THE WINDOW!! An EVIL PIG THAT DOES NOTHING! Really, the film is fascinating--all the more so since it is obvious that its fascinating qualities are entirely unintentional. A CLASSIC!",
         "This movie was based on the true story and it did a great job of re-creating what actually happened. The creepy way the little girl talks to the seemingly empty rocking chair and the 3:15 am horrifying nightmares over and over again would make anyone feel a little freaked out. The reaction of anyone who has anything to do with the church should have been a sign to get out of this house. The flies, cold spots, and eyes peering in and outside of the windows are all things that actually happened inside that house in Amityville Long Island. I recommend this movie to anyone who wants to enjoy a scary movie or for anyone who has been freightened of a house before. This movie does the trick without any fancy special effects.l",
         "Semi-classic thriller of the 70's, requires some patience from the audience but ultimately becomes a nicely moody film about America's most infamous haunted house. Couple moves their family into a Long Island house, where the previous owners where murdered, and begins to believe that there are evil forces at work in the new home. Based upon Jay Anson's novel, which itself is supposedly a true story, The Amityville Horror is a film that largely relies upon it's eerie, unsettling atmosphere to induce chills and it often works well. It also packs the occasional good shock. While some may see this films subtlety and occasional weirdness as a senseless plot, it really helps to create a rattling sense of dread. It plays out well, building tension slowly to a climatic finale and a open conclusion that leaves a great sense of mystery. Kudos also go to a wonderfully chilling musical score. The cast is fairly good, stars Brolin and Kidder are in top-form. While it may be bashed by many critics, The Amityville Horror has remained one of the 70's better horror oddities, and has become a cult classic for good reason. *** out of ****",
         "Over the years, I have truly enjoyed \"The Amityville Horror,\" a 1979 haunted house flick that has been critically, and unfairly, bashed. Since it's based on a true story, the critics have found that they dislike the movie based on their knowledge of the movie's inspiration. Now, here's my opinion: fiction or non-fiction, Stuart Rosenberg managed to make a fun, campy, and all around creepy horror film that resonates as one of the most famous haunted house movies ever created. Everyone knows the legend about that house in Amityville, New York, the Dutch Colonial on 112 Ocean Avenue. The movie begins in 1974, when Ronnie DeFeo Jr. murdered his family in the house at 3:15 am, shooting them all in their sleep. A year later, George and Kathy Lutz bought the house and moved in with their three children and their dog, Harry. Aware of the tragedy that occurred in the home, George and his wife planned to fix it up and start a new life after their recent marriage. After all, \"houses don't have memories.\" But then, things went wrong. Horribly wrong. And after 28 days, the family left the house and fled Amityville, never turning back. Of course, Jay Anson's novel was a bestseller. I've personally read it myself, and it's written well. But there are several different variations on what happened during those 28 days, even with George and Kathy Lutz. So, for those of you who know the story before you watch the movie, it's hard to distinguish what is and isn't true. Some of you may not believe it at all. However, I am one of those people that believe in this account of a suburban haunted house, after watching rather truthful and intelligent interviews with the Lutzes and other paranormal investigators. But aside from that, what matters most about \"The Amityville Horror\" is how it works as a movie. First of all, the setting means everything. Filmed in New Jersey, and not actually filmed in Amityville, the house is a particularly creepy abode to look at, especially during night scenes. Those two windows become a character all their own. They stare out into the night, and give the viewer the horrible feeling that they're being watched. Also, there is definitely enough paranormal activity going on to keep you interested. However, the ghostly phenomenon doesn't start right away. In fact, it builds sporadically, creating a wonderful sense of dread. If you can appreciate a good build-up without much special effects(until the dynamite ending), then you will probably like the movie. James Brolin and Margot Kidder are a joy to watch as George and Kathy Lutz. They are not perfect performances by far(there are moments when their performances go a little too over the top). But there are great things to see here between Brolin and Kidder. They have sincere moments together as husband and wife. Other times when things get frightening, their shock and fear comes off naturally. Then we are scared for George and Kathy. Basically, Brolin and Kidder give mostly good performances. We also have Rod Steiger's performance as Father Delaney to judge. Sandor Stern's script has limited this character, and therefore, Steiger is not in the movie too much, but he makes the most with the screen time he has. In fact, he makes the role larger, and we're not just scared for the Lutz family, but for him also. Obviously, some events in \"The Amityville Horror\" are slightly exaggerated when you compare them with the book's events or the perspectives of others who have experienced the haunting. But that doesn't make the movie any less entertaining. I look past its flaws, and embrace it for what it is: a cult classic that has gotten some damn good attention over the years. It's not a masterpiece, but I continue to love and believe in \"The Amityville Horror.\"",
         "This is the classic version about the infamous Amityville house with lots of screams and weird deeds in which a family falls into supernatural terror . The story starts with a grisly mass murder ; years later , a family moves to Long Island where is purchased a Victorian home , their house of dreams but they find only devilish horror and full of nightmares . Longtime ago, there occurred a grisly mass killing based on an allegedly real life occurrence in Amityville that turns out to be a haven for demonic forces . And now a possessed father (James Brolin) is plunged by demonic forces into supernatural attitude driving him to mistreat and beat the kiddies . The wife (Margot Kidder) begins experiencing frightening and vivid dreams of killings . Meantime ,the father is attempting to find out the bottom of events by ways of the cellar . While , an exorcist priest (a hysteric Rod Steiger who steals the show as scene-chewing ) tries praying to vanquish the malignant spirit , staggering from room to room with the doors mysteriously slam . And soon the poltergeists make their nasty appearance originating a lot of unusual rattles and creaks before deciding to utilize its powers to possess the father and attack the family . The film contains restless terror and great loads of gore and blood and usual poltergeists phenomenon caused by the curse and the usual ghastly shenanigans result to be the cracking pipelines , wall ooze icky stuff, flies swarm manifest as attackers, and doors suddenly slam , among others . It is produced with acceptable budget by Samuel Z Arkoff (AIP)and well recreated with high grade special effects that are frightening and horrifying to spectator . It's actually halfway decent terror movie that achieved big success at the box office and it will appeal to ghostly and eerie events fonds. The picture packs a colorful cinematography by Fred Koenekamp and eerie musical score by Lalo Schifrin that will be used in the innumerable sequels . The original ¨Exorcist¨ film (by Friedkin) spawned a wave of demonic possession movies that continues unabated today as ¨Changeling¨ (by Peter Medak), ¨Amytiville ¨(by Stuart Rosemberg) are two further examples of this sub-genre . Following a great number of clumsy, stupid sequels directed by Damiano Damiani , Richard Fleischer ,Sandor Stern ( screenwriter of Amityville), Anthony Hitchcock.. And the bad followings just go on and on attempting to cash in on the success of the first movie . However , recently is made a good new adaptation by Andrew Douglas with Ryan Reynolds (James Brolin role ) , Melissa George ( Margot Kidder character) and Philip Baker Hall (Rod Steiger), though this is a new take on from previous film, it's one of the highest earning horror movie of the last years and like the¨ Amityville ¨ original became a box office biggie . Rating : Aceeptable and passable ."
      ],
      "genres": [
         "Drama",
         "Horror"
      ],
      "productionCompanies": [
         "American International Pictures (AIP)",
         "Cinema 77",
         "Professional Films"
      ],
      "summaries": [
         "Based on a true story that was claimed by writer Jay Anson, The Amityville Horror is about a large house on the coast of Long Island where newly weds George and Kathy Lutz and their three children move into the house that they hope will be their dream house but it ends up in terror. Despite full disclosure by the real estate agent of the home's history, George and Kathy buy the house. George says, \"Houses don't have memories,\" but they turn to their family priest Father Delaney who believes the house is haunted and performs an exorcism on the house. But the evil spirit in the house causes him to become blind and makes him very ill. George and Kathy with the help of another priest Father Bolen and a police detective they face the fears of the house, but not knowing the spirit is planning to possess George and then the children...",
         "George and Kathy Lutz, a newly married couple with three children, movie into their beautiful new house in Amityville, New York, only to discover the house already has demonic inhabitants.",
         "Newlyweds move into a house where a murder was committed, and experience strange manifestations which drive them away."
      ],
      "budget": 0
   },
   "movielensId": 1327,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-07-26",
      "dvdReleaseDate": "2005-04-05",
      "directors": ["Stuart Rosenberg"],
      "runtime": 117,
      "movieId": 1327,
      "title": "The Amityville Horror",
      "mpaa": "R",
      "actors": [
         "James Brolin",
         "Margot Kidder",
         "Rod Steiger",
         "Don Stroud",
         "Murray Hamilton",
         "John Larch",
         "Natasha Ryan",
         "K.C. Martel",
         "Meeno Peluce",
         "Michael Sacks",
         "Irene Dailey",
         "Helen Shaver",
         "Amy Wright",
         "Marc Vahanian",
         "Elsa Raven",
         "Hank Garrett",
         "James Tolkan"
      ],
      "imdbMovieId": "0078767",
      "originalTitle": "The Amityville Horror",
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "QEyrOb6zdvE",
         "0db0Cb4ZG3I",
         "Yg0PKz44aLk"
      ],
      "plotSummary": "George Lutz and his wife Kathleen, move into their Long Island dream house with their children only for their lives to be turned into a hellish nightmare. The legacy of a murder committed in the house gradually affects the family and a priest is brought in to try and exorcise the demonic presence from their home.",
      "tmdbMovieId": 11449,
      "avgRating": 2.94892,
      "releaseYear": "1979",
      "numRatings": 3573,
      "posterPath": "/orociMcS1GExIcuiGbYYHlRlcL8.jpg"
   }
}