{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "fireplace",
            "id": 11183
         },
         {
            "name": "tarantula",
            "id": 14792
         },
         {
            "name": "amityville horror",
            "id": 194834
         }
      ],
      "imdb_id": "tt0099030",
      "video": false,
      "title": "The Amityville Curse",
      "recommendations": [
         33519,
         55377,
         52263,
         41671,
         27214,
         40341,
         16235,
         38499,
         139659,
         27771,
         39862,
         35978,
         44909,
         28344,
         110588,
         38500,
         259879,
         312131,
         35945,
         26956
      ],
      "backdrop_path": "/mDXlrP13bmPLo0aVHE0wBLRvE2L.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df855",
               "name": "Kim Coates",
               "profile_path": "/xGoPaGsqRWCsDDDmY1gNR8eoxTA.jpg",
               "id": 8335,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe45e0c3a36847f80df859",
               "name": "Dawna Wightman",
               "profile_path": null,
               "id": 548848,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Mrs. Moriarty",
               "gender": 0,
               "credit_id": "52fe45e0c3a36847f80df85d",
               "name": "Helen Hughes",
               "profile_path": null,
               "id": 201798,
               "order": 2
            },
            {
               "cast_id": 1011,
               "character": "Marvin",
               "gender": 0,
               "credit_id": "53a40694c3a3682a3c000c5d",
               "name": "David Stein",
               "profile_path": null,
               "id": 1332201,
               "order": 3
            },
            {
               "cast_id": 1007,
               "character": "Bill",
               "gender": 0,
               "credit_id": "52fe45e0c3a36847f80df865",
               "name": "Anthony Dean Rubes",
               "profile_path": null,
               "id": 548850,
               "order": 4
            },
            {
               "cast_id": 1008,
               "character": "Abigail",
               "gender": 1,
               "credit_id": "52fe45e0c3a36847f80df869",
               "name": "Cassandra Gava",
               "profile_path": "/9oSH8t4ylChnJuiQMJeoNvlxguF.jpg",
               "id": 98473,
               "order": 5
            },
            {
               "cast_id": 1009,
               "character": "The Priest",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df86d",
               "name": "Jan Rubeš",
               "profile_path": "/hrzcIOLEMhcnYiRbNYoqGJD1AwK.jpg",
               "id": 37422,
               "order": 6
            },
            {
               "cast_id": 1010,
               "character": "Detective",
               "gender": 0,
               "credit_id": "52fe45e0c3a36847f80df871",
               "name": "Norris Domingue",
               "profile_path": null,
               "id": 548851,
               "order": 7
            },
            {
               "cast_id": 1012,
               "character": "Thin Boy",
               "gender": 0,
               "credit_id": "5455a227c3a3682be9003738",
               "name": "Scott Yaphe",
               "profile_path": "/q4mo0rJQNJxCC60TZuLdU6AkpG.jpg",
               "id": 70445,
               "order": 8
            },
            {
               "cast_id": 1013,
               "character": "Krabel",
               "gender": 2,
               "credit_id": "5455a2340e0a2648cf006250",
               "name": "Mark Camacho",
               "profile_path": "/2zQRAqWeFQOMzD3NBzNSI6QqMdf.jpg",
               "id": 7013,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45e0c3a36847f80df845",
               "name": "Tom Bery",
               "profile_path": null,
               "id": 548847,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e0c3a36847f80df851",
               "name": "Michael Krueger",
               "profile_path": null,
               "id": 194237,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5455a26b0e0a2648d600601f",
               "name": "Hans Holzer",
               "profile_path": null,
               "id": 147701,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5455a2560e0a2635de003b4c",
               "name": "Norvell Rose",
               "profile_path": null,
               "id": 1380640,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5455a2770e0a2635de003b53",
               "name": "Michael Krueger",
               "profile_path": null,
               "id": 194237,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5455a2840e0a263863003cf1",
               "name": "Doug Olson",
               "profile_path": null,
               "id": 1371080,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5455a2930e0a2635de003b5e",
               "name": "Norvell Rose",
               "profile_path": null,
               "id": 1380640,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5455a2a0c3a3683e23000d96",
               "name": "Franco Battista",
               "profile_path": null,
               "id": 56981,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5455a2b1c3a3680b76001727",
               "name": "Michael Krueger",
               "profile_path": null,
               "id": 194237,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5455a2bdc3a3683ea0000ce7",
               "name": "Tom Berry",
               "profile_path": null,
               "id": 56982,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5455a2c9c3a3681473005e03",
               "name": "A.B. Goldberg",
               "profile_path": null,
               "id": 1371078,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5455a2d5c3a368148d0061a1",
               "name": "Milan Kymlička",
               "profile_path": null,
               "id": 29453,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5455a2e30e0a2635de003b63",
               "name": "Rodney Gibbons",
               "profile_path": null,
               "id": 56983,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5455a2efc3a368148d0061a3",
               "name": "Franco Battista",
               "profile_path": null,
               "id": 56981,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5455a308c3a368148d0061a9",
               "name": "Richard Tassé",
               "profile_path": null,
               "id": 1185206,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5455a31dc3a368147c00600c",
               "name": "Patrick Shearn",
               "profile_path": null,
               "id": 1380646,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 1,
               "credit_id": "55a263a99251412979003190",
               "name": "Anne Tait",
               "profile_path": null,
               "id": 1126724,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.735836,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 41848,
      "vote_count": 22,
      "budget": 0,
      "overview": "Five people spend the night in an abandoned house, the Amityville haunted house, and soon find themselves terrorized by assorted ghosts, venomous insects and ghostly apparitions.",
      "similar": [
         77949,
         201085,
         452507,
         2655,
         243688,
         91586,
         416160,
         11601,
         168098,
         620,
         2048,
         59967,
         321258,
         288158,
         284276,
         996,
         345911,
         36647,
         23827,
         10285
      ],
      "original_title": "The Amityville Curse",
      "runtime": 91,
      "poster_path": "/iUZMWvsHivx5V0JAUGWl1v1Q0aC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CFCF-TV",
            "id": 17799,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Allegro Films",
            "id": 4899,
            "origin_country": ""
         }
      ],
      "release_date": "1990-05-07",
      "vote_average": 2.7,
      "belongs_to_collection": {
         "backdrop_path": "/kPfuozrsE7pmFFolkR0xFicZDJT.jpg",
         "name": "The Amityville Collection",
         "id": 397842,
         "poster_path": "/stPXPasI1lvxJRJJuDCKBr6X836.jpg"
      },
      "tagline": "It began with a murder and a hanging. Now, the innocent must pay for the sins of the guilty...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tom Berry"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Hans Holzer",
         "Michael Krueger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099030/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzgxNDMyMjI0N15BMl5BanBnXkFtZTcwNDQ3MTI2MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kim Coates, Dawna Wightman, Helen Hughes | See full cast and crew »"],
      "reviews": [
         "Based on the book of the same name by HANS HOLZER, five people move into the infamous house of horror in Amityville long island after they purchase it at an incredibly cheap price completely unaware of it's terrifying past. While renovating the home (which is in bad need of repairs) they come under attack from supernatural forces, the lead heroine has terrifying nightmares & sees visions of a young man & a dog watching them from afar, only for them to disappear. Doors & windows pop open by themselves, as well as a strong supernatural wind that blows through the home, the house shakes, one of the friends wounded hand bleeds severely, a bathtub of water is turned into blood, markings appear on a steamed over mirror that later breaks & another member of the house suffers horrible headaches etc. After investigating the truth behind the hauntings, they comes to realize that the haunting maybe connected to the murder of a priest twelve years prior in his own confessional & that the man responsible for it may very well be a member of their group. The AMITYVILLE series is an interesting one, for a variety of reasons, but mainly because despite the Lutz claims that they were attacked by supernatural forces, it was later proved to be a hoax, but hoax or not, that did not stop Hollywood from churning out countless sequels on the subject, including this one which is (at the time of this review) the only entry in the series to be shot in Canada passing itself off as Long Island & also happens to bare the reputation of not only being the dreariest entry in the long running franchise, but also the series worst entry. The title \"Amityville\" cannot be copyrighted, mainly due to the fact that it is the name of a real town & therefore in the public domain, which means practically any film company can latch their trailer onto the title & make their own sequels. Only the fourth film bared the full title of the original: THE AMITYVILLE HORROR PART 4: THE EVIL ESCAPES. The special effects are definitely cheap & below series par & some scenes in the film that could have & should have been suspenseful & eerie is so flatly directed & mishandled it all winds up disappointing. The acting is poor & the characters couldn't be less interesting. The direction by TOM BERRY also disappoints, though some camera angles are okay. The whole film looks dirt cheap, almost like a shot on tape production & bares a cheap ugly, cold look & there's none of that sense of dread or atmosphere of other entries & is thus far the only entry in the franchise that doesn't feature the original house. The house here is supposed to be the same one, but looks nothing like it & is half the size, in fact that's probably one of the most painful things about the film, trying to pass this house off as the infamous house of terror, would be like trying to pass off an old work shed as the White House! With all of that said, I will say that there were some things that I thought were okay with this entry, it most certainly has more plot than some of the other films & the score at least tries to capture that same kind of music the first two films had & also returns to an idea presented in AMITYVILLE II: THE POSSESSION, by having one of the members get possessed & the films attempt to meld the supernatural going on's with a whodunit was a nice try, but you would have to be daft if you can't figure out who the killer is, since it's fairly obvious from the outset, in fact it's so obvious that while watching it you'll think to yourself \"Surely there must be some kind of twist, they wouldn't make the identity of the killer that obvious\" but there isn't! making the whodunit plot element ridiculous. What should be noted is how the film appears to be a prequel to AMIYTVILLE'S 3 & 4, simply because the house is well furnished & it's mentioned by one of the characters that the previous owners took off & left it all behind, which is exactly what the Lutz did in the original film when they fled their long island home meaning (in theory arguably) that the order of the Amityville series would go something like this 2, 1, 5, 4, 3, 6, 7, 8. In the end, THE AMITYVILLE CURSE is strictly for those who saw & loved at least some of the other entries in the AMITYVILLE series or if you saw all the others & wanted to claim you seen all of them, if you're not one of these people, I would avoid this one since it's not very good. Not the worst film I've ever seen (Take my word for it, in all my years as a film critic I have laid eyes on some really bad movies!) but not a film I would be interested in seeing again. Followed by a sequel, AMITYVILLE 1992: IT'S ABOUT TIME ** stars",
         "When I buy a movie (Usually a sequel) I expect that movie to be reasonably the same theme and plot to that of its predecessors Amityville curse is one of the worst sequels in the history of sequels. I am not joking. If you are curious about buying the movie becuause its the only \"Amityville Related Topic\" you haven't seen - Please dont let curiosity get the better of you! The only reason they called this movie Amityville curse was to attract the attention of the public into buying and watching the movie. The facts are plain - This is not Amityville. The infamous long island house which we see in many of the true Amityville movies and most strikingly \"Amityville horror\" is not present in this movie. The house is not amityville, just some other house in the town of amityville - Terrible!!! (I like the amityville movies becuase of the house - This decieved me into buying this trash!) The acting is so bad its not possible to comprehend and the script is awful. I still fail to see why the guy's who made this film went through the process to acquire permission to use the \"Amityville rights\" which would have cost money. (The book was a hans holzer novel) but when they got permission they did not use the amityville style house or anything for that matter! This movie is a disaster and is inconsistant with the others. If you have any sense you will take a look at the other reviews and follow their advice in AVOIDING this mess of a movie. (I bought it just to see if it was all true about it being a pile of junk and it was!!!!!!) Watch this movie and you will suffer the curse of boredom, terrible acting, stupid scripts, awful effects and a pompas storyline. The only way this movie could have worked is if they had seperated it from amityville franchise. Making this a seperate haunted house movie may have been OK, but as we all know its supposed to be amityville its laughable. well... what can I say... This is not Amityville 5... I suggest you watch Amityville dollhouse or Amityville 1992. They ALL beat this by miles!!!!!! ***AVOID***",
         "\"Moviecritique USA\" rates this a 10/10 eh? up there with LAWRENCE OF ARABIA, CITIZEN KANE, 2001: A SPACE ODYSSEY, MIDNIGHT COWBOY and LORD OF THE RINGS? Let's pass on that one! This rates below PLAN NINE FROM OUTER SPACE! It should not be confused with ANY Amityville sequel, or even a professionally made film come to that. THE BLAIR WITCH PROJECT was the con-job of the last millennium but even IT is classic filmmaking besides this dreck! The ONLY reason to watch it is the last fifteen minutes. Never have I seen one person take so much laughable punishment....and keep going! Its a hoot! It starts...nothing sensible happens, then it stops. End of story!",
         "First of all, this wasn't meant to be an \"Amityville\" sequel, it just tried to draw its audience by using that word in the title, but otherwise has little to do with what has happened before it in the series. That would be OK if they had come up with a good flick anyway - but they didn't. Do you find it a good idea for a horror movie to give away its own surprises halfway through? If not, then avoid this one. (*1/2)",
         "When you reach a certain point in a series of films it's time to call it quits. If there's no more story, if the quality level had dropped, or if people have lost interest then why not lay it to rest? The third 'Amityville' movie was the last one to get a theatrical release because it made less money than the two before it, but that didn't stop anyone from making another sequel. There have even been several sequels to Jay Anson's novel, but not many would be adapted into feature films. Personally I like the first four movies in the series, but where do you go from there? Like the first film, this installment is based on a book only in this case the movie has little to do with it's predecessors or the book on which it's based. But believe me, those are the least of it's problems. Pros: Performances are adequate. Decent score. A couple good creepy moments. Finally comes to life in the finale. Cons: Sluggish pacing. Virtually plot less. Forgettable. Not scary at all. Bland direction. Very drab looking. Several plot holes. Long stretches where nothing interesting happens. Failed attempt at mystery. Final thoughts: No one asked for the other sequels either, but at least they provide some entertainment value. If you're going to make an unnecessary sequel the least you can do is make it entertaining and make it look like you cared about what you were doing. There are even worse sequels than 'The Amityville Curse,' but even if you're like me and you enjoyed the previous four you're better off skipping this one and checking out the ones that follow. My rating: 1.5/5",
         "**SPOILERS** Another spin-off of the original 1979 movie \"the Amityville Horror\" which has really nothing to do with what made the house in Amityville famous, or infamous, in the first place! The 1974 murder of the family who resided there by their drugged up and satanically possessed son. In this film the movie has to do with the murder of a local priest,Jan Rubes,who had his brains blown out during confession by one of his church members! This all happened some 12 years earlier, in 1977, in the movie that we see in a long flashback. It's now 1989 and this group of friends, looking for a place to live in the country, from the big city end up spending the night at the dark and spooky house in Amityville. Warned by one of the local people the one-eyed Ms. Moriarty, Helen Hughes, that there's a curse on the house the people spending the night there laugh her off feeling that she's just an old eccentric looking for attention. It turns out that Mrs. Moriarty, whom we saw in the opening flashback sequence, is not as nutty as they think. She not only knows what the reason is for the priest's murder but who was the person who murdered him! The film slowly plays itself out in it going back to the murder of the priest whom we later find out was not as holy as he seemed to make himself out to be. it turned out that his alleged murderer, Ted A. Bohus, hung himself in police custody before he could make a confession to the priest's murder. The people staying in the house at first have no idea what the house, with all the books and movies written and released about it, represents: Death and Horror to those who dare to either buy or spend the night in it. It's only after the truth comes out, which takes almost the entire film, to what the reasons were behind the priests murder and who in fact murdered him that the proverbial sh*t really hits the fan! It's then that the past that was so conveniently hidden by the killer, and Mrs. Moriarty, comes to the surface like a sudden blast out of a volcano. Unlike the previous Amityville Horror movies this one has really nothing at all to do with the supernatural or the cursed house itself. There's a subplot in the film involving one of the persons staying at the house Debbie, Dawna Wightman, who seems to be possessed by the place but it's never fully explained why. If Debbie is so in tuned with the horror, by who the killer is, awaiting her and her friends she in fact was one the last persons to realize it. The obvious unseen killer, by his own actions, could have been spotted almost as soon as he came on the scene but it took a murderous attack on Debbie by him for her to realize just who he is! So much for Debbie's, together with the help of Mrs. Moriarty, extrasensory perception and psychic powers! One of the better Amityville Horror sequels even though it was more like a whodunit-like murder mystery then a supernatural horror movie.",
         "It's a cheap production sequel to AMITYVILLE series that has almost nothing to do with the original movie (or even the story!). The kind of plot used is the same which have been used so many times before. The production is much worse than the previous films (at least comparing with the first two movies). The soundtrack is very different too and it's terrible (it's between very poor pseudo-mysterious sounds and a cheap imitation of PSYCHO's tube scene track). But if the production and the soundtrack are really bad, the acting is not better; especially the performance of Dawna Wightman (who plays DEBBIE). It's incredibly awful! Is she a professional actress? I really don't think so! Anyway, this chapter doesn't add anything new to the series and it would be totally unnecessary!",
         "When a priest (Jan Rubes) was murdered years ago in a confession booth in his Church. The murderer was never found and the priest's personal stuff is been boarded up in the basement, where he used to live. Now in the present day, a group of five people (Kim Coates, Dawna Wrightman, David Stein, Anthony Dean Rubes and Cassandra Gava) are moving in the old priest's house. Which this house is supposed to be haunted and now the ground are experiencing strange things in the house. They been hearing noises, having nightmares, seeings visions and more. But one of them is the group of friends is not what he seems to be and they better get out of the house before it's too late. Directed by Tom Berry made an rather boring supernatural horror film that has nothing to do with the previous \"Amityville\" movies and even the house is different. The cast tries their best but the script is boring and very dumb at times. It is very obvious this one, it was made in Canada unlike the other pictures. This film is based on a book by Hans Holzer, who wrote the book \"Murder in Amityville\". Which that book was turned into a picture titled \"Amityville 2:The Possession\". Also the movie is laughably bad, even the last act. Don't watch it, it's forgettable. (* ½/*****).",
         "The Amityville Curse (1990) has very little to do with the series. Why did they call it this then. I guess nobody would want to rent a movie called \"The Spooky House\" or the \"The Curse of an Evil House\". In their infinite wisdom, the producers probably sat around in a smoky room thinking up of ways they could market this film. \"Hey, how's about we make another Amityville Horror movie?\" \"Why\" asked the second Producer. \"They just made another one for T.V. So hears what we do, we finish the film and just loop in a mention of Amityville House. If we's have to,\" explained the Executive Producer. \"If that's too expensive we'll just make up a scary poster and video art and leave it at that.\" You know what? That's probably what happened. Bad movie that's nearly unwatchable. But it's fun to make fun of if you're in the right mood or if you're hanging with some friends. Other wise avoid it like the plague!",
         "I have said it a Thousand times and I will say it again. Another perfect example why horror was dead at the end of the eighties, early nineties. This has nothing to offer and has in fact nothing to do with the original one. It's just cashing in the money due the name Amityville. Only the last 12 minutes do offer horror but the other 75 minutes are a pure waist of time. There are things that should be scary but it's so cheesy that it isn't scary but laughable. It's so sad that a lot of franchises had to end this way... Gore 0/5 Nudity 0/5 Effects 1/5 Story 2/5 Comedy 0/5"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Image Organization",
         "Allegro Films",
         "CFCF-TV"
      ],
      "summaries": ["Five people spend the night in an abandoned house, the Amityville haunted house, and soon find themselves terrorized by assorted ghosts, venomous insects and ghostly apparitions."],
      "budget": 0
   },
   "movielensId": 1328,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1990-05-07",
      "dvdReleaseDate": null,
      "directors": ["Tom Bery"],
      "runtime": 91,
      "movieId": 1328,
      "title": "The Amityville Curse",
      "mpaa": "R",
      "actors": [
         "Kim Coates",
         "Dawna Wightman",
         "Helen Hughes",
         "David Stein",
         "Anthony Dean Rubes",
         "Cassandra Gava",
         "Jan Rubeš",
         "Norris Domingue",
         "Scott Yaphe",
         "Mark Camacho"
      ],
      "imdbMovieId": "0099030",
      "originalTitle": "The Amityville Curse",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["CimlgHVx9Yo"],
      "plotSummary": "Five people spend the night in an abandoned house, the Amityville haunted house, and soon find themselves terrorized by assorted ghosts, venomous insects and ghostly apparitions.",
      "tmdbMovieId": 41848,
      "avgRating": 1.87931,
      "releaseYear": "1990",
      "numRatings": 290,
      "posterPath": "/iUZMWvsHivx5V0JAUGWl1v1Q0aC.jpg"
   }
}