{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "coffin",
            "id": 1909
         },
         {
            "name": "communist",
            "id": 2109
         },
         {
            "name": "virgin",
            "id": 2389
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "dracula",
            "id": 3633
         },
         {
            "name": "parody",
            "id": 9755
         },
         {
            "name": "campy",
            "id": 155493
         },
         {
            "name": "sister sister incest",
            "id": 232441
         }
      ],
      "imdb_id": "tt0071233",
      "video": false,
      "title": "Blood for Dracula",
      "recommendations": [
         3043,
         40955,
         37042,
         40146,
         46885,
         28682,
         51260,
         24777,
         100661,
         104287,
         21955,
         28681,
         83913,
         3145,
         54109,
         34792,
         28733,
         406582,
         84293,
         33988
      ],
      "backdrop_path": "/h1jE2zMJse68BSixyB5kZLQSuxi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Count Dracula",
               "gender": 2,
               "credit_id": "52fe44e6c3a368484e03d309",
               "name": "Udo Kier",
               "profile_path": "/sTNpaKOBNi7WUJw7jPDrsbGAL4O.jpg",
               "id": 1646,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Mario Balato, the Servant",
               "gender": 2,
               "credit_id": "52fe44e6c3a368484e03d313",
               "name": "Joe Dallesandro",
               "profile_path": "/lxpfX2F8yBF8rsIGkmWwN04B4qJ.jpg",
               "id": 29915,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Il Marchese Di Fiore",
               "gender": 2,
               "credit_id": "52fe44e6c3a368484e03d31d",
               "name": "Vittorio De Sica",
               "profile_path": "/pbgQNb5bRKANI7gJ8etE5kp0bTj.jpg",
               "id": 12329,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "La Marchesa Di Fiore",
               "gender": 0,
               "credit_id": "52fe44e6c3a368484e03d321",
               "name": "Maxime McKendry",
               "profile_path": null,
               "id": 1072822,
               "order": 3
            },
            {
               "cast_id": 28,
               "character": "Anton",
               "gender": 0,
               "credit_id": "5a0414639251412e2300c758",
               "name": "Arno Juerging",
               "profile_path": null,
               "id": 29917,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Esmeralda",
               "gender": 1,
               "credit_id": "52fe44e6c3a368484e03d329",
               "name": "Milena Vukotic",
               "profile_path": "/t3on2M69KvTLdWYCKALmCEK3xzL.jpg",
               "id": 44104,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Saphiria",
               "gender": 0,
               "credit_id": "52fe44e6c3a368484e03d32d",
               "name": "Dominique Darel",
               "profile_path": null,
               "id": 1010200,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Rubinia",
               "gender": 0,
               "credit_id": "52fe44e6c3a368484e03d331",
               "name": "Stefania Casini",
               "profile_path": "/kA72p0sjZdv84dLukMNRfyEeHEW.jpg",
               "id": 34043,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Perla",
               "gender": 1,
               "credit_id": "52fe44e6c3a368484e03d335",
               "name": "Silvia Dionisio",
               "profile_path": "/ii6p5keWGtCS8YbmdjJaWJz6TrD.jpg",
               "id": 99535,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Gambler",
               "gender": 2,
               "credit_id": "55ad543cc3a3683002009294",
               "name": "Roman Polanski",
               "profile_path": "/qI12N0XzSQanAUv6sTucTLWi3az.jpg",
               "id": 3556,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44e6c3a368484e03d2ff",
               "name": "Paul Morrissey",
               "profile_path": "/bv4aWgFTm8lSn5Gb0W5QorhpyxF.jpg",
               "id": 18627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e6c3a368484e03d305",
               "name": "Paul Morrissey",
               "profile_path": "/bv4aWgFTm8lSn5Gb0W5QorhpyxF.jpg",
               "id": 18627,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e6c3a368484e03d30f",
               "name": "Andy Warhol",
               "profile_path": "/a88CL42sRMld1ECPuCjgfd2xA1N.jpg",
               "id": 18626,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e6c3a368484e03d319",
               "name": "Bram Stoker",
               "profile_path": "/rGDxuhLpkaa87CNWb4H9zZTruSJ.jpg",
               "id": 1544,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "5350a42ac3a3681d7b000821",
               "name": "Andrew Braunsberg",
               "profile_path": null,
               "id": 29875,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5350a439c3a3681d810007e0",
               "name": "Jean Yanne",
               "profile_path": "/79Z1qcDpbyRp5HPSBQvm15xwqOI.jpg",
               "id": 24381,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5350a447c3a3681da00007d6",
               "name": "Claudio Gizzi",
               "profile_path": null,
               "id": 29877,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5350a455c3a3681d930007f8",
               "name": "Luigi Kuveiller",
               "profile_path": null,
               "id": 25322,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5350a464c3a3681d930007fa",
               "name": "Franca Silvi",
               "profile_path": null,
               "id": 29912,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5350a471c3a3681d8700086c",
               "name": "Enrico Job",
               "profile_path": null,
               "id": 29913,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5350a47ec3a3681d7b000829",
               "name": "Gianni Giovagnoni",
               "profile_path": null,
               "id": 23364,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5350a494c3a3681d8d0007b3",
               "name": "Carlo Rambaldi",
               "profile_path": null,
               "id": 20504,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "59d6a73c92514104de000705",
               "name": "Antonio Margheriti",
               "profile_path": "/mQE61ZpPTZqQFJ4wHy1WA0Iz8Te.jpg",
               "id": 5561,
               "department": "Costume & Make-Up",
               "job": "Makeup Effects Designer"
            },
            {
               "gender": 0,
               "credit_id": "59d6a757925141050300065b",
               "name": "Antonio Margheriti",
               "profile_path": "/mQE61ZpPTZqQFJ4wHy1WA0Iz8Te.jpg",
               "id": 5561,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 1,
               "credit_id": "5aa670900e0a263dc7008b9f",
               "name": "Roberto Arcangeli",
               "profile_path": null,
               "id": 1984230,
               "department": "Sound",
               "job": "Sound Effects"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 4.545453,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 25944,
      "vote_count": 33,
      "budget": 0,
      "overview": "Deathly ill Count Dracula and his slimy underling, Anton, travel to Italy in search of a virgin's blood. They're welcomed at the crumbling estate of indebted Marchese Di Fiore, who's desperate to marry off his daughters to rich suitors. But there, instead of pure women, the count encounters incestuous lesbians with vile blood and Marxist manservant Mario, who's suspicious of the aristocratic Dracula.",
      "similar": [
         49017,
         29778,
         979,
         240,
         76492,
         281957,
         12619,
         7131,
         357096,
         9453,
         207768,
         138,
         6404,
         5336,
         25239,
         3134,
         994,
         11797,
         43947,
         42941
      ],
      "original_title": "Blood for Dracula",
      "runtime": 103,
      "poster_path": "/c4WFR6nV3oOkuKqxrVOs6ZOnXMd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Compagnia Cinematografica Champion",
            "id": 10000,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Andy Warhol Productions",
            "id": 10001,
            "origin_country": ""
         }
      ],
      "release_date": "1974-08-13",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "He couldn't live without a virgin's blood..... ...So a virgin had to die!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Morrissey"],
      "runtime": 103,
      "synopsis": "Count Dracula [Udo Kier] and his renfield Anton [Arno Juerging] travel to Italy in search of a virgin's blood. They are invited to stay at the di Fiori estate where there are four unmarried girls. Perhaps the Count will choose one of them? Highly unlikely. The two middle girls -- Rubina [Stefania Casini] and Saphiris [Dominique Darel] --are screwing the hired hand Mario [Joe Dallesandro]. Dracula drinks their blood and promptly throws up. Mario gets wise to the vampire and rapes the youngest girl Perla [Silvia Dionisio] so she won't be of interest. The oldest girl Esmerelda [Milena Vukotic] is still a virgin and gives herself to Dracula. Dracula is staked by Mario after Mario chops off both Dracula's arms, one leg and few other parts. Esmerelda throws herself on the stake, too.",
      "writers": ["Paul Morrissey"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071233/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2ODY5NjcyOV5BMl5BanBnXkFtZTYwMjI4MTE5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Dallesandro, Udo Kier, Vittorio De Sica | See full cast and crew »"],
      "reviews": [
         "'Blood for Dracula' began shooting the day principal photography for 'Flesh for Frankenstein' finished, and utilised the same three lead players: Udo Kier (as Dracula), Arno Jeurging (as his manservant) and Joe Dallesandro (as a socially conscious and randy farmhand). In comparison to the earlier film, 'Blood for Dracula' may appear somewhat more restrained, with less of the delirium and dementia which made it's sister movie so memorable, but in place of the outrageous black humour and OTT excesses it possesses a more subtle sense of satire and a frequently beautiful and poetic visual style. Just a quick recap of the story: Dracula, who is here only able to feed from the blood of virgin girls, is forced to leave his ancestral home in Transylvania (apparantly he's exhausted the supply there) and travel to Italy with his manservant, under the pretence of seeking a 'suitable wife'. They come across a family of supposedly noble stock, whose daughters are not in fact as pure as they might seem to be. This is due to the presence of a hot-headed young farmhand, whose political ideologies have been much influenced by the recent revolution in Russia... Morrissey's first image in the film is a mischievously existential sequence that immediately works to blur the distinction between the realm of the film and that of the filmmakers. Dracula, a bone white albino, is seen applying black dye to his hair, rouge to his cheeks and ochre to his lips in an effort to appear more robust and more human. The obvious parallel is that of an actor being made up in preparation for a scene; Dracula's 'scene' is the rest of the movie and therefore we do not see this process repeated. Opening with such an introspective shot, one that is entirely outside the narrative and which so successfully marries the worlds before and behind the camera, denotes the artistic sensibility which will lend the film a modernist flavour and throw the hokier aspects of vampire lore into sharp relief. Here Dracula merely has an aversion to sunlight, garlic and crucifixes, rather than crumbling to dust at the sight of them; if outside during the day he only shields his face with his hat, and in his room at the inn he simply takes down the cross on the wall and puts it away in a drawer. It's a good example of how rules of legend as interpreted through iconic cinema (think Bela Lugosi repulsed by a crucifix, or Max Shreck dissolving in the dawn's light) are not binding in any sense, and in any case such constraints on the character would sit badly with the plot of the film. The director's personal touch allows him to express his ideas with more structure and balance, which makes for a more satisfying and coherent picture. In 'Flesh for Frankenstein', Morrissey used the basic set up of the Frankenstein story, itself heavy with Freudian overtones in the context of Man attempting to create life independently of Woman, to showcase and satirise a gallery of corrupting behaviour and sexual deviancy. Here the contemporary relevance is the political subtext of the Dracula myth. The Count as a wealthy aristocrat is presented as both a literal and metaphorical vampire: he drains the blood of innocents in order to perpetuate his existence, and his social class figuratively leeches off the lower orders for it's own survival. His sickly pallor and physical frailty is both representative of his caste's dying influence and perhaps also a comment upon the debilitating results of long term inbreeding; a sharp contrast to the youthful strength and virility of Joe Dallesandro. The character of the latter is a dedicated communist who despises the Count for being, as he sees him, the wasted product of an archaic and fading tradition of social inequality, and the perception of aristocracy as decrepit and defunct extends to, and is reinforced by, the Italian family upon who's daughters the count has set his sights. Clearly once wealthy and influential they have now fallen on hard times and are under financial strain; the daughters work in the fields and gardens and the house is in need of repair and redecoration which they cannot afford. Hence the Mother's desire to marry one of her children into a moneyed lineage, in spite of such an unattractive groom and her daughters' unsuitability for his requirements, is an act of both base greed and snobbish ambition. The film also makes great use of the power of human sexuality. One character early in the film remarks, upon hearing of the Count's intention to marry: 'A wife? He doesn't look up to it!' Indeed the key to Dracula's undoing is ultimately sex. He cannot drink the blood of non-virgins, yet is tricked several times into drinking the contaminated blood of the family's daughters, which leads to bouts of copious vomiting. His servant's somewhat erroneous belief that Italy is a good place to find a chaste wife, because of that countries Catholicism, demonstrates his unfortunate reliance on, and faith in, the upholding of old fashioned principles. The girls' unrestrained sexual familiarity with Dallesandro is indicative of their embracing of a more modern and unconcerned attitude to sex, where the crumbling social climate and values of their parent's generation have little bearing. When Dracula reveals that due to his families' 'traditions' he can only marry a virgin, the Marchesa knowingly tries to palm him off with her daughters, whom she knows are experienced, anyway. There is little genuine sense of honour about such duplicity; the motivation is wealth even at the expense of her children's happiness. Morrissey is always quick to savage the supposedly sacred community of the family; in 'Flesh for Frankenstein' it was blighted by incest and depravity, and here the briefly seen relationship between Dracula and his sister (also a vampire) is more touching and heartfelt than the caustic behaviour of the Di Fiore's toward one another. The film remains to the end a coruscating and biting take on human values. At it's conclusion the enforced tyranny of an autocratic society has symbolically been put to a bloody end and supplanted by another: that of communist oppression. It is not a happy ending, perhaps because Dracula here is a much more pitiable and ambiguous character than generally depicted in other films. He does not communicate a sense of being an evil and vicious monster; he comes across as a weak and highly strung aesthete, delicate, sensitive and refined (the fact that he can only drink the uncontaminated blood of virgins is an extension of his discerning tastes and a genuine reflection of the traditional requirements of well-bred families in matters of marriage). Violence is abhorrent to him, yet ironically it is concomitant with his survival, whereas Dallesandro's character is brutish, self righteous and far more morally dubious (he more or less rapes the youngest daughter so that Dracula cannot now feed from her impure blood). The key performances here are perfectly realised and genuinely involving. Kier captures the lethargy and malaise of the ailing Count with inimitable panache, although in order to shed the necessary weight for the role he simply didn't eat anything and was therefore actually too weak to move most of the time anyway! Arno Jeurging here plays an authoritative, arrogant and controlling servant who is worlds away from the submissive and degenerate Otto character in 'Flesh for Frankenstein', while Maxime McKendry imparts a very real sense of desperation in her part as a declining aristocrat grasping at straws in a changing economic climate. Dallesandro here seems as out of place as he was in FFF, with a hilariously anachronistic Brooklyn accent despite supposedly being a second-generation servant to the family. You could look at this as the Director articulating his indifference to the conventional importance of verisimilitude, or merely the inclusion of a bankable international star for the purpose of returns at the box office (I suppose it depends on how cynical you're feeling). Whatever, Dallesandro endows his character with the sense of preening and aggressive self-importance that is vital for the film, where the intention is to have no clearly demarcated hero and villain. The girls are all achingly beautiful and shed their clothes at almost every opportunity, while two notable directors, Vittorio De Sica and Roman Polanksi (!) have brief parts as the Merchese and a cunning villager respectively. Jeurging's mother also plays a small role as a customer at the inn. Gore wise, although the film, as noted, somewhat lacks the unrelenting intensity of FFF's flying entrails and severed heads, it is still not for the squeamish. The protracted scenes of Dracula throwing up unsuitable blood into the bath are pretty gross, as is his lying on the floor to sup at the remains of the youngest daughter's hymen after Dallesandro takes matters into his own hands. The conclusion takes the grotesquery to the heights of blackly comic inevitability, with a mess of severed limbs and a double puncture with a single stake. However, the elegance of the cinematography, despite the low budget, renders these scenes almost as beautiful in their own perverse way as the long establishing shots of the Italian countryside. This film, like it's predecessor, remains a genuine cult classic, and in my opinion they are both valuable documents of the prevalent artistic attitudes of their day and two of the most important, literate, well composed and intelligent horror films of the last thirty years. Maybe someday Morrissey and Kier may make another. Here's hoping.",
         "This very free and rather deranged interpretation of Bram Stoker's legendary Dracula tale by Paul Morrissey is one of the best independent vampire stories I've seen so far. The sheer brilliance of this film completely lies in the characterization of the bloodsucking count. Dracula no longer is a vile and overruling monster here, but a sickly and almost pathetic weakling. He and his assistant (Renfield with brains!) flee from the Romanian castle to settle in rural Italy where families are believed to be particularly religious. This is essential to the count because he can only feed on virgins' blood. The count and his assistant are homed by a family with 4 four marriageable daughters, pretending to be wealthy. However, the girls aren't as 'pure' as they're supposed to be (these cuties like to screw around with the revolutionary servant boy) and the impure blood of the girls only causes to the count to get weaker. Despite of its filthy reputation, this film isn't that gory or nauseating. The finale is pretty blood-soaked but the film is overall more absurd and eccentric than it is gore. Blood for Dracula is an outstanding trash-film! The humor is black as the night itself and the substance is essential viewing for every cult cinema admirer. Udo Kier is terrific as the needy count while pretty boy and Morrissey regular Joe Dallesandro has the time of his life portraying the manly skirt-chaser. The budget of Blood for Dracula was low (almost non-existing), yet the set pieces and atmosphere-creating elements are great! The musical score in particular is beautiful and contains a few gripping piano compositions. In conclusion, Blood for Dracula is outrageous fun and a must-see for everyone whose tired of the same old unsatisfying horror films. It might not fit for all audiences but I'm sure the more developed genre lovers will love seeing Udo Kier licking a virgin's blood of the floor. Equally recommended is the Morrissey variant on that other classic tale, Frankenstein. That film is even more extravagant and a whole lot nastier. You can either take that as a recommendation or a warning.",
         "I love this film. It plays like a fantasy for decent perverts. That may sound like an oxymoron. You have 3 sexy daughters alone with their mother at some European manor. Of course there is the groundskeeper Joe Dallesandro, the hot stud who deflowers the \"virgins\", well, all except one daughter who seems to be holding out. Udo Kier plays the perverted ill Dracula who needs virgin blood to gain strength. Guess who's coming to dinner at the manor house? One problem; he needs virgin blood to survive. Anything else proves lethal. Young Joe has taken care of two of the daughters therefore Dracula gets a little sicker when he takes of their blood. Does he get the youngest and prettiest who is the Virgin or does Joe take care of that as well. Not big on budget. Funny at times. It is actually well filmed. Very campy and nasty.",
         "Not nearly as disgusting as its closely made forerunner Flesh for Frankenstein, Blood for Dracula has some nice, stylistic moments, excellent period piece settings and costumes, wild overacting from Udo Keir as Dracula(subdued though when compared with his performance as Dr. Frankenstein) and a non-performance by Joe Dallesandro, a sluggish pace at times and, of course, lots of gratuitous sex scenes. Dracula must go south for his health and find a virgin(for he can only drink the blood of a virgin girl). He chooses Italy and finds a family with three beautiful, unwed daughters all professing innocence of man. A swarthy gardener(Dallesandro) works there. Add two and two and you have the basic premise of the film. For me, and let me say that I get what camp is and what the filmmakers were trying - TRYING - to do, the best part of this film is easily the brief cameo of Roman Polanski as a man in the pub playing a game of do-what-I-do. Polanski has brilliant comic timing, and he reinforces my opinion that he was and could have been a very good actor. I am thankful he still directs though. As for Blood of Dracula, it will definitely take a bite out of your time.",
         "Here we are, the end of 2009, and Vampires have found their way back in style. Well, hot damn for them. We all knew it would happen sooner or later. Since Bela Lugosi redefined exactly what a Vampire is, back in the 30's, these guys are here to stay. However, the current crop of Vamp-entertainment has me a little worried. Twilight, eh? The Vampire Diaries? Oh yeah, I forgot, everything has to be targeted towards children now. I hate to admit it, but the so-called golden age of the 30's is a tad slow for my taste, and of course the fact that I'm an adult stands between me and the latest Vamp-craze. Fortunately, there was a period in between where they got it right. Enter Paul Morrissey, and his pal, Andy Warhol. The year is 1973, and rebelliously independent director, Paul Morrissey just wrapped up Andy Warhol's Frankenstein. Days later, Morrissey starts filming the logical next step, Andy Warhol's Dracula. Udo Kier (Mark Of The Devil) plays Count Dracula, and Joe Dallesandro (Andy Warhol's Trash) plays a guy who gets laid all the time. In this version of the legend, Dracula can only consume the blood of virgins, which is unfortunate for Udo because Romania has been sucked dry, so, now , the Count is headed to Italy in search of a nice, rich family, with nice, wholesome daughters. Once a destination is chosen, Dracula has high hopes of taking one of these pristine, young ladies back to Romania to marry (drain dry). The parents also think this is a swell idea, and the girls aren't putting up much of a fight. Only one problem, Joe Dallesandro is the live-in handyman, which means, yep, you guessed it, not a virgin in the house. Tough luck, Drac. Now would be the time to take this hopeless mission elsewhere, because if Joe finds out there's a Vampire about... It's on!!! Blood For Dracula is every bit the Masterpiece as Flesh For Frankenstein. Each one, a dismal, morbid work of art, although, this one is a bit more on the mean-spirited side. Udo Kier's portrayal of Count Dracula is so accurate, as if he were born to play the role. And Joe Dallesandro is always entertaining, with his acting issues and what not. Anyone out there who wants in on the latest Vampire craze, who isn't a pre-teen girl, HBO's Trueblood may be worth a look. And for the schlock lovers, you may want to check out Chris Seaver's latest masterpiece, Taintlight. although still semi-unknown, Paul Morrissey's version of Dracula just might be the definitive edition. Not bad for a guy who didn't do Horror. If you ask me, I could have totally gone for a few more of these. Imagine, the possibilities were endless. Maybe an Andy Warhol's Wolfman, or how about an Andy Warhol's Mummy? No, that would be stupid... I got it!! Andy Warhol's Jekyll & Hyde!! 10/10",
         "In this retelling of the story of Dracula, the world's most famous vampire (Udo Kier, in a breathtaking and charismatic role as the count) lives in rapid deterioration in Romania with his watcher, Anton. Dracula is nearing death due to the fact that he needs the blood of a virgin in order to survive as tainted blood makes him deeply ill. Dracula decides to travel to Italy after burying his sister because Anton tells him that there are many religious girls there who value their virginity and do not have sex until marriage. The plan makes sense, but problems arise when Dracula and Anton take shelter in the home of a religious family consisting of a greedy and thoughtless wife, a bitter husband, their four daughters, and their communist worker (played by the consistently memorable Joe Dallesandro). The plan is to pretend to be an aristocrat looking for a virgin bride, but issues arise when Dracula discovers that the daughters are not as innocent and as virginal as they are reputed to be, thanks to their worker, in this bizarre and extremely bloody vampire fable. Excuse me for seeming rather melodramatic for saying this, but this has got to be one of the most depressing horror films I think I have ever seen. The idea of Dracula being a terrifying and intimidating demon of a human being is completely altered here. Dracula is no longer the great monster that legend states, but rather a frail and deteriorating creature who is weak and pitiful. Call me crazy, but to me this idea is truly heartbreaking. This is a very tragic, pessimistic, and cruel film, and watching it is like watching a weak old man slowly bleed to death in a creek after getting in a bicycle accident. It is basically the mental equivalent, and as a result I would highly suggest that folks who aren't privy to films about tragedies better steer clear of this. For everyone else, however, who is a 70s grindhouse horror fan, fans of erotic horror cinema, and fans of Euro-trash, there is a lot here to recommend. For starters, Udo Kier as Dracula. Oh my god can this man tug at the heartstrings. His performance as Dracula is as pitiful, feeble, and tortured as you can ever imagine. Say what you will about his theatrical line delivery, but I found myself tearing up just looking at the guy. The opening scene in which we watch him cover his old frame with make-up is one of my favorite opening scenes in horror. It is sad, it is tranquil, and it is classy all at once. Udo Kier has such gentle and expressive eyes that help give the character a sense of lost humanity that I found incredibly poignant. Arno Juerging as Anton is also astounding. He allows his character to be somewhat charming and timid while still allowing him to show a vicious tendency. He's an unusually memorable aspect of the film that certainly helps to differentiate this picture from other films of it's nature. Joe Dallesandro is a lot funnier and has a lot more fun with his role here than in the past, but above all he just looks great on camera regardless of the quality of film stock. He has such a wonderful presence here, and his character is a lot more interesting and clever than you would expect from this type of role. Above all, however, he's a hero who you don't feel entirely comfortable rooting for. He's a main character whom the writer doesn't mind showing you his sleazy side. He's not an entirely likable protagonist, and I always appreciate when filmmakers have the balls to do that. It worked in 2009 with District 9, and it works just as brilliantly here. The musical score by Claudio Gizzi is one of the great haunting horror film scores of the 70s. This score, as well as his equally powerful score in Flesh For Frankenstein, are two of my favorite music scores of all time. It fits the sadness of the film like a glove. This is one of my favorite vampire films and one of my favorite films of it's kind. It's not going to appeal to everyone, especially the easily offended, but it is a tremendous piece of horror filmmaking that I personally think deserves it's place in film history. Best of all, it is a vampire film that, like the 2008 Swedish film Let the Right One In as well as the 1996 actioner From Dusk Till Dawn, follows all the basic rules in vampire lore. This film also includes a cameo by Roman Polanski, and to this day I think it's one of the funniest and most intelligent cameo appearances of all time. What more can I really say? This is a cult classic of the highest caliber. It's beautifully shot, it's evenly paced, it's gory as hell, it's genuinely erotic, and it's not afraid to break your heart. If you are a fan of cult horror and you haven't seen this, you are seriously missing out.",
         "While I rate Paul Morrissey's 'Flesh For Frankenstein' just a little higher than this one, it is without a doubt a vampire trash classic, and highly recommended viewing. Morrissey once again teams the legendary Udo Kier ('The Story Of O', 'Suspiria') with Warhol superstar Joe Dallesandro, and the creepy Arno Juerging (Otto from '...Frankenstein'), and adds to the strong supporting cast Italian veteran Vittorio De Sica, and even a cameo from director Roman Polanski. '..Dracula' features a similar mixture of horror and camp to the earlier movie, but this time the emphasis is more on sex and decadence than gore and humour. Dallesandro's performance is below par as a Communist servant, but Kier once again excels in the title role, creating some genuine sympathy as the sickly, desperate Count who can't get enough \"wer-gins\" blood to sustain himself. 'Blood For Dracula' is essential viewing for all 1970s cult movie buffs.",
         "Count Dracula (Udo Kier) can only drink the blood of virgins or he becomes violently ill. He comes upon a family with a bunch of virgin daughters. He plans to have each of them but the family's horny gardener (Joe Dellesandro) is after them too...for sex! Silly but you just can't stop watching. Like it's companion piece (\"Andy Warhol's Frankenstein\") the story is silly with over the top acting and gore. Kiers convulsions after drinking the blood of non-virgins is SO disgusting they're hilarious. And (in the X rated version) there are some fairly explicit sex scenes between Dellesandro and the daughters. And Dracula's death at the end is just great! Silly and stupid but very funny. Try to catch the X rated version.",
         "This film opens with a close up of Udo Keir, possessor one of the most beautiful male faces of the era, applying makeup in front of a mirror. The camera then reveals that being Count Dracula, like all vampires, he has no reflection! thus the humorous tone is set for the rest of the film. The dialogue is wild and delicious, helped along by hugely overstated accents of all kinds and exaggerated overacting and in many cases - no acting at all. The film is stunningly photographed and is often beautiful to look at when you can, but you may find it difficult to watch Dracula regurgitate gallons of impure (i.e. non-virgin) blood or watch him lick pure virgin blood from the floor. Much more easy on the eye is the sight of a naked Joe Dallesandro, the camera drinks it's fill of this guy and many close-ups of his amazing face fill the screen. There is also an excellent cameo from Roman Polanski who challenges Count Dracula to an amusing game in a bar. The climax is blood soaked and bizarre and like the whole movie, way over the top. A hugely entertaining film providing you have the stomach for it!",
         "Paul Morrissey's \"Blood for Dracula\" is definitely a cult classic.Udo Kier is excellent as a Dracula.He can't suck the blood of anyone but a virgin or he vomits.In one outrageous scene he licks the blood of a virgin off the floor.The film is about as sleazy and politically incorrect as you can get.There is plenty of soft-core sex in this one plus incredibly gory climax when Dracula is dismembered.There is also a lovely cameo by Roman Polanski(\"Rosemary's Baby\",\"The Tenant\").Check it out in pair with its companion piece \"Flesh for Frankenstein\"(1974)."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Compagnia Cinematografica Champion",
         "Yanne et Rassam",
         "Andy Warhol Presentation"
      ],
      "summaries": ["Udo Kier is without a doubt the sickliest of vampires in any director's interpretation of the Bram Stoker tale. Count Dracula knows that if he fails to drink a required amount of pure virgin's [pronounced \"wirgin's\"] blood, it's time to move into a permanent coffin. His assistant (Renfield?) suggests that the Count and he pick up his coffin and take a road trip to Italy, where families are known to be particularly religious, and therefore should be an excellent place to search for a virgin bride. They do, only to encounter a family with not one, but FOUR virgins, ready for marriage. The Count discovers one-by-one that the girls are not as pure as they say they are, meanwhile a handsome servant/Communist begins to observe strange behaviour from the girls who do spend the night with the Count. It's a race for Dracula to discover who's the real virgin, before he either dies from malnourishment or from the wooden stake of the Communist!"],
      "budget": 0
   },
   "movielensId": 1329,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-08-13",
      "dvdReleaseDate": "1998-12-08",
      "directors": ["Paul Morrissey"],
      "runtime": 103,
      "movieId": 1329,
      "title": "Blood for Dracula",
      "mpaa": "R",
      "actors": [
         "Udo Kier",
         "Joe Dallesandro",
         "Vittorio De Sica",
         "Maxime McKendry",
         "Arno Juerging",
         "Milena Vukotic",
         "Dominique Darel",
         "Stefania Casini",
         "Silvia Dionisio",
         "Roman Polanski"
      ],
      "imdbMovieId": "0071233",
      "originalTitle": "Blood for Dracula",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["bY9CG7RUjQw"],
      "plotSummary": "Deathly ill Count Dracula and his slimy underling, Anton, travel to Italy in search of a virgin's blood. They're welcomed at the crumbling estate of indebted Marchese Di Fiore, who's desperate to marry off his daughters to rich suitors. But there, instead of pure women, the count encounters incestuous lesbians with vile blood and Marxist manservant Mario, who's suspicious of the aristocratic Dracula.",
      "tmdbMovieId": 25944,
      "avgRating": 2.76323,
      "releaseYear": "1974",
      "numRatings": 378,
      "posterPath": "/c4WFR6nV3oOkuKqxrVOs6ZOnXMd.jpg"
   }
}