{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "emigration",
            "id": 1625
         },
         {
            "name": "dominican republic",
            "id": 190019
         }
      ],
      "imdb_id": "tt0114015",
      "video": false,
      "title": "Nueba Yol",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Balbuena",
               "gender": 0,
               "credit_id": "52fe48cfc3a36847f817a93f",
               "name": "Luisito Marti",
               "profile_path": null,
               "id": 222473,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Chef",
               "gender": 2,
               "credit_id": "52fe48cfc3a36847f817a943",
               "name": "Alfonso Zayas",
               "profile_path": "/m0AY45e0G3nwc6kkTFXxXxpkn2j.jpg",
               "id": 222477,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nancy",
               "gender": 0,
               "credit_id": "52fe48cfc3a36847f817a947",
               "name": "Caridad Ravelo",
               "profile_path": null,
               "id": 71839,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Fellito",
               "gender": 2,
               "credit_id": "52fe48cfc3a36847f817a94b",
               "name": "Raúl Carbonell hijo",
               "profile_path": null,
               "id": 222474,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Pedro",
               "gender": 0,
               "credit_id": "598b6bac9251413706029da3",
               "name": "Rafael Villalona",
               "profile_path": null,
               "id": 1809293,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Juan Carlos",
               "gender": 0,
               "credit_id": "598b6bb9c3a36824e2026c0a",
               "name": "Joel Garcia",
               "profile_path": null,
               "id": 1845273,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Police Officer",
               "gender": 0,
               "credit_id": "598b6bc69251414bb403706f",
               "name": "Randolph Feliz",
               "profile_path": null,
               "id": 1866867,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Xiomara",
               "gender": 0,
               "credit_id": "598b6bd2c3a368127e000168",
               "name": "Bersaida Vega",
               "profile_path": null,
               "id": 1866868,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Matilde",
               "gender": 0,
               "credit_id": "598b6bdc9251414bac037e56",
               "name": "Rosalba Rolón",
               "profile_path": null,
               "id": 1656675,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Consul",
               "gender": 0,
               "credit_id": "598b6be7c3a36824e2026c31",
               "name": "Manny Gironny",
               "profile_path": null,
               "id": 1866869,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "'El Flaco'",
               "gender": 0,
               "credit_id": "598b6bf492514139e500017b",
               "name": "Ledesma",
               "profile_path": null,
               "id": 1866870,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Chico",
               "gender": 0,
               "credit_id": "598b6bff925141393c000230",
               "name": "Rafael Decena",
               "profile_path": null,
               "id": 1866871,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Teresita",
               "gender": 0,
               "credit_id": "598b6c089251413f08000011",
               "name": "Graciela Mas",
               "profile_path": null,
               "id": 222475,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Natalia",
               "gender": 0,
               "credit_id": "598b6c149251413f25000021",
               "name": "Carlota Carretero",
               "profile_path": null,
               "id": 232239,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Policia",
               "gender": 0,
               "credit_id": "598b6c20c3a36817fd00001e",
               "name": "Fermín Suárez",
               "profile_path": null,
               "id": 1866872,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "580cd8b1925141713b00e915",
               "name": "Ángel Muñiz",
               "profile_path": "/2yQONSSr9ENOppber9WuHvb16WR.jpg",
               "id": 114997,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "580cd9d5c3a368258f00e233",
               "name": "Ángel Muñiz",
               "profile_path": "/2yQONSSr9ENOppber9WuHvb16WR.jpg",
               "id": 114997,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.039137,
      "production_countries": [{
         "iso_3166_1": "DO",
         "name": "Dominican Republic"
      }],
      "id": 55475,
      "vote_count": 1,
      "budget": 0,
      "overview": "Balbuena is a genial illegal immigrant who makes his way to New York City to take a bite out of the Big Apple. But his hopes of finding a better life soon begin to fade as Balbuena encounters one obstacle after another in the hardscrabble, uncaring metropolis.",
      "similar": [
         772,
         1771,
         769,
         594,
         59108,
         57431,
         1572,
         51876,
         2642,
         10096,
         10661,
         496,
         891,
         1374,
         1900,
         18487,
         40807,
         311,
         164,
         1213
      ],
      "original_title": "Nueba Yol",
      "runtime": 102,
      "poster_path": "/1VNalbjNQkKejRnHW2XM6SwnCa0.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cigua Films",
            "id": 93488,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "D'Pelicula",
            "id": 93489,
            "origin_country": ""
         }
      ],
      "release_date": "1995-08-16",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Dominican Republic",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ángel Muñiz"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Ángel Muñiz"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0114015/",
      "coverLink": null,
      "actors": ["Stars: Luisito Marti, Caridad Ravelo, Raúl Carbonell | See full cast and crew »"],
      "reviews": [
         "I was disappointed to see the low rating this film got overall, but I noticed that about 1/3 of voting viewers gave it a 10. If you like it, you really like it. And the people who like it most are Dominicans. Is this because it only appeals to people from that particular island country? I have recommended it to friends and students only to hear them complain about plot and characterization being too...stereotyped. Balbuena is a bit of a caricature. This is in the great tradition of Hispanic comedy, including pictures like the Cantiflas films and Mi familia (with its roots in Chicano theater). It has something in common with early Spike Lee (e.g. Do the Right Thing) and also a film like John Sayles' Brother from Another Planet. It does not offer psychological realism of the sort that reinforces bourgeois individualism. But if you would like to have a taste of Dominican culture and you aren't afraid to temporarily give up your Hollywood aesthetic, this film could be for you. And Balbuena is funny as hell.",
         "This movie is just so Dominican. I love it!!! this film made me remember my roots and the spicy sense of humor of the Caribbean people. Balbuena, the main character, belongs to Dominican Republlic folklore. He reflects the eternal fight for reach \"USland\" thinking that in this soil everybody could be \"rich\", and then, go back wrapping with dollars. Many years before of the birth of this movie, Luisito Martí as Balbuena, was looking for his dreams in several local TV shows in his country. At the end of every sketch something happened and he couldn't reach New York... Nueva Yol. It so important to notice that for Dominican people New York is la like the Mecca!!!",
         "This is a well made comedy with funny, but not exaggerated, jokes. The downside is the introduced love-affair which is not very convincing. Combines reality and comedy very well.",
         "for all of those who say this movie is too Dominican that's it is... well it was made in Santo Domingo by us the Dominicans. yeah i'm Dominican and very proud of it... don't be saying the movie is not good just because u don't understand how US DOMINICANS be talking OK... and Balbuena is funny as hell. us Dominican are very proud of this movie because it reflects what any Dominican would want that is to come to the U.S for \"el sueño Americano\". It's a good thing this movie was made it makes all of us the Dominicans very proud and we like it a whole lot. Just make sure you watch the movie and really understand what they are saying before saying anything.",
         "This picture gets the reality that embrace many foreigners trying to get to the United States. Being this one of the first attempts of the Dominican Film Industry I don't think they did that poorly. The story is based on a local comedy character (Balbuena) who widowed several years early. He doesn't have any skills or knowledge and only goes around surviving until a friend of him promises to take him to the promise land \"nueva yol\" (new york city). One of the phrases to convince him to go there is: In nuevayol you find five dollar bills growing in the streets. You will find many locations and culture from The Dominican Republic and some of the places where most of the dominican colony resides in New York",
         "What apparently has been an essential aspect of Dominican pop culture for nearly two decades managed to achieve high status on the island even with its minimalist budget. Unfortunately the sound quality is generally poor, and the quality of the acting is inconsistent, the story is heartwarming and Balbuena quickly becomes the most loved and well-known character in the Dominican Republic. Balbuena is a man barely making ends meet a few short years after the death of his beloved wife. His dream has always been to go to the United States, or Nueba Yol more specifically. His friend, Fellito presents him with a seeming chance of a lifetime to go to the United States for a comparatively small price illegally. However, as goes most stories about immigrants to the US, Balbuena learns the US isn't quite everything it was said to be as he encounters cultural hostility, run-ins with the law, and financial instability. However, throughout it all, Balbuena remains true to his character: hardworking, endearing, and loving. The story is a good one, even though it is fairly well-known (a poor and destitute, lovable character has no option but to flee illegally to the US to realize his dream of wealth and prosperity only to discover soon after that it is not all it was hoped to be). I would recommend it, despite it's general failure to appeal to American audiences.",
         "Because of a lack of funding, Nueba Yol is not a very well made film. Although the main character, Balbuena, is quite likable, the film is lacking in multiple elements. There is a bit of confusion as to how certain events come about and a good amount left unanswered at the end. The concept of the movie, a Dominican wanting to move to New York and find a new life, is good and it is relatable in that many people find their dreams turn out differently than expected, but it is not well carried out. As a Dominican film it isn't bad and many Dominicans love it, but showing it to an American audience will evoke a less than desirable response.",
         "I had just seen this movie. I thought it was good but I didn't find it as funny as some have. The character Balbuena was funny in a child like way, but the story itself was a bit depressing. The ending was somewhat confusing for me, pero I'm glad it was a happy one. I really liked the way the family discussed the differences between raising children in the US and in D.R. Its true, and it hasn't always been this way in the US, it was more like Balbuena and his cousin described it. Over all I liked the movie, but it went a bit too fast in some areas (like the relationship between Balbuena and Nancy)and some characters didn't get a chance to fully develop.",
         "This movie is not only funny but it shows the mentality that Dominicans in the Dominican Republic have, I know because my entire family member in d.r thought the same things. (if you live in new York money flies like leafs and you can just catch it in the air), it also shows how an immigrate comes to face all the difficulties of finding a job and having to sleep of sofa mattress and come to realize this is not how it was picture or said. The movie is very funny and also truthful I think the author wanted people to know mostly of how people that don't live in the us think about this country, he was successful doing it. Overall I think the movies great!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cigua Films",
         "D'Pelicula"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 133,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1995-08-16",
      "dvdReleaseDate": null,
      "directors": ["Ángel Muñiz"],
      "runtime": 102,
      "movieId": 133,
      "title": "Nueba Yol",
      "mpaa": null,
      "actors": [
         "Luisito Marti",
         "Alfonso Zayas",
         "Caridad Ravelo",
         "Raúl Carbonell hijo",
         "Rafael Villalona",
         "Joel Garcia",
         "Randolph Feliz",
         "Bersaida Vega",
         "Rosalba Rolón",
         "Manny Gironny",
         "Ledesma",
         "Rafael Decena",
         "Graciela Mas",
         "Carlota Carretero",
         "Fermín Suárez"
      ],
      "imdbMovieId": "0114015",
      "originalTitle": "Nueba Yol",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Balbuena is a genial illegal immigrant who makes his way to New York City to take a bite out of the Big Apple. But his hopes of finding a better life soon begin to fade as Balbuena encounters one obstacle after another in the hardscrabble, uncaring metropolis.",
      "tmdbMovieId": 55475,
      "avgRating": 2.5,
      "releaseYear": "1995",
      "numRatings": 21,
      "posterPath": "/1VNalbjNQkKejRnHW2XM6SwnCa0.jpg"
   }
}