{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "teen movie",
            "id": 11870
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "april fool's day",
            "id": 154681
         },
         {
            "name": "holiday horror",
            "id": 186463
         },
         {
            "name": "canuxploitation",
            "id": 206850
         },
         {
            "name": "elimination derby",
            "id": 219991
         },
         {
            "name": "college friends",
            "id": 221023
         }
      ],
      "imdb_id": "tt0090655",
      "video": false,
      "title": "April Fool's Day",
      "recommendations": [
         39874,
         36599,
         40229,
         27475,
         37936,
         45878,
         24274,
         18196,
         40969,
         14240,
         13555,
         13567,
         18502,
         24831,
         29794,
         29787,
         34311,
         25748,
         59797,
         28090
      ],
      "backdrop_path": "/vPDr6U0NbDhlpOFnDh5EjplDcfS.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5456b656c3a3681473007a90",
         "content": "Muffy the ham-pie slayer!\r\n\r\nA group of college buddies convene at a friends isolated abode and get killed off one by one…\r\n\r\nGreat fun, Fred Walton, Frank Mancuso Jr. and Danilo Bach tap cheekily into the 1980s obsession with slasher films, and produce a self aware horror movie of mighty dark comedy proportions. Quite often when film makers try to laugh as they bite the hand that feeds them they fall flat on their faces, not so here. Ok! It’s hardly genius film making but the makers instil their picture with interesting killings, twists and turns, and even an audacious narrative that would only be appreciated some years later. Horror movie conventions are adhered to with tongue stuck in bloody cheek, none more so than with an ending that will infuriate some, but conversely will bring on the chortles in others. 7/10",
         "url": "https://www.themoviedb.org/review/5456b656c3a3681473007a90"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Muffy / Buffy St. John",
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030e2f",
               "name": "Deborah Foreman",
               "profile_path": "/qMhBRDfWOlQVGlHtLaGcDBEJCIv.jpg",
               "id": 79741,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Arch Cummings",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e5f",
               "name": "Thomas F. Wilson",
               "profile_path": "/n5Vk17hmXW5OqltDYH3i0qOTHcZ.jpg",
               "id": 1065,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ferryman",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e3b",
               "name": "Lloyd Berry",
               "profile_path": "/s7SVCOtvcuQ9wRQPZfUdahb5x88.jpg",
               "id": 25024,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Constable Potter / Uncle Frank",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e43",
               "name": "Tom Heaton",
               "profile_path": "/4Tg1ZVveYWMdQq5zW9uIyWzTIB7.jpg",
               "id": 56015,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Rob Ferris",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e4b",
               "name": "Ken Olandt",
               "profile_path": "/pfsvdAEHUnMQmwvXHXPl6YPtBTi.jpg",
               "id": 70556,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Nan Youngblood",
               "gender": 1,
               "credit_id": "52fe44aec3a368484e030e53",
               "name": "Leah Pinsent",
               "profile_path": "/muKNUntn3epBOG2S3cJdL46bIJX.jpg",
               "id": 55575,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Chaz Vyshinski",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e57",
               "name": "Clayton Rohner",
               "profile_path": "/uVLfEz3oE6VF2VG8YpcjjP4wa5M.jpg",
               "id": 91725,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Kit Graham",
               "gender": 1,
               "credit_id": "52fe44aec3a368484e030e5b",
               "name": "Amy Steel",
               "profile_path": "/mO8bYH4O6LnYW9wOTWm9CKzGToU.jpg",
               "id": 58710,
               "order": 7
            },
            {
               "cast_id": 2,
               "character": "Harvey 'Hal' Edison",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e33",
               "name": "Jay Baker",
               "profile_path": null,
               "id": 81624,
               "order": 8
            },
            {
               "cast_id": 3,
               "character": "Clara",
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030e37",
               "name": "Pat Barlow",
               "profile_path": null,
               "id": 47744,
               "order": 9
            },
            {
               "cast_id": 5,
               "character": "Nikki Beshears",
               "gender": 1,
               "credit_id": "52fe44aec3a368484e030e3f",
               "name": "Deborah Goodrich",
               "profile_path": null,
               "id": 92820,
               "order": 10
            },
            {
               "cast_id": 7,
               "character": "Buck",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e47",
               "name": "Mike Nomad",
               "profile_path": null,
               "id": 92821,
               "order": 11
            },
            {
               "cast_id": 9,
               "character": "Skip St. John",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e4f",
               "name": "Griffin O'Neal",
               "profile_path": "/80xL21qTnaOYt6fpPIv7bY6YN6t.jpg",
               "id": 92822,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "574ae8559251414001000c56",
               "name": "Frank Mancuso Jr.",
               "profile_path": null,
               "id": 49284,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e65",
               "name": "Danilo Bach",
               "profile_path": null,
               "id": 772,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030e6b",
               "name": "Fred Walton",
               "profile_path": null,
               "id": 62556,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "574ae862c3a3685867000a19",
               "name": "Charles Bernstein",
               "profile_path": null,
               "id": 13669,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "574ae86e9251412d29000e1d",
               "name": "Charles Minsky",
               "profile_path": null,
               "id": 1214,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "574ae889c3a3683c18000e82",
               "name": "Bruce Green",
               "profile_path": "/yplxWPVgwK1b33AjvbhM9mWX2Aw.jpg",
               "id": 12970,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "574ae89cc3a3683a5e000d52",
               "name": "Pamela Basker",
               "profile_path": null,
               "id": 13433,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "574ae8a8925141362d000ec7",
               "name": "Fern Champion",
               "profile_path": null,
               "id": 12942,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "574ae8b3c3a3683a5e000d57",
               "name": "W. Stewart Campbell",
               "profile_path": null,
               "id": 12291,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "574ae8bf9251413920000d12",
               "name": "Della Mae Johnston",
               "profile_path": null,
               "id": 1627917,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "574ae8d49251414073000c66",
               "name": "Martin Becker",
               "profile_path": null,
               "id": 1627918,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "574ae8e39251413f47000c67",
               "name": "Jim Gill",
               "profile_path": null,
               "id": 1627919,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "574ae8efc3a368319a000e52",
               "name": "Bettie Kauffman",
               "profile_path": null,
               "id": 1627920,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "574ae8fb92514119a5000254",
               "name": "Christopher Swift",
               "profile_path": null,
               "id": 1627921,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 7.17364,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 24913,
      "vote_count": 95,
      "budget": 5000000,
      "overview": "A group of eight college friends gather together at an island mansion belonging to heiress Muffy St. John to celebrate their final year of school. They soon discover that each has a hidden secret from their past which is revealed, and soon after, they turn up dead.",
      "similar": [
         948,
         3597,
         3600,
         30833,
         30670,
         357096,
         10781,
         123109,
         24124,
         15069,
         39874,
         8090,
         15762,
         1949,
         979,
         10285,
         4771,
         238636,
         13567,
         276488
      ],
      "original_title": "April Fool's Day",
      "runtime": 89,
      "poster_path": "/FiDprIXcWbAPz4sB3vYjxSjHrU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "YCTM",
            "id": 77507,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Hometown Films",
            "id": 52760,
            "origin_country": ""
         }
      ],
      "release_date": "1986-03-27",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Childish pranks turn into a bloody battle for survival!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fred Walton"],
      "runtime": 89,
      "synopsis": "In the cellar of her house, Muffy St. John (Deborah Forman) picks up a jack-in-the-box, and thinks back to her 10th birthday party where she received it as a birthday gift (a tiny alien which jumped out and scared her, making the other party guests laugh). Meanwhile, a group of young college students wait at a dock to be picked up by a ferry and transported to Muffy's island cottage for the weekend. They include Kit (Amy Steel), and her boyfriend Rob (Ken Olandt), Nikki (Deborah Goodrich) and her boyfriend Chaz (Clayton Rohner), and Arch (Thomas F. Wilson) whom are best friends. The rest of the group includes Nan (Leah King Pinsent), Hal (Jay Baker), and Muffy's cousin Skip (Griffin ONeal). On the ferry, Skip and Arch play a game of 'stretch' (throwing a switchblade and both trying to stretch for it), until an irritated Arch throws the blade at Skip and hits him in the stomach. Skip falls off into the water in which the ferry crewman Buck (Mike Nomad) and Rob jump in only to see Skip with a trick knife-belt. Skip and Arch laugh at their April Fool's Day joke which happens to be that very day. Buck stays in the water and tries to hook the ferry as it comes into the dock, and as the group argues, Buck is hit by the ferry. He jumps out of the water with a chopped face. Buck is taken away by the ferryman (Lloyd Berry) in a motorboat screaming \"they did it!\" A local policeman, Constable Porter (Tom Heaton), is angry at the kids for letting this prank get out of control and tells them to stay put on the island as he accompanies Buck to the local hospital. Muffy takes the group up to her house where she shows them the living and dining room areas and shows them their quarters to spend the night. That evening, the group sits around the dinner table as Skip, still upset over what happened to Buck, stays outside and drinks. Muffy, with a smirk on her face, invites everyone for dinner as Nan sits on a whoopee cushion, and Arch leans back in a breakaway chair. They talk over what they will do after graduation in which Muffy tells them about her inheriting her father's house and talks about turning it into a country inn. They drink to a toast as Muffy's smirk gives away another gag she sets up as everyone spills champagne on themselves from the trick drippy glasses as Muffy laughs. They retire to their rooms for the night as they encounter more gags left behind my Muffy, which includes a trick cigar that blows up when Hal lights it; spurting water faucets, and trick lights that don't turn off. Hal finds snipped newspaper articles about people dying in a fog and a fire, which he apparently was involved in some years back. Arch finds a drug paraphernalia in his bathroom cabinet which he is disturbed by over his past as a junkie. Nikki finds a studded collar with a chain in which her reaction gives away her interest in S&M and bondage. Nan comes out of the shower when she hears a baby cry, and she finds a tape recorder playing in her drawer which makes her upset. Outside, a drunken Skip enters the boathouse near the dock when he is grabbed by someone. The next day, Kit and Rob find Muffy in the kitchen cooking breakfast with her hair astray and acting strange. The group enjoys hanging around the back yard, while Nan tries to chase down Muffy. Rob is still upset about his own discovery in his and Kit's bedroom where his counselor informed her that he was not serious enough to get into medical school. He and Kit go to the boathouse to kiss when Kit sees Skip float by and the two of them run to tell the others. Chaz finds Skip's broken and bloody trick switchblade, but no trace of Skip's body. Arch suggests that it is Buck who has returned to seek his revenge for his being maimed the previous day. Meanwhile, Nan catches up to Muffy and angrily tells her about finding the cassette-tape joke, and Muffy claims not to know what Nan is talking about. Nan tells Muffy that she had an abortion some years back and kept it quiet between them. In the woods, as Arch is running through to the house, he gets caught in a trap when he is hung upside down by a snare, while a snake is on the ground trying to bite him. An unseen person appears, kicks away the snake, and stands over Arch who screams. On the same path a few minutes later, no one can find Arch. Rob tries to call the police on the house phone, but is unable to get through. When the water faucets in the house turn off, Hal and Nikki go to the nearby well. Hal accidentally drops the bucket into the well and does not want to go down to retrieve it. Nikki climbs down into the well when a rung breaks, making her fall into the water. As Hal climbs down to help her, Nikki finds the severed head of Arch, as well as Nan's dead body in the well. That evening back at the house, Constable Porter calls and says that he is at the hospital with Buck and tells them that he is coming to the island with an important thing to tell them and he will send a flare up at the dock when he arrives. Aware that there is a killer out there, the group goes around locking all the doors and windows of the house. In the study, Kit finds an old photograph of twins. Nikki says that Muffy has been acting strange all day and looks different from a pasty white face to her Catholic Girls School clothing as well as mentions the clodhopper \"nurse shoes\" that she also is wearing. Hal mentions that he heard Muffy and Nan arguing earlier about something in Nan's room, referencing an abortion that Nan was rumored to have gotten. They talk about the things found in their rooms when Muffy enters and says that she is going to bed. Chaz and Nikki go upstairs to their room as Rob heads up to the attic to keep an eye out for the constable. Kit goes off with Rob while Hal stays to watch the rooms downstairs. As Nikki packs her bags to leave, Chaz tries to calm her down by putting on a leather mask. Annoyed, Nikki pushes him to the bed and leaves the room. Nikki returns to see Chaz lying still on her bed. He does not respond to her and when she moves his hands away from his crotch, she sees blood. She is approached by someone standing behind the door. In the attic, Rob tells Kit that no one is to be left alone with Muffy for he does not trust her. They find a collection of dolls, apparently representing dead people, and a red flare goes off in the distance outside. They run out of the attic and call to everyone, but cannot find the others. The two enter Nikki and Chaz room only to find a bloody room, but no bodies. Kit runs into Muffy's room and finds Hal dead after being tied up and hung. In a panic, Kit and Rob run outside and to the dock where they pull in a motorboat, but no one is on board. They find a letter on the boat addressed to Constable Potter which talks of \"Miss St. John\", a dangerous mental patient who escaped several days ago from a clinic. Kit says it can't be Muffy for she was with her at Vassar all that time. They try to start up the boat to leave, but the keys are gone having been taken by Constable Potter who has gone off. Rob says that there are a spare set of keys to the boat in the house and the two of them return to find the house totally dark with all the doors and windows closed, and the shades pulled down. They enter through a cellar window where they see a bloody trail and find Muffy's clothes from the night before in the basement fireplace. Height measurements are found on one of the basement walls for 'Muffy' and 'Buffy'. Kit recalling the photo of the twins, says that it must be Muffy's twin sister, Buffy, who has been doing all the killing. Kit and Rob see eyes looking at them from behind a painting and, after pulling it away, discover Muffy's severed head. They run up to the kitchen to find the keys for the boat when Muffy/Buffy appears at the back door armed with a large breaking knife, trying to get inside. Buffy forces the door open and pushes Rob into a closet and locks it and goes after Kit, who runs into the dining room and tries to reason with the pasty-faced, wild-eyed Buffy who does not respond and terrorizes her with the breaking knife. Kit pushes Buffy back when she tries to stab her and runs into the adjacent living room to find all of the dead people, alive and well, sitting around the room. Buffy walks in and.... pushes the fake blade of the breaking knife into her hand as she everyone else looks up at Kit and yell... APRIL FOOLS!!!!!! Buck appears in the closet with Rob, pulls off his prosthetic injury, and slaps it on Rob's face and unlocks the closet door for him. Rob runs out and into the living room where everyone laughs some more. Kit and Rob are relived, but not amused at this giant practical joke on them. Muffy thanks all of them for participating and helping out. She tells everyone about her idea about making the house into a country inn, but having a special type of \"whodunit weekend\" where guests are to figure out a simulated mystery and she wanted a \"rehearsal\". Once a person was \"killed\" they were let in on the joke, with Rob and Kit being the last ones left and the winners who figured it all out. Muffy explains that her twin sibling is actually her cousin Skip, Constable Potter is actually her wealthy uncle, and Buck is a make-up artist who constructed all the severed heads and fake bodies. Even the ferryman was in on the whole thing as well. Muffy apologies for some of the more personal jokes, and the group drinks from dozens of bottles of champagne that Muffy brings out and they all have a happy good time. Later that night, a very inebriated Muffy returns to her bedroom for the night when she finds a package on her bed and upon opening it up finds a jack-in-the-box. As Muffy warily beings turning it to open, the jack jumps out when suddenly Nan jumps out behind the bed, grabs Muffy by the hair, gorily slices her throat, and Muffy screams. Nan smiles and shows Muffy the fake knife with the fake blood spraying from it, as a final back-at-you joke. \"April Fools\" says Nan to Muffy, as the jack-in-the-box winks at the viewers.",
      "writers": ["Danilo Bach"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090655/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxOTY2MjYzMF5BMl5BanBnXkFtZTcwNzkzMjUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Deborah Foreman, Griffin O'Neal, Clayton Rohner | See full cast and crew »"],
      "reviews": [
         "APRIL FOOL'S DAY has just recently gotten a sort of cult status among horror film fans. Casual horror viewers or those who are diehard gore hounds haven't been kind to this film, but it is quite possibly the most intelligent, best-acted, and coolest of all the 80s slasher films. A group of college friends venture to the island home of one of their classmates for the weekend and wind up being killed by an unknown assailant, believed to be the victim of a cruel practical joke played by one of the students. Amy Steel (my fave from FRIDAY THE 13TH PART 2) is Kit, the \"last girl\", and Ken Olandt is her boyfriend Rob. They are both very good and are believable, likable characters that the audience can root for. Other notable performances include Griffin O'Neal (son of Ryan), Thomas F. Wilson (Biff from BACK TO THE FUTURE), Deborah Foreman, who is very good in dual roles, Leah Pinsent (the classic good girl), Deborah Goodrich (too cool as the slut), and Clayton Rohner (the typical horny guy). I can't think of a bad thing to say about this movie except that some viewers will feel cheated by the two surprise endings, like I did at first. But appreciate the fact that they are totally unexpected and work better than any other ending thought up for the film. APRIL FOOL'S DAY is strongly recommended to serious horror film fans and even casual viewers. Not very gory, but that's a plus in this case. Notice the similarities to Agatha Christie's \"Ten Little Indians\", of which this is sort of a modern updating. A whole lots of fun and the best damn slasher film of the 80s.",
         "April Fool's Day has just the right smarts about it that it holds up extremely well, even all these years later. While the cast may be youthful, the characters and story set this film way above \"teen\" slasher or horror flicks. Mainly, because this is really a mystery in the vein of Ten Little Indians. It's a good thing I saw this film in a theatre when it was first released in 1986 -- because the VHS cover has something on it that would have kept me AWAY if I had not seen the film already: \"It's just what you'd expect from the producer who brought you Friday the 13th -- Parts Two, Three, Four, and Five.\" You just can't put April Fool's Day in the same category as those films! This is far superior in story and intelligence. It's clever, well-written, and has great characters that you like even if they are not so nice! These days it seems it's more important to find the most popular actors, and that is usually distracting and doesn't guarantee a good film. April Fool's Day had lesser known stars for that time (Deborah Foreman, Amy Steel, Clayton Rohner, Griffin O'Neal) and that worked as an advantage. The basic premise of a group of college students stuck on an island in a big house and one by one they disappear, yes, it's been done in many variations before. But the clever execution of the story, red herrings, and the underrated Deborah Foreman's delightful portrayal of Muffy/Buffy all make for a really fun viewing experience. Foreman has just the right amount of sweetness and can go right into being just plain quirky with such ease. The touch of having dolls on the dinner table, sort of like name tags, will bring a giggle and a smile for sure! One plus for this film is the fact that it didn't sink into the tiring T & A route. Sure, a few of the characters have sex on the brain but their actions and dialogue never really wander off into the gratuitous area. Guys, if you really want lots of breasts than just go ahead and get some porn or a Playboy video, okay? Let the rest of us enjoy a good story once in a while! After the body count rises and things escalate into a tense and frenzied chase through the house, you'll be surprised at what happens next. April Fool's Day is one of the few films of this kind that actually had a very surprising reveal and I was even caught off guard, left with my jaw agape at what the whole deal was about. The BIG surprise just happens so...abruptly, that you feel just like the character that runs into the room -- just stuck for a second! After about 90 minutes of mystery, the payoff BETTER be good, and sure enough, this one doesn't disappoint! I'm especially thrilled to have picked up the eerie soundtrack by Charles Bernstein on vinyl when it first came out, and to this day love to give it a spin on the turntable. Paramount has a vast library of films that just NEED to be given great treatment on DVD, and I'm crossing my fingers that films like April Fool's Day, Let's Scare Jessica To Death, and Polanski's film The Tenant will be given their glory. >",
         "One of the more fondly remembered horror entries of the '80's is this unique gem that's much more clever and amusing than the average slasher film. Young woman invites her beloved college friends to her island home for a weekend of fun, but everything goes wrong. A freak accident occurs, mysterious things appear in the guests rooms, our hostess starts acting strangely, and bodies are starting to pile up! With its clever combination of Agatha Christie-type mystery, teen horror film conventions, and quirky humor - it's not hard to understand why this film has developed a bit of a fan base. Even viewers who don't like horror films may find themselves enjoying this witty and twisted little venture. Director Walton does well in giving the film an air of mystery and spookiness. All the more adding to the atmosphere is the lovely music score of Charles Bernstein. The film is nicely shot in beautiful British Columbia. The true highlight of this film though is its above-average cast. While there are really no known actors in the cast, they all deliver great performances and bring their characters to a wonderfully likable light! Deborah Foreman, in probably her best performance, is great as hostess Muffy. Ken Olandt and Amy Steel are great as a couple trying to solve the mystery of it all. Clayton Rohner and Thomas F. Wilson are a joy as two joke-happy friends. Jay Baker, Leah Pinsent, and Deborah Goodrich are equally good in their supporting roles. As the tagliner says, April Fool's Day is certainly a 'cut' above the rest of its kind. It's a fun watch whether you enjoy the horror genre or not. *** 1/2 out of ****",
         "Definitely not the typical slasher fare you might expect from the 1980s, April Fool's Day takes the ordinary slasher formula and spices it up - and in the process makes a much more palatable film than most of the films it initially imitates. A group of nubile teens(OK, not so different to begin with)go to their friend's remote island home somewhere in the Northwest. Here, they laugh, have sex, joke around because it is April Fool's Day, and, oh by the way did I mention, have sex. Although this part of the movie is pretty typical, it is well-shot compared to other films of its ilk and we do get some character development(not a lot) but some. Soon, people begin to die and things get serious. For a slasher film, this movie is very well-paced and, more importantly, is not over-the-top in blood and guts. The acting is uniformly average(something a Friday the 13th films craves!). What really takes this film beyond the mundane; however, is the stylish twist at the film's end. This, almost all by itself, allows this film to rise in the ranks. The ending is deftly done and does not look foolish or silly or forced; all of these things could have easily happened. So if you are up for some slasher fun, want to see some nice looking girls(Deborah Foreman and Deborah Goodrich), and are intrigued by a creative ending - April Fool's Day is for you!",
         "April Fool's Day is really something special to me as a horror fan. In fact, most people I know have never even seen it or heard of it. But I have. And I love it. The casting is superb, delightful, and entertaining. The plot is mysterious, the acting is average, and jokes, accusations, and decapitations (real or not?) galore in this one-hour and twenty minute uninspired horror movie. There is even a scene in the end that unravels everything that you believed the movie to be in the first place. Amy Steel (from Friday The 13th 2) stars in this homage to crafty horror films, alongside the charming, sexy Deborah Foreman (Waxwork). It is really good to see at any time, and nothing about it should disappoint you. It is not your average horror movie. It's really more funnier than scary. April Fool's Day provided horror fans something a little more tasteful than was expected back in mid-80's. It's nice to have a mystery every now and then, and this movie will have you wondering what's up the sleeves of each character. True, it's not The Green Mile or The Shawshank Redemption, but it is truly underrated as a horror film. It's great. Nine stars.",
         "Here we have your usual assembly of would be slasher victims along with the spooky old house near the shore bit. But the noticable difference here is the amount of laughs injected into this that you dont see in 80s horror. And an ending never seen in any other typical slasher film. The cast is perfect; a wise cracking bunch constantly pulling gags on each other. Wilson (far from his \"Biff\" character he played in Back to the Future) is great, Foreman is spooky as the weirdo hostess, Baker as the stuck on himself southern guy, and Goodrich as the outspoken cutie, to name a few. Most have wavered about the ending; some say good, some say stupid, so just be prepared for something different.",
         "One of my favourite movies of all time. Saw it again last night for the umpteenth time last night (but on DVD for the first time)and it's still wonderful. Funny, scary and seriously smart - the \"twist\" is great and works well even on multiple viewings - there's no cheating here, it works well even when you know it and can see it coming. I love it to bits, and it's tremendous fun. Criminally underrated. The cast is terrific, especially Deborah Foreman, and it's the first thing other than the Back to the Future movies that I've seen Thomas F Wilson in! And he's funny and likable in it too. Gorehounds needn't bother, but if you like a good story and a good mystery you'll have a ball. It's quite possibly the only slasher movie that will appeal to people who hate slasher movies! I adore it.",
         "When a formula is worn out people tend to lose interest. If you use it without something new to say then why bother right? You could apply this to slasher films, many of which are cliché and predictable. There are some exceptions. If a film that's like so many others has talented people involved in front of and behind the camera then it might rise above that. Fortunately there are some filmmakers out there who don't want to lose their audience and try to keep things fresh and exciting with each project. After you've seen so many slasher films what else can they really do with the concept? By 1986 the number of these films made was overwhelming, but of course there were diamonds in the rough. Paramount, the home of the hit 'Friday the 13th' series is also responsible for a forgotten (Not by horror fans) film that would surprise those tired of the same old, same old. Pros: Performances are good all around. A good fresh spin on the slasher genre. Plus the writing is quite good. A great sense of humor. A nice job done on the score, which is eerie. Beautiful shooting location and photography. Some good creepy sequences. Fast paced. Director Fred Walton and writer Danilo Bach do a fine job of keeping this from getting too predictable. Some nice surprises I wouldn't dream of giving away. Cons: Some of the characters are not too likable and can be irritating. Most of the kills are off screen. Final thoughts: Truly a breath of fresh air for the slasher sub-genre. Don't get me wrong, there are plenty of 1980s slasher films I enjoy, good and bad, but so many lack anything new that hasn't already been seen in countless other films. A must see for genre buffs. I must warn you though, the 2008 remake is not at all worth seeing and will be no more than a waste of your time. My rating: 4.5/5",
         "This is one of those \"almost\" movies. April Fool's Day has a very likable cast, a good plot and wonderful setting what is doesn't have is a lot of suspense and scares. It looks like a lot of time was put into this film to make it a classy horror picture. Perhaps that's the reason that none of the kills are very interesting, while there is some gore the death scenes themselves seem to have been edited out. Perhaps this was due to the print used on the DVD, maybe there's a better version...I don't know. The ending itself may put off hardcore horror fans but I found it quite amusing and it helped to make the rest of the movie gel together and answers some questions/concerns I had about about the movies story. Overall April Fool's Day is quite enjoyable. The young cast is a lot of fun to watch and a few notches above other 80's horror fare, the story is original and the local, a secluded beach house is quite nice. However, it could have been much, much creepier! With more suspense and good scares April Fool's Day could have rated higher. April Fool's Day rates a 6 out of 10.",
         "- The basic plot of April Fool's Day is similar to many of the teen horror/slasher movies of the 1980s. For the most part, the story of the first three quarters of the movie isn't really anything special. A group of eight friends travel to the island estate of Muffy St. John (Deborah Foreman) to spend the weekend. Soon, the inevitable happens - people start disappearing and bodies start piling up. Of course, there's no way off the island, the phone isn't working, and Muffy is acting very weird. But, just when you think you've got things figured out, the big ending comes out of nowhere. - About the ending (and I'm not going to give it away) - from what I've read, it seems to be a love it or hate it proposition. There's not much middle ground. You will either feel cheated and want to throw your remote at the television or you will love it and appreciate it as something different. Put me in the love it category. I think it is a nice change of pace from the normal horror movie from the period. There are a few (very few) clues as to what's coming up, but it takes a repeat viewing to pick them up. - Most of the 80s teen horror movies have interchangeable characters - there is a nerd, a jock, a slut, a good girl, etc. And even though the characters in April Fool's Day can be put in these categories, they are not as exaggerated as you find in most similar movies. The writers should be given credit for at least attempting to write somewhat \"real\" characters. By no means do we get in depth characterizations, but these characters are more like people I actually knew in the 80s. - As usual, I do have a couple problems with the movie. The biggest complaint I have is the idea that the whole scheme could be pulled off without anyone knowing or discovering what was going on. That notion requires an extra large leap in any sort of known logic. And, I have a problem making a jump that large. - By the way, what ever happened to Deborah Foreman? After the 80s, she seems to have dropped off the planet."
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Hometown Films",
         "YCTM"
      ],
      "summaries": [
         "A group of eight college friends gather together at an island mansion belonging to heiress Muffy St. John to celebrate their final year of school. They soon discover that each has a hidden secret from their past which is revealed, and soon after, they turn up dead. Yet, are they really dead? Or is it just part of some very real and cruel April Fool's jokes? The hostess, Muffy, is the only one who apparently knows what's going on. But then again, is it really her doing the killing?",
         "A group of nine college students staying at a friend's remote island mansion begin to fall victim to an unseen murderer over the April Fool's day weekend."
      ],
      "budget": 5000000
   },
   "movielensId": 1330,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-03-27",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Fred Walton"],
      "runtime": 89,
      "movieId": 1330,
      "title": "April Fool's Day",
      "mpaa": "R",
      "actors": [
         "Deborah Foreman",
         "Thomas F. Wilson",
         "Lloyd Berry",
         "Tom Heaton",
         "Ken Olandt",
         "Leah Pinsent",
         "Clayton Rohner",
         "Amy Steel",
         "Jay Baker",
         "Pat Barlow",
         "Deborah Goodrich",
         "Mike Nomad",
         "Griffin O'Neal"
      ],
      "imdbMovieId": "0090655",
      "originalTitle": "April Fool's Day",
      "genres": [
         "Horror",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of eight college friends gather together at an island mansion belonging to heiress Muffy St. John to celebrate their final year of school. They soon discover that each has a hidden secret from their past which is revealed, and soon after, they turn up dead.",
      "tmdbMovieId": 24913,
      "avgRating": 2.82786,
      "releaseYear": "1986",
      "numRatings": 1005,
      "posterPath": "/FiDprIXcWbAPz4sB3vYjxSjHrU.jpg"
   }
}