{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "nightmare",
            "id": 3030
         },
         {
            "name": "stranger",
            "id": 156104
         }
      ],
      "imdb_id": "tt0075704",
      "video": false,
      "title": "Audrey Rose",
      "recommendations": [
         16154,
         19590,
         79319,
         13549,
         223389,
         58790,
         42114,
         25756,
         18216,
         32076,
         61418,
         33543,
         16180,
         16022,
         41587,
         32043,
         76177,
         49396,
         18696,
         66087
      ],
      "backdrop_path": "/ctkf5rK8spaAvwXX4GHg5sWOHcr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Elliot Hoover",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813abd9",
               "name": "Anthony Hopkins",
               "profile_path": "/btweZvSRBiE6jaMME93BSXeTQN6.jpg",
               "id": 4173,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Janice Templeton",
               "gender": 1,
               "credit_id": "52fe4787c3a36847f813abdd",
               "name": "Marsha Mason",
               "profile_path": "/1iTPM9ciKMFb5RzePlcKhfWO0Fb.jpg",
               "id": 19131,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bill Templeton",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813abe1",
               "name": "John Beck",
               "profile_path": "/chrv4q7zhxuv8esZLBpfSBMp3o5.jpg",
               "id": 41269,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ivy Templeton",
               "gender": 0,
               "credit_id": "52fe4787c3a36847f813abe5",
               "name": "Susan Swift",
               "profile_path": null,
               "id": 182515,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Scott Velle",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813abe9",
               "name": "John Hillerman",
               "profile_path": "/sZ44pzr7OJrdxGfsGjTMavFCW2K.jpg",
               "id": 12296,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Brice Mack",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813abed",
               "name": "Robert Walden",
               "profile_path": "/mHnGfHeA7wgC7McycPPqSlujJ87.jpg",
               "id": 13729,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Judge Langley",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813abf1",
               "name": "Philip Sterling",
               "profile_path": null,
               "id": 22437,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Russ Rothman",
               "gender": 0,
               "credit_id": "52fe4787c3a36847f813abf5",
               "name": "Stephen Pearlman",
               "profile_path": "/a1LcI65LvyKKi5UmaAc2PPihsQm.jpg",
               "id": 6438,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mary Lou Sides",
               "gender": 1,
               "credit_id": "52fe4787c3a36847f813abf9",
               "name": "Ivy Jones",
               "profile_path": null,
               "id": 142283,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Maharishi Gupta Pradesh",
               "gender": 0,
               "credit_id": "52fe4787c3a36847f813abfd",
               "name": "Aly Wassil",
               "profile_path": null,
               "id": 183871,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mother Veronica",
               "gender": 1,
               "credit_id": "52fe4787c3a36847f813ac01",
               "name": "Mary Jackson",
               "profile_path": "/rBi5WNywgvrEnEMegy1rfX25P38.jpg",
               "id": 84631,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Policeman 1",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813ac05",
               "name": "Richard Lawson",
               "profile_path": "/jwdLCnTAIHwub1IBdOUbFVxDa0L.jpg",
               "id": 10090,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Detective Fallon",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813ac09",
               "name": "Tony Brande",
               "profile_path": null,
               "id": 981520,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Policeman 2",
               "gender": 0,
               "credit_id": "52fe4787c3a36847f813ac0d",
               "name": "David Wilson",
               "profile_path": null,
               "id": 43152,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Reporter",
               "gender": 0,
               "credit_id": "53c983c6c3a368779000003d",
               "name": "Hanns Manship",
               "profile_path": null,
               "id": 1343370,
               "order": 14
            },
            {
               "cast_id": 29,
               "character": "Customer in Store (uncredited)",
               "gender": 2,
               "credit_id": "5a15214592514178c20091d9",
               "name": "Philip Ettington",
               "profile_path": null,
               "id": 1926100,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813abd5",
               "name": "Robert Wise",
               "profile_path": "/6EPkRgYsDMQOYmE9s1vZt2O470R.jpg",
               "id": 1744,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813ac19",
               "name": "Frank De Felitta",
               "profile_path": null,
               "id": 138764,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "56775444c3a368167a00788a",
               "name": "Joe Wizan",
               "profile_path": null,
               "id": 21024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56775434c3a368168500729e",
               "name": "Frank De Felitta",
               "profile_path": null,
               "id": 138764,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56775421c3a3681685007297",
               "name": "Frank De Felitta",
               "profile_path": null,
               "id": 138764,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56775451c3a368168b006cbb",
               "name": "Michael Small",
               "profile_path": null,
               "id": 6357,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5677546992514179db007264",
               "name": "Victor J. Kemper",
               "profile_path": null,
               "id": 14536,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56775478c3a368167c007346",
               "name": "Carl Kress",
               "profile_path": null,
               "id": 21821,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56775575c3a3681689006e01",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56775591c3a368168e00791b",
               "name": "Harry Horner",
               "profile_path": "/uzkVhjoc4WR3XVSFvnPmiRPVPJL.jpg",
               "id": 14878,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5677559d92514179e7007002",
               "name": "Jerry Wunderlich",
               "profile_path": null,
               "id": 12848,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "567755b0925141691a003888",
               "name": "Dorothy Jeakins",
               "profile_path": null,
               "id": 29800,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.017163,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49126,
      "vote_count": 46,
      "budget": 0,
      "overview": "A man is convinced that a young girl is the reincarnation of his own daughter Audrey Rose, who died in a fiery car accident, along with his wife, two minutes before the girl was born.",
      "similar": [
         1903,
         258230,
         281957,
         638,
         1586,
         12149,
         182560,
         2501,
         2503,
         75780,
         116,
         281,
         169917,
         381283,
         346685,
         346364,
         452507,
         340666,
         336843,
         10320
      ],
      "original_title": "Audrey Rose",
      "runtime": 113,
      "poster_path": "/aSleSJrBJ6hKA8HfVuF9mehuyTR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Sterobcar Productions",
         "id": 18038,
         "origin_country": ""
      }],
      "release_date": "1977-04-06",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Suddenly Their Lives Were Engulfed By Supernatural Terror!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Wise"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Frank De Felitta",
         "Frank De Felitta"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0075704/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQ0NDU3Njk2Ml5BMl5BanBnXkFtZTcwODk3MTE3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anthony Hopkins, Marsha Mason, John Beck | See full cast and crew »"],
      "reviews": [
         "I've recently seen this movie again after at least 15 years. The first time it scared me a lot, probably for the weird look in Ivy's eyes and the screaming scenes... Keep in mind that reincarnation was not a very common subject at the time, and I took it just as many other people, as a poor Exorcist copy. Now, knowing a lot more on the subject, I think it was not too bad given the time it was filmed. The hipnotic regression scene is well done, even though the ending probably can't happen in real life after a regression to a past life. It was great also watching a young Anthony Hopkins in such role. As always, he convinces you of what he is feeling, and the movie, not being excellent, keeps you interested. I gave it a 6, considering the good original screenplay (for 1977), and the performances of Anthony Hopkins and Marsha Mason. I must say she seems a little \"too dramatic\", but that was her style. If you like Anthony Hopkins and you want to watch a good old thriller, you must see \"Magic\" too.",
         "Audrey Rose is a very intelligent horror movie, but it is not as creepy as its original source - the novel by Frank De Felitta. On the acting front, Marsha Mason is both believable and sympathetic as the frantic mother, Janice Templeton. It's a shame that both Sir Anthony Hopkins and John Beck seem to have their minds on other matters, as if they were not enjoying being a part of this movie. Making a fantastic debut, Susan Swift is quite remarkable in the dual roles of Ivy Templeton and Audrey Rose Hoover. The climax, however, is more depressing than moving.",
         "I first saw this movie years ago when I was much younger. At the time, I thought it was great and very haunting. But now that I've seen it again as an adult, I can't believe I ever thought it was a good movie. The story itself is excellent, but the way it is presented is just plain awful. The worst thing about this movie is the constant hysterical screaming Ivy does. It goes on and on in so many scenes, it just gets to the point where you hope and pray she either dies or someone kills her just to stop the screaming. It just destroys the entire later half of the movie. The rest of the script is just horrible. It's just not done well. And the ending leaves you with a bad taste in your mouth. The basic story of a girl who was killed in a fire at a young age and then reincarnated into Ivy is a very good story. But as I said, it's not played out right here. The script and the acting just ruins it. Really the only reason to see this film is to watch a pre-Hannibal Lecter Anthony Hopkins in one of his early roles. Other than that, I can't really see a reason to recommend this movie.",
         "Robert Wise may have directed \"West Side Story\" and \"The Sound of Music.\" But he has done a fair share of horror films and thrillers, including \"The Curse of the Cat People,\" \"The Day The Earth Stood Still,\" but most notably, \"The Haunting.\" However, hardly anybody seems to remember a 1977 film called \"Audrey Rose.\" It is another film from the famed director that, in my eyes, is very memorable and atmospheric. Janice and Bill Templeton are leading a very happy marriage with their daughter, Ivy. The last thing they want is a strange man by the name of Elliot Hoover stalking them. Worst of all, he sets his eye on Ivy. Soon enough, they are able to talk to Hoover. He explains that his wife and daughter, Audrey Rose, died in a horrible car accident, and that his daughter may have crossed over into Ivy. Of course, Janice and Bill dismiss Hoover as a lunatic. But that's when Ivy begins to exhibit strange behavior. Could Hoover be correct? Is Ivy really the reincarnation of Audrey Rose? Now, when \"Audrey Rose\" first came out in 1977, it was subject to mixed reviews, mostly because it was seen as a horror film, and I can understand why. It was released a few years after \"The Exorcist,\" when horror films were becoming more modern and faith was being challenged. But I don't see \"Audrey Rose\" as a horror film. Instead, I perceive it as a supernatural thriller with a touch of family drama. And it's a very good one. Based on the novel by Frank De Felitta, creator of \"The Entity\" and director of \"Dark Night of the Scarecrow,\" \"Audrey Rose\" is a nifty thriller for three reasons. First, Robert Wise gives superb direction. He registers the exact amount of passion that he had for \"The Haunting\" and he has chosen an effective story that challenges the beliefs of the viewer. Do we choose to believe Hoover in that his daughter has come back in the form of Ivy? Or is Ivy simply an ill child in need of psychiatric help? It is a great story. Second, the acting is quite good. Anthony Hopkins and John Beck give very nice performances as Hoover and Bill. The wide-eyed newcomer Susan Swift is especially believable in the scenes in which Ivy shows off the nightmarish behavior of Hoover's dead daughter. But I, and many other people who have seen the movie, feel that the greatest performance belongs to Marsha Mason, star of \"The Goodbye Girl,\" as Janice. Once Audrey Rose takes over Ivy, Janice's fear of losing her daughter shows and Mason's acting intensifies as the movie goes on. Third, the film has a tremendous atmosphere. The scenes of rain pattering on the windows as Ivy screams for her daddy are incredibly creepy, and so are the scenes at Ivy's school and inside the banal hospital. There are plenty of movies about possession and bad seeds, but a reincarnation thriller is very uncommon. \"Audrey Rose\" may be a little long, but it is a super-effective supernatural thriller that is very creepy. It will leave you with questions, and raise ideas about reincarnation. Robert Wise has given us a thriller to remember.",
         "\"Audrey Rose\" is a strange little tale of reincarnation. The story centers around a Janice (Marsha Mason) and Bill (John Beck) Templeton, a New York city couple who have a wonderful daughter named Ivy. Their lives are fairly normal, that is until a stranger (Anthony Hopkins) begins to stalk Ivy, claiming that within her body is the reincarnated spirit of his daughter, Audrey Rose, who burned to death in a horrible car accident. Of course, the Templetons think this stranger, named Elliot, is a madman. But when Ivy begins having horrible nightmares, running through her room, and banging on her bedroom window with her fists, they begin to wonder if Elliot's claims may just be true... From the director of the horror classic, \"The Haunting\", Robert Wise, comes this bizarre but spooky little tale of reincarnation. The story is based on Frank DeFelitta's novel of the same name, and the plot is interesting. Reincarnation was a topic that hadn't really been addressed at the time, but while this film is constructed all around the basic idea of reincarnation, many people have mistaken it for some sort of \"Exorcist\" rip-off, mainly because of the fact that it displays horrible events plaguing a young girl. It's an intelligent premise and a well-written plot, but the problem with the film is that it is quite plodding and almost too slow for it's own good. Don't get me wrong, I don't have a problem with slow-going stories, but I think most people can agree that the pacing here is a little tedious at times. On the plus side, there are some genuinely frightening hysteria sequences involving the young Ivy, along with the awful car crash death in the beginning that is the basis of the film. As far as the acting goes, it was all good - some of the hysteria scenes were obviously overacted, but aside from that it wasn't bad. Marsha Mason conveys a very emotional, frantic mother, while John Beck isn't given much to work with. The brilliant Anthony Hopkins plays Elliot (in one of his earlier roles, before \"The Silence Of The Lambs\" fame that he earned later in his career) quite well, which isn't surprising because he's always good. And Susan Swift (who much later appeared in a \"Halloween\" sequel), plays the tormented Ivy. I'm surprised we didn't see more of her as an actress, she seems to have had the potential. To sum things up, \"Audrey Rose\" is a decent horror movie. The storyline is excellent, but unfortunately the pacing here breaks a lot of tension. On the plus side, there are some frightening scenes and a few memorable sequences, plus the story is intelligent and original. While it's a decent horror movie, it's not the kind of movie you can sit down and watch if you're in a tired mood, because it will likely bore you. Go into it with an open mind, but don't expect anything in terms of \"The Haunting\" or Wise's other films. 6/10.",
         "\"Audrey Rose\" was bound to fail:coming three years after the exorcist farce and all its imitators ,it stood no chance at all. You should not forget that Robert Wise tackled the paranormal ten years before William Friedkin' s masquerade ,and with highly superior results :\"the haunting\" (1963).Roughly ,the stories display strong analogies \"Her soul is in peace now\" says Hopkins at the end of \"Audrey Rose\" whereas Richard Johnson told his companions that now Eleanor (Julie Harris) had found peace at last.No matter if \"the haunting\" is primarily a non-religious film and \"Audrey Rose\" deals with a religion 700 million human beings put their faith in:both the shrink in \"Audrey\" and doctor Markway in \"haunting\" try a scientific approach;both movies include a skeptical character:Russ Tamblyn's Luke and John Beck's bewildered father ,and in the end ,these two men begin to realize that something eludes them ,something which is beyond Cartesianism. The main difference between \"Audrey Rose\" and \"the haunting\" lies in directing:whereas the latter's was prodigious ,innovating almost at every scene ,carrying its audience in another world ,allowing them to experiment themselves,the former relies upon clichés -and it's when you see these scenes of Audrey screaming that you realize the bad influence \"the exorcist \" had on the fantasy and horror genre - and nothing in the shooting of the NYC ancient building -if at least he had borrowed from Polanski's \"Rosemary's baby'- recalls the eerie pictures of the Gothic castle where Eleanor and her mates wandered. Emotion was intense in \"the haunting\";here only Anthony Hopkins is able to generate desperate hope,tenderness and faith.Hopkins was interested in the fantastic genre at the time,for he made \"magic\" two years after and \"elephant man\" -which was realistic but was given a fantasy treatment- which boosted his career as none of his other movies did before. \"Audrey Rose\" came at the wrong moment .In spite of its flaws,it deserves a watch .It's Wise's legacy (Unless \"star trek \" counts).",
         "A husband and wife (John Beck, Marsha Mason) have a loving 12 year old girl (Susan Swift). However she keeps having strange nightmares that won't stop. They are visited by a strange man (Anthony Hopkins) who tells them the spirit of of his dead daughter Audrey lives in their little girl. The book of this came out in the mid 1970s. It was a huge hit and sparked off an interest in reincarnation. It was a long (over 400 or 500 pages) but engrossing read. For some reason Hollywood took its sweet time making this. By the time this was released there was no interest and this film failed almost immediately. Many people said it was made and released too late. To be honest though, this film isn't very good at all. The film is well-directed by Robert Wise and it looks fantastic (the Templeton's apartment alone is jaw-dropping) but there are numerous things wrong here. The script is simply dull. It's all talk talk talk--just saying the same things over and over again. This movie moves very slowly. The acting doesn't help. Beck is dull and lifeless. Swift isn't good either but her role WAS difficult and she was only 13. Even Hopkins (a GREAT actor) is terrible. His reaction to seeing Ivy running around screaming as Audrey was just so bad! Only Mason (a very underrated actress) gives a very good credible performance. Basically the film is too long, unfocused and dull. Mason's good performance can't save this. This still remains an unknown film for good reason! Read the book instead.",
         "In New York, Janice Templeton (Marsha Mason) is happily married with the executive Bill Templeton (John Beck) and they live in a comfortable and fancy apartment with their eleven year-old daughter Ivy (Susan Swift). One day, Janice is stalked by a weirdo and she tells her husband. Soon the stranger contacts them and invites the couple to meet him in a restaurant. Elliot Hoover (Anthony Hopkins) tells to Janice and Bill that his daughter Audrey Rose died eleven years ago burned in a car crash and her soul would have reincarnated in Ivy's body. Bill and Janice believe that Elliot is nuts and Bill tells his lawyer to get a restraining order against Elliot. However, Ivy has dreadful nightmares and only Elliot is capable to calm her down. When Elliot abducts Ivy, Bill and Janice go to the court to arrest him. But Elliot wants to prove that Ivy and Audrey Rose are the same soul. When I saw \"Audrey Rose\" in the 70's, I found it a great film of reincarnation. I have just seen it again on DVD and this time I found it a reasonable film only with a flawed screenplay. Maybe the film is dated, with the present behavior of people. The unstable Janice Templeton, performed by Marsha Mason, is an inconsistent and irritating character. Her attitudes are ridiculous and she never supports her husband, even in court when she is summoned to testify. My vote is six. Title (Brazil): \"As Duas Vidas de Audrey Rose\" (\"The Two Lives of Audrey Rose\")",
         "As in most of Marsha Mason's films, she is the entire emotional center. Her writers and directors rarely developed the male characters around her beyond sticks of wood and the actors playing them (with a few notable exceptions) did not attempt to leaf out. Here she gives a terrific performance as a mother whose child may or may not be the reincarnation of a soul lost in a tragic accident. John Beck as her husband has one emotion, barely concealed rage, and even the young Anthony Hopkins registers only one - benevolent concern. Miss Mason's face registers every nuance of intelligence and feeling within the character. She excels in a very long sequence in the middle of the film where her daughter runs amok, is finally calmed by Hopkins' character, is followed by an emotional interaction between Hopkins and herself and ends with her violent railing at her husband's disbelief and ineffectiveness. This is built so carefully that despite the numerous takes it must have occasioned she is never out of sync with the slow registering of terror/confusion/slow belief in the truth of the reincarnation theory. It should be removed and presented to acting classes. Here she undergoes trauma - physical, emotional and spiritual - and all the while she is thinking, processing, feeling - and we think and feel with her. The plot and the film itself are not outstanding and the resolution is a let down, but it's Miss Mason who holds the film together and makes it a memorable experience.",
         "\"Interesting\" seems a necessary component of entertainment, and after the first 15 minutes AUDREY ROSE fails to meet even this basic criterion. Robert Wise is capable of good stuff: there's not much wrong with BLOOD ON THE MOON, or DAY THE EARTH STOOD STILL, or SOUND OF MUSIC, but he is sometimes the most boring filmmaker who ever lived. STAR TREK THE MOVIE is some kind of historic low-water mark, and there are many others. This is one. This movie would be depressing if it were good enough to inspire any emotion - a girl dies tragically, then her soul is reincarnated in another girl, who, uh, dies tragically. Fortunately or unfortunately as the case may be, instead it simply sucks. The premise is compelling, and there is good acting here, but Frank De Felitta's script fails to explore any of his story's potential value, and ignores its many inherent contradictions. If \"the soul is free\", as his hodge-podge of Eastern mysticism purports, why does Ivy suffer death due to Audrey's trauma? Her soul didn't look any too free when it was thrashing around on fire, trapped in nightmares of its previous incarnation's demise, drawing Ivy to the same doom. What good, then, does Hoover do when he calms his daughter's soul-descendant in her panic? Does she recognize him as Daddy? Do I care? Not much, but apparently more than De Felitta and Wise did. Rather than consider any of these questions, Wise and his scribe prefer to linger for leaden minutes on the minutiae of police, medical and legal procedure. This stuff is supposed to be creepy, a banality of horror-type thing, but it's merely frustrating. Sure, those elements worked in EXORCIST: but there was a movie behind them. Anthony Hopkins is a dependable manic, and Marsha Mason, even when married to John \"a jaw is a fine substitute for a talent\" Beck, is a credible and sympathetic performer. Susan Swift alternates between outrageously good and howlingly awful in her turn as the fatal juvenile. None of these fine people is able to salvage whatever usefulness there may have been in the bestseller, and concurrent decade-long national obsession with the paranormal, that gave AUDREY ROSE life."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Sterobcar Productions"],
      "summaries": [
         "In New York, Janice Templeton is happily married with the executive Bill Templeton and they live in a comfortable and fancy apartment with their eleven year-old daughter Ivy. One day, Janice is stalked by a weirdo and she tells her husband. Soon the stranger contacts them and invites the couple to meet him in a restaurant. Elliot Hoover tells to Janice and Bill that his daughter Audrey Rose died eleven years ago burned in a car crash and her soul would have reincarnated in Ivy's body. Bill and Janice believe that Elliot is nuts and Bill tells his lawyer to get a restraining order against Elliot. However, Ivy has dreadful nightmares and only Elliot is capable to calm her down. When Elliot abducts Ivy, Bill and Janice go to the court to arrest him. But Elliot wants to prove that Ivy and Audrey Rose are the same soul.",
         "A New York couple experience bizarre, stalker-like behavior from an English stranger. While they attempt to bar him from their lives, he slides his way in anyway and tries to convince them that their 11-year-old girl is the reincarnation of his 11-years-departed daughter, Audrey Rose.",
         "A stranger attempts to convince a happily married couple that their daughter is actually his daughter reincarnated."
      ],
      "budget": 0
   },
   "movielensId": 1331,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-04-06",
      "dvdReleaseDate": "2001-08-28",
      "directors": ["Robert Wise"],
      "runtime": 113,
      "movieId": 1331,
      "title": "Audrey Rose",
      "mpaa": "PG",
      "actors": [
         "Anthony Hopkins",
         "Marsha Mason",
         "John Beck",
         "Susan Swift",
         "John Hillerman",
         "Robert Walden",
         "Philip Sterling",
         "Stephen Pearlman",
         "Ivy Jones",
         "Aly Wassil",
         "Mary Jackson",
         "Richard Lawson",
         "Tony Brande",
         "David Wilson",
         "Hanns Manship",
         "Philip Ettington"
      ],
      "imdbMovieId": "0075704",
      "originalTitle": "Audrey Rose",
      "genres": [
         "Fantasy",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "VA472APep1k",
         "o_PuWxHxUHM"
      ],
      "plotSummary": "A man is convinced that a young girl is the reincarnation of his own daughter Audrey Rose, who died in a fiery car accident, along with his wife, two minutes before the girl was born.",
      "tmdbMovieId": 49126,
      "avgRating": 2.91279,
      "releaseYear": "1977",
      "numRatings": 430,
      "posterPath": "/aSleSJrBJ6hKA8HfVuF9mehuyTR.jpg"
   }
}