{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "gun",
            "id": 1419
         },
         {
            "name": "voodoo",
            "id": 3392
         },
         {
            "name": "barn",
            "id": 3875
         },
         {
            "name": "ritual",
            "id": 4720
         },
         {
            "name": "cult",
            "id": 6158
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "ritual murder",
            "id": 156593
         }
      ],
      "imdb_id": "tt0092632",
      "video": false,
      "title": "The Believers",
      "recommendations": [
         42114,
         41587,
         19158,
         60631,
         33592,
         49126,
         16471,
         44932,
         26626,
         466320,
         42487,
         100671,
         5898,
         31909,
         36778,
         26680,
         10179,
         18196,
         61418,
         78529
      ],
      "backdrop_path": "/1PWNiGTHYfWEUzFAqjwHuxT7QB.jpg",
      "revenue": 18753438,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Cal Jamison",
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a883",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jessica Halliday",
               "gender": 1,
               "credit_id": "52fe44b89251416c9101a887",
               "name": "Helen Shaver",
               "profile_path": "/7DlGkBDdRcKPlPAXuoo6xz6hSAU.jpg",
               "id": 4160,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chris Jamison",
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a88b",
               "name": "Harley Cross",
               "profile_path": "/ho11xBDWXeJP6ub4b4e7XmYx9dL.jpg",
               "id": 35547,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lt. Sean McTaggert",
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a88f",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kate Maslow",
               "gender": 0,
               "credit_id": "52fe44b89251416c9101a893",
               "name": "Elizabeth Wilson",
               "profile_path": "/p3i4swng6y0s31ktDXMrwjvejM0.jpg",
               "id": 10776,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Robert Calder",
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a897",
               "name": "Harris Yulin",
               "profile_path": "/MCW4IR3mEB6oeRbX9bfeHkZ3qm.jpg",
               "id": 1166,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dennis Maslow",
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a89b",
               "name": "Lee Richardson",
               "profile_path": "/yqJMNzrKEwLIGnHky1DZZ9Gj4jw.jpg",
               "id": 21283,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marty Wertheimer",
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a89f",
               "name": "Richard Masur",
               "profile_path": "/w8qQdmxLRRSXNXkjHKHlY5vawXG.jpg",
               "id": 15416,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Carmen Ruiz",
               "gender": 0,
               "credit_id": "52fe44b89251416c9101a8a3",
               "name": "Carla Pinza",
               "profile_path": "/vhhlqPGabvFWjijo5ZVAvuXUkQf.jpg",
               "id": 124751,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Tom Lopez",
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a8a7",
               "name": "Jimmy Smits",
               "profile_path": "/yIcr7NKpvkQPi2Js5SyISvOKys1.jpg",
               "id": 33181,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Palo",
               "gender": 2,
               "credit_id": "59ce679d9251416c82019b86",
               "name": "Malick Bowens",
               "profile_path": "/2JoeNLcdksIqRu9yONkIQEr28Hr.jpg",
               "id": 10649,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Lisa Jamison",
               "gender": 1,
               "credit_id": "59ce67b0c3a3686aca018c45",
               "name": "Janet-Laine Green",
               "profile_path": "/yaY9XfagFurBIYRIzJj4YucYYLB.jpg",
               "id": 70441,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Oscar Sezine",
               "gender": 2,
               "credit_id": "59ce6824c3a3686a7e018029",
               "name": "Raúl Dávila",
               "profile_path": "/kVBVh4zQ3FFzrDOoJPXNwYK85KQ.jpg",
               "id": 1365573,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Calder's Assistant",
               "gender": 1,
               "credit_id": "59ce6860c3a3686aca018d95",
               "name": "Jennifer Lee Pryor",
               "profile_path": "/eL9JXnOj4910LQGveWajY1E9b0G.jpg",
               "id": 1114286,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a87f",
               "name": "John Schlesinger",
               "profile_path": "/vFCJ4RxvHysxeiwcFsiSGg7Tgre.jpg",
               "id": 19304,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a8ad",
               "name": "Mark Frost",
               "profile_path": "/paBsASDx2Qap4i51HIm9tycpgBW.jpg",
               "id": 58837,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b89251416c9101a8b3",
               "name": "Nicholas Conde",
               "profile_path": null,
               "id": 127017,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a8b9",
               "name": "J. Peter Robinson",
               "profile_path": null,
               "id": 28156,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a8bf",
               "name": "Robby Müller",
               "profile_path": "/d9Fz3vBIBBYUXYbPTIxo2FwYGSL.jpg",
               "id": 1632,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a8c5",
               "name": "Peter Honess",
               "profile_path": null,
               "id": 6875,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c9101a8cb",
               "name": "John Schlesinger",
               "profile_path": "/vFCJ4RxvHysxeiwcFsiSGg7Tgre.jpg",
               "id": 19304,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.35616,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32076,
      "vote_count": 48,
      "budget": 0,
      "overview": "Mourning the accidental death of his wife and having just moved to New York with his young son, laconic police psychologist Cal Jamison (Martin Sheen) is reluctantly drawn into a series of grisly, ritualistic murders involving the immolation of two youths.",
      "similar": [
         10585,
         341006,
         56906,
         395834,
         238636,
         74997,
         10029,
         10651,
         205,
         2749,
         1427,
         4771,
         769,
         588,
         431,
         4141,
         101,
         281,
         201085,
         948
      ],
      "original_title": "The Believers",
      "runtime": 114,
      "poster_path": "/wMDOgjHoDdKKj3UNZzjP8AW0wxR.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
            "name": "Orion Pictures",
            "id": 41,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Orion Pictures Corporation",
            "id": 14150,
            "origin_country": ""
         }
      ],
      "release_date": "1987-06-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Nothing can stop them, no one can help you. They know who you are.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Schlesinger"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Mark Frost",
         "Nicholas Conde"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092632/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyNjAzNTMyNF5BMl5BanBnXkFtZTcwMTIyNDcyNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Martin Sheen, Helen Shaver, Harley Cross | See full cast and crew »"],
      "reviews": [
         "After his wife dies, police psychiatrist Cal Jamison (Martin Sheen) moves with his son, Chris (Harley Cross), from Minnesota to New York City. There, he quickly becomes embroiled in a bizarre string of occult-related murders of children and apparent suicides of adults. If you enjoyed The Serpent And The Rainbow (1988), Angel Heart (1987) and Rosemary's Baby (1968), there's a good chance you'll enjoy The Believers as well, as it bears quite a few similarities (although it's certainly not a rip-off). In my view, it's not quite as good as those other three films, which are all 10s in my book, but it is well worth watching. The principle flaw, which probably arises from trying to condense a novel--in this case Nicholas Conde's book, The Religion--into a screenplay, is that The Believers quickly brushes over some developments so that it's occasionally difficult to follow, especially towards the beginning. We can sense that there's much more to the story but that there just isn't time to show all of it to us. However, a characteristic of the subgenre of occult/voodoo horror films is a prominent surrealism and dream-like narrative flow, so what might be more of a flaw in another kind of film can be more of an asset here. The Believers also benefits from a great cast--Sheen is a delight to watch (and listen to) as a psychiatrist who can fly off the handle in rage at the drop of a hat, and Jimmy Smits is wonderfully insane every time we see him. The Believers is also worth checking out for its cinematography and set design. The set for the climax is a visual treat and integral to the plot. And the tag scene after the climax is remarkable for its visual change--beautiful, wide-open spaces and bright colors. It's just too bad that the sequel set up by director John Schlesinger never came to fruition.",
         "Title: The Believers (1987) Director: John Schlesinger Cast: Martin Sheen, Jimmy Smitts, Robert Loggia Review: I've always been intrigued by movies about Voodo, Santeria and Witchcraft. I could go on and on about how part of my early childhood was spent in that religion and what not. But I'm not going to. Its something I like to leave safely tucked away in my past. Anyhows, this film, The Believers, depicts a couple of Santeria/Voodoo rituals that felt very, very genuine. I always keep a keen eye open to see just how truthful films can get...to see if the filmmakers did their homework right or not. Well, in the case of The Believers Id say they did their homework alright and got a straight freaking A man. The Believers is about a police psychologist called Cal Jamison (Martin Sheen). He is trying to cope with his wives recent death and trying to continue on with a normal life. When he suddenly realizes that his son has been targeted by practitioners of \"Brujeria\" or witchcraft. They need his son to perform one of their rituals. Of course he opposes and goes on a terrifying journey to try and stop them. What I found chilling about this film is its faithfulness to the whole Santeria thing. Having a background in this I could tell what was real and what was Hollywood Hocus Pocus bullshit, and let me tell you 90% of this film was highly accurate as to some of the rituals. Heres the thing about this type of movie. It can very easily turn into an unrealistic film that simply exploits the religion and uses its mythology to scare people who know nothing about it. But in the case of The Believers, they made a very good effort to demonstrate that Santeria is just another religion. Its people who believe in different things that the rest of the world don't believe in. And it doesn't have to be evil simply because its different. Of course, like everything, there's a dark side to the whole thing and in this movie its called \"Brujeria\" or Witchcraft. As it is explained in the film, its a form of Voodoo that is used for evil purposes and that its rituals involve amongst other things the sacrifice of children. The people in the film at first think that the ones committing the murders are people who belong to Santeria...when in fact they don't. So I liked the fact that the movie didn't stoop to the low point of exploiting the beliefs of people who practice Santeria. The movie is frightening, because it feels real. These religions and the people who believe in them are out there. They exist. And the ignorance about their beliefs instantly translates to fear amongst people who know nothing about it. Of course the movie does take advantage of peoples ignorance about it and uses it to make people think one thing...when in fact its another. But I have say, the movie will prove to be quite frightening. It has some genuinely tense moments in there. Jimmy Smitts, an unknown at the time, steals the show as Tom Lopez. A local who is frightened that \"they\" will get him. \"They\" know who he is and \"You don't know what they can do!\" Those sequences with Smitts going loco are excellent and will heighten any bit of fear that was already crawling up through the back of your spine. Also there's an evil Priest character played by Malik Bowens that is 100% concentrated evil. A memorable scene involves his eyes changing color and starting to dance as he is possessed by a spirit. So you can rest assured that we get some good solid performances in this flick. In conclusion I'll say that this movie is scary in the same way that The Exorcist was scary. In the same way that Angel Heart and Serpent and the Rainbow were scary. Its all tied up to something that exists in real life. Of course the film, as is the case in almost all of these films dealing with Voodoo or Santeria, ventures into fantasy territory. But Ill say this, The Believers is the one that feels the most genuine out of all the movies dealing with this subject matter. So its worth a look see. Only if you want to be really scared of course. Rating: 5 out of 5",
         "Back when this hit theaters, I missed it for some reason - I think the ad campaign left me rather nonplussed. In any case, I gave it a miss, only to take the chance on it some years later on video. And I have to say I was impressed! This is NOT a movie for the impatient viewer. Opening with family tragedy, it then takes necessary time to introduce its characters, really introduce them and give the audience time to get to know them and care about them. During the \"character study\" portion, there are only rare implications that something sinister is in the offing. Other reviews have stated that the movie is slow, that it drags, that it's padded out with perhaps unnecessary exposition, but I must disagree - to believe THE BELIEVERS, one must \"believe\" a bit oneself. A film that drops the viewer into a breakneck chase from the outset has its place and its advantages in storytelling, but almost invariably such movies are about the chase, rather than the people. THE BELIEVERS is about the people, which separates it from the typical batch of \"supernatural thrillers\". Here we get the whole story, rather than a sort of synopsis, wherein we get only the \"high points\", those scenes which contain the most action or gore or both. TOTAL RECALL is an excellent example of this type of film, done well; one need only look at any of the horror/slasher franchise films to have an idea of this type of film done at a dead run, for money and the most shock value. They can be fun, but I'm not sure they qualify as art. What makes THE BELIEVERS so disturbing is that, at its best, it *builds belief* in the audience. This might seem redundant, since, going in, we demonstrate a willingness to believe that is initially missing from the main charter(s); but in this case, we no longer have the emotional distance to simply watch and say, \"Oh, I saw that coming,\" or \"Blah - never in a million years.\" By the time Helen Shaver goes through her ordeal with that unsightly blemish, nothing about it seems far-fetched at all! Performances are, generally, successful. Young Harley Cross is excellent as young Chris, and the rest of the cast is populated with familiar faces or faces that were destined to become very familiar indeed, such as Jimmy Smits. My sole complaint comes from certain scenes with Martin Sheen - emotionally, he goes from conversation to screaming in an instant, and it just doesn't seem appropriate to the scene, especially when one considers that he's playing a psychiatrist - a professional group who are specifically trained in keeping their cool in the heat of a situation. Some of the dialog, too, occasionally comes out sounding like they shot the rehearsal. THE BELIEVERS is not without flaw - nevertheless, enough good remains that it rewards the patient viewer with a rich storytelling experience!",
         "Widowed police psychiatrist (Martin Sheen) and his young son (Harley Cross) move to NYC and get involved with a cult that believes in human sacrifices--small children especially. Exceptionally well-made, deadly serious horror film is not for everybody. It's way too long, has some very disturbing scenes (quick closeups of a dead child's mutilated body; animal sacrifice) and it's serious tone can wear one down. Still, it's a complex, one of a kind horror film. Name all the major studio films that deal with cults, voodoo and children sacrifices--there aren't any! It's surprising this even got made. Sheen is very good as the father, Cross is exceptional as his son. Also Robert Loggia turns in strong support as a police chief. The only bad acting is by Helen Shaver as a landlady who Sheen falls for (for some reason). Also there's a pretty needless ending. All in all though, a good horror film, but remember--it's STRONG stuff!",
         "\"The Believers\", a 1987 film, directed by John Schlessinger, an unlikely candidate, offers an action packed movie that involves the rites of santeria and African witchcraft in the middle of Manhattan. The film, which is based on a novel by Nicholas Conde, which we never read, was adapted by Mark Frost, who shows an incredible affinity for the material that might seem foreign to most of the viewers. The action never lets up; the movie is one of the scariest movies in recent memory. Much has been said about the plot and what is at the center of the story. What Mr. Schlessinger got was an amazing film that takes us into unknown territory into an evil world that is hard to imagine in such an urban setting. Cal Jamison, after suffering the terrible loss of his wife, takes Chris, his young son, into Manhattan, where the young boy is the target of an occult force that wants to harm him from unknown reasons that aren't well understood until the last sequences of the movie. We watch, horrified, how these evil practices contribute to unnerve the skeptical Cal, who must come to terms with it when it becomes clear that he and the young boy are more involved in what the higher ups of the cult want from them. Martin Sheen's work in the movie as Cal Jamison, is one of the best things he did in his distinguished career. His Cal is totally credible as we know how he will react when Chris is in danger. Helen Shaver is fine as Jessica, the woman that steals Cal's heart. Young Harley Cross is perfectly sweet as Chris. Veteran actors Robert Loggia, Richard Mazur, Jimmy Smits, Elizabeth Wilson, Lee Richardson, and Harris Yulin are seen in the film. We would recommend to watch this film with company. It's not for the faint hearted.",
         "Scary, good thriller about a dangerous faction of Santeria, a Latin-American based religion which believes in animal sacrifice, which here is offerring children as sacrifices in New York. Martin Sheen is very good as a police psychologist who moves to New York with his son after his wife's bizarre death, and must deal with the very strange doings occuring around him. The fine cast includes a younger Jimmy Smits, Robert Loggia, Helen Shaver, and Harley Cross. Director John Schlesinger provides good shocks, and good the movie has a fine late 80's New York feel, even though most of it was filmed in Toronto!",
         "Martin Sheen is in top form in this one and I don't know why it isn't considered one of the better horror movies. I was a kid when I saw this so it had a better effect on me then but I recently saw it on cable and really dug it. Also recommended is the classic Serpent and the Rainbow.",
         "Covering the subject of cults, religion, Santeria or other beliefs is always intriguing and educational. The acting especially by Martin Sheen as N.Y. psychiatrist Cal, is very good. Cal loses his wife in a tragic accident, and returns to New York City where he is a psychiatric consultant for N.Y.P.D. There are some excellent scenes with Jimmy Smits, as an affected officer who goes mad, and Robert Loggia, as a veteran cop who is also affected by the \"Believers\", and their group. Harris Yulin is menacing and fits the bill as leader of an 80's group, ostensibly just a charity group, until Sheen uncovers something much worse. The end is rather abrupt and predictable, but the acting is first-rate (especially for Sheen) and this is worth a viewing. The theme alone has many possibilities, the ignorance and unawareness of how many different religions actually exist, and are in practice all over the world. 9/10.",
         "John Schlesinger was best known for movies like \"Darling\", \"Midnight Cowboy\", \"Sunday Bloody Sunday\", \"The Day of the Locust\" and \"Marathon Man\". But now he directs something totally different. To understand what happens in \"The Believers\", it helps to have foreknowledge of Santería, a syncretic religion practiced widely in the Caribbean. It is based in the Yoruba culture (in present-day Nigeria), but includes influences from Roman Catholicism and the indigenous American cultures. The movie depicts a satanic offshoot of Santería mixed with brujería (Spanish for \"witchcraft\"), that is sacrificing children in New York, and is now targeting the son of Martin Sheen's character. If you expect a slasher movie, this is nothing of the sort. There is some violence, but no guts getting torn out or anything -- only one scene can truly get called shocking (you'll know it when you see it) -- and there's limited sex/nudity. I'd say that the movie's strength is its depiction of how Sheen's character slowly but surely learns about a culture with which he was previously unfamiliar. The movie does make clear that the religious cult is not Santería, but a different group. After all, every religion is bound to have its wackos. Does the movie have any downsides? Well, Robert Loggia's cop came across as a little silly, but I'd call that the only true downside. Otherwise, this is a good one. Also starring Helen Shaver, Richard Masur, Jimmy Smits and Harris Yulin (who I at first mistook for Richard Jenkins, aka Nate Sr. on \"Six Feet Under\").",
         "A good director John Schlesinger (\"Midnight cowboy\" , \"Marathon man\") plus good actor Martin Sheen (\"Apocalypse now\") plus interesting subject - voo doo. This is one promising combination , isn't it ? Unfortunately the ending result is rather bad. Martin Sheen gives a good performance. The movie does give you a some knowledge about voo doo. There are some nice thrilling scenes (the beginning , the ending , the scene with the snakes and the scene with the bees). Those are the good things in this movie. The movie isn't unfortunately scary . It isn't horrifying enough just to insert images of bloody headless chicken corpses and African tribes performing silly dance rituals. The movie can't decide if it wants to have supernatural elements in it or to be a thriller. \"The believers\" is also too long and have too many sub plots. There is also too much soap opera in a movie that should be scary and dark. There is no tension or atmosphere and aside from Sheen the acting isn't anything special. The dialogues are forgettable and the screenplay is rather bad convoluted. Alan Parker's \"Harry Angel\" is far superior to \"The Believers\". It's dark , scary , has good performances and interesting story. \"The Believers\" is not a complete waste of time , however it is overlong, slightly pretentious with a flat detective story. There are some good elements here , however it is a disappointment. I give it 4/10."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Orion Pictures"],
      "summaries": [
         "After the death of his wife, police psychiatrist Cal Jamison moves to New York. There he has to help in the investigation of the murder of two youths, who seem to have been immolated during a cult ritual. Jamison believes it's been Voodoo and, ignoring the warnings of his housekeeper, enters the scenery and soon gets under their influence. They try to get him to sacrifice his own son.",
         "A New York psychiatrist finds that a voodoo cult, which believes in child sacrifice, has a keen interest in his own son."
      ],
      "budget": 0
   },
   "movielensId": 1332,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1987-06-09",
      "dvdReleaseDate": "2002-08-27",
      "directors": ["John Schlesinger"],
      "runtime": 114,
      "movieId": 1332,
      "title": "The Believers",
      "mpaa": "R",
      "actors": [
         "Martin Sheen",
         "Helen Shaver",
         "Harley Cross",
         "Robert Loggia",
         "Elizabeth Wilson",
         "Harris Yulin",
         "Lee Richardson",
         "Richard Masur",
         "Carla Pinza",
         "Jimmy Smits",
         "Malick Bowens",
         "Janet-Laine Green",
         "Raúl Dávila",
         "Jennifer Lee Pryor"
      ],
      "imdbMovieId": "0092632",
      "originalTitle": "The Believers",
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["bEtUaQVjMkc"],
      "plotSummary": "Mourning the accidental death of his wife and having just moved to New York with his young son, laconic police psychologist Cal Jamison (Martin Sheen) is reluctantly drawn into a series of grisly, ritualistic murders involving the immolation of two youths.",
      "tmdbMovieId": 32076,
      "avgRating": 3.00196,
      "releaseYear": "1987",
      "numRatings": 765,
      "posterPath": "/wMDOgjHoDdKKj3UNZzjP8AW0wxR.jpg"
   }
}