{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "medical profession",
            "id": 40244
         },
         {
            "name": "medical student",
            "id": 187675
         },
         {
            "name": "body snatching",
            "id": 218105
         },
         {
            "name": "burking",
            "id": 239416
         },
         {
            "name": "medical education",
            "id": 239419
         },
         {
            "name": "child in distress",
            "id": 239420
         }
      ],
      "imdb_id": "tt0037549",
      "video": false,
      "title": "The Body Snatcher",
      "recommendations": [
         24111,
         28501,
         27003,
         20945,
         25103,
         30348,
         27970,
         25319,
         3103,
         28438,
         23439,
         5481,
         17058,
         26925,
         36786,
         27130,
         27636,
         3079,
         27115,
         28261
      ],
      "backdrop_path": "/noIqfaKdX3go0GinBAfnnBnYTNh.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "53fe9fb40e0a262de200320e",
         "content": "Grave robbing is one thing, but murder is quite another.\r\n\r\nDr. MacFarlane and John Gray share a murky past, but just what is this hold that the lurching Gray has over the eminent Doctor? Based on a Robert Louis Stevenson short story, The Body Snatcher contains tight direction from Mr Versatile, Robert Wise - all the classy Gothicism one comes to expect from producer Val Lewton - and a stunningly effective performance from Boris Karloff. The piece neatly puts itself out as a kind of sequel to the infamous story of Burke & Hare, where here our main protagonists are clouded over by a link to the dastardly duo who purloined cadavers for cash in the 1820s.\r\n\r\nWhat stands out with this picture is its wonderful pacing, nothing is rushed to try and jolt fear into the viewer, it's sedate and framed in a marvellous Gothic texture by the makers. The core story line is of course one of great distaste, but its a medical quandary in the name of research that makes for a very interesting piece indeed. We are put into a position very early on where we so want to see a young girl cured of her ills, this axis of the film is neatly surrounded by the horror unfolding. Great writing from Stevenson, Lewton & MacDonald.\r\n\r\nBoris Karloff is Gray, a large shuffling man who is the body snatcher of the title, a smirking and well spoken Gent, it really shouldn't be scary, but Karloff manages to chill the blood in every scene that he is in. Henry Daniell is MacFarlane, a very emotive performance as the character is twisted by his pursuit of medical achievement whilst having Gray's looming presence constantly hovering over him. Rounding out the cast with effect is Russell Wade as protégé in waiting, Donald Fettes, Bela Lugosi (a classic horror fans dream comes real in one great sequence with Karloff) as Joseph, and Edith Atwater as loyal love interest Meg Camden.\r\n\r\nHowever, they all play second fiddle to the makers' work here. Gloomy cobbled streets come shining to the fore, Gray's hovel like abode cloaked in dark shadows with the odd flicker of fire light, and stone surrounds that come across as monolithic structures. Some great sequences as well, a particular one uses the characters' shadows to tell the story under the watchful gaze of Gray's cat, and then the final reel, which is moodily excellent and perfectly puts closure on this fine piece of Gothic fevered work. Highly recommended. 9/10",
         "url": "https://www.themoviedb.org/review/53fe9fb40e0a262de200320e"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "Dr. Wolfe 'Toddy' MacFarlane",
               "gender": 2,
               "credit_id": "52fe440f9251416c9100393b",
               "name": "Henry Daniell",
               "profile_path": "/ciLKakcCO4oQhdHTgzSkSBiwoCj.jpg",
               "id": 10924,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Cabman John Gray",
               "gender": 2,
               "credit_id": "52fe440f9251416c91003933",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Donald Fettes",
               "gender": 2,
               "credit_id": "52fe440f9251416c91003943",
               "name": "Russell Wade",
               "profile_path": "/7z4KfH8mQCnjkH28MfYxlPHSbxE.jpg",
               "id": 106104,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "Mrs. Marsh",
               "gender": 1,
               "credit_id": "52fe440f9251416c91003947",
               "name": "Rita Corday",
               "profile_path": "/1I0SyLn53UFKC6CskLFdRnpFWL5.jpg",
               "id": 106099,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Georgina Marsh",
               "gender": 1,
               "credit_id": "52fe440f9251416c9100394b",
               "name": "Sharyn Moffett",
               "profile_path": "/eva6C5xWkbV6Zqj5xQPyz7RKgEB.jpg",
               "id": 106105,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Meg Camden",
               "gender": 1,
               "credit_id": "52fe440f9251416c9100393f",
               "name": "Edith Atwater",
               "profile_path": "/uHdVrHbTrqRvEDhJXj88cVg0xqP.jpg",
               "id": 14577,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Joseph",
               "gender": 2,
               "credit_id": "52fe440f9251416c91003937",
               "name": "Bela Lugosi",
               "profile_path": "/nI14KbMwRNyl8v2Ds5TVAzhu5No.jpg",
               "id": 1547,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Mary McBride",
               "gender": 1,
               "credit_id": "52fe440f9251416c9100394f",
               "name": "Mary Gordon",
               "profile_path": "/u4QD0zsgBgXTi3At0e0ow8VdiEi.jpg",
               "id": 2934,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Richardson",
               "gender": 2,
               "credit_id": "52fe440f9251416c91003953",
               "name": "Robert Clarke",
               "profile_path": "/9xnaWYIQUKdgFVrn76yeIg0H0RG.jpg",
               "id": 30453,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Townsman",
               "gender": 0,
               "credit_id": "52fe440f9251416c91003957",
               "name": "Ted Billings",
               "profile_path": "/aYZrAL3asHczZlVE2ZXba9LkUcV.jpg",
               "id": 2936,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c910038e1",
               "name": "Robert Wise",
               "profile_path": "/6EPkRgYsDMQOYmE9s1vZt2O470R.jpg",
               "id": 1744,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c910038e7",
               "name": "Philip MacDonald",
               "profile_path": null,
               "id": 3354,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c910038ed",
               "name": "Val Lewton",
               "profile_path": "/NcEjLbIwzgTFgdMYCIW1YQd5a2.jpg",
               "id": 97047,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c910038f3",
               "name": "Val Lewton",
               "profile_path": "/NcEjLbIwzgTFgdMYCIW1YQd5a2.jpg",
               "id": 97047,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c910038f9",
               "name": "Jack J. Gross",
               "profile_path": null,
               "id": 13955,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c910038ff",
               "name": "Robert Louis Stevenson",
               "profile_path": "/fGEGp5kpR2mhX89XqAJoJQFGeuG.jpg",
               "id": 29533,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c91003905",
               "name": "Roy Webb",
               "profile_path": null,
               "id": 4345,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c9100390b",
               "name": "Robert De Grasse",
               "profile_path": null,
               "id": 33413,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c91003911",
               "name": "J.R. Whittredge",
               "profile_path": null,
               "id": 106103,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c91003917",
               "name": "Albert S. D'Agostino",
               "profile_path": null,
               "id": 4349,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe440f9251416c9100391d",
               "name": "Walter E. Keller",
               "profile_path": null,
               "id": 41710,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe440f9251416c91003923",
               "name": "Darrell Silvera",
               "profile_path": null,
               "id": 7338,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe440f9251416c91003929",
               "name": "John Sturtevant",
               "profile_path": null,
               "id": 22089,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe440f9251416c9100392f",
               "name": "Renié",
               "profile_path": "/76N2CTu6h9sZZ8CfkexRlhFiVly.jpg",
               "id": 38229,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "573e54dec3a3687adf000323",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 3.869464,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30346,
      "vote_count": 54,
      "budget": 0,
      "overview": "Edinburgh, 1831. Among those who undertake the illegal trade of grave robbery is Gray, ostensibly a cab driver. Formerly a medical student convicted of grave robbery, Gray holds a grudge against Dr. MacFarlane who had escaped detection and punishment.",
      "similar": [
         357096,
         4771,
         984,
         11423,
         15069,
         96,
         75780,
         281,
         979,
         807,
         395834,
         3597,
         25376,
         21484,
         3134,
         994,
         10651,
         12143,
         2749,
         123109
      ],
      "original_title": "The Body Snatcher",
      "runtime": 77,
      "poster_path": "/tZ47yRIG8pT33Dw827LvsFiuIAu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1945-05-25",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Foul Traffic in Dead Bodies.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Wise"],
      "runtime": 77,
      "synopsis": "A gruesome tale of a reality of 19th Century medicine. Karloff portrays Mr. Gray, a dubious supplier of human cadavers for medical experimentation. When the task of digging up newly interred corpses becomes tedious and dangerous, Mr. Gray turns to other methods portending disaster.",
      "writers": [
         "Robert Louis Stevenson",
         "Philip MacDonald"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037549/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMzMwNTc5MF5BMl5BanBnXkFtZTYwOTY3NzY4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Boris Karloff, Bela Lugosi, Henry Daniell | See full cast and crew »"],
      "reviews": [
         "Val Lewton's THE BODY SNATCHER is one of the most \"literate\" films in the horror genre. Based on a short Robert Louis Stevenson shudder tale, it is the story of a young medical student, Fettes, in 1820s Scotland. Fettes is a promising doctoral candidate who has taken on an apprenticeship of sorts with a Dr. MacFarlane, a prestigious physician who runs a medical college. Todd MacFarlane is a very talented medical scholar of the academic sort, whose own past is tainted by an earlier acquaintance with the grave robbers Burke and Hare, who provided human specimens to his mentor, a Dr. John Knox. Haunted by his past, MacFarlane is tormented and blackmailed by a \"jack of all trades\", a cab-man and grave robber John Gray. Gray, a working class man from the most impoverished sections of the urban poor, takes great delight in this power, and lords it over MacFarlane's household, which includes the doctor's wife- also privy to MacFarlane's secret- who poses as MacFarlane's housekeeper, in an awkward attempt to hide the roots of MacFarlane's own social climb. MacFarlane is also in need of Gray's continued \"services\", which Gray attends to with a sardonic relish. The younger medical student Fettes is pulled into the secrets of the household, which in the end, devour MacFarlane and his efforts to survive in the class structure of Scotland. With THE BODYSNATCHER, Boris Karloff displayed his true depths as a performer, and outside of his original performance as the Frankenstein's monster and perhaps Columbia's THE BLACK ROOM (1935), there are few other films in his immense resume that really display what he was capable of as an actor. In THE BODYSNATCHER, he is at the top of his form. He is supported by actors Henry Daniell, Russell Wade and Edith Atwater, and the movie also marks his final appearance with Bela Lugosi. All of Val Lewton's technique is brought to bear in this work to offer the audience effective atmosphere, and tight pacing under the direction of Robert Wise. All in all, it is a remarkable work, an impeccable contribution to the genre that calls itself horror.",
         "SPOILERS. You don't really want to miss this one unless you've been weaned on Arnold Schwarzenegger action movies or Nightmare on Elm Street, Part Twenty, the PreSequal. There is horror galore but served up with frisson. One can't help admiring Val Lewton and his crew at RKO, working on tiny budgets, but producing miniature gems. It's like painting a masterpiece on the head of a pin. Robert Wise was his director here but the credit goes mainly to producer Lewton, the Russian master of Who Torok. Lewton was insistent on authenticity. The songs we hear are contemporary Scottish folk songs and the wardrobe as close to the real thing as they could get. And Lewton saw to it that \"reality\" was evoked by small items from the prop department and small incidents on screen. At night, for instance, in order to see something in a dark basement, the doctor calls out for someone to bring a candle. In a less thoughtful movie the deserted basement would have a couple of lanterns already lighted, or the set would be brightly lighted with no visible lanterns at all. A small thing, as I say. But it's not just historical accuracy that makes Lewton's RKO pictures so appealing. His plots are rooted in time. And his scripts are -- how can one put this without sounding snotty? -- \"literate\". (\"Oh, how we cozzened them!\") I don't know how closely the dialogue sticks to Stevenson's original story but it works very well, partly because the actors are so competent. Stealing the dialogue isn't necessarily a bad thing when the words are good to begin with. John Huston lifted most of his dialogue for \"The Maltese Falcon\" directly from Hammett's novel. And Shakespeare ripped off whole sections of Plutarch's \"Lives\" for \"Julius Caesar.\" Henry Daniell, like Robert Douglas, later became stereotyped as heavies in Errol Flynn swashbucklers, but Danielle has a far more complex role here -- proud of his medical skills but driven insane by that pride. The accents are mostly American, alas, but the performers at least LOOK right. Then there is the plot. I know it sounds odd in a producer of horror movies but Lewton was a man of good taste. Driven to find a dead body to sell to Daniell, Karloff decides to murder a sweet-faced young blind girl who is a street singer. A modern movie would give us a bathtub full of blood. Here's what Lewton does. The little girl walks alone down a deserted cobblestone street at night, singing a melancholy tune as she goes. The camera is held on her as she walks under a bridge and disappears in the darkness on the other side. Without any cuts, Karloff's horse and coach enter the frame, plodding slowly along in the girl's wake. The coach disappears into the same darkness under the bridge. We hear the girl's carol cut off at the end of a note with a slight squeak. End of shot. It's a far more moving moment than a dozen multiple on screen slashings and throat cuttings and we haven't seen any of it. The ending, however, is fairly explicit. Daniell, now mad, gallops furiously through the rainy night along muddy roads, the recently \"resurrected\" dead body bouncing along in the seat beside him. Instead of the dead woman he has just disinterred, the body is now that of Karloff, revealed only when lightning blindingly illuminates the crazily rocking coach. \"The Body Snatcher\" doesn't have the easy shocks of some of Lewton's other works, like \"The Curse of the Cat People,\" no \"buses\" as Lewton called them. But there is a sense of evil throughout, or let's call it corruption, and it grows as the film moves quietly along. In its own way it's the equal of anything Lewton did before or after. Outstanding.",
         "One could easily argue, as I surely will attempt to do so, that this film, The Body Snatcher, based on the classic story by Robert Louis Stevenson and produced by the wonderfully creative and inventive producer Val Lewton, is the home of Boris Karloff's best performance. Some will argue that his portrayal of Frankenstein's creature was his greatest role, and I would not argue with that. But his role as Cabman Gray is his best performance as an actor. It gives us a chance to see the real Boris and his entire acting range. He plays with relish a character wicked as can be , yet full of contradictions. This villainous rogue that steals bodies from graves and then creates bodies through murder is given an amiable side. He is the most interesting character in the story. He is the core of the story, and it is all due to Karloff's wonderful and witty portrayal. The story is excellent as our the other actors in the film, most notably Henry Daniell as the doctor abused and tormented by Karloff and past secrets. Although this was the last film to have both Karloff and Lugosi, it is a lopsided affair as Lugosi is given very little screen time and an even smaller role as a blackmailing servant. The best scene with both of them is the murder scene of Lugosi's character, and it is one last glimpse of the two great boogeymen sharing the screen once more together. Outstanding film, competent direction, and excellent acting make this film one of the better horror films of the 40s and one of Karloff's finest moments on the screen period.",
         "Robert Louis Stevenson has had a rough going in modern literary tastes. When he died in 1894, he was rightly regarded as one of the finest writers and stylists of his day - for grown-up readers! However, the enmity of a one time friend , W.E.Henley, diminished his reputation. Henley said that Stevenson was too superficial, and was basically a writer of pot-boilers. This view was somewhat softened into a \"boy's\" writer of adventure stories (TREASURE ISLAND and KIDNAPPED were the titles that usually were pushed as boy's novels). Actually Stevenson was far from a writer for youths. TREASURE ISLAND has the perplexing, exasperating figure of Long John Silver as it's anti-hero, chum and protector of Jim Hawkins, but mutineer, pirate leader, and murderer. KIDNAPPED does the same with Aleck Breck Stewart, whose weaknesses (such as gambling and drinking) ruin a political mission. He was hardly a simple adventure novelist, anymore than the real Jules Verne was simply a French chap with an outlandish imagination regarding scientific progress. The movies have done well by Stevenson. TREASURE ISLAND and KIDNAPPED have been made several times, as was THE MASTER OF BALLENTRAE. His novella DR. JECKYLL AND MR. HYDE was made more frequently than any other title of his. In 1931, it earned it's star (Fredric March) the Best Actor Oscar. Even some of the lesser known works have gotten into film: THE WRONG BOX (one of two novels written with Stevenson's stepson Lloyd Osbourne) became a marvelously funny comedy about a scramble over a legacy. THE EBB TIDE was a film with Ray Milland, Lloyd Nolan, Oscar Homolka, and Barry Fitzgerald, and a good television version was made with Robby Coltrane in it. The tales of Prince Florizel of Bohemia from THE NEW ARABIAN NIGHTS became TROUBLE FOR TWO with Robert Montgomery, Rosalind Russell, Frank Morgan, and Reginald Owen. Finally there is this nice gem, THE BODY SNATCHER. It is based on one of Stevenson's best short stories, a moody, psychological drama about the evil that is committed supposedly in the way of greater good. In most of these films the scripts start out with the novel or short story, but branch out into their own scenarios. Gray, the murderous but sympathetic cab man in the film is (in the story) a drunk who MacFarland actually hates. When he kills Gray for his corpse (for medical study) MacFarland is actually settling a score. The conclusion of the story is similar to the film, except that Gray's mysterious resurrection to confront the frightened MacFarland does not lead to his death, but to his total demoralization. He flees into his own oblivion at the conclusion. Stevenson was very into history including crime and the vagaries of the law. It has been noted in the other posts that this story owes much to the crimes of the West Port murderers of 1827-28, William Burke and William Hare (in the film Gray sings a tune about them to the drunken (and doomed) blackmailer Joseph). But this is not unusual for Stevenson. The final blow to Alan Breck Stewart's mission in KIDNAPPED is the hue and cry against him as a suspect in the Appin Murder of 1752, which led to the judicial murder of James \"of the Glen\" Stewart. The latter story is told in the sequel novel CATRIONA. DR.JECKYLL AND MR.HYDE is based on the story of Deacon Brodie, a wealthy cabinet maker and town councilor of Edinburgh in the 1770s and 1780s, who was a burglar at night, and who was eventually hanged on a a scaffold he had built for the city. Even in his best novel (the unfinished WEIR OF HERMISTON)the title character of Hanging Judge Weir is based on that legendary jurist Lord Braxfield, a man of strong prejudices and harsh statements. THE BODY SNATCHER was not the first historical movie by Val Lewton's production unit. But THE BODY SNATCHER was the first of three films (all first rate) starring Boris Karloff (the others being ISLE OF THE DEAD and BEDLAM). THE BODY SNATCHER manages to set the period of the 1830s pretty well, although an early distance shot is from some routine film stock and (if you look carefully) shows a car in the distance near a flock of sheep outside of Edinburgh Castle. The acting is actually quite good, in particular Karloff's Gray and Daniell's astonishing MacFarland. Henry Daniell was one of the best screen villains of his period, in films like CAMILLE (as Baron De Varville) and THE SEA HAWKE (as Wolfingham). He also could do comic villains (Garbitsch in Chaplin's THE GREAT DICTATOR). But this is a rare occasion where he actually shared a full screenplay with a fellow actor. Daniell's MacFarland is in a battle to the death with Karloff's Gray, one that his mistress knows will destroy both. Both have flaws (Daniell's intellectual arrogance; Karloff's willingness to kill anyone who is expendable). But both are human too. Daniell is aware that his operation on the little girl is \"flawless\" but nothing improves her ability to walk. All he can do is harshly order the little girl to walk (and she doesn't). Gray sneers at him in their famous scene in the tavern, where Daniell explains his confusion at the failure of a successful operation and hits on the actual missing aspect - Gray knows that the basic cause of life is not something that MacFarland can fix, but the basis of life itself (God or nature itself - something beyond a puny mortal like the doctor). But Gray, for his cynicism and murderous ability, does wish the \"wee\" one could walk. Oddly enough, hearing his horse move causes the poor girl to walk finally. It is a fine movie, and gave both Karloff and Daniell a shining moment on the screen.",
         "As of this writing, I have seen four of the nine Val Lewton DVD Horror Collection films and this one was, by far, the best. Henry Daniell, Boris Karloff, Edith Atwater,Russell Wade, Sharyn Moffet and Bela Lugosi all acted well. I had forgotten that Karloff was a decent actor, not just some Frankenstein monster who couldn't deliver a line. He had a creepy voice, too, which lent itself nicely to horror films. I just found him fascinating here. In addition, this movie had a well-known director, Robert Wise, and the story was adaption of a Robert Louis Steevenson. So, you see, this film had good bloodlines, pun intended. This was not some schlocky Ed Wood B-film. This movie is a high class affair. I found it more of a crime story than anything else as a doctor (Daniell), trying to further his knowledge and needing human specimens (dead) to continue his research, has his graveyard supply cut off to him and then has to have his helper (Karloff) kill people to provide him the bodies. Meanwhile, a young and more moral student of the doctor, gets wind of what's happening and doesn't share his mentor's view that the \"ends justify the means.\" At any rate, this a keeper. Like the other Lewton films I've seen, it's well- photographed, too. I can only hope a few of the five I haven't seen yet are this good.",
         "A sinister coach driver John Gray (Boris Karloff) supplies corpses for Dr. Wolfe MacFarlane (Henry Daniell) and his assistant Donald Fettes (Russel Wade), but things start going pair shape when Dr. Wolfe finds out more about where these corpses are coming from, as supplies are running short and he tries to get rid of Gray, who doesn't share his buddy's (or Toddy's) thoughts. Another thing on their minds is that a mother of a young girl with a bad vertebra that's getting worse asks Dr. Wolfe for his help, but he refuses at first. But with the constant bugging from assistant Fettes, he finally goes ahead with the operation. The more I watch this film, the better it seems to get! Val Lewton's \"The Body Snatcher\", which is set in the year 1831, Edinburgh - is an excellently well-handled thriller that holds SUCH great performances from the likes of Boris Karloff, Henry Daniell, Russel Wade, Edith Atwater and Bela Lugosi. What shines and drives the film other than its performances - is the intelligent screenplay and hypnotic atmosphere and setting that reeks of death and coldness. The foggy, empty and dark streets of Edinburgh during the night have an approaching sense of menace, especially when Karloff is on screen. An impressive Boris Karloff as John Gray the Cabman evokes such tension and depth. He always makes his presence distinguishable, with the scenes he's in being the most interesting. His appearance and body language has some unsettling effect - in a captivating way. His performance in my opinion is up there with the likes of \"The Mummy\" and \"Bride Of Frankenstein\". I read a lot positive remarks towards Karloff's performance, but IMHO Henry Daniell was equally as good. He's great as the troubled Dr. Wolfe, who is haunted by Gray. You could say he was the backbone of the film. When these two shared the screen, is when the fireworks certainly occurred. Russel Wade is quite sympathetic in his role, as the reluctant assistant who gets drawn into Dr. Wolfe's mess. Edith Atwater delivers a sound performance and there's basically a neat cameo role by Bela Lugosi. I wasn't bored, but for some people it might be a tad too slow and real talkative, as what this film thrives on, is its vivid literature, well-rounded characters and potently gripping confrontations, especially between Wolfe and Gray. The story has its moments of psychological suspense that steadily develops into a thrilling and powerful finale (that has the usual thunderstorm evident). The way the final lines of dialogue were set up in that sequence is truly unnerving. Also throw in elements of greed, guilt and pride and how it gets the better of people. So there is a moral to all of this. Sudden shocks and jolts fill the film, but definitely not cheap ones. Mostly the deaths are implied, though there is great use of sound in those situations eg. The sound of a horse trotting. It's very effective! It isn't stylish or spirited directing by Robert Wise, but to cap it off, he achieves a downright inventive and believable movie piece. My only small complaint is that it could've been a much darker film, but it's the lightness of the sub-plot about the crippled girl that \"slightly\" spoilt it. Was it trying for an innocent point of view?Nonetheless, it's still my favourite Lewton/Karloff film, to date. \"Never get rid of me!\"",
         "THE BODY SNATCHER who supplies fresh corpses for an Edinburgh doctor in 1831 soon adds blackmail & murder to his iniquitous deeds. This was one of a short series of horror films in which Boris Karloff starred for producer Val Lewton, the others being ISLE OF THE DEAD (1945) & BEDLAM (1946). Lewton had the knack of producing films full of atmosphere & menace on a very low budget and THE BODY SNATCHER is no exception, getting most of its chills from the wonderful acting and the literate, intelligent script - although the climax is genuinely terrifying. Karloff is chillingly perfection in the role of the sly coachman who augments his salary with a little grave robbing. A gentle man who is kind to crippled children, yet can murder without a second thought, Karloff paints the cunning portrait of a very human monster. Every step of the way, however, he is equaled by Henry Daniell, a wonderful British character actor who never received due recognition for his skills. Playing a brilliant anatomist who feels he must continue to use Karloff's gruesome deliveries for the light they shine on solving medical problems, Daniell delivers an elegant portrayal of a deeply conflicted man who is pulled ever nearer the center of the vortex. In a relatively small role - his last with Karloff - Bela Lugosi is memorable as a greedy servant who tries blackmail at the worst possible time. Russell Wade as a medical student and Rita Corday as a young patient's widowed mother help move the plot along, but wisely no romantic subplot is allowed to develop. Edith Atwater does very well as Daniell's housekeeper, a woman with many secrets. Movie mavens will recognize elderly Mary Gordon, unbilled as the pathetic mother at Greyfriars graveyard. ************************ At one time, the bodies of executed prisoners supplied the medical schools of Britain with all the corpses they could use for the purposes of dissecting & lecturing. But judicial reform nearly dried up the flow of bodies from that source, while the proliferation of new schools and anatomy theatres made the shortage acute. The medieval laws still on the books made the legal acquirement of bodies almost impossible. The ghastly vocation of body snatching thus arose to fill this void. Body Snatchers - also referred to as grave robbers, resurrectionists, or Sack 'Em Up Boys - would haunt cemeteries by night, looking for the recently deceased to disinter. Often the caretakers in the graveyards would be in financial league with these hooligans, as well as the doctors at the medical schools. Prices paid for the bodies could be quite exorbitant, considering the risks that were taken. Leaving dogs or spring-loaded guns at the graveside were just some of the elaborate precautions taken by the friends of the deceased, who often kept vigil by the graves until enough time had passed to make the corpse no longer desirable. Eventually, it became quite difficult to count on the graveyards to furnish enough fodder for the grisly trade. 'The ruffian dogs, the hellish pair, The villain Burke, the meager Hare... Nor did they handle ax or knife To take away their victim's life... No sooner done than in the chest They crammed their lately welcome guest...' Arriving in Edinburgh in 1827, William Burke met fellow Irishman William Hare, who was keeper of a low lodging house. Scurrilous rascals both, when an old pensioner died there in November of that year, Burke & Hare sold the body to a surgeon for 7£, 10 shillings. Delighted with this easy money, the nefarious pair soon took to hastening the deaths of their 'subjects.' At least 15 hapless victims were lured into the lodging house and smothered (so as to leave no sign of violence on their flesh), the bodies then sold to respected surgeon Robert Knox. On Halloween in 1828, suspicious neighbors summoned police and enough evidence was found to immediately arrest Burke & Hare. At the trial, Hare turned King's evidence and admitted to the murders. He was released and promptly disappeared. In his confession, Burke completely exonerated Knox of any knowledge of the killings, but the doctor was hounded by the press & public and quickly relocated to London, where he carried on a successful career. Burke was hanged on January 28, 1829. His corpse was eviscerated and his skeleton is still on display in Edinburgh. A year after the events in the movie, the Anatomy Act of 1832 made it legal for the bodies of those dying friendless in poorhouses and hospitals to be given to local medical facilities for study and dissection. ********************************* The film incorporates the story of Greyfriars Bobby (called Robby in the movie) but makes a muddle of the facts. In reality, Bobby was a Skye terrier that refused to leave the graveside of his master, an elderly, indigent shepherd, in the graveyard at Greyfriars Church in Edinburgh. Bobby stayed faithfully at his post for years and became a tremendous sentimental favorite of the city folk, before dying of old age. Today a statue near the church commemorates his memory.",
         "A later Val Lewton film, from his costume picture period, The Body Snatcher, from a Robert Louis Stevenson story, directed by Robert Wise, is a fine if somewhat moralistic and sentimental horror tale. It lacks the alogical, almost surreal qualities of Lewton's earlier movies, where much is left unexplained, even inexplicable, and a great deal happens off-screen; and even then one can't be sure of what really occurred, as events are often related anecdotally, or merely suggested. In his first few horror exercises Lewton cared as much for gentility as fright, often basing his stories on legends and superstitions, as much of their power came from the vagueness of reality, and the capacity our imaginations have for creating and even shaping our experiences. By the time The Body Snatcher came around Lewton was moving somewhat closer to mainstream horror. Legends still matter, and the feeling of the dead hand of the past on the present as a Lewton theme is very much alive. In this film it is the notorious case of the grave-robbing Burke and Hare of 19th century Edinburgh, and their effect on a distinguished physician who has continued to do business with one of their former confederates. As the decent-minded but less than morally fastidious doctor, Henry Daniell is outstanding, and surprisingly sympathetic; and he has here perhaps his longest and most sustained role in a movie. He certainly has more screen time than in any other picture I've seen him in. Top-billed Boris Karloff gives Dr. Daniell more than a run for his money as the grave robbing, yet intelligent, observant and not altogether evil cab-man Gray. Karloff's performance is physical as much as anything else, as he uses his body here more eloquently than in any other part outside the Frankenstein series. He knows how and where to stand in relation to others, managing, as always, to look taller than he really is. With his big hat, scarf and long coat, he seems to have walked out of a Dickens novel. Karloff's performance reminds me of how much acting has as much to do with body language as anything else; and that there is a degree of posing,--not fakery--but standing still and letting a character project from the way an actor holds himself as from speech or facial expression. The movie itself falls just a bit short of being great by it less than brilliant script and the enforced sentimentality of the subplot about a crippled girl. I agree that this was a good idea, and could have made the film all the more powerful, but the scenes around her are stilted, and the actress who plays the girl is none too convincing. It was a good try, though, and almost works, especially in her last scene, but the writing and staging were a little off. I can't help but respect Lewton and Wise's intentions, but they overreached themselves, and I feel bad about it. The climax in the carriage with the corpse, however, and the ghostly repetition of \"never get rid of me!\" is still impressive, and saves the film in the end.",
         "What can you say about Boris Karloff? He attacks this role with evil zest. I have not seen a lot of his work, but I was extremely impressed with his portrayal of Cabman Gray, the medical school's grave robber. (among other things) The modern horror genre simply focuses on gore, and doesn't allow characters like Gray, or actors like Karloff flourish, and that's too bad.",
         "Val Lewton has produced some of the most important horror classics of all time. His collaborations with the great Jacques Tourneur are the most noteworthy in his filmography, but some of the others are of note also. Like this one for example. The Body Snatcher is a psychological horror film, a study of guilt, and an expose on how people sometimes have to do bad things in order to do good, even though those bad deeds may well consume them. This is shown through the story of Wolfe MacFarlane, a doctor and teacher of medicine that employs cabbie John Gray to steal corpses from the local cemetery so that he can use them to show his students how to operate on a patient. However, this arrangement has put the cabbie/gravedigger in a position of power over the upper class doctor, and that is something that John Gray intends to capitalise on... Boris Karloff stars as the grave digging John Gray, and does an absolutely excellent job with it. Karloff has to prove nothing to nobody after his portrayal of Frankenstein's monster, but his embodiment of exactly what you would expect a grave robbing, amoral lower class man to be like is right on cue. Fellow legend Bela Lugosi makes a welcome, if brief appearance also and the other lead role is taken by Henry Daniell. I haven't seen this man before...well, I didn't think I had - he's actually been in many well-respected classics including The Philadelphia Story and The Great Dictator. He does a great job as the lead; his performance bodes well with the film, and just like Karloff he's very believable in his role. The real star of the show, however, is the lush black and white cinematography which capture's the movie's many beautiful settings. Val Lewton has become famous for capturing this sort of atmosphere, and The Body Snatcher is one of the films that does it best. The use of 'less is more' is right on cue in this film, and there is one sequence in particular involving Boris Karloff, a dark alley and a street singer that will be of particular note to film fans. In short; The Body Snatcher is a great horror film, and one that anyone who considers themselves a fan of great horror will not want to miss!"
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "In Edinburgh in 1831, Dr. Wolfe MacFarlane runs a medical school where Donald Fettes is a student. Fettes is interested in helping a young girl who has lost the use of her legs. He is certain that MacFarlane's surgical skills could be put to great use but he is reluctant to do so. The good Dr. MacFarlane has a secret that soon becomes all too obvious to young Fettes, who has only recently been promoted as his assistant: he has been paying a local cabbie, John Gray, to supply him with dead bodies for anatomical research. Gray constantly harasses MacFarlane and clearly has a hold over him dating to a famous trial many years before where Gray refused to identify the man for whom he was robbing graves. Fettes isn't aware of any of this but soon realizes exactly how Gray obtains the bodies they use in their anatomy classes.",
         "In 1831, in Edinburgh, the prominent doctor and professor Dr. Wolfe 'Toddy' MacFarlane buys corpses for his studies and classes of anatomy from the notorious cabman John Gray, who is also a body snatcher. When his talented student Donald Fettes tells that he will quit medical school since his family cannot afford to support him, MacFarlane hires him as his assistant to permit Fettes to proceed his studies. Fettes meets a little girl that cannot walk anymore due to a coach accident, and he tries to convince Dr. MacFarlane to operate her but the doctor is reluctant. Soon Fettes discovers that Dr. MacFarlane has a secret from his past and Gray blackmails him. When Fettes learns how Gray obtains the corpses for Dr. MacFarlane, he has an inner conflict and does not want to continue as Dr. MacFarlane's protégée. But isn't it too late?",
         "In Edinburgh, renowned surgeon and now teacher of anatomy Dr. MacFarlane, has been paying John Gray, a cabman, to clandestinely bring him exhumed bodies of the recently deceased for classroom demonstration purposes. With cemeteries being increasingly guarded, Gray turns to murder to provide MacFarlane with fresh bodies. Realizing that he will never be rid of Gray, who constantly taunts him with his knowledge of MacFarland's past indiscretions, MacFarlane engages the malevolent Gray in a hand-to-hand fight to the death, the ultimate results of which provide the victor with an episode of unprecedented psychological horror.",
         "Based on a Robert Louis Stevenson story, a young medical student learns that both good and evil are manifested in all men.",
         "A ruthless doctor and his young prize student find themselves continually harassed by their murderous supplier of illegal cadavers."
      ],
      "budget": 0
   },
   "movielensId": 1337,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1945-05-25",
      "dvdReleaseDate": "2005-10-04",
      "directors": ["Robert Wise"],
      "runtime": 77,
      "movieId": 1337,
      "title": "The Body Snatcher",
      "mpaa": "",
      "actors": [
         "Henry Daniell",
         "Boris Karloff",
         "Russell Wade",
         "Rita Corday",
         "Sharyn Moffett",
         "Edith Atwater",
         "Bela Lugosi",
         "Mary Gordon",
         "Robert Clarke",
         "Ted Billings"
      ],
      "imdbMovieId": "0037549",
      "originalTitle": "The Body Snatcher",
      "genres": [
         "Crime",
         "Horror"
      ],
      "youtubeTrailerIds": ["tzawZeI53nM"],
      "plotSummary": "Edinburgh, 1831. Among those who undertake the illegal trade of grave robbery is Gray, ostensibly a cab driver. Formerly a medical student convicted of grave robbery, Gray holds a grudge against Dr. MacFarlane who had escaped detection and punishment.",
      "tmdbMovieId": 30346,
      "avgRating": 3.46365,
      "releaseYear": "1945",
      "numRatings": 729,
      "posterPath": "/tZ47yRIG8pT33Dw827LvsFiuIAu.jpg"
   }
}