{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "venice",
            "id": 110
         },
         {
            "name": "gypsy",
            "id": 394
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "carnival",
            "id": 3473
         }
      ],
      "imdb_id": "tt0091651",
      "video": false,
      "title": "Vampire in Venice",
      "recommendations": [],
      "backdrop_path": "/nQBlHLsUFvkyEVEmfMNsNadsW2u.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Nosferatu",
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f237",
               "name": "Klaus Kinski",
               "profile_path": "/7gsJB7xlovz1khNID0B8yKA9TO0.jpg",
               "id": 14277,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Professor Paris Catalano",
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f23b",
               "name": "Christopher Plummer",
               "profile_path": "/fauMGxa6dc86nHNenQ8X6DlE6YV.jpg",
               "id": 290,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Don Alvise",
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f23f",
               "name": "Donald Pleasence",
               "profile_path": "/fr9lf679ZsHbDZsbcpKZfbFO1Pu.jpg",
               "id": 9221,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Helietta Canins",
               "gender": 0,
               "credit_id": "52fe4581c3a368484e05f243",
               "name": "Barbara De Rossi",
               "profile_path": "/5pZtRwN1wm5Y1NpQqT3kwSqNRLh.jpg",
               "id": 100055,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Maria Canins",
               "gender": 0,
               "credit_id": "52fe4581c3a368484e05f247",
               "name": "Anne Knecht",
               "profile_path": null,
               "id": 100056,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Uta Barneval",
               "gender": 1,
               "credit_id": "52fe4581c3a368484e05f24b",
               "name": "Elvire Audray",
               "profile_path": "/navI2gIxSCCzihByQDj4dZJDIEK.jpg",
               "id": 100057,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Medium",
               "gender": 1,
               "credit_id": "52fe4581c3a368484e05f24f",
               "name": "Clara Colosimo",
               "profile_path": "/4VDJJCzTNyC8kbH6mj6xN3m4L08.jpg",
               "id": 100058,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Princess",
               "gender": 0,
               "credit_id": "52fe4581c3a368484e05f253",
               "name": "Maria Cumani Quasimodo",
               "profile_path": null,
               "id": 99792,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Priest",
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f257",
               "name": "Mickey Knox",
               "profile_path": "/5tyGEyr0PwKt9tFhDySAFekOj7S.jpg",
               "id": 46418,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Dr. Barneval",
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f25b",
               "name": "Yorgo Voyagis",
               "profile_path": "/bTqroXMCv3t9b0aXUjIM05t3HKU.jpg",
               "id": 24696,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4581c3a368484e05f20f",
               "name": "Augusto Caminito",
               "profile_path": null,
               "id": 59622,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f215",
               "name": "Mario Caiano",
               "profile_path": "/lkyECV2HvPXyFgvBcDUtAQtADjm.jpg",
               "id": 100053,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f21b",
               "name": "Luigi Cozzi",
               "profile_path": "/gGBQcEpcesOwKi2kA9lInvA3Vgw.jpg",
               "id": 88164,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4581c3a368484e05f221",
               "name": "Klaus Kinski",
               "profile_path": "/7gsJB7xlovz1khNID0B8yKA9TO0.jpg",
               "id": 14277,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4581c3a368484e05f227",
               "name": "Maurizio Lucidi",
               "profile_path": null,
               "id": 100054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4581c3a368484e05f22d",
               "name": "Augusto Caminito",
               "profile_path": null,
               "id": 59622,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4581c3a368484e05f233",
               "name": "Augusto Caminito",
               "profile_path": null,
               "id": 59622,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5783db4bc3a36817980006f7",
               "name": "Leandro Lucchetti",
               "profile_path": null,
               "id": 1050991,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "559307b5c3a3682cc800029f",
               "name": "Tonino Nardi",
               "profile_path": null,
               "id": 1336287,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.504867,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 28198,
      "vote_count": 2,
      "budget": 0,
      "overview": "Professor Paris Catalano visits Venice, to investigate the last known appearance of the famous vampire Nosferatu during the carnival of 1786.",
      "similar": [
         7131,
         36647,
         36648,
         6114,
         49017,
         138,
         6404,
         24021,
         277,
         2907,
         628,
         755,
         52520,
         346672,
         252171,
         12437,
         18239,
         834,
         8698,
         76492
      ],
      "original_title": "Nosferatu a Venezia",
      "runtime": 97,
      "poster_path": "/4wp8vf0en3fNwl567FRFoEfqPNP.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Scena Film",
            "id": 49589,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Reteitalia",
            "id": 1242,
            "origin_country": ""
         }
      ],
      "release_date": "1988-09-15",
      "vote_average": 8.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Augusto Caminito",
         "Mario Caiano"
      ],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Alberto Alfieri",
         "Augusto Caminito"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0091651/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNjI3MjU1M15BMl5BanBnXkFtZTcwNDg5ODc5Mg@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Klaus Kinski, Christopher Plummer, Donald Pleasence | See full cast and crew »"],
      "reviews": [
         "\"Nosferatu a Venezia\"(1986,Augusto Caminito)is one of the better vampire movies I have seen.Klaus Kinski is truly memorable as Nosferatu,the prince of darkness and Barbara De Rossi is hauntingly beautiful.The film is very atmospheric and has an excellent orchestral score by Luigi Ceccarelli.Set in Venice during the carnival it provides plenty of eerie atmosphere.Highly recommended,especially if you're into vampiric horror movies!",
         "I've seen this film quite a few times and I don't think I've ever seen a sexier portrayal of a vampire in all my days! Brilliant film for the die hard vamp fan.The performance of Klaus kinski is evil, dark, oppressive and downright fantastic. OK, so it's a film that you'll watch alone and you'll be female but c'mon - it doesn't mater about the script - the background, the scenery, the images are more than enough to satisfy the vampire hunter in you! Should you watch this film I recommend you do it alone, with a glass of wine (red of course) and some good cheese and crackers. One of the ultimate vampire films of all time!",
         "Late, great wacko fruitbag iconoclastic actor Klaus Kinski gives a marvelously threatening, overwhelming, terrifyingly bestial and sometimes even strangely touching performance as Nosferatu, an evil, indestructible, all-powerful vampire who preys upon an affluent aristocratic family in Venice, Italy during the bleak, hopeless, fear-ridden time of the Black Death. Dedicated dying vampire hunter Christopher Plummer and pious, self-righteous priest Donald Pleasence make a futile and foolhardy stand against the foul, parasitic, yet anguished subhuman creature of darkness. Under Augusto Caminito's able, stately, subdued direction \"Nosferatu in Venice\" bravely explores mankind's stark fear of and inability to accept his own mortality as well as man's profound, but impractical desire to somehow transcend said mortality. But as the eternally tormented Nosferatu proves immortality can be more of a burden than a blessing, because he and all others like himself are perpetually cursed to endure the suffering of countless mortal others. Tonino Nardi's beauteous, misty, breathtaking cinematography and Luigi Ceccarelli's wondrous, elegant, potent orchestral score prodigiously contribute to the considerable substance of this frighteningly (and, yes, even fascinatingly) morbid, oddly affecting, soulful beauty of a film. The movie's unflinchingly desolate, flesh-crawling, funereal ambiance, relaxed, lulling pace, pervasively nonchalant air of insurmountable nihilism, and somewhat disjointed narrative isn't for every taste, but viewers who are willing to accept this disturbing, challenging, gripping and powerful feature on its own macabre and twisted terms should find it to be very rewarding. Kinski's forceful and singularly wicked presence alone distinguishes this picture as an extraordinary work; few other actors can even begin to convey the same harrowingly tangible sense of extreme unbreakable demonic menace that Kinski effortlessly exuded. A gallant, tough-minded, thematically rich and grotesquely lovely addition to the vampire horror genre.",
         "Nosferatu a Venezia, or Vampire in Venice as it's more commonly known as to English speaking audiences, starts with the arrival of Professor Paris Catalano (Christopher Plummer) in the beautiful European city of Venice. Professor Catalano has dedicated his whole life to the study of Nosferatu (do you think that pays well?) who disappeared in Venice during 1786, he has received a letter from Helietta Canins (Barbara De Rossi) who claims that a coffin in her basement contains the body of Nosferatu (Klaus Kinski). Catalano checks it out but disagrees, to try & prove her point (I think) Helietta organises a séance & hires a medium (Clara Colosimo) to try & contact Nosferatu. It turns out Calatano was right & Nosferatu isn't in Helietta's basement but the séance does raise Nosferatu from his 200 year sleep & after consulting with a gypsy (!) Nosferatu heads off in search of those who summoned him. Oh, & to add to the excitement he also has a few nice boat rides down various Venice canal's... This Italian production was written, produced & in part directed by Augusto Caminito & is a loose sequel to Werner Herzog's Nosferatu the Vampyr (1979) although the actual connection with that film is nothing more than Kinski reprising his role as Nosferatu & even then he looks completely different in each film. The script by Caminito is a bit on the dull side, takes itself very seriously & is an absolute mess. I would imagine that the various reported production problems were the reason, nothing in the film makes any real sense & things, people, sub-plots & unnecessary flashbacks just come & go with little regard for narrative cohesion. There are a few odd flashbacks, Donald Pleasence's character Don Alvise just rambles on about God for a few scenes before he is completely dropped, why would Professor Catalano spend his entire life studying Nosferatu & when he finally finds him decides to commit suicide, what was in the coffin, why did half it's face glow red & then turn to dust & what the hell are all those gypsies & that woman's magic crystal ball all about? The whole film feels fractured & that various different people with opposing ideas & aims worked on it. Having said that it's watchable & just about strange enough to maintain ones interest plus the ironic ending where Nosferatu who is tired of eternal life & wants to die is hunted by some Vampire hunters who actually kill Helietta instead & since Nosferatu needs the unconditional love of a virgin to die the Vampire hunters have in fact achieved the opposite of what they wanted to do. Right, now lets get this straight shall we. Apparently producer Caminito hired Maurizio Lucidi as director & he even shot a few scenes but Caminito fired him. Caminito then hired Pasquale Squitieri to write & direct, however his screenplay was apparently too expensive to shoot so he was sacked as well. Caminito then hired a third director Mario Caiano, unfortunately on his first day Kinski got into a 'violent argument' with Caiano & he too left the director's chair. Caminito then decided to just direct the thing himself but had no experience so he was helped by his assistant Luigi Cozzi, but it doesn't end there folks because it is also reported that Kinski shot a fair amount of the film himself. The saying 'too many cooks spoil the broth' comes to mind & I think it's a perfect phrase to describe Nosferatu a Venezia. The film is undoubtedly stylish & has some great scenes but they're lost within the mess of a story. Forget about any gore, a bit of blood & a few people fall on some spiked railings, that's it. There's some nudity as well if that's your thing. Technically the film is very good with some great costumes, sets & Venice itself makes for an unusual location. It has nice cinematography & music, it's just a shame the film had so many behind-the-camera problems. The acting was OK although am I the only one who thinks Kinski looks terrible in this? He looks like Peter Stringfellow on a bad day! Nosferatu a Venezia was a disappointment, if the story had been stronger this could have been a decent sequel, as it is it's a curious mess both in front of & behind-the-camera. Could have been so much more, watch Nosferatu the Vampyr again instead.",
         "Christopher Plummer goes to Venice to investigate the last known appearance of Nosferatu during the Carnival of 1786.Plummer seems to think that the vampire is searching for a means to put an end to his torment and actually be dead. He stays with a family who legend says, has the vampire trapped in a tomb in the basement. After a séance \"the vampire\" appears and then it becomes a question of how do you put the evil back into the box. Thats a poor description for a very moody, very good rethink of the vampire legend. In theory this is a modern day sequel to Werner Herzog's remake of the FW Murnau's silent original. However other than the fact that Klaus Kinski plays the vampire the films are pretty much separate films. Here the vampire is a force outside of nature, he goes out during the day, religious objects don't affect him and he has powers beyond those of normal vampires. To be honest this film's idea of vampires and their creation is very different than what is considered \"normal\" vampire lore. This is a film thats a bit more form over content, but its still weaves a magical spell. Its a very atmospheric haunted Venice story where mood and feeling is all. Its a film designed to make you feel creepy and uneasy and not so much scary in \"the jump and scream variety\". It helps that the film rethinks what a vampire is. Going back to folklore where things other than a bite on the neck was required to turn someone undead, this film keeps you off balance since you can't be sure what is real with in the film's world. Adding a great deal to the film are the performances of the excellent cast. Christopher Plummer's vampire hunter is a wonderful man of science who's pronouncements give a weight to the proceedings that would me missing in lesser hands. We believe in whats going on, because he does. Even in the early scenes when there is some doubt as to whats real and what isn't Plummer's intensity keeps things on track. Klaus Kinski as the vampire is a brooding, sad, sexual menace that says very little but wanders through his scenes with a power and intensity lacking in most vampires. Here is an ages old world weary soul who is forced to play peoples stupid games but who really just wants to be loved and most of all to die. The cinematography of this film is extraordinary. Venice is a character in every shot. You get a sense of place and of dread with every picture. This is one of the most beautiful films I've seen, and its fog shrouded vistas of Venice in the morning deserve to be hung on the wall. This is an amazing film, more creepy than scary, but one that is none the less haunting. This is a lost treasure for those who can appreciate horror films as being more than just the traditional sort. 7.5 out of 10 (7 out of 10 for IMDb purposes)",
         "I haven't seen this film for years but it has left lasting images and atmospheres in my mind. I seem to recall the score being really interesting aswell. The camera and cinematography from what i can remember was amazing.- Showing gondalas sailing through the fog in Venice, a stunning location to say the least. It also boasts one of the prettiest actress's ever, in the shape of De Rossi. All this together with Kinski creeping around as Nosferatu makes for essential viewing.",
         "This brilliant Italian vampire film certainly has an accomplished cast. Whilst Pleasence and Plummer are good, Kinski acts his socks off in reprising his 1979 role of Nosferatu. De Rossi and Knecht are also good, and pull off this whilst being so unbelievably gorgeous as well. What lets this down is the dodgy dubbing in the English language release that I saw - even though Pleasence and Plummer seem to have their own voices, the others look dodgily done, even if they are their own (which some must be). Suffice to say, watch the Italian version, and be amazed.",
         "Klaus Kinski was in the remake of 'Nosferatu' which seems to be the only reason for this one to be titled 'Nosferatu in Venice'. Wasn't the vampire's real name Orlok, anyway? It would be a name-only sequel, Kinski looks completely different without fangs and pointy ears, and is dapper like a 18th century nobleman! Is he even a vampire? Sunlight and crosses doesn't seem an issue. Not even a shotgun wound in the chest the size of a water melon that we can look right through seems to bother him! It's an attractive movie fusing mysterious locations of Venice to a moody score. An exercise in atmosphere where honestly not that much happens. But Kinski is surprisingly preying for sex, and there is plenty of boobs and bush in this. A lot of screen time is spend on having a dirty old man groping all over girls bodies, and the girls in question are really top-rate! It's seems the types usually above this kind of roles. It's a dirty little movie given a classy touch, 'Dracula The Dirty Old Man' is it's retarded, inbred, hillbilly cousin.",
         "It took me over a year to get this film on video. VAMPIRE IN VENICE (Nosferatu A Venezia) is a semi-sequel to Werner Herzogs' NOSFERATU THE VAMPYRE 1979. However, the only thing in this movie relating to that is the return of Klaus Kinski as Count Dracula (though he's just referred to as 'nosferatu' in this film). Easily one of the best vampire movies ever, it contains a very dark, deadly serious and atmospheric texture. Kinski is as creepy as ever, looking like a cross between Rutger Hauer and a zombified-Mozart! Other well known actors, Christopher Plummer and Donald Pleasence are great in the movie. The soundtrack by Luigi Ceccerelli(!) is breathtaking and memorable, and it seems that Venice herself is a prime character. The film dis-spells religious attempts against vampires and there are some interesting theories on vampiric origins discussed within the feature. My only complaint with this excellent film is the sound quality. The dubbing isn't so bad, but it's hard to make out what certain characters say at any given time. There are a few plot holes, such as, what DOES become of the vampire and his partner and where had Nosferatu been for all those lost years. Luckily, these trivial things don't spoil this arthouse, classy, unforgettable piece of Italian cinema. Let's hope it gets a well deserved DVD release in the near future.",
         "A vampire hunter (Christopher Plummer) goes to Venice where the infamous vampire Nosferatu (Klaus Kinski) was last seen 2 centuries ago, and soon Old Two Teeth starts biting necks again, as old habits die hard. Traditional methods like sunlight or the sign of the cross do not scare Nosferatu, but it is said the love of a virgin might be dangerous to him, is any of the ladies interested? It's not a good movie, it's not a bad movie, it simply is a pile of various bits and pieces, ranging from genius to rubbish. After several directors were fired, producer Caminito finished the movie somehow - I imagine it must have been a case of \"it's better to make a painful break than draw out the agony\". Venice, however, is a perfect setting for a vampire movie with its ancient, dark, decaying buildings. The warm, colorful carnival scenes provide stark contrast for the cold blue light of the early morning chases when Nosferatu is looking for victims. Unfortunately, when the tension is rising, often something ridiculous happens, for example the attempt to shoot the vampire with a shotgun (results in a cannonball hole to see through) which will immediately destroy the efforts. It's too clumsy to appeal to an art movie audience (who may have enjoyed Herzog's Nosferatu) and too confusing to be Saturday night fun for horror flick fans. Under the circumstances of its production, it's no surprise that 'Nosferatu a Venezia' failed, but I admit it is at least an interesting failure which is not just another vampire movie. I watched the Italian language DVD which has no subtitles in other languages."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Reteitalia",
         "Scena Film",
         "Scena Film"
      ],
      "summaries": ["Professor Paris Catalano visits Venice, to investigate the last known appearance of the famous vampire Nosferatu during the carnival of 1786."],
      "budget": 0
   },
   "movielensId": 1349,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1988-09-15",
      "dvdReleaseDate": null,
      "directors": [
         "Augusto Caminito",
         "Mario Caiano",
         "Luigi Cozzi",
         "Klaus Kinski",
         "Maurizio Lucidi"
      ],
      "runtime": 97,
      "movieId": 1349,
      "title": "Vampire in Venice",
      "mpaa": "",
      "actors": [
         "Klaus Kinski",
         "Christopher Plummer",
         "Donald Pleasence",
         "Barbara De Rossi",
         "Anne Knecht",
         "Elvire Audray",
         "Clara Colosimo",
         "Maria Cumani Quasimodo",
         "Mickey Knox",
         "Yorgo Voyagis"
      ],
      "imdbMovieId": "0091651",
      "originalTitle": "Nosferatu a Venezia",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "Professor Paris Catalano visits Venice, to investigate the last known appearance of the famous vampire Nosferatu during the carnival of 1786.",
      "tmdbMovieId": 28198,
      "avgRating": 3.19466,
      "releaseYear": "1988",
      "numRatings": 131,
      "posterPath": "/4wp8vf0en3fNwl567FRFoEfqPNP.jpg"
   }
}