{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "bar",
            "id": 1010
         },
         {
            "name": "gun",
            "id": 1419
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "siege",
            "id": 4063
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "suspense",
            "id": 9937
         }
      ],
      "imdb_id": "tt0115495",
      "video": false,
      "title": "Albino Alligator",
      "recommendations": [
         11863,
         2087,
         10427,
         73249,
         25284,
         4954,
         11859,
         9401,
         27224,
         45225,
         19380,
         6723,
         21219,
         9057,
         6,
         83489,
         427910,
         46027,
         22004,
         48781
      ],
      "backdrop_path": "/9MfW31b3yETT1zdA4HG3zQ1bFgZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dova",
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f5f",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Janet Boudreaux",
               "gender": 1,
               "credit_id": "52fe44b7c3a36847f80a5f63",
               "name": "Faye Dunaway",
               "profile_path": "/sq12RJZ1HTXHHI48y31YIS2qp87.jpg",
               "id": 6450,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Milo",
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f67",
               "name": "Gary Sinise",
               "profile_path": "/n5AbjoNfONICaggp2f1QhYAjAoZ.jpg",
               "id": 33,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Law",
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f6b",
               "name": "William Fichtner",
               "profile_path": "/oIGjbztWvTqn4tnolW9rDCjpgxu.jpg",
               "id": 886,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Guy Foucard",
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f6f",
               "name": "Viggo Mortensen",
               "profile_path": "/qmC8XfeiFhQtJGKlUk5KyGkPoWp.jpg",
               "id": 110,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f73",
               "name": "John Spencer",
               "profile_path": "/9sU5FEzlf921n6NxHmXgJB3994T.jpg",
               "id": 34691,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Danny Boudreaux",
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f77",
               "name": "Skeet Ulrich",
               "profile_path": "/id0y6bKmNSpr2pYU2Qkiv11EyvR.jpg",
               "id": 22108,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Agent Marv Rose",
               "gender": 2,
               "credit_id": "54ebe01192514112d8000593",
               "name": "Frankie Faison",
               "profile_path": "/3717JOXK2Z8qelfyvScDGimfFBf.jpg",
               "id": 13936,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jenny Ferguson",
               "gender": 1,
               "credit_id": "54ebe021c3a3686d5800062f",
               "name": "Melinda McGraw",
               "profile_path": "/2teouIhRdYzFPL1dNZ2Anq2qi2e.jpg",
               "id": 58692,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Dino",
               "gender": 2,
               "credit_id": "54ebe02fc3a3686d660007b8",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "A.T.F. Agent G.D. Browning",
               "gender": 2,
               "credit_id": "54ebe03fc3a3686d58000639",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f55",
               "name": "Kevin Spacey",
               "profile_path": "/x7wF050iuCASefLLG75s2uDPFUu.jpg",
               "id": 1979,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b7c3a36847f80a5f5b",
               "name": "Christian Forte",
               "profile_path": null,
               "id": 56249,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f7d",
               "name": "Michael Brook",
               "profile_path": null,
               "id": 19016,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b7c3a36847f80a5f83",
               "name": "Mark Plummer",
               "profile_path": null,
               "id": 56250,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.862138,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8744,
      "vote_count": 62,
      "budget": 6000000,
      "overview": "Three petty thieves who the police believe to be major criminals are chased into a basement bar where they take five hostages including all the bar employees. The rest of the movie deals with the cops lurking outside the bar while the trio try to get hold of the situation inside.",
      "similar": [
         395834,
         1923,
         357096,
         10651,
         9631,
         8090,
         96,
         1571,
         4771,
         75780,
         156022,
         562,
         281,
         298312,
         10694,
         1939,
         22825,
         984,
         341006,
         2142
      ],
      "original_title": "Albino Alligator",
      "runtime": 97,
      "poster_path": "/jyDSlbq3FO5JIw8RuaQJl5bwMvI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Albino Alligator Productions",
            "id": 2533,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-09",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "They Planned The Perfect Crime... Until It All Went Perfectly Wrong!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kevin Spacey"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Christian Forte"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115495/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1MjQ0NzU3M15BMl5BanBnXkFtZTcwNzgxNTYyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Matt Dillon, Faye Dunaway, Gary Sinise | See full cast and crew »"],
      "reviews": [
         "There are movies that are made because the studios know they'll make money. There are the movies that are made because someone believed they would and they held out long enough to get them made. Then there are the \"actor's movies,\" the ones any actor worth his/her salt would love to make themselves. This is Kevin Spacey's \"actor's movie.\" That's not a bad term in the least. The majority of the movie is set inside a New Orleans bar, but the scenery doesn't get tiresome. This is due to the fantastic performances of the cast. I love it when I can watch a movie and forget that the person I'm watching is otherwise known as Gary Sinise, Faye Dunaway, or Viggo Mortenson. The film is also a classic tale of inhumanity, on how far people need to or will go to save their own skin, on choices. It sounds cliché, but the movie doesn't come across that way in the least. Overall, I recommend the film for a lazy Saturday afternoon, like it was for me.",
         "Kevin Spacey is, of course, one of the best actors we have, and he shows talent in his first time out as director in this crime story. Specifically, he does a good job creating a tense atmosphere in such a claustrophobic environment as a bar. And although there's a lot of camera movement, it's not overdone. Also, he's good with his actors, especially Dillon, Dunaway, and Sinise. But the movie suggests Spacey should learn about reading scripts next time. The movie harks back to films like PETRIFIED FOREST, but is little more than a clone of them, and writer Christian Forte often falls back on obscenities to substitute for character development and plot. And some of the scenes strain credulity, like the ending.",
         "Kevin Spacey's film debut impressed this viewer when this film debuted in 1996. On second viewing, recently, it still is an interesting film to watch, but it basically left a lot of questions unanswered because of the screen play Christian Forte wrote. One can see what attracted \"Albino Alligator\" to Mr. Spacey. It's a film where the situation that is created at the beginning of the film allows for intense performances by the first rate cast the director was able to put together. There are holes in the plot, like the enigmatic presence of Guy, the Canadian man one sees sitting at Dino's but whose role in the whole thing is not well explained by the screen play. Matt Dillon, as the man in charge of the bandits makes a good contribution. Faye Dunaway is excellent as Janet, the bar maid that must make tough decisions at the end of the film. William Fichtner is at his most intense playing Law, the loose cannon. Gary Sinise doesn't have much to do. The ensemble cast is good under Mr. Spacey's direction. John Spencer, Skeet Ulrich, M Emmet Walsh, Joe Mantegna, Melinda McGraw and Frankie Faison are effective in their roles. A film to be seen as a curiosity because it marks Kevin Spacey's film debut as a director.",
         "Any hostage drama can't help but get compared to 'Dog Day Afternoon' and will therefore be found lacking, but 'Albino Alligator', while not without a few flaws, does a credible job. Kevin Spacey shows some promise as a director, but the script sometimes let's him down. Even so it's pretty entertaining, and the best thing about it is the outstanding cast. You might think Spacey would call upon his Usual Suspects buddies but instead we have Matt Dillon, Gary Sinise and William Fichtner as criminals on the run, Faye Dunaway, M. Emmett Walsh, Skeet Ulrich, John Spencer and Viggo Mortensen as the occupants of an after hours bar they hold hostage, and Joe Mantegna as the cop on the scene. All the actors performances are good, but I especially enjoyed Fichtner's redneck sociopath and Mortensen's mysterious French Canadian who may not be the average joe he appears to be. Both actors have been favourites of mine for some time. 'Albino Alligator' is no masterpiece, but if you want to see some good actors do their thing I suggest you check it out, you won't be disappointed.",
         "As everyone already knows, Kevin Spacey is an extremely good actor who never does a bad job acting. The man is also a great singer (check out the soundtrack to \"Midnight in the Garden of Good and Evil\"), so it's not a surprise that he turns out to be multitalented; he's obviously a great director as well. This is the first movie he has ever made and it is such an engrossing and interesting movie. The acting is also superb, Matt Dillon doing such a great job was a surprise to me. The story itself is also interesting, and I liked the fact that this movie was in many ways theatrical. It doesn't work in every movie, but with this premise it worked out fine. Let's hope Spacey directs many more movies!",
         "The look and feel of this film is that of live theatre. The minimalist approach in set and costume as well as simple, yet dramatic lighting, create an intimacy and immediacy which accents character development and showcases each actor's individual talents. Beautifully written, directed and acted, it's worth a look, and a look again. Most notable is the character of Law, portrayed by William Fichtner, whose electric intensity keeps the nerves raw and the eyes riveted. Kudos to Kevin Spacey for a deliciously original directorial debut.",
         "With so much talent aboard this could have been great cinema. That it's not is due to an unsure screenplay, lacking in credibility, though not lacking in promise. The story in itself, if tightened up, could have been riveting. But despite the actor's efforts, \"Albino Alligator\" fails to deliver the goods. By the end (which in itself is powerful), one has become a bit tired of it all. Spacey was obviously drawn to the clear theatricality of much of the action taking place on one set, in effect on one stage. It's hence very talky and stagy, though Spacey is careful to keep the camera moving in interesting ways. The few outdoors scenes too are shot with great visual style. Combining a keen eye, together with his understanding of actors and acting, Spacey will probably at some point bring his directorial talents to fruition. Hopefully he will be more fortunate as far as a suitable screenplay is concerned. Matt Dillon in the lead does a fair job. As is often the case with him, he manages some moments of excellence, but on the whole is capable rather than brilliant. (He sustained an exceptional performance is the \"Saint of Fort Washington\" and surprised many with \"Drugstore Cowboy\".). It's as if there is a depth to him which he seems to have a lot of trouble reaching. There is a brief scene in \"Albino Alligator\" in which he talks to himself in a facing mirror. It's a moment which reveals those depths which so often seem to elude him. The other players do as well as one would expect. Gary Sinise is superb as Dillon's elder brother, William Fichtner is truly edgy and sinister and Faye Dunaway's bartender has a ring of truth to it. Despite all this talent and a story with possibilities, this is not one to seek out.",
         "Kevin Spacey is obviously an amazing acting talent, but this film proves that he's almost as good a director. This film was satisfying from beginning to end, and it just got more interesting as it went along. The story is fairly simple, but it was powerfully performed by a hugely talented cast. Dillon, Sinise, and Dunaway all give stand-out performances, but really, the whole cast is top-notch. Mantegna wasn't given as much material to work with, but he still had the only truly funny scene in a generally serious movie, and yet the humor didn't seem out of place. There is certainly room for Spacey to improve as a director, but this is most definitely a great way to start off.",
         "Kevin Spacey assembled a first-rate character cast for his directorial debut in 1996: Faye Dunaway, Matt Dillon, Gary Sinise, etc. He gave them an intelligent script and a film noirish style to work with. Faye plays a Cajun barkeep in a 20's vintage speakeasy in modern-day New Orleans run by M Emmett Walsh. Dillon & Sinise play thieves who hold the bar and its few inhabitants (two men drinking and a young man playing pool) hostage late one cold morning along with their psycho accomplice (played by the versatile William Fichtner) after a shootout with police. It rolls along at a leisurely pace and reminds me of a filmed play, not unlike \"The Petrified Forest\" but with less ham & almost zero humor. One of the hostages is brutally beaten to death and Dunaway reacts beautifully; the tension-breakers are few and far between. Loads of foul language including the one hilarious moment involving the lead cop (Joe Mantegna) and a nosy reporter, the only time obscenity is really crucial to the plot. If you like your cops & robbers films stagy and smart, check this one out, but don't expect a lot of action.",
         "I've seen most people rented this movie b/c of Kevin Spacey...truthfully, I rented it b/c of Gary Sinise. I've seen a lot of his stuff, and only one turned out to be a dud-Mission To Mars. I went to get Of Mice And Men and saw him on the cover of this movie and immediately grabbed it. This is one movie that kept me saying \"What's gonna happen!?\" \"Who IS this guy?!\" and random things to that nature. I think the plot is amazing. It took the second time watching it for me to really grasp what went wrong in the beginning. It has just the right amount of comedy relief as well. I think everyone has a 'great!' role and acts in it well! Dillon and Dunaway could have been more 'convincing' but all around, wonderful! I plan on buying this movie!"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Albino Alligator Productions",
         "Miramax",
         "Motion Picture Corporation of America (MPCA)"
      ],
      "summaries": [
         "Three petty thieves who the police believe to be major criminals are chased into a basement bar where they take five hostages including all the bar employees. The rest of the movie deals with the cops lurking outside the bar while the trio try to get hold of the situation inside.",
         "While escaping from a foiled robbery attempt, three thieves find themselves surrounded by police at a New Orleans bar--only they're not the people the police are searching for."
      ],
      "budget": 5000000
   },
   "movielensId": 1352,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-09",
      "dvdReleaseDate": "1999-09-07",
      "directors": ["Kevin Spacey"],
      "runtime": 97,
      "movieId": 1352,
      "title": "Albino Alligator",
      "mpaa": "",
      "actors": [
         "Matt Dillon",
         "Faye Dunaway",
         "Gary Sinise",
         "William Fichtner",
         "Viggo Mortensen",
         "John Spencer",
         "Skeet Ulrich",
         "Frankie Faison",
         "Melinda McGraw",
         "M. Emmet Walsh",
         "Joe Mantegna"
      ],
      "imdbMovieId": "0115495",
      "originalTitle": "Albino Alligator",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["eB76XiTiMBA"],
      "plotSummary": "Three petty thieves who the police believe to be major criminals are chased into a basement bar where they take five hostages including all the bar employees. The rest of the movie deals with the cops lurking outside the bar while the trio try to get hold of the situation inside.",
      "tmdbMovieId": 8744,
      "avgRating": 3.02393,
      "releaseYear": "1996",
      "numRatings": 815,
      "posterPath": "/jyDSlbq3FO5JIw8RuaQJl5bwMvI.jpg"
   }
}