{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "professor",
            "id": 1992
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "columbia university",
            "id": 208709
         }
      ],
      "imdb_id": "tt0117057",
      "video": false,
      "title": "The Mirror Has Two Faces",
      "recommendations": [
         31633,
         9089,
         25796,
         31357,
         10269,
         6472,
         9302,
         46029,
         10449,
         12710,
         825,
         12220,
         41590,
         397,
         40562,
         10763,
         34014,
         9095,
         26941,
         45928
      ],
      "backdrop_path": "/wZrwTrwq9cI4ERp8yYAu1vot9V5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Rose Morgan",
               "gender": 0,
               "credit_id": "55e4583092514137e0003f08",
               "name": "Barbra Streisand",
               "profile_path": "/dniQkFMeSApui14REFpqeZhlaKK.jpg",
               "id": 10400,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gregory Larkin",
               "gender": 2,
               "credit_id": "52fe44bcc3a368484e03405d",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Hannah Morgan",
               "gender": 1,
               "credit_id": "52fe44bcc3a368484e034061",
               "name": "Lauren Bacall",
               "profile_path": "/kolRFeufmFpcdRJL6v44FHkqdbJ.jpg",
               "id": 7570,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Henry Fine",
               "gender": 2,
               "credit_id": "52fe44bcc3a368484e034065",
               "name": "George Segal",
               "profile_path": "/oUUcGtlQYC0HMI3yMmO713kDdGT.jpg",
               "id": 18364,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe44bcc3a368484e034069",
               "name": "Mimi Rogers",
               "profile_path": "/cTXSghmtclAmeTSg4lBBjeOwpoQ.jpg",
               "id": 13920,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Alex",
               "gender": 2,
               "credit_id": "52fe44bcc3a368484e03406d",
               "name": "Pierce Brosnan",
               "profile_path": "/1JXL0zrA26JjdoX8sqf57fJRDVM.jpg",
               "id": 517,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Doris",
               "gender": 1,
               "credit_id": "52fe44bcc3a368484e034071",
               "name": "Brenda Vaccaro",
               "profile_path": "/cwNmZCRMRRiwtVSmkBiqP7aalyL.jpg",
               "id": 30585,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Candy",
               "gender": 0,
               "credit_id": "5943e05b9251417f77023e86",
               "name": "Elle Mcpherson",
               "profile_path": null,
               "id": 1834389,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44bcc3a368484e034055",
               "name": "Barbra Streisand",
               "profile_path": "/dniQkFMeSApui14REFpqeZhlaKK.jpg",
               "id": 10400,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bcc3a368484e034077",
               "name": "Gérard Oury",
               "profile_path": null,
               "id": 11195,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.759796,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25189,
      "vote_count": 66,
      "budget": 42000000,
      "overview": "Rose Morgan (Barbara Streisand), who still lives with her mother (Lauren Bacall), is a professor of Romantic Literature who desperately longs for passion in her life. Gregory Larkin (Jeff Bridges), a mathematics professor, has been burned by passionate relationships and longs for a sexless union based on friendship and respect.",
      "similar": [
         14313,
         17612,
         2149,
         370663,
         979,
         8675,
         36630,
         14474,
         19053,
         226,
         288036,
         1826,
         72207,
         52371,
         37636,
         1024,
         48650,
         126250,
         12271,
         10090
      ],
      "original_title": "The Mirror Has Two Faces",
      "runtime": 126,
      "poster_path": "/8Cgmt9otEhoIlW6p5pLfCWjf4Io.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Phoenix Pictures",
            "id": 11317,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         }
      ],
      "release_date": "1996-11-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "A story about just how wrong two people can be before they can be right.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barbra Streisand"],
      "runtime": 126,
      "synopsis": null,
      "writers": [
         "André Cayatte",
         "Gérard Oury"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117057/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTEyNzUyNTcwM15BMl5BanBnXkFtZTYwMTc3NDI5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Barbra Streisand, Jeff Bridges, Lauren Bacall | See full cast and crew »"],
      "reviews": [
         "This was the third film directed and starring Barbara Streisand. It did get a whopping big two Oscar nominations for the best song and for best supporting actress (Lauren Bacall). Neither won. Ms Streisand hit the Oscar gold with best actress for FUNNY GIRL, and since then has met with indifferent success - and almost none with her three directed films. This film is a modern spin on Hans Christian Anderson's tale of the Ugly Duckling. She is the \"homely\" daughter of Lauren Bacall, a beauty specialist, and her younger sister Mimi Rogers is also beautiful to look at. But Mimi has had two unsuccessful marriages, and is seen at the start having her third marriage - this time to Pierce Brosnan, who initially showed an interest in Streisand. Throughout her entire life she has been having a low esteem problem regarding sex. She is seen breaking dates with Austin Pendleton. We learn her closest friend is Brenda Vaccaro, who has also failed to do well with men. Yet she is a highly articulate and intelligent English professor at Columbia University. It is Columbia University where the other part of this equation is found. Jeff Bridges is a leading figure in the math department. He is finding it difficult to recover from repeated failed sexual relationships. So he puts an add in the newspaper requesting to meet a suitable mate. Mimi Rogers notices the ad, and puts in a response for Streisand. After watching Streisand handle her English class (far better than Bridges can handle his calculus course), he calls her up and sets up a date. Bridges has worked out a perfect solution for his sexual failures. He will marry a woman he can be chummy with, who is intelligent, and who will not require a sexual relationship (and who is so plain looking as not to invite his own sexual responses). Streisand follows this, not knowing to be insulted or to go along. Finally she agrees to go along with it, and they get married. But can they maintain this palsy-walsy pseudo-marriage, or it doomed? Bacall gave a terrific performance as an apparently bitchy woman, who likes to show up her younger daughter (even at the latter's wedding), but who turns out to be more caring and wise than we first suspected. Brosnan gives a good performance, but it could have used a few filler scenes to broaden his character's history (we don't know how he and Streisand first met, nor how Rogers stole him away). Bridges is wonderful as a variant on the absent minded professor, who can't see the trees for the forest he wishes to plant. George Segal (who co-starred with Streisand in THE OWL AND THE PUSSYCAT two decades earlier) is good as Bridges' friend who sees too clearly how wrong-headed the experiment is. Rogers does well as a nymphomaniac who does not mind marriage as a badge of sexual success, but cannot stand the actual reason for that institution. In the end Streisand does triumph - and she does hear Puccini in her ecstasy (TURANDOT by the way). You see, you are supposed to \"hear\" great romantic music - especially Puccini - when achieving sexual climax. The film's title is a reminder of the whole issue of surface appearance that bedevils Streisand's ugly duckling (and several other characters too). It is a reminder of dressing up for dating, of looking attractive to men, and of the fact that we face ourselves in the mirror - and so do we face ourselves honestly or lying to ourselves? But watch carefully - in many scenes Streisand will shoot the scene from the point of view of the mirror. It becomes an all encompassing theme in this wonderful film.",
         "Let me just say that despite mixed reviews and public jesting, if it weren't Barbra Streisand that made this movie and it were someone else, no one would make fun of it like they do. Everyone just likes to pick on Barbra. But this movie is actually good! This film, about a man (Jeff Bridges) who goes looking for a nonsexual relationship and finds it with a middle-aged dateless professor (Barbra Streisand). As the two leads, these actors shine immensely! Mimi Rogers and Brenda Vaccaro are equally good in their supporting and often comic roles, as is George Segal. But the star of this movie, I must say, is Lauren Bacall as Streisand's beautifully aging mother. Bacall, who is not really known for her comedy roles, took the role and ran with it, making her character hilarious at times, heart-pouring at others. She is terrific! As for the actual storyline of the movie, it is somewhat predictable in its final outcome, but the routes it takes along the way are always interesting. The music is terrific; who doesn't like Luciano Pavarotti's \"Nessun Dorma\"? A very delightful romantic comedy!",
         "The mirror has two faces: Barbra Streisand and ... surprise! ... Barbra Streisand! More explicit: the funny Barbra Streisand and the divine Barbra Streisand. Well, this miraculous metamorphosis is of course kind of disgusting and I wouldn't be the first person to argue that Barbra Streisand has a tendency to fancy herself pretty much (and I myself was already able to tell so from the unnecessarily long ending of \"The Prince of Tides\" - a very good movie). But as annoying as it may sometimes be, this is an extremely well-done and multi-faceted movie. Let me try to tell you, why I voted \"7\". It starts rather mediocre when Streisand and Jeff Bridges get to know each other, talk some silly stuff and behave like little children. From time to time it gives a number of very good lines to Lauren Bacall, who is perfect as Streisand's mother. By the time Streisand and Bridges get married you are tempted to say: \"Yes, very nice, but it's crap actually, isn't it?\" But you won't think of saying that in the end. The movie is a romantic comedy - containing a couple of cliches, fine - but with a new, non-cliche structure. This is no kitsch, not at all, oh no! Instead, it's made up of very good lines and very truthful moments. These are connected in a way that makes our emotion rise but leaves us unable to tell which words, which gestures made it rise. How come? The romance doesn't develop in the way we would expect it and have seen it many times before, no, this romantic comedy goes the long way round: First there is only a small deal of attraction, then there is previously unknown disillusionment - a black hole almost - and then love enters the stage. The final romantic scene fits into romantic comedy conventions, but it also fits into the picture and Streisand and Bridges deserve it. What a wonderful movie! Basically Barbra Streisand is a good actress, but she loves exaggerating. She is able to manage difficult scenes, but she tries to be funny where being funny can't work and sometimes she's just hopping through the scene like a twittering sparrow instead of performing the emotions required for that scene. And after her metamorphosis she's more interested in her make-up than in her character. Lauren Bacall plays a mean, self-addicted and vain old beast with a heart and a vulnerable soul. The scene where mother and daughter talk openly in the kitchen is wonderful. Even Pierce Brosnan is better than I would have expected. Finally, the movie shows us the great versatility of Jeff Bridges: you've never seen him so very soft before (rude as he was in \"The Fabulous Baker Boys\", cool in \"Nadine\" or smooth and evil in \"Jagged Edge\"). However, he is exaggerating, too: which man can act this untruthful and affected?! In the scenes from Streisand's and his marriage his character is almost eerie - may this be good or bad for the movie...",
         "The Mirror Has Two Faces is one of Barbra's finest works. In this movie you have two people,(Barbra and Jeff Bridges),who are both weary and skeptical about \"true\" love, but both have different outlooks on it. Barbra is optimistic and hopeful, while Jeff Bridges feels that the only way to make a relationship last is to completely take the sex out of it and have a loving friendship only,(one based strictly on companionship). The movie explores both of the main characters inner fears and inner struggles in a way that, not unless you're not human, you can certainly relate with. For instance: In reality, Barbra's character felt inwardly about herself that she wasn't good enough....wasn't attractive enough. She liked the idea of marrying Jeff Bridges character under the premise of strictly a loving companionship only because her character feels...well, my goodness! Here's a really handsome man that really likes me and likes being with me. He wants to take sex out of the equation, but...that's okay. It's NOT what I really want, but I'll \"SETTLE\". On the other hand, Jeff Bridges character, Gregory, feels that with all his failed relationships of the past, that if he takes sex out of the picture, that maybe, just maybe, it'll last. He wants a true, loving, one on one relationship with another woman but he really doesn't want to have it be without physical love either. But...out of fear that it wont last, he decides that he's got to take the physical part out of it, even though deep down inside, he doesn't really want that. So...he \"SETTLES\" as well. In reality, they have both truly fallen in love with each other, but both are trying to abide by what they both agreed to; a loving friendship only, with absolutely no physical love. This creates many, many tense situations between them that end up creating very funny scenes and lines. Theres a scene right after they get married and the two of them are in their home, all done for the day unpacking and getting settled. Jeff Bridge's character says to Barbra's...\"So! What do you want to do now?\" Barbra, innocently meaning to suggest they both go to sleep, shrugs her shoulders and says...\"Go to bed\". Jeff's eyes get all nervous looking and he starts having difficulty breathing. Barbra's character replies...\"No! I mean, to sleep, that is! One goes to bed...to sleep!\" A little later on she is unloading all this frustration and tension to her sister Claire in a phone conversation. She says...\"I don't know how to ask for it Claire!\" Meaning sex. She continues to say...\"Sometimes we're so \"polite\" to each other I feel like we're two roommates living in a charm school!\" Her sister replies...\"Just give him a \"look\" that makes him \"know\" you want sex!\" Barbra's character then replies...\"I tried that once. He thought I had something in my eye!\" Yes indeed, there are many great moments in this film. In the end, what's great is that both of the characters understand that what they did was \"settle\", and \"settling\", especially with something as important as true love is never a good idea. But more importantly, they learn that in the end, anything truly worthwhile, sometimes you have to take risks for. Unless you are really that jaded, you can not leave this movie by it's end without feeling,(even if just a little),good! The supporting cast is great, including Lauren Bacall, Brenda Vacaro and George Segal. A wonderful film. Truly one of Barbra's finest.",
         "I know other people think highly of Streisand's skills as a singer and an actress, and I understand their reasons for feeling that way. In fact, I agree she was excellent in \"Hello Dolly\", \"What's Up, Doc?\" and \"Funny Girl\", I agree that she can belt out a Broadway show tune with the best of them, and I agree that she has enormous charisma. But I am not a member of the Streisand-As-Diva Fan Club. As great as her talents are, her taste sucks, and she consistently overestimates and overreaches her talents in pursuit of really cheesy and juvenile self gratification. So we get misfires like \"Yentl\" (which Isaac Bashevis Singer hated), and we also get bloated exercises in ego,like her remake of \"A Star Is Born\", \"The Prince Of Tides\", \"Nuts\", and this piece of fish-wrap. The problem with this movie isn't in her performance, which is good in the service of the script. The problem is in the writing, and it's the same problem with every other recent Streisand film: she wants to be viewed as some kind of beauty queen and sexual powerhouse, and apparently she also wants to be seen as 20-30 years younger than she actually is. But with her face and features, that just isn't going to happen. Well, if your definition of sexual powerhouse includes overwhelming belief in and seriousness about your talents (ie, Diva-like self-importance), maybe she could skate by there. But no one will ever include her in a Playboy calendar or a Sports Illustrated Swimsuit issue. Accept it, Barbra, and move on. But the goldarn movie just won't let it rest. In every scene, even the ones where Streisand is supposed to be a dowdy ugly duckling, her skin is perfect, her makeup is perfect, the lighting on her is perfect, and her every line and delivery is calculated to frame her in the most sympathetic and flattering way possible. In every scene she's in (and Streisand is front and center 90% of the time), Streisand the director is shoving herself in the viewers' face, saying \"Aren't I sexy? Aren't I precious? Aren't I actually the most winsome, lovable, attractive young thing you ever saw, even if the script says I can't get a man - yet?' As Joe Queenan puts it, her entire 'transformation' from ugly duckling to desirable goddess \"consists of losing six ounces, getting a frizzy poodle haircut, and buying a cheap dress.\" She looks exactly the same as before, only now Jeff Bridges' character is supposed to be stunned by her desirability and beg to take her back. And let's face it, even in the persona of a nerd math professor, Jeff is still one of the sexiest leading men of the last two decades. So this is about on the same level as me fantasizing about Dominique Swain begging me to take her back after I buy some new suits and lose an inch off my waist on a low carb diet. And in response to Jeff begging to get back together, Streisand the director has Streisand the actress deliver an \"I desired you once, but now I've moved beyond you\" oration that is a patent by-the-numbers REVENGE fantasy put down; it's the speech composed in the fantasies of any girl who was ever dumped by any boy in the history of romance. Hell, it's not a speech, it's a bumper sticker. And it is delivered with such relish that you can literally see Barbra getting her own back from every unhappy romance or unrequited longing she ever felt. It is completely self indulgent and has a stale musty aura of intellectual and emotional self-diddling. IMO, this is supposed to be the emotional climax of the film, but it's got the maturity of an old \"Virginia Slims\" commercial. On the positive side, this is an 'A' level production, with great sets and costumes, good performances from Lauren Bacall and Mimi Rogers, and even a few funny lines. And Barbra sounds great on the sound track singing the title piece. Note to Barbra Streisand: You are one of the most admired and respected singers and actresses in the world. You have millions of dollars and unlimited license to undertake any recording project you want. You even look pretty good in a middle-aged-dynamic-businesswoman kind of way. You've won. Please, please, stop scoring easy points in self-indulgent movie fantasies about how gorgeous and young you are.",
         "This film is my favorite film because I love Barbra's talent and charisma! The film has major heavy hitters. I knew everyone in the cast! Even Lauren Bacall was in this ! I thought Babs looked better at the beginning than in the end. I couldn't function through the week if I didn't see this film ! I ain't kidding. The movies beginning got off to a good start and continued to develop interest. I recommend this film to anyone who is a fan of Babs and hasn't seen it. Even though the critics hated the film it still was fun and sort of like Cinderella in ways. Great Soundtrack! Lots of great moments and see it around Thanksgiving time, I did and I loved it 10/10",
         "OK. If you accept this movie for what it is, it's actually pretty entertaining. It's a Cinderella story for middle-aged folks. I won't recap the film. That's not my job. I'm here only to give you my impressions on the watchability and impact of this movie. If you love Barbra Streisand (and I do) and you love Jeff Bridges (and I do), you will love this romantic comedy. Both are at their funny, witty, comedic best in this film. Mimi Rogers is gorgeous as Bab's sister. (Oddly, Netflix has her mistakenly identified as Fran Drescher on its website.) Lauren Bacall is stunningly beautiful - still. Overall, the film has a lot of heart. What I love about Streisand is that she knows her weaknesses and her strengths, and plays both up to much effect in this film, which she directed and, I believe, co-wrote. This is a quintessential \"chick flick,\" the kind you enjoy on a raining Sunday night with a big bowl of popcorn. If you are in just the right mood for a film that shamelessly exploits your feelings about romance, this one is it. Enjoy.",
         "For all those people out there who are thinking 'how could a movie directed by and starring Barbra Streisand be good?' please leave your preconceptions at the door! This film, in my opinion, is a thoroughly enjoyable and delightful romantic comedy. Babs stars as Rose, a Professor of Literature at Columbia University in New York who is basically, desperate and dateless. Jeff Bridges (in a humorous and charming performance) plays Professor Gregory Larkin, a man who is constantly losing his mind over unobtainable women. In his frustration and belief that \"sexual attraction ruins all relationships\", he decides to place an ad in the paper for a female companion, \"appearance unimportant\". When Rose's sister (Mimi Rogers) answers the ad on her behalf, the 2 begin a relationship that eventually reveals what love is really all about. This film is funny, moving and romantic. My husband really doesn't really enjoy it, which could indicate the average male's perspective, but I'd highly recommend it for someone looking for a soppy night in!",
         "\"The Mirror Has Two Faces\" is, actually, a great romantic comedy. It counts with all the elements of a successful one. It has a sympathetic main character(Barbra Streisand's Rose), a charming good looking man that falls in love with her (Jeff Bridges) and a great supporting cast(including an Oscar deserving performance from Lauren Bacall). But it's main problem is that it is directed by Barbra Streisand. Those who are familiarized with Streisand's previous work (Yentl, The prince of tides) will agree that she loves to be the center of her movies, and she hurts her films by making this, and \"The mirror has two faces \" is not the exception. The story centers on Rose Morgan(Barbra Streisand), a literature teacher in Columbia's University, and on Gregory Larkin(Jeff Bridges), a math teacher on the same university. Gregory looks for a relationship based on mutual respect and not in physical attraction, and Rose looks for any relationship with an average good looking man. So when Rose's sister joins them by answering an internet advertisement put by Gregory, they begin to date and the even get married, without having any physical contact. But when Rose looks for it, Gregory argues with her and she decides to go to her home with her mother(Lauren Bacall). Until this point of the film, Streisand looks at her character(Rose) with objectivity, never making of her a very desirable good looking woman. But in the second half of the film she works in her characteristic self absorbing way. Rose decides, thanks to her mother's advise, to change her appearance. So, she begins to do some exercise, to wear make up and very elegant clothes, and to eat less. But when Gregory looks at her, he only criticizes her and she goes from home telling him that she doesn't love him anymore. At the end, Gregory realizes that he loves Rose, and they both end up together in a very romantic closing scene. Many people, specially critics, hated the movie arguing that it was another vanity project made by Sterisand, but it much more than that. \"The mirror has two faces\" is a serious analysis to the relationships and how the physical and intellectual part influences them. It is true that the movie would work better if Sterisand had chosen another woman to play her character, but at the end the result is a satisfying movie with great performances and a good story.",
         "I don't understand the meaning of the title, although the leading actress did look in the mirror quite a bit, anyway, what appealed to me about seeing this film was a good cast, and the fact that produced and directed by Barbra Streisand. Basically college professor Gregory Larkin (Jeff Bridges) has been let down with sexual relationships many times, and places a personal advert to find a woman companion, only condition a good knowledge of something, and he has no care of looks and (although they wouldn't know) no sex appeal or interest. Then he meets plain English literature professor Rose Morgan (Golden Globe nominated Streisand), after her sister Claire (Mimi Rogers) answers the personal ad. For a long while it seems they both have the same opinions of how sex and true love can complicate a good relationship, and they eventually marry not for true love or sex, but just a good companionship. Of course Rose is getting very bored, and starts to get desperate for sex, and even though Gregory might be the same (slightly) he backs away from the opportunity. For a while, they split and she tries her chances with a man she once loved (and probably vice versa) before he married Claire, Alex (Pierce Brosnan). When that doesn't work she decides to change her image to be more appealing to herself and others, of course when Gregory sees he is quite shocked, but don't worry, he sees he has true feeling for her as well. Also starring Golden Globe winning, and Oscar and BAFTA nominated Lauren Bacall as Hannah Morgan, George Segal as Henry Fine, Brenda Vaccaro as Doris, Austin Pendleton as Barry and Elle Macpherson as Candice. There are a couple of giggly moments, and the cast of a few good stars kept me interested, but it did have its many moments of pure cheesiness, but still worth watching. The Oscar and Golden Globe nominated song \"I Finally Found Someone\" by Streisand and Bryan Adams in the end credits is good, if only Streisand and Bridges weren't doing a long dance in the streets. It was nominated the Golden Globe for Best Original Score for Marvin Hamlisch. Worth watching!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Phoenix Pictures",
         "Barwood Films"
      ],
      "summaries": [
         "Rose and Gregory, both Columbia University professors meet when Rose's sister answers Gregory's \"personals\" ad. Several times burned, the handsome-but-boring Gregory believes that sex has ruined his life, and has deliberately set out to find and marry a woman with absolutely no sex appeal. Greg thinks he's found what he's looking for in Rose, a plain, plump English Lit professor who can't compete with her gorgeous mother and sister. More out of mutual admiration and respect than love, Greg and Rose marry. Greg assumes that Rose understands that he is not interested in a sexual relationship. He's mistaken, and their marriage is nearly destroyed when Rose tries to consummate their relationship. While Gregory is out of the country on a lecture tour, Rose diets and exercises to transform herself into a sexy siren in a last-ditch attempt to save her marriage.",
         "Boring math professor Gregory Larkin comes completely unhinged by any thought of sex. He sets out to build a relationship with homely literature professor Rose Morgan based on a more intellectual level. They marry, but she misses the sex. While he is away on a lecture tour, she diets, exercises, and has a makeover, but that still doesn't solve all their problems.",
         "Relationship between two Columbia professors with frustrating personal lives for different reasons. Jeff Bridges searching for an ideal marriage and Barbara Straisand plays a woman no one finds attractive. Problems soon arise after a marriage without sex and get worse when she is transformed from an ugly duckling into a swan through diet, exercise and a make over."
      ],
      "budget": 42000000
   },
   "movielensId": 1353,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-15",
      "dvdReleaseDate": "1998-01-20",
      "directors": ["Barbra Streisand"],
      "runtime": 126,
      "movieId": 1353,
      "title": "The Mirror Has Two Faces",
      "mpaa": "PG-13",
      "actors": [
         "Barbra Streisand",
         "Jeff Bridges",
         "Lauren Bacall",
         "George Segal",
         "Mimi Rogers",
         "Pierce Brosnan",
         "Brenda Vaccaro",
         "Elle Mcpherson"
      ],
      "imdbMovieId": "0117057",
      "originalTitle": "The Mirror Has Two Faces",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["_QHkdKZtG_o"],
      "plotSummary": "Rose Morgan (Barbara Streisand), who still lives with her mother (Lauren Bacall), is a professor of Romantic Literature who desperately longs for passion in her life. Gregory Larkin (Jeff Bridges), a mathematics professor, has been burned by passionate relationships and longs for a sexless union based on friendship and respect.",
      "tmdbMovieId": 25189,
      "avgRating": 3.19505,
      "releaseYear": "1996",
      "numRatings": 2302,
      "posterPath": "/8Cgmt9otEhoIlW6p5pLfCWjf4Io.jpg"
   }
}