{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "expensive restaurant",
            "id": 996
         },
         {
            "name": "night watchman",
            "id": 1406
         },
         {
            "name": "law",
            "id": 3703
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "best friend",
            "id": 12392
         }
      ],
      "imdb_id": "tt0119791",
      "video": false,
      "title": "Nightwatch",
      "recommendations": [
         10212,
         12590,
         11229,
         9827,
         12520,
         2637,
         20481,
         8973,
         6498,
         10668,
         11377,
         9945,
         10155,
         32166,
         11601,
         25983,
         20794,
         11980,
         1073,
         10029
      ],
      "backdrop_path": "/xFCEzlNRLrmPMVlpy7jBm4ILNPB.jpg",
      "revenue": 1179002,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Martin Bells",
               "gender": 2,
               "credit_id": "52fe4341c3a36847f8046497",
               "name": "Ewan McGregor",
               "profile_path": "/aEmyadfRXTmmR7UW7OXsm5a6smS.jpg",
               "id": 3061,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Katherine",
               "gender": 1,
               "credit_id": "52fe4341c3a36847f804649b",
               "name": "Patricia Arquette",
               "profile_path": "/9Sz0M91CHHkJ5tlPteiXv34gpgK.jpg",
               "id": 4687,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Inspector Thomas Albert Cray",
               "gender": 2,
               "credit_id": "52fe4341c3a36847f804649f",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "James Gallman",
               "gender": 2,
               "credit_id": "52fe4341c3a36847f80464a3",
               "name": "Josh Brolin",
               "profile_path": "/x8KKnvHyPvH16M6waAnY1OeCtA8.jpg",
               "id": 16851,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4341c3a36847f80464a7",
               "name": "Lauren Graham",
               "profile_path": "/fnNv7OCvO7ySSh1Bf5xNAn5mXGC.jpg",
               "id": 16858,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Duty Doctor",
               "gender": 2,
               "credit_id": "5412add3c3a3682f62000d08",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Joyce",
               "gender": 1,
               "credit_id": "5412ade60e0a267317000d50",
               "name": "Alix Koromzay",
               "profile_path": "/jMw17aRHTiDkzLINQ7w5lpKoPQr.jpg",
               "id": 14707,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Johnson",
               "gender": 2,
               "credit_id": "5412adf7c3a3682f62000d0e",
               "name": "Lonny Chapman",
               "profile_path": "/pEhqjNb17zbPavYrY49gVhOis4E.jpg",
               "id": 95598,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Pub Thug",
               "gender": 2,
               "credit_id": "5412ae0d0e0a26730a000d69",
               "name": "Robert LaSardo",
               "profile_path": "/wyV4nxnRJFtVTkaZ4Cq8eoMV63Y.jpg",
               "id": 65831,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Bill Davis",
               "gender": 2,
               "credit_id": "5412ae260e0a26730a000d6b",
               "name": "John C. Reilly",
               "profile_path": "/3LpfXon9xQZc1M2AFvfXyLeICbg.jpg",
               "id": 4764,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4341c3a36847f804648d",
               "name": "Ole Bornedal",
               "profile_path": "/7PZZHKAycQhPBsewBFUgkKFOH6Z.jpg",
               "id": 22676,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4341c3a36847f8046493",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5633e9099251414ab7013e52",
               "name": "Dan Laustsen",
               "profile_path": "/qh6PEA5kW0Cl5k4LkGgDEnaGNYD.jpg",
               "id": 40268,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5633e918c3a3681b4b0148f7",
               "name": "Joachim Holbek",
               "profile_path": null,
               "id": 1637,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5633e932925141284c015de9",
               "name": "Sally Menke",
               "profile_path": "/8cUdiGU7KhBgd8UNnoUYNCMZYgQ.jpg",
               "id": 156,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5633e9419251414ab7013e57",
               "name": "Louise Mingenbach",
               "profile_path": null,
               "id": 9043,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5633e953c3a3681b52015a3f",
               "name": "Richard Hoover",
               "profile_path": null,
               "id": 10365,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5633e97c9251416167007b30",
               "name": "John Houlihan",
               "profile_path": null,
               "id": 1471726,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5633e9f4c3a3681b4d017d3f",
               "name": "Cary Granat",
               "profile_path": null,
               "id": 62598,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5633ea02c3a3681b4b014903",
               "name": "Bob Weinstein",
               "profile_path": "/hheuMcH8MnFGmatPvhdLUNnSOwm.jpg",
               "id": 1307,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5633ea0e9251413b46008227",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5633ea29c3a3681b52015a4a",
               "name": "Michael Obel",
               "profile_path": "/u5E65aYdQb4wa3BNI5aUeLLcEyh.jpg",
               "id": 50091,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5633ea54c3a3681b54016324",
               "name": "Ole Bornedal",
               "profile_path": "/7PZZHKAycQhPBsewBFUgkKFOH6Z.jpg",
               "id": 22676,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5633ea7b9251416167007b3c",
               "name": "Richard Pagano",
               "profile_path": null,
               "id": 2624,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5633ed26925141284c015e2b",
               "name": "Brian Kasch",
               "profile_path": null,
               "id": 227198,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5633ed529251416167007b7c",
               "name": "Cliff Cudney",
               "profile_path": null,
               "id": 1437861,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 10.410538,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2212,
      "vote_count": 138,
      "budget": 0,
      "overview": "A law student, who takes a job as a night watchman at a morgue, begins to discover clues that implicate him as the suspect of a series of murders.",
      "similar": [
         75780,
         1939,
         1923,
         357096,
         11423,
         12150,
         1586,
         4771,
         949,
         807,
         22307,
         984,
         25376,
         21484,
         9411,
         6973,
         10651,
         9631,
         2275,
         9424
      ],
      "original_title": "Nightwatch",
      "runtime": 102,
      "poster_path": "/sI3moXaWI1ZVFR4oJ1Hp3TWSShh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Michael Obel Productions",
            "id": 1011,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-31",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ole Bornedal"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Ole Bornedal",
         "Ole Bornedal"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119791/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxOTQ5MTM4NF5BMl5BanBnXkFtZTcwMjM0MTQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ewan McGregor, Nick Nolte, Patricia Arquette | See full cast and crew »"],
      "reviews": [
         "This one of those little movies that never got much in the line of studio promotion or advertising budget. You might have seen it, single copy on the bottom of the Video Rental Shelf. You probably passed it by, assuming it was some 'straight to video' D-Grade Horror, or maybe some embarrassing first film of Ewan McGregors being resurrected to cash in on his new fame? If you love creepy suspense thrillers than I bet you will be as surprised as i was. ITS GOOD! I might have a psychological bias since I have worked in a morgue, but the cold wet atmosphere, chilling lighting and downright suspense had me creeped out and twitching all the way through. Ewan McGregor is solid as always and a fantastic sympathetic character if there ever was one. I really have to say something about Josh Brolin here - what a great performance. A scene between him and Alix Koromzay (Joyce) was one of those amazing little scenes you cant forget! Let me also say something about Nick Nolte in this - FREAKY. Some might find his character 'too predictable' but I don't think you need to worry about finding out 'who done it' either, you just cringe and chill at how bloody creepy Nolte is! Yes, this is somewhat campy and occasionally wry and I loved it - Brad Dourif makes something of a 'Cameo' (not really but with him it feels like it heh) and you gotta smile at that. It doesn't abuse the tongue in cheekiness though.. It really does take itself just seriously enough to win. European to American Remakes often fall short but this time the same Director made both and well done! Direction was absolutely perfect for me and I found it clever enough and creepy enough to give it a very solid Seven out of Ten. Definitely one of those 'Under-rated but surprisingly good!' movies and its a shame most people never saw it come and go!",
         "Student Ewan McGregor gets himself a part time job in a morgue, he presumes this will give him some quiet time as he studies for his degree. However, in this morgue the dead don't rest easy- it would appear that a serial killer who also indulges in necrophilia is making occasional visits. Could this just be paranoia on McGregor's part? It would appear not as he soon becomes chief suspect... This promising premise is let down, in part, through the unsure direction of Ole Bornedal. The film begins in a vein not dissimilar to that of Se7en and seems to be setting up for a serial killer/thriller style. This soon changes to an approach more suited to teen slashers and then switches to a horror style before seeming to flick between them at will. This mix doesn't gel well at all and leaves the film feeling a little lost at times. Josh Brolin who plays Ewan McGregor's friend in the film plays a character you feel like you have seen a hundred times before in teen slashers: plays by his own rules, pretty unlikeable but has his good side and you have your suspicions about him by the first scene. Ewan McGregor gets the paranoia spot on but is by and large quite forgettable, the same could be aimed at Patricia Arquette. For its faults, there is still enough on offer to merit a watch. The scenes which take a more horror style approach work very well in the morgue and do give quite a tense atmosphere at times. Also, Nick Nolte turns in an eye-catching and enjoyable performance despite playing a role which you feel he could do in his sleep (he's playing a gruff detective). And Brad Dourif is perfectly cast as the creepy duty doctor, his knowing performance raises a smile. The film has enough to keep you watching to its conclusion but will leave you disappointed at not being able to fully deliver on what could've been a very affecting thriller.",
         "It´s a pretty long time ago since I have seen Ole Bornedal´s original from 1994, so I can´t remember several details, but I think he has done good work with his remake: the atmosphere is creepy and nightmarish, the cast featuring Ewan McGregor, Patricia Arquette, Josh Brolin and especially Nick Nolte does a solid job. My favorite performances however come from two supporting actors: the one is Brad Dourif playing a weird autopsy doctor, the other is the uncredited John C. Reilly, who is still one of the most underrated great actors in my opinion! All in all director Ole Bornedal has made a well done remake, which is probably no revolutionary film , but in comparison to Gus Van Sant´s awful \"Psycho\"-rip off a real masterpiece!!!",
         "BRILLIANT, CHILLING, & INTRIGUING! It is always a pleasure to watch Ewan McGregor work, as he fully immerses himself into his roles-truly becoming the character he plays. I can honestly say this is the first film in a LONG time that, well it scared the crap out of me. Amazingly written, cast, and filmed, I felt it achieved an ingenious atmosphere similar to that in Stanley Kubrick's The Shining, which is imperative to the effect of a good suspense/thriller/horror film. One of my definite favourites, in case you couldn't tell =).",
         "***SPOILERS*** Nick Nolte for all intents and purposes looking like Boris Karloff as the Frankenstein monster but without the use of makeup is police inspector Thomas Cray who's in charge of a special police task force trying to find and capture, dead or alive, a serial killer. The killer for some weird reason has a habit of cutting out the eyes of his dead victims, all women, and then raping their corpses. It seems that the killer wants to quit the business of serial killing but at the same time wants the police and the law to leave him alone and stop hunting him down so he can enjoy his retirement. This sets up the story for young law student Martin Bell, Ewan McGeror, who just got a job at the local medical examiner building as a night watchman where all the recent murder victims of the killers are kept. The killer plans to frame young Martin as can then be free from being tracked down and arrested for the crimes that Martin will be jailed for. \"Nightwatch\" has it's share of cheap thrills and a number of twists and turns in it's story but their very unconvincing in how the killer, who you can spot almost as soon as you see him, is so hard for the police to find when his actions are so insane and weird just like those of the murderer. The film-makers put two people into roles that would make you think that their the real killer of the people in the movie. One is so obvious that you just know that he didn't do it and is just a red herring put into the movie to get you and the police off the track of the real killer. There's also a fact that he, the killer, once worked in the medical examiner's office some time ago and was dismissed for messing around with the corpses. All that is in the medical examiners record department which should have been a dead give away to everyone involved just too who he really is. There's also some scenes in the movie that focus on a photo of Lewis Paine, thats pinned to the wall in the night watchman's office one of the people executed for the murder of President Abraham Lincoln in 1865. This seems to indicate to the audience that he, or his ghost, may have something to do with the killings but in the end nothing ever comes of it and he's completely forgotten well before the movie is over. There's also a very mixed-up sub-plot in the movie between Martin's friend James, Josh Brolin, and a hooker he picked up at the local bus station Joyce, Alix Koromzay,who he's trying to get Martin to have an affair with her. This moronic attempt by James is to give him a high since it seems that the normal high he used to get with women by having sex is no longer there and even having the hell beat out of him to get high doesn't work either. Joyce's relations with Martin, which are almost next to nothing, has his girlfriend Kathy, Pat Arquette, leave him and in the end. Sure enough Joyce ends up being a victim of the on the loose serial killer and Martin, becomes the prime suspect just like the killer wanted in the crime. The ending of \"Nightwatch\" had the usual damsel as well as good guy both in distress with the crazed killer having them both tied down on a table in the mortuary and about to cut both their skulls open with an electric slicer. It's then when the person who was made to look like the killer during the entire movie coming to their rescue, minus a thumb, blasting the real killer away and sending him to his just reward. \"Nightwatch\" is a watchable horror/suspense movie but it's hard to take seriously at all due it it's very predictable and unconvincing story and the killer is so obvious that you can easily spot him well before the movie reveals his true identity.",
         "College student Martin Bells (Ewan McGregor) is hopefully to make some money for himself by taking a job at the old city morgue. Which Martin thinks it's easy money until his graveyard shift turned into something else. A mysterious serial killer is been murdering unsuspected prostitutes but before he murders them... he makes them play dead. Now this murderer is been stalking Martin on his night shifts by playing sick mind games with the dead corpses. Directed by Ole Bornedal made an predictable but fairly intriguing suspense-thriller. Which Bornedal remade his own film \"Nattevagten\" for Dimension Films. McGregor's American accent comes and goes but he is surrounded by a sharp supporting cast like Patricia Arquette as his worried girlfriend, Josh Brolin as Martin's daredevil buddy, Brad Dourif as a doctor and Nick Notle as a police detective. \"Nightwatch\" was set to release in the fall of 1996 but released instead limited in the spring of 1998. Which the film critics were not kind to it, since the identity of the villain was too easy to guess but the movie is oddly irresistible thanks to some suspense, Bornedal's stylish creepy mood and some light touches of humour. The look on McGregor's face, when his buddy scares him nearly to death in the morgue is priceless. Despite all it's flaws, this is worth a look. Written by the director and Oscar-Winner Steven Soderbergh (The Ocean Trilogy, Erin Brockovich, Solaris \"2002\"). John C. Reilly appears uncredited. Super 35. (*** 1/2 out of *****).",
         "this is a fine piece of suspense-horror movie making. nick nolte was superb as the deranged necrophiliac killer.Ewan McGregor was good but his accent was terrible, as the law student. josh brolin turning in a good performance as his wise-cracking friend. as always Patricia arquette mesmerising us on screen with her good-looks and soft-tinged voice. maybe these aren't all Oscar-winning performances. but this movie is one of the few able to pull of a momentum that speeds up all the way through right to the end when it gives us the feeling of stopping still and confronting the evil after one hell of a thrill ride. let your hair down, grab a cushion or a cup of tea, & settle into one and a half hours of nail-biting(sometimes funny) suspense-filled horror. also brad dourif and john.c.Reilly turn in sum good acting to. as they always do of course.",
         "Ewan McGregor plays a law student who takes a job as a night watchman at a morgue. He begins to discover clues that implicate him as the suspect of a serial of murders. The setting in this movie was really perfect, i really liked it , it had great atmosphere from start to end and worked really well with the the creepy scenes, they also added some humour into this movie, which i really liked. The deaths were not gory or bloody as this is more of a drama then your normal slasher movies, (it nothing like Scream or Friday 13th movies at all). The acting from the whole cast was outstanding, A really good movie 8 out of 10",
         "This is an English language remake of the same director's excellent 1994 Danish original. Apart from two rather graphic sex scenes, which appear in the original but are omitted from this version, this follows the original plot scene-for-scene. Even the incidental music is the same. It makes you wonder why they bothered really. The film is just about worth watching, but mainly for comparison purposes with the original. Otherwise, it's distinctly B movie standard. Rating: 5/10",
         "As far as serial- killer films and thrillers are concerned this one's right down there with the worst of 'em. Only \"Copycat\" and \"Sisters\" manage to be more annoying in their absurdity, and only \"Saw\" is worse. And it's a pity because the first hour is genuinely eerie, with a fittingly claustrophobic mortuary as the ideal setting. I am a very jaded viewer, but some of those early mortuary scenes really get under your skin. However, after an hour it all goes downhill, and I mean steeply. The relentlessly stupid plot twists rob you of all patience and the movie just keeps sinking to new lows. All logic is thrown into the wind, and the viewer's intelligence is insulted and pounded upon repeatedly with more force than that baseball bat could ever have generated - the one used by Nolte and McGregor. (I'd be the first to sign up if they were looking for volunteers to take that baseball bat and bash the heads of the writers of this nonsense.) Nothing here adds up. Absolutely nothing. Nolte was molesting corpses decades earlier and the writers of this film would have us believe that this man could years later become the city's chief police investigator! Making him the killer is as absurd as giving Thomas Edison credit for inventing the wheel, as laughable as a conspiracy-theory plot from the \"X-Files\", and as stupid as Kim Basinger's book on how to solve all of world's problems (if she'd ever write one). The very notion that a man - so disturbed that he indulges in necrophilia in mortuaries - would have the sanity, interest, patience, and willingness to climb all the way to chief investigator in a police department only to start a savage murder spree is simply a mind-bogglingly dumb, far-fetched concept to me. And how the hell did he even start with the framing of McGregor? This is an essential piece of the puzzle that is badly missing here; McGregor JUST HAPPENS to get a job where he meets Nolte. And McGregor's best friend, Brolin, JUST HAPPENS to know a prostitute who is Nolte's play toy (and later victim). It can sure be a small, small world in a Hollywood stinker! And to add some silliness, Brolin is some kind of a deranged thrill-seeker who acts like a total lunatic all the time. Obviously, he is the decoy for the viewer; we are meant to treat him as the suspect. But how dumb do they think we are? And how the hell did Brolin get into the mortuary when he carried out his \"practical joke\"? And how the hell did Nolte manage to drag out a body of one of his victims within seconds of McGregor entering the room, without McGregor noticing it (the fact that he had his walkman on and/or was singing and/or talking doesn't make it any more believable)? And what's with this annoying scene where Arquette JUST HAPPENS to walk into the mortuary at exactly the moment when McGregor is hitting Nolte with a baseball bat and predictably starts thinking her boyfriend is the killer??! More annoyances came from the scene in which Brolin's reaction to McGregor's telling him that the latter is been suspected of murder is to laugh! Or the one in which he cuts off his own thumb in order to free himself and save the others. Sure,... why not?? (\"I am being hand-cuffed to this metal pole, and as a result can neither save my friends nor myself... What do I do...? I know!... I'll cut my thumb off! How come I didn't think of that before!?...\") Nolte makes the best out of his role, but due to the bitchingly silly script he appears to be hamming it up too much at the end - but what choice did he have? McGregor is solid, too, apart from his on-and-off accent (which was it now? American or English?)."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Dimension Films",
         "Michael Obel Productions",
         "Thura Film"
      ],
      "summaries": [
         "Ewan McGregor plays a law student who takes a job as a night watchman at a morgue. He begins to discover clues that implicate him as the suspect of a serial of murders.",
         "A law student takes a job as the night-watch in a morgue, thinking that he will have much time to study, with his biggest problem being his paranoia in this scary setting, but in the history of this morgue lies a dark secret: there was once a man raping female corpses, but is history really gone? And who can he really trust? Will he discover truth before it's too late for him and his best friend?"
      ],
      "budget": 0
   },
   "movielensId": 1355,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-31",
      "dvdReleaseDate": "2000-11-14",
      "directors": ["Ole Bornedal"],
      "runtime": 102,
      "movieId": 1355,
      "title": "Nightwatch",
      "mpaa": "R",
      "actors": [
         "Ewan McGregor",
         "Patricia Arquette",
         "Nick Nolte",
         "Josh Brolin",
         "Lauren Graham",
         "Brad Dourif",
         "Alix Koromzay",
         "Lonny Chapman",
         "Robert LaSardo",
         "John C. Reilly"
      ],
      "imdbMovieId": "0119791",
      "originalTitle": "Nightwatch",
      "genres": [
         "Action",
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["U9cKpuOI0m4"],
      "plotSummary": "A law student, who takes a job as a night watchman at a morgue, begins to discover clues that implicate him as the suspect of a series of murders.",
      "tmdbMovieId": 2212,
      "avgRating": 3.09332,
      "releaseYear": "1997",
      "numRatings": 868,
      "posterPath": "/sI3moXaWI1ZVFR4oJ1Hp3TWSShh.jpg"
   }
}