{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "letter",
            "id": 3344
         },
         {
            "name": "jumping",
            "id": 3810
         },
         {
            "name": "child prodigy",
            "id": 5561
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "pianist",
            "id": 14743
         },
         {
            "name": "concert hall",
            "id": 33484
         },
         {
            "name": "breakdown",
            "id": 191815
         },
         {
            "name": "piano",
            "id": 207592
         }
      ],
      "imdb_id": "tt0117631",
      "video": false,
      "title": "Shine",
      "recommendations": [
         10712,
         2075,
         10217,
         26748,
         16619,
         1088,
         11386,
         695,
         12498,
         11382,
         236,
         11426,
         10161,
         874,
         11050,
         10633,
         10337,
         9549,
         10333,
         11450
      ],
      "backdrop_path": "/mLNn3ajWEk1RQGXVD4YfbySCf1T.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "David Helfgott",
               "gender": 2,
               "credit_id": "52fe4487c3a36847f809b367",
               "name": "Geoffrey Rush",
               "profile_path": "/5h91WHSK80YtqTk1bMiar2IZzO2.jpg",
               "id": 118,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "(Young) David Helfgott",
               "gender": 2,
               "credit_id": "52fe4487c3a36847f809b363",
               "name": "Noah Taylor",
               "profile_path": "/dSlH0WA09dVqQhgB7LB5xn8WzD.jpg",
               "id": 1284,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Peter Helfgott",
               "gender": 2,
               "credit_id": "52fe4487c3a36847f809b36b",
               "name": "Armin Mueller-Stahl",
               "profile_path": "/cKdfUl7EuUpBncwvJo2t3hYJPNi.jpg",
               "id": 12647,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tony",
               "gender": 0,
               "credit_id": "52fe4487c3a36847f809b375",
               "name": "Justin Braine",
               "profile_path": null,
               "id": 1192652,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sylvia",
               "gender": 0,
               "credit_id": "52fe4487c3a36847f809b379",
               "name": "Sonia Todd",
               "profile_path": null,
               "id": 1192653,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe4487c3a36847f809b37d",
               "name": "Chris Haywood",
               "profile_path": "/jMVWid44VE90tzmkOBKCWqvT9eW.jpg",
               "id": 3070,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "David Helfgott",
               "gender": 2,
               "credit_id": "52fe4487c3a36847f809b381",
               "name": "Alex Rafalowicz",
               "profile_path": null,
               "id": 79703,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Gillian",
               "gender": 1,
               "credit_id": "5420cd420e0a265d190003fd",
               "name": "Lynn Redgrave",
               "profile_path": "/jnXKuScyfE4zZ5AqBpmrVBMKeVz.jpg",
               "id": 29791,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Katharine Susannah Prichard",
               "gender": 1,
               "credit_id": "5468f8e922136e68da00125f",
               "name": "Googie Withers",
               "profile_path": "/sZdbSMMXmSkHYNKyJdWXCetk3ct.jpg",
               "id": 14306,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Cecil Parkes",
               "gender": 2,
               "credit_id": "5468f8f9eaeb816b580012ce",
               "name": "John Gielgud",
               "profile_path": "/jvTSqk7cuOrsdtf037olQ9BKRAe.jpg",
               "id": 11857,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4487c3a36847f809b371",
               "name": "Scott Hicks",
               "profile_path": "/saA36yAQYyTs0kzmH5hBprEszJX.jpg",
               "id": 33433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5468f90deaeb816b430013d6",
               "name": "Jan Sardi",
               "profile_path": null,
               "id": 67887,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5468f91922136e68d5001364",
               "name": "Scott Hicks",
               "profile_path": "/saA36yAQYyTs0kzmH5hBprEszJX.jpg",
               "id": 33433,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "5499b864c3a3682f1600000d",
               "name": "Jane Scott",
               "profile_path": null,
               "id": 57596,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5499b86d9251413123000015",
               "name": "David Hirschfelder",
               "profile_path": null,
               "id": 37757,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "5499b87e925141311d00001c",
               "name": "Pip Karmel",
               "profile_path": null,
               "id": 33438,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5499b88ac3a3682f21000013",
               "name": "Vicki Niehus",
               "profile_path": null,
               "id": 1403109,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5499b892925141312c000011",
               "name": "Tony Cronin",
               "profile_path": null,
               "id": 586330,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5499b89a925141312c000016",
               "name": "Louise Wakefield",
               "profile_path": null,
               "id": 1403110,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5aabad5f9251413fee00f3f7",
               "name": "Geoffrey Simpson",
               "profile_path": null,
               "id": 52055,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 7.249189,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 7863,
      "vote_count": 187,
      "budget": 0,
      "overview": "Pianist David Helfgott, driven by his father and teachers, has a breakdown. Years later he returns to the piano, to popular if not critical acclaim.",
      "similar": [
         769,
         5915,
         462,
         423,
         11202,
         640,
         396371,
         371638,
         334543,
         318846,
         324786,
         389015,
         407445,
         363676,
         323677,
         228970,
         274479,
         152532,
         300671,
         276907
      ],
      "original_title": "Shine",
      "runtime": 105,
      "poster_path": "/49mQw8exEyuDrEweh7E1AByu37T.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Victoria",
            "id": 11840,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "South Australian Feature Film Company",
            "id": 41999,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Australian Film Finance Corporation",
            "id": 1380,
            "origin_country": "AU"
         }
      ],
      "release_date": "1996-08-15",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "A true story of the mystery of music and the miracle of love",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Scott Hicks"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Jan Sardi",
         "Scott Hicks"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117631/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMzcxMzUyMl5BMl5BanBnXkFtZTgwNDI1MjgxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Geoffrey Rush, Armin Mueller-Stahl, Justin Braine | See full cast and crew »"],
      "reviews": [
         "David is a stuttering, rambling man having suffer a complete breakdown as a young man. However when he was a child his skills on the piano were unmatched. Driven by his father, opportunities open up in front of him to go abroad to learn, but his father denies him the chance. He leaves for London where he drives himself to the point of exhaustion before coming back home to find his father has disowned him. It took me years to finally watch this film. I was still in Northern Ireland when it came out in the cinema and such films were not permitted to cross our borders, lest they keep the latest action movies from our 1 or 2 screen cinemas! So away from the hype and the Oscar hoopla I sat to watch this film and found myself easily taken in by it. The story is the true story of David Helfgott who was a boy genius before his breakdown. The film starts with him as an adult then jumps back to see him as a child. This approach works well to allow us to see the `end result' as it were, before we see what would be considered the causation factors. These factors are a little heart breaking to watch but they are very well delivered. As an adult, David is comic, warming and tragic. The pain in his life is brought out very well. A great deal of the praise for this must lie with the wonderful cast. Rush got his Oscar of course and I'll leave it to the users on the message boards to argue over whether or not you can be the lead actor with screen time of less than half the film! He is great, walking a difficult line with a `disabled' character but managing not to just make it a caricature at any point. David as a child is very well played by Rafalowicz and does more of the development work than Rush and hence gets less credit than he deserves for making us care for the adult David. Mueller-Stahl is as good as he can be and gives a great performance, the only downside being that he doesn't age a single day between the adult and child sections of the story - surely some makeup could have been used? Overall this is a very enjoyable human story that is driven by several really strong performances in key roles. The story keeps it's tone light but yet still manages to be dramatic and, in some scenes far too touching to avoid being slightly moved. The music is beautiful when it is called on to be and dramatic at other times - the director does very well to make the intense music translate into intense scenes in the film. Overall a simple story of a man but one that is interesting and a lot more moving that I expected it to be.",
         "This movie is definitely in my top five favorite movies of all time. It is unbelievably brilliant. Geoffrey Rush, dare I say, is perhaps the greatest actor of modern times. His performance alone is worth watching, let alone the outstanding supporting cast! Definitely not in typical Hollywood fashion, the movie is a truly great indie film. A must see for music lovers and indie film lovers alike.",
         "This is a good film in every sense but will mean most to fathers with strong views :). The story of a brilliant young pianist whose relationship with his father drives him to some sort of mental illness. Watchable, absorbing, brilliantly edited, deeply seriously moving, one of the rare films that pays attention to incidental sound. Wonderful direction and acting. This is a seriously good film.",
         "I don't now why but when I first viewed this a few years back I did not care for it, but after watching it again I was very impressed. Maybe because I have grown more of an appreciation for classical music in that timeframe. I really don't understand how I could have missed the outstanding portrayal of the nuturing/stultifying father-son relationship, or the moving way that David can only express himself via the piano (notice how he speaks in virtually only apothems). This is a very great film.",
         "This was a very interesting movie and pleasant surprise, although sometimes that theme of the obsessive parent driving a kid crazy gets overworked. Nonetheless, it's a very well-made movie. Geoffrey Rush is fascinating in the lead role as \"David Helfgott.\" However, I would give equal kudos to Noah Taylor, who played Helfgott as a teenager, and to Armin Mueller-Stahl, who was Helfgott's father. They were just as impressive as Rush. This is a supposedly true-life story of child prodigy piano player from Australia. As you can imagine, the music in here is excellent. Even better is the cinematography. Wow, this looks and sounds fantastic on DVD. Although not always pleasant to watch, the story is riveting; hard to put down once you've started watching. The ending turned me off a bit with the overt plug for astrology, but is a happy one for all parties and at least leaves the viewer feeling satisfied. In all, a very intense, beautifully-photographed biography.",
         "SHINE (1996) **** Geoffrey Rush, Noah Taylor, Alex Rafalowicz, Armin Mueller Stahl, Lynn Redgrave, Sir John Gielgud, Googie Withers. Excellent Oscar nominated bio pic about acclaimed Australian pianist virtuoso David Helfgott (played equally brilliant by Rush {deservingly winning the Oscar as Best Actor} as an adult, Taylor as a young man and Rafalowicz as the child prodigy) who suffered mental anguish thru his art largely due to his overbearing father (Mueller Stahl, Best Supporting Actor nominee, in a demanding yet effective role) that led to his nervous breakdown that nearly destroyed him. Poignant and beautifully directed by newcomer Scott Hicks (Best Director nominee), the film never panders, preaches or offers any simple answers yet does depict mental illness earnestly with devestating clarity. Rush gives a bravura performance that deserves a standing ovation. Best sequence: the lead-in to Helfgott's crash as he attempts the monumental musical challenge, Rachmaninoff's Piano Concerto #3, or notoriously known as \"The Rach 3\".",
         "When I originally saw this film in the mid-90's, I was absolutely devastated throughout the first forty-five minutes. So much so, I was pretty much uncontrollably weeping, much to the chagrin of the friend I went with. Time has softened the film a lot for me, but it still remains a powerful, tender and somewhat inspirational film about a piano prodigy who has led a pretty tragic life. Geoffrey Rush is unbelievable as the piano prodigy David Helfgott, and although the film is kind of sewn up a little quickly with the Vanessa Redgrave subplot (what about Helfgott made her so in love with him in a short period of time as to want to marry him?) it is a very well done film that I highly recommend to just about anyone, but especially musicians and music lovers. --Shelly",
         "\"Shine\" purports to tell the story of David Helfgott (Geoffrey Rush, who plays the adult Helfgott), a promising pianist who overcame mental illness, with the help of his wife, and returned to performing. The 1996 film is actually a fictionalized version of Helfgott's life - but even had it not been based on a true story, it remains a powerful, intriguing film. David is the child of German émigrés who now live in Australia. His father Peter (Armin Mueller-Stahl) is a self-taught pianist who teaches David his same love of piano and classical music. There is love there, but as portrayed in the movie, Peter is a rigid man who gives his son mixed signals. He drives his son to succeed as a pianist, teaching him that winning is everything, and yet, when David has opportunities that would take him away from the family, Peter won't permit it. The reason for this is that Peter and his wife lost relatives in the Holocaust. Peter is also given to physical abuse toward David when he loses his temper. David finally gets away from him and attends the Royal Conservatory in London, where, with the help of his teacher (John Gielgud), he wins an important competition but then suffers a severe nervous breakdown. The rest of the movie deals with the road back, which leads him home to Australia and to his wife, Gillian. Gillian is actually his second wife, though the first marriage isn't mentioned in the film. The dominant performances belong to Rush and Mueller-Stahl. Rush does a brilliant job of showing us the likable but stuttering David who speaks rapidly and repetitively, expressing himself through music. Mueller-Stahl as the tortured Peter is fabulous, a man who is both monstrous and pitiable. In a small role, John Gielgud of course makes a fine impression as an elderly teacher, a wonderful pianist himself, who believes in David's talent. The best scene is David playing Rachmaninoff's Piano Concerto #3 - Helfgott's own recording of the piece is used - and the aftermath. What I missed in this film is music - there was a lot of talk about David's promise, but until the Rachmaninoff not much playing. Helfgott's work today has been deeply criticized for being - well, lousy. A review in The New York Times of one of his concerts is horrible. The reviewer, however, mentions that Helfgott occasionally showed vestiges of excellent technique. I think it's safe to assume that his playing nowadays is more erratic than it was in his earlier years. There are several examples of Helfgott's playing in the movie: \"La Campanella,\" \"Hungarian Rhapsody No 2 In C Sharp Minor,\" \"Flight of the Bumble Bee,\" Rachmaninoff's \"Prelude In C Sharp Minor, Opus 3, No. 2,\" the previously mentioned Rachmaninoff 3, and Liszt's \"Sospiro,\" and it is all quite stunning. Rush does the fingerings himself. One of the comments also claims that Helfgott's wife has Helfgott perform on no medication so that he'll seem crazy - it's common for performers on medication for mental problems to have to cycle off of it before performing. I don't think the commenter has any idea what Helfgot is like on his medication - certainly in the film, he acts strangely. \"Shine\" is highly recommended for its fantastic performances, beautiful music, and its inspiring story.",
         "\"Shine\" is a pure joy to behold. Produced in Australia, it tells the true story of piano prodigy David Helfgott. Helfgott suffered a major nervous breakdown on the threshold of an imminently great career. The story shows him through a psychologically trying childhood, to his teenage years when he perfected his skills, to a stay in a mental asylum, and his subsequent return to stardom. Noah Taylor and Geoffrey Rush (in a well-deserved Oscar-winning turn) played Helfgott during his teenage and adult years. Armin Mueller-Stahl is also excellent as the abusive father (in an Oscar-nominated performance). However, the film stalls on several occasions. This is bad considering that the film is only 1 hour and 45 minutes long. Lynn Redgrave's role is terrible, she is totally wrong for this film. \"Shine\" is a prime example of a near miss. The film is very good in almost all aspects, but these problems keep \"Shine\" from being the masterpiece it should have been. 4 out of 5 stars.",
         "SHINE is a compelling and touching story about music, talent, performance, pressure, and redemption. Scott Hicks' masterpiece is difficult to summarise in any traditional review or comment because it touches upon so many facets and ranges of human emotion. It is no surprise that this tale, based 'loosely' on the life of pianist David Helfgott (I say loosely because this is by no means a strict documentary, as many liberties are taken with the script) was nominated for the Best Picture and Best Director Oscars, and were it not for THE English PATIENT, would have walked away with the grand prize. Geoffrey Rush as the adult Helfgott is amazing and his Best Lead Actor victory for his portrayal of this musical genius was well-deserved as the performance was simply breathtaking. A popular complaint is that Rush was only on screen for less than half the run-time of the film and as such should not have really won. The counterargument is such: it is the quality of the performance that counts, not the screen-time. Armin Muller-Stahl is equally impressive and deserved his nomination. My only gripe is that Noah Taylor was not given at least a nod for his portrayal of the younger Helfgott. The writing, cinematography, and musical score are top-notch and transform this Motion Picture from good to great. 8/10. 3.5 stars (out of 4). Should enter my Top 250 at 206. Highly recommended."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Australian Film Finance Corporation (AFFC)",
         "Film Victoria",
         "South Australian Feature Film Company"
      ],
      "summaries": [
         "Based on the true story of Australian pianist David Helfgott, this delightful movie charts the traumatic early years through adulthood. Telling the story in flashback we see David as a child prodigy and as he grows up while his patriarchal father abuses him and his siblings with the memory of his childhood in Europe and the loss of his family in the concentration camps. David finally breaks away from his father and goes away to study overseas, he later suffers a breakdown and returns to Australia and a life in an institution. Many years later he is released and through several twists of fate (in reality even more unlikely than film portrays) he starts playing a piano in a bar before finally returning to the concert hall.",
         "Pianist David Helfgott, driven by his father and teachers, has a breakdown. Years later he returns to the piano, to popular if not critical acclaim."
      ],
      "budget": 5500000
   },
   "movielensId": 1357,
   "movielens": {
      "languages": [
         "English",
         ""
      ],
      "releaseDate": "1996-08-15",
      "dvdReleaseDate": "1997-07-15",
      "directors": ["Scott Hicks"],
      "runtime": 105,
      "movieId": 1357,
      "title": "Shine",
      "mpaa": "PG-13",
      "actors": [
         "Geoffrey Rush",
         "Noah Taylor",
         "Armin Mueller-Stahl",
         "Justin Braine",
         "Sonia Todd",
         "Chris Haywood",
         "Alex Rafalowicz",
         "Lynn Redgrave",
         "Googie Withers",
         "John Gielgud"
      ],
      "imdbMovieId": "0117631",
      "originalTitle": "Shine",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["vTt4Ar6pzO4"],
      "plotSummary": "Pianist David Helfgott, driven by his father and teachers, has a breakdown. Years later he returns to the piano, to popular if not critical acclaim.",
      "tmdbMovieId": 7863,
      "avgRating": 3.85109,
      "releaseYear": "1996",
      "numRatings": 9133,
      "posterPath": "/49mQw8exEyuDrEweh7E1AByu37T.jpg"
   }
}