{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "repair shop",
            "id": 170630
         },
         {
            "name": "southern",
            "id": 170633
         },
         {
            "name": "death threat",
            "id": 170646
         },
         {
            "name": "story",
            "id": 170647
         },
         {
            "name": "religious art",
            "id": 170648
         },
         {
            "name": "father figure",
            "id": 170652
         }
      ],
      "imdb_id": "tt0117666",
      "video": false,
      "title": "Sling Blade",
      "recommendations": [
         903,
         850,
         10223,
         10279,
         9504,
         9749,
         26748,
         10141,
         11386,
         11368,
         9430,
         9549,
         9434,
         592,
         18129,
         9080,
         476,
         9675,
         10511,
         14170
      ],
      "backdrop_path": "/8EYj7lENYgLab54yuGP7X4EWOA9.jpg",
      "revenue": 24444121,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Karl Childers",
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e63",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Doyle Hargraves",
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e6b",
               "name": "Dwight Yoakam",
               "profile_path": "/pyqKTjGy0m4aBKDqbH4ne8hUwLi.jpg",
               "id": 20309,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Charles Bushman",
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e6f",
               "name": "J.T. Walsh",
               "profile_path": "/39KZjhJSyDjvBhKGj0IbGVteFAm.jpg",
               "id": 22131,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Vaughan Cunningham",
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045eb1",
               "name": "John Ritter",
               "profile_path": "/2WIkWe5UASXpZgLQ1pMTtHNJKJX.jpg",
               "id": 27772,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Frank Wheatley",
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045ea9",
               "name": "Lucas Black",
               "profile_path": "/41qZZc6vRVm5ZOoXWfEf5NGoIZR.jpg",
               "id": 155,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Karl's Father",
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e67",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Linda Wheatley",
               "gender": 1,
               "credit_id": "52fe44ee9251416c75045ead",
               "name": "Natalie Canerday",
               "profile_path": null,
               "id": 71886,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Jerry Woolridge",
               "gender": 2,
               "credit_id": "58046246c3a3686e9f002ac1",
               "name": "James Hampton",
               "profile_path": "/bVes3w8EelatQe7yuJ2OiNL8QOG.jpg",
               "id": 14848,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Melinda Brady",
               "gender": 1,
               "credit_id": "58046258c3a3686ea9002e11",
               "name": "Christine Renee Ward",
               "profile_path": "/tgLnnFGUho1YDq5GzKvcmR2s8tS.jpg",
               "id": 52881,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Frostee Cream Boy",
               "gender": 2,
               "credit_id": "548a883d9251412611000adf",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Terence",
               "gender": 0,
               "credit_id": "5804627f925141265a0031b1",
               "name": "Vic Chesnutt",
               "profile_path": null,
               "id": 1549384,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Bill Cox",
               "gender": 2,
               "credit_id": "5804629492514126680032de",
               "name": "Rick Dial",
               "profile_path": "/uZZf5L09evhqnxXNQm6jOlfgWmI.jpg",
               "id": 308843,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Scooter",
               "gender": 2,
               "credit_id": "5804629e92514126680032e4",
               "name": "Brent Briscoe",
               "profile_path": "/7ws22WEvxt6cvMDyijZOdf9AuiS.jpg",
               "id": 15011,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Albert",
               "gender": 0,
               "credit_id": "580462aa925141265f00314b",
               "name": "Tim Holder",
               "profile_path": null,
               "id": 1695755,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Morris",
               "gender": 0,
               "credit_id": "580462b392514126550032dd",
               "name": "Bruce Hampton",
               "profile_path": null,
               "id": 1201770,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Monty Johnson",
               "gender": 2,
               "credit_id": "580462bfc3a3686eb80031f9",
               "name": "Mickey Jones",
               "profile_path": "/AKiGEoMYoRvG66aKZF6V4qdUM6.jpg",
               "id": 100230,
               "order": 16
            },
            {
               "cast_id": 28,
               "character": "Randy Horsefeathers",
               "gender": 0,
               "credit_id": "580462d192514126610033ef",
               "name": "Ian Moore",
               "profile_path": null,
               "id": 1584865,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e75",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e7b",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e81",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e87",
               "name": "David L. Bushell",
               "profile_path": null,
               "id": 56759,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e8d",
               "name": "Larry Meistrich",
               "profile_path": null,
               "id": 36188,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e93",
               "name": "Brandon Rosser",
               "profile_path": null,
               "id": 72537,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e99",
               "name": "Daniel Lanois",
               "profile_path": "/1JWfP5AZApOVEg1tDjRdnTQNZx6.jpg",
               "id": 72538,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045e9f",
               "name": "Barry Markowitz",
               "profile_path": null,
               "id": 34191,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ee9251416c75045ea5",
               "name": "Hughes Winborne",
               "profile_path": "/nIIkXDETAlS6UMPTqjCs4kRgAo4.jpg",
               "id": 20649,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 8.596407,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12498,
      "vote_count": 294,
      "budget": 1000000,
      "overview": "Karl Childers is a mentally disabled man who has been in the custody of the state mental hospital since the age of 12 for killing his mother and her lover. Although thoroughly institutionalized, Karl is deemed fit to be released into the outside world.",
      "similar": [
         11564,
         2142,
         3134,
         8810,
         948,
         298312,
         4771,
         769,
         185,
         949,
         205,
         241,
         793,
         101,
         281,
         141,
         550,
         281957,
         339692,
         395834
      ],
      "original_title": "Sling Blade",
      "runtime": 135,
      "poster_path": "/tUQRe2VQWdiIdSjpD28w7Rm8Ccb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1996-08-30",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "A simple man. A difficult choice.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Billy Bob Thornton"],
      "runtime": 135,
      "synopsis": "The movie opens in an asylum, where Charles (J.T. Walsh) talks to Karl (Billy Bob Thornton) about cars and women. Two student reporters Marsha (Sarah Boss) and Theresa (Kathy Sue Brown) arrive to interview Karl, who has committed murder, and is due to be released soon. They are introduced to the warden, Jerry (James Hampton), who explains that Karl is sensitive about having his picture taken. The interview is conducted in near darkness, with Karl speaking almost to himself. Karl describes his childhood, where he was isolated from his family. He was picked on by other kids, and spent time working on lawnmowers. He says his mother was being raped by local man Jessie Dixon, and kills Jessie with a sling blade. When his mother objected to the killing, Karl killed her. When asked if he'll kill again, he says he has no reason to. Karl is released, and returns to his hometown. He tours the town, carrying his books and bible from. He helps a boy, Frank (Lucas Black) carry laundry home, and Frank invites Karl to play football. Karl is uncomfortable with being free, and tries to return to the asylum. Jerry fixes Karl up with a job at a small repair shop. Since Karl has nowhere to go, Jerry invites him to his house for the night, but his family is obviously nervous. Jerry introduces Karl to Bill Cox (Rick Dial), who owns the repair shop, and Scooter (Brent Briscoe). Karl completes a day of work, and Bill locks him inside the shop for the night. The next day, Bill gives Karl a key and an advance on his paycheck, so he can buy supplies. Karl arrives at Frank's house, and Frank takes him to his mother's store. Karl meets Frank's mom Linda (Natalie Canerday) and manager Vaughan (John Ritter). Linda allows Karl to stay in their garage, and Frank and Karl begin their friendship. Karl refuses to tell Frank about the murders. Frank tells Karl that Vaughan is gay, and Linda's boyfriend Doyle is mean to her, but since his father committed suicide, she is lonely. Doyle (Dwight Yoakum) is doubtful about Karl staying in the garage, and abuses Vaughan verbally. Vaughan and Linda leave, and Doyle verbally abuses Karl and Frank's father. Frank helps Karl get settled, and they share a joke. The next day, Vaughan takes Karl to lunch and tells him he's gay. He also tells Karl that Doyle might hurt Frank. That night, Doyle has a band party with his buddies at Linda's house. They go to the county line for beer, bringing Karl and Vaughan, and they trade jokes with the police. Back at the house, the band laments about a lack of gigs, and Doyle becomes enraged, throwing the band out. Linda confronts him, and Doyle threatens her. After Doyle leaves, Frank talks to Linda, telling her he's nervous all the time. Karl tries to cheer Linda up with a joke. Karl tells Linda why he was incarcerated, and tells her he would never hurt her or Frank. Linda arranges a dinner with Melinda (Christine Renee Ward), whom she hopes will like Karl. Vaughan and his friend Albert (Tim Holder) are also there. Melinda and Karl go for a walk. The following day, Melinda brings Karl flowers. Conversation is stilted, but Karl watches her leave. Later, Karl shares a story with Frank: his father made Karl throw away a baby boy. Karl buried it instead. They talk about life and death, and Frank says the bible says people who commit suicide or kill others go to Hades. Frank is in love with a girl named Karen, but she doesn't want to be seen with him. When they come home, Doyle is back, apologizing for his behavior. He says he'll be coming over more, trying to be a better person. Frank doesn't buy it. Karl cheers Frank up by playing football with him. Later, Karl returns to his old house where he grew up. He finds his father (Robert Duvall), who is senile, and refuses to recognize Karl as his son. Karl confronts his father about killing his little brother, then goes to see his brother's grave. That night, Karl comes into Linda's room, where she and Doyle are in bed. He tells Linda he wants to be baptized. He's carrying a hammer and says we woke up holding it. The following day, Karl is baptized in a river. When they return, Doyle sends Linda to fetch dinner, then he tells Frank to obey him, and to get rid of Karl. Doyle tries to hit Frank, but Karl stops him. As Karl leaves, he sees Linda and thanks her for being good to him. Karl finds Frank hiding in the woods, and gives Frank his books. Frank realizes Karl is leaving, and Karl tells Frank to stay away from Doyle for the night. Karl then goes to Vaughan and tells him to take care of Frank, leaving him with his earnings from the repair shop. At night, Karl is seen staring at Doyle's house and sharpening a lawnmower blade. He kills Doyle, after asking how to call the police. Karl then calls the police and waits for them to take him into custody, eating leftover fried chicken. Later, Karl listens to Charles talking again - back in the asylum. Karl tells Charles he doesn't want to listen anymore. End.",
      "writers": [
         "Billy Bob Thornton",
         "Billy Bob Thornton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117666/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMzE5NTYwOF5BMl5BanBnXkFtZTgwMzYxNjcxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Billy Bob Thornton, Dwight Yoakam, J.T. Walsh | See full cast and crew »"],
      "reviews": [
         "As someone who loves good filmmaking, I rate this film among the best I've ever seen in all areas of the craft. Some of the criticisms of this film are hard to fathom. The screenplay has the tight conciseness of a well-honed play (which this essentially was derived from) and doesn't fail to prick at the emotions and the intellect of the viewer. The photography, the casting and the editing all click together quite admirably. However, I always marvel at the negative, emotionalized responses to otherwise superb films such as this by those who seem to miss the entire point of a movie like \"Sling Blade\". I did not see a political message about abortion, or a justification of murder or even a backhanded putdown of the rural people of Arkansas. (Many of the characters were locals, by the way.) Some viewers are setting themselves up to be against this film since they are wearing their own feelings on their sleeves and fail to see the subtle layers of the story. They are seeing only the reflection of themselves on the surface of the water, rather than the complex world below. Theater and film are rooted in images and characterizations designed to help us explore the human condition. It was once said that Tolstoy's voluminous novel \"War and Peace\" could be summed up in a single sentence thereby negating the need to write the book. Art is not a fast explanation, but a captivating and thought-provoking trip that hopefully forces us to think about our own motivations. Taking a one-dimensional view of this film might lead one to believe that Karl Childer's central message is that we should all eat biscuits smeared with mustard. \"Sling Blade\" excels at the job of making us examine the terrible choices life gives us by providing a set of characters who interact in a moving, curious and revealing way. It is not reality nor is it political, but a method by which we can look at our own individual realities. Others who seemed disenchanted with this film out-of-hand are those who found it \"slow\". Helloooo! This film is SUPPOSED to be slow and agonizingly so. It is carefully walking you to the conclusion, step-by-step, so you can squirm uncomfortably at the overall foreshadowing. It ain't an explosion-a-minute John Woo filmmaking and it certainly isn't light comedy, though it induces a surprising number of smiles. This is a film that makes us look at true evil in the form of J.T. Walsh, Dwight Yoakum and Robert Duval's characters and compare it to the pure goodness of the damaged creature portrayed by Billy Bob Thornton, whose own brutalization leads him to seek justice in his own imperfect way. To help those out who didn't \"get\" this film, I might recommend that you consider Thornton's character to be an amalgamation of Herman Melville's innocently homicidal protagonist in \"Billy Budd\" and Mary Shelley's sad monster Frankenstein. These characters, like Thornton's Karl Childers, were dramatic vehicles for the purpose of making us think. They did bad things but we were forced to view them compassionately because they reflected our own conflicting traits. Don't read things into a film that aren't there, but don't ignore the interesting elements that are. Get those wheels upstairs turning and start enjoying intelligent filmmaking instead of merely seeking an excitement fix!",
         "I can't believe it took me so long to finally see this movie and I must admit I had never seen any work by Billy Bob Thornton. Without a doubt, Sling Blade is one of the finest pieces of work ever put on film. Billy Bob's performance as Karl Childers is absolutely riveting! I found myself completely fascinated by this character. The entire ensemble of characters are superbly cast. The child actor who plays Frank is talented beyond his years. This story unfolds in many layers, with friendship and love woven between bigotry and cruelty. It begins with a somewhat horrible description of the double murder of Karl's mother and her lover, but yet is tastefully done with words, no cheap views of blood and gore. It shows how the lack of parental love and understanding can form an individual, but also how the human heart can still have the capacity to be open, as in the relationship between Karl and Frank. You'll feel completely drawn into this little family with its pain and problems. This is a masterpiece of superb acting, writing and directing! If you haven't seen it yet, please don't deny yourself the opportunity of viewing one of the most amazingly touching movies you will ever see. Even in the company of great performances by Tom Hanks and Dustin Hoffman, I think Sling Blade leaves Forrest Gump and Rain Man in the dust!",
         "Sling Blade is a very well acted, well displayed, and interesting masterpiece. I just loved it from beginning to end. First I would like to comment on the excellent acting across the board, especially the late John Ritter and Billy Bob Thornton's ensemble portrayal of Karl. I could not help but feel very attached to Karl from the opening scene, his release from the mental institution, his struggles with the outside world, and how he related to the town people. Sling Blade is one of those movies that I would love to sit down and talk about for hours with a friend. I would also love to hear others' perspectives about what made this movie great. It seems that every scene was worked to perfection. From the lighting and camera's viewpoint to the acting and music. I enjoyed every scene, but thought that three really stood out. Without giving too much away, they are as follows. No spoilers here: 1. Inside the house after band practice where Karl does not move from the couch. 2. When Karl is visited at work and we see him make eye contact for the first time. 3. The scene where Karl is in the garage late at night. The chilling music really captures the mood. My heart was pounding during this one! I hold Mr. Thornton to a very high respect. He created a masterpiece that is emotional, thrilling, dramatic, humorous, and entertaining.",
         "This film is a perfect example of how a film should be made. It has everything, good cast, good script, good performances everything is perfect. This has to be one of my all time favourite films and Billy Bob Thornton is a good a writer and director as he is an actor. The Oscar for best adapted screenplay was well deserved and it shocks me that Billy Bob didn't win the oscar for best actor. I bought this film on DVD and it is a shame you do not get any features but I hope they will release a special edition with contribution from the writer, actor and director himself. I urge everyone to watch this film because it is funny, emotional, enjoyable and just plain brilliant. 10/10",
         "\"Sling Blade\" is an emotionally exhausting picture which establishes Billy Bob Thornton as one of our very best actors, writers, and directors. This story of a mentally handicapped man committed to a mental hospital for a childhood double murder, and his attempt to make it in the outside world, avoids the usual stereotypes about the closed-minded townsfolk and their prejudice against someone like Karl Childers, Thornton's character. Indeed, upon his release Childers is given a mechanic's job and befriends a young boy, his widowed mother, and her gay best friend (played by an unrecognizable John Ritter). Unfortunately, the mother's drunken, violent boyfriend - Dwight Yoakam in a dark, effective performance - cannot accept Karl getting in the way of his relationship, and Childers must ultimately defend his new \"family\" the only way he knows how. The tragedy of \"Sling Blade\" is that Childers is a basically gentle soul whose abusive childhood - his father (Robert Duvall in a cameo) and mother made him live in a shed behind the house - and marginal intelligence have made him unable to function without violence. More importantly, deep down Childers knows this; he knows he cannot function as a free man, and simply cannot protect the ones he loves without violence. The result is one of the most sympathetic characters I have ever seen in a movie. This film is one of the great movies of the decade. (9/10)",
         "A magnificent film! Watching Billy Bob, I was reminded of Bo Radley (Robert Duvall)in To Kill a Mockingbird. The irony of seeing Duvall in Sling Blade made it that much more rewarding. Yes, it's true, the ending was inevitable, but so what? The journey to the end was what made this film the gem that it is. Dwight Yoakam made my skin crawl, and Lucas Black as little Frank brought out my motherhood instinct. Protect that boy, Karl! And he did. This had all the elements of a great film: an unselfish hero who brings about changes in the lives of others in a meaningful way. Granted, had his mental capabilities been greater he might have made another choice. Given the circumstances of the film, there was no other choice.",
         "Surprisingly, this movie is not based on a true story, but it sure was Thornton's breakthrough in the movie business. I feel he sold out to the mainstream when he made the awful Armageddon. Thornton's Karl Childers is released from a mental insitution after 20 years from killing his mother as a child and returns to his backwoods Arkansas town with no family or friends to speak of, but befriends a fatherless boy and his mother. The entire cast is superb; Dwight Yoakum as a bigoted redneck, John Ritter as a gay store manager, Robert Duvall in a cameo as Thornton's almost catatonic father, Rick Dial (a boyhood friend of Thornton's) as Karl's genial boss, etc. The movie has just the right touch for life in the small-town south without the traditional Hollywood glamorization.",
         "Set in a small, rural Southern town, Billy Bob Thornton's \"Sling Blade\" is so flavorful in ambiance and tone, so rich in character and theme that it's hard to believe that its roots are not to be found in any short story or novel. For while it has all the earmarks of a great work of literature, \"Sling Blade\" is actually an original creation by Thornton, the triple threat talent who wrote, directed and stars in the work. Karl Childers is a marginally retarded man who's been living in a mental institution ever since, as a child, he accidentally stumbled across his mother and her lover in a compromising position and, in a moment of considerable confusion, hacked the two of them to death. After being officially declared by the state to be \"rehabilitated\" and \"cured,\" Karl is thrust back out into the world where he forms a bond with a fatherless boy, his hardworking, compassionate mother and a gay storeowner who has long since become a part of their extended family. Also part of that family is the widow's twisted boyfriend, Doyle Hargraves, who physically and psychologically abuses both mother and son. Thanks to Carl's \"strangeness\" and homicidal background, as well as the simmering volatility and mercurial temperament of Doyle, there is always the threat of violence hanging ominously over the work. Yet, in many ways, \"Sling Blade\" is really about the goodness of people in their willingness to overlook external differences and to find the similarities that unite us all in a common bond of humanity. For the most part, the people in this quiet little community try to reach out and befriend Karl, sensing a decency in him that helps to mitigate any possible fear they might have of him based solely on surface eccentricities. Even when he is eventually forced into violent action, he does so as an avenging angel bringing swift and righteous justice, not as a murderous demon acting out of hatred or malice. The acting in the film - beginning with Thornton himself - could not be more brilliant. With his stooped shoulders, tight-lipped smile, jutting jaw, vacant expression and guttural throat-clearing, Karl became the butt of so many jokes back when the movie first came out that it's easy to forget what a truly amazing character - and job of acting - Thornton has pulled off here. The actor we've known from so many other movies is completely invisible in this role, as he literally becomes Karl in every fiber of his being and, in so doing, forces us to see the wisdom and humanity buried deep inside the person. The performance is such a touchstone of acting for our generation that it is easy to miss all the other great acting in the film, particularly on the part of Natalie Canerday, Lucas Black, John Ritter, J.T. Walsh, Robert Duvall and, most especially, Dwight Yoakam, whose portrayal of a man teetering on the edge of a psychopathic meltdown is bone-chilling and brilliant. As a writer, Thornton has shaped his film like a modern day parable - simple, symbol-laden and allegorical. As a director, he proves himself a master of rhythm and pacing, setting the mood and allowing the scenes to play themselves out without recourse to overstatement or melodrama. In fact, this is one of those rare movies in which every moment feels just right, so confident is Thornton in his ability as a filmmaker to bring his story to life on screen. He also knows how to make the bucolic setting come across as both stark and sensuous at the same time, a place of quiet stillness that provides the perfect backdrop for the morality tale he is endeavoring to tell. Finally, Daniel Lanois has provided a haunting musical score that ever so subtly draws us into the disturbingly offbeat world of the drama. \"Sling Blade\" earned a Best Original Screenplay Oscar for Thornton, but he should also have won awards for his directing and his performance as Karl, not to mention the film itself which should have won the honor as Best Picture of 1996 - although Hollywood, in its infinite wisdom, failed even to nominate it. Ah well, even with that lapse in judgment, \"Sling Blade\" remains one of the great movie dramas of the past decade.",
         "I guess the main reason why I wanted to see this movie was because it was written and directed by Billy Bob Thornton, who also played a role in it. Even though the man hasn't really been able to prove a lot with his work as a director, I must say that I almost always appreciate him as an actor. He's perhaps not the most popular actor in Hollywood, but in my opinion he sure is one of the better ones. In this movie he plays the role of Karl Childers, a grown, but simple man who is released from the psychiatric hospital where he has been hospitalized since the age of twelve. He had to stay in that hospital for so long because he murdered his own mother and her lover, believing that they were doing something wrong. He returns to the town where he lived the first twelve years of his life and it doesn't take long for him to get a job as a mechanic, fixing all kinds of small motors at a local repair shop. In the same town he also meets Frank, a young and friendly boy who immediately seems to like this strange man. Soon Karl is invited by Frank's mother to stay in their garage, much against the will of her alcoholic and abusive boyfriend Doyle. While Karl's friendship with Frank gets stronger, the tension between him and Doyle keeps building up, until reaching its final climax... Now that I've finally seen this movie, I can only say that it's too bad that I didn't give it a try earlier. Especially thanks to the magnificent performance by Billy Bob Thornton, this is a movie that is more than just worth a watch. But also the other actors like Dwight Yoakam, Natalie Canerday,... did a very good job. The entire movie feels very realistic, is quite sober and never tries to be too dramatic. This is the kind of movie that could have become very preachy, but it hasn't and that's something that I really appreciate. Add to this some good directing and you know that Thornton has done a very nice job with this movie. This isn't exactly a typical Hollywood movie, not in its story and certainly not in its approach towards the subject. This could easily have become some kind of cheesy TV-movie, but Billy Bob Thornton has made a very good movie out of it instead. I really appreciated his work as a director, actor and writer in this movie, liked the story and was intrigued by the acting of all the actors. That's why I give it a 7.5/10, maybe even an 8/10.",
         "Only one word can describe the performance of Billy Bob Thornton...amazing. I really had no respect for him before. His behaviors, his antics, the way the media portrayal him...feels like he is just playing himself in the slimeball and lowlife roles that he is usually seen as in his movie. Never really understood why he gets work at all. Anyone can play a slimeball... Then I watched Sling Blade a couple of months ago...I was simply shocked. I was shocked even further when I learned that he starred, directed and even wrote the screenplay. The film was magnificent. First, the storytelling was great. It was very strait forward and it was in a chronological order. It did not jump, as time moved forward and one got a grip of Karl and other character's past from the conversations and the places that they visited. It was very easy to follow and the characters were very well developed, even those that had only a few scenes. Then, the directing was great. Even though the film was slow, not once did it ever became dull or boring for me. Even though there was nothing too exciting happening, the movie gripped me and I was following it till the end. I was feeling scared and sad during the climax where Karl killed Doyle, feeling sympathy towards Karl and the different characters as they began to reveal their stories and feeling warmhearted as the people welcomed a stranger with open arms. Next, the supporting cast was great. They all gave heartwarming and convincing efforts. Without them, this movie would not be complete. Finally, and the most important element of all, Billy Bob Thornton's portrayal was so real. His expressions, his reactions, his walk, his eye focus...everything that he did convinced me that he was actually mentally handicapped. I got completely lost within his character and it was him who kept me interested as the story unfolded. Then I heard the work and sacrifices that he made for this film (putting glass in his shoes so he can have the awkward kind of walk) made me respect him even more. This movie is great. Very recommended. 9/10"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Miramax",
         "Shooting Gallery"
      ],
      "summaries": [
         "A partially handicapped man named Karl is released from a mental hospital, about 20 years after murdering his mother and another person. Karl is often questioned if he will ever kill again, and he shrugs in response saying there is no reason to. Now out of the mental institution, Karl settles in his old, small hometown, occupying himself by fixing motors. After meeting a young boy named Frank, who befriends him, Karl is invited to stay at Frank's house with his mother Linda, who views Karl as a strange but kind and generous man. However, Linda's abusive boyfriend, Doyle, sees things differently in the way rules ought to be run- normally insulting Linda's homosexual friend Vaughan as well as Karl's disabilities, and having wild parties with his friends. As Karl's relationship with Frank grows, he is watchful of Doyle's cruel actions.",
         "Karl Childers, now a grown man, is released from a psychiatric hospital where he has been hospitalized since the age of 12 for the murder of his mother and her lover. He returns to his childhood town, and although being mentally handicapped, gets a job fixing small motors at a local repair shop. Karl befriends a young boy, Frank, and is soon invited by Frank's mother Linda to move into the family's garage. As a strong relationship develops between Karl and Frank, a confrontation builds with Linda's abusive and sometimes violent boyfriend Doyle.",
         "Karl Childers, a simple man hospitalized since his childhood murder of his mother and her lover, is released to start a new life in a small town."
      ],
      "budget": 890000
   },
   "movielensId": 1358,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-30",
      "dvdReleaseDate": "1998-01-06",
      "directors": ["Billy Bob Thornton"],
      "runtime": 135,
      "movieId": 1358,
      "title": "Sling Blade",
      "mpaa": "R",
      "actors": [
         "Billy Bob Thornton",
         "Dwight Yoakam",
         "J.T. Walsh",
         "John Ritter",
         "Lucas Black",
         "Robert Duvall",
         "Natalie Canerday",
         "James Hampton",
         "Christine Renee Ward",
         "Jim Jarmusch",
         "Vic Chesnutt",
         "Rick Dial",
         "Brent Briscoe",
         "Tim Holder",
         "Bruce Hampton",
         "Mickey Jones",
         "Ian Moore"
      ],
      "imdbMovieId": "0117666",
      "originalTitle": "Sling Blade",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["-RLVfo4SZfg"],
      "plotSummary": "Karl Childers is a mentally disabled man who has been in the custody of the state mental hospital since the age of 12 for killing his mother and her lover. Although thoroughly institutionalized, Karl is deemed fit to be released into the outside world.",
      "tmdbMovieId": 12498,
      "avgRating": 3.97683,
      "releaseYear": "1996",
      "numRatings": 15214,
      "posterPath": "/tUQRe2VQWdiIdSjpD28w7Rm8Ccb.jpg"
   }
}