{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "biography",
         "id": 5565
      }],
      "imdb_id": "tt0113125",
      "video": false,
      "title": "From the Journals of Jean Seberg",
      "recommendations": [],
      "backdrop_path": "/8syVcFTMGjBztPyk9aLOfdqCZcC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Herself",
               "gender": 1,
               "credit_id": "54c7e9a0925141561e0005b7",
               "name": "Jean Seberg",
               "profile_path": "/9ARTCuncSRg83PMRvGfoPE7Tcqc.jpg",
               "id": 3830,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jean Seberg",
               "gender": 1,
               "credit_id": "52fe4a93c3a368484e15b5cf",
               "name": "Mary Beth Hurt",
               "profile_path": "/A1Whvk91g7uMZHjRX5rdxJsofeY.jpg",
               "id": 54782,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a93c3a368484e15b5cb",
               "name": "Mark Rappaport",
               "profile_path": "/apv7hMj7we7M5fhyVJ1B0S9qYVq.jpg",
               "id": 1077999,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "564db67cc3a3682a1a0052a1",
               "name": "Mark Rappaport",
               "profile_path": "/apv7hMj7we7M5fhyVJ1B0S9qYVq.jpg",
               "id": 1077999,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "564db68c9251414dd100a673",
               "name": "Mark Rappaport",
               "profile_path": "/apv7hMj7we7M5fhyVJ1B0S9qYVq.jpg",
               "id": 1077999,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "564db6f99251414dd100a686",
               "name": "Mark Daniels",
               "profile_path": null,
               "id": 1338450,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "564db7109251417c46009bf1",
               "name": "Lina Todd",
               "profile_path": "/d4BTPVOh4Vj2Rhc7dHiYrF4BxDp.jpg",
               "id": 67702,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "564db7259251416de3006c0f",
               "name": "Janet Cassady",
               "profile_path": null,
               "id": 1538277,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.246013,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 123360,
      "vote_count": 2,
      "budget": 0,
      "overview": "Mark Rappaport's creative bio-pic about actress Jean Seberg is presented in a first-person, autobiographical format (with Seberg played by Mary Beth Hurt). He seamlessly interweaves cinema, politics, American society and culture, and film theory to inform, entertain, and move the viewer. Seberg's many marriages, as well as her film roles, are discussed extensively. Her involvement with the Black Panther Movement and subsequent investigation by the FBI is covered. Notably, details of French New Wave cinema, Russian Expressionist (silent) films, and the careers of Jane Fonda, Vanessa Redgrave, and Clint Eastwood are also intensively examined. Much of the film is based on conjecture, but Rappaport encourages viewers to re-examine their ideas about women in film with this thought-provoking picture.",
      "similar": [
         45317,
         323677,
         11202,
         1578,
         10637,
         227306,
         276907,
         462,
         640,
         769,
         5915,
         318846,
         324786,
         389015,
         407445,
         363676,
         371638,
         396371,
         369192,
         43959
      ],
      "original_title": "From the Journals of Jean Seberg",
      "runtime": 97,
      "poster_path": "/wfPHta8Wxm4LQVHU8tRhL8GCyIz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Couch Potatoe Productions",
         "id": 68229,
         "origin_country": ""
      }],
      "release_date": "1995-09-08",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Mark Rappaport"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Mark Rappaport"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113125/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5ODgzNDE1NV5BMl5BanBnXkFtZTcwMTY4MDMyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Mary Beth Hurt, Jean Seberg | See full cast and crew »"],
      "reviews": [
         "The negatives comments this film has received make me think that the commentators haven't taken a college literature course before (or at least not in a while). I don't mean this in a mean way; it's simply that one sitting in a classroom while twenty people write twenty papers about one work of literature with twenty different takes on it can be a sobering & educational experience. Short of the author writing another book after his or her first book & explaining the previous work, there's really no way to state with certainty what the point of it all was. (& even then, some people would distrust the author's explanation.) The same goes for music, art, poetry, & of course film. What Rappaport has done here is written a paper, using the approved standard of evidence most college-level courses require, theorizing about the life & work of actress Jean Seberg. That he sometimes casually throws out theories as fact is standard for such essays, papers, what-not. It may seem a little crass to think of someone's life as being open to interpretation, but surely one can understand that there is always something social or political about presenting the story of one's life in, say, cable TV's \"Biography\" method, which tends to leave out or just touch on the gruesome sexual encounters or the public humiliations, or VH1's \"Behind the Music\" style, which focuses on nothing but. Rappaport does something different than both of those. Seberg's life is explained through the films she's in, which, he suggests, is inextricably linked to the men she loved, which is inextricably linked to the times she was living in, the political role she chose to play, & the other actresses whose careers ran parallel to hers. Is it all factual? More or less - facts are lined up to support the thesis, which is basically a feminist commentary on the role of women in film, backed up with some fascinating (if maybe not entirely tenable) connections with things as different as Russian formalist silent cinema & Spaghetti Westerns. & lots of interpretation - Rappaport has written words for Mary Beth Hurt, as Jean Seberg, to comment on her looks, her acting style, the roles she played. To believe that he had access to some real \"journals\" of Seberg is somewhere between silly & gullible. See, it's not even pretending to be objective truth. If it were, why would it be narrated by an actress playing Jean Seberg, who's nearly twenty years dead by the making of the movie? It's a thesis, an idea, something thrown out for you to chew on & think about. You are of course free to disagree with the filmmaker, & it's eminently healthy to question or criticize such undertakings, as one should criticize a Ken Burns or an Errol Morris. Negative reactions to films such as this one make me feel a little sad, because I think the point has been missed. This is an especially engaging film, about a good-but-not-necessarily-great actress whose famous roles have captured the minds of those film buffs geared to become part of this or that cult following. That her life was tragic is a matter of record. Short of asking her, which will require a trip to the other side, Rappaport has put words in her mouth to tell you what he thinks about her life & work. Though not making movies ourselves, we do much the same thing when we talk about films, books, records, works of art to our friends, co-workers, family, teachers, students. I'm not a professor, but if I were, & if this movie were a paper, I'd give it an A. It's a damn good read, & well documented. So to speak.",
         "Wow! What a revelation this film is. It examines the life of Jean Seberg and how it is destroyed by her acting career. It is a complex film, one that really defies explanation. It combines film clips from her films and the films of other movie stars with dialogue spoken by Mary Beth Hurt as Jean Seberg. From her early career as a terrible actress in Preminger's Saint Joan to her quick comeback in Goddard's Breathless to her slow descent into madness after being hounded by the FBI, the film examines how the events affected the actress and also what they say about the world of Hollywood. The roles that women are offered are compared with those that men get. The function of the closeup is explained with examples dating back to the earliest films. The parallels in the careers of Jane Fonda, Vanessa Redgrave, and Seberg are shown. Seberg is also compared with Clint Eastwood and the development of his career through closeups is compared to hers. All of this may sound mundane, but it is not. The film exposes the assumptions of Hollywood and the effects of these assumptions on the audience. An earlier reviewer says that it is revisionist history, but it is simply an honest look at what Hollywood did then and still does today to women. Who are our big stars? Julia Roberts, who played a hooker to become famous. Demi Moore, who is paid to reveal her fake breasts. And about 8200 men. Calling this film politically correct or feminist simply allows the reviewer to ignore the facts that it presents. After seeing it, the viewer will never see film the same way again.",
         "I rented this video essay because I was recently reminded of this great independent American director, many of whose works I saw a decade ago and loved, and started a fairly useless thread about him that got few replies on an IMDb forum. Apparently, he is still awfully underground and unknown. I don't know if this would change things even if I could magically get a bunch of people to see it. Basically, it's a 100-minute deconstruction of the late American actress Jean Seberg's career, with Seberg \"played by\" narrator Mary Beth Hurt, who (as stand in for both author/director Rappaport and the dead actress) offers a withering feminist critique of the roles, both on and offscreen, that naive small-town Iowa girl Seberg found herself thrust into from the moment she first auditioned for Otto Preminger's film of Bernard Shaw's Saint Joan in 1955 at the age of 17. Questioning the way in which male directors dominate and abuse female stars, the casting by so many men of their wives as whores and cheats, the pornography of suffering in every rendition of Joan and the choices that women - but not men - get pushed into making as they age, this is a wide-ranging look at both Hollywood and European morality in the film industry, at the politics of the late 60s and how they impacted Seberg and other star actresses like Jane Fonda and Vanessa Redgrave, and much more. A provoking and pointedly subversive and subjective document, rather than a \"documentary\", this is I think essential viewing for anyone interested in the politics and sociology of stardom, and for fans of Seberg, Preminger, Jean-Luc Godard and Clint Eastwood in particular. Those interested in Seberg's films should be warned that the endings of \"À bout de soufflé\", \"Lilith\" and \"Bonjour Tristesse\" are given away. I can imagine that many would find the approach here irritating and even offensive, particularly those more wedded to traditional documentary styles, but to me it is a masterpiece and not far off the level of Chris Marker (\"Sans Soleil\") and Orson Welles (\"Filming 'Othello'\") in this fairly rare cinematic form. Mark Rappaport is not after \u0096 and probably doesn't believe in \u0096 some kind of absolute \"truth\", some specific answer as to why Seberg's career and life ended the way they did, indeed he is willing to place some of the blame on the actress herself; he is interested in provoking discussion and thought, and in that he succeeds entirely.",
         "A wonderfully articulate film-essay using the life of Jean Seberg to demonstrate what is a star. Does not stick to the factual; brings interesting and somtimes intensely cynical socio-psychological support to the idea of the collective gaze. Really rich, really worth seeing.",
         "The film as thesis. As a thesis, it's remarkably unfocused - Jean Seberg: victim; cinema, Preminger, Godard, Romain Gary, Clint Eastwood, FBI, America, Jane Fonda, Vanessa Redgrave, men: villains. Because this film isn't really interested in Jean Seberg - here she is interchangable with an aging soap star; she is a ghost, unproblematically dead; she is a hapless, helpless victim with no will of her own; she is tossed about by men, and yet here she speaks the words of her male creator, Mark Rappaport - but in the history of film, its ideologies and repressions. As these go, it is funny, informative and full of interesting and perceptive connections, but there are too many blatant distortions to actually accept it.",
         "Director Mark Rappaport does for the life of Jean Seberg what Oliver Stone did for the JFK assassination. He takes a little bit of fact, mixes it with a lot of speculation, and then spins it the way he wants the viewers to see it. FROM THE JOURNALS OF JEAN SEBERG is politically correct historical revisionism to bolster the feminist dogma that a patriarchal culture is the root of all evil. At point is the notion that the film-making industry, long thought a bastion of liberalism, is not only a participant in the subjugation of women, but also a conduit to it. We are to believe the Ms. Seberg was not responsible for any of the decisions she made in life, they were all the fault of the men in her life. She was a martyr. Yet at the same time we are to see her as an icon of feminism -- the first modern woman on the silver screen. A real life \"Joan of Arc.\" And the real story behind the real Jean Seberg? Sadly, you will not find it here."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": ["Couch Potatoe Productions"],
      "summaries": ["Mark Rappaport's creative bio-pic about actress Jean Seberg is presented in a first-person, autobiographical format (with Seberg played by Mary Beth Hurt). He seamlessly interweaves cinema, politics, American society and culture, and film theory to inform, entertain, and move the viewer. Seberg's many marriages, as well as her film roles, are discussed extensively. Her involvement with the Black Panther Movement and subsequent investigation by the FBI is covered. Notably, details of French New Wave cinema, Russian Expressionist (silent) films, and the careers of Jane Fonda, Vanessa Redgrave, and Clint Eastwood are also intensively examined. Much of the film is based on conjecture, but Rappaport encourages viewers to re-examine their ideas about women in film with this thought-provoking picture."],
      "budget": 0
   },
   "movielensId": 136,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-08",
      "dvdReleaseDate": "1999-04-06",
      "directors": ["Mark Rappaport"],
      "runtime": 97,
      "movieId": 136,
      "title": "From the Journals of Jean Seberg",
      "mpaa": null,
      "actors": [
         "Jean Seberg",
         "Mary Beth Hurt"
      ],
      "imdbMovieId": "0113125",
      "originalTitle": "From the Journals of Jean Seberg",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Mark Rappaport's creative bio-pic about actress Jean Seberg is presented in a first-person, autobiographical format (with Seberg played by Mary Beth Hurt). He seamlessly interweaves cinema, politics, American society and culture, and film theory to inform, entertain, and move the viewer. Seberg's many marriages, as well as her film roles, are discussed extensively. Her involvement with the Black Panther Movement and subsequent investigation by the FBI is covered. Notably, details of French New Wave cinema, Russian Expressionist (silent) films, and the careers of Jane Fonda, Vanessa Redgrave, and Clint Eastwood are also intensively examined. Much of the film is based on conjecture, but Rappaport encourages viewers to re-examine their ideas about women in film with this thought-provoking picture.",
      "tmdbMovieId": 123360,
      "avgRating": 3.56481,
      "releaseYear": "1995",
      "numRatings": 108,
      "posterPath": "/wfPHta8Wxm4LQVHU8tRhL8GCyIz.jpg"
   }
}