{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0084116",
      "video": false,
      "title": "Identification of a Woman",
      "recommendations": [
         33297,
         104858,
         117646,
         46916,
         36895,
         71329,
         27441,
         52322,
         198802,
         47161,
         199503,
         198902,
         42199,
         88811,
         48764,
         43026,
         47046,
         89785,
         63978,
         42029
      ],
      "backdrop_path": "/dUW2RXo6iy6bnRtpi10Kyb113Wx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Nicolo",
               "gender": 2,
               "credit_id": "52fe485ac3a36847f8163245",
               "name": "Tomás Milián",
               "profile_path": "/5ZUu4Zy9kWtYuVES74pbrXqd0FB.jpg",
               "id": 21708,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mavi",
               "gender": 0,
               "credit_id": "52fe485ac3a36847f8163249",
               "name": "Daniela Silverio",
               "profile_path": null,
               "id": 147539,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ida",
               "gender": 1,
               "credit_id": "52fe485ac3a36847f816324d",
               "name": "Christine Boisson",
               "profile_path": "/c0WFIql93xqepWXuOXh13u4PyKc.jpg",
               "id": 91573,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Girl in Swimming Pool",
               "gender": 0,
               "credit_id": "52fe485ac3a36847f8163263",
               "name": "Lara Wendel",
               "profile_path": "/rmbHp41oHQ6E7Wro059Q6Wb56Ve.jpg",
               "id": 32915,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Carla",
               "gender": 1,
               "credit_id": "52fe485ac3a36847f8163267",
               "name": "Veronica Lazar",
               "profile_path": "/rvqiuxdBQm7vK7xMS7ma7IeMWRy.jpg",
               "id": 18339,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Nadia (as Enrica Fico)",
               "gender": 0,
               "credit_id": "52fe485ac3a36847f816326b",
               "name": "Enrica Antonioni",
               "profile_path": null,
               "id": 225921,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mavi's sister",
               "gender": 0,
               "credit_id": "52fe485ac3a36847f816326f",
               "name": "Sandra Monteleoni",
               "profile_path": null,
               "id": 225922,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Mario",
               "gender": 2,
               "credit_id": "57ef0c2fc3a368766d001268",
               "name": "Marcel Bozzuffi",
               "profile_path": "/vwlGmFLX4493fp6bFGrP89ejzf8.jpg",
               "id": 15184,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "The Gorilla",
               "gender": 2,
               "credit_id": "57ef0c3c92514141d900123f",
               "name": "Gianpaolo Saccarola",
               "profile_path": "/iS0vMT0iox9kJRYiM8Jfp9THbgP.jpg",
               "id": 84309,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Landlady's Friend (as Maria Stefania D'Amario)",
               "gender": 0,
               "credit_id": "57ef0c4e92514141db00121d",
               "name": "Stefania D'Amario",
               "profile_path": "/jr0QtBAZedPGTDMcp9vGnd1IpVJ.jpg",
               "id": 100411,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe485ac3a36847f8163241",
               "name": "Michelangelo Antonioni",
               "profile_path": "/hidC1Wcy0uM9yOy0sHEvvl2vRB6.jpg",
               "id": 15189,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe485ac3a36847f8163253",
               "name": "Michelangelo Antonioni",
               "profile_path": "/hidC1Wcy0uM9yOy0sHEvvl2vRB6.jpg",
               "id": 15189,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe485ac3a36847f8163259",
               "name": "Michelangelo Antonioni",
               "profile_path": "/hidC1Wcy0uM9yOy0sHEvvl2vRB6.jpg",
               "id": 15189,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe485ac3a36847f816325f",
               "name": "Gérard Brach",
               "profile_path": null,
               "id": 2356,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "590dc5f49251414e9200e9b8",
               "name": "Carlo Di Palma",
               "profile_path": "/i9bOfpLR2V68gGYv0yqJkjF6qiT.jpg",
               "id": 15194,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.392172,
      "production_countries": [],
      "id": 53234,
      "vote_count": 19,
      "budget": 0,
      "overview": "The movie director Niccolò has just been left by his wife. Subsequently he embarks on an obsessive relationship with a young woman who eventually leaves him and disappears (shades also of L'Avventura) while searching for her, he meets a variety of other willing girls. This gives him the idea of making a movie about women's relationships. He starts to search for a woman who can play the leading part in the movie.",
      "similar": [],
      "original_title": "Identificazione di una donna",
      "runtime": 128,
      "poster_path": "/ggfhKGWsJ6A07jXqWdP877ToDyo.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [],
      "release_date": "1982-10-21",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michelangelo Antonioni"],
      "runtime": 128,
      "synopsis": null,
      "writers": [
         "Michelangelo Antonioni",
         "Michelangelo Antonioni"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0084116/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NTM5ODMzNF5BMl5BanBnXkFtZTcwNDk0NDA1NA@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tomas Milian, Daniela Silverio, Christine Boisson | See full cast and crew »"],
      "reviews": [
         "A very beautiful film with that special Antonioni atmosphere. I can identify with the feeling of emptiness and the people who can´t really communicate with each other. Modern life and adulthood seems shallow and a bit soulless. You have to fill it with something and make it human again. The first time I saw it I was disapointed but it improved greatly with the second viewing and I want to see it again. There are new things to discover each time as with all of Antonionis´ films.",
         "(sort of spoilers, i suppose) Identification of a Woman was Antonioni's first film in Italy since the beautiful Red Desert. And its a quieter, more mature film than his international films. I'm glad I saw Identification of a Woman because it contains one of Antonioni's most beautiful sequences: the scenes in the fog, with people disappearing and reappearing. And also because we have something here we don't always have: characters and what almost resembles a story. We have an Antonioni-esque film director looking for the ideal female face for his next film. I think the film's about how men misunderstand women. They're only spying on them (spying is a recurring motif in the film), looking on from the outside, as if they were merely faces: I think this is why the (approximate) story of the film centres on a man looking for the perfect face for his new movie (ie, not the perfect woman). Be prepared, though, to not hold up hopes that Antonioni will stick with this story - because its left for you to decide whether a face, or a woman, are identified. This is not a flaw in the film - it was Antonioni's trademark. But if you only had so many hours of your life to spare for Antonioni films, i don't recommend you use up two on this one. It definitely doesn't have the passion and enthusiasm of Zabriskie Point - aside from his great works (L'Avventura, La Notte, L'Eclisse, Red Desert, The Passenger), i'd recommend you see the visually exhilirating Zabriskie Point instead of this. Caution: fairly extreme nudity and sex, mostly not of an erotic nature, but fairly intense (not rape or anything like that... just fairly hungry, physical sex).",
         "This is probably obvious, but if you don't like Antonioni, stay away from Identification of a Woman. If you've never seen another, check out one of these films first: L'Avventura, La Notte, L'Eclisse, Red Desert, Blowup, The Passenger, or Zabriskie Point. If you are a fan of Antonioni, like myself, please do check out this film. It is definitely one of Antonioni's weaker films, but it is still undeniably in his style and containing his regular themes. This one is about a film director who can be said to fall in love with a woman (who, incidentally, looks a lot like a very young and extraordinarily thin version of Monica Vitti), but he can't express that love. The woman is upset at this and disappears. In some ways, this is like a weaker version of L'Avventura. The man tries to get on with his life, begins dating again, but eventually realizes that his mind revolves around the girl who abandoned him. This film is disappointing, especially if you're in love with Antonioni the director. The direction is generally flat. Only a few scenes show his supreme visual style. 6/10.",
         "\"Men get laid, but women get screwed.\" - Quentin Crisp Man returns to his empty home. Man tries to outsmart security alarm but sets it off. Concerned neighbour arrives, asking if there has been a break in. Man says no. Later he will dismiss the existence of robbers altogether: \"people of the night are innocents like us\". Where, then, does misunderstanding and paranoia originate? Man is revealed to be film director in search of the subject matter of his next film. Man uses relationship with women to fuel his imagination. Man's proclamation: \"woman is art.\" Film's title? \"Identification of a Woman\"; a search for the perfect woman, perfect work of art - the idealised image. Director Michelangelo Antonioni develops theme: study of female form inspires the nature of the cinematic form. Art and sex intertwine, a libidinal extension of male artist. Man believes himself to be creator, conqueror, artist. Man believes woman to be object, passive, art. Film exposes male arrogance: woman should be like nature. Relationship with woman should be filled with mutual silence, her innate physical responsiveness mirroring the purely physical and silent response of the wild outdoors. She should be passive and non-judgemental. More importantly, woman should be without an identity and completely without a gaze. In other words, perfect woman is without eyes, perfect woman is devoid of perception, perfect woman is submission, perfect woman is robot. We recall the robot alarm that catches its owner sneaking into his own home. When the robot sees, the subject feels guilt. Film director embarks on two affairs with two different woman. First relationship marked by wild, carnal sex. Couple seemingly content, but relationship confined to bedroom. Relationship expands and man feels belittled by woman's wealthy friends, family and air of sophistication. Being with woman means being in her gaze, being subjected to her opinions, perceptions and \"universe\". Man wants woman stripped down, devoid of all context but his own. A \"mysterious man\" leaves threatening messages. He orders director to stay away from first woman. In response: alarm bells. Hero grows paranoid and takes first woman to remote location where he can have her \"all for himself\". On the way to remote location, couple is trapped in fog. Fog represents truth of their relationship: they are mystery to one another, living in a haze, sharing flesh and nothing else. Couple reach remote location \u0096 a home in the woods \u0096 and find it inhabited by strangers. Ontological shock: man cannot have woman alone. The closer man gets, the more he is forced to accept that he has to share. Man cannot cope. He loses woman to, he believes, the \"mysterious man\". But there is no \"mysterious man\". He is a figment of the imagination. Paranoia. Jealousy. Competition. Woman as barred subject and fictional Other as harbourer of all pleasure. It is too much. To cope: first woman revealed or rationalised to be lesbian. Scar her. Woman walks by a department store window where a display model of a naked man stands. Woman tells man that her friends love the model and often take pictures of it. Scene offers ironic commentary on love: attraction starts with the body and the eye (camera), and the presence of the body and its signs is that which creates the imaginary romantic link between two people. The model in the window is the male equivalent of the alluring, one-dimensional silent partner that the male director wants to find for his cinematic inspiration. Man and first woman split. Director then embarks on relationship with second woman. She is identical image of first woman. Difference: aroused by horses, by nature, looks up to director, has no class, no social ties. She pees on toilet seat, naked, wipes herself. Kubrick borrows image. Antonioni steals from Godard's \"Contempt\". Modernist interests intersect. Director gradually revealed to be visually and tactilely oriented. He ignores words. Male brain: sight and touch. Case in point: telephone conversation where he meets first woman. He asks for her to visually describe herself. His eye is attuned to the perfect camera angle. When he looks at women, he makes them uncomfortable. \"Are you trying to frame a shot?\" they ask. (again, links to Freud and Kubrick's \"Eyes Wide Shut\", where man's desires exist in image space, woman's desires recounted in the realm of words and monologues) We meet a strange girl at poolside. She says she prefers being masturbated by other woman, rather than having sex with men. According to her, men only use sex as an occasion to express their virility, strength and dominance. Man and new woman share time. He pushes her away from public events. He wants her to himself. He takes her on a boat, out in the middle of the ocean. Alone. He tells her that he can best love her in solitude, her surrounded by him, everything else excluded. Solitude shattered in next scene. Woman magically reveals she is pregnant. Man knows it is not his baby. Again, the intrusion of some Other man's desire. Man wants only his uninterrupted desires. Furthermore, man doesn't think \"mother\" can be artistic muse, a mysterious presence, an erotic gravitational force. Muse must be object. Art. Ambiguous ending. Silly spaceship travels toward sun. Can the sun be understood? Can its energy be harnessed? How close can the spaceship get, before burning up? Can the erotic attraction, the gravitational pull, of two ordinary everyday people exist without either becoming banal or exploding in a ball of self-destructive fire? Is this the illness of the idealist or the artist? Antonioni doesn't say. Film's last words: \"And thereafter?\" 8/10 \u0096 First viewing: boring, annoying. Second viewing: film inserts its fangs and sucks you in, every scene ominous, powerful. Antonioni: proto-feminist, captures the modern condition, loves ellipses, fascinating.",
         "Possibly the most atmospheric film I ever seen, it made a huge impact when I first saw it, and that opinion has never changed. If there is one film that conveys the mystery of life this is it. It is also a highly evocative picture of Italy from the perspective of the upper middle classes in the late Seventies. Crying out for a DVD release as the photography was excellent too on the original film showings.",
         "Antonioni’s last film prior to his suffering a stroke is this very typical effort (co-written with Gerard Brach and Tonino Guerra), dealing with a number of key themes that run through his work – lack of communication, the mystery-as-journey-of-self-discovery, etc. That said, the film wasn’t picked up for U.S. release until 1996 and is subsequently perhaps the least-seen of Antonioni’s films from his post-AVVENTURA phase! Anyway, the mystery element links the film with the director’s earlier BLOW UP (1966) and THE PASSENGER (1975); still, it’s never as intriguing here as in those more celebrated titles (especially since, for once, it’s explained away at the end!)…but, as I said, the film eventually emerges to be more about the mid-life crisis of its central character (despite the title). Interestingly, he’s a film director – though “Euro-Cult” favorite Tomas Milian feels as incongruous to Antonioni’s cinema as Marcello Mastroianni’s presence had been in LA NOTTE (1961)! He has an obsessive relationship with a young woman (even enjoying some LAST TANGO IN Paris [1972]-type sex scenes!) who eventually leaves him and disappears (shades also of L’AVVENTURA [1960]); while searching for her, he meets a variety of other willing girls (among them Antonioni’s own future wife Enrica Fico). Marcel Bozzuffi appears in one brief, irrelevant scene as Milian’s brother. Overall, the film is tiresomely long and often mirrors the tedium experienced by the characters; the ending, however, is a beauty – suggesting that, even if he’s a failure at love, a film director is still left with his imagination. Carlo Di Palma’s cinematography is notable, too – particularly at the Venice location (where, coincidentally, I saw the Antonionis three years ago!) and during the tense fog-bound sequence; the film’s score, then, is a mix of electronic, ambient and pop – and all very much of its period. As was the case with THE PASSENGER, THE MYSTERY OF OBERWALD (which is now one of only two features by the director I’ve yet to catch up with!) and BEYOND THE CLOUDS (1995), Antonioni had a hand in the editing of the film; here, he receives sole credit for this and the result makes especially effective use of ellipses (the factors of time and space had always been a primary concern in his work – thus making the apparently mocking recourse to science-fiction at the end anything but coincidental!).",
         "I can understand why this film has received 10/10 - it's excellent. Perhaps the most surprising element is the ending - it's in such strong contrast to the rest of the film, that it is akin to a psychological 'splitting off' by the main character, Niccolo. As he gazes into his own imaginary world, he experiences, in imagined dialogue with his nephew, a scenario from a film he may direct - a spaceship flies towards the sun, which appears to explode or expand, and fantasises about receiving the answers 'to so many things'. It links in with the 'sun expanding' headline glimpsed from a newspaper earlier in the film, and works well for this ground being set for it. I cannot decided whether this ending is bleak or hopeful - whether he escapes into a world of fantasy because of his inability to face up to the pain involved in looking at his impotence in resolving the relationship issues in his life; or whether it is a transcendental ending, in which he uses his situation to plunge into a creative world. It's this ambiguity (and lack of didactic intent from Antonioni) which gives the film its quality and power.",
         "I think there are no such things as popular movies or intellectual films. there are good films and bad ones. Whether they are westerns, film noirs, comedies or action movies is irrelevant. some of them speak to you as if you were a nut-head, others as if you were able to share their vision and if necessary think by yourself, not mentioning others who would simply insult a 5-year old. This movie definitely falls in the second category. First of all it is visually rewarding. Antonioni is a painter in films and every scene, every shot is beautiful and interesting. As to the plot and characters, they are puzzling, for, as in all Antonioni's movies, they never act or react as expected. There is mystery, in every scene. It is so modern that not many films of today can compete. The love scene for instance is unrivaled in today's cinema and makes \"Basic Instinct\" look like sexual excitation seen through the eye of mickey Mouse. It's a film about creation, fatherhood, what it is to watch and to be watched. it's about cinema!",
         "As introduced by Lorenzo Codelli, Identification of a Woman was presented in the Cannes Film Festival in 1982 and received a special anniversary award. It's like a personal movie because the lead character Niccolo (Tomas Milian) is a film director, and tells of a personal crisis of the filmmaker. Niccolo was played by a leading Italian actor of the time, Tomas Milian, who was famous for his roles in Italian spaghetti westerns, and was an action star. This was essential the last feature film made by Michelangelo Antonioni before his stroke, before which he spent most of the 80s publishing short stories and exhibiting his abstract paintings. And personally, my bad track record with Antonioni's post L'Eclisse movies unfortunately continues. I'm pretty sure I'm missing something very obvious (or could be it so subtle it eludes me?) that I'm finding each of them quite difficult to sit through (save for perhaps The Passenger), and to try and see its underlying meaning. Perhaps I am just scratching the surface and in doing so, fail to appreciate what the movie's about and for. Or maybe Identification of a Woman is indeed the weaker of the lot, because of certain resemblance to plot design with his earlier masterpieces? For starters there seemed to be some repetitive themes revisited, but that I'm fine with because it made it easier to click with and connect. Just like how Niccolo and his squeeze Mavi (Daniela Silverio) spend considerable time at an emotionally empty high society party reminiscent of that in L'Notte, where they nurse issues from the heart, as well as for one to come to terms with the other's secret admirer. Surely the sex is good, and the movie wastes absolutely no time in getting beneath the sheets for some surprisingly erotic time of a horizontal tango complete with underarm forests, but naturally physical love doesn't compensate for emotional depth absent between the lovers, highlighting something inherent wrong in their relationship. Having anonymous threats made to Niccola also didn't help, as he experienced first hand how these threats got carried out to hurt those he loved. We spend a bit of time with their attempts to escape from a stalker, and even had a technically brilliant sequence involving a deep mist that I thought contemporary movies like Frank Darabont's The Mist, or the video game movie adaptation of Shallow Hill, had taken a huge leaf from. For Niccolo's inability to declare his love and address their conflicts, we get a dose of L'Avventura here. Mavi disappears, and we don't really get to see much of her thereafter. Niccolo tries to launch a search, and we get into the second half of the movie where we see his new relationship with a young actress Ida (Christine Boisson). But of course there are issues to grapple with here, and I thought was something I'd understand as well, and that's the continued holding out of the candle for someone else, together with the notion of love versus need, and serving as an emotional crutch. It's not fair of course, but there's more challenges ahead for Niccola in his relationship with Ida to accept, but by the time we get to it, I'd more or less didn't really care for Niccola anymore. Which probably contrasted to a statement which Lorenzo Codelli shared about what Antonioni said regarding this movie being about its characters. I thought his earlier movies had stronger and more interesting characters, or at least those who can hook my attention down and allowed me to care for them a bit, versus those in this movie. Then again, I suspect I may be on a different wavelength since I enjoyed most of Antonioni's earliest works in the 50s, as compared to the more contemporary ones shown this week so far.",
         "Negative reviews or remarks about this masterwork should be ignored. If you follow the director's career from his first films forward, this investigation places among his greatest works. His concerns, (with the impossibility of a personal identity, with a default identity in/as landscape, cityscapes, with ravishing interiors and an exterior world that is terrifyingly beautiful, fraught with allure and menace in equal parts), are fully realized here. There are no \"howlers,\" the dialog is never precious nor pompous nor pretentious, and when heard in Italian, is, like every element of Antonioni's works, determined, controlled, but completely natural, credible. No movie ever made has been less \"misogynistic,\" and the fictional director in the film and the director of the film speak with such candor it's exhilarating. A must-see."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Iterfilm",
         "Rai 2",
         "Gaumont"
      ],
      "summaries": [
         "The movie director Niccolo has just been left by his wife. This gives him the idea of making a movie about women's relationships. He starts to search for a woman who can play the leading part in the movie - but also in his own life...",
         "The movie director Niccolò has just been left by his wife. Subsequently he embarks on an obsessive relationship with a young woman who eventually leaves him and disappears (shades also of L'Avventura) while searching for her, he meets a variety of other willing girls. This gives him the idea of making a movie about women's relationships. He starts to search for a woman who can play the leading part in the movie."
      ],
      "budget": 0
   },
   "movielensId": 1360,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Italiano"
      ],
      "releaseDate": "1982-10-21",
      "dvdReleaseDate": "2011-10-25",
      "directors": ["Michelangelo Antonioni"],
      "runtime": 128,
      "movieId": 1360,
      "title": "Identification of a Woman",
      "mpaa": null,
      "actors": [
         "Tomás Milián",
         "Daniela Silverio",
         "Christine Boisson",
         "Lara Wendel",
         "Veronica Lazar",
         "Enrica Antonioni",
         "Sandra Monteleoni",
         "Marcel Bozzuffi",
         "Gianpaolo Saccarola",
         "Stefania D'Amario"
      ],
      "imdbMovieId": "0084116",
      "originalTitle": "Identificazione di una donna",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The movie director Niccolò has just been left by his wife. Subsequently he embarks on an obsessive relationship with a young woman who eventually leaves him and disappears (shades also of L'Avventura) while searching for her, he meets a variety of other willing girls. This gives him the idea of making a movie about women's relationships. He starts to search for a woman who can play the leading part in the movie.",
      "tmdbMovieId": 53234,
      "avgRating": 3.24219,
      "releaseYear": "1982",
      "numRatings": 64,
      "posterPath": "/ggfhKGWsJ6A07jXqWdP877ToDyo.jpg"
   }
}