{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "child murderer",
            "id": 1468
         },
         {
            "name": "arkansas",
            "id": 5521
         },
         {
            "name": "right and justice",
            "id": 6145
         },
         {
            "name": "miscarriage of justice",
            "id": 188775
         }
      ],
      "imdb_id": "tt0117293",
      "video": false,
      "title": "Paradise Lost: The Child Murders at Robin Hood Hills",
      "recommendations": [
         17208,
         83660,
         2260,
         13591,
         1776,
         52279,
         319079,
         251220,
         13587,
         37926,
         146827,
         126278,
         154612,
         148908,
         86750,
         148664,
         189644,
         147612,
         147396,
         49176
      ],
      "backdrop_path": "/wWwD8DbbMZESJx2djzCBSCQjFUO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself (voice)",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c8cf",
               "name": "Joe Berlinger",
               "profile_path": "/nm1QiopjjZLypVQUjJkJ3SkEGnB.jpg",
               "id": 69237,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Himself (voice)",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c8d3",
               "name": "Bruce Sinofsky",
               "profile_path": null,
               "id": 69238,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe47109251416c7508c8d7",
               "name": "Jessie Miskelly",
               "profile_path": null,
               "id": 81447,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c8db",
               "name": "Jason Baldwin",
               "profile_path": null,
               "id": 81448,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c8df",
               "name": "Damien Wayne Echols",
               "profile_path": null,
               "id": 81449,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47109251416c7508c8c5",
               "name": "Joe Berlinger",
               "profile_path": "/nm1QiopjjZLypVQUjJkJ3SkEGnB.jpg",
               "id": 69237,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47109251416c7508c8cb",
               "name": "Bruce Sinofsky",
               "profile_path": null,
               "id": 69238,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 7.218249,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17204,
      "vote_count": 50,
      "budget": 0,
      "overview": "A horrific triple child murder leads to an indictment and trial of three nonconformist boys based on questionable evidence.",
      "similar": [
         881,
         377,
         393,
         595,
         44264,
         11886,
         11969,
         33,
         79,
         84351,
         82507,
         445954,
         1541,
         821,
         687,
         801,
         832,
         103731,
         9960,
         21191
      ],
      "original_title": "Paradise Lost: The Child Murders at Robin Hood Hills",
      "runtime": 150,
      "poster_path": "/1vrdUPOYC6QcBW1zFoMZuSxilR8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-12-03",
      "vote_average": 7.8,
      "belongs_to_collection": {
         "backdrop_path": "/mFYPaykrXpWewZ1Jxdf9BHQLRw0.jpg",
         "name": "Paradise Lost Collection",
         "id": 105629,
         "poster_path": "/lj7rDHdscgcYjYOzGk2WchDcIjz.jpg"
      },
      "tagline": "Witchcraft or witch hunt?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Joe Berlinger",
         "Bruce Sinofsky"
      ],
      "runtime": 150,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117293/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NjAyNzM2NF5BMl5BanBnXkFtZTcwNTg1NjY4Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tony Brooks, Diana Davis, Terry Wood | See full cast and crew »"],
      "reviews": [
         "I'll admit that I've never been too crazy about documentaries. For one thing, I think that they are generally biased and you are only seeing what the film-makers want you to see. Now, I watched Paradise Lost for several reasons. One, I've always been intrigued by peoples' ignorance and I'm still amazed at how quick they are to point a finger at something they know nothing about. Several years ago, I remember this story being all over the news, and the way it was presented then, it was very easy to believe that these three outcasts were the killers. I've been through West Memphis numerous times since the killings and I still get the chills everytime I pass by the Blue Beacon truckwash. I sat down to this three hour film with a pretty open mind. While the film doesn't really answer any questions, it does bring a lot to mind and never takes sides on whether the boys did or didn't do it. That's what I admire about the film-makers. They managed to stay almost completely neutral, no matter what their feelings or opinions may have been on who the actual murderer(s) were. Watching this movie is scary. I've polluted my mind over the years with just about every junk-horror movie that I could find and nothing has given me that icy feeling quite like this has. I've seen it three times now and it never loses its impact. For those who don't know, here's the story: In West Memphis, three young children are found mutilated in a patch of woods just off the interstate. For no real reason whatsoever, three nonconformist teens are brought to trial, one of which has an I.Q. that is somewhere in the 70s. When he gives a very phony sounding confession, the trials begin with absolutely no other evidence to prove that the boys are guilty. Throughout the film, we meet each of the deceased boys parents, the defendents, and the defendents' families. Most angry of all are the parents of the Byers boy who was murdered. Now, before I get started on the step-father Mark Byers, I really want to say that I can totally empathize with the guy and his rage is completely understandable. However, what I really can't get past is the guy's bizarre behavior and the impression that he left me with. The guy takes up a lot of screen time. I know that the guy is a jeweler by trade and acting may not be his thing, but this is a DOCUMENTARY and while watching him, on more than several occasions I got a little confused. Yeah, the guy has some mental problems, he's on numerous medications, he's suffering from a brain tumor and he's going through some major grieving. But why does he act like he's been watching TOO much WWF? His lines are straight out of a BAD movie and if this is how the guy really is, I'm staying the hell out of this guy's way. Throughout the film there are several subtle (or not so subtle) indications that he may be a suspect. The fact that he gave one of the film-makers a bloody knife as a Christmas present more than proves that the guy is a little off his rocker. He even admitted to having beat the child the day that he was murdered. Remember, there is absolutely NO physical evidence to pin on the accused and the only thing that got them there was a false confession given by a legally retarded teenager who had been interrogated for hours. Oh, and did I mention that his story KEPT changing? Listening to Jesse Misskelly, the time that the boys were murdered takes place all over the clock. Once, he states that the boys were murdered in the A.M. hours, then during broad daylight, then at night. I don't get it. It didn't matter to the jury. Two of the boys still got life sentences and the other (Damien Eckols) got the death sentence. His crime is that he had a fondness for wearing black, had a bad haircut, and a slight interest in Wicca...Not a whole lot different from myself. Anyway, there is also mention of another mysterious person who made an appearance in a Bojangles restaurant restroom, covered in blood. Oh yeah, that is another issue that is barely mentioned, and then dropped. After seeing this movie, I was still terribly confused and my questions were still unanswered, but I guess that is the sign of a good documentary. I'm really glad that the film-makers stuck with the facts and never let their opions get in the way of making the film. The sequel is also very good, but still leaves nothing answered. Now, it's been several years since the first time I watched this but the boys are still in prison, still trying to get out. I reccomend this film to anyone who has ever been criticized for their appearance. It'll make you realize just how lucky you are, while questioning the justice system at the same time.",
         "The question at hand in the film Paradise Lost is not as much did these three teenagers commit this heinous act, but rather was there enough evidence to convict them for the murders. The answer, presented by material in the film, is an unflinching no. There was only speculation and rumor to convict the three. The film's strengths are that it doesn't preach, at least not in an overly wrought narrative, and it contains intimate moments with the accused and their families as well as the families of the victims. Being a victim of a violent crime to something of this degree I understand the pain and confusion of the victim's families. What is hard to understand is the bloodlust and need for revenge and retribution that immediately takes hold of them. The victims' families are the most terrifying aspect of this film. At one point the mother of the Byrnes child says in a hateful and spiteful tone \"I hate them... I hate them and the mother's that bore them.\" Is there anything wrong with being hellishly angry with someone who has butchered your child? No, quite natural really. But the point of this film is that judgment was passed on these kids long before the trial even started. I imagine the Bible belt is a very scary place to be raised in... I'll have to ask Brad Pitt what he thinks about it some time. On the issue of the prosecution. They had next to nothing. A very questionable confession from a terrified kid, Jessie, with a 72 IQ, hearsay from a couple of kids who claim they heard Damien bragging about the murder but have no proof, a knife found behind Damien's house which doesn't match the wounds on the bodies, and the assertion that because Damien read about Wicca, he must be a Satanist. To look at the three kids is also an interesting aspect of the film. Jessie, a very small and slow kid seems a bit lost in the world. His IQ is low but he has no previous records of any type of behavior that would associate him with murder. Jason speaks in short breathless words and seems also to suffer from a low IQ. Damien is the key to everything in this film though. The defense made the key mistake of letting Damien take the stand for two reasons. The first reason is that Damien appears to have ADD and after the first 10 minutes of questioning he sort of fades away and answers in bland yes and no's. The second reason, and the most important, is that Damien is obviously extremely bright. Normally this wouldn't seem to be a problem but judging from every single person the filmmakers put on camera, smart people are hard to come by in that area of the world. Damien scared them. All of this adds up to the fact that there was not enough evidence to put these kids away and there were other, more sinister and shocking, suspects that needed to be pursued. The war rages on for the West Memphis Three and it is indeed frightening to think that they did it, and terrifying to think they didn't.",
         "Absolutely haunting. This chilling account of murder and the search for justice will leave you open-mouthed and shocked for the tale is not a pretty one. Three eight year old boys are brutally slain (and there is graphic footage so this is not for the faint of heart), but the focus of the story is upon the three teenagers of this Arkansas town who are put on trial for the killings. And as the film unfolds you begin to wonder if the boys are truly guilty of this heinous crime or are being persecuted for being different in a town that locks different away. In the end, you are your own jury in determining the guilt of these black-wearing, Metallica-listening boys who didn't quite fit in. If you can stomach the upsetting scenes and the entire idea (which I admit put me off for a long time) you will find the film completely consuming. Unable to tear your eyes from the screen, the story and the boys who lived it will stay with you forever. Simply incredible.",
         "Absolutely shocking and riveting from beginning to end. A brutal murder of three young boys leads to the wrongful conviction of three teens who were fingered for the crime because the police and townspeople found them \"weird.\" Two of the teens are currently (2004) serving life sentences, and one is sitting on death row! This documentary brilliantly unfolds the story of the tragedy in West Memphis through interviews with the murdered boys' families, the accused and convicted teens, and footage of the court trials. The directors remain unbiased and let the audience decide for themselves \"who did it,\" but there's no disputing that the police investigation was a travesty and that the West Memphis Three did not get fair trials--were found guilty before even taking the stand. Also check out the sequel: \"Paradise Lost: Revelations.\" Be warned, though--both documentaries will make you want to scream with the injustice of it all, and rightfully concern you that despite an absence of any physical evidence linking three young men to a crime, and despite mounds of evidence indicating that the young men are innocent, the desire by influential individuals to convict won out over justice.",
         "If you have ever doubted that there are some serious injustices in the political system, you must see this film. This is a documentary about three teenagers who are accused of being murderers simply because they aren't conformists. They are accused of murdering three innocent children, despite there being no evidence, no witness testimonies, and not a single shred of a motive, reason, or cause. The three teenagers who are convicted are Jessie Misskelly, Jr. who is a mentally impaired young man, Jason Baldwin, who is a thin, shy, and slightly underweight kid, and Damien Wayne Echols, who is into metal music, wears black, and is part of the Wiccian religion. There are the three children who are murdered, Christopher Byers, Steve Branch, and Michael Moore. The opening sequences depict the findings of the bodies in the woods. Christopher Byers looked to have been beaten to death after his genitals were mutilated. Steve Branch and Michael Moore were suffocated. There is not a single drop of blood at the murder scene despite the fact that Christopher would have bled profusely if his genitals were cut off, and yet everyone seems to be extremely convinced, for some reason, that the murder of Christopher occurred in the woods. It's possible that Michael and Steven were drowned nearby, but there doesn't appear to be any sign of a struggle. The parents of these innocent victims seem hellbent on insuring that Jessie, Jason, and Damien did it, despite there being nothing to even suggest. There are rumors of them being seen planning the murders, but those don't have any real backing. Meanwhile people make up stories about Satan worshiping and that the murder of these three boys involved some sort of sacrificial ceremony. You have got to be kidding! Why on earth would people believe this stuff!!! The town of West Memphis Arkansas is blinded by their religious faith that they aren't seeing things in a reasonable and more realistic light. This film contains footage of absolutely everything. Once you see it, you can decide for yourself if they did it or not, but I don't see any connection. Sorry.",
         "I remember watching this documentary when it appeared on HBO and being completly disgusted. This was a witch hunt. The trial of these boys was based more on their look and taste in music more than actual hard evidence. I grew up around this area and I know exactly what it's like to be a noncormist..you're automatically accused of being a satanist and associated with murders just because you look and think a certain way. Now I can't honestly sit here and say that these boys didn't do it..because I don't know..it's possible..and my heart tells me they didn't..but ya know i'd look like an ass if the evidence came up that they did. What disgusted me was the trial..and the assassination of the boys . There was no real concrete facts..just their lifestyle of music and fashion. The second one focused more on the father of the murdered children..all evidence pointed at him and away from the boys..just my opinion. This is a disturbing look at corrupted justice in the Bible belt.",
         "This film left me with a bad taste in my mouth. Not that it was gruesome -- it is, but I've done research involving reading coroner reports, so gruesome I can cope with. It was the unanswered questions and the unasked questions. It seems so utterly implausible that a jury could have convicted any of the suspects that I wonder what the filmmakers did not show us. Specifically, I wonder about the fiber evidence, which was the only real physical evidence at all. I could only rate this documentary a 7 out of 10 because of the unasked questions and the evidence we were not shown. I would like to have come away from watching Paradise Lost with a clearer understanding of what those jurors heard and saw that led them to their verdicts. Mind you, I don't think those boys did it -- I think that even fiber evidence could have been too flimsy to convict them. But I wish I had been left convinced.",
         "I always believed that a case needed only reasonable doubt to find people innocent. Apparently I was very wrong. I am in no way claiming my support for the three found guilty, but I for one could never convict them based on this evidence. The film shows just how unstable people can be when faced with those that don't conform. I was amazed by how much I disliked the parents of the murdered boys. They ramble and scream about killing these three, already convinced of their guilt. They seem more unstable and threatening to me, and not just because their children have been murdered. No real physical evidence is brought up against the boys, whom should probably start training professional killers on how not to leave evidence at a murder site. I know for a fact that a lot of details were left out of this documentary, and the celebrity worship that has followed the accused since is a bit too much. However this film is terrifying. It shows that just because of the way you look, and what people say about you, can take away your entire life. Make sure to check out all the evidence for yourself.",
         "Truth may be stranger than fiction, but the American courtroom is stranger, still. For the two hours during which I've watched this film I've gained a valuable insight into the nature of the witch trials. I feel powerless, as there is not much I can do to help these kids. But perhaps there is a lesson in it for us, and everyone who has seen the film should have taken some mental notes. First -- never name youself or your children 'Damien' -- especially if you live in the Bible Belt. And, as a general survival strategy, do not be the black sheep of the local community. There may come the time when your eccentric behavior alone will be used against you to sentence you to death.",
         "Despite all the praise this documentary has received, I did not find it very moving at all. Granted, it was a horrible crime, and the footage of the three young victims' bodies was shocking and almost unwatchable. But most of this film serves only to expose the extreme incompetence of everyone involved in the case. With regard to the wrongly(?) accused boys -- never have I seen three innocent people put up such a weak, pathetic fight for their innocence. Most of the time, they stare doe-eyed and slack-jawed in front of the camera, seemingly uninterested in their own fates. Sure, these boys were only 16-17 years old and very scared, but they seem to have no intuition for survival whatsoever in this life-or-death situation. Any realistic grasp of the situation eludes these boys completely -- they behave almost as if they're playing a part in a movie. It is quite possible, and perhaps even probable, that they are indeed innocent, but they themselves do not seem to care, and so dear viewer, why should you? The overwhelming impression I get from these boys is that they lead very boring lives in a very stagnant town, and they know that this whole case is the most exciting thing that will ever happen to them. They seem interested not in the issue of their guilt or innocence, but rather in the surreal quality of their quasi-celebrity (in the end, Damien waxes romantic over the notion that his name will become famous in West Memphis as a synonym for \"bogeyman\", scaring generations of children to come). They are genuinely pleased with all of the attention they're receiving -- not that they have much to say, but they're just happy that someone is asking."
      ],
      "genres": [
         "Documentary",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": ["Home Box Office (HBO)"],
      "summaries": [
         "Berlinger and Sinofsky's documentary of a gruesome triple murder in West Memphis, Arkansas and the subsequent trials of three suspects, takes a hard look at both the occult and the American justice system in 'small-town' America. Three teenagers are accused of this horrific crime of killing three children, supposedly as a result of involvement in Satanism. As in their previous documentary, things turn out to be more complex than initial appearances and this film presents the real-life courtroom drama to the viewer, as it unfolds.",
         "A horrific triple child murder leads to an indictment and trial of three nonconformist boys based on questionable evidence."
      ],
      "budget": 0
   },
   "movielensId": 1361,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-03",
      "dvdReleaseDate": "2005-10-25",
      "directors": [
         "Joe Berlinger",
         "Bruce Sinofsky"
      ],
      "runtime": 150,
      "movieId": 1361,
      "title": "Paradise Lost: The Child Murders at Robin Hood Hills",
      "mpaa": "",
      "actors": [
         "Joe Berlinger",
         "Bruce Sinofsky",
         "Jessie Miskelly",
         "Jason Baldwin",
         "Damien Wayne Echols"
      ],
      "imdbMovieId": "0117293",
      "originalTitle": "Paradise Lost: The Child Murders at Robin Hood Hills",
      "genres": [
         "Documentary",
         "Drama"
      ],
      "youtubeTrailerIds": ["Tfj_bVIwyeA"],
      "plotSummary": "A horrific triple child murder leads to an indictment and trial of three nonconformist boys based on questionable evidence.",
      "tmdbMovieId": 17204,
      "avgRating": 4.06775,
      "releaseYear": "1996",
      "numRatings": 1808,
      "posterPath": "/1vrdUPOYC6QcBW1zFoMZuSxilR8.jpg"
   }
}