{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "painter",
            "id": 437
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "flower",
            "id": 2382
         },
         {
            "name": "bedroom",
            "id": 3303
         },
         {
            "name": "court",
            "id": 6148
         },
         {
            "name": "rabbit",
            "id": 15199
         },
         {
            "name": "epidemic",
            "id": 17995
         },
         {
            "name": " drainage project",
            "id": 33790
         },
         {
            "name": " powder",
            "id": 41276
         },
         {
            "name": "18th century",
            "id": 160279
         }
      ],
      "imdb_id": "tt0117477",
      "video": false,
      "title": "Ridicule",
      "recommendations": [
         100075,
         48216,
         68023,
         64559,
         134625,
         96958,
         50213,
         12652,
         48778,
         49583,
         5040,
         16242,
         42029,
         62978,
         52216,
         76390,
         17376,
         49842,
         1926,
         31300
      ],
      "backdrop_path": "/ucuVVRgPZsER0yqWtvgcrB8Bcj3.jpg",
      "revenue": 2503829,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Le Marquis Grégoire Ponceludon de Malavoy",
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8b7",
               "name": "Charles Berling",
               "profile_path": "/5W9uDe33eFYFNOW5lqJVvlzHkzb.jpg",
               "id": 48576,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Le Marquis de Bellegarde",
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8bb",
               "name": "Jean Rochefort",
               "profile_path": "/A8sLBA6ITG4fhNfziJoHT3iNn2J.jpg",
               "id": 24421,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Madame de Blayac",
               "gender": 1,
               "credit_id": "52fe45189251416c7504b8bf",
               "name": "Fanny Ardant",
               "profile_path": "/ealXbfCd6oCubRDA3PMgKlq6xq.jpg",
               "id": 20234,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mathilde de Bellegarde",
               "gender": 1,
               "credit_id": "52fe45189251416c7504b8c3",
               "name": "Judith Godrèche",
               "profile_path": "/mbIrbBymdMVZIaNv0bDGUXKV7p7.jpg",
               "id": 73937,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "L'Abbée de Vilecourt",
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8c7",
               "name": "Bernard Giraudeau",
               "profile_path": "/ohmkJBS4jqt3DoNf5wM5CxRodG1.jpg",
               "id": 1973,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bernard Dhéran",
               "gender": 0,
               "credit_id": "52fe45189251416c7504b8cb",
               "name": "Bernard Dhéran",
               "profile_path": "/5LQCbs4Wne8HlVjsJufsVOmTgAX.jpg",
               "id": 24532,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "L'Officier Duel",
               "gender": 2,
               "credit_id": "57aa44cbc3a3680ec500211a",
               "name": "José Fumanal",
               "profile_path": "/elv3zqCNIxol5f6NImntATDXmWT.jpg",
               "id": 1184813,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8d1",
               "name": "Patrice Leconte",
               "profile_path": "/dvtsf5ZlmnDOv1AIrG3kvM0tWZ2.jpg",
               "id": 37626,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45189251416c7504b8d7",
               "name": "Rémi Waterhouse",
               "profile_path": null,
               "id": 73938,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45189251416c7504b8dd",
               "name": "Michel Fessler",
               "profile_path": null,
               "id": 63121,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45189251416c7504b8e3",
               "name": "Eric Vicaut",
               "profile_path": null,
               "id": 73939,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8e9",
               "name": "Frédéric Brillion",
               "profile_path": null,
               "id": 73940,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8ef",
               "name": "Philippe Carcassonne",
               "profile_path": null,
               "id": 50516,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8f5",
               "name": "Gilles Legrand",
               "profile_path": null,
               "id": 73941,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45189251416c7504b8fb",
               "name": "Antoine Duhamel",
               "profile_path": "/hvVxYwaaU0TxUCzqh1O3X0HMT3g.jpg",
               "id": 3529,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45189251416c7504b901",
               "name": "Thierry Arbogast",
               "profile_path": null,
               "id": 997,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe45189251416c7504b907",
               "name": "Joëlle Hache",
               "profile_path": null,
               "id": 35394,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.546723,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 12709,
      "vote_count": 42,
      "budget": 3000000,
      "overview": "To get royal backing on a needed drainage project, a poor French lord must learn to play the delicate games of wit at court at Versailles.",
      "similar": [
         80752,
         22705,
         10090,
         2149,
         4995,
         979,
         5559,
         627,
         4247,
         106646,
         122081,
         1948,
         9946,
         14174,
         11559,
         245844,
         1433,
         7457,
         276,
         12994
      ],
      "original_title": "Ridicule",
      "runtime": 102,
      "poster_path": "/wAdYriruxRFtpvZ4na1PBEIkpY8.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Epithète Films",
         "id": 7286,
         "origin_country": ""
      }],
      "release_date": "1996-05-09",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "FRF ",
      "directors": ["Patrice Leconte"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Rémi Waterhouse",
         "Michel Fessler"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0117477/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA3NTkxOTAyNF5BMl5BanBnXkFtZTcwMjg3NDUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Berling, Jean Rochefort, Fanny Ardant | See full cast and crew »"],
      "reviews": [
         "This reminds me a lot of Dangerous Liaisons (1988) and Valmont (1989) in its cynicism and sharp wit. Set in France during the same time period (the eve of the French Revolution--that's the eighteenth century, reviewers), Ridicule concentrates not so much on sexual intrigues (although there is plenty of that) but on cynical wit as though in homage to Voltaire, France's master of satire whose spirit is suffused throughout. First a warning. Don't let the rather gross crudity of the opening scene mislead you. That is meant merely as satire, not as a presaging of further crudities to come. It is also meant as a kind of cinematic joke since there is no comparable female nudity in the entire film. Indeed, there is no comparable, shall we say \"expression,\" anywhere in legitimate filmdom that I am aware of. So let it pass or close your eyes. Charles Berling stars as Gregoire Ponceludon de Malavoy, a country engineer who comes to Versailles to get financial backing to drain a swamp to save the peasants who are dying of mosquito-borne disease. (\"Peasants feed aristocrats as well as mosquitos.\") He discovers very quickly that a way to an audience with Louis XVI is through gaining a reputation as a clever courtier. Guided by M. Bellegarde (Jean Rochefort), a retired courtier himself, Ponceludon quickly picks up the games of wit and ridicule that reign at court. His quick and clever mind and youthful good looks gain the attention of the king's mistress, Madame de Blayac (Fanny Ardant) who demonstrates how access to the king can come through her bedroom. Ponceludon is sincere only in his desire to drain the swamp and so readily allows himself to become another of Blayac's lovers in exchange for a chance to present his program to Louis XVI. At the same time he meets Bellegarde's daughter Mathide (Judith Godrèche), an idealistic beauty with a scientific bent, who is betrothed to a dying old man of wealth and position. They fall in love, but their differing agendas keep them apart. What makes this film such a delight is the delicious way it satirizes the decadent court of Louis XVI. The dramatic irony is superb and absolute in the sense that at no time does director Patrice Leconte give even the slightest hint that any of the byzantine sycophants at court are aware that Danton and the Terror await them. Throw in the impending Industrial (and scientific) Revolution symbolized in the form of Ponceludon and Mathide, and the ancien régime with its antiquated feudal titles and corrupt privilege is seen for what it was, a parasitic anachronism, ripe to rot for destruction. The sets, the direction and especially the acting are excellent. Veteran Rochefort is particularly good in a part that depends on a directive and expressive face amid the whispers at court. Berling is smooth and believable as a man with a noble mission, adroit at repartee, love and dueling, a modest and earnest hero. Godrèche is good, but seems a little restrained here. She is an impossibly healthy, handsome beauty no man could resist. I first saw her as a 17-year-old in The Disenchanted (1990) where her adolescent charm was carefully and craftily displayed by director Benoît Jacquot. Here Leconte concentrates on her strength of character. Fanny Ardant's Madame de Blayac is a Machiavellian mistress of love's duplicity, very much like the Marquise de Merteuil from Dangerous Liaisons and Valmont. Her performance compares favorably with that of Glenn Close and Annette Bening, respectively, although there is an earthy quality to Ardant that seems most realistic. Her character is also more vulnerable. The sets are sumptuous without being artificially showy. The gray, high-topped wigs and the beaked-nosed masks at ball are charming and, along with the gilded attire, the caked makeup, etc., somehow suggest the true state of costume and personal hygiene circa 1784, reminding me that in those days people did not generally wear underpants or take showers. Some bon mots: \"The soul of wit is to know one's place.\" When asked by the king to say something witty about the king himself, Ponceludon returns: \"The king is not a subject.\" The king asks if this is not a (lowly) pun, but is assured that it is a \"play on words.\" When Blayac discerns that Ponceludon is not entirely smitten with her, she responds, \"Learn to hide your insincerity so that I may yield without dishonor.\" The film closes with a scene in England on a cliff overlooking the English channel. Bellegarde and another reflect on the changes after the revolution: \"Wit was the very air we breathed.\" \"Now the bloated rhetoric of Danton rules in place of wit.\" Bellegarde's hat is blown off by the wind. His companion remarks: \"Better your hat than your head.\" By the way, the subtitles (and this is usually not the case) are excellent, inventive and faithful enough, while comfortably brief, to have been done by a professional translator instead of by someone handy who is passably bilingual. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "\"Ridicule\" confirms well a thing: Patrice Leconte is one of the most talented French film-makers that French cinema has known. His gift comes from the fact that ke knows how to find original and eye-catching subjects for his movies and he also knows how to make them fascinating (watch \"mister Hire\" or \"the hairdresser's wife\" to be aware of it). Here, he chose to broach a make his movie around a feeling that men always dreaded: ridicule. The action takes place in 1780, in the reign of Louis XVI. A young noble (Charles Berling) intends to get a meeting with the king, in Versailles. Indeed, he'd like him to lend important sums of money so as to drain marshes infected by mosquitos. This action will enable to save hundreds of peasants. But what Berling doesn't know is that he's not the only one who wants to get a meeting with the king. Hundreds of nobles like him feel the same thing. Above all, according to an elderly noble (Jean Rochefort), when you're in the court of a king, you have to avoid the ridicule which consequences can be disastrous. Berling will learn it, will face it and will just avoid it. You could compare the court of Louis XVI as a jungle where only the strong survive. The strong are those who are quick-witted and skillful-minded. Ridicule invades the weak and leads them to disgrace, even suicide. With this movie, Leconte's aim is at denouncing vanity and hypocrisy of courtiers in the court of the king who take advantage of their privileged situation. An outstanding and precise film-making, a dazzling performance especially Jean Rochefort and some powerful cues (\"now, you mustn't make a single mistake\" said Rochefort to Berling when the last one's going to meet the king). Obviously, the movie doesn't lack ironical humor: when the king asks to a courtier: \"I hope it's not a pun\" and the courtier replies: \"no, Sir, it's a play on words\". Play on words and pun mean the same thing. At the end, a brilliant movie rightly awarded in France where it won the Oscar for the Best movie in 1997",
         "Ridicule is a French film which takes place in 1783, a few years before Louis XVI lost the ability to wear a hat; where \"...in this country, vices are without consequence, but ridicule can kill.\" The film is about the effect of wit and word play on people's lives and careers. Malicious, mannered and highly enjoyable. Charles Berling, Jean Rochefort, Bernard Giraudeau and Fanny Ardant are excellent. A man would be a fool not to want to bed Ardant, and even more a fool to trust her. The love affair between Berling and his deep-diving sweetheart is amusing and endearing. The film is sumptuously mounted. The dialogue is so clever a knowledge of French might be in order, but the English subtitles do a superb job of conveying the witty, cruel, self-serving word play.",
         "I must say that I wish I could speak better French, simply because this film has such a great sense of humor, it would only intensify the hilarity of the picture. The story was not perhaps the most original, then again, what is? This film had heart and a flow about it that was very interesting and pleasing to the eye and soul. Sometimes I hoped that I could see the lives of the other people in the plot, like that little deaf/mute boy, Paul or whatever happened to the abbot? Overall, I must say that the film is beautifully shot, funny in a very literary, upper minded way and a sheer delight. Not for those with a taste for low-brow humor however.",
         "I have to say that this film is certainly not for an audience with a predilection for sophomoric or low-brow \"hu-mah\". The action in this film is nearly entirely a matter of verbal cut and thrust and quick repartee. A period piece shot in pre-revolutionary France in the days of King Louis and Marie Antoinette, Ridicule portrays an era when wit could earn a passport into courtly favor, and one verbal faux pas could ruin a man's reputation and position in society. Charles Berling's performance as Ponceledon, the rustic nobleman trying to bring his petition to drain the disease-infested swamps of his region before the King of France, is in a word, superb... Fanny Ardant is also a well-cast Madame de Blayac, the dexterously duplicitous countess who appears disposed towards aiding Ponceledon in his suit. Ridicule is a genuinely delightful comedy. I recommend it highly even to those who do not speak French. My rating: 9/10.",
         "This is a very very intelligent movie. From a historical point of view, it's perfect! It shows how cruel and vain the French noblesse was before the French Revolution of 1789, and why this country had a revolution! It's also a fantastic movie for the beauty of the French language. Actors are fabulous, with Berling, Rochefort and Ardant. For me, French cinema is always at it's peak when they're doing comedy of historical movies, like this one, or Beaumarchais l'insolent, Marquise, or Cyrano de Bergerac. By the way, I'd like to tell Thefan-2 of Detroit that the Ridicule of the title don't mean Ridiculous. In the Renaissance French language, it means Hard. And that's what is facing Berling, when he wants to get in touch the king to help the poor people of his land.",
         "ONLY ONE SPOILER: When I searched the internet for reviews of this movie, I found several reviews by male movie reviewers who seemed to feel outrage, shock and disgust at the opening scene. I thought to myself, how bad could this be? I mean, what DON'T they show in movies these days? Should I allow my teenage children to see the film? What WAS this scene, and were there more like it? No review was specific as to answering my questions, so my husband and I watched it alone. Here is what that one scene is: A rather graphic scene (zoomed in and lasting a couple of seconds) of a nobleman's genitalia as he is urinating on an aged, disabled nobleman who had ridiculed him some 30 years earlier. Perhaps the outrage, shock and disgust felt by these male reviewers was due to the fact that instead of the typical female nudity we see everywhere in movies, for once we saw graphic male nudity. Who would've thought men to be so prudish? Now, before all you men out there attempt to perform your own version of witty repartee' and strike back at these comments, allow me to add that yes, while this one scene was graphic and shocking, that it was not done for the sake of shock, but rather to show what lengths people in positions of power went to in order to \"protect\" their own positions and sabotage that of others, ranging from ridicule and humiliation to violence and death. While I do not condone gratuitous nudity for the sake of pornography, I do feel this one scene accurately sets the tone of the tale and has meaning in it's ending. For some time I could not understand how the plight of so many French citizens could be so desperate and full of starvation and death while the wealthy did not suffer the same fate, and why nobody did anything to change this. If the portrayal of those in positions of power and wealth in this movie was depicted accurately, it is easy to understand how a once great country failed it's citizens when power and choice was held by those who were selfish, lazy, and possibly worse - silly. King Louis XVI has been written to be by many accounts, a man not able to rule, passive, indifferent to those around him near and far, and unable to repair the damage done by his predecessors, especially King Louis XIV when also abandonment of reason and over indulgence were the rule of the day. Along with the beautiful countryside, architecture and decor, costumes (couldn't they give \"poor\" Mathilde more than two dresses to wear during the entire film?) and great depiction of human nature and our inherent weaknesses, this movie was very entertaining and for me much more enjoyable than \"Valmont\"/\"Dangerous Liaisons\" to which it has been compared. While \"Valmont\"/\"Dangerous Liaisions\" also contained the above attributes, \"Ridicule\" contained an important element they did not - well developed characters and plot.",
         "I have seen this film recently on video after having missed it at the cinema and on TV. I knew it would be all about cruelty of words and superficiality of elites. Indeed, this film is a true gem, very well played, sharp and quick. It tells the story of a young provincial nobleman discovering the Versailles Court as he tries to get funding for his project. What he finds will lead the nobility to its brutal end 6 years later: futility, self-conceit, disinterest to the people's problems, superficiality of relationships (all of which still pervade it modern French elite, to some respects as was evident from revelations of Mitterrand's shameful reign). Of course the political message is important. But equally if not more important -or pleasurable- are the dialogues. French can be so brutal, insidious, cruel, tortured, witty when used a propos that I'm not sure the non-French speakers could get the most of the dialogues. Certainly the absolutely brilliant rhymes contest would be somehow lost in English subtitles. A very good 9/10 for this movie, and a bit less if you don't get the dialogues.",
         "Patrice Leconte's most achieved feature. The scenario mixes wit, cruelty, finest ferocious humor, politics and romance with a rare balance. Rhythm is fast, and the movie is served by a wonderful cast (many actors are among the best stage actors in France), notably main character Charles Berling and Bernard Gireaudeau's abbe de Villecourt. Jean Rochefort's supporting performance is outstanding, as is the impersonation of a Versailles court's bird of prey by Fanny Ardant. All in all, i.m.h.o., one of the best French movies of the 90s.",
         "Sometimes with movie distribution, as with humour, timing is everything. Patrice Leconte's Ridicule is a long way from the best work from almost anyone involved, yet still proved a major art-house success outside France, picking up Oscar and Golden Globe nomination for Best Foreign Film, winning a BAFTA as well as a nomination for the Palme D'Or at Cannes and winning four Cesars, including Best Film and Best Director, as well as another eight nominations in France itself. All of which leaves you with the suspicion that it couldn't have been up against much competition that year. It's certainly not a bad film, but at times it's almost as slight as its subject \u0096 the rules of wit and ridicule at the Court of Versailles under King Louis XVI, where you live or die by the readiness of your wit and where a single misstep can cast you into oblivion. Charles Berling is the impoverished minor aristocrat seeking royal patronage for a drainage project to stop his peasants from dropping like flies only to discover that the only way to get near to the King in a world where wit opens any door is to demonstrate a sharper and more malicious tongue than those around him. Tutored in the rules of engagement by Jean Rochefort's friendly courtier and both championed and checked by Fanny Ardant's court predator, he briefly finds himself a sensation in a world where honesty and wit are so rarely combined, only to find himself heading for a fall. While it's a cut above the usual dry costume drama and passes the time more than pleasantly enough, it never quite escapes the feeling of a safe and predictable morality tale while at times the wit could be sharper and the venom more prominent. There are some fine good moments and Ardant gets a great screen entrance, her servants blowing powder over her naked body, but at the end of the day it manages to be a curious mixture of both a mildly satisfying diversion and slightly less than the sum of its parts. Very much like the Court of Versailles itself\u0085 Whereas Miramax's Region 1 DVD is bare-bones, Second Sight's UK PAL DVD boasts a fine 2.35:1 widescreen transfer as well as a good 52-minute documentary on the making of the film."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Epithète Films",
         "Cinéa",
         "France 3 Cinéma"
      ],
      "summaries": [
         "In the periwigged and opulent France of Louis XVI, an unwitting nobleman soon discovers that survival at court demands both a razor wit and an acid tongue.",
         "To get royal backing on a needed drainage project, a poor French lord must learn to play the delicate games of wit at court at Versailles."
      ],
      "budget": 50000000
   },
   "movielensId": 1365,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-05-09",
      "dvdReleaseDate": "2004-01-13",
      "directors": ["Patrice Leconte"],
      "runtime": 102,
      "movieId": 1365,
      "title": "Ridicule",
      "mpaa": "",
      "actors": [
         "Charles Berling",
         "Jean Rochefort",
         "Fanny Ardant",
         "Judith Godrèche",
         "Bernard Giraudeau",
         "Bernard Dhéran",
         "José Fumanal"
      ],
      "imdbMovieId": "0117477",
      "originalTitle": "Ridicule",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["2ZKG555N6Rg"],
      "plotSummary": "To get royal backing on a needed drainage project, a poor French lord must learn to play the delicate games of wit at court at Versailles.",
      "tmdbMovieId": 12709,
      "avgRating": 3.83097,
      "releaseYear": "1996",
      "numRatings": 1201,
      "posterPath": "/wAdYriruxRFtpvZ4na1PBEIkpY8.jpg"
   }
}