{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "massachusetts",
            "id": 1700
         },
         {
            "name": "passion",
            "id": 2983
         },
         {
            "name": "satan",
            "id": 10138
         },
         {
            "name": "curse",
            "id": 10541
         },
         {
            "name": "salem",
            "id": 33795
         }
      ],
      "imdb_id": "tt0115988",
      "video": false,
      "title": "The Crucible",
      "recommendations": [
         9672,
         3033,
         11012,
         2074,
         47608,
         2149,
         28761,
         11184,
         16992,
         38718,
         61280,
         23601,
         6521,
         15765,
         18417,
         11229,
         10876,
         3084,
         21309,
         10383
      ],
      "backdrop_path": "/qG893i4VHc8qOaCTx9q7iEb6LnM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Proctor",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006291",
               "name": "Daniel Day-Lewis",
               "profile_path": "/hknfCSSU6AMeKV9yn9NTtTzIEGc.jpg",
               "id": 11856,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Abigail Williams",
               "gender": 1,
               "credit_id": "52fe43ecc3a368484e006295",
               "name": "Winona Ryder",
               "profile_path": "/gUyEOZpZlGBUkUxCxyoLEc9WejR.jpg",
               "id": 1920,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Judge Thomas Danforth",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006299",
               "name": "Paul Scofield",
               "profile_path": "/gt4YFHyhE29CfpiZxknPy0aAGx.jpg",
               "id": 13324,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Elizabeth Proctor",
               "gender": 1,
               "credit_id": "52fe43ecc3a368484e00629d",
               "name": "Joan Allen",
               "profile_path": "/Atg0mSjK9Dl98YBsFvBuGO8PG5m.jpg",
               "id": 11148,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Reverend Parris",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e0062a1",
               "name": "Bruce Davison",
               "profile_path": "/kYFBIffblcsbLMITDZYHhVf5c9f.jpg",
               "id": 52374,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Reverend Hale",
               "gender": 0,
               "credit_id": "52fe43ecc3a368484e0062a5",
               "name": "Rob Campbell",
               "profile_path": "/hRJihsQgFfm86htdiM6xL4BpZE9.jpg",
               "id": 2843,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Tituba",
               "gender": 1,
               "credit_id": "55554096c3a368776c000a9f",
               "name": "Charlayne Woodard",
               "profile_path": "/vXtT2E73JwxhT8YIBGPYpD05WbN.jpg",
               "id": 33689,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Ann Putnam",
               "gender": 1,
               "credit_id": "555540b89251411e54000b15",
               "name": "Frances Conroy",
               "profile_path": "/mQsO4JrmYWKTXtFg7u3zhYGiXfM.jpg",
               "id": 4432,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Rebecca Nurse",
               "gender": 1,
               "credit_id": "555540e2c3a3687782000d04",
               "name": "Elizabeth Lawrence",
               "profile_path": "/pnTgD3HOzuOymtT9hyhHZwsXAhD.jpg",
               "id": 53302,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Martha Corey",
               "gender": 1,
               "credit_id": "555541069251411e54000b1d",
               "name": "Mary Pat Gleason",
               "profile_path": "/crJCES2ttMVhuU2gFxrRg1jDWum.jpg",
               "id": 62595,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Mary Warren",
               "gender": 0,
               "credit_id": "55554174c3a3687772000c7e",
               "name": "Karron Graves",
               "profile_path": "/f5B0AZ1OZzJPims0yoNIvNqPXq.jpg",
               "id": 1218004,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Dr.Griggs",
               "gender": 2,
               "credit_id": "555541e19251411e57000bda",
               "name": "Peter Maloney",
               "profile_path": "/q6R13qWu3EzEGuyfz7n30RNllQj.jpg",
               "id": 15415,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Goody Osborne",
               "gender": 0,
               "credit_id": "56b3d22b925141662c00059c",
               "name": "Ruth Maleczech",
               "profile_path": "/5SJ0RzcgA4udbcHLbJsJQ9qZEeE.jpg",
               "id": 156591,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Thomas Putnam",
               "gender": 2,
               "credit_id": "56b3d271c3a36806f80028b3",
               "name": "Jeffrey Jones",
               "profile_path": "/96J47E34mbjqnhiW9dbLuBqyqmD.jpg",
               "id": 4004,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Giles Corey",
               "gender": 2,
               "credit_id": "56b3d2ad92514114e5002abc",
               "name": "Peter Vaughan",
               "profile_path": "/z9ZplbTA1ojYhgZ8kJUKKhsJ7Gs.jpg",
               "id": 386,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e0062ab",
               "name": "Nicholas Hytner",
               "profile_path": "/f0wcakkpI4KKNvQjVj8rOnwSYT1.jpg",
               "id": 55476,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e0062bd",
               "name": "Tariq Anwar",
               "profile_path": null,
               "id": 8219,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e0062c3",
               "name": "George Fenton",
               "profile_path": "/23V03rGdkvNgeiBwLodJzNKdhJC.jpg",
               "id": 1528,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5531078ec3a3684125002286",
               "name": "Andrew Dunn",
               "profile_path": "/vguhffdvBgtxb5Hl08PKZl160en.jpg",
               "id": 8846,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58ab1fdbc3a36875b3000560",
               "name": "Arthur Miller",
               "profile_path": "/9s61iouDh4DhlL4JZOL1ndFMUSa.jpg",
               "id": 36208,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58ab1feb925141155e000578",
               "name": "Arthur Miller",
               "profile_path": "/9s61iouDh4DhlL4JZOL1ndFMUSa.jpg",
               "id": 36208,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 1,
               "credit_id": "58fb9177925141642f010779",
               "name": "Lilly Kilvert",
               "profile_path": "/c1OtwQAEToq4GSFIFY0WYHPkGr9.jpg",
               "id": 9199,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58fb917f925141640b010664",
               "name": "John Warnke",
               "profile_path": null,
               "id": 14608,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "58fb9185c3a36879f400ee5d",
               "name": "Gretchen Rau",
               "profile_path": null,
               "id": 4148,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "58fb918ec3a36879f400ee66",
               "name": "Bob Crowley",
               "profile_path": null,
               "id": 1093779,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 9.416396,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20539,
      "vote_count": 162,
      "budget": 25000000,
      "overview": "The movie is centered around the Salem Massachusetts witch trials of 1692. The movie is based on the play \"The Crucible\" by Arthur Miller. He also wrote the screen play adaptation.",
      "similar": [
         767,
         671,
         672,
         675,
         27022,
         16859,
         290595,
         37430,
         76492,
         159824,
         129,
         673,
         674,
         62213,
         60304,
         321612,
         224141,
         9100,
         68728,
         6435
      ],
      "original_title": "The Crucible",
      "runtime": 124,
      "poster_path": "/q0wALqKrfEt4yA5flGYYkK5skoA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1996-11-27",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Arthur Miller's timeless tale of truth on trial.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nicholas Hytner"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Arthur Miller",
         "Arthur Miller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115988/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3OTc3NzUzN15BMl5BanBnXkFtZTcwODQyMjYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Daniel Day-Lewis, Winona Ryder, Paul Scofield | See full cast and crew »"],
      "reviews": [
         "...And I also happen to be a very critical person of most films. With that being said, The Crucible completely blows me away with its virtually flawless cinematic achievements! Daniel Day-Lewis is absolutely superb as John Proctor; there is no other way to put it. He is simply perfect, from his bitter, withdrawn opening few lines to when he is accused of witchcraft by his former adulterous--and scorned--lover (Winona Ryder) and begins passionately fighting for his very life and existence--and, of course, his name. Winona Ryder turns in a beautiful performance as the disturbed and tragic Abigail Williams: a Puritain orphan raised by her super-strict, brutal, and overall villainous uncle. She becomes infatuated with John Proctor, a married man and a bit of an outcast to their society, and is willing to do anything and everything to 'obtain' him, if you will. Joan Allen's Oscar nomination for Best Supporting Actress was not undeserved. Her portrayal of the honest and saintly Elizabeth Proctor (not fake innocence, like Abigail's) was touching and a bit heart-wrenching toward the end (won't give that away here). It wasn't just the awesome acting that won me over, but the authentic Old English dialog, the somewhat grainy cinematography (which provided an uneasy feeling in viewing the town of Salem), and wonderful sets and costumes that really made this a classic for me, and my all-time favorite movie. Highly recommend it! A perfect 10/10!",
         "Based on possibly the greatest play ever written, The Crucible is a fabulous movie - it's hard to believe that it was actually distributed by 20th Century Fox, and not an independent company. Why it took so long to be adapted for the big screen is just baffling to me. Thank God that the genius behind the original text, Arthur Miller, was permitted to write the screenplay - and get an Oscar nomination for it! The cast are all to die for, with Winona Ryder proving she doesn't always have to play lovable characters like Charlotte Flax in Mermaids (1990), or Jo March in Little Women (1994) - her performance as the malicious Abigail Williams is just as outstanding. In her Oscar nominated portrayal of Elizabeth Proctor, Joan Allen leaves an indelible impression of marvellous acting. I was in tears in the scene where she and John Proctor (Daniel Day-Lewis) fall in love all over again. I sincerely hope that The Crucible will be shown in schools/colleges in years to come, to remind us of the horror that occurred in 17th century Salem. A work of cinematic genius.",
         "For my eleventh grade English class, I have just finished reading \"The Crucible\" and have also finished watching the movie adaptation. \"The Crucible\" which was written by Arthur Miller, is a shocking look into the events of a tragic period early in history that America will not likely forget. The setting of \"The Crucible\" is that it takes place in the Puritan community of Salem, Massachusetts in 1692. The story revolves around the hysteria caused by the Salem Witch Trials. John Proctor (Daniel Day-Lewis), the story's protagonist (or should I say antagonist?), is facing a little bit of a moral dilemma. It turns out that Abigail Williams (Winona Ryder), Proctor's former servant girl and mistress, along with several other young girls, were caught out in the woods dancing. Apparently, from the evidence, Witchcraft was taking place. John's wife, Elizabeth (Joan Allen), is suffering because of his lechery, but deep down thinks that she may be partially responsible. Reverend Parris (Bruce Davison) calls for Reverend Hale (Rob Campbell), a renowned pastor (and self-proclaimed paranormal expert) to come to Salem to investigate the accusations. John Proctor is sort of an innocent in this story. In the beginning of the play, we see that he is deeply haunted by the affair, but he keeps his head up about it. He is powerful of body, even-tempered and not easily led or quick to jump to conclusions. He changes significantly because he begins to lower his self-esteem, especially after he looses control over his current servant girl, Mary Warren. His change furthers because he later admits his sins, which leads to his inevitable imprisonment. While in prison, he learns that his wife has become pregnant, and therefore she will not be hanged. In the end, John is hanged after signing a confession and then ripping it up when he learns that it was to be nailed onto the church door. However, he did not die in bad spirits because he had accepted the fact that he was not coming out of this situation alive but his name would go untarnished. Proctor pleas before his execution, \"Because it is my name! Because I cannot have another in my life! Because I lie and sign myself to lies! Because I am not worth the dust on the feet of them that hang! How may I live without my name? I have given you my soul; leave me my name!\" Elizabeth Proctor is sort of an innocent too. At the very start of the play, we see that she is a rather soft-spoken person, even with her past grievances. As well, she is an honest person who always tells the truth and never lies. She changes, however, when Abigail Williams brings charges of Witchcraft up against her. Her physical change starts when she discovers that she is pregnant. By the end of the play, she forgives John for his lechery. She states, \"He have his goodness now. God forbid I take it from him!\" This simply goes to show that she truly loved him in the end. Lastly, there is Reverend Hale. At the beginning of the play, we see that he is a very confident man. He seems to consider himself an expert in the field of Witchcraft and goes about promoting that image with the aid of his countless books. The books, he thinks will solve all of the problems facing Salem. When Reverend Parris makes a comment about how heavy his books are, Hale simply replies, \"They must be; they are weighted with authority.\" This goes to show that he puts too much faith into his books and not enough into common sense. His emotional change begins when the good and well-respected people of the Salem community start being accused of Witchcraft, like when Abigail Williams charges Elizabeth Proctor as being a witch. By the end of the play, he discovers that all of the accusations were in fact a hoax, orchestrated by Abigail Williams who shortly before the end of the trials, mysteriously disappears along with Mercy Lewis. He feels deep regret and extreme guilt for not trying to stop the madness sooner. He is also begging John Proctor to save his life, regardless of the possible aftermath in which his name is going to be corrupted. In many ways, the story of \"The Crucible\" may not just be a dynamic character study, but it is also a study of the madness that can stem from superstition and fear. It simply amazes me that one little girl was able to use fear and superstition as a means of getting what she wanted. The madness that had been created by the Salem Witch Trials was not just the result of people's greed, but jealousy and all-out hatred for one another. And you must remember that this is coming from a religious community that had come to this country to escape hatred, though it was not the same type as it was the reason for them leaving Europe. For many bizarre reasons, \"The Crucible\" has also been the unfortunate target of misguided criticism. These criticisms, I feel, are the unfortunate result of the Joseph McCarthy era. In 1950, McCarthy who was a senator from Wisconsin had engaged on a \"Red Hunt\", which to him, was a hunt for suspected Communist Party members and spies inside the U.S. State Department. Though this was relatively early in the Cold War, he had played on Americans already stemming fears of the Soviet Union in order to help rally people to flesh out the suspected persons. Many of the people who were accused, lost their jobs and had extreme difficulty finding employment elsewhere. McCarthy, like many of the people during the Salem Witch Trials, had engaged on this hunt out of sheer hatred and jealousy of other people. And like when the Trials finally came to an end when the governor's wife had been accused of Witchcraft, McCarthy met his downfall in 1954, when he began attacking members of the United States Army. The Army immediately took dislike to the accusations and struck back at McCarthy. His power finally fell through when then President Dwight Eisenhower launched his own investigation into the accusations and found nothing. McCarthy later died in 1957 of alcohol-related problems. Do you see all of the parallels between the Salem Witch Trials of 1692 and the McCarthy era during the 1950s? These are perfect examples of the horrible things that people are capable of doing to each other out of the pure hatred and the accusers will often succeed in doing this by playing on people's fears and local superstition.",
         "There is nothing I like better than a good play for the stage, even when it is on screen. This is the second time I have been able to see this worthy conversion of Arthur Miller's classic play adapted to the screen. Nicholas Hytner certainly earnt his wages; and all the cast should have received a good pay-rise. Convincing scene-setting in Massachussets at the end of the 17th Century with heavy wood-framed farm buildings and typical North European immigrant peasants' clothing, all beautifully filmed. Arthur Miller himself collaborated on the script, allowing certain poetic licence in modernising some of the speech forms, which, in the original play \u0096 written around 1952-1953 \u0096 reflected speech patterns of the times. I blow the dust off my 1973 Penguin copy of the play, and can follow some of the scenes almost verbatim. Thus the effect is dramaturgical rather than cinematographic, a little like Branaghan doing his versions of Shakespeare. A pleasing result indeed. Highly recommended for conoisseurs of fine acting in the classic sense. Neither of the two leading actors \u0096 Daniel Day-Lewis and Winona Ryder \u0096 will let you down. The Salem Witches have been the cause of a few forays by writers, historians and so on: really the whole affair seems to typicalize people's appetites for forming psychosis-like manias, often on the grounds of nothing very concrete. I mean to say, the devil exists in the minds of those who invent it; the same cause as the `reds under the beds' phobia of the 1960s and 1970s, today transformed into `Islam Terror' around every corner. The clothing is different, but the mentality producing the phobias is not. `The Crucible' in this excellent adaptation make this poignantly clear. My vote is slightly higher than the present IMDb average.",
         "The day after Rev Parris finds his daughter and niece dancing in a group in the forest, several of the girls in the village are deep in sleep unable to be wakened. Rev Hale is called in to investigate and Abby Williams speaks up claiming witchcraft and that she and the other girls had been brought into it by the devil himself. As the investigation continues, Abby leads the claims on a twisted vendetta, eventually ending at the door of John Proctor and his family, the man she had an affair with and still loves. I have never seen this on the stage, although my wife claims we did 2 years ago, and am unable to really compare this to other versions. However the first time I saw this film it grabbed me by the sheer force behind it. The plot is emotive and increasingly griping as it spirals out of control and Abby guides the justice of the court. The script is excellently written \u0096 sturdy yet capable of bringing out so much without trivialising or simplifying it. I defy anyone to not get sucked into this story as it is so well written. Of course this would stutter a little without a suitably strong cast to carry it off. Happily the film is strong in performances and strong in depth. Day Lewis is deceptively light at the start, but the way he brings himself on during the film to his final shot is moving. Allen gives him able, albeit less showy, support. Ryder gives one of her best performances I've seen. Although she is required to be hysterical for much of the film she carries it off convincingly and, when needed, she is as menacing as a black hearted woman can be. Scofield is driven and well pitched but is helped by great support from Campbell and, more surprisingly, Gaynes (better known as Police Academy's Lassard). A rich cast of males in the chief support roles (Jones, Davison and Vaughan) really help \u0096 not only do they deliver the goods but their faces give the constant perception of depth. The direction could easily have treated this as a stage production but Hytner opens it out without ever going over the top. The themes within the book are easily brought out and Hytner never stands in their way \u0096 he lets us take what we can from the material without too much flair in the way. Overall this is a fantastic version of the play \u0096 it is intelligent, well acted and very moving and involving. It may have the occasional weak link but those are pretty minor. Anyone with a passing interest in very good films should watch this.",
         "It's good to see a movie with Arthur Miller like script maker (Based on his novel) and screenplayer of this excellent movie. For me this is a PERFECT creation, that it is incredibly performed by Winona Ryder and Daniel Day-Lewis. An absolute MASTERPIECE based on the Miller's experiences with Senator Joseph MCcarthy and his \"hunt\". TOTALLY recommendable. For me...... A Masterpiece.",
         "Thanks to the director who let Arthur Miller do the screenplay- so the movie is a honest rendition of the great play. Daniel Day Lewis is very good- and the movie is true to the original. Winona Rider also does well- but Joan Allen is excellent. This is a true classic of American Theater and since we can't always get to a live performance the movie is a good substitute... recommend every student of am. lit see it and anyone who wants to delve into the deceit of the human spirit... nothing is new people are still jealous and still vindictive and Miller writes of these two traits so well. The whole cast does a credible job",
         "The Raymond Rouleau French version of the fifties featuring Simone Signoret and Yves Montand as the Proctors seems to have vanished in the air.It's never on French TV and it's not available on tape or DVD either.In the fifties this could not be filmed in the USA ,because it was a highly topical issue,hence the Rouleau version which was first a stage production. Actually,this masterwork is so strong that it can't be connected only with MCCarthyism.Its scope reaches far beyond.It's a plea for tolerance,freedom of thinking and dignity of the human being wherever and whenever they may be endangered.An excellent cast does the play justice.Daniel Day-Lewis gives a powerful performance (I say God is dead!)that few of his peers can equal.Wynona Ryder is efficient in her ambiguous part.Joan Allen gives a subdued but moving interpretation.Paul Scoffield personifies the inhuman law with authority.Bruce Davison (\"Willard\"'s hero ,1971). All in all, a magnificent show ,thanks to all concerned.",
         "\"The Crucible\" is slow, but it doesn't make the film bad. It is a very impressing, beautiful, well-acted and well-done film. The story of passion, lies, madness, witchcraft and tragedy kept my attention. The adaptation of Arthur Miller's play is superb. Joan Allen deserved her nomination for the Oscar as best supporting actress and Daniel Day-Lewis should have been nominated. A must see. Rating: 9/10",
         "Arthur Miller is one of my favorite playwrights. Being a drama major, I read a lot of Miller. THE CRUCIBLE is by far my favorite. It has been for the last six years. This film version is great, not only the acting by some principles, but the sets, costumes, script, and (maybe I'm weird) music. Winona Ryder is exceptional as Abigail, who starts the whole witchcraft thing. Daniel Day Lewis is too subtle and quiet as John Proctor. Judge Danforth is boring in the film. Joan Allen is wonderful. She plays the long suffering wife Elizabeth Proctor and she is just as saintly as the character is supposed to be. The final scene with John and Elizabeth Proctor makes me cry every time when Elizabeth confesses to John that...\"...it was a cold house I kept. Forgive me John. Forgive me.\". ***1/2 out of 4"
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "The movie is centered around the Salem Massachusetts witch trials of 1692. The movie is based on the play \"The Crucible\" by Arthur Miller. He also wrote the screen play adaptation.",
         "A small group of teen girls in 1692 Salem, Massachusetts caught in an innocent conjuring of love potions to catch young men are forced to tell lies that Satan had invaded them and forced them to participate in the rites and are then forced to name those involved. Thrown into the mix are greedy preachers and other major landowners trying to steal others' land and one young woman infatuated with a married man and determined to get rid of his innocent wife. Arthur Miller wrote the events and the subsequent trials where those who demanded their innocence were executed, those who would not name names were incarcerated and tortured, and those who admitted their guilt were immediately freed as a parable of the Congressional Communist witch hunts led by Senator Joe McCarthy in 1950's America.",
         "A Salem resident attempts to frame her ex-lover's wife for being a witch in the middle of the 1692 witchcraft trails."
      ],
      "budget": 25000000
   },
   "movielensId": 1366,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-27",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Nicholas Hytner"],
      "runtime": 124,
      "movieId": 1366,
      "title": "The Crucible",
      "mpaa": "PG-13",
      "actors": [
         "Daniel Day-Lewis",
         "Winona Ryder",
         "Paul Scofield",
         "Joan Allen",
         "Bruce Davison",
         "Rob Campbell",
         "Charlayne Woodard",
         "Frances Conroy",
         "Elizabeth Lawrence",
         "Mary Pat Gleason",
         "Karron Graves",
         "Peter Maloney",
         "Ruth Maleczech",
         "Jeffrey Jones",
         "Peter Vaughan"
      ],
      "imdbMovieId": "0115988",
      "originalTitle": "The Crucible",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["4OBffF0s3Hc"],
      "plotSummary": "The movie is centered around the Salem Massachusetts witch trials of 1692. The movie is based on the play \"The Crucible\" by Arthur Miller. He also wrote the screen play adaptation.",
      "tmdbMovieId": 20539,
      "avgRating": 3.4106,
      "releaseYear": "1996",
      "numRatings": 2170,
      "posterPath": "/q0wALqKrfEt4yA5flGYYkK5skoA.jpg"
   }
}