{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "fur",
            "id": 5154
         },
         {
            "name": "fashion designer",
            "id": 7024
         },
         {
            "name": "puppy",
            "id": 8841
         },
         {
            "name": "based on children's book",
            "id": 15101
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "dalmatian",
            "id": 158369
         }
      ],
      "imdb_id": "tt0115433",
      "video": false,
      "title": "101 Dalmatians",
      "recommendations": [
         10481,
         9598,
         3050,
         11806,
         10603,
         10137,
         9574,
         888,
         12230,
         8839,
         9354,
         10808,
         10054,
         10992,
         10340,
         10330,
         10996,
         8920,
         12139,
         9327
      ],
      "backdrop_path": "/hm6ohX7n6xAfhVQIxnAiyrIIb9w.jpg",
      "revenue": 320689294,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Cruella De Vil",
               "gender": 1,
               "credit_id": "52fe44769251416c75035a2b",
               "name": "Glenn Close",
               "profile_path": "/fF6tCfuvuUhaePm5onUNnIE4FvL.jpg",
               "id": 515,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Roger",
               "gender": 2,
               "credit_id": "52fe44769251416c75035a2f",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Anita",
               "gender": 1,
               "credit_id": "52fe44769251416c75035a33",
               "name": "Joely Richardson",
               "profile_path": "/fgjpKio6sMD5AxOWQwAdgJQErhm.jpg",
               "id": 20810,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Nanny",
               "gender": 1,
               "credit_id": "52fe44769251416c75035a37",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Jasper",
               "gender": 2,
               "credit_id": "52fe44769251416c75035a3b",
               "name": "Hugh Laurie",
               "profile_path": "/3qCmEHtq5fBW8dbzsYDSy16Zqb0.jpg",
               "id": 41419,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Horace",
               "gender": 2,
               "credit_id": "5a4e310a0e0a26480b00b422",
               "name": "Mark Williams",
               "profile_path": "/mDcipTHC41LIHMx0UJxpF6YOQGw.jpg",
               "id": 20999,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Skinner",
               "gender": 2,
               "credit_id": "5a4e3126925141734300a913",
               "name": "John Shrapnel",
               "profile_path": "/nDIK01IoVNx7cfYOrKqGugItqO9.jpg",
               "id": 940,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Alonzo",
               "gender": 2,
               "credit_id": "5a4e3148c3a3683b7d00a5e4",
               "name": "Tim McInnerny",
               "profile_path": "/wxO1c0e5N1WHn2wLHmEbvrfqnnX.jpg",
               "id": 41043,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Frederick",
               "gender": 2,
               "credit_id": "5a4e318c0e0a26481a00ad2e",
               "name": "Hugh Fraser",
               "profile_path": "/jRuVH8p9lWCjnggOAyUBpyJFE4Q.jpg",
               "id": 67028,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "(voice)",
               "gender": 2,
               "credit_id": "5a4e337cc3a3683b7800bc93",
               "name": "Frank Welker",
               "profile_path": "/b3gImArbw13mMKJIe9leFc9YYb7.jpg",
               "id": 15831,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Additional Dialogue Replacement (voice)",
               "gender": 1,
               "credit_id": "59f54ad1c3a3682e4c005cb7",
               "name": "Sherry Lynn",
               "profile_path": "/kQDSC2z7sb6S5HcpOH6cmeJokKE.jpg",
               "id": 214701,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Additional Dialogue Replacement (voice)",
               "gender": 0,
               "credit_id": "5aaf533c0e0a26782703451c",
               "name": "Mickie McGowan",
               "profile_path": "/k7TjJBfINsg8vLQxJwos6XObAD6.jpg",
               "id": 84493,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44769251416c750359f7",
               "name": "Stephen Herek",
               "profile_path": "/wFMntUA59jIeLITlk5pYp2boZzB.jpg",
               "id": 18356,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c750359fd",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035a03",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035a09",
               "name": "Ricardo Mestres",
               "profile_path": null,
               "id": 58015,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035a0f",
               "name": "Edward S. Feldman",
               "profile_path": null,
               "id": 11302,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035a15",
               "name": "Michael Kamen",
               "profile_path": "/y83bqw1VP1PkuvOhG2XROwc9eXG.jpg",
               "id": 7714,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035a1b",
               "name": "Adrian Biddle",
               "profile_path": null,
               "id": 7783,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035a21",
               "name": "Larry Bock",
               "profile_path": null,
               "id": 16567,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44769251416c75035a27",
               "name": "Trudy Ship",
               "profile_path": null,
               "id": 58720,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "554448a092514174da00049e",
               "name": "Rich Draper",
               "profile_path": null,
               "id": 1460505,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "55478fd6c3a3680ce800b569",
               "name": "John Dillon",
               "profile_path": null,
               "id": 1460488,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 11.73843,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11674,
      "vote_count": 972,
      "budget": 54000000,
      "overview": "The Live action adaptation of a Disney Classic. When a litter of dalmatian puppies are abducted by the minions of Cruella De Vil, the parents must find them before she uses them for a diabolical fashion statement.",
      "similar": [
         12230,
         10481,
         9598,
         646,
         657,
         667,
         699,
         708,
         714,
         253,
         400617,
         691,
         10345,
         13654,
         14306,
         20497,
         10063,
         11982,
         72391,
         47354
      ],
      "original_title": "101 Dalmatians",
      "runtime": 103,
      "poster_path": "/pdVFUWxxDB5qt1RhcMp9A88IcGU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Great Oaks Entertainment",
            "id": 2173,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-11-17",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/eTaNHqpi7VldgcrDetfTzk4FeDi.jpg",
         "name": "101 Dalmatians (Live-Action) Collection",
         "id": 124916,
         "poster_path": "/oSeIai1ioj4dbq7WgbPzpsSCzkS.jpg"
      },
      "tagline": "So many dogs. So little time.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Herek"],
      "runtime": 103,
      "synopsis": "Roger Dearly (Jeff Daniels) is an American video game designer who shares his home in London with his pet dalmatian, Pongo. One day Roger takes Pongo for a walk, and the dog sets his eyes on a beautiful female Dalmatian named Perdy. After a frantic chase through the streets of London, Roger and Pongo discover that Perdy likes Pongo; and Perdy's owner, fashion designer Anita Campbell-Green (Joely Richardson), is taken with Roger when they meet in St. James Park. Romance blossoms between both human and canine couples and Roger and Anita walk down the aisle. Anita works as a fashion designer at the House of de Vil. Her boss, Cruella de Vil (Glenn Close), has two passions in life: cigarettes and fur. Anita, inspired by her dog designs a coat made with spotted fur. Cruella, leaps on the idea of making garments out of actual Dalmatians. When Cruella learns that Perdy has given birth to 15 Dalmatian puppies, she offers the couple a decent price for the newborn puppies, but the couple refuses. Flying into a maniacal rage, Cruella relieves Anita of duty and vows to get even. She has her henchmen, Jasper and Horace (Hugh Laurie and Mark Williams respectively), steal the puppies and deliver them to her ancient estate, De Vil Mansion. With the help of the other dogs and animals scattered throughout London, the puppies manage to outwit Jasper and Horace, and escape to a farm, where their parents have been called to wait. But shortly after, Cruella shows up and tries to retrieve them; she ends up having a pig sit on her, after which she falls into a vat of molasses (caused by raccoons) and is kicked into a pig pen by a horse. All of the Dalmatians get home by the Metropolitan Police Service, who then arrest Cruella and her henchmen. The family adopts the other Dalmatians Cruella stole, bringing the total to 101. Roger designs a successful video game featuring dalmatian puppies as the protagonists and Cruella as the villain, and they move to the English countryside with their millions.",
      "writers": [
         "Dodie Smith",
         "John Hughes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115433/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxNjQwMjM4OF5BMl5BanBnXkFtZTcwMTU5NDMyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Glenn Close, Jeff Daniels, Joely Richardson | See full cast and crew »"],
      "reviews": [
         "As a very young child, I grew up on the 1961 101 Dalmatians. I loved the show, and I remember thinking that it was one of Disney's best. So when the 1996 live-action remake came out, I had my doubts that anything could be as good as the original. I was wrong. This movie is absolutely fantastic! It is beautifully written and the dogs are so cute and loveable... but I think the thing that ties it all together is the casting. The characters were brought to life in a totally believeable way--from Jeff Daniels as the Dalmatian-loving, Cruella-hating Roger Dearly, to Ms.DeVil herself, played to perfection by the unbeatable Glenn Close. All of the actors fill the shoes of their characters, the comic timing is just right, and everything about it spells a Disney masterpiece.",
         "I've noticed something about John Hughes' movies: he started out writing about adults with child-like tendencies (\"Mr. Mom\", \"National Lampoon's Vacation\"), went on to actual teenagers (\"Sixteen Candles\", The Breakfast Club\"), devolved down to pre-teens (\"Home Alone\", \"Dennis the Menace\") and then babies (\"Baby's Day Out\") and now that he's exhausted all the ages of man (except the elderly - don't give him any ideas) he's moved on to the animal kingdom with \"101 Dalmatians\". You know the basic storyline if you've seen the 1961 Disney animated original - Roger and Anita (Daniels and Richardson) meet and marry then their respective dalmatians Pongo and Perdita have 15 puppies which are coveted by the despicable Cruella DeVil (played con brio by Close) who will have them at any cost to make a puppy fur coat. What's new this time around? The fact that it's all live action, for one, and the formidable assistance of computers helps create the illusion of dogs and other creatures acting with almost human precision, plus the fact that instead of precocious voices for all the animals they act out voiceless against the human baddies, especially Horace and Jasper (Williams and Laurie), as if the animal kingdom were all channeling Macaulay Culkin. And, of course, since Hughes wrote the script, you know this won't be Shakespeare - slapstick malice is at the forefront with cute but noble good guys, ugly and dumb bad guys and lots of adorable animals. But not just dalmatians, mind you: there are all manner of dogs - sheepdogs, bulldogs, terriers, etc. Not to mention horses, sheep, raccoons, rabbits, chickens, pigs, cows, birds and even a mouse in one instance. All of them banding together to bring the dalmatians, all 101 of them, together safely. Director Herek brings everything together with assurance and all the actors make sure you know that this is a story that is first and foremost for the kiddies. Especially Close - complete with claws on her gloves and a different wardrobe for every scene, she not only chews the scenery but nibbles on it with every tooth in her head and savors the taste like a connoisseur. Bless her. This isn't the kind of movie that can be successfully analyzed. You either like it or not, depending on what kind of tolerance you have for kiddie slapstick. I like that, so I liked \"101 Dalmatians\". Seven stars, plus half a star for Close's diabolical work...and a half star more for the donations from the animal world.",
         "As an animation student, I frequently cringe when they make a live action version of an animated film, as they rarely live up to their cartoon counterparts. This is not one of those films. I loved it, the Dogs, pongo and Perdy, were outstanding, and even with computer stand ins, and Hensons creature shop, you'd be hard pushed to see the joins, the exceptions being the Wood pecker at the door and the two Racoons giving each other a high five. Jeff Daniels and Joely Richardson were great, Hugh Laurie and Mark Williams were brilliant as the bumbling lackeys, but the star of the show had to be Glenn Close as Cruella DeVille. I never knew animated characters could have real life twins, but Glenn Close was Cruella's, delightfully over the top, with more ham than a bacon butty. If you liked the cartoon you'll love this version as well. The only thing I wondered about in the whole film was how many takes it took them to get some of the animal shots, this certainly contradicts the old adage of not working with animals and kids.",
         "\"101 Dalmatians\" is perfectly good clean children entertainment. It's has a fun feeling and atmosphere and some great characters. John Hughes his writing style is notable in this movie. The characters and the humor are similar to his other movies such as the well know movie \"Home Alone\". The humor is slapstick like at times (especially with the villains Jasper and Horace) which works very effective for a fun children movie like this one. Of course everything is terribly predictable and nothing that happens in this movie comes as a surprise. It's simple fun and entertainment. The humor is simple but it's good and works effective. Glenn Close is perfectly cast as über-villain Cruella De Vil and portrays a highly memorable character. She truly is the highlight of the movie and steals the show. She also seemed to had lots of fun playing the over-the-top villainous but oh so fun character. Also good are the more slapstick like, stereotypical villains Jasper and Horace played by Hugh Laurie and Mark Williams. Another fun villain role is played by John Shrapnel who is perhaps best known for his role in \"Gladiator\". The fun and perhaps also a bit underrated musical score is done by Michael Kamen. It quite honestly is one of his better works. Children will enjoy watching this movie and I can know, since I actually saw this movie back in the cinema, when I was still a child myself. 6/10 http://bobafett1138.blogspot.com/",
         "Incredible as it may seem, this film is every bit the equal of the Disney animated version of the same title. And it is DIFFERENT from the Disney version. This is a rare accomplishment, in a medium where remakes and sequels are so often weak. The film is made by Glen Close, whose appearance as Cruella DeVil is fascinating! She is even more evil than her animated namesake. But the rest of the casting of the film is also incredibly strong. No problems with anyone. The dalmations are most excellently employed. Virtually seamless integration of live action and computer animation. And also, the hosts of animals (live and animated) in the film do NOT talk (a cloying and sentimental habit too often indulged in by Disney Studios et al). The film is an adult's movie that children should also enjoy! The VHS version was good, the DVD version even better.",
         "101 Dalmatians, the ultimate Disney animated classic about none other than PUPPIES! It was clever, sharp, witty and just a wonderful movie and created one of Disney's most memorable and classic villains Cruella DeVil. So when I had heard about the live action version I wasn't too interested, this movie came out when I was 11 years old for goodness's sake, but I just didn't want to see what was already a perfect movie being made into a live action one, but my grandparents had bought it and we watched it together. I remember seeing it and really didn't like it, but as I grew up, it was on TV one day so I figured since I'm a little more grown up to give this another chance and still I'm not too thrilled with this new take on the \"tail\", lol, get it? Eh, my lame jokes, gotta love them. Roger Dearly is an American computer game designer, who shares his home in London with his pet dalmatian, Pongo. One day Roger takes Pongo for a walk, and the dog sets his eyes on a beautiful female Dalmatian named Perdy. After a frantic chase through the streets of London, Roger and Pongo discover Perdy likes Pongo; and Perdy's owner, fashion designer Anita Campbell-Green, is taken with Roger when they meet in St. James Park. Romance blossoms between both human and canine couples and Roger and Anita walk down the aisle. Anita works for Cruella DeVil, a sexy fashion maven with a great love for cigarettes and fur. Anita becomes inspired by her dogs and designs a fur coat made with spotted fur, causing Cruella to leap on the idea of making garments out of actual Dalmatians. When Cruella learns that Perdy has given birth to fifteen Dalmatian puppies she offers the couple a decent price for the newborn puppies, but the couple refuses. Flying into a maniacal rage, she fires Anita and vows to get even. She has her henchmen, Jasper and Horace, steal the puppies and deliver them to her ancient estate, but the puppies escape and now must find their way home. So I absolutely adore Glenn Close, she's one of my favorite actresses of all time and always delivers very on the key performances, now she was a great choice for Cruella, but I think it was just the whole idea of the movie that dragged her down, the whole cast as a matter of a fact is too good for this movie. It's just not as fun as the original animated classic, I think the reason the animated movie is so much better is because it was just more special and personal as it was hand drawn and a classic for so many kids who grew up with it. Maybe I am being stubborn where I'm just more for the original, but honestly this movie is just kind of pointless and not really for the kids nore the adults. I'd say it's not like it's the most horrible movie in the world, but it's just not worth it to go out of your way to watch it. 4/10",
         "\"101 Dalmatians\" is a very cute and funny movie from the original Disney cartoon classic. Glenn Close was very good in the movie, and I liked all of the dalmatians. Glenn Close did a wonderful job as \"Cruella Devil\", and I think she did a good job fitting the role. Overall, this is a family classic, and should be enjoyed by anybody! I give it a 9.5 out of 10!",
         "This is one of those movies that truly is - and I don't mean to use the cliché - entertaining whether you are a kid or an adult. The dalmatians and other animals are a lot of fun to watch. Glenn Close must have had a lot of fun making this film, playing the evil \"Cruela De Vil.\" Just as much fun, maybe more, were the two bumbling dog-nappers - Hugh Laurie and Mark Williams, I believe - idiots who were genuinely funny in their stupidity. Their dialog was hilarious. There are nice colors in here, too, so a widescreen DVD is good to have if you enjoy this movie. I didn't find the surround sound to be much. Speaking of clichés and such, there are some drawbacks here that were a little annoying to me, like overdoing the intelligence of the dogs, making them almost human-like with their abilities to understand English. In fact, it's taken to the absurd level level of some of the animals being smarter than humans. Please....give me a break! Also, you get the quick \"film romance\" in which two people (Jeff Daniels and Joely Richardson) barely meet and already they are in love, getting married in no time. Please....give me a break! Still, recommended if you want a want 103 minutes of a \"cute\" story and don't take any of it the least bit seriously as if anything in here could really happen.",
         "101 DALMATIANS, in my opinion, is an excellent remake of a pure Disney classic. It made me feel all warm and tingly when Pongo and Perdita set out on their mission. If you ask me, Cruella (Glenn Close), Horace (Mark Williams), and Jasper (Hugh Laurie) were truly devious. If I were Pongo or Perdita, I'd probably do the same thing they did. Before I wrap this up, I'd like to say that everyone was perfectly cast, the production design was beautiful, the performances were top-grade, the direction was flawless, and Disney has done it again. In conclusion, I highly recommend this pure Disney classic to everyone who hasn't seen it. I guarantee you you'll enjoy it.",
         "This was one of those times when remakes are a good idea. It was a remake of a classic and it was the remake of an animated movie to a live one so I approve and it was a good attempt. Evil Cruella De vil wants her assistant Anita to give up her spotted puppies so she can turn them into a coat. Anita is fired for refusing and De vil has the puppies stolen along with many more and the adventure begins of trying to get them back. Of course this movie was no where as good as the original. It didn't have the dogs as the stars like the original and it took the heart out of it. It didn't have the hilarious cat from the first one and that was the funniest bit from the first one. With it being live action many of the funny stunts pulled off in the original was missing. It seems to me that working with that many dogs would be a horrible task for a film maker and you can tell that editor Trudy Ship had her work cut out for her here. John Hughes wrote the screenplay and he made a lot of changes, some obviously had to be made and some had to be made in order to modernize it, it was good and still true to the original. Glenn close WOW, what a perfect job she did here as Cruella, great acting and to me this is her best role. I love Hugh Laurie from House, and he was a great villain and stood out to me from this film. Also, I like Joan Plowright and enjoyed her as the lovable Nannie. Not as good as the cartoon, a bit longer and slow at times. Some great acting and some fillers, boring music that has already dated badly in the 14 years since its release. I also hated the C.G.I. and most of it could have been avoided. The movie was very corny at times, which made it hard to accept as an adult, but this is surely one for the kids...3 out of 10 stars"
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Wizzer Productions",
         "Great Oaks Entertainment"
      ],
      "summaries": [
         "Fashion designer Anita and computer-game writer Roger meet, fall in love and marry along with their dalmatians Perdita and Pongo. But the proud dogs' puppies are kidnapped by Anita's boss Cruella De Vil, who is stealing young dalmatians to make the coat she has set her heart on. Enlisting the help of the British animal kingdom, Pongo and Perdita set out to find and rescue all ninety-nine pups from their fearsome captors, Jasper and Horace.",
         "A woman kidnaps puppies to kill them for their fur, but various animals then gang up against her and get their revenge in slapstick fashion."
      ],
      "budget": 54000000
   },
   "movielensId": 1367,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-17",
      "dvdReleaseDate": "2000-12-12",
      "directors": ["Stephen Herek"],
      "runtime": 103,
      "movieId": 1367,
      "title": "101 Dalmatians",
      "mpaa": "G",
      "actors": [
         "Glenn Close",
         "Jeff Daniels",
         "Joely Richardson",
         "Joan Plowright",
         "Hugh Laurie",
         "Mark Williams",
         "John Shrapnel",
         "Tim McInnerny",
         "Hugh Fraser",
         "Frank Welker",
         "Sherry Lynn"
      ],
      "imdbMovieId": "0115433",
      "originalTitle": "101 Dalmatians",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["K2CTJS12RdI"],
      "plotSummary": "The Live action adaptation of a Disney Classic. When a litter of dalmatian puppies are abducted by the minions of Cruella De Vil, the parents must find them before she uses them for a diabolical fashion statement.",
      "tmdbMovieId": 11674,
      "avgRating": 3.06486,
      "releaseYear": "1996",
      "numRatings": 10423,
      "posterPath": "/pdVFUWxxDB5qt1RhcMp9A88IcGU.jpg"
   }
}