{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "mockumentary",
            "id": 11800
         }
      ],
      "imdb_id": "tt0113756",
      "video": false,
      "title": "Man of the Year",
      "recommendations": [],
      "backdrop_path": "/2xIcekmx43S0M6Zovdd4bPfHN8e.jpg",
      "revenue": 209935,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Dirk",
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083b13",
               "name": "Dirk Shafer",
               "profile_path": null,
               "id": 45382,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Angela Lucassy",
               "gender": 1,
               "credit_id": "52fe441fc3a36847f8083b17",
               "name": "Mary Stein",
               "profile_path": "/5zVpqXqr3S8y4cMKOQNc1SwBdc7.jpg",
               "id": 45386,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Tammy Shafer",
               "gender": 1,
               "credit_id": "52fe441fc3a36847f8083b1b",
               "name": "Claudette Sutherland",
               "profile_path": null,
               "id": 45387,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Ken Shafer",
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b1f",
               "name": "Cal Bartlett",
               "profile_path": "/o0ZLqM29kF8HfzZgZOc1cLvpX9h.jpg",
               "id": 45388,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Vivian",
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b23",
               "name": "Vivian Paxton",
               "profile_path": null,
               "id": 45389,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mike Miller",
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083b27",
               "name": "Michael Ornstein",
               "profile_path": "/dGpRqdA6rtViImAuyAKdM76I2DT.jpg",
               "id": 45390,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Kelly Bound",
               "gender": 1,
               "credit_id": "52fe441fc3a36847f8083b2b",
               "name": "Beth Broderick",
               "profile_path": "/93bOlZw9mhqJ6svBRsmQt9JhuxJ.jpg",
               "id": 45391,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Betty Levy",
               "gender": 1,
               "credit_id": "52fe441fc3a36847f8083b2f",
               "name": "Cynthia Szigeti",
               "profile_path": null,
               "id": 45392,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Howie Diadone",
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083b33",
               "name": "Dennis Bailey",
               "profile_path": null,
               "id": 45393,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Ed, the photographer",
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b37",
               "name": "Charles Sloane",
               "profile_path": null,
               "id": 45394,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Dr. Marsha Demarkey",
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b3b",
               "name": "Phyllis Franklin",
               "profile_path": null,
               "id": 45395,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Pledge Cartwright",
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083b3f",
               "name": "Bill Brochtrup",
               "profile_path": "/2wbEXIwkGJDXo3dqhuWn4Zmir9u.jpg",
               "id": 45397,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Buck Hallren",
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083b43",
               "name": "Fort Atkinson",
               "profile_path": null,
               "id": 45399,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Jimmy Morgan",
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b47",
               "name": "Felix Montano",
               "profile_path": null,
               "id": 45401,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Thom",
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b4b",
               "name": "Thom Collins",
               "profile_path": null,
               "id": 45402,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Rex",
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b4f",
               "name": "Paul D. Fow",
               "profile_path": null,
               "id": 45403,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Dee Dee",
               "gender": 1,
               "credit_id": "52fe441fc3a36847f8083b53",
               "name": "Lu Leonard",
               "profile_path": null,
               "id": 42751,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Cindee",
               "gender": 1,
               "credit_id": "52fe441fc3a36847f8083b57",
               "name": "Mindy Sterling",
               "profile_path": "/ffeLktZ7JFCVK1uV2tuw4epSqz0.jpg",
               "id": 13924,
               "order": 17
            },
            {
               "cast_id": 26,
               "character": "Himself",
               "gender": 2,
               "credit_id": "53a72ab5c3a368707a0030bd",
               "name": "Phil Donahue",
               "profile_path": "/gcevWjU5SPaWWN8BUpPtvxbundy.jpg",
               "id": 191570,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083afd",
               "name": "Dirk Shafer",
               "profile_path": null,
               "id": 45382,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b03",
               "name": "Matt Keener",
               "profile_path": null,
               "id": 45384,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083b09",
               "name": "Hugh Hefner",
               "profile_path": "/3BS3PEHxgqr7G1ItTpCGzhSFViV.jpg",
               "id": 31309,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe441fc3a36847f8083b0f",
               "name": "Stephen Timberlake",
               "profile_path": null,
               "id": 45385,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe441fc3a36847f8083b5d",
               "name": "Dirk Shafer",
               "profile_path": null,
               "id": 45382,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.511988,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 5757,
      "vote_count": 2,
      "budget": 0,
      "overview": "First-time director Dirk Shafer also penned this raucous \"mockumentary,\" a blend of fact and fiction that re-creates his 1992 reign as Playgirl magazine's Centerfold of the Year. When Shafer chooses to keep the fact that he's gay a secret from the magazine's editors, he finds himself living the ultimate lie -- and incapable of giving female readers what they really want. Will he succumb to his lover's pressures to come out of the closet?",
      "similar": [
         449176,
         184352,
         4927,
         10938,
         26933,
         376867,
         258480,
         26280,
         258034,
         18480,
         338189,
         1966,
         1213,
         244772,
         401898,
         398818,
         16240,
         496,
         112160,
         16367
      ],
      "original_title": "Man of the Year",
      "runtime": 86,
      "poster_path": "/nKYRDhGlbvQpXJnyMm7fcFDtm6P.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-09-15",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "He as a centerfold who revealed everything ... but the truth.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Dirk Shafer"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Dirk Shafer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113756/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjY3MjczMjQwMV5BMl5BanBnXkFtZTcwNDM3OTEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vivian Paxton, Claudette Sutherland, Michael Ornstein | See full cast and crew »"],
      "reviews": [
         "Like a pleasant walk on a beautiful beach, this movie gives the viewer an entertaining look inside the year-long adventure of a very pretty Playgirl model. Dirk Shafer, as \"man of the year\" and all that implies, must juggle the merits of this honor against the personal angst of being a gay man wearing a straight jacket. This is an interesting story, based on factual events, and re-enacted in a documentary style. Most of the disappointed newsgroup reviews seemed to have been fostered by expectations that were unrealistic or overly lofty. There are no epiphanies here folks. Do not, I repeat, do not rent this movie to change your life. Some reviewers were apparently bothered that Dirk Shafer's year did not achieve deep social meaning to rival Mother Teresa's or that his virgin directing efforts did not unseat Stanley Kubrick. Several reviewers were annoyed that Dirk Shafer was too interested in himself. Well, duh, you don't have to attend 100 movies a week to realize early on that the movie is about Dirk Shafer, beginning, middle, end! The naked truth of this movie is a simple story of an ordinary guy in a well tended package who finds himself romanced by an extraordinary situation. Fraught with heady seduction, personal dilemma, trauma, and confusion, I felt for Dirk's quandary, and was impressed that he could relate his tale with humor. Ultimately, Dirk's epiphany is one to which we could all subscribe. When shadow and makeup no longer hide the truth, and beauty moves beyond the skin, the value that remains is how much you are loved and how much you love others. And there you have it. Enjoy the walk and the beautiful scenery, your life will likely not change, but you will smile in the end.",
         "Never has a documentary film pleased me in so many ways before. I laughed so hard through the whole movie. It was a wild ride from start to finish and let me take the time to recommend this for any movie lover. \"Man of the Year\" is a hilarious mock documentary about Dirk Shafer's reign as Playgirl Magazine's 1992 Centerfold of the Year. There's only one problem, he's gay. Labeled as the \"ideal man for every woman,\" Shafer finds himself living the lie of a lifetime. Dirk finds himself living a double life that he never intended to have and he doesn't like it at all. As the year goes on, Dirk finds himself being interviewed by every talk show host on TV and one minor screw up could cost him his fame. While woman are fantasizing him, men are getting a little suspicious. The husbands and boyfriends of the woman along with the gay community think he's gay and they will go through hell to find out the truth. Though the film isn't top quality and it's just like watching an hour long interview, I would have to say its the best interview I have ever seen. It's really funny, witty, and crude and I almost cried to see it end. Dirk Shafer did a wonderful job bringing what had to be the most thrilling adventure in his life to the independent screen. If you ever come across this film, watch it. It's interesting and at the same time entertaining.",
         "The movie is part serious, part telling just someone's life, and part comedy. The bleached out blonde stripper is quite hilarious. Dirk has quite the body and I could probably just watch him on a modeling DVD. The most touching part of this movie is the exposure to AIDS and death. I come from a small hometown where my Mom's best friends son became a model, moved to California, caught AIDS and died. My mother was always bashing his lifestyle of sleeping around with rich men, going with them on vacations, and the swimsuit modeling he did. But this guy's mother did everything she could for David. He gave her a $10,000 diamond before he died with his early cash-in of a life insurance policy. It was a big deal in our community that Liz Taylor had visited him on his death bed. But the best thing was that his mom visited him and was with him when he died. His mother died a few years later having buried three of her six children. Now that my family gets to deal with my brother having AIDS I do find one valuable saying by the character playing Dirk's Mom and that is, take the time to visit, and make the time to visit. This movie is above and beyond Circuit.",
         "This movie is made in the \"mock-umentary\" style popularized in recent by Christopher Guest and co. (\"Best in Show\", \"A Mighty Wind\"), yet interestingly, it was made before all the ones I can think of except \"Spinal Tap\". And to my mind, it is just as good, if not better than the others. \"Man of the Year\" is based on Dirk Shafer's experiences as a Playgirl model--personally, I'd love to know just how much of the movie was based on real events; the movie is so skillfully done, it's difficult to tell. It has a subtle, intelligent humor all its own, and is, at times, quite touching (something other mockumentaries never get near). A fine piece of movie-making, well worth watching.",
         "Is this really a Mockumentary?...it's hard to say. Although there is humor and much \"laughing at oneself\", all mockumentaries are made with fictitious subjects. That was real live Donahue footage there ... though Donahue was always kind of a walking self-parody so I wasn't sure at first. I wonder what else was real? Vivian Paxton? The parents? The unctuous blonde Playgirl Editor maybe? Also I want to respond to a user comment above that \"homophobes will hate this movie of course.\" I don't see why. The fact that you can't have a magazine like Playgirl without the assistance of oodles of gay men resonates just fine with a Christian moral agenda. There are many gay stereotypes in this film, which the moral majority would like. The Cindee show producer scores a few points against Dirk in her \"outing\" conversation (btw it is very balanced of Dirk the director to have included this scene.) I don't think that even the most sheltered Christian would have their world rocked by finding out a Playgirl centerfold is gay.",
         "I enjoyed this movie more than any I've seen in a very long time, and it's entirely because of writer-director-star Dirk Shafer. It's a reconstructed and partially fictionalized account of his actual experience as Playgirl magazine's 1992 Man of the Year, filmed a couple of years later. Shafer is amazingly charismatic, intelligent, funny and unpretentious. If it's all an act, he deserves an Oscar. The fact that he's gorgeous is almost irrelevant, because he's so thoroughly appealing in so very many ways. He's one of the few people I've ever seen in a movie whom I'd really love to know, and it has nothing to do with his looks. He's a sweet, smart, articulate, fantastically likable person, and when he's on screen the movie is always delightful. I had only two problems with it. I almost quit watching after a few minutes, because I'd expected something like Spinal Tap or Waiting for Guffman, a totally convincing \"documentary\" - which Man of the Year is not. It's painfully obvious from the first words that this is a scripted work of fiction, using some pretty bad (and some pretty good) actors to tell the story. (I got used to the different style pretty fast, though, and it never bothered me again.) I can't think of any other movie like it, in which a person tells his own story - nearly all of which is almost certainly true - playing himself but using a script and actors to play the other people in his life (there are a very few real people playing themselves, but even their lines are scripted). That's the other problem for me: I never knew what to believe, what was true and what wasn't. I'm not talking about the facts of his life, the Playgirl stuff - as I said, that's almost certainly all true. I mean his relationships, in particular his relationship with his boyfriend, called Mike in the movie and played beautifully by Michael Marisi Ornstein - the best actor in it, and no less charming and attractive than Shafer is. Is he real? Those two guys are so amazing that I'd love to think they're really a couple. So I loved the movie, but it left me a little unsettled, almost as if I'd watched a movie about my own life and left wondering how much of it was true. Odd, but wonderful."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "The Documentary Foundation",
         "Artisan Productions",
         "Filmmakers Foundation"
      ],
      "summaries": ["Mockumentary look at Playgirl Magazine centerfold and 1992 Man of the Year, Dirk Shafer, who kept it a secret from the magazine that he is gay. Most of the film is a fictionalized retelling of Dirk's decision to send a photograph to Playgirl, his selection as a centerfold and then Man of the Year, his many TV interviews, his friend Vivian Paxton posing as his beard, and the pressures from his live-in lover to come out of the closet. Interspersed with this chronological narrative are a black and white look at an evening Dirk spends with Angela Lucassey, a woman from Reno who wins Playgirl's national contest to have a date with Dirk, and an interview with a stripper who tracks Dirk down."],
      "budget": 0
   },
   "movielensId": 137,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-15",
      "dvdReleaseDate": "1999-02-23",
      "directors": ["Dirk Shafer"],
      "runtime": 86,
      "movieId": 137,
      "title": "Man of the Year",
      "mpaa": "NR",
      "actors": [
         "Dirk Shafer",
         "Mary Stein",
         "Claudette Sutherland",
         "Cal Bartlett",
         "Vivian Paxton",
         "Michael Ornstein",
         "Beth Broderick",
         "Cynthia Szigeti",
         "Dennis Bailey",
         "Charles Sloane",
         "Phyllis Franklin",
         "Bill Brochtrup",
         "Fort Atkinson",
         "Felix Montano",
         "Thom Collins",
         "Paul D. Fow",
         "Lu Leonard",
         "Mindy Sterling",
         "Phil Donahue"
      ],
      "imdbMovieId": "0113756",
      "originalTitle": "Man of the Year",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "First-time director Dirk Shafer also penned this raucous \"mockumentary,\" a blend of fact and fiction that re-creates his 1992 reign as Playgirl magazine's Centerfold of the Year. When Shafer chooses to keep the fact that he's gay a secret from the magazine's editors, he finds himself living the ultimate lie -- and incapable of giving female readers what they really want. Will he succumb to his lover's pressures to come out of the closet?",
      "tmdbMovieId": 5757,
      "avgRating": 3.30165,
      "releaseYear": "1995",
      "numRatings": 242,
      "posterPath": "/nKYRDhGlbvQpXJnyMm7fcFDtm6P.jpg"
   }
}