{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "federation",
            "id": 503
         },
         {
            "name": "starfleet",
            "id": 505
         },
         {
            "name": "uss enterprise-a",
            "id": 665
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "self sacrifice",
            "id": 1430
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "liberation of hostage",
            "id": 5362
         },
         {
            "name": "romulans",
            "id": 12388
         },
         {
            "name": "klingon",
            "id": 155211
         },
         {
            "name": "vulcan",
            "id": 155212
         },
         {
            "name": "space opera",
            "id": 161176
         }
      ],
      "imdb_id": "tt0098382",
      "video": false,
      "title": "Star Trek V: The Final Frontier",
      "recommendations": [
         174,
         157,
         168,
         152,
         193,
         200,
         154,
         201,
         199,
         2157,
         8010,
         8536,
         11884,
         865,
         926,
         9531,
         4437,
         10803,
         698,
         700
      ],
      "backdrop_path": "/nNH43KDwtiXJIie6oviBIEwE8xd.jpg",
      "revenue": 70200000,
      "reviews": [{
         "author": "Ian Beale",
         "id": "58a0abc09251412b6100118a",
         "content": "**Underrated and fun!**\r\n\r\nThis is my favorite Star Trek movie. The whole film bubbles with humour and the music score is fantastic. I love the bookend _'Row, row, row your boat'_ sequences. An emotional and funny film - my favourite goosebumps moment being when Kirk says 'I've always known...I'll die alone\". Brings tears to my eyes that part - it really does.\r\n\r\nYou'll have to excuse me, I'm getting emotional thinking about it. It's trendy to give this film a bad review and I am more than happy to be honest and open about ny admiration for this film.\r\n\r\nIf anything, Star Trek VI is the weakest Trek movie - a plodding episode of Columbo in space.\r\n\r\n\r\n_Star Trek V: The Final Frontier_ is a rousing and fun \r\nmovie.\r\n\r\n\r\n\r\n\r\n- Ian Beale",
         "url": "https://www.themoviedb.org/review/58a0abc09251412b6100118a"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Captain James T. Kirk",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006975",
               "name": "William Shatner",
               "profile_path": "/4byp8PsbRkC3UQVuvMAh4bcj7E2.jpg",
               "id": 1748,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Captain Spock",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006979",
               "name": "Leonard Nimoy",
               "profile_path": "/rTQulQ5WMehA3SSBnGTmayTsF0m.jpg",
               "id": 1749,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Dr. Leonard McCoy",
               "gender": 0,
               "credit_id": "52fe4222c3a36847f800697d",
               "name": "DeForest Kelley",
               "profile_path": "/fUL1BY8XjLsQihueDD1UUAm0Qy6.jpg",
               "id": 1750,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Montgomery Scott",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006981",
               "name": "James Doohan",
               "profile_path": "/um8EusLMoUzId8mbfhIXx0J3M82.jpg",
               "id": 1751,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Cmdr. Hikaru Sulu",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006985",
               "name": "George Takei",
               "profile_path": "/5eBSvAPy6DnWsMX61IlJyjUzCRJ.jpg",
               "id": 1752,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Cmdr. Pavel Chekov",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f800698d",
               "name": "Walter Koenig",
               "profile_path": "/itlUSqOqCBH8v4ECM9jGysqMIDz.jpg",
               "id": 1754,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Cmdr. Uhura",
               "gender": 1,
               "credit_id": "52fe4222c3a36847f8006989",
               "name": "Nichelle Nichols",
               "profile_path": "/1p5EIwiyFBxjs5e8a6AzPRzy1JL.jpg",
               "id": 1753,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "St. John Talbot",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006991",
               "name": "David Warner",
               "profile_path": "/wgp2AlWKveLBOcs8YNuLeZiLsGL.jpg",
               "id": 2076,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sybok",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006995",
               "name": "Laurence Luckinbill",
               "profile_path": "/jlqRZS4qGvcUokv3EaWSXZsi04l.jpg",
               "id": 2077,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Gen. Korrd",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006999",
               "name": "Charles Cooper",
               "profile_path": "/2Zk4dOIlcWRGO1RXsPoWVbL7Fcf.jpg",
               "id": 2078,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Caithlin Dar",
               "gender": 1,
               "credit_id": "52fe4222c3a36847f800699d",
               "name": "Cynthia Gouw",
               "profile_path": null,
               "id": 2079,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Capt. Klaa",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069a1",
               "name": "Todd Bryant",
               "profile_path": null,
               "id": 2080,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "God",
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069a5",
               "name": "George Murdock",
               "profile_path": "/6FsCrzj86JjQJsEMYWnDBdPa0kw.jpg",
               "id": 2081,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Young Sarek",
               "gender": 0,
               "credit_id": "5510cdd69251415c32000756",
               "name": "Jonathan Simpson",
               "profile_path": null,
               "id": 1444735,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006965",
               "name": "William Shatner",
               "profile_path": "/4byp8PsbRkC3UQVuvMAh4bcj7E2.jpg",
               "id": 1748,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f800696b",
               "name": "Harve Bennett",
               "profile_path": "/1bjvMRvtV1UcA2hqAXiDRVLaAwF.jpg",
               "id": 1791,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f8006971",
               "name": "David Loughery",
               "profile_path": null,
               "id": 2075,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069ab",
               "name": "Andrew Laszlo",
               "profile_path": null,
               "id": 2082,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069b1",
               "name": "John M. Dwyer",
               "profile_path": null,
               "id": 796,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069b7",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069bd",
               "name": "Herman F. Zimmerman",
               "profile_path": null,
               "id": 2083,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069c3",
               "name": "Bill Shepard",
               "profile_path": null,
               "id": 2084,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4222c3a36847f80069c9",
               "name": "Peter E. Berger",
               "profile_path": null,
               "id": 2033,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58ffb44392514161dd002167",
               "name": "Michael Wood",
               "profile_path": null,
               "id": 1803758,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.62478,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 172,
      "vote_count": 457,
      "budget": 30000000,
      "overview": "Capt. Kirk and his crew must deal with Mr. Spock's half brother who kidnaps three diplomats and hijacks the Enterprise in his obsessive search for God.",
      "similar": [
         152,
         1892,
         1894,
         11,
         330459,
         637,
         1891,
         1895,
         95,
         1562,
         140607,
         13475,
         201,
         744,
         1374,
         425,
         745,
         335,
         334,
         675
      ],
      "original_title": "Star Trek V: The Final Frontier",
      "runtime": 107,
      "poster_path": "/kugwPq2E5IkzrgoxRycnoqqUS9H.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1989-06-09",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/9BQj9hq0aK6yM9Tm2NJ28jg572y.jpg",
         "name": "Star Trek: The Original Series Collection",
         "id": 151,
         "poster_path": "/zcB8KxHA4EapOoZZPAvwgmE1iGK.jpg"
      },
      "tagline": "Adventure and imagination will meet at the final frontier.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["William Shatner"],
      "runtime": 107,
      "synopsis": "On a desert planet, Nimbus III (the \"Planet of Galactic Peace\"), a humanoid man has dug a grouping of holes. While he digs another, he sees a dark horse and rider approaching. Panicking, he loads a crude rifle with ordinary stones and takes aim. The rider stops close by and approaches the man, telling him that he harbors a \"secret pain\" and that he needs to expose it. After a few moments of staring at the rider's serene face, the alien man is overcome with grief and says he feels like a great relief has overcome him. In return for this soul cleansing, the rider, who reveals himself as a Vulcan, asks the man to accompany him on an epic journey. To get there, they will need a starship. On Earth, James Kirk, Dr. McCoy and Spock are taking their shore leave in Yosemite National Park. McCoy, fretting, observes Kirk scaling El Capitan, muttering about Kirk's urge to \"[play] games with life.\" While he makes his ascent, Kirk is suddenly startled by Spock, who hovers nearby wearing jet-powered boots. Spock doesn't seem to understand Kirk's need to climb the mountain (Kirk says \"Because it's there!\"), citing the fact that Kirk will never break any records for free-climbing the mountain. Kirk suddenly loses his grip and falls; Spock races after him, catching his friend before impact. On Nimbus III, the Vulcan and his new followers survey the planet's one settlement, Paradise City. The move in and seize the city, capturing three delegates; General Korrd, a Klingon, Caithlin Dar, a Romulan and St. John Talbot, a Terran (Earthling). The Vulcan uses his persuasive power on all three, convincing them to join his cause. A distress signal is sent, something the Vulcan wants. Later Kirk, McCoy and Spock sit around a campfire and McCoy serves up homemade beans, laced with bourbon. The three talk about Kirk's near-death experience; Kirk says he wasn't afraid because his friends were nearby. When pressed a bit further, he says \"I've always known I'll die alone.\" They sing \"Row, Row, Row Your Boat\" together, after educating Spock on the song's meaning - which has no meaning and is merely intended to be fun for a group to sing together. Their vacation is interrupted with Uhura shows up in one of the USS Enterprise's shuttle craft and tells them that Kirk has been asked to deal with a sudden crisis in space. (Kirk had deliberately left his communicator behind so they wouldn't be disturbed.) Uhura also retrieves Sulu and Chekov from the forest after they lose their way on a hike. On the Enterprise, things are chaotic. The ship's systems are constantly malfunctioning and Scotty, though happy to be working, still has his hands full bringing the ship to functionality. Transporters are also malfunctioning, hence the use of the shuttlecraft. On the bridge, Kirk gets his mission orders from Admiral Bennett (a cameo by Harve Bennett); Kirk and his crew are to travel to Nimbus III and rescue the prisoners in Paradise City. A video showing the Vulcan's small army, the Army of Galactic Light, and their leader's demands is displayed for everyone. Spock, seeing the Vulcan in the video, is suddenly overcome. He explains to Kirk that the leader is Sybok, an outcast Vulcan who believed that the true meaning of Vulcan culture and existence was the embracing of emotion in contravention to Vulcan culture. Spock knew Sybok in his younger days, before he left Vulcan to follow his own pursuits. In a remote sector of outer space, a Klingon Bird-of-Prey de-cloaks near an old Terran Gemini satellite. The ship's commander, Klaa, fires blasters on it, destroying it. Klaa, clearly bored, desires a live target to engage. His executive officer receives news of the distress call about the incident on Nimbus. Klaa becomes excited, knowing that Kirk would be a formidable opponent. He orders a course set for Nimbus to intercept Kirk. The Enterprise arrives at Nimbus and sends a ground crew down in a shuttle. On the surface, they first subdue an outpost outside Paradise that is occupied by some of Sybok's followers - Uhura is the bait, doing an erotic fan dance to attract them. Donning the guards' clothing and using their mounts, they gain entry to Paradise City. At the same time, Chekov, who has been given the conn on the Enterprise, negotiates with Sybok from space as a distraction. Outside, Spock locates the prisoners, however, their ruse doesn't last and they are identified as infiltrators. A battle breaks out; several of Sybok's men are stunned and Kirk makes his way into the tavern where the prisoners are being held. When Kirk finds them, they take him prisoner and lead him outside, where the rest of Kirk's team have also been captured. Spock meets Sybok and tells his fellow Vulcan that he is under arrest. Sybok laughs, saying that he is happy to see Spock has developed a sense of humor. Spock deadpans that he wasn't joking. Sybok turns his attention to Kirk and tells him he intends to steal the Enterprise, refusing to say what he needs it for. With no choice left to him, they all head back to the shuttle and take off. On the Enterprise, the Klingon Bird-of-Prey is detected right before it cloaks. Chekov orders the shields raised, which prevents the shuttle from docking. The usual procedure of using the tractor beam to lock on the shuttle will take far too much time, a period in which Klaa could easily cripple or destroy both vessels. Kirk orders Sulu to fly the shuttle in manually, an extremely dangerous procedure. Klaa's attack fails, and the shuttle crash lands in the docking bay. The Enterprise races off at warp, leaving Klaa excited that his target is so elusive. In the cargo bay, Kirk and Sybok regain consciousness first and grapple over a rifle, Sybok seizing it first. He leads Kirk out at gunpoint; Kirk attacks him but fails to subdue the stronger Vulcan. The rifle is retrieved by Spock who points it at Sybok; despite Kirk's shouted order to shoot Sybok, he doesn't and they are imprisoned once again, much to Kirk's consternation. They are led away and Sybok requests a private moment with Sulu and Uhura. In the brig, which, according to Spock (who acted as the test subject) is escape-proof, Kirk admonishes Spock for not protecting his ship and his crewmates by shooting Sybok. Spock says that he could not shoot Sybok because they are half brothers, Sybok being the child of a relationship his father had with a Vulcan priestess before he met Spock's human mother. While they are trapped in the brig, Sybok reveals his plan; the Enterprise will travel through the galaxy's Great Barrier where he believes they will find a place called Sha Ka Ree, what humans would call Eden, or paradise. Kirk remarks that no one has ever returned from beyond the Great Barrier, nor has any probe (which is not true if one were to include the original series in which the Enterprise went through and back twice once in season 1, episode 3, \"Where No Man Has Gone Before\" and season 2, episode 22, \"By Any Other Name\"). Spock remarks that Sybok has spent his entire life searching for the Vulcan paradise. Just then, they receive a message through the wall in ancient Morse Code telling them to \"stand back\". Scotty breaks through the wall, freeing them. They make their way through the ship's back tunnels; Scotty directs them to a turboshaft where they can reach the ship's observation deck to send a distress message to Starfleet. Scotty continues walking and bangs his head, falling unconscious. He is later found by Sulu and a small search party and taken to sick bay. Meanwhile, Kirk, Spock and McCoy must climb the turboshaft's ladder by hand. They begin, but Spock disappears for a moment. Kirk and McCoy climb but are winded and exhausted after climbing a few decks. Spock floats to them using his jet-powered boots, however, they cannot take the weight of all three. They float down where Sulu and Sybok's men wait to recapture them. Spock activates the boot thrusters, a dangerous move, but one that propels them away from their captors. The three make it to the observation deck and send their message, however they are quickly found by Sybok himself. Sybok doesn't mind that the message was sent, saying that once his discovery is confirmed, everyone in the galaxy will want to come to the Barrier to see for themselves. Kirk still objects, demanding control of his ship. Sybok asks to be alone with Kirk, Spock and McCoy. He shows them the power he possesses to turn them into his followers. McCoy is forced to confront the death of his father from a disease that was cured a few months later. McCoy says he wanted his father to die with dignity rather than suffer and says that he feels as though a weight has been lifted from his heart. Spock is forced to confront his father's lifelong disapproval of his half-human ethnicity. Kirk refuses to succumb to Sybok's will, saying he needs his pain because it makes him human. Just then a signal from the bridge tells them that they've reached the Great Barrier. Kirk allows the Enterprise to breach the Barrier. Inside, they find a barren planetoid bearing no life readings. McCoy, Spock, Kirk and Sybok take a shuttle down to the surface. After walking a short distance, Sybok cries out, demanding to see God. Suddenly, several finger-like rocks burst from the surface, forming a semi-circle. Inside, a strange, glowing being that resembles the Christian image of god appears and greets them. Sybok tells it that he breached the Great Barrier to find it. The being tells Sybok that it wants to use the starship they came in to spread its benevolence to the rest of the galaxy. While the others stare in awe, Kirk asks the being why, if it is all-powerful, it needs a starship to travel from it's home. When the being asks who Kirk is and why he would doubt him, Kirk suggests it should know already if it's actually \"God\". In anger, the being suddenly shoots Kirk with an energy bolt, wounding but not killing him. Spock steps forward and demands an answer to Kirk's question and is also hit by the energy bolt. McCoy says he doubts any god that inflicts pain and Sybok asks the being who it really is; it takes the form of Sybok himself and Sybok realizes that the being is the sum total of his own obsession and arrogance. He tries to grab the being and help it release it's pain and is consumed. As they escape from the being's lair, Kirk has Spock and McCoy beamed up. On the Enterprise, Spock sees that Klaa has arrived in his ship and his threatening the Enterprise with destruction. Spock turns to General Korrd to do something. Kirk runs, finally being cornered by the beast, when Klaa's Bird-of-Prey appears and blasts the creature into oblivion. Kirk thinks he's done for when he's beamed aboard the Bird-of-Prey. On board is Korrd who barks a few orders to Captain Klaa. Klaa apologizes, saying he made an unauthorized attack on the Enterprise. He also introduces his \"new gunner\", Spock, who fired the blast that destroyed the evil being on the planet below. Kirk says he thought he was finished, Spock tells him that he was never alone. Both Klingons and humans and other Federation races alike later attend a reception on the Enterprise that suggests a new era of cooperation has begun. The film closes with Kirk, McCoy and Spock back on Earth in Yosemite Park once again sitting around a campfire and singing \"Row, Row, Row Your Boat.\" Spock remarks \"life IS but a dream.\"",
      "writers": [
         "Gene Roddenberry",
         "William Shatner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098382/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI2OTExMDQxN15BMl5BanBnXkFtZTcwOTEyNDI4OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Shatner, Leonard Nimoy, DeForest Kelley | See full cast and crew »"],
      "reviews": [
         "Star Trek V ranks at or near the bottom of the Trek films for most fans and casual viewers. And upon viewing this on its special edition DVD, my opinion has not changed. This is a film that tries hard but ultimately fails due to poor plotting, sub-par special effects and poor character development. The movie opens with probably the best scene in the film, where you meet Sybok and learn a little about his quest. The visuals alone in the opening shots are very impressive. Then, slowly, scene by scene, the movie falls apart. Yes, there are a few peaks in there, which I will discuss later, but overall, the idea of a \"God Like Being\" in the center of our galaxy, it just so illogical. The movie has a lot of embarrassing and just plan bad moments. The first of which is the meeting of three characters who represent the \"Planet of Galactic Peace.\" However, their intro is rushed and these characters are not given any depth at all. Why introduce us to these \"important\" characters if they care not going to be used in any meaningful (maybe one of them at the end) plot point at all? The direction by William Shatner also seems very uneven. Take the scene with Scotty and Uhura on the bridge. There is a very awkward moment of silence after their main dialogue is over. And the mugging Shatner does when McCoy makes very awkward comments to Spock's story about Sybok is just out of place. And add to that a semi-naked Uhura and Scotty hitting his head for a \"Three Stooges\" laugh and you begin to sink in your chair. The Klingon plot seems tacked on just to add depth to the story. And by the time we see where the movie is going, we just feel very disappointed and underwhelmed. That said, I can't help but enjoy the wealth of good character moments in the film. I for one liked the campfire scene and the attempts of deep philosophy about old age and death. I also liked exploring the \"pain\" of McCoy and Spock and Kirk's insistence that he \"needs his pain.\" While most of the humor was forced and bad, the best had to be the \"I could use a shower\" scene, which is one of the biggest laughs in all of the Trek films. There were many moments of good direction by Shatner, especially in McCoy's \"pain scene.\" I do sympathize with Shatner a little, when listening to the commentary track, about how this was cut and that was cut but I still think on a whole, this movie was doomed to fail. The DVD's picture is sharp and the sound is excellent. The extras are quite good but I would have liked more insight as to what went wrong with the film besides tight schedule and budget. Shatner's commentary with his daughter is good but has too many quiet moments. Check out the hidden and brief \"comic reel.\" At this point in time, I do rank Star Trek V above Nemesis, mainly due to that movie's bad continuity issues but just barely. Still, it is Star Trek and if you like the characters, just sit back, don't expect much and enjoy the show.",
         "I've never figured out why ST V gets so much criticism. It's really not that bad, if you're a true trekkie. First off, sure the effects are a little low-fi...but so were the TOS episodes. I don't know about you, but I care more about story than effects. The main reason that I like this film because it's very episodic in nature. If you are a fan of the original Star Trek series, sit down and watch this movie as if you were watching one of the original episodes and it will be much more enjoyable. For one, it starts out like an episode with a prologue before the opening credits start. Secondly, the theme music for the movie is similar to that of the original series. Third, there are some lines from the film that sound like they would be right out of one of the older episodes. Lastly, this movie is loosely based on the storyline of an original episode. Ironically, the episode that it's based on is one of the TOS worst episodes: The Way the Eden. If you've seen The Way to Eden, the actual plot of the episode is not bad, it's just the hippie stuff that makes it so awful. This film kildly leaves out the awful hippie music of the original episode and focuses solely on the plot instead. I often wonder if Shatner wrote this film to make up for how bad The Way to Eden was. So, to sum up, watch this movie as you would watch an old episode and you'll enjoy it much more.",
         "ABSOLUTELY NO SPOILERS -- There is no shortage of people complaining about this film, but ST5 is a charmer for one simple reason - it is best-ever rendering of the Kirk, Spock and McCoy partnership the series ever produced. Trekkie's generally see the movie as the stepchild of the series, and even the Trek establishment writes it off as non-canonical. Many complain that the movie distorts the characters, or exploits them for humor. To them I'd say the movie offers some of the deepest moments in the relationships between Kirk, Spock and McCoy that the series ever had. THIS SHOULD BE STRESSED, in this chapter the three likely have more scenes together than they ever had anywhere else. Not every moment works, but together they grapple with betrayal, joy, doubt, loss. They do it with friendship, camaraderie, heroism and joy that justly makes them one of the most memorable pop-culture phenomena ever. (I do pity the rest of the original cast, most of whom have at least one unenviable scene.) It's great to return to this film and see these guys doing what they do best - long after they retired from the roles. Shatner and Paramount may have bungled a few things here, but I forgive them, because the three leads hit all the right notes. Give it a fair shot and see for yourself.",
         "*** Minor spoilers ahead *** When I saw this movie for the first time, I thought that the plot was hokey, the special effects were ugly, and that the movie had a somewhat abrupt ending. And turning Kirk into a free climbing enthusiast fit neither Kirk's character as depicted in the original series nor Shatner's rotund physique. A lot of people called this the worst Star Trek movie of them all and I was ready to believe them at the time. Having watched this again a few hours ago, I have to say this is a lot more enjoyable than I remembered, even if my original criticisms about the movie are still valid. But the film does contain a few scenes that are visually imaginative (such as the assault on Paradise City, Spock's jet boots, or the sequence around McCoy's inner pain), does feature some great acting (whatever happened to Larry Luckinbill after this?), and that it does capture that spirit of genuine excitement about going to new places and facing the unknown that used to be such an important motive in Star Trek and that is so painfully lacking from some of the later movies. As for the slapstick humor, which was not so well received originally (to say the least), I can only observe that between 1989 and now some of the Next Generation installments like \"Star Trek: Nemesis\" have shown what really embarrassing humor in Star Trek movies looks like, so the moments of comic relief in \"The Final Frontier\" seem positively uproarious in comparison. Most of the jokes are character-based here, and even if some of the characters come off as a little stupid (Chekov and Sulu getting lost, Scotty bumping his head on a beam, etc.) the humor is never as unfunny as the Data jokes from the NG movies. This movie must have lost its claim to \"worst Star Trek movie ever\" a long time ago, but apparently no one took notice. But most importantly, this movie is not really so much about Sybok's quest for Sha-Ka-Ree, as it is about the Kirk-Spock-McCoy relationship and the way it is challenged by the presence of an outsider (Sybok). And that is what really makes this movie compelling, if not exactly great. Never in the original series nor in the other movies has their relationship been studied as closely and with as much heart. So it is probably a good idea not to pay too much attention to the contrived action elements of the movie like the Klingon ship and instead watch this more like a romance. All things considered, this movie, while it may not be a classic, is one of the worthier additions to the Star Trek universe.",
         "I like underdogs. So, 12 years after having first seen Star Trek V, and thinking it was bizarrely bad, I gave it a second watch, hoping I would find some redeeming quality which I missed the first time around. I didn't. The writing is half-baked, and although at first the quality of the acting is stable enough to keep the movie on its feet (albeit shakily), the further we get into the plot the sillier it gets. The last quarter of the film is just plain ridiculous. What was even worse, from the original cast's POV, is that this was the first ST movie to be released AFTER the franchise returned to television with Next Generation, and the average episode of Next Generation would put this to shame* - including the special effects! What an embarrassment. The Final Frontier isn't thoroughly wretched - I gave it 4 out of 10 - but it's so far below the standard of its predecessors (yes, including the first one) that the only reason I can think of to watch it is because you'll appreciate the other movies more. * unless it's an episode with Troi's mother in it.",
         "This is often said to be the worst of the Star Trek films. After watching it I can see why a lot of people would think that. It is a very flawed film but I by no means hated it. In fact, I liked it more than Star Trek: The Motion Picture. Star Trek V: The Final Frontier opens with the crew of the Enterprise enjoying some well deserved shore leave. Kirk, Spock, and Bones enjoy their time off together by going camping in Yosemite park and this makes for some amusingly cheesy moments. Their vacation is interrupted when they must respond to a hostage situation concerning a renegade Vulcan who happens to be Spock's half brother. This Vulcan's name is Sybok and he is on a desperate search for God and the end of the universe. There are also some Klingons in pursuit of Kirk and the Enterprise, but they don't seem to serve much of a purpose in the end. The Final Frontier is all kinds of weird and doesn't have much of a structure, but I can't say I didn't have fun with this movie. Remember how The Voyage Home added this element of comedy to Star Trek? Well The Final Frontier saw that and thought to itself, 'Hey! I can do that too!' Unfortunately, it was wrong. Any and all comedy in this film is completely unnecessary and either makes you cringe or roll your eyes in embarrassment. There are moments in the film where I was left wondering, 'Why in the hell did the writers think that line was a good idea?' The movie tries way too hard with its ridiculous punchlines and awkward moments that are supposed to be hilarious. A lot of the humor comes around when the friendship between Kirk, Spock, and Bones is being developed. This was always an important aspect of Star Trek, but The Final Frontier almost makes a mockery of it. Never, under any circumstances do I need to watch Shatner, Nimoy, and Kelley sit around a campfire singing Row Row Row Your Boat. But I guess these were the days when Shatner and Nimoy were building their \"singing\" careers so they thought they needed those \"careers\" to carry over into Star Trek. This movie had the potential to be incredible. Sybok's search for God could have gone much deeper and been much more intellectual than what it was. This aspect of the film had spiritual and existential overtones, but they were buried by silly nonsensical scenes that do nothing for the plot. There is a lot to strip away if you want to get down to the more intellectual meaning of this film. It is something that was so obscured by the amount of crap this film throws together that in the end it was a completely lost meaning. But if you move past that, The Final Frontier can be pretty fun. If you enjoy it for its cheese than you can have a moderately good time. Especially towards the end, the film becomes completely over-the-top and loaded with cheese. It isn't like The Motion Picture, which tried way to hard to be something it wasn't and painfully dragged on for over two hours. The Final Frontier clocks in at only an hour and 45 minutes and just stays lively and fun the whole time. It isn't high quality fun, but its fun nevertheless. This definitely is not a Star Trek film I would watch again, but its a necessary watch if you are a fan of Star Trek like me and have made it your duty to see all of the films. Star Trek: The Final Frontier is not a good movie. But its not a bad movie either. It isn't one of those that I just hated by the end, but I knew for sure that what I had just seen was not a very well made film. I love Star Trek so watching Kirk, Spock, and Bones boldly go where no man has gone before, even if they go to a realm of such cringe worthy cheese as this, still puts a smile on my face.",
         "Having recently purchased the box set of all 10 Star Trek films (including Next Generation), I watched Star Trek V, not having seen it since it was released, hoping that it would improve on a second watching. Watching it now, I can see that here was a story that could have been very, very powerful, and the film could have been an equal to Star Trek: The Motion Picture, which is also underrated by non-Star Trek fans. The overwhelming sense I got in this film was that everything proceeded so quickly, as if the producers/director felt that a successful film was trim, with no excess fat. Those people who really enjoy a good steak, enjoy that little bit of fat on the edge, or marbled through the meat. It makes it all so much more tasty, even if it has little nutritional value. To remove myself from the metaphor, Star Trek fans enjoy the taking of time over certain elements - seeing the ship, seeing it travel, dialogue en route, etc. If there was a director's cut, or another cut, that wasn't so very lean, I think the new pace would work to the film's advantage. Of course the worst element of pacing is the finale. When we finally arrive at the centre of the galaxy, Kirk & Co. march straight in without much ado. Think to the Enterprise venturing into the cloud that surrounded V-GER. We were given time to savour the beautiful visuals set to a engaging score. To my mind this doesn't happen in Star Trek V, and this is its weakness. I think it is still a reasonable film. The scene where Spock and McCoy are shown there heart's deepest wound is quite moving. With a little more breadth, this could have been incredible. It's frustrating that the film will not get the best treatment the story deserves. When watching the special features, it seems that the production was not smooth sailing, the finale weakened due to poor response (according to Shatner) from special effects teams. As a Star Trek fan, I can't give this film less than a 5. I hope that's not out of sentimentality.",
         "V has some of the best moments in the entire series. The camping scene is both funny, and insightful. I also love the scene in the brig. (\"I oughtta knock you on your Goddam ass!\".......\"Want me to hold him, Jim?\") The only mistake was hiring an effects crew who had never done motion control blue screen model effects before. And that was NOT William Shatner's fault. That was Ralph Winter's and Harve Bennet's fault. Quit blaming William Shatner. The producers hold the purse strings, and hired idiots. Watch the new DVD and you will see model test shots that were not for action blocking, but were the effects team actually trying to figure out how to do the effects. Lame Watch this movie, focus on the characters, and ignore the space shots, and it's pretty good. I think since they reworked ST:TMP with new effects based on the original story boards, they should have done the same for ST:V for the new DVD. That would have fixed the whole movie. Besides all of the exterior ship shots, the scenes I would have fixed are as follows: The turboshaft - Change the deck numbers to make sense and erase the shadow made by the boom holding them up. All viewscreens - Insert remastered footage digitally to replace the poor rear-projection versions. The new Enterprise would have an even clearer screen, not a grainy, dim one. The only one that worked was the observation windows as they approached the great barrier. The fall scene at the beginning. Inserting the closeup of Kirk and Spock ruined the entire scene.(Exactly like the parasailing scene in Die Another Day) Seeing a real stuntman is always better than seeing a fake shot of the actor.",
         "Welcome to the Plan 9 From Outer Space of Star Trek movies. Come on, trekkers, admit it. This movie is so bad, so staggeringly inept in every department, it's become something of a classic. The Shat gives the worst performance ever committed to celluloid. \"BOONES! Hi, Bones\" Brilliant! This isn't just Ham - it's several large pig farms in Kentucky! The \"Special\" Effects. Should be done under the trade descriptions act for using such a term. The Enterprise is a moving piece of cardboard in this film. Really! Even the Star Trek TV show had better. Bones, Spock and The Shat sing! Yeah, Spock sings Row Row Row Your Boat. After struggling over the meaning of the words!!!! \"Capt. Life is Not A Dream\" Poor Leonard Nimoy, he must really want to strangle Shatner for this. Could The Shat not have given us his rendition of Mr. Tambourine Man, or harmonised with Nimoy on Ballad of Bilbo Baggins? Sorely disappointed. A Sean Connery look-a-like plays Spock's half-brother. Only cos they couldn't get Sean Connery! Uhura does a fan dance! That would have been sexy in 1966. In 1989 it's like watching your drunk granny embarrass herself at a Christmas Party. Much amusement from watching Spock neck-pinch a horse... Cat Woman/Tina Turner Jumps on Shatner's back! Shat twirls her around a few times like a WWF Wrestler, and chucks her off. Yayy The Shat! He shows his respect for alien life forms by leaving her face down in a pool of water. Nice one! Seems Connery 2.0 was a bit of a Vulcan rebel. Which explains why Spock hasn't previously mentioned him in 79 t.v episodes and 4 movies. McCoy apparently mercy-killed his Dad, BUT AFTERWARDS THEY FOUND A CURE. Tell me this isn't hysterically funny. The 11 deck Enterprise suddenly grows another 400 decks for an escape sequence in an elevator shaft. The Enterprise breaches the galactic barrier, which has mysteriously moved from the edge to the centre of the galaxy (see Where No Man Has Gone Before). Still, that's only about 50,000 light years... Shatner meets God! Or what purports to be God, but I assume is really some kind of alien being. God looks a bit like Charlton Heston in The 10 Commandments. Sean Connery the 2nd calls on God to share his pain, and promptly dies. Or something. God punishes the Shat for questioning his identity. So Spock kills God with a photon torpedo. I'd love to know what Jehovah's Witnesses made of this scene. The Shat, having killed God, promptly goes back to his sing-song with Spock and Bones. Altogether now, Row Row Row Your Boat.....",
         "I find it almost touching how Star Trek fans try desperately to like this film in spite of its unbelievable number of flaws. To begin with, none of the familiar characters are really in character so to speak. Scotty is depicted as a bumbling tinkerer instead of the competent engineer he was in the original series. Uhura...Gods, I can't even think about what they did to her character. All of her dialog was painful to listen to. McCoy seemed like a neurotic stepfather to Kirk instead of his trusted friend. Spock...well, let's just say that Leonard Nimoy was terribly wasted. He was given bad dialog (\"I do not believe you have grasped the gravity of your situation Captain.\" Gravity, get it? Get it?) and made almost into a buffoon. Kirk...oh man, don't get me started. William Shatner is a hammy actor to begin with, so to allow him to direct really is to invite disaster which is what we got. The plot is beyond ridiculous. Giving Spock a brother is a pretty desperate story line and unnecessarily soap operaish. But hey, let's go with it. The search for God. Again, a weak plot basis. You don't think so? OK, let's go with that too. So assuming that the two aforementioned plot elements are sound, what's wrong with the script? Well, for one thing, it recycles way too much. The Enterprise, for example, is yet again, not working properly. Are we to assume that Starfleet would send a grossly malfunctioning ship with a skeleton crew into a potentially dangerous situation just because they want James Kirk to handle the situation? If that's the case, then why not put him on a better ship as an adviser? Adding to that...the crew is grossly incompetent. Scotty has the ship in pieces (and apparently is cloddish enough to bump his head knocking himself into unconsciousness WHILE there are hostiles on board!), no one seem to notice the Klingon ship decloaking at a crucial moment (despite the fact that the sensors are clearly showing the ship in weapons range) and the crew all seem way too familiar with each other. In other words, there is no sense of discipline. If this is the flagship of Starfleet, then it's a wonder that the Klingons hadn't already overthrown the Federation. As to the personal struggles with pain, it was crap. Lawrence Luckenbill is a competent actor, but even he couldn't save this turkey. In short no one could. Of all the people involved, I imagine Leonard Nimoy is the most embarrassed by it. I hope he is, anyway. Thank god the original cast didn't bow out on this cloddish opus."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "When the newly-christened starship Enterprise's shakedown cruise goes poorly, Captain Kirk and crew put it into Spacedock for repairs. But an urgent mission interrupts their Earth-bound shore leave. A renegade Vulcan named Sybok has taken three consuls hostage on the planet Nimbus III, an event which also attracts the attention of a Klingon captain who wants to make a name for himself. Sybok's ragtag army captures the Enterprise and takes it on a journey to the center of the galaxy in search of the Supreme Being.",
         "The crew of the Federation starship USS Enterprise is called to Nimbus III, the Planet of Galactic Peace. They are to negotiate in a case of kidnapping only to find out that the kidnapper is Spock's long-lost half-brother. This renegade is possessed by his lifelong search for the planet Sha-Ka-Ree which is supposed to be the source of all life. Together, they begin to search for this mysterious planet. Meanwhile, a Klingon captain wants to make a name for himself and sets out to pursue the Enterprise and intercept Kirk.",
         "It is the 23rd Century and vacationing Captain Kirk faces two challenges: climbing Yosemite's El Capitan and teaching campfire songs to Spock. But vacations are cut short when a renegade Vulcan with a startling secret hijacks the Enterprise in order to find a mythical planet. Kirk and his crew set out to stop this madman in an adventure that takes them to the center of the universe and, perhaps, before the face of God. With the crew under Vulcan control, the captain must rely on an unlikely alliance to save the galaxy.",
         "Captain Kirk and his crew must deal with Mr. Spock's long-lost half-brother who hijacks the Enterprise for an obsessive search for God at the center of the galaxy."
      ],
      "budget": 27800000
   },
   "movielensId": 1373,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-06-09",
      "dvdReleaseDate": "1999-04-20",
      "directors": ["William Shatner"],
      "runtime": 107,
      "movieId": 1373,
      "title": "Star Trek V: The Final Frontier",
      "mpaa": "PG",
      "actors": [
         "William Shatner",
         "Leonard Nimoy",
         "DeForest Kelley",
         "James Doohan",
         "George Takei",
         "Walter Koenig",
         "Nichelle Nichols",
         "David Warner",
         "Laurence Luckinbill",
         "Charles Cooper",
         "Cynthia Gouw",
         "Todd Bryant",
         "George Murdock",
         "Jonathan Simpson"
      ],
      "imdbMovieId": "0098382",
      "originalTitle": "Star Trek V: The Final Frontier",
      "genres": [
         "Science Fiction",
         "Action",
         "Adventure",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "XE7_pOy_jZk",
         "8TB5J_sbCbE",
         "TxMOEULvSVI",
         "FwLbW_Dmh5I"
      ],
      "plotSummary": "Capt. Kirk and his crew must deal with Mr. Spock's half brother who kidnaps three diplomats and hijacks the Enterprise in his obsessive search for God.",
      "tmdbMovieId": 172,
      "avgRating": 2.8716,
      "releaseYear": "1989",
      "numRatings": 8855,
      "posterPath": "/kugwPq2E5IkzrgoxRycnoqqUS9H.jpg"
   }
}