{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "post-apocalyptic",
            "id": 4458
         },
         {
            "name": "virus",
            "id": 188957
         }
      ],
      "imdb_id": "tt0115471",
      "video": false,
      "title": "Adrenalin: Fear the Rush",
      "recommendations": [
         182886,
         102396,
         23825,
         24231,
         117904,
         38246,
         76340,
         32064,
         19002,
         273756,
         38849,
         72231,
         2089,
         49345,
         26340,
         55261,
         25684,
         40729,
         71456,
         64218
      ],
      "backdrop_path": "/4JOZvYBrtZjsi4wWUC4uJlPsfts.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lemieux",
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d091",
               "name": "Christopher Lambert",
               "profile_path": "/sIl2F9LDTjfnAVBxEG5CTtZGuJU.jpg",
               "id": 38559,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Delon",
               "gender": 1,
               "credit_id": "52fe48dbc3a36847f817d095",
               "name": "Natasha Henstridge",
               "profile_path": "/z0gm11WfolcmUUGDsTusUZsR60Y.jpg",
               "id": 57395,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cuzo",
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d099",
               "name": "Norbert Weisser",
               "profile_path": "/peOhXratQ7tp716MfQNjqUTruzr.jpg",
               "id": 6701,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Wocek",
               "gender": 1,
               "credit_id": "52fe48dbc3a36847f817d09d",
               "name": "Elizabeth Barondes",
               "profile_path": "/ftWdxssktRVegm8qltvivvGjcxj.jpg",
               "id": 61556,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Volker",
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d0a1",
               "name": "Xavier Declie",
               "profile_path": null,
               "id": 1041314,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Suspect",
               "gender": 0,
               "credit_id": "52fe48dbc3a36847f817d0a5",
               "name": "Darrell Davis",
               "profile_path": null,
               "id": 1163144,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Capt. B. Rennard",
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d0a9",
               "name": "Nicholas Guest",
               "profile_path": "/ohlltWmy7xiyQ7CwEZhV6KnyeKO.jpg",
               "id": 36821,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sterns",
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d0ad",
               "name": "Andrew Divoff",
               "profile_path": "/3ana0vJs5uLDXb6dSHvp5naKmcl.jpg",
               "id": 36218,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "General Waxman",
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d0b1",
               "name": "Jon H. Epstein",
               "profile_path": null,
               "id": 91897,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d08d",
               "name": "Albert Pyun",
               "profile_path": "/3Bxq2mHND331bCi79eoCXB9MapK.jpg",
               "id": 63937,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48dbc3a36847f817d0b7",
               "name": "Albert Pyun",
               "profile_path": "/3Bxq2mHND331bCi79eoCXB9MapK.jpg",
               "id": 63937,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.711222,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 55687,
      "vote_count": 20,
      "budget": 0,
      "overview": "In a not-too-distant future, a lethal virus sweeps across Europe, prompting the creation of quarantine refugee camps in the United States. Police officers Delon (Natasha Henstridge) and Lemieux (Christopher Lambert) learn of a grisly murder in the Boston camp and team up to investigate. Suspecting the ruthless killer is infected with the virus, the pair have just hours to stop him before he becomes contagious and infects the entire population.",
      "similar": [
         294254,
         110415,
         6479,
         8810,
         9355,
         5491,
         1562,
         12244,
         1576,
         9659,
         49049,
         198663,
         119450,
         861,
         63,
         76341,
         20504,
         131631,
         263115,
         534
      ],
      "original_title": "Adrenalin: Fear the Rush",
      "runtime": 77,
      "poster_path": "/hNoDcwHC86caST3oyTdn2iRSeA0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Filmwerks",
            "id": 7954,
            "origin_country": ""
         }
      ],
      "release_date": "1996-11-29",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "If he's not dead by dawn...we are.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Albert Pyun"],
      "runtime": 77,
      "synopsis": null,
      "writers": ["Albert Pyun"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115471/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNDYxMDAyNV5BMl5BanBnXkFtZTcwNTM1OTQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Lambert, Natasha Henstridge, Norbert Weisser | See full cast and crew »"],
      "reviews": [
         "Chris Lambert, you might think, is always good value for money. Or you might not think that at all. In fact, realistically, you're more likely to think that Natasha Henstridge (her out of Species) is always good value for money. Well, it doesn't matter in this case because you're wrong either way. Stop crying, you fool. The first thing you'll notice about Adrenalin is that it all appears to have been filmed in a few scabby streets just behind the director's back garden. He probably thinks this looks authentic. It doesn't. It looks tragic. The entire film consists of Chris, 'Tash and a couple of other disposable rentacops legging it from one end of a street to the other and back again, popping into disintegrating buildings here and there along the way so that bits of it can fall on them, and occasionally pausing at either end of the street for a random shoot-out and/or for someone to get eaten by the startlingly unscary maniac they're supposed to be chasing. It must have taken such a great effort on behalf of all involved to keep the production values so consistently low that it somehow seems deserving of applause. Ms. Henstridge, predictably, has very little to do except look scared, not manage to shoot anything and almost die every so often, while the inestimable Mr. Lambert seems to be here for no other reason than to get shot loads. It speaks volumes that he doesn't even attempt to rescue the film by interjecting his endearing trademark cackle into the dialogue at key moments. Not that he'd get much chance anyway: nobody really says anything but \"Yowch, aargh, shoot him, he's eating me, aargh, oh no we're trapped, yowch, shoot him, aargh, my leg's fallen off.\" The plot's some tosh about a plague having wiped out most of humanity, again, and towards the end of the film the wonderful scriptwriter comes up with the idea of having some Virus Control people turn up, mumble something about this killer they're chasing actually being the carrier of a new and far more deadly strain, then go away again and leave everyone to carry on getting shot. Everyone, that is, except for the people stuck with the job of writing up the box blurb, who seize this precious jewel of hope from the pigsty of horribleness and nurture it as if it were their own rancid offspring. Adrenalin, then. It's one of the most boring films I've ever seen, which, for something that bills itself as a sci-fi horror thriller, isn't very good really.",
         "This movie has something strange.. I think it's some kind of an experiment. There is nearly no storyline which develops during the running film. But there is an amazing cinematography by George Mooradian! (Widescreen-Version only!) It seems to be a test of how to produce a movie which \"lives\" by the moving camera. Sometimes there are nearly no cuts in 1 minute, or so. The editor tried some new ways of filmmaking, I think. From this point of view, the film is amazing! The Scope-Camera moves really fast and virtuously... But maybe Albert Pyun is as dumb as everyone thinks and so they just made another low-budget-product!!! Who knows........",
         "This senseless and incoherent action/horror flick is one of director Pyun's better movies. Number one...it's short, clocking in at a brisk 77 minutes. Number two...it's got the \"Species\" babe Henstridge in a role that doesn't require her to shed her clothes, but she STILL looks great. Number three...I like Lambert, no matter how awful the movies he chooses to be in happen to turn out. As another reviewer stated, Lambert and Henstridge are cops chasing a mutant killer, who is carrying a contagious disease, through what looks like a sewer. That's about it for plot development, although there are some half-baked attempts to fill in Henstridge's character. Pyun is best suited to directing action set pieces and he has lots to work with here. Nice little time waster that's never boring and is over before you know it.",
         "I was at the local DVD retail store a couple of weeks ago and found ADRENALIN sitting on one of the shelves, first time I saw it was years ago when it first came out on VHS I actually liked it, I mean it was no masterpiece and surely wasn't as bad as people said it was, well okay if you want something that has more of a story, I recommend you try something else, because this film only sums up the story as follows. A chemical leak in Europe has caused a deadly new virus, as the disease starts to spread towards the U.S, the government sets up quarantine camps in order to contain the large number of immigrants, now two cops that patrol the camps, one a rookie, (Natasha Hentsridge of Species and Ghosts of Mars) the other a seasoned veteran (Christopher Lambert of Highlander and Fortress) discover that a deranged killer is stalking the camps, but what they don't know is that he is infected with another type of virus that poses an even greater threat. Now I have Adrenalin on a very worn out VHS tape, but I decided to buy the DVD for better quality, and to my surprise turned out to be a longer version of the film, the difference between them is the longer version has a longer pre credit sequence that paints a grimmer picture of what went on, and has a few extra scenes and some of the scenes you might be familiar with in the shorter version are extended, but I still like it, despite what others think. Lastly, I have to admit I find Albert Pyun to be an interesting director, sometimes he directs a lot of really good films and other times I wonder is this the same guy? because considering his standard of good films, the bad ones actually leave your jaw hanging open and asking yourself, does this guy make movies to reflect in what kind of mood he's in at the time? Because when his movies are bad they're bad all right.",
         "Two cops chase a killer into a factory. What else? I don't know because the picture was so damn dark i couldn't see what was happening! You never know what is going on! It's as if the director forgot to put lighting on his budget for this film! I had the unfortunate luck of seeing this movie in a theater. Don't let the same tragedy happen to you.",
         "An interesting concept and a fast paced movie.",
         "Although I can accept the critics of the minimal storyline this movie shows, I don't get what's the real problem with it. The effects and stunts are okay. The characters are of a standard kind for a movie like that. Story and idea are on a good atmospheric level. And the main argument for rating this movie on a higher position: Excitement... really nerve wrecking excitement. Also, Natasha Henstridge and Christopher Lambert did a good job. I like both of them as actors and charmful characters. The combination of Mad Max, Bone Collector and Escape from NY fits to the main actors and results in a interesting and thrilling movie based in somewhat dirty end-times.",
         "It would be unfair to comment that Adrenalin is boring at all. Although it was a low budget Pyun film, it has its moments. Although I watched the movie on TV, I still got some excitement. Not bad as a B grade thriller for mediocre audience like me! One thing I am still confused about, in the beginning of the movie it reads \"Romania, western Europe\", but the movie trailer says it is Boston. Another plot hole of the film, to me, is if the guy who was infected by a virus something like rabies, seems to be sane and very intelligent. How could he be so clever and retain his mental composure? He was supposed to be delirious or in coma instead. I don't think the writer cared about this details. 3 out of 10, for the sake of the face value of Lambert, my icon.",
         "(May have spoilers) Fine, I admit it. I panick like hell with any horror film. HOwever, being a huge Lambert fan, I could not resist buying this one (it was $2, after all). The director is Albert Pyun. With low budget, he's done some great stuff (\"Mean Guns\"), some acceptable stuff (\"Blast\"), and disasters (\"Captain America\"). This one would fit somewhere between the last two categories. I expected this to suck enormously yet I wasn't highly dissapointed. It's Eastern europe (though it says Boston ¿), and after the Russian government collapsed, there's something killing people. To get this supposedly ordinary killer, the rookie Delon (Natasha Hensdrige, \"Species\") and other cop are sent to stop him. The other cop soon is killed and she is sent backup, among them Lemieux, a \"distinguished\" officer (Christopher Lambert). These four start to chase the creature around and that's the whole film. The main character is the lovely Natasha, and not the Lamberto, who is always either getting shot (hang on -- you were shot, you broke a leg... this is not Highlander, right?), or buoying her to follow the thing. How come she ended here, I wonder if this wasn't to prove that she can do a film without showing her boobs. Andrew Divoff makes a secondary appearance here, probably promised to have a bigger role (in \"Blast) or after that film, he was doing a favour to Albie. The rest of the cast is somewhat fine. The filming is great for the little budget, and it's not bad. It's just one of Pyun's \"location films\", where everything happens in the same place. It deserves a 5 so I give it a 5.",
         "If you let the movie suck you in then you'll be in for a tense and exciting 76 minutes. If you sit there and let your mind wander and start thinking about things such as why the police cars in the movie all have policia written on them when the movie is set in an American city (Boston I think...), you'll be in for a very boring time, and you'll probably agree with the lowly rating that this movie has on this site. It's an interesting and unique movie though, and doesn't deserve to be named one of the all-time stinkers. If you're looking for better Albert Pyun, and better Christopher Lambert, then tune in to their second project together, 'Mean Guns'."
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Filmwerks",
         "Largo Entertainment",
         "Toga Productions"
      ],
      "summaries": ["The Russian government has collapsed. Amidst the chaos, riots, and struggle for power, a terrible weapon has leaked out. Virulent microflage, a deadly germ of the cold war has begun to spread across Eastern Europe, killing massive numbers of people. Now, in a quarantine camp set up for immigrants in 2017 Boston, one vicious murderer has the disease. Within two hours he will become violently contagious, and it is up to a team of officers in a race against time to track him down and stop him... if he doesn't kill them first."],
      "budget": 0
   },
   "movielensId": 1383,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-29",
      "dvdReleaseDate": "2002-03-19",
      "directors": ["Albert Pyun"],
      "runtime": 77,
      "movieId": 1383,
      "title": "Adrenalin: Fear the Rush",
      "mpaa": "R",
      "actors": [
         "Christopher Lambert",
         "Natasha Henstridge",
         "Norbert Weisser",
         "Elizabeth Barondes",
         "Xavier Declie",
         "Darrell Davis",
         "Nicholas Guest",
         "Andrew Divoff",
         "Jon H. Epstein"
      ],
      "imdbMovieId": "0115471",
      "originalTitle": "Adrenalin: Fear the Rush",
      "genres": [
         "Action",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In a not-too-distant future, a lethal virus sweeps across Europe, prompting the creation of quarantine refugee camps in the United States. Police officers Delon (Natasha Henstridge) and Lemieux (Christopher Lambert) learn of a grisly murder in the Boston camp and team up to investigate. Suspecting the ruthless killer is infected with the virus, the pair have just hours to stop him before he becomes contagious and infects the entire population.",
      "tmdbMovieId": 55687,
      "avgRating": 2.28146,
      "releaseYear": "1996",
      "numRatings": 151,
      "posterPath": "/hNoDcwHC86caST3oyTdn2iRSeA0.jpg"
   }
}