{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "moral courage",
            "id": 13098
         },
         {
            "name": "whaler",
            "id": 162756
         }
      ],
      "imdb_id": "tt0052287",
      "video": false,
      "title": "Terror in a Texas Town",
      "recommendations": [
         70387,
         103164,
         4938,
         39557,
         39834,
         53651,
         264131,
         179855,
         111736,
         28758,
         38659,
         65799,
         141824,
         22408,
         43114,
         55150,
         42328,
         21006,
         44921,
         60555
      ],
      "backdrop_path": "/t6bvieSEPNpkr01MkAn8xv1dwP2.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5524518a92514166c10038b1",
         "content": "The Whaler and the Western.\r\n\r\nJoseph H. Lewis was something of a B movie king, with his best directorial efforts coming via Westerns and film noir. After this Sterling Hayden starrer he signed off from Hollywood for good, as a legacy it's difficult to say if it's a fitting point of reference to Lewis and his talents, or entirely apt for his career? It's an often quirky, even bizarre, picture that manages through its surreal like tendencies to detract from its formulaic Western plot. \r\n\r\nSet in Prairie City, Texas, the tale revolves around George Hanson (Hayden), a Swedish whaler who after 19 years away, returns to Prairie to find his father has been murdered. As he delves deeper with a staunch undaunted determination, he finds that the law is corrupt and a horrible land baron called McNeil (Sebastian Cabot), aided by gunslinger for hire Johnny Crale (Ned Young), is behind his fathers death. It appears there is oil in the land and McNeil is using force to buy up the land at ridiculously cheap prices. But if he thought George was going to be forgiving? Or going to be easily frightened? Well he and Crale are in for some big shocks. \r\n\r\nShot in stark black and white, Lewis' film throws up the always interesting conflict between homespun virtue and greedy evil. There's compelling villains and some nicely drawn characterisations for the decent citizens of the town, such as those who are on the periphery of the protagonists struggle (note Victor Millan's poor Mexican farmer and Carol Kelly's downbeat girlfriend of Crale). \r\n\r\nWhat of Hayden, though? It's a fascinating performance, where saddled with the task of trying to do a Swedish accent, and wearing a suit a size too short for him, it's difficult to know if he is in tune with the off-kilter nature of the film, or he's just on robotic auto-pilot while Lewis chuckles to himself off camera. Either way Hayden gives us a character to root for with our every breath. Hanson is a bastion of good and well meaning, we ache for him to outdo the lobster eating land baron and the metal clawed outlaw. \r\n\r\nThere's some controversy in the tid-bids here. The script was credited to Ben Perry, but actually was written by Dalton Trumbo who was blacklisted. Hayden, although not blacklisted, appeared before the House of Un-American Activities Committee and simultaneously admitted past communist affiliations and named names. Lewis was not involved in the unsavoury chapter but was a close friend of Ned Young, who was blacklisted for taking the fifth, but whose impact on the film was to not only be in it, but to also be instrumental in getting Lewis to direct it. Boy was that an interesting time in American history. \r\n\r\nStylish, odd and certainly different, Terror In A Texas Town has enough about it to make it worthy of a night in. And it gets better on repeat viewings once you buy into the kookiness. 7.5/10",
         "url": "https://www.themoviedb.org/review/5524518a92514166c10038b1"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "George Hansen",
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f701",
               "name": "Sterling Hayden",
               "profile_path": "/zFntWs4OdfXszzEauHrMURQJkRD.jpg",
               "id": 3088,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Ed McNeil",
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f705",
               "name": "Sebastian Cabot",
               "profile_path": "/x4xosGUCYnuUQntxgbcZryWaKH6.jpg",
               "id": 21877,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe4705c3a36847f811f709",
               "name": "Carol Kelly",
               "profile_path": "/dmK8fQ8FpldezDhtoF1EJHcZo6R.jpg",
               "id": 137204,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Pepe Mirada",
               "gender": 0,
               "credit_id": "52fe4705c3a36847f811f70d",
               "name": "Eugene Mazzola",
               "profile_path": null,
               "id": 137205,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Johnny Crale",
               "gender": 0,
               "credit_id": "52fe4705c3a36847f811f711",
               "name": "Nedrick Young",
               "profile_path": "/bkDHaN61qYmcL49uySvGFDpXtOY.jpg",
               "id": 69319,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Jose Mirada",
               "gender": 0,
               "credit_id": "52fe4705c3a36847f811f715",
               "name": "Victor Millan",
               "profile_path": "/4kumG5B5wKnKX43Otnu8wnRxupJ.jpg",
               "id": 94893,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Deacon Matt Holmes",
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f719",
               "name": "Frank Ferguson",
               "profile_path": "/9CgQ5j8YU3TAux6aUOgXvABLHJB.jpg",
               "id": 30115,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Mona Stacey",
               "gender": 0,
               "credit_id": "52fe4705c3a36847f811f71d",
               "name": "Marilee Earle",
               "profile_path": null,
               "id": 97771,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "The Minister (uncredited)",
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f721",
               "name": "Byron Foulger",
               "profile_path": "/iMr3cELQ3pNBcUfnrcH6FP9SIZO.jpg",
               "id": 96722,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Sven Hansen (uncredited)",
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f725",
               "name": "Ted Stanhope",
               "profile_path": "/w1YfFPc56XQIPYsRtCg9nCUqlPJ.jpg",
               "id": 137203,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4705c3a36847f811f6d9",
               "name": "Joseph H. Lewis",
               "profile_path": "/lMwmKsspovp268RzuoWXmhuQRI9.jpg",
               "id": 86004,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f6e5",
               "name": "Frank N. Seltzer",
               "profile_path": null,
               "id": 135416,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f6eb",
               "name": "Gerald Fried",
               "profile_path": null,
               "id": 3350,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4705c3a36847f811f6f1",
               "name": "Ray Rennahan",
               "profile_path": null,
               "id": 32996,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4705c3a36847f811f6f7",
               "name": "Stefan Arnsten",
               "profile_path": null,
               "id": 36968,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f6fd",
               "name": "Frank Sullivan",
               "profile_path": null,
               "id": 14679,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4705c3a36847f811f731",
               "name": "William Ferrari",
               "profile_path": null,
               "id": 21872,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a088890c3a368621a00011a",
               "name": "George Brand",
               "profile_path": null,
               "id": 3179,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a0889fc925141785d00016b",
               "name": "Carl Brandon",
               "profile_path": null,
               "id": 1922578,
               "department": "Sound",
               "job": "Other"
            },
            {
               "gender": 0,
               "credit_id": "5a088a12c3a368672a00019b",
               "name": "James T. Heckert",
               "profile_path": null,
               "id": 1497383,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a088a37c3a368674f0001d0",
               "name": "Rudy Butler",
               "profile_path": null,
               "id": 1325120,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5a088a70c3a368680a000220",
               "name": "Charles Althouse",
               "profile_path": null,
               "id": 1539033,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "5a088aa0925141784f0002b3",
               "name": "Tom Rennings",
               "profile_path": null,
               "id": 1922580,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "5a088ab2925141784500028c",
               "name": "Sidney Perell",
               "profile_path": null,
               "id": 939486,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a088b2292514178450003c6",
               "name": "Shirley Madden",
               "profile_path": null,
               "id": 1922581,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5a088b45c3a368680a0003cd",
               "name": "Arnold Goode",
               "profile_path": null,
               "id": 1922582,
               "department": "Art",
               "job": "Property Master"
            },
            {
               "gender": 2,
               "credit_id": "5a088b80c3a36867ac000422",
               "name": "Dalton Trumbo",
               "profile_path": "/2Ii27zuIjlzkqgs6dFS4SgsuNKH.jpg",
               "id": 11993,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a088baec3a36867ac000470",
               "name": "Carroll Sax",
               "profile_path": null,
               "id": 46332,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a088c20c3a36867ac00053d",
               "name": "Richard Dixon",
               "profile_path": null,
               "id": 120163,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 1.083059,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46681,
      "vote_count": 15,
      "budget": 0,
      "overview": "Armed with a harpoon, a Swedish whaler is out for revenge after the death of his father. A greedy oil man trying to buy up the Swede's land might be the guilty party.",
      "similar": [
         2182,
         43461,
         20367,
         54392,
         22572,
         26373,
         28668,
         25551,
         32857,
         28663,
         30784,
         207641,
         26946,
         13385,
         29487,
         50153,
         28115,
         232687,
         29488,
         29829
      ],
      "original_title": "Terror in a Texas Town",
      "runtime": 80,
      "poster_path": "/vMdO2xG0DtJNxa3gnUAwFopeJ4G.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Seltzer Films",
         "id": 12186,
         "origin_country": ""
      }],
      "release_date": "1958-09-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "When the Texas Plains Ran With Blood and Black Gold!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Joseph H. Lewis"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Dalton Trumbo",
         "Ben Perry"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052287/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0MDY1MDk2NV5BMl5BanBnXkFtZTcwMzE2MjYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sterling Hayden, Sebastian Cabot, Carol Kelly | See full cast and crew »"],
      "reviews": [
         "There's a lot more to this little Western than the cheap thrills the title might suggest. The film itself may have been made in black and white, but the off-beat story is shot through with shades of moral grey. Indeed, I'm not sure that it would be entirely baseless to describe it as an implicit indictment of US society. This picture uses familiar Western stereotypes - the corrupt sheriff, the land-greedy tycoon, the sinister hired gun - in a depiction that subtly undercuts much of the entire genre. I don't think it's too far-fetched to see the long shadow of McCarthy over the townspeople who allow themselves to be cowed and driven off one at a time, only to turn at last as a mob not on the man who bribed their silence, but on the outsider employed as a tool to do his dirty work. (Having just read the IMDB entry for this film and discovered that the scriptwriter was himself blacklisted by the McCarthy regime, I'm now almost certain I was not imagining this!) The whole story is framed by that final confrontation and the flashbacks (?flash-forwards?) that follow under the opening titles. After all, it's not every Western that features a man walking the length of Main Street to face down his father's killer... with a harpoon. This one *opens* with that image! But as we catch up with the flash-back scenes in real-time we soon realise that things are not as they seem. This is no standard Western, there are no stand-up gunfights and no galloping horses; the only quick-draw we see is performed under duress as a humiliating party-trick. Virtue is not rewarded and those who make a stand on principle only suffer thereby. The hired killer is an aging gunman whose trade has lost him the use of his good right hand; the dogged hero is no cowboy or plains drifter but a seaman from a Swedish whaler, and the script makes it very clear just what value he can place on American justice. Inexorably, driven by the sinister jaunty little tune of the theme music, the story winds on until we reach again that final face-down - and now the close-ups make sense, and they are not what we thought they were. That man with the moustache is not the sheriff; that blonde is not the hero's girl; the crowd is not spilling out of a saloon. And it is not any longer, for me at least, the clear-cut question of good and evil the genre has led us to expect. When it is all over - when the shots are called and the dice are down - the crowd pours past the Swede without a backward glance. Society doesn't want to know; doesn't want to face its own complicity. It wants a scapegoat to sacrifice, and for life to go on. Morally, this film is very far from black and white. If it is a B-movie, then it is by far more unsettling than the vast majority of cheap and cheerful productions made in that budget. I cannot imagine what its intended audience must have made of it. Am I the only viewer to find myself drawn as much to the cold-blooded, isolated 'villain' as to the nominal hero?",
         "A bizarre, intense, frightening unsung masterpiece filled with original and compelling characters. It's hard to tell what the main interest is: the Swedish hero; the leather-clad Bogie-inspired villain; the brave young Mexican; the callous, quick-tongued fatcat. The cinematography is stylized yet subtle. The dialogue is trenchant. Then, of course, there is the unnerving harpoon showdown. There is no movie quite like this one, folks. A must-see.",
         "When people discuss the Western in the 50s, the richest decade of the genre, they invariably cite Anthony Mann, Budd Boetticher, THE SEARCHERS or RIO BRAVO . Only the specialised, however, will single out Joseph H. Lewis. A LAWLESS STREET electrifies a banal story with inventive technique. TERROR, though, is something else. I have watched hundreds of Westerns, and I can safely say that this is the most remarkable pre-Peckinpah/Leone effort I've seen. It may not be as rich as the above-mentioned, but its formal daring is unparalleled. Like Mann, Lewis came to the Manichean world of the Western from film noir, a genre defined by its moral ambiguity. The opening sequence is the most astonishing of any Western (except THE WILD BUNCH, of course), and cleverly complicates everything that follows. It starts with the shoot-out, an innovative device, but one of the combatants carries a large pike. His opponent, face unseen, taunts him. The scene is highly charged, even if we don't know why. The result of this sequence is cut, and we get the opening credits, featuring an elliptical series of scenes, some lyrically pastoral, others brutally violent, none making any narrative sense because we don't know the story yet. The film proper hurtles us into a violent arson attack. So in the first five minutes, the viewer is assaulted by sensation and violence. There are none of the reassuring signifiers of the traditional Western - noble music (the score here is as bizarre, inventive and parodic as any Morricone spaghetti); John Wayne or Henry Fonda above the title; contextually explanatory intertitles. We have no idea what is going on, we are left staggered, breathless, excited, reeling. What follows is an explanation of these events. But the unforgettable effect lingers, and colours what seems to be a traditional Western story - big business trying to muscle in on small farmers. The most interesting figure is not the hero, Sterling Hayden, a gentle man forced by circumstance to find savage violence in himself (and saddled with a ridiculous, faltering Swedish accent, but little character), but the villain. In many ways he is the archetypal baddie - dressed in black, a gun for hire, snarling, brutal with women. But he is also a complex psychological portrait - a once great shot, now a cripple, lush and impotent. The familiar story is subverted to become the tragedy of an evil man. The film's surface detective element - who killed Hayden's father - is subsumed thematically by the investigation into this fascinating character (we know early on who killed him anyway). Stylistically, Lewis turns the Western, traditionally about open spaces, new frontiers, hope, escape, into a bitter male melodrama about entrapment, failure and death. The stark, clear visuals are as beautiful and aesthetically exciting as THE OX-BOW INCIDENT, another morbid masterpiece. The disturbing editing, and exagerrated compositions seem to belong more to Nouvelle Vague deconstructions than a Hollywood Western. Almost as awesome as GUN CRAZY, this is provocative proof that Lewis was a great director.",
         "In El Dorado John Wayne has occasion to remark to Ed Asner that since he doesn't carry a gun himself he hires it done. And then the Duke went on to make some remarks about the quality of his help. But the reverse of the coin is when who you hire is too good for you to argue with. That was the problem that Sebastian Cabot has with Ned Young, a brooding killer who he hires to intimidate some farmers to get off land that unbeknownst to them has oil. It was at the end of the frontier days and the great oil discoveries that were to make Texas and oil synonymous were just being discovered. One guy who won't be pushed is a Swedish farmer who Young kills. His son played by Sterling Hayden comes to town asking questions. Like Hayden in real life, the son is a seaman who's strange in that western environment. He carries no gun, but only a harpoon from his seafaring days. By this time Hayden was ready to leave Hollywood for Tahiti and was just trying to earn enough money to sail there with his kids. He'd been a friendly witness at the House Un American Activities Committee It must have been a bit strained on the set because the screenplay was by Dalton Trumbo, one of the Hollywood Ten. Trumbo was still writing under pseudonyms though. Hayden walks through his role, the real acting here is done by Ned Young and Sebastian Cabot. Both of them are a pair of hateful people, Cabot the greedy capitalist and Young the stone killer. Western fans won't be disappointed however, especially at the final confrontation at the end.",
         "The success of High Noon caused many westerns to be made which had a lot in common.Actually it created a new genre, the \"High Noon \"style western. This is certainly one of them, and one that came out very good. It has many assets, like the script by Dalton Trumbo and the direction of Joseph H Lewis. It has also a great performance by Sterling Hayden. He gives us the best moments of the film as the Swede who does not yet understand what is going on the town. Ned Young and Carol Kelly as the mean gunfighter and his suffering girlfriend also stand out. Another very meaningful character is Eugene Martin as Pepe Mirada a man who lives in fear. The duel of Hayden against Young, where Hayden is using an harpoon is extremely well filmed. Considering its low ambitions \"Terror in a Texas Town\" is quite an accomplishment.",
         "This is the last film from western and crime movie specialist, Lewis. It`s the complete opposite of what you would expect from the title, a slow and character-driven film, beautifully shot in high contrast black and white. Cabot is especially good as a complex and troubled baddie. The final shootout comes as a complete surprise (I won`t tell you.) Recommended to Western fans.",
         "When oil is discovered on the properties of peaceful homesteaders, fat-cat Sebastian Cabot sends his one-handed gunman to terrorize them into leaving. When stubborn Swedish whaler Sterling Hayden's father is killed by them, he takes on the bad guys with only a harpoon and the truth! The premise is a bit familiar but the story is artfully told with great acting by all involved. Hayden plays an offbeat, interesting, and unconventional western hero and Cabot is a wonderfully sleazy villain. However, Academy Award winning screenwriter Nedrick Young gives the film's best performance as Cabot's vile hired killer. Entertaining from start to finish, this is a really compelling low-budget movie that really knows what buttons to push, especially as Hayden tries to get his neighbors to break their fearful code of silence. The final showdown, glimpsed in the opening scene, is both memorable and exciting",
         "This strange, surreal film is unique among westerns of the era. While it contains most of the standard western clichés, every cliché has a twist. The music is bizarre and often doesn't seem to fit, but that just adds to the offbeat feel. The acting is odd but perfectly suited to the film. Hayden's take on a Swedish accent and speech patterns bounces from realistic to annoying to non-existent, but his performance is excellent, as is Cabot's. The story is riddled with moral dilemmas that give it surprising depth. Don't be fooled into thinking this is just another B western. This movie has a quality that is difficult to describe. Strangely great.",
         "In most respects, this is a completely unremarkable low-budget western. Greedy rich guy hires evil gunfighter to terrorize local farmers. Upstanding good guy arrives and it's just a matter of time before the final showdown. It's competently executed most of the time. Some of it is imaginative and some of it is predictably cliché. Contrary to what some other reviewers have written, the final showdown did not surprise me in the least. Die-hard western fans and followers of Sterling Hayden will want to view this, but I don't know about anyone else. Except that it is successfully filmed in an interesting and unique style, as if it were a 1950's comic book or pulp-fiction novel brought to the screen. This is immediately apparent in the opening credits, with its teaser glimpse of the final scene and including the alliterative hyperbole of the title, and continues consistently throughout the film. Perhaps many little known low budget 1950s film accomplished this feat, but this is the only one I'm aware of that does it so well.",
         "Terror in a Texas Town (1958) The first five minutes of this movie is fabulous a play of archetypes, with a showdown, some cattle breaking free and stampeding, a raging fire, and some close ups of sad faces lit by the flames. In fact, in the wide screen black and white, it seems most of all like a precursor to the spaghetti Westerns, dramatic and just a hair \"arch\" in its excess, music, photography, acting and all. It all takes place in a little Texan town called Prairie City. This is a great movie right off the bat, but it isn't sustained. It tries too hard sometimes, and unlike \"The Good, The Bad, and the Ugly\" it talks too much for its own good. There is an overweight bad man (Sebastian Cabot of all people) who has a maniacal laugh, a tough guy gunslinger (Ned Young) with a fast draw and a metal arm, and there is a stoic good guy (Sterling Hayden) who depends on his stoicism and morality to stand up against them. Men are strong, women are to be kept in bed (or so the gunslinger tells his dame), and life is hard. In addition to the wood frame one street town and the hardworking farmers there is the discovery of oil, and lots of it, an appropriate twist in this final chapter of the Wild West. The director is a favorite of mine, Joseph H. Lewis (\"Gun Crazy\" and \"The Big Combo\" both precede this one), and it has some of the same crudely cut archetypes and stiff dialog. But this is part of the style (he surely knew what he was doing), and adds to the blunt force of the story. There are moments of raw and brutal violence and sections of peaceful bucolic life. People are oddly realistic even if the movie isn't. This is a kind of warm up to about fifty episodes of a classic television show called \"The Rifleman\" that Lewis directed, playing with simple stories well told but quickly arranged. Sam Peckinpah initiated that show, and we can see some back and forth influence between the two directors. It is a bit odd to hear Sterling Hayden with a Swedish accent. He plays a kind of simple fellow, but good hearted, and neither quality is exactly useful in this rough town. Hayden ends up a caricature, and not a good one. He is filled with such strained affectations, and he plays a \"good\" person, but he doesn't sweep you into his cause because he's just plain weird. But of course he prevails, and the last five minutes is much like the first, and you see that justice is sometimes the hardest thing to achieve but you have to keep trying anyway. It's a strain, but an archetypal one."
      ],
      "genres": ["Western"],
      "productionCompanies": ["Seltzer Films"],
      "summaries": [
         "Sven Hanson is one of a number of farmers whom Ed McNeil wants to run off their land (because he knows there's oil on it). When Hanson is murdered by McNeil's gunman, Johnny Crale, Hanson's friend Pepe Mirada hides his knowledge of the murderer's identity in order to protect his family. When Hanson's son George arrives and takes up his father's cause, not only Mirada but also Johnny Crale begin to reevaluate their attitudes.",
         "A Swedish whaler is out for revenge when he finds out that a greedy oil man murdered his father for their land."
      ],
      "budget": 80000
   },
   "movielensId": 1386,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1958-09-01",
      "dvdReleaseDate": "2003-05-20",
      "directors": ["Joseph H. Lewis"],
      "runtime": 80,
      "movieId": 1386,
      "title": "Terror in a Texas Town",
      "mpaa": "",
      "actors": [
         "Sterling Hayden",
         "Sebastian Cabot",
         "Carol Kelly",
         "Eugene Mazzola",
         "Nedrick Young",
         "Victor Millan",
         "Frank Ferguson",
         "Marilee Earle",
         "Byron Foulger",
         "Ted Stanhope"
      ],
      "imdbMovieId": "0052287",
      "originalTitle": "Terror in a Texas Town",
      "genres": [
         "Action",
         "Western"
      ],
      "youtubeTrailerIds": ["05kifZuqvZs"],
      "plotSummary": "Armed with a harpoon, a Swedish whaler is out for revenge after the death of his father. A greedy oil man trying to buy up the Swede's land might be the guilty party.",
      "tmdbMovieId": 46681,
      "avgRating": 2.65152,
      "releaseYear": "1958",
      "numRatings": 33,
      "posterPath": "/vMdO2xG0DtJNxa3gnUAwFopeJ4G.jpg"
   }
}