{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "fishing",
            "id": 1495
         },
         {
            "name": "atlantic ocean",
            "id": 1913
         },
         {
            "name": "bathing",
            "id": 2069
         },
         {
            "name": "shipwreck",
            "id": 2580
         },
         {
            "name": "police chief",
            "id": 2993
         },
         {
            "name": "ferry boat",
            "id": 2996
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "dead child",
            "id": 10852
         },
         {
            "name": "skinny dipping",
            "id": 13078
         },
         {
            "name": "shark",
            "id": 15097
         },
         {
            "name": "great white shark",
            "id": 15098
         },
         {
            "name": "dead dog",
            "id": 156175
         },
         {
            "name": "severed leg",
            "id": 163300
         },
         {
            "name": "fishing boat",
            "id": 174617
         },
         {
            "name": "animal horror",
            "id": 223059
         }
      ],
      "imdb_id": "tt0073195",
      "video": false,
      "title": "Jaws",
      "recommendations": [
         9552,
         1366,
         106,
         840,
         5548,
         579,
         620,
         927,
         87,
         89,
         1091,
         601,
         609,
         377,
         1368,
         5503,
         7340,
         1637,
         861,
         85
      ],
      "backdrop_path": "/slkPgAt1IQgxZXNrazEcOzhAK8f.jpg",
      "revenue": 470700000,
      "reviews": [
         {
            "author": "John Chard",
            "id": "53fea0360e0a262deb0032a0",
            "content": "Jaws.\r\n\r\nA man eating shark is terrorising the holiday island of Amity. Police chief Martin Brody, shark hunter Quint and marine biologist Matt Hooper set sail in the hope of killing the great white monster.\r\n\r\nJaws is responsible for many things, it's responsible for propelling director Steven Spielberg's career into the stratosphere, it was responsible for a downturn in the package holiday trade, and it was responsible for shaping the summer blockbuster release practice's. There are many other things which one doesn't need to bore you with, it's just true to say that Jaws is firmly ensconced in movie history, if one hasn't seen it then one surely knows about it, it is, even today, part of popular culture.\r\n\r\nBut is it any good? Is it worthy of a long standing reputation as one of the greatest monster movies of all time? Hell yes it is, one or two easily overlooked flaws aside, it busted the box office (world wide) and tapped into a primal fear that resides in the majority of mankind, the unseen that resides in the sea.\r\n\r\nJaws sets out its marker right from the start with a truly shocking and attention grabbing opening sequence, from then on in Spielberg (learning from Hitchcock for sure) tweaks the tension to have the audience living on their nerves, even as character building (by way of Brody's family arc) sedates the pace, we just know that it's all relative to an extension of fear and terror that is around the next corner. After the first victims' remains are found, Brody glances out at the ocean, Spielberg perfectly framing the shot to say so much about what we are about to be witness' to. Jolts and shocks pop up from time to time to help build the unease, whilst Spielberg makes the audience wait before we even see what it is that so coldly and efficiently destroys man. Then it's the claustrophobic switch as our brave protagonists are out at sea on Quint's boat, unaware that the giant menace is now hunting them, eyes as black as death itself.\r\n\r\nSo many great scenes linger for all time in the memory, the entrance of Quint is a hum dinger, a mournful widow reducing Brody to a stunned realism, the Indianappolis monologue, the bigger boat! Just some of the reasons why I personally love cinema so much. The score from John Williams is as effective as any for the genre and Robert Hoyt's sound team's work furthers the unfolding dread. The cast are superb and uniformly excellent, managing to cast aside technical problems (and genuine resentments at times) to portray this story with verve and a genuine depth of feeling. Yet Roy Scheider (Brody), Robert Shaw (Quint) and Richard Dreyfuss (Hooper) were far from from original choices, Charlton Heston was wanted for the role of Brody, Sterling Hayden and Lee Marvin were both mooted for Quint, and John Voight was Spielberg's preferred choice for Hooper. Whilst Jaws author (and co screen writer here) Peter Benchley was heading for the top by asking for Newman, Redford and McQueen!! Imagine that!\r\n\r\nStill it all turned out well in the end because Jaws stands the test of time as one of the best films of its type. No amount of complaining about continuity and a rough looking mechanical shark will ever dim its appeal, even as I revisited it recently for the hundredth time I still got tingles all over my body. So file it alongside King Kong in the pantheon of Monster Movie Masterpieces. 10/10 always, now go enjoy your dip in the ocean.",
            "url": "https://www.themoviedb.org/review/53fea0360e0a262deb0032a0"
         },
         {
            "author": "Cat Ellington",
            "id": "589e01989251412cd000b40a",
            "content": "Is it safe to go back in the water? ...\r\n\r\nSteven Spielberg got ahold of the incredible Peter Benchley-penned novel about a giant, carnivorous Great White (dubbed \"Jaws\") who swims the ocean waters off a fictional resort town, preying on both the Island's locals and its visitors alike, and adaptated, for the silver screen, what would become one of the most terrifying American made thrillers to ever be released in the worldwide cinema. Exceptional filmmaking! And members of Spielberg's crew had the nerve to maliciously \"mock\" Jaws, by referring to it as \"Flaws\", during the filming process? All because of a few \"glitches\" in the mechanical shark? Ha! Who's laughing now?\r\n\r\nGreat screenwriting by Benchley and Gottlieb. Great composition by the legendary John Williams. Great direction by Spielberg. Phenomenal performances by Scheider, Shaw, and Dreyfuss. Great supporting cast. Just...magnificent. Jaws is a magnificent film. A true classic.",
            "url": "https://www.themoviedb.org/review/589e01989251412cd000b40a"
         },
         {
            "author": "in_the_crease",
            "id": "58d2ada5c3a368127c000de2",
            "content": "Much like the shark itself, the movie starts slowly, deep down in the depths before coming to the surface to explode in pure sensationalism.\r\n\r\nJaws is one of those rare exceptions where high-brow art meets fun entertainment. At the time of its making, however, simply keeping its head above water was the most the cast and crew were hoping for.\r\n\r\nBut Spielberg had created something special. During production, no one saw it--I'm not sure Spielberg himself saw it, but it was there. I think it was really editor Verna Fields who saw it and put it together.\r\n\r\nJaws begins the way most primal fears begin: someone is alone, in the dark, in an alien environment, and is being attacked from some unknown entity. People remark today how Jaws worked so well, that it's kept them afraid of the ocean for years. I disagree. I think it's because we are scared of the ocean is why Jaws works so well. The opening scene of the young girl being savaged in the black nothingness that is the night ocean is terrifying because it preys on primal fears; it doesn't create them.\r\n\r\nNext we're introduced to our cast of characters: There's Police Chief Martin Brody--an everyman with a fear of the water--and his wife, Ellen. There's Brody's loyal deputy Len Hendricks (mysteriously named \"Jeff\" in the sequel). Then, of course, there's the other side. There is the crooked mayor Larry Vaughan, and his two toadies newspaper editor Harry Meadows and coroner Carl Santos. After Brody and Hendricks find evidence of a hungry shark off the coast of the resort town of Amity, they do the sensible thing and start closing up the beaches. The mayor, seeing dwindling dollar signs, convinces Meadows and Santos to back him, and together they confront Brody and put the kibosh on his beach closing plan.\r\n\r\nIn an era where the primitive special effects technology gave us a shark that looked like a pool toy, it became essential that the shark not be the focal point of the film. And while a fin here and a barrel there do work wonders, it's only because the shark is far from the only villain in the movie. To have credibility, we have to have a human villain. And that is where Vaughan comes in.\r\n\r\nAfter Vaughan's cavalier \"it-can't-happen-again\" attitude blows up in his face, Brody brings in the book smart, but decidedly out-of-his-element marine biologist Matt Hooper. Hooper tells Brody everything he and we, the audience, already know: The shark is out there; it's hungry; it's eating people; and it will continue to do so unless it is killed.\r\n\r\nAfter a disastrous Fourth of July celebration that should have gotten Vaughan impeached, Brody and Hooper join forces with Quint, a grizzled fisherman with a personal vendetta against sharks. The movie then switches from its horror and drama elements and becomes something of an adventure, foreshadowing Spielberg's work on films like Raiders of the Lost Ark. Even John Williams' score begins to conjure up images of Errol Flynn-style swashbuckling. The adventure almost seems fun.\r\n\r\nAnd that is when the shark, previously only a shadow, fin, or plot point referenced by dialogue, takes center stage. The movie shifts gears further near the end, going from adventure to a full on monster movie.\r\n\r\nThe build up is slow, relying on showing us the results of the shark's presence rather than the shark itself. This creates enough fear and credibility so that by the time the big, rubbery toy shark is commanding the screen, we're afraid of it. It's already been established as a monster.\r\n\r\nThe movie's pacing, dialogue and acting are all perfect, creating a strong enough foundation on which a silly, albeit terrifying, plot rests. By the time the shark is sinking boats and eating shark cages, Spielberg has made us by into it that he could have had the shark blasting off for the moon and we would have accepted it. And that is how and why Jaws works.",
            "url": "https://www.themoviedb.org/review/58d2ada5c3a368127c000de2"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Police Chief Martin Brody",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016071",
               "name": "Roy Scheider",
               "profile_path": "/gx1jsvIL2OCzG6TOnl7ErgD28ZU.jpg",
               "id": 6355,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Quint",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016075",
               "name": "Robert Shaw",
               "profile_path": "/jJpquJQB2XGqZ1Mrc35VmgT2UcR.jpg",
               "id": 8606,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Matt Hooper",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016079",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Ellen Brody",
               "gender": 1,
               "credit_id": "52fe4255c3a36847f801607d",
               "name": "Lorraine Gary",
               "profile_path": "/nzyCjOtiKd02AJ4zRqCmW2jb5I7.jpg",
               "id": 8607,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Mayor Larry Vaughn",
               "gender": 0,
               "credit_id": "52fe4255c3a36847f8016081",
               "name": "Murray Hamilton",
               "profile_path": "/zSkAeg5lGbyZWwYZYunl3HR8jHb.jpg",
               "id": 8608,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Ben Meadows",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016085",
               "name": "Carl Gottlieb",
               "profile_path": "/55NXqy86bxZ64QnwsLbYNOgsS7d.jpg",
               "id": 8555,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Deputy Leonard 'Lenny' Hendricks",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016089",
               "name": "Jeffrey Kramer",
               "profile_path": "/ydU2f5IYjBQx1VVjRYbVGpPvL3n.jpg",
               "id": 8609,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Christine 'Chrissie' Watkins",
               "gender": 1,
               "credit_id": "52fe4255c3a36847f801608d",
               "name": "Susan Backlinie",
               "profile_path": "/vUOufZY0zuXHGXSu9IVSzPRMERV.jpg",
               "id": 8610,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Tom Cassidy",
               "gender": 0,
               "credit_id": "52fe4255c3a36847f8016091",
               "name": "Jonathan Filley",
               "profile_path": "/1XMriHxPQ73Mzkct0dpu7jPO9FV.jpg",
               "id": 5286,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Michael 'Mike' Brody",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016095",
               "name": "Chris Rebello",
               "profile_path": "/rKX6WkqhICynkGid8spvyBxCGPw.jpg",
               "id": 8611,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Sean Brody",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016099",
               "name": "Jay Mello",
               "profile_path": "/crjgSn6d3MR5ibkzyxDf6YEf0x0.jpg",
               "id": 8612,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Mrs. Kintner",
               "gender": 0,
               "credit_id": "52fe4255c3a36847f801609d",
               "name": "Lee Fierro",
               "profile_path": "/6tmABP79zuDfm9Sxiyuwq4cL47H.jpg",
               "id": 8613,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Alex M. Kintner",
               "gender": 0,
               "credit_id": "52fe4255c3a36847f80160a1",
               "name": "Jeffrey Voorhees",
               "profile_path": "/x3ShYXoC6ET65JFAcZXBwKdvN7s.jpg",
               "id": 8614,
               "order": 12
            },
            {
               "cast_id": 28,
               "character": "Ben Gardner",
               "gender": 0,
               "credit_id": "52fe4255c3a36847f80160a5",
               "name": "Craig Kingsbury",
               "profile_path": "/qHWGWvGg7sTtvcKpmYKatmMBtNj.jpg",
               "id": 8615,
               "order": 13
            },
            {
               "cast_id": 29,
               "character": "Medical Examiner",
               "gender": 2,
               "credit_id": "52fe4255c3a36847f80160a9",
               "name": "Robert Nevin",
               "profile_path": "/dlGP4diqSoit0i2innQTfZGiNcm.jpg",
               "id": 8616,
               "order": 14
            },
            {
               "cast_id": 32,
               "character": "Estuary Victim",
               "gender": 0,
               "credit_id": "55de5a40925141472d00038c",
               "name": "Ted Grossman",
               "profile_path": null,
               "id": 8591,
               "order": 15
            },
            {
               "cast_id": 33,
               "character": "Interviewer",
               "gender": 2,
               "credit_id": "55de5af4c3a3686e82000411",
               "name": "Peter Benchley",
               "profile_path": "/AgPS8DEEI3epXydkrbJSvJ5Wgb4.jpg",
               "id": 8554,
               "order": 16
            },
            {
               "cast_id": 34,
               "character": "Girl in Music Store (uncredited)",
               "gender": 1,
               "credit_id": "55de5b6fc3a3686e7d00039b",
               "name": "Dorothy Fielding",
               "profile_path": null,
               "id": 51550,
               "order": 17
            },
            {
               "cast_id": 35,
               "character": "Amity Point Lifestation Worker (voice) (uncredited)",
               "gender": 2,
               "credit_id": "55de5b88925141472000041e",
               "name": "Steven Spielberg",
               "profile_path": "/pOK15UNaw75Bzj7BQO1ulehbPPm.jpg",
               "id": 488,
               "order": 18
            },
            {
               "cast_id": 36,
               "character": "Swimming Chrissie - First Victim (uncredited)",
               "gender": 0,
               "credit_id": "56b9559f92514106a4000f03",
               "name": "Denise Cheshire",
               "profile_path": null,
               "id": 97751,
               "order": 19
            },
            {
               "cast_id": 37,
               "character": "Mrs. Taft (uncredited)",
               "gender": 0,
               "credit_id": "56ba1a9cc3a3681e5900314b",
               "name": "Fritzi Jane Courtney",
               "profile_path": null,
               "id": 16224,
               "order": 20
            },
            {
               "cast_id": 38,
               "character": "Research Assistant (uncredited)",
               "gender": 2,
               "credit_id": "56ba1af8c3a3681e6800391a",
               "name": "David Engelbach",
               "profile_path": null,
               "id": 197925,
               "order": 21
            },
            {
               "cast_id": 39,
               "character": "Mrs. Posner (uncredited)",
               "gender": 0,
               "credit_id": "56ba1c00c3a3681e7d002c03",
               "name": "Belle McDonald",
               "profile_path": null,
               "id": 592894,
               "order": 22
            },
            {
               "cast_id": 40,
               "character": "Swimmer (uncredited)",
               "gender": 2,
               "credit_id": "56ba1c6192514106ac002c23",
               "name": "Joseph Oliveira",
               "profile_path": "/nFJX5qWKlHyew7AHKUFE3EQnMO5.jpg",
               "id": 1360008,
               "order": 23
            },
            {
               "cast_id": 41,
               "character": "Topless Swimmer (uncredited)",
               "gender": 1,
               "credit_id": "56ba1cbc92514106a4002ac7",
               "name": "Beverly Powers",
               "profile_path": "/zh6uex4M396BU5ARZWwK22u9yS1.jpg",
               "id": 1946,
               "order": 24
            },
            {
               "cast_id": 42,
               "character": "Nurse (uncredited)",
               "gender": 1,
               "credit_id": "56ba1cf192514106ac002c3c",
               "name": "Ayn Ruymen",
               "profile_path": null,
               "id": 124243,
               "order": 25
            },
            {
               "cast_id": 43,
               "character": "Lifeguard (uncredited)",
               "gender": 0,
               "credit_id": "56ba1d3ec3a3681e5d002d78",
               "name": "Christopher Sands",
               "profile_path": null,
               "id": 1081816,
               "order": 26
            },
            {
               "cast_id": 44,
               "character": "Scout Master (uncredited)",
               "gender": 0,
               "credit_id": "56ba1debc3a3681e6d002c28",
               "name": "Rex Trailer",
               "profile_path": null,
               "id": 39039,
               "order": 27
            },
            {
               "cast_id": 58,
               "character": "Scott (uncredited)",
               "gender": 2,
               "credit_id": "5a135f8a92514138f907956b",
               "name": "Philip Ettington",
               "profile_path": null,
               "id": 1926100,
               "order": 28
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f801601f",
               "name": "Steven Spielberg",
               "profile_path": "/pOK15UNaw75Bzj7BQO1ulehbPPm.jpg",
               "id": 488,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016025",
               "name": "Peter Benchley",
               "profile_path": "/AgPS8DEEI3epXydkrbJSvJ5Wgb4.jpg",
               "id": 8554,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f801602b",
               "name": "Carl Gottlieb",
               "profile_path": "/55NXqy86bxZ64QnwsLbYNOgsS7d.jpg",
               "id": 8555,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016031",
               "name": "David Brown",
               "profile_path": "/fUWueOqqSkc9yc6svhOKlQr656F.jpg",
               "id": 5322,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016037",
               "name": "Richard D. Zanuck",
               "profile_path": "/uoPXQ29L8vlphMuojaBlmuwi1Mu.jpg",
               "id": 1297,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f801603d",
               "name": "John Williams",
               "profile_path": "/2Ats98PB1SH2yfEPikiLdhRuXZm.jpg",
               "id": 491,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016049",
               "name": "Verna Fields",
               "profile_path": null,
               "id": 8556,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f801604f",
               "name": "Joe Alves",
               "profile_path": "/tVMkWdOrrzZkLyNNbluYflpdxyq.jpg",
               "id": 8558,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f8016055",
               "name": "John M. Dwyer",
               "profile_path": null,
               "id": 796,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe4255c3a36847f801605b",
               "name": "Thomas J. Wright",
               "profile_path": "/9mAgimzp4CbzPRGPBfPirM87seb.jpg",
               "id": 8573,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "52fe4255c3a36847f8016061",
               "name": "John R. Carter",
               "profile_path": null,
               "id": 8582,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4255c3a36847f8016067",
               "name": "Robert A. Mattey",
               "profile_path": null,
               "id": 8586,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe4255c3a36847f801606d",
               "name": "Ted Grossman",
               "profile_path": null,
               "id": 8591,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "52fe4255c3a36847f80160af",
               "name": "Peter Benchley",
               "profile_path": "/AgPS8DEEI3epXydkrbJSvJ5Wgb4.jpg",
               "id": 8554,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53807bc5c3a36805a1004d8e",
               "name": "Bill Butler",
               "profile_path": "/BJpWJoyF771fVD0bUPx5WE173y.jpg",
               "id": 2287,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "56ba24f6c3a3687c9b00002a",
               "name": "Shari Rhodes",
               "profile_path": null,
               "id": 12435,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56ba1e9692514106a1002ad2",
               "name": "Del Armstrong",
               "profile_path": null,
               "id": 13942,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56ba1ecdc3a3681e7d002c7d",
               "name": "Verne Caruso",
               "profile_path": null,
               "id": 1430210,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56ba202e92514106b4002c82",
               "name": "Jim Gillespie",
               "profile_path": null,
               "id": 1574927,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "56ba20dac3a3681e7d002cd2",
               "name": "James Fargo",
               "profile_path": "/2dcSiTGfRqVSIvM677q6XZsxK8w.jpg",
               "id": 66222,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56ba210a92514106af002e0f",
               "name": "Barbara Bass",
               "profile_path": null,
               "id": 1416440,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56ba2150c3a3681e6d002cc1",
               "name": "Tom Joyner",
               "profile_path": null,
               "id": 1228010,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56ba21bf925141069f002e0a",
               "name": "L. Andrew Stone",
               "profile_path": null,
               "id": 1511704,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56ba2243c3a3681e77002d57",
               "name": "William A. Petrotta",
               "profile_path": null,
               "id": 1341399,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "56ba2288c3a3681e64002c73",
               "name": "Thomas J. Wright",
               "profile_path": "/9mAgimzp4CbzPRGPBfPirM87seb.jpg",
               "id": 8573,
               "department": "Art",
               "job": "Production Illustrator"
            },
            {
               "gender": 0,
               "credit_id": "56ba22ca9251416872001cf6",
               "name": "William C. Carruth",
               "profile_path": null,
               "id": 66167,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 2,
               "credit_id": "56ba231ac3a3681e60002bb5",
               "name": "Jeff Gourson",
               "profile_path": null,
               "id": 12865,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 1,
               "credit_id": "56ba23d59251417193000012",
               "name": "Charlsie Bryant",
               "profile_path": null,
               "id": 17916,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 42.181667,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 578,
      "vote_count": 3317,
      "budget": 7000000,
      "overview": "An insatiable great white shark terrorizes the townspeople of Amity Island, The police chief, an oceanographer and a grizzled shark hunter seek to destroy the bloodthirsty beast.",
      "similar": [
         1907,
         332567,
         579,
         580,
         403119,
         8914,
         2661,
         814,
         1678,
         205321,
         27902,
         503,
         438970,
         27727,
         65055,
         20416,
         118957,
         46020,
         40383,
         9528
      ],
      "original_title": "Jaws",
      "runtime": 124,
      "poster_path": "/l1yltvzILaZcx2jYvc5sEMkM7Eh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zanuck/Brown Productions",
            "id": 1865,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1975-06-18",
      "vote_average": 7.5,
      "belongs_to_collection": {
         "backdrop_path": "/1e2QvI2u7Q4d2admK6Xw0AjLjVp.jpg",
         "name": "The Jaws Collection",
         "id": 2366,
         "poster_path": "/fgraZdDCvAtBr0MHczmL6raonHd.jpg"
      },
      "tagline": "Don't go in the water.",
      "adult": false,
      "homepage": "http://www.jaws25.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steven Spielberg"],
      "runtime": 124,
      "synopsis": "Late one night, on one of the many beaches of Amity Island off the coast of New England, local teenagers throw a bonfire party, tossing back the booze and playing music. Chrissie Watkins ( Susan Backlinie), a beautiful blonde, catches the eye of Tom Cassidy ( Jonathan Filley) and leads him away from the frivolities towards the water where she begins to strip down. She invites him for some moonlit skinny dipping and dives into the water as Tom struggles to undress on the shore. Inebriated, Tom collapses and passes out on the sand. Chrissie continues to swim out to deeper waters when she feels a sharp tug on her leg. Confused, she gasps in panic as she is tugged again before being pulled under water. She breaks the surface, screaming as something thrashes her around violently. She screams for help again before submerging one last time and then the water is still. Amity Island is a small, beachside community that prides itself in its humble traditions and popular oceanfront. Despite the population of locals on the island, the community depends on tourism as a major source of economic support and waits eagerly for each summer to arrive when herds of mainlanders come to savor Amity's shores. Martin Brody ( Roy Scheider), the new Chief of Police, receives a call at home regarding Watkins' disappearance. Following the report made by Tom Cassidy that she was last seen off the coast, Brody goes to the beach with his deputy Jeff Hendricks ( Jeffrey Kramer) to search for clues. They don't need to look very long; within a few moments Hendricks stumbles upon Chrissie's mangled corpse. At the police station, Brody waits for the coroner's ( Robert Nevin) report at his desk while the secretary relays the crime reports of the day; nothing more serious than a few kids 'karate-chopping' picket fences. The coroner then calls with his report. Brody hangs up and contemplates for a moment before typing the cause of death on Chrissie's report: 'Shark attack'. Unwilling to waste any time, he goes to the local hardware store and gathers supplies for making signs to close the beaches. His intentions are quickly noticed by Mayor Vaughn ( Murray Hamilton) who attempts to sway Brody's notion that a shark was directly involved in Chrissie's death. He explains that she could very well have swam out too far and gotten tired before being mangled by a boat's propellers. During a town meeting, Brody tries to reassert his belief that Chrissie's death was caused by a shark and that he wants to close the beaches for the safety of the public, much to the dismay of the island's business owners. Vaughn, however, garners the coroner's support who admits that Chrissie could have been killed by a boat propeller. Vaughn reiterates to Brody that he doesn't want to act too hastily. Closing the beaches would sentence Amity Island to a dreary summer without tourists and they cannot afford to lose that source of income, especially with the Fourth of July approaching. Over the course of the next couple of days, tourists flock to the island, brought over from the mainland by ferry. One particular day, Brody sits on the beach, scanning the water nervously as people frolic in the surf, splashing and calling to each other. A young man ( nm5026721) plays fetch with his Labrador retriever in the surf. An elderly man wearing a swim cap, Henry Wiseman ( Alfred Wilde), approaches Brody and chides him about his apparent fear of water. \"Thats some bad hat, Harry,\" Brody replies, annoyed. Young Alex Kintner ( Jeffrey Voorhees) takes his inflatable, yellow raft and asks his mother ( Lee Fierro) if he can take it out in the water. With her consent, he rushes into the surf. While Brody continues to keep watch, the beachgoers continue their fun, splashing loudly. The young man who had been playing with his dog calls to the unresponsive pooch, the fetching stick floating in the water. All at once Brody notices a large, grey object emerge out of the water and overturn the young boy on his yellow raft. Alex is tossed into the water and pulled under as his blood turns the sea red. The other swimmers begin screaming and leave the water as Brody ushers them back to shore. Mrs. Kintner approaches the water's edge, calling for her son. The only response is the lap of waves on the shore, pushing Alex's torn and bloody raft onto the beach. Shortly after, Mrs. Kintner issues a $3000 reward for the capture of the shark and a meeting is held between the town's business owners, attended by Mayor Vaughn and Brody. Brody assures the townspeople that they are assigning extra deputies and bringing in an expert from the Oceanographic Institute for advice on the matter but the main concern in town is if the beaches will be closed. Brody's 'yes' is responded with a string of criticism but Mayor Vaughn quickly interjects that the beaches will be closed for only 24 hours. The uproar of the townsfolk is suddenly cut short by the screeching sound of nails on a chalkboard behind them. Local fisherman Quint ( Robert Shaw) remains seated as he calmly explains that a shark like this is not one to be trifled with and he has no interest in such meager compensation. He offers to capture and kill the shark himself for $10,000 which no one stands to offer. Quint quietly leaves, a wry smile on his face. Brody returns home and, the following day, tells his eldest son Michael ( Chris Rebello) that he's not to go anywhere near the water. Ellen thinks him to be acting a bit too harshly, even when Michael tests his new sailboat in the shallow water in front of their home. When she sees a picture in a book that Brody's holding of a shark attacking a small boat and puncturing the hull, however, she shouts for Michael to listen to his father and get out of the water. That very evening, two men decide to take matters into their own hands and fashion a large hook baited with a pork roast. They toss it out from a dock and it attracts the attention of the shark. However, their attempt to be heroes nearly turns fatal when the dock they've secured the line to is detached and pulled out into the water by the beast, taking one man with it. He fortunately manages to swim back to his friend as the dock eerily turns and follows him back to shore, eventually drifting back on its own, harmless. Amateur shark hunters and fisherman from all over descend on Amity Island hoping to get a claim to the $3000 reward that has apparently been advertised expansively by Mrs. Kintner. They crowd the waters surrounding the island, creating some tension to local swimmers. Among the horde of newcomers is Matt Hooper ( Richard Dreyfuss), who has arrived from the Oceanographic Institute. He is escorted by Brody to examine and give his professional opinion on the remains of Chrissie Watkins. After viewing the body and recording his observations, a visibly shaken Hooper angrily informs Brody and the coroner that no boating accident killed Watkins. \"It was a shark,\" he states defiantly. Meanwhile, some of the local fisherman have successfully caught a large shark and haul it back to town where the body is strung up for all to see. The townsfolk are ecstatic to see such a large find and are overjoyed and convinced that the killer has been caught. However, most are ignorant to the species until Hooper and Brody arrive. Hooper takes a look at the shark and informs everyone that it's a tiger shark and that the bite radius does not match up with the marks he found on Chrissie's corpse. Mayor Vaughn objects and claims that the beaches should be reopened but Hooper maintains that he won't be completely satisfied until he can cut open the shark for more conclusive evidence. Vaughn, however, is not eager to do so in public at the risk of seeing the 'little Kintner boy spill out over the dock'. At that moment, Mrs. Kintner arrives on the scene, clad in a black, mourning dress. She addresses Chief Brody and slaps him across the face, informing him that she found out about Chrissie's death and accuses him of keeping the beaches open and letting people swim when he knew there was a shark out there. When she leaves, Vaughn consoles Brody and tells him that Mrs. Kintner is wrong. \"No she's not,\" replies Brody. Unsatisfied with how his findings took to the water, Hooper visits Brody for dinner that night, sharing his theories with Ellen Brody ( Lorraine Gary) who is none too pleased about the presence of a large shark in the area but stands by her husband's intuition. Hooper discusses the possibility of a rogue shark in the area while Brody chugs his wine. Hooper explains that a rogue shark will often claim territory to an area where the feeding is good and will remain there until the food source is gone. Brody agrees to take Hooper down to the docks to cut open the tiger shark and find out, once and for all, if this is indeed the shark that's been terrorizing the island. Hooper cuts out the stomach and, in a mess of bile and seawater, recovers a few fish, a tin can, and a license plate from Louisiana that confirms his suspicions that the shark swam up to Amity from the warmer waters of the Gulf of Mexico. There is, however, no sign of any human remains and Hooper tells Brody that he's 'still got one hell of a fish out there' and measures out a space with his hands to show how big it's mouth might be. That night, Brody and Hooper continue their investigation and Hooper decides that some reconnaissance out on the water is needed, much to Brody's dismay. With sonar equipment installed on his boat, Hooper drives the boat out to deeper waters until the sonar detects a large object just ahead of them. Aiming their lights out, they find a half submerged fishing boat that Brody recognizes as Ben Gardner's ( Craig Kingsbury), a local fisherman. Hooper bravely opts to take a closer look underwater and dons scuba gear despite Brody's protests. Hooper dives under and examines the hull of the ship, soon discovering a gaping hole in the side where a rather large tooth is embedded. As he peers closer into the hole, the ghostly torso of Ben Gardner appears, his one remaining eye gazing out in horror. Terrified, Hooper panics and drops the tooth as he scrambles back onto his own boat. The next morning, he and Brody attempt to reason with Mayor Vaughn, who seems more concerned with an act of vandalism on one of Amity's billboards. The graffiti sprayed on the image of a woman swimming altered her face to one of horror and included a large, black fin following her in the water. Hooper tries to convince Vaughn that, based on his findings, the proportions on the drawing are actually correct and that, with the evidence of Gardner's boat and his remains towed back to the island and the tooth he found, the existence of a large, killer shark, namely a Great White, cannot be ignored any longer. Vaughn is adamant, however, saying that without the evidence of the tooth, there's no proof that the shark is that the beaches will remain open for the Fourth of July and tells Hooper that losing the tooth is very convenient for him and he most likely wants nothing but the publicity to get him in the National Geographic. Hooper can only laugh at the insult as Vaughn walks away. On July 4th, the beaches are flooded with mainlanders and tourists. Brody and Hooper have their hands full keeping order and making sure that enough security is patrolling the beaches, including boats full of patrolmen with rifles and shark spotters. However, the increased precautionary measures create tension among the beachgoers, making them hesitant to enter the water. Vaughn notices this and convinces one of his local friends to take his wife and grandchildren out. They do so nervously but this encourages more people to enter the water and releases the tension. Brody patrols the beach while Ellen takes care of their youngest son, Sean ( Jay Mello). Michael and a friend begin to take his new sailboat out but Brody tells them to take it to the estuary where it's safer. Suddenly, a shark fin appears in the water and everyone begins to scream in panic, stampeding back to the shore and knocking a few hapless swimmers over. Vaughn watches in disbelief as Brody oversees the situation. The patrol boats quickly scramble towards the fin but discover that it is false; a prank pulled by a couple of boys in snorkel gear. As the chaos winds down, a girl painting on the edge of the estuary sees a dark fin with the shadow of its body beneath it. She cries out 'shark' but the general reaction is desensitized by the fin hoax. Brody responds to the call and quickens his pace when Ellen reminds him that Michael is in the estuary. Michael and his friend sit in their sailboat and are approached by a friendly man ( Ted Grossman) in a rowboat before both crafts are suddenly capsized. Michael surfaces and watches in horror as the man attempts to return to his rowboat, only to be eaten alive by the massive shark. His severed leg sinks to the bottom of the estuary and the shark swims back into open water. Michael and his friend are brought safely ashore, though Michael is unconscious from shock. He is later brought to the hospital and Brody confronts Vaughn in the lobby and demands that immediate action be taken now that there's no doubt in anyone's mind that they have a killer shark around the island. Vaughn, shaken and distressed, realizes his mistakes and tells Brody that his family was on the beach too. He allows Brody to do what's necessary. With Vaughn's signature approval, Brody hires Quint to hunt the shark, promising the fee he'd demanded earlier. At Quint's boathouse, Brody and Hooper discuss with him the terms of the voyage. From the start, Quint looks down upon Hooper for his academic prowess and believes that it will not serve him any good out on the raw sea. However, Brody insists that both he and Hooper will accompany Quint despite his belief that they have no nautical experience -- Hooper mentions that he's crewed three TransPac sailboats, justifying his experience at sea. When Hooper ties a 'sheep shank' knot with ease, Quint relents. Come morning, they meet at the docks and prepare Quint's ship, Orca, for the voyage. Hooper brings his own hi-tech equipment including harpoons, tracking devices, scuba gear and tanks, and a shark-proof steel cage, though Quint is less than impressed with the safety guarantee on the cage. Once at sea, they attempt to attract the shark by chumming the water with fish guts and blood. Hours pass and Quint sets up a baited line with piano wire and fashions it to a rod secured against a fishing chair. He waits as Brody practices his knot work and Hooper plays cards. Quint's line begins to pull and he eases into his chair, quietly fastening straps to his shoulders and adjusting the rod. Just when Brody successfully knots his rope, the line jerks forward, taken by something far under. Hooper projects that the taker might be a sports fish, like a marlin, but Quint assures them that it's 'their' fish. The line is pulled under the boat and Quint marvels at the fish's clever move until the line completely snaps. Quint and Hooper argue over what might have taken the line and Quint suggests that Hooper doesn't have the education to admit his error; that no regular fish could have severed piano wire. Hooper makes a series of dirty faces and climbs up to the bridge. Later on, and still with no sign of the shark, Brody is assigned to chum duty, a job that he has come to detest. As he smokes a cigarette, he scoops out the chum and blindly throws it into the water while casting Quint a contemptuous look. Suddenly, the massive shark surfaces, its mouth agape, but only for an instant. Brody quickens to a stand, having seen enough of the shark to be fearful. He backs slowly into the cabin and tells Quint that he's 'going to need a bigger boat'. At that moment, Hooper sees the shark begin to circle the boat and Quint rushes out to see it. He wages a 25 footer, three tons and orders Hooper and Brody to action. Quint grabs his harpoon gun and instructs Hooper to tie the other end of the rope attached to it to one of the large, yellow bins on the boat. Quint shoots a total of three harpoons, each trailing a yellow bin, into the shark but it doesn't show the slightest bit of fatigue and easily disappears below the surface as Hooper manages to attach a tracking device to it. Quint is at first disdainful towards Hooper after the shark escapes but, that night, the men bond after sharing drinks and comparing scars they've received by some of the deep's more dangerous creatures. Hooper and Quint realize they have more in common than they thought and begin to bond. Brody points to one scar on Quint and he reveals that he'd had a tattoo removed, a tattoo that represented the US Navy cruiser 'Indianapolis'. He tells the story of how he was on the ship the day two Japanese torpedoes blasted a hole in the side large enough to sink the ship in minutes. Quint and some 1,100 men went in the water but, by the time rescue arrived, only 300 survived, some dying of thirst or exposure but most getting attacked and eaten by sharks. Quint's hatred for sharks is evident, describing them as lifeless with doll's eyes and how terrible it was to see and hear the men around him picked off. Worse yet for him is the survivor's guilt he feels. When help finally did arrive, Quint vowed never to wear a life jacket again. As Quint finishes his story, the men sing a sea shanty as the three yellow barrels break the surface of the water outside. As they finish their song, the boat is bumped repeatedly and violently by the shark causing minor leaks. Quint runs onto deck and fires shots at the fleeing shark, evident only by the barrels trailed in its wake and they quickly disappear beneath the waves. The next day the hunt for the shark continues. When they spot the three barrels floating in the water, Quint instructs Hooper to collect them with a hook and secure the rope to cleats at the stern of the boat. The shark begins to swim off again and Hooper's legs are nearly crushed when the rope is pulled taught. Quint drives the boat forward at full throttle but, despite the power, the shark manages to drag the boat backwards, threatening to capsize it, until the cleats rip out of the stern. Out of options, and with the barrels no longer attached to the shark, Quint allows Hooper to try a new method. Hooper opts to submerge himself in the shark cage, hoping that the shark will swim close enough that he can inject it with a harpoon filled with strychnine nitrate. Brody protests but Hooper angrily retorts, \"You got any better suggestions?\" as he puts on his scuba gear. In the cage, Hooper is ambushed by the shark which begins to rip the cage apart, making short work of the metal. Hooper loses his harpoon but is able to escape and swim down to the reef while the shark destroys the cage. Brody and Quint bring up the remains but, before they can do anything, the shark leaps out of the water, landing on the stern, crushing the transom. The boat upends and Brody and Quint hang on for dear life as the shark's jaws gnash and water fills the cabin. Quint loses his grip and slides right into the shark's mouth. The jaws come down on Quint's midsection several times and drags his lifeless body into the sea. As the Orca begins to sink, Brody retreats into the cabin and finds one of Hooper's spare scuba tanks just as the shark barrows through the side, breaking the window. Brody beats it on the nose with the tank before throwing the whole thing into its mouth. The shark backs away as Brody climbs out of the cabin and climbs onto the boat's mast with a rifle in his hand. As the shark circles again and charges Brody, now lying angled on the mast, he aims the rifle at the shark and fires off a few shots, missing. Finally, he takes close aim. \"Smile, you son of a bitch,\" he says, and fires, hitting the tank and detonating it in a violent explosion. The force rips the shark apart and its body sinks to the sea floor as Brody laughs happily. Brody grabs hold of a piece of flotsam as Hooper surfaces, unharmed. Together they create a makeshift raft and begin paddling back to shore as seagulls descend on the remains of the shark. \"I used to be afraid of the water,\" Brody admits. \"I can't imagine why,\" Hooper replies.",
      "writers": [
         "Peter Benchley",
         "Carl Gottlieb"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073195/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDcxODkyMjY4MF5BMl5BanBnXkFtZTgwOTk5NTc5MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Roy Scheider, Robert Shaw, Richard Dreyfuss | See full cast and crew "],
      "reviews": [
         "'Jaws' is the original summer blockbuster, setting the standard by which all others are measured. It's the Michael Jordan of cinema: there will never be another 'Jaws,' simply because the film so profoundly changed the way movies are made and marketed. Based on Peter Benchley's bestselling novel, 'Jaws' centers around the fictional North Atlantic resort island of Amity, which finds itself terrorized by an enormous great white shark. Our hero is Martin Brody, a New York cop who took the job as Chief of the Amity PD to get his family out of the city and then finds himself in the midst of an unprecedented crisis none of his prior experience has prepared him for. The remains of young Christine Watkins are found on the beach, the apparent victim of a shark attack(Chrissie Watkins' death scene at the opening of the movie is one of the most legendary in the history of film). Chief Brody wants to close the beaches, but is refused permission by Mayor Larry Vaughn (Murray Hamilton) and the Amity selectmen, all of whom fear that news of a shark attack off of Amity will threaten the summer tourist trade, on which the town depends for its very survival. The Mayor and his lackies persuade Chief Brody that such incidents are always isolated, and, inexperienced in such matters, he grudgingly agrees to keep quiet. Consequently, the shark kills again (and again), and Chief Brody eventually finds himself dealing both with his own moral guilt for agreeing to hush up the first shark attack and with an enormous human and social catastrophe which appears to be his sole responsibility. Help comes first in the form of Matt Hooper (Richard Dreyfuss, in the role that propelled him to stardom), an icthyologist and oceanographer dispatched to Amity to lend his expertise. Together, Hooper and Brody struggle in vain against both the shark and Mayor Vaughan, who is certain that keeping the beaches open for the sake of the town's economy (and his own real-estate business) is worth the gamble. Finally, Brody and Hooper charter an expedition with the enigmatic, vaguely malevolent Quint (Robert Shaw), Amity's most feared and respected shark hunter, to find and kill the shark and save the town from financial disaster. What ensues is an epic, archetypal man vs. beast quest that would make Herman Melville and Joseph Campbell proud. Our shark, it turns out, is way above average size, terrifically swift and powerful, and uncannily smart, to boot. Hooper, the scientist, is awestruck at having encountered the Bigfoot of the sea; Quint, the crafty fisherman with a serious chip on his shoulder against sharks, realizes he has met the ultimate test of his skills; Brody, who swims poorly and is afraid of water, must overcome abject fear and disorientation just to maintain his composure. Robert Shaw's Quint is one of the greatest anti-heroes the movies have ever seen. He is funny and frightening all at once, and the famous soliloquy in which he recalls the tragic sinking of the USS Indianapolis--where, over the course of a week waiting for rescue, at least 90 US Navy personnel died from shark attack wounds--is one of the most chilling and unforgettable performances ever committed to film. 'Jaws' is the movie that made Steven Spielberg's career, and it's among his finest. It's easy to forget because of his enormously successful blockbusters that Spielberg is a phenomenally skillful and artful director. His timing is superb, he mixes horror with comedy to brilliant effect, he gets great performances out of his actors, and his love for special effects has never overwhelmed his understanding of the importance of story and character. That said, the most brilliant aspect of 'Jaws' was a serendipitous accident. The special effects team had yet to fully troubleshoot 'Bruce,' the mechanical shark, by the time filming was to begin. Under tight budget restraints and enormous studio pressure, Spielberg had no choice but to press on while his crew labored vainly to make the shark work in the cold and corrosive north Atlantic seawater. To compensate for the absence of the non-functional fake shark, Spielberg used shots from the shark's point of view and John Williams' famous two-note theme to create the illusion of the shark's presence in the early scenes. Fortunately the crew was ultimately able to get Bruce into operational status in time to film the big showdown, and some of the scenes are filled in with live-shark footage filmed by Australian underwater video pioneers Ron and Valerie Taylor. Consequently, the audience's fear is magnified by the fact that, for the majority of the film, they cannot see the shark, creating suspense towards the climax of the confrontation between man and beast on Quint's fishing boat. 'Jaws' succeeds on almost every level. It is terrifying without being grotesque, and spectacular without being unbelievable (if the shark looks a little fake, remember that, at the time 'Jaws' was released, 'Space Invaders' was on the cutting edge of computer graphics design and there was no such thing as 'Shark Week on the Discovery Channel'). Roy Scheider's Brody is a quintessential everyman, an average guy beset by fear and guilt who finds himself in extraordinary circumstances and rises to the occasion. Dreyfuss' Hooper is brash and brave enough not to come off as nerdy or self-righteous, and his friendship with Brody becomes the backbone of the movie (Spielberg and screenwriter Carl Gottlieb wisely deviated from the novel in regards to the character of Hooper, who was originally Brody's nemesis). Robert Shaw's Quint is a modern-day Captain Ahab, a worthy foe for the malevolent shark. The suspense is potent and the action thrilling, but the humor, emotion, and character development make this movie much more than a summer blockbuster.",
         "Jaws is a movie the I grew up with, it's like the first real horror film I ever watched. What a great one to start with, right? This movie not only scarred me out of the water, I was afraid to go to the bathroom! I thought Jaws was going to pop up out of the toilet and bite my butt! :D I know it was silly, but that was how much Jaws effected me. I know also that it has not lost it's effect to this day. I'm questioning, because it seems like all the terrific horror films came out of the 70's. Jaws is based on the best seller book by Peter Benchley. Steven Spielberg, before he was STEVEN Spielberg turned this horrifying book and made it into a reason to hate sharks. He brilliantly took what could have been a cheesy movie and turned it into a classic that will never be forgotten. To this day, I still need a friend to hold onto, it's that score! Duh na... duh na.... dun dun dun dun.... Oh, my gosh, that music just scares the heck out of me! On such a low budget, Jaws not only turned into one of the greatest horror movies of all time, it turned into one of the greatest movies, period. Jaws starts off with one of the most terrifying scenes in horror movie cinema, a young pretty girl goes into the water and is brutally attacked and killed by an unknown creature in the water. The next day Chief Brody investigates suspecting a shark attack, and urges the mayor, Larry Vaughn, to shut down the beach, but afraid of a panic and less tourists, Larry ignores the chief's suggestions and keeps the beach open leading to another attack on a young boy. Brody calls in Matt Hooper, a marine scientist to see if they can find the shark. But when another attack ensues and almost kills Brody's young son, Michael, he, Matt, and a cocky man, Quint go out to find Jaws themselves. This turns into several of the greatest cinematic scenes of all time, like the \"Indianapolis\" speech brilliantly given by Quint, how he describes seeing his first shark was just so intense and you couldn't turn away from the screen. Then, one thing that is interesting about this movie, you do not see the shark until Brody is just chucking blood to attract the shark over his shoulder and Jaws appears roaring out of the water! \"We're gonna need a bigger boat!\" he replies to Quint. And then the scene where Jaws jumps onto the boat and Quint is trapped sliding into Jaw's, well, jaws! That's the scene that nightmares are made out of! Jaws is one of my favorite films of all time. It's one of those films that should never be missed, because it is so important. To many, including myself, the shark looks fake, but it's your imagination that gets with you. Spielberg embraced that and you could tell there was just something special about him. Jaws will scare you out of the water just like The Exorcist scared you to the church! 10/10",
         "This is the movie that started it all. I'm not talking about the Hollywood blockbuster, or the insane madness that sent thousands of misunderstood Great Whites to their deaths, I'm talking about the beginning of my interest in movies. This is the movie that did it. I couldn't tell you how old I was when I first saw it, but I do remember this is the movie I made my parents rent time and time again when we went to the video store. This is the movie that drove my parents and some of my friends nuts while I watched it day after day after day when my mom gave it to me for Christmas. This is the movie that made me want to turn a real interest in the movies from just a hobby and into a career. For that, I owe Spielberg, Benchley, Scheider, Shaw, Dreyfuss, Williams, Fields and everyone else a sincere and heart-felt thank you. I own this movie on every format in which it is available. I love it that much. I've probably seen it between 200 and 300 times. I guess you can say it is an obsession. A sick obsession. The plot, the pacing, the editing, the score, the acting, and, oh yes, the shark. Who cares that is fake? By the time we finally get to see it, do we care? Truly, a more suspenseful movie was never made. Several come close, but none quite reaches the primal level the JAWS does. No other film so effectively taps into our fear of the unknown, and then gives it a riveting score to boot. No other movie grips us so strongly with heart stopping suspense that we find ourselves nearly falling off our seats. And no other movie leaves us feeling so spent and wasted after a viewing. And the reason for all the fear, suspense and emotional withdrawal is not top-notch special effects. It was the mid-70's. You can barely apply top -notch to anything of that era. The reason the movie does all that to us is that it is a great story. It is filled with real people, who have real jobs, and who have real fears. And who must now confront a real shark. Can you think of anything more terrifying that getting on a rickety, leaky boat to kill a 25-foot shark when you already have a paralyzing fear of the water? I can't. And Martin Brody sure can't. And so, no matter what ranking JAWS may get on AFI's list of the 100 greatest movies, or TV Guides list of the top 50 movies, or any list for that matter, JAWS will always come in number one on mine. Steven, Peter, Roy, Robert, Richard, John, and Verna -- thank you. Not for just giving me a sense of direction in my life, not for just making me want to be a screenwriter, but also for making a movie that still thrills me as much now when I watch it as when it did when I saw it for the very first time.",
         "Widely regarded as the film that began the \"summer movie blockbuster era\", JAWS (1975) was also rightfully one of the year's most critically acclaimed movies. It was also the recipient of an Academy Award Nomination for Best Picture and a winner of Oscars for film editing (Verna Fields) and music score (John Williams). One of the reasons the film received no acting nods is that everyone involved is so good, how could one single out just one or two? (I personally feel Robert Shaw should have gotten a Best Actor nomination, however). Roy Scheider is wonderful as New York cop Martin Brody, who has relocated to a small coastal island town, only to have his bad case of \"aquaphobia\" put to the ultimate test. Richard Dreyfuss is perfectly cast as a shark expert and provides some truly funny comic bits along the way. Lorraine Gary (who director Steven Spielberg says was the first person to be cast for the film) does an excellent job of being the concerned wife and mother. Finally, there's Murray Hamilton, who gives one of the best performances of his career as Mayor Vaughn, who seems to be more concerned about the economy of the town than the safety of the residents. In a way, Vaughn is really the film's villain. Solid cast indeed. The screenplay (by Peter Benchley and Carl Gottlieb) is tight and well-written, as is Spielberg's direction. Whether it was the mechanical shark's failure to operate correctly or Spielberg's decision to simply see less of the shark until the end of the film, the \"less is more\" idea works perfectly, particularly in the opening scene, which is chilling to this day. One thing I do want to add: if you choose to watch this film at home, do yourself a favor and rent or buy the WIDESCREEN version. The full-screen pan and scan version is a travesty that ruins the great camerawork that Spielberg and cameraman Bill Butler made. I always recommend the widescreen version but it is especially important for JAWS. No offense to fans of ONE FLEW OVER THE CUCKOO'S NEST, but this is the film that should have taken home the Oscar gold. Grade: A+",
         "When I first saw the film, \"Jaws\" I was immediately frightened by the unseen terror that pulls the human psychosis to the depths of the ocean...literally! Steven Spielberg had made himself the most successful director of all time when he went all out with this one! Running to the back of the house and turning all the lights on were just a few things I resorted to after watching the opening for the first time!!! I Never watched anymore of it until 1-3 years later. I was highly hesitant because to a young child, a skinny dippers suffering to the wrath of the giant unknown mouth was the most horrifying sequence in film history at the time...and it still is now! Once I finally got the courage to view the film, I was still in for a lot of suprises. The cinematography is superb in its ruthless attempt to bring the audience to the depths of a powerful ocean, and to the eyes of the dark, wretched creature the inhabits it. The story of the killer shark attacking the only unfortunate island in the world is more than scary. It could have been any place in the world, and it had to be Amitty Island. The shark could have easily lost it's way in the swaying currents of the ocean, but as the opposite inhabitants of the beach get angry, this big mother is here to stay! The technique is wild, absolutely wild, and John Williams score earned more than an oscar for it! Creepy piano notes enter this films titles, and the blue depths of the uncharted territory beneath the sea let us all know that no sense, however small, was to be spared. The first victim, alone will haunt those who view it for the rest of their days, and the rest of the story is more like a battle. This strange battle is often more focused on understanding the other side. What Brody, Quint, and Hooper must do is plunge into the depths themselves, and seek out the unruly monster of the sea. The common theme in this terrific classic is survival, and why not? Survival is a natural instinct to all animal alike. The shark must survive, as it makes so clear by snagging unsuspecting swimmers, but also the people, they to have to survive, but the island is not big enough for both man and fish together. Always a joy to experience over and over again, this film is the ultimate scare show to end them all! Sometimes, a lot of us fans can not seem to get enough of this instant classic!",
         "I will never forget the first time I saw Jaws. I was glued to the seat from start to finish. I jumped, I held my breath; this was one of the experiences that made me fall in love with movies. This was probably the first film where I completely forgot everything around me. I was there, in that boat, in that gloomy cabin, with those people - everything seemed so real (and alas, the sea never looked the same again). When I watch it these days I still marvel: the atmosphere and the performances in this film are simply magical. Spielberg without the schmalz. He has never been better. My vote: 10 out of 10 Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/ Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/",
         "\"Jaws\" is a thrill-ride of suspense that continues to deliver the goods to the audience 25 years later. The plot is somewhat thin: a large shark is terrorizing the tourists at the local beach. However, with that said Steven Spielberg's direction is amazing. The young director (only 28 at the time) showed unlimited potential that would only increase with age. A great accomplishment that could have been a multi-million dollar bust. 5 stars out of 5.",
         "My Rating: **** out of ****. Steven Spielberg is one of the best American directors working today. He has made many films that have been hailed as classics. Yet before the Dinosaurs, Holocaust, Peter Pan, UFO's, and Indy there was the Shark. Jaws represents one of the masterpieces on Spielbergs resume. It is also probably the \"Quintessential Spielberg Film.\" Jaws was very popular when released, it was the gighest grossing film of 1975. It spawned three sequels, which were all inferior. In fact, no film about Sharks or any killer fish has been able to come close to the level of Jaws. The genius in Jaws is its ability to build suspense. The Shark is never really shown till near the end of the film. When ever the Shark is approaching its victims, we get the Sharks point of view, instead of seeing the Shark. These POV shots combined with John Williams very effective score, make the scenes when the Shark is about to devour his victims much more effective. Evry actor does a nice job with their performances. Roy Scheider brings Martin to life. Martin is not a showy character but Scheider is able to make us like him. Richard Dreyfuss exhibits energy in his performance as Matt Hooper. Robert Shaw is very effective as Quint, that Indiannapolis speech is still very chilling to me. Lorraine Gary and Murray Hamilton also give solid support. People always talk about how fake the Shark looks. I think its passable but today it would definitely be done by CGI. However, the Shark is not seen that much in the film so its not that big of a deal. I would like to say Jaws is Spielbergs best film, Schindlers List closely follows. But I would like to see Close Encouners and the Indiana Jones films again. I did not like Close Encounters the first time, and I like the Indiana Jones films but they never stood out to me. If these films dont surpass Jaws, then it is definitely Spielberg's best film.",
         "Every once in a while the right talented people are at the right place together and come up with a masterpiece. \"Jaws\" is definitely one of those movies, that is thanks to the amazing cast and the crew the classic masterpiece that it is today. Let's face it, the story is dumb and silly and in a way very average. Spielberg magically turns the silly story into a tense exciting thriller with brilliant dialogue and classic scene's. Mark my words, \"Jaws\" is a movie that will never be considered outdated. Everything in the movie works so well! The acting, the dialogue, the tension, the typical Spielberg humor, the music, everything! It's hard to name just one thing why this movie is such a masterpiece. It is the mix of everything combined that makes the movie work. Probably my favorite thing about the movie would be the dialogue, they are very raw and performed well by the perfect cast. Another thing of course would be the music and I'm not just talking about the main theme but about the entire musical score in general. The cast is great but they are mainly great together. All of the Scheider/Shaw/Dreyfuss scene's are like three ingredients thrown together and the end result of it is pure gold. And than Bruce the shark. Yes, he really looks believable even now days. A real classic masterpiece that launched Spielberg's career 10/10 http://bobafett1138.blogspot.com/",
         "The film opens with a shot of a group of teenagers enjoying a campfire out on Amity beach... A couple leaves the group for a midnight swim... The silhouette of a woman is seen in full flight toward the sea... Her dress, bra, and panties fly toward her drunk admirer who can't make a fist to catch them... In a delicate splash, Chrissie goes swimming in the cold ocean, drawing herself into deeper water... When a wave of pressure lifts her up and eases her down, her face begins to show a certain fear... Her eyes go to the beach where her friend, too drunk to stand, is struggling with his shoe... Chrissie turns and starts for shore... But her expression freezes... Something terrible is hurting her underneath... She struggles with all her forces, but she is soon submerged in a horrifying scene... Police Chief Martin Brody (Roy Scheider) reacts quickly to the news of shark attack, and emerges with enough poster-board, wooden stakes, nails, paint and brushes to close every beach on the island... But as Amity is a beautiful summer resort with clean air, clear water, and beautiful white sand beaches... Mayor Larry Vaughn (Murray Hamilton) tries with his town officials to convince the insecure police chief to file the incident as a 'boating accident.' Brody reluctantly agrees, but later regrets his decision after few more fatal incidents... The shark has claimed Amity Island as his territory... Quint (Robert Shaw), an eccentric old shark killer, offers to kill the menacing Great White Shark for ten thousand dollars... Matt Hooper (Richard Dreyfuss), an arrogant young oceanographer, proves that the giant shark that killed Christine Watkins is still on the loose... 'They caught a shark. Not the shark,' he determines... and predicts future outbursts of attack activity in the area... Brody, Quint and Hooper become allied in a life-and-death hunt... They go after the monstrous creature with rifles and poison pistols... They try to tire him, slowing him down with coiled ropes and barrels... They fight him with everything, harpoons, poles, gaffs and compressed air tanks... Shaw is absolutely convincing as the colorful master fisherman whose obsession for destroying sharks was triggered by an actual incident in World War II... Scheider is quiet likable as the dedicated family man who doesn't even like the water, swimming or boating... His line to Quint ('You're going to need a bigger boat.\") suggests a specific cause... Dreyfuss manages to humanize the picture while stealing it... Spielberg alarms us with unexpected twists, and heart-stopping scenes wonderfully engaging... His grasp for sustaining the feeling of terror comes not only from what we see, but from what we're afraid we're going to see... He uses an imposing classical score to prepare the audience for something really scary that is about to show up... With every breath, every thought, heart beat and movement, the realism of the increasing menace is present from the opening to the end... And believe me, we are never allowed the relief of looking away from the screen\u0085"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Zanuck/Brown Productions",
         "Universal Pictures"
      ],
      "summaries": [
         "It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat.",
         "Martin Brody is the new police chief of Amity, an island resort town somewhere in New England. He has a wife named Ellen, and two sons named Michael and Sean. On a Summer morning, Brody is called to the beach, where the mangled body of Summer vacationer Chrissie Watkins has washed ashore. The medical examiner tells Brody that it could have been a shark that killed Watkins. Mayor Larry Vaughn, who is desperate to not lose the money that will be brought in by 4th of July tourists, wants Brody to say Watkins's death was caused by a motorboat propeller instead of a shark, because the thought of a shark in Amity's waters would drive tourists away from Amity. It looks like Vaughn is a mayor who puts money ahead of people's lives. Shark expert Matt Hooper believes Watkins was killed by a shark. Hooper is proven right a few days later, when Alex Kintner is killed by the shark that killed Watkins. Looking for the quickest solution, Vaughn tells all of the local fishermen to let him know if they see the shark. A shark hunter named Quint offers to find the shark and kill it, but Vaughn thinks Quint's price of $10,000 is too high. When a tiger shark is killed and hauled in by a couple of boaters, Vaughn hastily says that the shark crisis is over, but Hooper says the shark that's been killing people a huge great white shark is still in Amity's waters, but Vaughn leaves the beaches opened because all he cares about is the 4th of July tourist money. On the 4th of July, Vaughn encourages people to swim at the beach, and Hooper is proven right again when the shark kills a man, biting the man's leg off. Michael, who was in the water at the time of the attack, is taken to the hospital, where he's treated for shock after watching the shark kill the guy. Brody asks Vaughn to hire Quint to find the shark. Because his own kids were at that beach too, Vaughn agrees to hire Quint to find the shark. Quint, Hooper, and Brody are sent out to sea in Quint's boat, the Orca, ready to do whatever it takes to find the shark.",
         "The peaceful community of Amity island is being terrorised. There is something in the sea that is attacking swimmers. They can no longer enjoy the sea and the sun as they used to, and the spreading fear is affecting the numbers of tourists that are normally attracted to this island. After many attempts the great white shark won't go away and sheriff Brody, with friends Hooper and Quint decide to go after the shark and kill it.",
         "A Great White Shark decides to make the small beach resort town of Amity his private feeding grounds. This greatly frustrates the town police chief who wants to close the beaches to chase the shark away. He is thwarted in his efforts by the town's mayor who finally relents when nothing else seems to work and the chief, a scientist, and an old fisherman with revenge on his mind take to the sea to kill the beast.",
         "When a gigantic great white shark begins to menace the small island community of Amity, a police chief, a marine scientist and grizzled fisherman set out to stop it."
      ],
      "budget": 8000000
   },
   "movielensId": 1387,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-06-18",
      "dvdReleaseDate": "2005-07-14",
      "directors": ["Steven Spielberg"],
      "runtime": 124,
      "movieId": 1387,
      "title": "Jaws",
      "mpaa": "PG",
      "actors": [
         "Roy Scheider",
         "Robert Shaw",
         "Richard Dreyfuss",
         "Lorraine Gary",
         "Murray Hamilton",
         "Carl Gottlieb",
         "Jeffrey Kramer",
         "Susan Backlinie",
         "Jonathan Filley",
         "Chris Rebello",
         "Jay Mello",
         "Lee Fierro",
         "Jeffrey Voorhees",
         "Craig Kingsbury",
         "Robert Nevin",
         "Ted Grossman",
         "Peter Benchley",
         "Dorothy Fielding",
         "Steven Spielberg",
         "Denise Cheshire",
         "Fritzi Jane Courtney",
         "David Engelbach",
         "Belle McDonald",
         "Joseph Oliveira",
         "Beverly Powers",
         "Ayn Ruymen",
         "Christopher Sands",
         "Rex Trailer",
         "Philip Ettington"
      ],
      "imdbMovieId": "0073195",
      "originalTitle": "Jaws",
      "genres": [
         "Horror",
         "Thriller",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "U1fu_sA7XhE",
         "qSU5iaHIIjc",
         "EhBrkC5g6GI"
      ],
      "plotSummary": "An insatiable great white shark terrorizes the townspeople of Amity Island, The police chief, an oceanographer and a grizzled shark hunter seek to destroy the bloodthirsty beast.",
      "tmdbMovieId": 578,
      "avgRating": 3.78607,
      "releaseYear": "1975",
      "numRatings": 26076,
      "posterPath": "/l1yltvzILaZcx2jYvc5sEMkM7Eh.jpg"
   }
}