{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "hostility",
            "id": 6062
         },
         {
            "name": "car accident",
            "id": 13063
         },
         {
            "name": "salesmen",
            "id": 194228
         }
      ],
      "imdb_id": "tt0094155",
      "video": false,
      "title": "Tin Men",
      "recommendations": [
         41852,
         32081,
         53287,
         19382,
         19143,
         29973,
         26173,
         18391,
         12633,
         19118,
         12647,
         28368,
         59195,
         107934,
         32044,
         85529,
         17006,
         41971,
         56385,
         27224
      ],
      "backdrop_path": "/o03tMmnWc18wEsBZO1fmWtK1XMS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bill 'BB' Babowsky",
               "gender": 2,
               "credit_id": "52fe43cb9251416c7501e701",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ernest Tilley",
               "gender": 2,
               "credit_id": "52fe43cb9251416c7501e705",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nora Tilley",
               "gender": 1,
               "credit_id": "52fe43cb9251416c7501e709",
               "name": "Barbara Hershey",
               "profile_path": "/gaimK3QeNS32Wjryw03QC0PXWKO.jpg",
               "id": 10767,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Moe Adams",
               "gender": 2,
               "credit_id": "52fe43cb9251416c7501e70d",
               "name": "John Mahoney",
               "profile_path": "/jK2uDKxfysuYjNAgUxbwyhd4fKD.jpg",
               "id": 4251,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43cb9251416c7501e713",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43cb9251416c7501e719",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe43cb9251416c7501e725",
               "name": "Peter Sova",
               "profile_path": null,
               "id": 11958,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43cb9251416c7501e72b",
               "name": "Stu Linder",
               "profile_path": null,
               "id": 5166,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "563f5f54c3a3681b4d035d1f",
               "name": "Mark Johnson",
               "profile_path": "/yKGF6cbzyP03Gl1QhVLCu1gWSW6.jpg",
               "id": 5162,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.270015,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10896,
      "vote_count": 42,
      "budget": 0,
      "overview": "A minor car accident drives two rival aluminum-siding salesmen to the ridiculous extremes of man versus man in 1963 Baltimore.",
      "similar": [
         13523,
         376660,
         44564,
         62211,
         9472,
         862,
         585,
         1124,
         19913,
         28178,
         40807,
         489,
         13,
         1903,
         50544,
         72105,
         272693,
         55721,
         68718,
         41630
      ],
      "original_title": "Tin Men",
      "runtime": 112,
      "poster_path": "/7ZbgkUI9fKrv7vCGE16NJVT5xMr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Silver Screen Partners II",
            "id": 10531,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1987-03-06",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "The Year - 1963. Selling the American Dream is a risky, funny business - you could wind up paying with your wife!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barry Levinson"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Barry Levinson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094155/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2OTU1MzI1NF5BMl5BanBnXkFtZTcwODgyMzcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Richard Dreyfuss, Danny DeVito, Barbara Hershey | See full cast and crew »"],
      "reviews": [
         "'Tin Men' is the most underrated comedy in film history. How's that for a bold statement? I'm sure you've heard of this movie. Many of you probably saw it. Then turned it off, and said, 'That was cute.' In fact, most will remember it more for launching the brief career of the Fine Young Cannibals. (A couple of their songs were featured in the film) I very well might have been one of you, if it hadn't been for my father's devotion to this film. It was because of him I saw it a half dozen times growing up, and much like 'The Big Lebowski' and 'Sherlock Jr.', the more I saw this film, the more I fell in love with it. 'Tin Men' is about two aluminum siding salesmen (working for competing companies) who get into a car accident, and both believing the other is to blame, decide to get revenge on one another. Richard Dreyfuss and Danny Devito (two of the more underrated actors around) deliver some of the funniest scenes you'll ever see. Things get complicated when Dreyfuss attempts to infuriate Devito by sleeping with his wife, only to fall in love with her. DeVito plays an emotional and financial disaster, struggling to keep his head above water, while tidal waves are crashing down all around him. (And does so, with the efficiency of a Third World sweatshop) Dreyfuss, a slick, fast- talking 'nickel and dime' hustler, whose ideas about life and love change when he discovers the truth about himself and his business through his own vindictive behavior. If you actors out there are wondering how to play 'quiet desperation' funny, rent this movie. 'Tin Men' uses a clever vernacular. Including several seemingly unnecessary dialogue driven scenes done way before dialogue driven scenes became commonplace. (See, Pulp Fiction 1994, and pretty much every movie to follow) With topics ranging from 'Bonanza' not being an accurate depiction of the West, to finding God at the smorgasborg. It also displays a devotion to detail, unparralleled by any big-budget movie of today. Everything feels real. The people, the conversation, the decor, everything. When I watched this movie again recently I came up with an hypothesis regarding its lack of real success, or longevity. It's quite simple, and when you first say it, feels lame. But the more I think about it, I believe it may be true: Like most great movies that are under-appreciated, they aren't trying to impress us. They don't have to.",
         "I have never quite understood why this flick has not achieved more critical and popular acclaim. I rate it a 9, which is very high for me (10s are reserved for a handful of all time classics). Beyond the great acting, super dialogue, and tremendous comedy -- which everyone seems to recognize -- there is also a very serious movie inside. Of course, as everyone says, it's an interesting slice of Americana: Baltimore in the early 1960s (before the flood). And on that basis alone, Tin Men is a great film. Few movies have ever given such an accurate portrayal of a particular time and place in America as well as this one. But the movie is more than that. Tin Men is a story in which the historical tension between America's atavistic entrepreneurial spirit (as exemplified by the \"tin men\") and the regulatory forces of the state (as exemplified by the \"investigating commission\") are at an important crossroads. From the start it's obvious that the tin men have no chance and will lose this fight. It's a passing of a way of life. Much in the tradition of other great American works of art that examine the trade of salesman (Death of a Salesman, etc.), Tin Men is an indepth (and very funny) portrait of their psychological and social world. Their world outlook is now dying and there is a touch of wistfulness about that passage in the film. Are we as viewers supposed to be sad about it too? Or should we be happy? After all, the life of a tin man was hard and brutal (as well as free): witness the death of one of them to a heart attack. On the other hand, is this way of life genuinely dying or just metamorphisizing? The ending was excellent because it brought ambiguity to that question. When DeVito and Dreyfus spot a new business opportunity: Volkswagens, we realize these \"tin men\" are irrepressible! They won't be stopped despite the new regulatory environment of the modern world. For my money, this movie is Barry Levinson's best by far. (Excellent soundtrack by Fine Young Cannibals, as well.)",
         "I grew up with characters like Dreyfus and DeVito, hustlers out there selling anything. Somewhere between 1963 and the time the film came out, they disappeared from our streets, only to move into six story office buildings that dot the suburbs of Northeastern cities. Now they spend their time on the phone, trying to interest prospects that new windows will surely cut their fuel bills. I came to realize this great truth one day in 1988 when I went to rent a car and was told to come to Executive Plaza 5, Suite 414. As I walked the halls, all I could see in open offices were the Tin Men of 1963 at it again. The movie crackles and sets off sparks. You don't know who to root for, and for good reason. This is not a buddy movie, but I suspect a remembrance by Levinson of people he knew growing up.",
         "Few films can be laugh-out-loud funny and ultimately as touching and deep as this film. Most people remember the dialogue, seemingly ad-libbed during the diner scenes by the cast (Danny DeVito, Jackie Gayle, Bruno Kirby)--and that looks like the same diner that Barry Levinson used for his first movie. But the characters and their quirks are totally fleshed out before the conflict (DeVito's stiff neck, Dreyfuss's ladies' man schtick), making for a few truly hilarious lines and scenes (Gayle talking to DeVito about what a great dancer Dreyfuss is comes to mind). The movie really has a sad story underneath about very unhappy people who delight in the misfortunes of others, until Barbara Hershey's character realizes what's going on. All of these characters and story points climax in a rather sweet and yes, believable final sequence. This movie came out during a spate of late '80s blockbusters and never really found its audience, I think. But it is one of the few late '80s movies I rewatch every couple of years and find more to appreciate with each viewing. I would rank it as Levinson's best film.",
         "Chronicles the adventures of Frazier Crane's father, Mo, before he retired to Seattle on a bum leg. While very few Barry L movies ever make it past contrived unfunny nonsense, Tin Men is a definite winner. Barry takes us back to his revered 1960s Baltimore and the ensemble cast has graduated from Diners drifter 20 somethings, to of all things, aluminum siding peddlers on the threshold of middle age. For some inexplicable reason, its not as dumb as it sounds. The performances are, to a man (and woman in Hersheys lone case) first rate. The script witty and touching. Above all however, is Tin Men's ability to get a laugh. From the Bonanza discussions that Tarentino would later graft onto his own Reservoir Dogs, to the 'tit for tat' revenge storyline, its all very very good. Even old Richard Dreyfuss who is probably the most all round unlikeable dude to ever carry the title of 'leading man', gives an uncharacteristically suitable performance. The mincing, whining, face-making exaggerated body language, in this film all works to perfection. DeVito with his extremely limited range, again lands himself in a movie that totally welcomes his character. You would like to have seen just how Fraziers dad (Mahoney) injured his leg, but for some reason it is not detailed here. Levinson cant help being Levinson and strangely inserts the music of the Fine Young Cannibals into a film supposedly set 25 years earlier. Go figure.",
         "Tin Men is one of my favorite movies of all time. The thing that always strikes me whenever I watch this movie is that while the characters of Richard Dreyfuss and Danny DeVito are seemingly feuding non-stop throughout the movie, in reality they are actually kindred spirits. It's like they see themselves in the other but don't really like what they see. Barbara Hershey is great as the haggard housewife who looks for something more fulfilling in her life. All the supporting cast is excellent. I love the diner dialog which is reminiscent of Barry Levinson's previous film \"Diner.\" The background scenes of Baltimore landscape add to the realistic atmosphere of the movie. Overall, I think this movie is vastly underrated. I'd love to see a sequel with Dreyfuss and DeVito as partners in a VW dealership.",
         "You can tell when you are watching a movie made by Barry Levinson. Diner, Tin Men and Rain Man all have a similar touch, even though they are different movies, they are made by the same artist. In Tin Men, the audience is treated to a comedy, and is rewarded with a hidden drama. Much like Diner and Rainman, the movie has its comical moments. Still, this is a story about people and a drama that they live. The comedy is the teaspoon of sugar that helps the drama go down. DeVito and Dreyfuss are nothing short of great. The supporting cast in Tin Men is just as good. You forget that you are watching a movie at times. The movie is at times up lifting as well as thoughtful with a strong ending that makes the rest of the movie great. A hidden gem / comedy. This is one of those movies that you can not go wrong with.",
         "TIN MEN is certainly among the dozen or so movies that I have watched more than a dozen or so times, so I have no claim to being objective about critiquing it. It's just one of my favorite movies. Beyond the obvious praise it's due for its period detail and its terrific supporting comedic cast and the balancing act Levinson achieves between its overall tragic arc and its genuinely funny script, what keeps me coming back to this movie time after time are its many \"perfect\" moments, most of which come courtesy of Barbara Hershey. I don't know if Ms. Hershey is indeed one of our best actresses... it's quite possible that her performance in THIS movie for THIS director in THIS setting is brilliant out of sheer serendipity, but her quiet, unmannered performance here is one of my Favorite Things in This World. Her chemistry with Mr. DeVito is pitch-perfect, and their scenes together serve as the movie's thermometer. The dialog she is given and what she does with it are marvels. When her house is repossessed and she encounters her husband on the front porch, she complaints that her husband doesn't give a damn about her or about the many things of hers still in the locked-up house: \"The headboard, that was given to me by my Aunt Josephine, that's gotta be at least a hundred... you know, 50 years old, or... you know, it's OLD.\" If reading this bit doesn't convey the idea of \"perfect moment\" understand that Ms. Hershey's character is a person who so values honesty, in the midst of a life surrounded by professionally dishonest people, that she self-corrects on a trivial point. So much information is telegraphed in that brief stutter--and in similar moments throughout the movie... I've seldom fallen so hard in love with a movie character as a result. Elsewhere, when Richard Dreyfuss's character professes his love for her in a rain-soaked scene, it culminates in: \"I wanna... ... ... you know?\" And the thing is, you DO know--again, all essential information about this character and his situation is telegraphed in the elipsis. These moments have become part of my personal movie mythos: they serve as the nearest-in-reach examples of what a great movie is made of. Certainly more--a lot more--is needed for a great movie, and whether Tin Men has all the other elements in place is a question I'll leave to the professional critics. But I'm sure of the many moments of greatness in Tin Men. This movie is NOT a guilty pleasure.",
         "Rival aluminum-siding salesman declare war in another of director Levinson's returns to his hometown Baltimore, with Dreyfuss and DeVito playing the two feuding parties who constantly try to one up one another in a series of silly and childish gags. That's where the film falters, but it is in the charming performance of Hershey where the film is successful. Considering she's the only character with morals in the entire piece, she's the one you care for and root for. (An especially wonderful scene with DeVito on the porch when the IRS has taken his house.) Dreyfuss and DeVito, with exception to the silly gags the writers engaged their characters in, are in fine form, as always. Stand out performances from Mahoney as a real \"tin man,\" and comedien Jackie Gayle, who has a fixation with knocking \"Bonanza,\" are excellent.",
         "Oddball, retro films like this never make the all-time top 100 lists \u0096 like one of its characters, \"Tin Men\" comes across as a bit of a small guy, not one of life's winners. But you're missing something quite special if you let the sound of the film put you off. Two rival salesmen in a tough market play dirtier and dirtier in a childish tit-for-tat game, raising a storm of revenge and recrimination until they drag long-suffering wife Barbara Hershey into their fight, raising the stakes for them all. Crackling with expertly ad-libbed dialogue from actors who are clearly enjoying themselves, it's like a masterclass in flowing, naturalistic dialogue \u0096 and it's very, very funny. Richard Dreyfus (he reminds me of Richard Widmark \u0096 a reliable character actor who never gets his due) and Danny DeVito are a marvel of casting perfection. Scenes such as those in the diner where the rival groups of tin men chew the fat in their own unique and entertaining ways, show pale imitators how it's done: shame on all modern Hollywood scripts that pad out a weak story by having actors babble a great deal of nonsense, very fast (Lethal Weapon 4, anyone?). I hate films about salesmen: that isn't what this is. \"Tin Men\" has rounded characters in a believably drawn world (in which a man's car might just come higher up the list than his wife) and a story that's really just about human beings who laugh, fail, make mistakes and don't always triumph at the end \u0096 shot and scripted with a light touch. I'd recommend you make this one you try and watch, if you can ever find it playing. A rare treat."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Bandai Films",
         "Silver Screen Partners III",
         "Touchstone Pictures"
      ],
      "summaries": [
         "One step short of larceny, the aluminum siding salesmen in this movie sell their wares, compete with each other, and engage in a lot of great dialog. Tin Men focuses on the rivalry between BB Babowsky and Ernest Tilley. At the same time, the end of small world of which they are kings looms near as a government probe investigates their industry.",
         "Barry Levingson's semi-follow up to Diner, also set in 1960s Baltimore, takes us in the world of aluminum siding sales focusing on two very different men in that profession. BB Babowsky is a smooth-talking hustler and ladies man whom scams naive and comely women sales pitches. Ernest Tilley is a loser who can't make a sale no matter how hard he honestly (or dishonestly) tries. Tilley also has a serious gambling problem and squanders what little money he makes on horse races and card games which puts a rife between him and his long-suffering wife Nora. Because of Tilley's addition to gambling, he is heavily in debt to various creditors and the IRS. BB and Tilley's paths cross in the opening scene when they collide with each other in their cars. With both blaming each other for the accident, their feud soon escalates into a full-scale, two-man war between them with Nora getting drawn into it. However, both BB and Tilley's world begins to crumble when a government probe investigates their sales history and threatens to shut them down for good.",
         "A minor car accident drives two rival aluminum-siding salesmen to the ridiculous extremes of man versus man in 1963 Baltimore."
      ],
      "budget": 11000000
   },
   "movielensId": 1395,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-03-06",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Barry Levinson"],
      "runtime": 112,
      "movieId": 1395,
      "title": "Tin Men",
      "mpaa": "",
      "actors": [
         "Richard Dreyfuss",
         "Danny DeVito",
         "Barbara Hershey",
         "John Mahoney"
      ],
      "imdbMovieId": "0094155",
      "originalTitle": "Tin Men",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "qyxTV5QXgZw",
         "ajetxCpdwbY",
         "Mc2GsqlhzPQ"
      ],
      "plotSummary": "A minor car accident drives two rival aluminum-siding salesmen to the ridiculous extremes of man versus man in 1963 Baltimore.",
      "tmdbMovieId": 10896,
      "avgRating": 3.3674,
      "releaseYear": "1987",
      "numRatings": 2368,
      "posterPath": "/7ZbgkUI9fKrv7vCGE16NJVT5xMr.jpg"
   }
}