{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0115633",
      "video": false,
      "title": "Bastard Out of Carolina",
      "recommendations": [
         41747,
         96393,
         61418,
         144580,
         58886,
         25576,
         157036,
         199291,
         114556,
         82143,
         14187,
         124042,
         46924,
         46989,
         18856,
         51321,
         49804,
         74101,
         52961,
         292044
      ],
      "backdrop_path": "/dhSsYchguT1wyMpIvVxXSoiQj02.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Anney Boatwright",
               "gender": 1,
               "credit_id": "52fe45bec3a36847f80d7f31",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Wade",
               "gender": 2,
               "credit_id": "52fe45bec3a36847f80d7f35",
               "name": "Lyle Lovett",
               "profile_path": "/yDaJWyKH5MKZkAPVCb6vMC2lnlJ.jpg",
               "id": 11059,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dee Dee",
               "gender": 1,
               "credit_id": "52fe45bec3a36847f80d7f39",
               "name": "Christina Ricci",
               "profile_path": "/dzB58d6fNrTEi7nBAU1tySJc2at.jpg",
               "id": 6886,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ruth Anne 'Bone' Boatwright",
               "gender": 1,
               "credit_id": "52fe45bec3a36847f80d7f3d",
               "name": "Jena Malone",
               "profile_path": "/p4IvynJ0U69WqiaW8V2UydcNVw1.jpg",
               "id": 20089,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Glen Waddell",
               "gender": 2,
               "credit_id": "52fe45bec3a36847f80d7f41",
               "name": "Ron Eldard",
               "profile_path": "/n49scru0f7iuoj4Uy1Pp9KZr2zK.jpg",
               "id": 12260,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45bec3a36847f80d7f47",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bec3a36847f80d7f4d",
               "name": "Gary Hoffman",
               "profile_path": null,
               "id": 1044114,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bec3a36847f80d7f53",
               "name": "Amanda DiGiulio",
               "profile_path": null,
               "id": 1258010,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.649668,
      "production_countries": [],
      "id": 41240,
      "vote_count": 23,
      "budget": 0,
      "overview": "Difficult tale of poor, struggling South Carolinian mother &amp; daughter, who each face painful choices with their resolve and pride. Bone, the eldest daughter, and Anney her tired mother, grow both closer and farther apart: Anney sees Glen as her last chance.  The film won an Emmy Award for \"Outstanding Casting for a Miniseries or a Special\" and was nominated for \"Outstanding Directing for a Miniseries or a Special\", \"Outstanding Supporting Actress in a Miniseries or a Special\", and \"Outstanding Made for Television Movie\". It was screened in the Un Certain Regard section at the 1996 Cannes Film Festival.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Bastard Out of Carolina",
      "runtime": 97,
      "poster_path": "/jYFwFOkHwWxaStR21UIgdb96Gzh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-12-15",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anjelica Huston"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Dorothy Allison",
         "Anne Meredith"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115633/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5MDkyMzU1N15BMl5BanBnXkFtZTcwMTk5NzMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jennifer Jason Leigh, Ron Eldard, Glenne Headly | See full cast and crew »"],
      "reviews": [
         "This film gnawed at me. And gnawed, and gnawed. It's a difficult film to really \"like\", considering the subject matter, but the acting and directing were so outstanding that the film must be seen. The casting was so dead on; Ron Eldard, an actor I knew only from his role on \"ER\", was chillingly effective as the handsome-yet-monstrous \"Daddy Glen\", young Jena Malone came across as an old pro as little Bone, and I was overjoyed to see Michael Rooker, a talented and often overlooked actor, take a rare turn as good guy Earle. Also good to see Diana Scarwid get a rare role into which she could really sink her teeth. I must confess, the scene in which Earle, Wade, and Travis beat the stuffing out of Glen at the funeral had me cheering and swinging my own fists. If anyone out there - particularly women whose husbands or boyfriends have \"tempers\" - can watch this film and still not see the light, nothing will ever make them see. A triumph for Anjelica Huston, as well as for her cast. Is \"Bastard Out of Carolina\" a disturbing film? Absolutely. Is it at times graphic, even horrifying? No question. But it is also a fine piece of filmmaking, and something any true film lover should see.",
         "I just finished watching this movie again for the third time in the last two days. Each time I watch it I discover something I missed in the previous viewing. There are no wasted lines or scenes. It is a powerful 1996 movie with excellent performances, dealing with the touchy subject of child abuse. Anjelica Huston is the director and this is her first attempt at directing a feature length movie. The results are stunning. It is altogether a flawless movie, with an excellent script based on the Dorothy Allison novel, and stars Jena Malone as the young protagonist. Jennifer Jason Leigh is in the tough role of the mother torn between the choices she faces in loving both her daughter and the abusive stepfather. Many times throughout the movie I sat on the edge of my seat stunned by the action happening onscreen. It is not a movie with pat answers and predictable solutions, but manages to show the complexities involved in each situation. There are no cardboard characters either, as in real life not everyone is totally good or evil, though their actions may dip into either category from time to time. The most compelling performance, in a film loaded with excellent acting, comes from young Malone, who commands a role that many adult actresses would no doubt have trouble handling. Her face tells a thousand stories with each shot giving a multi-leveled meaning to the deeper motivations that lie within her character. After the credits Glenne Headly provides further information about the subject and a child abuse hotline number, which is a great addition to a film of this sort. It is not \"entertainment\" per se, but more along the lines of an informational public service. The symptoms of child abuse are highlighted throughout the movie and the effect of everyone's participation documented as fair warning to the viewer. I can't praise this movie enough. A film like this raises my awareness and compassion level and makes me want to reach out to help in any way I can. It exceeds expectations in just about every way imaginable.",
         "Knowing that the movie deals with the multiple abuse of a young girl, I first read a long interview with Jena Malone, who plays 10 year old Bones, about her role in the movie and the relationship with both her mother and the film crew. I was assured that she is a strong girl and understood the role she played. When she was little Bones' own daddy swings her around and around in a beautiful scene by a lake. There are sparkles on the water and in her eyes. But tragedy takes her daddy away, and for, what must have been a few years, she sits in the back of her car cuddling her little sister and waiting for her mother to get off shift at the cafe she worked at. Her mom gets married to a man who is pathetic, and at the same time angry, violent and ultimately a monster of cruelty to little Bones. Early on, he sexually abuses her in the car as they wait outside the hospital for her mother to give birth. Jena Malone played her part to perfection. Her pain, crooked smile, perfect cracker accent, defiance and fear drilled itself into my heart. I could feel her hopelessness and at the same time the flashes of joy when she was free to sing, as well as the love and protection she felt for her little sister. The relationships between the characters were fully developed. While I cheered when Bones' stepfather was beat up, I still had a hard time hating him as much as I should. Bones' mother, although a sympathetic character who loved her babies, I may not forgive, at least from the time she carried Bones out of the hospital. Altogether a ten star movie.",
         "\"Bastard Out of Carolina\" is by far the most disturbing film I have ever seen. At the same time, it is one of the finest films to be made in history. Words cannot explain how deeply this film affected me, I couldn't move when the credits rolled up, I could do nothing but think about what I had just seen. The performances here are nothing but astonishing. Jennifer Jason Leigh gives a wonderful, heart-felt performance, and at times you just want to slap her and say \"wake up!\". The greatest performance in this film though is by Jena Malone. Wow, I've never seen such an intense performance by any actress let alone a child actress. All in all, a great film. *****/out of 5",
         "This is an often shocking but necessary film about a young girl called Bone and the abuse she suffers at the hands of her stepfather, Daddy Glen. The film is hard to watch at times but there are lighter moments when Bone's extended family are on screen. The book contains a much wider scope and naturally many of these subplots didn't make it into the screenplay. Ultimately, the film feels a little rushed and could have benefited from another half hour or so. The quality of the acting is patchy. Lyle Lovett's delivery of his few lines of dialogue is very wooden compared to Michael Rooker's excellent portrayal of gentle giant Earl. Jena Malone does a brilliant job in obviously difficult circumstances as young Bone. The look in her eyes breaks your heart whenever things are about to turn violent, making you want to rescue her yourself. Jennifer Jason Leigh is fine as Bone's mother but you feel like you never really get to see beneath the surface of her determined expression to understand her motives for standing by her man in the face of Glen's obvious resentment of her daughter. Ron Eldard is excellent in his depiction Glen, expertly capturing the character's pathetic childishness behind those icy blue eyes. Eldard often seems to play characters with a dark side and this role plays to his strengths, even if his southern accent slips from time to time. His scenes of violence with Bone are harrowing to watch and you can't help but feel uncomfortable, given the age of Jena Malone at the time. I know it's 'only acting' but the scenes are very realistic and graphic for a young actress to endure. The film is one that ought to be shown to any single mother tempted to jump into a relationship with a hot-headed young man with questionable intentions.",
         "Not for the Squeamish! It deals with sexual abuse of children. I saw an interview with Jenna Malone and she was emphatic to re-assure people that she was not herself abused during this film, she got along very well with Ron Eldard, and that she understood that it was acting, etc. I'll bet that some actors turned down the role, given the subject matter. From a standpoint of dealing with the subject matter honestly the director Angelica Huston pulled no punches. There's a haunting scene where Eldard was sitting in a car with Jena on his lap and he abuses her - I'm sure it was a very difficult scene to film! But it's a \"must see\" for the realistic portrayal of a true story.",
         "Sure, it's imperfect, but then so are most classics. \"It's a Wonderful Life\" is loaded with stereotypes, banalities, and over-acting. \"Casablanca\" features trite dialog, and the characters of Paul Henreid and Ingrid Bergman seem pretty wishy-washy for supposed heroes. \"Bastard\" is a biographical tale. Biographies often are episodic and lack continuity just as real life is episodic and lacks continuity. Biographical dialog is sometimes unimaginative because it reflects real life speech; none of us has a professional writer feeding us our lines. However, what \"Bastard\" does have are unforgettable scenes and images of profound emotional impact, a gritty set of down-home characters presented with gutsy reality by a superlative cast, and Jena Malone. Actually, Miss Malone has relatively few lines in this movie, but her expressive face, and especially her fantastic eyes speak clearly and powerfully from the depths of her heart in every scene. And the lines she does speak stab into our hearts with deadly accuracy. A memorable performance in a memorable movie.",
         "I just watched this movie in my Advanced Developmental Psychology class, and I was blown away by it. Naturally, the professor warned us that the film contained some very graphic scenes, as it certainly did. There were moments where I absolutely could not look up at the screen. The film is wonderfully directed (by Anjelica Huston) and acted. Jennifer Jason Leigh gives one of the best performances of her career. She's one of those actresses who has talent and I have nothing against her, but rarely do I find myself raving about her performances. Here, she's given a genuinely challenging role, as she has to be both disturbed by her new husband's abuse towards her daughter, yet at the same time deeply in love with him. My class is predominantly female, so most of the girls were groaning and yelling out things like \"You're stupid!\" when she kept deciding to get back with the creep. But it's easy to say that while you're sitting on your butt looking at a TV screen. Tons of women get into relationships with abusive husbands, and guys who treat them like crap, and how many of them actually get out of those relationships? Love is a strange, strange thing. There's no way to explain it. But I didn't feel it was in any way inaccurate for Leigh's character to keep wanting to get back with Ron Eldard. I know Eldard from his role on the cancelled sitcom \"Men Behaving Badly\" and his supporting roles in films like \"Sleepers\" and \"The Last Supper.\" Prior to this movie, I would've never envisioned him in this sort of role, as I didn't really think of him as a daring, intense actor. I would envision an actor like Ray Liotta or James Woods in this sort of role. But I think Eldard's apparent naivete really gives dimension to this role. He doesn't in any way appear like someone who would act abusive towards anyone, as it usually turns out in real life. He also plays the character with a certain charm, which gives us some insight into why Leigh decided to stay with him. Of course, he never gets a handle on the Carolina accent (at times even sounding like an Englishman, as he struggles so hard), but as I got more and more into the film, I barely paid attention to the flaws in his accent. After watching this film, I will definitely look at Eldard much differently, as much more than the fun-loving buddy of Rob Schneider on \"Men Behaving Badly\" (a show I used to watch pretty frequently). The cast is also composed of fine character actors, like Glenne Headley and Michael Rooker--who's absolutely terrific as Leigh's short-fused brother. Of course, that isn't an unusual role for him, but he plays it very well and packs a great dramatic punch in this performance especially. Jena Malone shows why she grew up to star in big films like \"Stepmom\" and \"For Love of the Game.\" Even at this age, she is fully convincing as a tortured young girl. I just kept on wondering what the director gave her as motivation for her different emotions, since I'm guessing they couldn't outwardly address the issues or rape and abuse to a girl of her age. The film contains some of the most disturbing scenes in American cinema (I stress the word \"American,\" because I've seen more graphic rape scenes in foreign films like \"The Bandit Queen\" and \"Pixote\"), so even those with stomachs of steel should beware. But how many films you watch really get you talking and thinking, and send you an emotional journey--without using cheap shots? I don't have A.D.D. or anything, but rarely do I get so lost in a film that my attention never drifts and I never take time to look at my watch. This is one of those rare powerful, touching films that I will never forget! My score: 9 (out of 10)",
         "Anjelica Huston, an unequivocally wise and intuitive actress, takes on a dark, rambling Southern tale for her first directorial effort, an adaptation of Dorothy Allison's book with so many peaks and valleys it plays like a chopped up TV mini-series, the CliffsNotes version. Story centers on an illegitimate young girl (Jena Malone) in the South during the 1950s and her woebegone waitress-mother (Jennifer Jason Leigh), who has had terrible luck with men. Seems her third husband (Ron Eldard) has a violent streak when provoked, and when he begins lashing out at the child in both violent and sexual ways, relatives step in to help her. Rare to find a cast so full of solid acting talent, yet this script takes great pains to introduce characters without giving them anything to do (some of the relatives, like the uptown cousin played by Christina Ricci or Dermot Mulroney's doomed Husband #2, appear and disappear in record time). The central performances are fine, with pre-teen Malone doing some very nice work; a child actress with a solemn reserve and faraway eyes, Malone is perhaps too studied in her approach (she isn't an untrained natural), yet Huston handles her gently and some of the strongest moments are the ones where Malone is allowed to take a breath and emote. However, this film, a failed theatrical effort which was sold instead to cable television, is packed (or padded, as it were) with short-hand tragedy, and the editing is so poor and the narrative so confusing you might need a scorecard to keep up with all the melodrama. Despite her sensitivity in staging some shattering scenes, Huston doesn't allow the picture to flow, to absorb the audience. It's jagged and piqued, and one recoils from it instead of being drawn into the plot. ** from ****",
         "This was a terrific film that explored painful subject matter and did it well. The creeping malice and cowardice of Glenn (a brave role for Ron Eldard) was terrifying and will be recognized as realistic by any survivor of child abuse, as will Bone's sense of isolation and responsibility for \"keeping the peace.\" The women in the film acted their roles with real strength and tenderness - particularly, I thought, Glenne Headly as Aunt Ruth. Jena Malone was a natural. I also loved Grace Zabriskie as Grandma. Displaying the lives of people commonly labeled \"poor white trash\" could have gone horribly wrong, but \"Bastard\" doesn't patronize or demean. One wishes that those who made hay about the brutal child-rape scene in this film would devote this energy to protesting the actual occurrence of such things. The graphic nature of this scene was disturbing, to be sure, but not gratuitous or exploitative. A worthwhile rendering of Dorothy Allison's semi-autobiographical novel."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Showtime Networks"],
      "summaries": ["Difficult tale of poor, struggling South Carolinian mother & daughter, who each face painful choices with their resolve and pride. Bone, the eldest daughter, and Anney her tired mother, grow both closer and farther apart: Anney sees Glen as her last chance."],
      "budget": 0
   },
   "movielensId": 1397,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-15",
      "dvdReleaseDate": "2000-05-02",
      "directors": ["Anjelica Huston"],
      "runtime": 97,
      "movieId": 1397,
      "title": "Bastard Out of Carolina",
      "mpaa": "",
      "actors": [
         "Jennifer Jason Leigh",
         "Lyle Lovett",
         "Christina Ricci",
         "Jena Malone",
         "Ron Eldard"
      ],
      "imdbMovieId": "0115633",
      "originalTitle": "Bastard Out of Carolina",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Difficult tale of poor, struggling South Carolinian mother &amp; daughter, who each face painful choices with their resolve and pride. Bone, the eldest daughter, and Anney her tired mother, grow both closer and farther apart: Anney sees Glen as her last chance.  The film won an Emmy Award for \"Outstanding Casting for a Miniseries or a Special\" and was nominated for \"Outstanding Directing for a Miniseries or a Special\", \"Outstanding Supporting Actress in a Miniseries or a Special\", and \"Outstanding Made for Television Movie\". It was screened in the Un Certain Regard section at the 1996 Cannes Film Festival.",
      "tmdbMovieId": 41240,
      "avgRating": 3.55606,
      "releaseYear": "1996",
      "numRatings": 660,
      "posterPath": "/zfTpTthvsAxcMctOcX5tYESb3vL.jpg"
   }
}