{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "world war i",
            "id": 2504
         },
         {
            "name": "hemmingway",
            "id": 155509
         }
      ],
      "imdb_id": "tt0116621",
      "video": false,
      "title": "In Love and War",
      "recommendations": [
         71456,
         29691,
         81207,
         18404,
         39001,
         51036,
         45712,
         20065,
         118430,
         232138,
         12547,
         79995,
         33657,
         20551,
         26179,
         49478,
         26659,
         42001,
         66668,
         15556
      ],
      "backdrop_path": "/2GzcwkH421k4k8Du22Hm2uCl9wW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Agnes von Kurowsky",
               "gender": 1,
               "credit_id": "52fe4523c3a368484e04a961",
               "name": "Sandra Bullock",
               "profile_path": "/1Im0NV6nVaKyXMpYjGOfWaj5khS.jpg",
               "id": 18277,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ernest 'Ernie' Hemingway",
               "gender": 2,
               "credit_id": "52fe4523c3a368484e04a965",
               "name": "Chris O'Donnell",
               "profile_path": "/pjIwKa4AkgTzDO2Onz9dPn5KZTr.jpg",
               "id": 5577,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Henry Villard",
               "gender": 2,
               "credit_id": "52fe4523c3a368484e04a96f",
               "name": "Mackenzie Astin",
               "profile_path": "/vmcRaz9K4cX4iOUcMSHsLcw0Two.jpg",
               "id": 60060,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mabel 'Rosie' Rose",
               "gender": 0,
               "credit_id": "52fe4523c3a368484e04a973",
               "name": "Margot Steinberg",
               "profile_path": null,
               "id": 163951,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Porter",
               "gender": 2,
               "credit_id": "52fe4523c3a368484e04a977",
               "name": "Alan Bennett",
               "profile_path": "/ueTgrhepWRiIrDmAEfwcSE5riM0.jpg",
               "id": 55477,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Elsie 'Mac' MacDonald",
               "gender": 0,
               "credit_id": "52fe4523c3a368484e04a97b",
               "name": "Ingrid Lacey",
               "profile_path": null,
               "id": 1194461,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Triage Medic",
               "gender": 2,
               "credit_id": "5886f6989251411974004594",
               "name": "George Rossi",
               "profile_path": null,
               "id": 174382,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4523c3a368484e04a96b",
               "name": "Richard Attenborough",
               "profile_path": "/Abo8fAcdruACs344ut6PNSKH7N4.jpg",
               "id": 4786,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a368484e04a981",
               "name": "Allan Scott",
               "profile_path": null,
               "id": 589662,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a368484e04a987",
               "name": "Allan Scott",
               "profile_path": null,
               "id": 589662,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a368484e04a98d",
               "name": "Dimitri Villard",
               "profile_path": null,
               "id": 30855,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a368484e04a993",
               "name": "Clancy Sigal",
               "profile_path": null,
               "id": 16393,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4523c3a368484e04a999",
               "name": "Anna Hamilton Phelan",
               "profile_path": null,
               "id": 32795,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59bf6c95c3a368307500f0ab",
               "name": "Stuart Craig",
               "profile_path": "/iI9F5WDkTrkxMHlAdq9XVXkfP3i.jpg",
               "id": 5491,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.378789,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26949,
      "vote_count": 39,
      "budget": 0,
      "overview": "After teenage ambulance driver Ernest Hemingway (Chris O'Donnell) takes shrapnel in the leg during World War I, he falls in love with Agnes von Kurowsky (Sandra Bullock), a beautiful older nurse at the hospital where he's sent to recover. Their affair slowly blossoms, until Hemingway boldly asks Agnes to be his wife and journey to America with him. Richard Attenborough directs this drama based on the real-life experiences of the famed novelist.",
      "similar": [
         297762,
         143,
         4476,
         947,
         600,
         57212,
         314095,
         9772,
         26550,
         284689,
         2841,
         433,
         28966,
         256917,
         16442,
         907,
         9331,
         11646,
         8741,
         746
      ],
      "original_title": "In Love and War",
      "runtime": 113,
      "poster_path": "/eL8soncsWd57O4oHBiW9l3CP69Y.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dimitri Villard Productions",
            "id": 15846,
            "origin_country": ""
         },
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-12-18",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "In war they found each other...In each other they found love...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Attenborough"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Henry S. Villard",
         "James Nagel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116621/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3MTU5NTQ1OV5BMl5BanBnXkFtZTcwNzE0NDYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sandra Bullock, Chris O'Donnell, Mackenzie Astin | See full cast and crew »"],
      "reviews": [
         "For those of you who have read Hemingway, you will be surprised and captivated by the boyishness of the pre-war Hemingway that O'Donnell gives us so beautifully. The episodes in the life of the author that are covered by In Love and War are for the most part, not pretty. However, they give an insight into the writing of America's greatest author that no other movie of his work has ever done. Those who expected a movie version of A Farewell to Arms did not receive it, because the autobiographical In Love and War does not tell the same story that the semi-autobiographical book, A Farewell to Arms did. In Love and War is far closer to the truth, as other Hemingway scholars will attest. In that way, this movie is a valuable historical and biographical resource for people interested in Hemingway and his experiences in WWII Italy. If you are watching this movie just for fun, however, and not to gain insight into a book or an author's life, there is much here for you as well. Bullock and O'Donnell have a wonderful chemistry, and the lighthearted moments are weighed against a tale of great agony and suffering without being preachy or too painful. There are serious moments, when the reality of life and war come home to Ernest, and there are beautiful moments, when Catherine explores Italy. It's a wonderful mix of the dramatic and the light, without being overdone or showy. The realism is striking. I hope that everyone who watches this movie enjoys it as much as I did.",
         "There's something screwy in the Imdb ratings for this movie. Almost 25% of the votes are \"10\", yet its rating is \"5.8\"!! No way. This is a genuine 7 or 8 or 9 or 10 film, depending on your personal likes and dislikes. I give it \"8\". \"In Love and War\" is based on the real experience of 18-yr-old Ernest Hemmingway who could not get into the regular Army because of a problem in one eye. However, he made it to Italy as a journalist, and actually was wounded near the front lines. He fell in love with his nurse and they vowed to marry after the war. Hemmingway is played by Chris O'Donnel, which is my only 'beef' with the casting. Although he does a fine job, we all know that Hemmingway was a more gruff person and it never seemed realistic. Sandra Bullock plays the nurse and I liked her very much in this role. Anyway, when he gets sent back to the USA, she stays in Italy. She thinks she is in love with an Italian doctor and breaks off her pledge to Hemmingway. He doesn't take it well, he smashes up things, goes into a drinking depression and is never the same. Even after the nurse returns to say she is sorry and still loves him. His pride kept him from forgiveness, and presumably was responsible for his suicide in his early 60s. Overall a fine film about young men and women and their roles in the war, and its aftermath. The photography is beautiful and the dialog unifirmly well-structured.",
         "This is a true account of one phase of American author Ernest Hemingway's life. It is set during World War 1 and Hemingway is a soldier on the Western Front. He falls in love with a nurse and a woman who is older than him. This would be a normal love story but when you know that it was a real life episode it is better. However, things don't work out well in the end. Life does not have happy endings always. Good movie if you want to feel sentimental",
         "\"In Love and War\" is an exquisite film that, as any major work, tends to bring both praise and criticism. It is not a grand a film like \"Schindler's List\" or \"The English Patient\", nevertheless it remains as one of the greatest love films ever made, particularly because it tends to show the disappointment of this wonderful feeling in real life. After all it is based on a true story, the story of Hemingway's first (and arguably only) love. The film starts by showing a cocky and self-absorbed, 18 years-old, Ernest (Chris O'Donnell) who is more enthusiastic about being in the war as a soldier and not as a Red Cross volunteer, than actually realising the reality of the trenches. As a result he gets wounded the first time he approaches the front line, and the whole dream of fighting for the common good collapses for the protagonist. His misfortune, however, turns to his advantage. In the hospital he meets a stunning, 26 years old nurse, Agnes von Kurowsky (Sandra Bullock), an American Red Cross volunteer, who manages to save his wounded leg from amputation. The passion between the two seems inexistent at the beginning, and Ernie's declaration of love at first site sounds rather childish. Soon however, Ernie becomes The Kid, and Agnie the woman that loved him, though the script refuses to show the existence of too much chemistry between the two. After Ernie is sent home, Agnes decided that it was the \"Time to think with the head!\" and accepted a marriage proposal from Dr. Caracciolo (Emilio Bonucci). But, \"There was always someone else\", and after an eight-month period Agnes returns to America. Broken-hearted, matured, and evasive, Ernie lets the time pass slowly beside him, lets the words of his beloved woman vanish into the stillness of the forest. The ending is a memorable one, incredibly moving, and real. Love, pure or manufactured, it is not always made to bring happiness to those who are trapped by it.",
         "This is an amazing film with an ending that is so true to life... It deserves a 9/10 for portraying a side of reality which Hollywood rarely dares to show. One piece of criticism I have is that there is an implication at the end of the film that Hemingway suicided because of his failed relationship with Agnes. However, it is unlikely that this is the case. After writing brilliant pieces of literature, especially in the late 1920s, Hemingway's writing took a downward turn and he could no longer meet the high standards in the literature world that he, himself, had set. Depressed, he was often writing under the influence of alcohol in an attempt to 'enhance' his work. Nonetheless, these pieces were still unable to please his critics, and it was during this stage in his life that he committed suicide. For interest: Ernest and Agnes occasionally wrote to each other afterwards, but one of Agnes' boyfriends burnt the letters that Ernest wrote to her, including the his reply to her letter breaking up their love relationship.",
         "I have always thought of myself as a Sandra Bullock fan... How I missed this one I have NO IDEA! I finally saw this for the first time (yeah - I know the movies 8 years old) but I went through a whole box of Kleenex. Bottom line... I loved this movie... it spoke to the romantic in me... I haven't had a really good cry from a movie in a long time... I'm glad that I was able to see this and I can't wait to see if I can buy it.",
         "In Love and War is one of the greatest romance films ever. O'Donnell and Bullock shine in this sentimental melodrama about war and what it can do to love. O'Donnell is great as Hemingway and Bullock rocks as the nurse that falls for him. This movie is perfect for women and if you can get your hubbie to watch with you, well, that's good, too.",
         "Chris and Sandra are both wonderful even though the film moves rather slowly. An excellent glimpse of WWI and insight into Hemingway. A good film for a rainy day.",
         "I am a fan of Sandra Bullock, thinking she is one of the best actresses but receiving few parts to equal her potential. The story itself is based on the story behind Hemingway's, \"A Farewell to Arms\". This work would be of interest to anyone that has read the book and would like a little story behind the story. If for no other reason than to see Ms Bullock at her best, to appreciate the depth she can reach at her art, and to just enjoy a well written and acted movie I would recommend this for your collection. It's worth buying, you will want to see it again, later. I rated it a nine, I think the average is below six. I first saw it on the big screen and the VHS/DVD format does take away from the film. But, I have enjoyed watching it a few times and others that are familiar with \"A Farewell to Arms\" found the film to very moving. Also, it's a pleasure to see a film that is made for adults without being trashy. I never felt that I made a date uncomfortable showing it, and a lady always feels like a nice hug after a good tear jerker.",
         "I've seen a few movies only that moved me like \"In Love And War\". Probably due to my own life, I enjoyed this film as a moment of understanding - the young Ernest Hemingway who has hopelessly fallen in love with his nurse, Agnes von Kurowsky. Both actors (O' Donnell and Bullock) have proved their ability to do a great emotional show. Everything seems so true, so honest, so real. Anyone who has ever been desperately in love, doing things he/she shouldn't have done and takings risks that are obviously not worth taking them - those people do understand the meaning of love. And this movie shows love in war. And everything gets even more difficult for these two lovers who do not know how much surprises life will offer them..."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Dimitri Villard Productions",
         "New Line Cinema"
      ],
      "summaries": ["Reporter Ernest Hemingway is an ambulance driver in Italy during World War I. While bravely risking his life in the line of duty, he is injured and ends up in the hospital, where he falls in love with his nurse, Agnes von Kurowsky."],
      "budget": 0
   },
   "movielensId": 1398,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1996-12-18",
      "dvdReleaseDate": "1999-07-27",
      "directors": ["Richard Attenborough"],
      "runtime": 113,
      "movieId": 1398,
      "title": "In Love and War",
      "mpaa": "PG-13",
      "actors": [
         "Sandra Bullock",
         "Chris O'Donnell",
         "Mackenzie Astin",
         "Margot Steinberg",
         "Alan Bennett",
         "Ingrid Lacey",
         "George Rossi"
      ],
      "imdbMovieId": "0116621",
      "originalTitle": "In Love and War",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["DVEUGM3Scck"],
      "plotSummary": "After teenage ambulance driver Ernest Hemingway (Chris O'Donnell) takes shrapnel in the leg during World War I, he falls in love with Agnes von Kurowsky (Sandra Bullock), a beautiful older nurse at the hospital where he's sent to recover. Their affair slowly blossoms, until Hemingway boldly asks Agnes to be his wife and journey to America with him. Richard Attenborough directs this drama based on the real-life experiences of the famed novelist.",
      "tmdbMovieId": 26949,
      "avgRating": 3.13652,
      "releaseYear": "1996",
      "numRatings": 890,
      "posterPath": "/eL8soncsWd57O4oHBiW9l3CP69Y.jpg"
   }
}