{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "miami",
            "id": 416
         },
         {
            "name": "television",
            "id": 2136
         },
         {
            "name": "career",
            "id": 3658
         },
         {
            "name": "reporter",
            "id": 12193
         }
      ],
      "imdb_id": "tt0118055",
      "video": false,
      "title": "Up Close & Personal",
      "recommendations": [
         3784,
         12220,
         31633,
         6472,
         34014,
         25189,
         40001,
         12616,
         7300,
         23570,
         11062,
         10699,
         12280,
         40480,
         10337,
         15128,
         12714,
         27224,
         10333,
         21219
      ],
      "backdrop_path": "/lSqopM66LR4utpdcpGXE4jTghui.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Warren Justice",
               "gender": 2,
               "credit_id": "52fe44e4c3a36847f80b0457",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Tally Atwater",
               "gender": 1,
               "credit_id": "52fe44e4c3a36847f80b045b",
               "name": "Michelle Pfeiffer",
               "profile_path": "/vyoJV5QYwIGZohrPpKFdKc7EpSP.jpg",
               "id": 1160,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Marcia McGrath",
               "gender": 1,
               "credit_id": "52fe44e4c3a36847f80b045f",
               "name": "Stockard Channing",
               "profile_path": "/5UFMOfbzod42UiPUna59Ch1e37a.jpg",
               "id": 8893,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Bucky Terranova",
               "gender": 2,
               "credit_id": "52fe44e4c3a36847f80b0463",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Joanna Kennelly",
               "gender": 1,
               "credit_id": "52fe44e4c3a36847f80b0467",
               "name": "Kate Nelligan",
               "profile_path": "/4GpQvniLNMKF19qtHMb0tBBgNce.jpg",
               "id": 18794,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Ned Jackson",
               "gender": 2,
               "credit_id": "55bccfdf9251413e5500255f",
               "name": "Glenn Plummer",
               "profile_path": "/esZnjqw2WRA7zaX8SbJKGMp1xBg.jpg",
               "id": 2683,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "John Merino",
               "gender": 2,
               "credit_id": "55bccffec3a3686534002784",
               "name": "James Rebhorn",
               "profile_path": "/cRbeDNPpcWKP0nLkXo5Bi1tq61w.jpg",
               "id": 8986,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Rob Sullivan",
               "gender": 2,
               "credit_id": "55bcd0169251413e5500256a",
               "name": "Scott Bryce",
               "profile_path": "/5lWkYB3OYIKxZDRi7boYjUlL0O1.jpg",
               "id": 1218088,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Fernando Buttanda",
               "gender": 2,
               "credit_id": "55bcd02d9251413bdc000c8c",
               "name": "Raymond Cruz",
               "profile_path": "/4k0r3xJjgTac5GiJoHDDBVAFYcj.jpg",
               "id": 58650,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Luanne Atwater",
               "gender": 1,
               "credit_id": "55bcd04bc3a3683921000b42",
               "name": "Dedee Pfeiffer",
               "profile_path": "/9kgehqEvh92wzKzFpunMIckZTHf.jpg",
               "id": 91332,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "IBS Director",
               "gender": 2,
               "credit_id": "55bcd08bc3a3686528001e65",
               "name": "Michael Laskin",
               "profile_path": "/dt0nTgeDt8kfWWtpXvanE1L28q8.jpg",
               "id": 19454,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Merino's Secretary",
               "gender": 1,
               "credit_id": "55bcd0b89251413bed000c0c",
               "name": "Lorielle New",
               "profile_path": "/qfmEc3Z1gR5H5DBmeCJSvhTyfLy.jpg",
               "id": 102896,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e4c3a36847f80b0429",
               "name": "Jon Avnet",
               "profile_path": "/ckcE5lD7KNCh6iYHwCbfbs4r2y2.jpg",
               "id": 18250,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e4c3a36847f80b042f",
               "name": "Joan Didion",
               "profile_path": null,
               "id": 57219,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e4c3a36847f80b0435",
               "name": "John Gregory Dunne",
               "profile_path": null,
               "id": 57220,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e4c3a36847f80b043b",
               "name": "John Foreman",
               "profile_path": null,
               "id": 9578,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e4c3a36847f80b0441",
               "name": "Thomas Newman",
               "profile_path": "/nZSsNIrjbkqqxFYwsD3zcHskxdP.jpg",
               "id": 153,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e4c3a36847f80b0447",
               "name": "Karl Walter Lindenlaub",
               "profile_path": null,
               "id": 8677,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44e4c3a36847f80b044d",
               "name": "Debra Neil-Fisher",
               "profile_path": null,
               "id": 14189,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e4c3a36847f80b046d",
               "name": "Jon Avnet",
               "profile_path": "/ckcE5lD7KNCh6iYHwCbfbs4r2y2.jpg",
               "id": 18250,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.946364,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9302,
      "vote_count": 67,
      "budget": 60000000,
      "overview": "Tally Atwater has a dream: to be a prime-time network newscaster. She pursues this dream with nothing but ambition, raw talent and a homemade demo tape. Warren Justice is a brilliant, hard edged, veteran newsman. He sees Tally has talent and becomes her mentor. Tally’s career takes a meteoric rise and she and Warren fall in love. The romance that results is as intense and revealing as television news itself. Yet, each breaking story, every videotaped crisis that brings them together, also threatens to drive them apart...",
      "similar": [
         11355,
         1949,
         10774,
         3078,
         891,
         15,
         11615,
         496,
         714,
         565,
         80,
         1245,
         858,
         7461,
         9390,
         241,
         111,
         3176,
         15472,
         267192
      ],
      "original_title": "Up Close & Personal",
      "runtime": 119,
      "poster_path": "/2yf1pCiQk6JMy4k5zxf39YXQxGB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cinergi Pictures Entertainment",
            "id": 1504,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1996-03-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Every Day we Have, is One More Than We Deserve.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jon Avnet"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Joan Didion",
         "John Gregory Dunne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118055/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQ1NDAyMTExMV5BMl5BanBnXkFtZTcwNDIwMDIyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Redford, Michelle Pfeiffer, Stockard Channing | See full cast and crew »"],
      "reviews": [
         "The struggles in reporting the news are shown in such an interesting way in the 1996 movie, 'Up close and personal'. It also shows that a little bit of luck can help a person go a long way in an industry like that of TV journalism. This movie's story, which has a strong and very emotional romance within it, also has some surprising twists that I am sure people will not expect once they have watched it. Sally Atwater is fresh from a small-town trailer park when she arrives in Miami, overdressed and overeager to be the weather girl. He debut is disastrous but her boss, experienced newsman, Warren Justice, admires her spunk and takes her under his wing, making her an on air reporter. As Justice moulds Sally into one of the county's most sought after journalists, the pair fall in love, only to have their relationship threatened by the very success they have created. Here is one of the great romance movies I have seen in a longtime. I love the way that the main stars first meet and how their relationship develops. By the time that Tally is a great journalist, what is more important than her career, is the man that she loves that being Warren Justice. The screenplay for this movie was beautifully written by John Gregory Dunne and Joan Didion. I love how the two main stars are able to fall in love, but at the same time, able to do what they do as a career. Sure it might take a little while for the movie to show that this is important, but I feel that the time needed to be taken, so that both Tally and Warren fall deeply in love. The director of 'Up close and personal' was Jon Avnet, who has been a part of some great movies such as that of 'Risky Business', 'When a man loves a woman', and the 'Mighty ducks' trilogy. In this movie, I love the way that Avnet shows Tally Atwater at the start, to be someone who is a struggler, ignored and made fun of. Then to make her character be so vital and important in the whole make-up of the film, was great. This I believe is the good work of Avnet and makes the movie all the more compelling. I also like the world that Avnet has created for the film, that of the pressurised, TV journalism environment. The stars of the movie are two of Hollywood's better known actors in Robert Redford and Michelle Pfeiffer. The pair have a good chemistry in this movie, with the way that they fall in love very believable. I also like how Redford's character, Warren, refers to Tally at the start of the film, saying that 'she eats the camera'. This scene shows that Warren not only likes Tally as a journo, but as a woman as well. I also like the way that Pfeiffer appears in this film. She looks very much like a reporter does on the news and it is in her appearance that this needed to be so definite. The supporting cast of 'Up close and personal' is a pretty good one. I like Marcia McGrath (Stockard Channing), who is the tough as nails anchor girl, who is pushed out of her position by the rising career of Tally Atwater. She treats Tally pretty bad in the film, if the truth be known. I also like Joanna Kennelly (Kate Nelligan), who we find out is one of Warren's former wives. She is one of the reasons why Warren has had a turbulent journalism career. Do not discount the little role taken on by Tally's cameraman Ned Jackson (Glenn Plumber). He is an incredibly brave cameraman, who admires Tally for the work that she does. Trust me I would not have liked doing the camera work that he was doing in the prison. 'Up close and personal' might not have the greatest of sound tracks, but it does have one song that I really like. That song is 'Because you loved me' sung by Celine Dion. It is a song which was used well in the film and its lyrics suit this movie beautifully. How great a song this was, made me want to watch the film all the more. By the way, there is one scene in the movie that shows Pfeiffer's character singing 'The impossible dream' at an empty football stadium in front of Warren. All I will say about this is that Pfeiffer should stick to the acting game, because she does not sing that well. This movie, is such 'a good drama love story', because it shows how tough the 'TV journalism' area can be, and does not shrug away from showing how difficult and dangerous such a career can be (the prison scene is wonderfully shot and one of the great parts of the film). I also like how this movie concludes, and I am not afraid to admit that it has gotten me upset both times I have watched it. You will notice, that I say that Sally Atwater's name is actually 'Tally'. I will not reveal how this change happens, just to say that I like it. I believe it was placed in the story for a bit of fun. But I am not so sure I would like my name changed for my chosen career. Would you? CMRS gives 'Up close and personal': 4 (Very Good Film)",
         "\"Up Close and Personal\" proves again that charismatic stars and good production values can overcome a weak story. This story of two television journalists (Redford and Pfeiffer) has few surprises, no fresh insights about the news business, and its big moments are both predictable and overblown. Nevertheless, Redford and Pfeiffer provide enough star power to make for a reasonably entertaining couple of hours. There is one particularly funny line, though. When the Pfeiffer character says of a co-worker, \"He's so stupid!\" her boyfriend, the Redford character, with a quizzical expression on his face, says, \"He's an anchorman.\" 6 out of 10, marginally recommended.",
         "It's one the most sensible movie I have ever seen and I've seen a lot. Great...no.... excellent performance of Robert Redford and Michelle Pfeiffer creates a special romantic atmosphere. It's absoletely one of the most outstanding movie duet in the whole history of cinematografe. And some scenes make you heart stop for a moment, like in the news room during the editing or when she came to say him that she is going to Filadelphia. I recommend it to everyone who crazy about romantic movies. And be ready to feel all spectrum of feelings with positive emotions.",
         "I don't know how anyone could watch this movie and not love it. The line up of actors in the move are amazing and maybe that's why some people expected a different kind of movie. The movie moves a long perfectly, telling the story in a great time line. It doesn't drag and there is not one part of the story that doesn't fit. It's as if a friend is telling you the main highlights of a friends' love life. I gave it a ten - Redford an Pfieffer make a great, believable couple and you can tell they put their heart into this movie. They both play people who are intelligent and aren't afraid to fight for what they believe it, something we all strive for. Get a tissue, you'll need it.",
         "You know how there are some movies which you know you're not supposed to like but end up liking anyway? That perfectly describes this movie. This umpteenth re-telling of A STAR IS BORN is sappy, unbelievable(while previous \"Norman Maine\" characters are down because of alcohol, Redford's character is down because of his \"integrity.\" Yeah, okay), and contains an unbearable Celine Dion(of course, in my opinion, unbearable and Celine Dion is redundant, but that's my opinion). But darn it if the romantic chemistry between Redford and Pfeiffer doesn't make this worth watching. And say what you want about director Jon Avnet(and I'm not a fan of his), he knows how to direct actors. Joe Mantegna, Stockard Channing, and Kate Nelligan are all excellent here. You may not like yourself for liking it, but there you go.",
         "While this is definitely a \"women's movie,\" a man can enjoy this, too. I did, but not enough to see it twice or to purchase it. Supposedly, it's the story of former television news reporters Jessica Savitch and Ron Kershaw. Robert Redford is good at playing the veteran newsman teaching Michelle Peiffer (Savitch) the business. He does more than that, of course, being her lover and then her husband. With Redford, you know you are going to get a dose of Liberal politics in the mix and in here, it's let's-feel-sorry-for-the-prison inmates. The preaching is \"they are in jail to be rehabilitated.\" Well, that sounds nice but whatever happened to jail as a form of punishment for someone committing a crime against someone else? Liberals - like Redford, who is never shy about giving us his views in movies like this - sometimes seem to have more compassion for thugs than they do victims of crime! He goes so far in here as to preach that if you don't treat prisoners with kid gloves you deserve to have a riot on your hands. Outside of all that heavy-handedness, you get a nice romance with solid acting all around, not only from the two leads but the supporting case with people like Stockarrd Channnng, Joe Mantegna, Kate Nelligan, Glen Plummer and James Rebhorn.",
         "For the most part, I really liked this film (more on that later), so I was surprised to see it get such low ratings. In reading up on the film, I learned it was supposed to be based on the life of Jessica Savitch, a newscaster I remember quite well, although I forgot how she died. I have a feeling the producers/director were in a damned if we do, and damned if we don't situation here. They were inspired by Savitch's life story, but wanted to make a love story, instead. If they just told the love story, and weren't open about the Savitch angle, they'd be criticized. If they made it clear the story came from the Savitch bio, but didn't make it a documentary/fiction story, they'd be criticized as well. They should have just shut up about where the inspiration for the story came from. SPOILER SPOILER SPOILER Now, as to saying that I really liked this film, there is a huge \"except\" here. I see no reason in a romantic story like this to kill of one of the two major characters. Yes, I (and apparently most people) wanted a happy ending. I was disappointed to see Redford killed at the end...and I see no good reason that was the way it ended. The film just edged down a notch for me. But, perhaps the problem with the film is that when you begin watching it you think it's one thing -- a romance story with some humor...but then it turns deadly serious. Another thing that would have helped would have been some timelines, particularly in Tally's time in Miami. It was difficult to get a sense of how long it took her to go from desk work, to weather, to reporter, etc. The acting here is superb. Redford, who was pretty much always at the top of his game, was here, also. Michelle Pfeiffer is excellent, as well. It's too bad she's not been in such wonderful roles in recent years. This is very much Redford's and Pfeiffer's film. Sure there are supporting actors, but none that have memorable roles, although their performances are all very good. It seems as if this film suffered from a bit of an identity confusion. But I still liked it...very much...except for the ending.",
         "This is an incredibly romantic and moving film. The movie follows the amazing and powerful love between Tally (Michelle Pfeiffer) and Warren Justice (Robert Redford. Tally starts off as a minor and with no knowledge of the news broadcasting industry. Justice takes her under his wing and motivates her, teaches her, helps her and supports her. The love between these two deepens as a complete reversal of character positions occur. Justice begins to take a back seat to the rise and fame of Tally, but still their love and passion override. Their love is the type couples can only dream of having, unrequited, loyal and free of jealousy. This film captures attention from beginning to end.",
         "The film tries to give an idea of the difficulties of TV journalists to succeed and the problems they may face during the job. The director of the film seems to be interested of what may happen in Cuba, and the film touches partially the ethic of contra group in Miami. It also shows how mass media are always behind sensation of the news, sometimes sacrificing the life of the reporters, and this is what happened to Robert Redford, one of the heros of the film. This is not an easy film to be seen, but the argument is acceptable.",
         "Shallow Representation of a Shallow Industry (TV News). Robert Redford and Michelle Pfeiffer Leave Their A-Game Behind in this Soapy Weeper that Never Quite Hits the Right Notes. Nothing is Very Scathing, Although it Tries to be, About the Cut-Throat Entertainment of Television Journalism. Focus Groups and Ratings are at the Center of the Thing and Redford's Character Spends Most of the Film \"Telling it Like it is\" and of Course Nobody Wants to Hear it. But He Tries. Pfeiffer is Trying Also in a Difficult Role. She has to be Ditzy then Determined then a Pro. The Transition is Not Wholly Believable. The Production Values are Non Existent and Bland. The Middle with the Prison Riots Never Manages to be What it is Meant to be and the Political Messages in the Film are Heavy Handed and Obscure. The Muddled Story of the Racism and Incarceration Injustices are Never Convincing. Overall, a Chick-Flick that Almost but Never Quite has Enough Substance to be Anything More and the Movie is About Much More. The Premise is an Almost Always Interesting One and This One Went Softball Most of the Time and Hardly Lives Up to its Aspirations. It's Disappointing Considering the Star Power and What it Could Have Been and What it Delivers is Nothing but Average at Best."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Cinergi Pictures Entertainment",
         "Avnet/Kerner Productions"
      ],
      "summaries": [
         "This is a telling of the Jessica Savitch story, the newswoman who, in the 1970's, became the \"First Woman Anchor\". Sally/Tally is taken under the wing of Warren in a Miami newsroom and becomes a news star on TV. Despite her love for Warren, she takes the big chance and moves on to Philadelphia, where he follows to rescue her faltering career at the cost of his own - as she rises he falls.",
         "Sally Atwater is a young woman looking to become a star in the news and television industry. She sends out a tape to a lot of stations, but only one answers it. She first becomes a secretary, and Warren Justice later makes her a weather person, and then finally a real news person.",
         "An ambitious young woman, determined to build a career in TV journalism, gets good advice from her first boss, and they fall in love."
      ],
      "budget": 60000000
   },
   "movielensId": 140,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-01",
      "dvdReleaseDate": "1999-09-14",
      "directors": ["Jon Avnet"],
      "runtime": 119,
      "movieId": 140,
      "title": "Up Close & Personal",
      "mpaa": "PG-13",
      "actors": [
         "Robert Redford",
         "Michelle Pfeiffer",
         "Stockard Channing",
         "Joe Mantegna",
         "Kate Nelligan",
         "Glenn Plummer",
         "James Rebhorn",
         "Scott Bryce",
         "Raymond Cruz",
         "Dedee Pfeiffer",
         "Michael Laskin",
         "Lorielle New"
      ],
      "imdbMovieId": "0118055",
      "originalTitle": "Up Close & Personal",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["RiRUHeUhM3U"],
      "plotSummary": "Tally Atwater has a dream: to be a prime-time network newscaster. She pursues this dream with nothing but ambition, raw talent and a homemade demo tape. Warren Justice is a brilliant, hard edged, veteran newsman. He sees Tally has talent and becomes her mentor. Tally’s career takes a meteoric rise and she and Warren fall in love. The romance that results is as intense and revealing as television news itself. Yet, each breaking story, every videotaped crisis that brings them together, also threatens to drive them apart...",
      "tmdbMovieId": 9302,
      "avgRating": 3.30936,
      "releaseYear": "1996",
      "numRatings": 5644,
      "posterPath": "/2yf1pCiQk6JMy4k5zxf39YXQxGB.jpg"
   }
}