{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "addiction",
            "id": 6782
         },
         {
            "name": "family",
            "id": 18035
         }
      ],
      "imdb_id": "tt0117691",
      "video": false,
      "title": "Somebody Is Waiting",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Roger Ellis",
               "gender": 2,
               "credit_id": "57f988b3c3a3681b7f000e45",
               "name": "Gabriel Byrne",
               "profile_path": "/lFIH4De52Eg21m7pScPMXezZDUh.jpg",
               "id": 5168,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Charlotte Ellis",
               "gender": 1,
               "credit_id": "57f988bd92514120c500114d",
               "name": "Nastassja Kinski",
               "profile_path": "/4ru0isgjh43sPCpHMyXa0OuLkJn.jpg",
               "id": 2630,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Leon Ellis",
               "gender": 2,
               "credit_id": "57f988c6c3a3686fed001e68",
               "name": "Johnny Whitworth",
               "profile_path": "/xkeywGnloZXCsHjKz6eqbKoClrh.jpg",
               "id": 73589,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Lilli",
               "gender": 1,
               "credit_id": "57f988d7c3a3681a290010ca",
               "name": "Rebecca Gayheart",
               "profile_path": "/gOLs8kdC28ThCGK15zBgCUg8PQm.jpg",
               "id": 59967,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Irma",
               "gender": 1,
               "credit_id": "57f988e2c3a3686fff0020ab",
               "name": "Shirley Knight",
               "profile_path": "/ehtTPcvqq91Dxl7mtlzi0xJI6KP.jpg",
               "id": 28778,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Angie",
               "gender": 1,
               "credit_id": "57f988f292514120f900118e",
               "name": "Alix Koromzay",
               "profile_path": "/jMw17aRHTiDkzLINQ7w5lpKoPQr.jpg",
               "id": 14707,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Davis",
               "gender": 2,
               "credit_id": "57f988ffc3a3686fff0020c3",
               "name": "John Pyper-Ferguson",
               "profile_path": "/AiRGZDq2JZvmYyfLNMDt3FBAEhV.jpg",
               "id": 95638,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57f9890cc3a3681bff000f2d",
               "name": "Martin Donovan",
               "profile_path": null,
               "id": 1495632,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57f989149251411fb3001180",
               "name": "Martin Donovan",
               "profile_path": null,
               "id": 1495632,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.001316,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49799,
      "vote_count": 0,
      "budget": 0,
      "overview": "An alcoholic father must take control of his wayward children when their mother is killed.",
      "similar": [
         334,
         7972,
         1254,
         49519,
         8545,
         8272,
         7345,
         8967,
         2024,
         858,
         111,
         634,
         1164,
         13,
         73,
         88,
         142,
         773,
         2288,
         4347
      ],
      "original_title": "Somebody Is Waiting",
      "runtime": 96,
      "poster_path": "/wLXf3em7BOx3EnEECXI3fYwxNTH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Redhead Productions",
         "id": 17725,
         "origin_country": ""
      }],
      "release_date": "1996-12-19",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "When you're living on the edge, you never know which way you'll fall.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martin Donovan"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Martin Donovan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117691/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2OTI4OTY4Nl5BMl5BanBnXkFtZTcwNzczMjgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Gabriel Byrne, Nastassja Kinski, Johnny Whitworth | See full cast and crew »"],
      "reviews": [
         "Glimpses of brilliance and then, what is this? As if a nasty little virus had entered the system to ruin everything. There are moments of such poetry, faces with such power and then... I've heard there is another version floating around, I would love to see it. That may explain the mystery of this frustrating stew. Nastassja Kinski's face has never been so real. A mother's heart peeled in front of our eyes (and she's on the screen for only a few minutes) Gabriel Byrne's weakness, fear and pain are as sharp as anything I've ever seen him do. Johnny Whitworth makes us travel through the torturous roads of his own pain and confusion without asking us to, just by being there. It is a performance of great beauty, Shirley Knight and Brian Donovan are also standouts. And yet, the film leaves us with a sense of loss. As if we've fallen asleep in the middle of it and missed something important. If there is another movie inside this movie, please somebody, let it come out. I'm waiting!",
         "I was aware of the fluttering of wings, it was the movie trying to survive. The saddest, most in comprehensive mess of a film I've ever seen. The strangest thing is, you can't quite take it out of your mind. The faces of the actors are so compelling that you are left with the most frustrating sense of coitus interruptus I've ever experienced outside a bed. Nastassjia Kinski is the personification of a mother in a contemporary Brechtian slant. Gabriel Byrne has never been better, he fills his character with so much weakness and guilt that sometimes you have to look away. Brilliant! Johnny Whitworth, carrying his pain with shame and confusion is an amazing revelation. And yet, the film doesn't deliver any of the promises it seems to insinuate. The score is the the last nail on the coffin of this puzzling venture. What the hell happened here?",
         "I felt the need to see again this coming of age mess because I was haunted by those faces. Johnny Whitworth's pain is as vivid as it is beautiful. The frustration in Nastassjia Kinski's eyes is as piercing as it is recognizable. The weakness in Gabriel Byrne's brow is so real that made me uncomfortable. A man aware of his limitations but drinking the awareness away. Tiny, insignificant, talentless man and yet he manages to provoke a glimmer of compassion that becomes the central theme of the film: Forgiveness. The film seems to have been cut by the assistant chef of a third rate Chinese restaurant. Chop, chop, chop. I've been trying to find out the behind the scenes of this venture - I'm sure there is a story here - but I have found contrasting stories but more than anything, silence. The one thing in common from those I've been able to reach is an undiluted love and respect for the director and a profound loving memory of the experience.",
         "This movie left me with a bad feeling. But to see Gabriel Byrne's father role, succeed at making you feel like an adult child that had been soulfully, emotionally and sometimes physically abused, was impressive. I both cringed and found myself watching Byrne's every move throughout each scene he appeared in. I cannot say this movie was a success, but I can say it succeeded in pinpointing one's emotional roller coaster ride through a large family of siblings, alcoholism & ugly truths.",
         "**SPOILERS*** Getting himself into trouble since his dad Roger Ellis, Gabriel Byrne, split up with his mom Charlotte, Nastadssja Kinsky,some five years ago 18 year-old Leon's, Johnny Whitworth, actions of drinking and driving drunk will eventually land him either in the \"Big House\" or an early grave. It's when Charlotte decided, after kicking him out of the house, to straighting her troubled son out by opening up a bank account in his name that thing instead of getting better got worse! Showing up at the bank late and in the middle of a holdup Leon ended up being taken hostage with his mom, running to his aid, getting wasted in the process. Leon who ended up in a coma, after the bank robber's van overturned, found out the terrible news of his mother's death-by gunfire- a week later. With Leon and his four brothers and sister being alone without any means to support themselves \"Daddy O'\" Roger Ellis, now free from the court order imposed on him, came to the rescue in becoming the breadwinner of the family. Roger, a recovering alcoholic, tried at first to make a go of it by him, very unsuccessfully, trying to sober himself up. Roger immediately started overdoing his sloppy, and very unconvincing, apology act by constantly telling his children, whom he hasn't seen in years, how sorry he was in making a mess of himself their lives and his marriage to his wife the dearly departed Charlotte Ellis. It's later when Roger, who had since got over his insecurities, started to feel good about himself that he fired, without as much as giving her any references for future jobs, the family housekeeper and part-time nanny Irma Cill, Shirley Knight. The now very sure of himself Roger still felt that Irma was a threat to his steel grip control of the Ellis' family matters and wanted her out of the house. It didn't take long for Roger to really, and with a vengeance, start hitting the bottle and make a complete fool of himself going so far as insisting that Leon was responsible, in being late at the bank, for his mom's murder! Smacking the very passive Leon around Roger ended up being shoved to the ground and in his very drunken state landing on his head and suffering a fatal brain concussion! With only his brother Clayton, Brian Donavon, a deft mute as a witness all Leon could do is bury his dad in the backyard and hope, in that nobody being interested in looking for him, he'll never be found! But unfortunately for Leon, with the help of a neighbor's dog, he was! On the run from the law, after the cops let him slip through their fingers, Leon is now in danger of doing something really stupid and end up killing himself if he doesn't come to his senses and turn himself into over police. We all know that Leon is innocent of his father's death but he'll never be able to prove it, with his brother Clayton as an eye witness, if he's not alive to tell it to a court and jury! It's then that a miracle happens starting with the pot smoking trucker David Korsack, John-Pyper Ferguson,who after almost running him down saved Leon's life. There's also Leon's girlfriend Llli, Rebecca Gayheart, who also came to Leon's side when he was at his most suicidal. But last but not least it was Leon's mother Charlotte, coming back from the dead, who finally convinced her very troubled son that life s worth living no matter how bad it is. ***SPOILER*** Really cool ending with Leon looking like he's tripping out on LSD seeing the light as both his dead mom-Charlotte- and live girlfriend-Lilli-gently guide him back down to earth to face the music, his father's accidental death, of what he did.",
         "Martin Donovan, who also directed the quirky \"Apartment Zero\" among others, wrote and directed \"Somebody is Waiting\", a film with so much potential that is never fulfilled. Johnny Whitworth of \"Empire Records\" stars here (and is very flat) as a young teenage delinquent. His mother (the beautiful Nastassja Kinski, who could almost pass as his girlfriend) is a suffering mother of many other children. His girlfriend (Rebecca Gayheart, who should have STAYED a Noxema girl) is worried about him. And his father (Gabriel Byrne) is an abusive man who left the family years ago. This all could be some silly melodrama or a powerful family drama...but this one is the silly melodrama that it shouldn't have been. Ambitious, yet very bad. Two Stars Out of Four.",
         "A difficult movie to watch once that certainly does not merit a second viewing. Some aspects of \"Somebody Is Waiting,\" are frankly boring and almost akin to having to endure someone dragging their fingernails across a blackboard. A dysfunctional family is held together by the mother, Nastassja Kinski, but she is killed off within twenty minutes and then the viewer has to endure her highly despicable husband until he too dies accidentally. Even though she is no longer amongst the living, Nastassja's presence in flashback and voiceovers is the glue that holds this movie together. \"Somebody Is Waiting\" is a melodrama that is suffocating and has the lightness of a five hundred pound lead weight."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Redhead Films"],
      "summaries": ["Leon is a good hearted boy who can't stay out of trouble. When a tragic turn of events costs his mother her life, Leon's abusive and alcoholic father returns to \"take care of\" Leon, his two brothers, and his sister. Leon is haunted by guilt over believing he caused her death, and because he hadn't told her he was sorry. His father still drinks, and it gets worse, culminating in an argument with a drunken Roger Ellis (the father) and Leon, ending with Roger dead. Leon tries to take care of his family, but the death is quickly discovered and Leon goes on the run, more from himself than from the law. As the police try to find him, Leon finally discovers that he shouldn't fear the love of others, and should except forgiveness."],
      "budget": 0
   },
   "movielensId": 1400,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-19",
      "dvdReleaseDate": null,
      "directors": ["Martin Donovan"],
      "runtime": 96,
      "movieId": 1400,
      "title": "Somebody Is Waiting",
      "mpaa": "",
      "actors": [
         "Gabriel Byrne",
         "Nastassja Kinski",
         "Johnny Whitworth",
         "Rebecca Gayheart",
         "Shirley Knight",
         "Alix Koromzay",
         "John Pyper-Ferguson"
      ],
      "imdbMovieId": "0117691",
      "originalTitle": "Somebody Is Waiting",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "An alcoholic father must take control of his wayward children when their mother is killed.",
      "tmdbMovieId": 49799,
      "avgRating": 3.41026,
      "releaseYear": "1996",
      "numRatings": 39,
      "posterPath": "/wLXf3em7BOx3EnEECXI3fYwxNTH.jpg"
   }
}