{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "trial",
            "id": 11038
         },
         {
            "name": "civil rights",
            "id": 163116
         },
         {
            "name": "activist",
            "id": 208647
         }
      ],
      "imdb_id": "tt0116410",
      "video": false,
      "title": "Ghosts of Mississippi",
      "recommendations": [
         67307,
         27224,
         40480,
         72096,
         91445,
         9422,
         21219,
         75531,
         5762,
         34390,
         107258,
         88818,
         17978,
         123770,
         44568,
         106143,
         16219,
         18551,
         31361,
         18856
      ],
      "backdrop_path": "/oRN8ngvcFeYOCuhU5IhuU469UTH.jpg",
      "revenue": 13323144,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bobby DeLaughter",
               "gender": 2,
               "credit_id": "52fe44a69251416c9101828b",
               "name": "Alec Baldwin",
               "profile_path": "/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg",
               "id": 7447,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Byron De La Beckwith",
               "gender": 2,
               "credit_id": "52fe44a69251416c9101828f",
               "name": "James Woods",
               "profile_path": "/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg",
               "id": 4512,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dixie DeLaughter",
               "gender": 1,
               "credit_id": "52fe44a69251416c91018293",
               "name": "Virginia Madsen",
               "profile_path": "/opdvsRunQgmw5AuGGpyAnQCz0q8.jpg",
               "id": 12519,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Myrlie Evers",
               "gender": 1,
               "credit_id": "52fe44a69251416c91018297",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ed Peters",
               "gender": 2,
               "credit_id": "52fe44a69251416c9101829b",
               "name": "Craig T. Nelson",
               "profile_path": "/mhKSd2uLhNX7TahlNhwJgDYMRwN.jpg",
               "id": 8977,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Charlie Crisco",
               "gender": 2,
               "credit_id": "52fe44a79251416c9101829f",
               "name": "William H. Macy",
               "profile_path": "/cYmHYCGxkOVZgu2oDyhF6lKgfaj.jpg",
               "id": 3905,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Peggy Lloyd",
               "gender": 1,
               "credit_id": "5468f9f8eaeb816b430013ef",
               "name": "Susanna Thompson",
               "profile_path": "/rqM3mLVmu4ZgXTDmD8nDDmo9SxY.jpg",
               "id": 62547,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Burt DeLaughter",
               "gender": 2,
               "credit_id": "5468fa0922136e68cc0013ac",
               "name": "Lucas Black",
               "profile_path": "/41qZZc6vRVm5ZOoXWfEf5NGoIZR.jpg",
               "id": 155,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Drew DeLaughter",
               "gender": 0,
               "credit_id": "5468fa19eaeb816b5200154e",
               "name": "Joseph Tello",
               "profile_path": null,
               "id": 1386078,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Claire DeLaughter",
               "gender": 1,
               "credit_id": "5468fa28eaeb816b52001555",
               "name": "Alexa PenaVega",
               "profile_path": "/aHABeErlMgzBkrMSaHOsZFsNlhV.jpg",
               "id": 57674,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a79251416c910182a5",
               "name": "Rob Reiner",
               "profile_path": "/2zw9Iq9uo4vZiTQNQWdNFwbA1TA.jpg",
               "id": 3026,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5468f9de22136e68d2001387",
               "name": "Lewis Colick",
               "profile_path": null,
               "id": 52035,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.670836,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31908,
      "vote_count": 50,
      "budget": 36000000,
      "overview": "Ghosts of Mississippi is a drama covering the final trial of the assassin, Bryon De La Beckwith, of the 60s civil rights leader Medgar Evers. It begins with the murder and the events surrounding the two initial trials which both ended in a hung jury. The movie then covers District Attorney, Bobby DeLaughters transformation and alliance with Myrlie Evers, wife of Medgar Evers, of the, as he becomes more involved with bringing Beckwith to trial for the third time 30 years later. Some of the characters are played by the actual participants in this story.",
      "similar": [
         390043,
         787,
         101,
         389,
         1538,
         186,
         6637,
         667,
         1948,
         657,
         27582,
         121856,
         249070,
         156022,
         403,
         1645,
         682,
         866,
         1592,
         13885
      ],
      "original_title": "Ghosts of Mississippi",
      "runtime": 130,
      "poster_path": "/eG4VUHBAfukZ5uc7MLxa6xBWg0e.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         }
      ],
      "release_date": "1996-12-20",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "From the director of A FEW GOOD MEN comes a compelling TRUE STORY.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Rob Reiner"],
      "runtime": 130,
      "synopsis": null,
      "writers": ["Lewis Colick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116410/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDA1MDk0OTExN15BMl5BanBnXkFtZTcwNTA2MzMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Alec Baldwin, James Woods, Whoopi Goldberg | See full cast and crew »"],
      "reviews": [
         "THIS FILM IS BASED ON A TRUE STORY. Not only was the real Myrlie Evers consulted while making the film, two of her and Medgar's sons were actually in the film, playing themselves. Benny Bennett also played himself. It was based on a actual (although little known) event in American history, and shows how there are still conflicts over civil rights today. We also learn that there are still some people in the Southern U.S. that are opposed to laws that have been in place for over 35 years. So while watching this you shouldn't think \"the story is cliche\" or \"the acting was good, but predictable,\" you should be thinking that this actually happened, and reflecting on how far we've come as a society, and how far we still need to go.",
         "Based on fact and directed by Rob Reiner, Ghosts recounts the investigation, and retrial in 1994 - after two mistrials in the 60s - of Byron de la Beckwith for the racist shooting in 1963 of Medgar Evers, an NAACP activist. The film has gained renewed topicality with the recent conviction of another white supremacist for the Birmingham, Alabama, Baptist Church bombing, also in 1963. Alec Baldwin gives a solid, and sometimes stolid, performance in the central role of prosecuting DA, Bobby DeLaughter (pronounced DeLaw), himself from Mississippi's white uppercrust, whose marriage hits the rocks because of his pursuit of the case. James Woods, convincingly made up to look over 70 for most of the movie, is electrifying as the arrogant, hateful Beckwith. Whoopi Goldberg portrays Medgar's widow with a lot of dignity and even a touch of humour, but it would have been understandable if she had also displayed a little more bitterness. The movie is possibly not as powerful as Reiner hoped, partly no doubt because he was restricted by the facts. In particular, the retrial seems to have thrown up little or no new evidence, thus making the courtroom action less dramatic than in a fictional movie. Perhaps a greater criticism is that the intense focus on Baldwin/DeLaughter, who is in almost every scene, tends to turn him into the hero of the movie; whereas it should be Medgar Evers, who as a civil rights activist in one of the most bigoted areas of the USA deserves everyone's undying admiration. Despite the movie's flaws, it is gripping for most of its 130 minutes, and this was certainly a story worth telling.",
         "I've seen this movie several times on the pay channels (the joys of modern television!). Overall the film is pretty good, and doesn't seem to take great license with history, which is refreshing. My only serious beef about this movie is the same as with Mississippi Burning and other films about the civil-rights struggle: Why do all of these movies insist on providing a white male central character, out to do good for the oppressed black people? Why not do this movie from the POV of Evers' widow, or brother? Because the (white male) power structure in Hollywood feels that audiences won't relate to stories without having a WASP in the middle of the action. This is not to minimize Bobby DeLaughter's role in bringing Byron de la Beckwith to justice; it's just to say that DeLaughter came along very late in the overall history of this case. So, as to be expected, we're shown that DeLaughter braves ostracism, family conflict, and a death threat (probably a lot of them in real life). All very true, but we lose the fact that the Evers family went through all of this and more in 30 years of keeping the flame alive. There are some good performances in here, especially James Woods, who had to be having a blast playing de la Beckwith, a mental midget and virulent racist in real life too. Baldwin is okay as DeLaughter but as bland as he normally is, even while affecting the Delta accent. Whoopi Goldberg is very good as the contemporary Myrlie Evers Williams, but ridiculous as the young widow in the flashback sequences. She's obviously too old, and it leaves you wondering if they were just too cheap to pay another actress or if Goldberg's ego is so large that she wouldn't allow it. The actor who played Evers' brother is so outstanding in such a small amount of screen time, you have to wonder why they didn't do more with him. It's not a bad movie by any stretch, and it does give us a chance to see a little of what Medgar Evers was all about. I only wish that the film had been more about Medgar and Myrlie and much less about DeLaughter. As one other reviewer commented, this feels more like a made-for-TV movie than a theatrical release.",
         "Strong performances from Alec Baldwin, James Woods, Whoopi Goldberg, Craig T. Nelson, Bill Smitrovich and William H. Macy makes \"Ghosts Of Mississippi\" one of the best movies I have seen. \"Ghosts Of Mississippi\" deserved an oscar in every single category that one can be given in because it was that good. I never knew the story of Medgar Evers before I saw this film; but, I learned a lot through watching the film. I hope everyone has the same experience and opportunity I had when I saw this movie because it is one history lesson that should be seen rather than read in history books or newspaper archives. I was truly honored to watch this film. There are several reasons this film is a success; one of them are the performances. \"Ghosts Of Mississippi\" is each actors best film of their career bar none. Alec Baldwin brings intensity, aggressiveness and never say die attitude to his role as Bobby DeLaughter. Whoopi Goldberg stars as Myrlie Evers, widow of Medgar Evers, who with relentless pursuit of justice re-opens this murder case. Finally, James Woods stars as Byron De La Beckwith, the defendant, who with great conviction and sincerity brings the essence of the real person to the surface. As great as Baldwin and Woods are in this they do not hold a candle to Goldberg who gives not only the best performance in the film, year but I dare say the best performance of the decade of the 90's. The second reason why this film remains on my short list of best films are the messages that brought up. For example, equality for all and the fact that any discrimination will not be tolerated under any circumstances. Another message I got from this film was under no circumstances should anybody underestimate the power of tenacity because it will make dreams come true every time. This film was thought-provoking, brilliant and compelling. In addition, \"Ghosts Of Mississippi\" will move you to tears, put a smile on your face and anger you because these are the emotions I felt watching this movie. Combined with the excellent ensemble performances, brilliant script and messages this film had \"Ghosts Of Mississippi\" is one film you can't miss. Two thumbs way up.",
         "Medgar Evers' tragic murder in Jackson, Mississippi, was overshadowed by the cold-blooded killing of three civil rights workers near Philadelphia, Mississippi, a year later. So too this film has been overshadowed by an earlier movie, \"Mississippi Burning,\" about the Philadelphia homicides. I was even confused by the similar titles and accidentally rented \"Ghosts of Mississippi,\" thinking it to be the earlier film. This is too bad because \"Ghosts of Mississippi\" is a winner all the way and Medgar Evers' assassination was as significant, if not more so, than the later dastardly acts of hate and malevolence. Most of my generation remember one of Dylan's early recordings he wrote called \"Pawn in the Game\" about the Medgar Evers murder in which Dylan asserts that the coward who pulled the trigger and shot the civil rights leader in the back in front of his wife and three children was carrying out what the racist elements in Mississippi and in the nation as a whole had brainwashed the simple mind into executing. That the endemic racism in American was the real perpetrator of the heinous deed which deprived our society of one of its gifted leaders. \"Ghosts of Mississippi\" concentrates more on the scumbag who squeezed the trigger, played with élan by James Woods, almost a carbon copy of the killer in both speech, mannerisms, and looks. James Woods is a member of a strong cast led by Whoopi Goldberg as the widow, Myrlie Evers, spending her life seeking a degree of justice for her husband and children. William H. Macy adds much needed humor in the role of Charlie Crisco, a member of the prosecution team. Unfortunately, his part is mainly limited to the middle section of the movie. Why director Rob Reiner and writer Lewis Colick decided to turn Macy's character into a cameo during the latter part of the film is unclear. A subplot in the film is the growing involvement of prosecutor Bobby DeLaughter (Alec Baldwin) in the case, opening his eyes not only to the past evils of the society in which he lives but also hostile residue left by the civil rights movement in the state. Married to the daughter of one of Mississippi's most racist judges causes him to be blind to much of the injustice prevalent around him. Significantly, his wife is named Dixie (Virginia Madsen). The change that takes place in his character (which also involves a change in wives) as he is drawn deeper into the thirty-year-old case is pinpointed by his inability to continue to sing \"Dixie\" to his daughter to chase away the ghosts she sees at night. In explaining to her that the song might actually be encouraging the ghosts to reappear in her bedroom, the two opt for \"Old McDonald\" as a more suitable goodnight song.",
         "Impressive drama about the assassination of 1960's civil rights leader Medger Evers, which was fought in courts for 30 years until it was re-opened in the 1990's with Mississippi D.A. Bobby DeLaughter (Baldwin) leading the charge to bring assassin Byron De Lay Beckwith (Woods, in a juicy Oscar nominated role) to justice. Goldberg is especially standout as Ever's widow who fought for the truth for over 30 years. Rob Reiner's film may run a little long for some, but the excellent cast and realistic story will keep you glued until the end.",
         "Glossy but highly effective thriller based on the true story of an attempt to bring a racially motivated killer to trial. The film suffers from a certain liberal obviousness: brave, charming white man (who loves his kids) and dignified black widow fight side by side for justice; but it's always compelling, and pertinent too. No magic, then, but a strong story: one of director Rob Reiner's better efforts.",
         "Rob Reiner's 'Ghosts Of Mississippi' is a golden opportunity, gone wrong. Though based on a disturbing yet moving story, the on-screen interpretation doesn't hold you completely. 'Ghosts Of Mississippi' is based on the true story of the 1994 trial of Byron De La Beckwith, a white supremacist accused of the 1963 assassination of civil rights activist Medgar Evers. Rob Reiner knows his job. He is a very talented storyteller, and his direction even in here is good. But, the writing has many loopholes. As mentioned, the true-story, doesn't get it's due. The writing in the first hour doesn't work and bores. Sure, the climax is dramatic & effective, but the damage is already done by then. John Seale's Cinematography is alright. Peroformance-Wise: Alec Baldwin as Bobby DeLaughter does fairly well. James Woods is very impressive as the conniving Byron De La Beckwith, while Whoopi Goldberg as Myrlie Evers is fair. Virginia Madsen is wasted. William H. Macy and Craig T. Nelson are okay. Others lend able support. On the whole, A golden opportunity gone wrong. At best, An Average Fare!",
         "SPOILERS. The movie has been criticized for a number of reasons. One is that, like \"Mississippi Burning,\" it gives us white men as heroes. But that's not particularly bothersome. African-Americans in the South and elsewhere provided most of the leadership in the civil rights movement, and they did almost all the bleeding, but as been argued insistently political and social power has traditionally been vested in whites. So it's kind of interesting when an agent of social change comes from the very class that is liable to have to give up some of its power if that change occurs. \"We want our share of the pie\" is a perfectly reasonable argument. A reply like, \"Here, take some of ours,\" draws attention to itself. The movie itself isn't badly done. Events follow one another logically. We get to know the characters a little bit. The score isn't overdone, though it's perfunctory. But it's as if the film were a six pack with all the cans there but without the plastic thing that holds them all in place. Like many recent works from Rob Reiner, James Bridges, and Ron Howard, it leaves a viewer feeling good but also sensing opportunities that have been lost somewhere. The problems aren't with the acting. Alec Baldwin is such an unpretentious guy, for a leading man, that it's hard not to like him whatever he appears in. (On a TV talk show he once made fun of himself by describing how his high school classmates on Long Island humiliated him and called him \"Baldy.\") He may never give a bravura performance but he doesn't fail to deliver the goods. The other cast members are at least adequate with the exception of James Woods, who rises distinctly above adequacy. Yes, it's a variation of his usual cocky and dominating character, but here he gives it a twist that smacks of red eye gravy, to such an extent that at time we can believe this is Byron de la Beckwith being arrogant, not just James Woods. Whoopy Goldberg is stiff. And therein lies a large part of the problem. The characters inhabit, at best, a kind of two-dimensional flatland. Baldwin is driven by a desire to shake himself and his community of the past and has problems at home. Goldberg is proud and suspicious of whites. Woods has only one dimension to play with. The script and the direction doesn't really give anyone a chance to do much more than enact the simplest of character traits. Goldberg suffers most. Her widow speaks in starchy tones -- \"Perhaps,\" she says, when all the other characters are saying, \"Maybe.\" \"Good afternoon, Gentlemen.\" Her expression hardly wavers from one scene to the next. And her finally turning over the transcripts of the first trial to Baldwin is a no-brainer. It's presented to us as a triumph for her and for the story and for justice. She finally overcame her suspicion of Baldwin, see. But nothing is made of the fact that for the first ninety percent of the film's time she is torpedoing the second trial by holding the documents back. (Why didn't she Xerox them and give them a copy?) Her saintly status is an assumption made by the director, the writers, and the actress. What a burden it must be to represent an entire race of people and be plugged into a role that must radiate sanctity. Still, it's a feel-good movie and it's usually nice to feel good. The injustices of the past can never be rectified but sometimes corrective adjustments can be made in our current social worlds. And it still takes guts to take a position like DeLaughter and Morris Dies do in this film, even if the film itself goes down as smoothly at Metamucil. I wonder how many people watching this movie find this all to be ancient history -- the segregation, the intolerance, the hatred. It must be rather like watching the corrupt and perverted politicians in \"Gladiator.\" Did people really act that way? Yup. They did. And it's not ancient history either. I was refused service in restaurants in three locations in the South during the 1960s because of my accent, a beard, and because a companion was wearing a sweatshirt with the name of a Northern college on it. (I'm guessing at the reasons because no one ever handed us a note beginning, \"These are the reasons you are being politely ignored.\") There are times when I think of how far the South has come from such traditions -- and in such a relatively short time -- that I believe Southern whites should be congratulated for having come around, not without resistance and not without violence, but without guerilla warfare anyway. There are certain lifestyles that we can now rejoice are all gone with the wind. Not a bad movie. It's a fascinating story and I wish it had been done better.",
         "This could have been a pretty good ninety minute film. Unfortunately it is 130 minutes and the extra 40 minutes is almost fatal. There is an important story being told, that is somewhat dulled by way too much extraneous material, along with some distracting family distress, and child coddling. Less would have been best in the case of \"Ghosts of Mississippi. The acting by Alec Baldwin, Whoppi Goldberg, and especially James Woods is totally acceptable, but the movie drags on way too long. I realize being based on fact, the writers were somewhat restricted, but I would have preferred a leaner story, without the distracting extras involving wives and children. - MERK"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Columbia Pictures Corporation"
      ],
      "summaries": [
         "Ghosts of Mississippi is a drama covering the final trial of Byron De La Beckwith (Woods), the assassin of the 1960s civil rights leader Medgar Evers. It begins with the murder and the events surrounding the two initial trials which both ended in hung juries. The movie then covers District Attorney, Bobby De Laughter's (Baldwin) transformation and alliance with Myrlie Evers (Goldberg), the widow of Medgar Evers, as he becomes more involved with bringing Beckwith to trial for the third time 30 years later. Some of the characters are played by the actual participants in this story.",
         "Medgar Evers is a black civil rights activist in Mississipi, who was killed by a gunman. It is later suspected that Byron De La Beckwith, a racist, is the killer and he would be tried a couple of times and both trials ended in hung juries. For more than 30 years, Evers' widow Myrlie has been trying to bring De La Beckwith to justice and she believes that she has what it takes to bring him to trial again. However, most of the evidence in the old trial have disappeared but Bobby De Laughter, an assistant D.A., decides to do what he can to help her despite being warned that it might hurt his political aspirations and the strain it's causing on his marriage.",
         "The widow of murdered civil rights leader Medger Evers and a district attorney struggle to finally bring the murderer to justice."
      ],
      "budget": 36000000
   },
   "movielensId": 1401,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-20",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Rob Reiner"],
      "runtime": 130,
      "movieId": 1401,
      "title": "Ghosts of Mississippi",
      "mpaa": "PG-13",
      "actors": [
         "Alec Baldwin",
         "James Woods",
         "Virginia Madsen",
         "Whoopi Goldberg",
         "Craig T. Nelson",
         "William H. Macy",
         "Susanna Thompson",
         "Lucas Black",
         "Joseph Tello",
         "Alexa PenaVega"
      ],
      "imdbMovieId": "0116410",
      "originalTitle": "Ghosts of Mississippi",
      "genres": [
         "History",
         "Drama"
      ],
      "youtubeTrailerIds": ["8KvsMfiSWYg"],
      "plotSummary": "Ghosts of Mississippi is a drama covering the final trial of the assassin, Bryon De La Beckwith, of the 60s civil rights leader Medgar Evers. It begins with the murder and the events surrounding the two initial trials which both ended in a hung jury. The movie then covers District Attorney, Bobby DeLaughters transformation and alliance with Myrlie Evers, wife of Medgar Evers, of the, as he becomes more involved with bringing Beckwith to trial for the third time 30 years later. Some of the characters are played by the actual participants in this story.",
      "tmdbMovieId": 31908,
      "avgRating": 3.5293,
      "releaseYear": "1996",
      "numRatings": 1570,
      "posterPath": "/eG4VUHBAfukZ5uc7MLxa6xBWg0e.jpg"
   }
}