{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "illiteracy",
            "id": 2073
         },
         {
            "name": "country life",
            "id": 2755
         },
         {
            "name": "post",
            "id": 3804
         },
         {
            "name": "brittany",
            "id": 4025
         },
         {
            "name": "bourgeoisie",
            "id": 4029
         },
         {
            "name": "class society",
            "id": 4034
         },
         {
            "name": "female friendship",
            "id": 5248
         },
         {
            "name": "pregnant minor",
            "id": 5808
         },
         {
            "name": "gallery owner",
            "id": 5916
         },
         {
            "name": "maid",
            "id": 13097
         },
         {
            "name": "family",
            "id": 18035
         }
      ],
      "imdb_id": "tt0112769",
      "video": false,
      "title": "La Cérémonie",
      "recommendations": [
         8286,
         2912,
         2282,
         64559,
         20330,
         2527,
         75733,
         27030,
         142373,
         72277,
         17376,
         60971,
         49559,
         22161,
         29268,
         63691,
         82550,
         63322,
         90560,
         45213
      ],
      "backdrop_path": "/qOCSFIwvbJjPu1NbPCZb4sZvGfq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "52fe4316c3a36847f80392c9",
               "name": "Sandrine Bonnaire",
               "profile_path": "/i8Os6hHPZKyDQerX4qtG6njCcDN.jpg",
               "id": 19161,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jeanne",
               "gender": 1,
               "credit_id": "52fe4316c3a36847f80392c5",
               "name": "Isabelle Huppert",
               "profile_path": "/wGG9v1Uci3sfrbjt0bRXkLrTqjY.jpg",
               "id": 17882,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Georges Lelievre",
               "gender": 2,
               "credit_id": "52fe4316c3a36847f80392cd",
               "name": "Jean-Pierre Cassel",
               "profile_path": "/yWIAIvRdx0omV9ZOUwLINzHKois.jpg",
               "id": 19162,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Catherine Lelievre",
               "gender": 1,
               "credit_id": "52fe4316c3a36847f80392d1",
               "name": "Jacqueline Bisset",
               "profile_path": "/ys2YfG4d26jUiGvok0jplWgUhzP.jpg",
               "id": 14061,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Melinda",
               "gender": 1,
               "credit_id": "52fe4316c3a36847f80392d5",
               "name": "Virginie Ledoyen",
               "profile_path": "/t9TdJUerLsUD766Q2dN9tJ4dRCG.jpg",
               "id": 19163,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gilles",
               "gender": 0,
               "credit_id": "52fe4316c3a36847f80392d9",
               "name": "Valentin Merlet",
               "profile_path": "/xaFLgExlZTqJkAJdgaw8hON7ny1.jpg",
               "id": 16353,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jeremie",
               "gender": 2,
               "credit_id": "52fe4316c3a36847f80392dd",
               "name": "Julien Rochefort",
               "profile_path": "/4vyIL8piz9ewT9ogiASCAUoC55E.jpg",
               "id": 19164,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Madame Lantier",
               "gender": 0,
               "credit_id": "52fe4316c3a36847f80392e1",
               "name": "Dominique Frot",
               "profile_path": "/3Fn0RdzkzLfhgoHKMFBWLa5sR20.jpg",
               "id": 19165,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Priester",
               "gender": 0,
               "credit_id": "52fe4316c3a36847f8039315",
               "name": "Jean-François Perrier",
               "profile_path": "/g8ACmmqTCFfXEye8Rs0uoEXV5NM.jpg",
               "id": 13694,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4316c3a36847f80392c1",
               "name": "Claude Chabrol",
               "profile_path": "/tsG0YNUREk7fGVaDKpwvuFBi59O.jpg",
               "id": 19069,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4316c3a36847f80392e7",
               "name": "Marin Karmitz",
               "profile_path": "/t9KgqeBerwxwnSkvkvlapJ8gcSS.jpg",
               "id": 1134,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4316c3a36847f80392ed",
               "name": "Christoph Holch",
               "profile_path": null,
               "id": 11939,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4316c3a36847f80392f3",
               "name": "Ira von Gienanth",
               "profile_path": null,
               "id": 11246,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4316c3a36847f80392f9",
               "name": "Matthieu Chabrol",
               "profile_path": null,
               "id": 19167,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4316c3a36847f80392ff",
               "name": "Bernard Zitzermann",
               "profile_path": null,
               "id": 19168,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4316c3a36847f8039305",
               "name": "Monique Fardoulis",
               "profile_path": null,
               "id": 19169,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4316c3a36847f803930b",
               "name": "Corinne Jorry",
               "profile_path": null,
               "id": 19070,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4316c3a36847f8039311",
               "name": "Daniel Mercier",
               "profile_path": null,
               "id": 19170,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4316c3a36847f803931b",
               "name": "Ruth Rendell",
               "profile_path": null,
               "id": 3791,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4316c3a36847f8039321",
               "name": "Claude Chabrol",
               "profile_path": "/tsG0YNUREk7fGVaDKpwvuFBi59O.jpg",
               "id": 19069,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4316c3a36847f8039327",
               "name": "Caroline Eliacheff",
               "profile_path": null,
               "id": 67533,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.05696,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 1802,
      "vote_count": 52,
      "budget": 0,
      "overview": "Sophie, a quiet and shy maid working for the upper-class family Lelievre, hides her illiteracy under the cloak of a perfect household and obedience. She finds a friend in the energetic and uncompromising postmaster Jeanne, who encourages her to stand up against her bourgeois employers. Things start to escalate as the Lelievres find out that Sophie can't read and has brought Jeanne into their house against their wish.",
      "similar": [
         2977,
         290762,
         228194,
         1254,
         5544,
         393764,
         1549,
         5168,
         44925,
         119281,
         20019,
         8071,
         260487,
         474353,
         392587,
         411557,
         417977,
         121700
      ],
      "original_title": "La Cérémonie",
      "runtime": 111,
      "poster_path": "/13ERRUQYR5Mz6YChJEH0RlPpaBN.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Olga Film GmbH",
            "id": 7930,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Prokino Filmproduktion",
            "id": 439,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zweites Deutsches Fernsehen (ZDF)",
            "id": 4606,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MK2 Productions",
            "id": 6274,
            "origin_country": "FR"
         }
      ],
      "release_date": "1995-08-30",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Chabrol"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Ruth Rendell",
         "Claude Chabrol"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0112769/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwOTUzNzI0Nl5BMl5BanBnXkFtZTcwNzM1MDYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Isabelle Huppert, Sandrine Bonnaire, Jacqueline Bisset | See full cast and crew »"],
      "reviews": [
         "I don't know much about Claude Chabrol's cinema. I've seen seven or eight of his dozens of films, but I remember them quite well, especially \"Violette Nozière\", \"Le boucher\" and \"La rupture.\" Many years after these, \"La cérémonie\" is a serene work, the construction of a mature man who avoids making artificial judgments or explaining motivations of his characters, and tending traps to his audiences to keep them interested in what he's narrating. In an economic way, with well-chosen details he gives us everything needed in a story that deals with psychological disturbances and profound social disparity. I do not see this movie as a thriller nor do I see the connection with Alfred Hitchcock. While Hitchcock could almost ruin his forays into psychological landscapes (like Simon Oakland explaining Norman Bates' behavior in \"Psycho\" or placing clues that led to nowhere) and very rarely treated social issues, Chabrol prevents from recurring to psychological clichés and gives us subtle gestures to illustrate the \"class struggle\": the way the rich daughter returns the handkerchief to the post-office clerk after cleaning her filthy hands; the way the post-office clerk throws back an envelope to the bourgeois father. A few times Chabrol is not so subtle and he shows tension even between persons of the same class: the way the poor maid and the post-office clerk despise the miserly charity of an old Catholic couple, the way the rich father protests when giving his son a ride to school... Using this strategy, all the portraits are compassionate: the members of the rich family seem as pleasant as the two poor women when they share the little they have. When the climax arrives -the daughter of the bourgeois family discovers (part of) the maid's secret and, in return, the maid reveals she also knows something about the young woman- there is little else Chabrol can add, but only guide us to the conclusion. Maybe there is a much too obvious cut from the two women with no food at home, to the dinner table where the rich family finished a tasty meal. That's all we need, in case we want an explanation to why the way the two women act in the last scenes. All the elements are there for us to find answers or make interpretations if we want to do so. Not too many filmmakers today treat audiences as intelligent human beings and invite them to participate in the creative process adding the absent information, with the benefit of more than a century of cinematic tradition and \u0096if we care- reflections on the way things are today in imbalanced societies. When \"La cérémonie\" was over, I was very pleased: not only did I watch a movie directed with brains, but I felt treated with respect by Claude Chabrol. Not frequent in much of today's cinema, a respectful film has great merit.",
         "In \"La Cérémonie\" one of my favourite actresses, Virginie Ledoyen, not only gets to play a vital role, but also share a movie with her favourite actress (Isabelle Huppert). Huppert plays the other vital role. A rich family is looking for a housekeeper. They choose Sophie (Sandrine Bonnaire), a slightly cold woman. Much sooner than the family we find out why she's so cold: she can't read. Her employers are Georges Lelièvre and his second wife. They have a son and (from his previous marriage) a daughter Melinda (played by Virginie). Melinda looks at Sophie as somebody who helps around the house (rather than 'the maid' as her parents call Sophie). Every now and then Melinda tells Sophie she shouldn't let her father walk over her. Melinda likes her father, but thinks of him as a fascist. She isn't the only one: the lady from the postal office (Jeanne, Huppert's role) thinks so too. But soon we find out she hates all the people with money. Georges hates Jeanne too: he's sure she opens and reads his mail. He also mistrusts her because her child was badly burnt (even though Jeanne was cleared - because there was no proof she wounded her child on purpose). But wait, there's more: Sophie's father died in a fire. Sophie was interrogated, but soon dropped off the suspects' list. Sophie and Jeanne feel there's a bond between them because of their past (\"nobody could prove we had anything to do with it\"). The longer Sophie knows Jeanne, the ruder she becomes. Director Claude Chabrol doesn't pass judgment. He doesn't tell us whether Jeanne and Sophie are guilty or not. He only shows them how this affects the rest of their lives and of the lives of the Lelièvre family. Because it soon becomes clear that Jeanne wants revenge and tries to get Sophie on her side. Jeanne is revengeful and full of contempt, Sophie gets ruder all the time, Georges expects too much of Sophie and his wife is incredibly posh. You don't get angels in this movie. But it is Melinda who is crucial to how you watch this film (she's the most 'normal' character). Melinda is the bridge between her parents and Sophie. It's Melinda who finds out Sophie's secret. And Melinda is the person responsible for the crescendo and denouement of the film. Chabrol films this in his usual style: the camera likes to slide around the house. It observes. The viewer is the one who can decide who's to blame more for what happens. The viewer is always right. (Wait a second... no, I'll take that back.)",
         "Claude Chabrol, one of the leading lights of the French New Wave, faded into a series of unimaginative throwaway flicks and obscurity (peppered with moments of worthiness such as Blood Sisters )until storming once again into the limelight with this claustrophobic psycho-thriller adaptation. Like Heavenly Creatures and Fun this film is anchored around the destructively intense relationship between two female leads: the apparently insipid family housemaid Sophie (Sandra Bonnaire) and the sparky but cumulatively obnoxious postmistress Jeanne (Isabelle Huppert). They both, it transpires, have potentially murderous secrets in their past involving the incineration of unwanted relatives (a child and a father). After a roundabout, deliberately vague \"confession\" to each other they erupt into childish laughter and it seems their relationship is cemented in their mutual utter lack of remorse. There is no guilt felt by either woman for any of their crimes be it spite, neglect, theft, opening other's mail, arson or even murder. This is because, primarily though Jeanne's obsessive class angst and Sophie's obsessive paranois, they justify their stance and actions with an \"us against them the world\" self-righteous fervour. Jeanne describes all her - increasingly erratic - behaviour as \"a good deed\" and the equaly unstable Sophie believes her. Every role is acted impeccably by some of the leading lights of French cinema. Along with Bonnaire and Huppert, arguably the best French actresses working today, Jacqueline Bisset plays the bourgeouse lady of the house for whom Jeanne works. She sees herself as a kind and understanding employer, providing glasses and a television for her taciturn domestic. However this gesture is interpreted as patronising by the illiterate Jeanne. It's through minot details such as this that character exposition arises . The two principals are painted with tiny, finely detailed brushstrokes while everyone around them is painted with broad strokes. This intentional disparity brings us uncomfortably closer to the unhinged worlds of Jeanne and Sophie. Worlds which are revealed slowly, subtly and manipulatively. La Ceremonie is based of a Ruth Rendell novel, \"Judgement in Stone\". Rendell is an archetypal British writer and I think that if La Ceremonie was a British film with British actors and a skilful British director it would have been a very different, darker and more disturbing movie. Having said this, Chabrol, with his distinctly French sensibilities and post nouvelle vague expertise brings other qualities to the story and makes this a remarkable film. Chabrol avoided darkness for the sake of it in favour of a highly sophisticated level of characterisation and build-up. The climax, however it was filmed, could never be anything less than shocking. Ultimately la Ceremonie presents a pessimistic view of humanity: bleak, depressing and disturbing. Even Bisset's family don't come off well with their selfishly consumereist and blinkered middle class lifestyles.This and the high degree of audience manipulation means the film leaves a bad taste in the mouth but there's no denying it's an egregious work of art.",
         "This is one of those films that I happened upon, late one night and I could not take my eyes off of it. The characters are very enigmatic and I kept hoping that more would be revealed about the two lead characters (Bonnaire and Huppert)shadowy past experiences. Claude Chabrol demonstrates his ability to be France's Alfred Hitchcock with this picture. I kept wondering where the direction of this story was going and I was shocked at the turn of events at the ending. It was a film that had me guessing, at certain points, surprised at other points, but the main feeling was intrigue. I kept wondering what was going to happen next and what each turn of events might mean. The minute that it was over, I am thinking, I don't know if I liked this film or not, but I know I want to watch it again. Like I've already stated, while watching this movie, you get the feeling that something sinister is waiting around the corner, your just not really sure what it is going to be or how it's going to manifest.Sandrine Bonnaire, Isabelle Huppert and Jacqueline Bisset are all excellent in their roles and carry their performances very well. A very intriguing and enigmatic film.",
         "I watched this on video without reading the plot summary on the video box (or the user comments here), and I highly recommend seeing it without knowing too much about the plot. It is a gripping, Hitchcockesque character portrayal that slowly builds great tension and a sense of foreboding. Let all the clever foreshadowing pique your imagination; the ending will be that much more effective.",
         "In this character study of two hateful middle-aged women (not so middle-aged in the movie, however, as in the novel by Ruth Rendell) we are made to fathom the bad that may befall the good. Claude Chabrol's direction is clean, crisp and uncluttered--which isn't always the case, witness his Madame Bovary (1991), which is a bit too leisurely and L'Enfer (1993) which muddles a whole lot. Maybe it's the editing. Anyway this is more like his quietly brilliant Une affaire de femmes (1988) with a fine script and striking performances by Sandrine Bonnaire and Isabelle Huppert, handsomely supported by Jacqueline Bisset, Jean Pierre Cassel and the very pretty Virginie Ledoyen. Bonnaire plays Sophie, an intense taciturn woman harboring dark secrets, whom the Leliévres have hired to cook and keep house at their country home. Bisset is Catherine Leliévre and Cassel her husband. They exist in bourgeois heaven avec matrimonial bliss with two teenagers, a family so closely knit and so charmingly together that they watch a two-part production of Mozart's Don Giovanni on TV, just the four of them cosily on the couch. Well, this sort of unobtainable happiness doesn't sit well with Jeanne (Huppert) who is a lowly postal clerk living alone whose past includes the (accidental?) killing of her four-year-old daughter. Jeanne takes a fancy to the Leliévre's strange new maid with the idea of showing her something besides work. They strike up a fateful friendship that we know is leading to something horrible. Huppert is as good as I've seen her, which is very good indeed. She is particularly striking here in an uncharacteristic role as a spiteful, working class woman with a heart of vengeance against anybody better off than she is. There is just a touch of sly irony in her performance suggesting that she is having a particularly good time playing the nasty. Bonnaire's stark performance as the unbalanced and humorless, reclusive Sophie will remain etched in your brain. Apart they are like inert, harmless chemicals. Together they catalyze one another and become brazen and explosive. The story, filled with little foreshadowing of the tragedy to come, gilds the lily of our tristesse by making the Leliévres so very, very nice. We are reminded of the violent hatred by the proletariat toward the privileged classes, in this case acted out by two loonies against an innocent, but representative family, echoing not only the Russian Revolution but even more so the French Revolution, now two hundred years old. What I am trying to figure out why this is called La Cérémonie. Maybe it is a ceremony of execution. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "I love Sandrine Bonnaire. Not love her in the \"sell my possessions and move to Paris\" love her, but love her in movies. In this movie especially. Every second she is on the screen, I was riveted to her. Her somewhat jerky and stiff physical mannerisms, her plain but beautiful face. And even though from the start we sense that her character is odd, creepy even, we can also feel her almost childlike panic and pain early on when we learn she can't read. It's enormously moving, and it creates a sympathetic bond with her that complicates how we view the events that follow. I just love her, and that probably clouded my overall estimation of the film. That's not to say the film is otherwise weak. It's not. The exploration into the class conflict between the rich and their help was excellent. And so was the portrayal of the sociopathic personality, shifting from sweet smiles to cold-bloodedness in a process devoid of emotion. Chilling, especially so when the sociopath is a waifish beauty. It's a very good movie made great by Sandrine Bonnaire's performance.",
         "I think that by the end of this film there can be no doubt that both women carry homicidal tendencies. Their 'revenge' on the family was brutal and thoroughly undeserved in my opinion. The family themselves are a paradigm of a modern, loving unit. The parents are happy to let their children drive, smoke and have boyfriends back to the house, they dine together and occasionally sit down together to watch opera on their enormous television. They are well off and bourgeois, but they do not treat Sophie with disrespect. Even upon discovering her illiteracy Melinda is sympathetic and offers help, although it could have been perceived as patronising by the ever victimised Sophie. If there has to be a villain within the family then it is the father. He complains about her once or twice and tries to ban Jeanne from the house. It is he, also, who fires her in the end, but this decision is justified in my opinion after her underhanded behaviour towards Melinda. If the family are innocent then Jeanne and Sophie certainly are not. At first Sophie is presented sympathetically: struggling to pronounce 'pouvez' alone in her room with a children's' reading book, and we share in her relief when the note she is agonising over is read aloud. This sympathy is instantly lost, however, when she is discovered and tries to blackmail Melinda. It appears to be Jeanne's influence which turns her into such a rebel. It is Jeanne who instigates the ridiculous purging of people's donations in the name of the 'Secours Catholiques', and it is in reference to Jeanne's ban from the house that Sophie remarks 'Je ne vais pas l'obeyir' (I am not going to obey him). They also ransack the house at the end as a pair. They are capable of acting as rebels alone: Jeanne's reaction to the father's complaint at the post office, Sophie eavesdropping on Melinda's conversation, but the end proves that it is when they are together that they become the most extreme. It is Sophie who fires the first shot, suggesting that she is not just under Jeanne's influence, but that she is also a driving force in the couple's actions. As regards an 'us vs them' ideology, possibly alluring to some sort of socialist revolutionary slant on the film, there is some evidence certainly: the contrast between her rickety 2CV and the cars that the family drive, and the fact that Sophie is under their employ to begin with shows a level of social hierarchy. But as for the oppression of the proletariat, there is no evidence that Sophie is shown any disrespect, their revolution to me is more of a cold blooded massacre. In order to have an us versus them scenario there has to be some opposition on each side; this situation appears more of an 'us ambushing them unprovoked'. The fact that Jeanne is killed and that the tape recorder is found is not to show the plight of a futile revolution, but instead to provide justice, to show that shooting a whole family for no good reason does not go unpunished. Instead of the idea of an 'us vs them' struggle, I saw the film as a played out inferiority complex. Sophie was convinced they were out to get her because of her illiteracy, and she built up such a victimised view of the world that it was impossible to conceive of that people were prepared to look past it. Although obviously capable of violence on her own, given her suspect past, it is the meeting with Jeanne, who has an irrational hatred of the rich, and a similar paranoia that they hate her back, that acts as the catalyst for the blood bath finale.",
         "Based on Ruth Rendell's Judgment in Stone, French auteur Claude Charbol transplanted this quintessentially English thriller about class and guilt to France, where he can fire more bullets at his favorite target - the French bourgeoisie. Without giving too much away, the story unfolds at a slow pace to reveal the class divisions and complex psychological issues that drive the characters' motivations. Centring on an illiterate maid, Sophie, who goes to desperate lengths to hide her \"disability\" from her employers, the wealthy Lelievre family, she eventually strikes a bond with the local postmistress who has mysterious grudge against her friend's employers. This film provided Chabrol with plenty of opportunities to criticize the disaffected bonhomie of the Levlievre family, but at times his presentation of some members of the Levlievres actually enlists our sympathy and therefore strikes a blow to the validity of his critique of French bourgeoisie values. Perhaps this was his intent to create more ambiguity than most psychological thrillers in this genre would allow. It's worth watching for the climax alone which has a delicious twist worthy of a mass-market Hollywood sequel.",
         "Did anyone see \"Murderous Maids\"? I saw that before I saw this and felt it had the same sinister undertones. \"Murderous Maids\", also French and yet a true story came out a few years ago in 2002 I think and \"La Ceremonie\" came out in 1995. I honestly felt extremely disturbed when I watched this movie,(maybe because I saw the aforementioned one first!) esp. when the two women went back \"collect Sophie's things\" from her former employer after she was fired for both women to become this Thelma & Louise to get revenge on the family. That is the product of good acting of course and the rest of the cast was perfect. Jacqueline Bisset spoke French like a native speaker. Also you knew they were both up to no good when they seemed to bond closer to the beginning of the movie although Sophie is more reluctant to reveal much about getting away with murder which wasn't \"proven\" than Isabel Huppert's character. Both admit their \"sins\" to each other in a dry accusatory way which makes them trust each other. It seems like the characters were all connected in a commentary of class, charity and the attitudes present in this very \"homogenous\" (to use Jacqueline Bisset's character to describe the opera they later watch) French society-- like the priest, the people donating old clothes and the sort of hypocrisy of the Catholic Church feeling guilty about \"helping the poor\"--characters over and over saying \"it's good to help the poor\" yet the two main \"bad girl\" characters are volunteers at a church not because they are religious but because they want the old cast offs from the rich. Nevertheless the resentment boils over from all the suspicions from the outside and deep seated in them so that they want to get revenge on the richer than they are as some sort of twisted justice which only results in non-fulfillment and frustration, symbolic first as in Sophie's inability to read and write and brings them nowhere."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "France 3 Cinéma",
         "MK2 Productions",
         "Olga Film GmbH"
      ],
      "summaries": [
         "The upper-class owner of a gallery, Catherine Lelievre, hires the efficient and quiet maid Sophie to work in the family manor in the French countryside. Her husband Georges Lelievre, who is an opera lover, her daughter Melinda and her teenage son Gilles welcome Sophie and appreciate her work. Sophie soon befriends the postmistress Jeanne, who is a bad egg and encourages Sophie to rebel against her employers, but the maid stays submissive. However, Sophie is ashamed of a secret and feels uncomfortable in many situations, finding a way to hide her secret. When Georges tells Sophie that he does not want Jeanne in his house, Sophie stands up to him. Melinda discovers her secret and Sophie blackmails her, but Melinda tells her parents what happened. Georges fires Sophie and she returns to the house later with Jeanne on the rampage.",
         "Sophie, a quiet and shy maid working for the upper-class family Lelievre, hides her illiteracy under the cloak of a perfect household and obedience. She finds a friend in the energetic and uncompromising postmaster Jeanne, who encourages her to stand up against her bourgeois employers. Things start to escalate as the Lelievres find out that Sophie can't read and has brought Jeanne into their house against their wish.",
         "Catherine, a rich woman of Brittany, engage Sophie as maid for her great house. Sophie is illiterate but nobody know it, and she has shame of it. She become friend with Jeanne, the post office employee, a woman not very sane, jealous about Catherine and her husband Georges."
      ],
      "budget": 0
   },
   "movielensId": 1406,
   "movielens": {
      "languages": [
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1995-08-30",
      "dvdReleaseDate": "2004-07-27",
      "directors": ["Claude Chabrol"],
      "runtime": 111,
      "movieId": 1406,
      "title": "La Cérémonie",
      "mpaa": "",
      "actors": [
         "Sandrine Bonnaire",
         "Isabelle Huppert",
         "Jean-Pierre Cassel",
         "Jacqueline Bisset",
         "Virginie Ledoyen",
         "Valentin Merlet",
         "Julien Rochefort",
         "Dominique Frot",
         "Jean-François Perrier"
      ],
      "imdbMovieId": "0112769",
      "originalTitle": "La Cérémonie",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sophie, a quiet and shy maid working for the upper-class family Lelievre, hides her illiteracy under the cloak of a perfect household and obedience. She finds a friend in the energetic and uncompromising postmaster Jeanne, who encourages her to stand up against her bourgeois employers. Things start to escalate as the Lelievres find out that Sophie can't read and has brought Jeanne into their house against their wish.",
      "tmdbMovieId": 1802,
      "avgRating": 3.6144,
      "releaseYear": "1995",
      "numRatings": 389,
      "posterPath": "/13ERRUQYR5Mz6YChJEH0RlPpaBN.jpg"
   }
}