{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "terminal illness",
            "id": 6564
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "death",
            "id": 34079
         }
      ],
      "imdb_id": "tt0116240",
      "video": false,
      "title": "The Evening Star",
      "recommendations": [
         110598,
         54481,
         206537,
         36996,
         73587,
         63956,
         84152,
         42250,
         5228,
         25697,
         39140,
         39467,
         69645,
         18553,
         42176,
         41806,
         39472,
         40933,
         1363,
         78406
      ],
      "backdrop_path": "/9qu0OF45gslLPWsLsti7I4e5p0G.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Aurora Greenway",
               "gender": 1,
               "credit_id": "52fe44099251416c91002c97",
               "name": "Shirley MacLaine",
               "profile_path": "/faG5S4EOVaGHNf1CwZryGcHCE4e.jpg",
               "id": 4090,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Garrett Breedlove",
               "gender": 2,
               "credit_id": "52fe44099251416c91002c9b",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jerry Bruckner",
               "gender": 2,
               "credit_id": "52fe44099251416c91002c9f",
               "name": "Bill Paxton",
               "profile_path": "/53Ln1wTC0OCLzBF4HNlwhMXYgOU.jpg",
               "id": 2053,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Melanie Horton",
               "gender": 1,
               "credit_id": "52fe44099251416c91002ca3",
               "name": "Juliette Lewis",
               "profile_path": "/eeEx3v5ElBHvlrJjULlj5I3EpPF.jpg",
               "id": 3196,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Patsy Carpenter",
               "gender": 1,
               "credit_id": "52fe44099251416c91002ca7",
               "name": "Miranda Richardson",
               "profile_path": "/kTs3t6pnO3zR7WYSVYzQfJ9yKMW.jpg",
               "id": 8436,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Arthur Cotton",
               "gender": 2,
               "credit_id": "52fe44099251416c91002cab",
               "name": "Ben Johnson",
               "profile_path": "/yqPEXD23jLYxmCCLNWtyQ3tJ89V.jpg",
               "id": 8258,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Bruce Burgess",
               "gender": 2,
               "credit_id": "52fe44099251416c91002caf",
               "name": "Scott Wolf",
               "profile_path": "/y5NBlTvKDIe2csxZeeYv6ooM8rN.jpg",
               "id": 24965,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Tommy Horton",
               "gender": 2,
               "credit_id": "52fe44099251416c91002cb3",
               "name": "George Newbern",
               "profile_path": "/kUFci5BzhMyx3ZNQEvpauRmpMyT.jpg",
               "id": 59222,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Hector Scott",
               "gender": 2,
               "credit_id": "59096c889251411ce90082b4",
               "name": "Donald Moffat",
               "profile_path": "/8kZ2Ow3cPtTmDwTxL7jFEsQi4ia.jpg",
               "id": 15417,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "59096c9fc3a36835fc007647",
               "name": "Jennifer Grant",
               "profile_path": "/xzhl6x2FI06X5urvw8syvQytmYU.jpg",
               "id": 151356,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Teddy Horton",
               "gender": 2,
               "credit_id": "59096cb6c3a36835710080f4",
               "name": "Mackenzie Astin",
               "profile_path": "/vmcRaz9K4cX4iOUcMSHsLcw0Two.jpg",
               "id": 60060,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44099251416c91002cb9",
               "name": "Robert Harling",
               "profile_path": null,
               "id": 68319,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44099251416c91002cbf",
               "name": "Larry McMurtry",
               "profile_path": "/krz4pkRlT0FLYxrtndNnyOTVSOq.jpg",
               "id": 1807,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44099251416c91002cc5",
               "name": "Robert Harling",
               "profile_path": null,
               "id": 68319,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.852322,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30285,
      "vote_count": 20,
      "budget": 0,
      "overview": "Continuing the story of Aurora Greenway in her latter years. After the death of her daughter, Aurora struggled to keep her family together, but has one grandson in jail, a rebellious granddaughter, and another grandson living just above the poverty line.",
      "similar": [
         205,
         281957,
         238615,
         238636,
         334541,
         452507,
         40807,
         201085,
         112160,
         13,
         806,
         345920,
         341006,
         2252,
         4141,
         4771,
         9654,
         431,
         10285,
         23483
      ],
      "original_title": "The Evening Star",
      "runtime": 129,
      "poster_path": "/oU0Y04XTz4lPf3il6i4SCK1bLPa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         }
      ],
      "release_date": "1996-12-25",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Terms of Endearment Collection",
         "id": 507956,
         "poster_path": "/mSQGmUz0jbe6rGxjUsm5Ee4PPVb.jpg"
      },
      "tagline": "The continuing story of 'Terms of Endearment'.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Harling"],
      "runtime": 129,
      "synopsis": null,
      "writers": [
         "Larry McMurtry",
         "Robert Harling"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116240/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwNjkyODQyN15BMl5BanBnXkFtZTcwMzk0MTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Shirley MacLaine, Bill Paxton, Juliette Lewis | See full cast and crew »"],
      "reviews": [
         "Now when this movie first came out, no one really saw it. Critics gave it bad reviews. Part of the issue was the original Terms of Endearment was made back in 1983. So when some of the cast came back 13 years later, it can lose some of its box office draw. However, the time that passed actually made this movie more believable as the characters had also aged. Shirley MacLaine reprises her role and does a nice job, trying to raise her dead daughter's children. The movie stays grounded by dealing with everyday issues as well as getting older and the trials of a non-traditional family. Paxton plays a nice role in this film adding a little flare to the shadowing plot of Shirley MacLaine's character getting older. Nicholson's return, although brief, helped this film round itself out. See this one only if you see Terms of Endearment first. Best Scene: Nicholson and MacLaine re-living the past on the beach.",
         "Synopsis: The continuing adventures of Aurora Greenway and her tumultous family life, are further explored in this sequel to the 1983 classic. With her three grandchildren fully grown, they all have their own personal problems to face alongside Aurora. The Review: Just not meant to happen. Contrived is what comes to mind when viewing this sequel with Bill Paxton, Scott Wolf, and Jack Nicholson among the famous actors making walk on appearances. Overlong and underwritten, the film misses the interest of the original, not to mention any inkling of James L. Brooks' involvement. There's no Danny DeVito, and no Jeff Daniels (which is very odd considering he was the father of the three but is omitted from the film). Nowhere near as good as the first. Grade: C-",
         "\"The Evening Star\" is one of those movies that you can watch many times. It contains more laughs then \"Terms of Endearment\" and also less depth. But if you watch this movie in the observation that it is solely entertainment, and not to be taken seriously, it's a lot of fun. Aurora Greenway (Shirley MacLaine- reprising her Oscar winning role) is now dealing with her three grown Grandchildren. One is a saint, Teddy, who is already married with child. Tommy, the \"problem child\" of the original film, is in prison. And Melanie (Juliette Lewis), the youngest, is struggling through college because she's going through a rebellious phase and likes hanging out with her sleazy boyfriend, or mooching off Patsie (Miranda Richardson), the now very rich divorcée. There's also the loyal housekeeper Rosie (Marion Ross), who despite always being on her duties and quick to have a sarcastic comeback, is falling in love with the next door neighbor Arthur (Ben Johnson- in his last screen performance). All of this is a little hokey, but the performances more then make up for it. When Aurora starts seeing a therapist (Bill Paxton) and then sleeping with him, people start whispering about her reputation. And when Melanie keeps going back and forth between her relationship, she finally finds peace with Aurora, who she at first despised. \"The Evening Star\" is by no means superior to \"Terms of Endearment\". That movie is a landmark in it's own right. But it is more fun- in my opinion. MacLaine, in a funny performance, seems more lively and witty here then her original time around. And the most fun of all is to watch her and Miranda Richardson go at it - almost like \"Grumpy Old Men\"- but FUNNIER. A scene in an airplane perfectly displays their hatred for one another- but in a way, they are best friends- since they're always around each other, competing, gossiping or nagging. To wrap it up, it's a long movie with a lot of unnecessary subplots (the death toll was ridiculous), but keep in mind this is also based on the book, so do we blame the filmmakers or the author? \"The Evening Star\" is a movie that should be watched for a good laugh. You don't have to have seen the first one to understand it. True, Debra Winger is missing (but if you saw the first film you'd know why), but I am rating this solely on how well it entertained me.",
         "While Shirley McLaine remains ever the strong willed Aurora, what makes this film wonderful is the fact that she continues her relationship with her grand children much as she did with her daughter, and somewhere along the way in both movies the children come to realize that while she may make you want to bang you head against a wall, there isn't anyone that loves and supports you more! I have an even greater respect for my mother and the education she gave me. Yet Aurora still manages to make the same mistakes we all make. Love is not an easy road traveled. This movie brings humor to that road, tears just like the original movie. I will agree the airplane scene was over the top, but I loved the scene with Jack Nicholson on the beach with the car going through the surf. I have never read the books, but now I really want to. One interesting fact - almost every star in this movie is a daughter or son of someone in Hollywood - Teddy was Patty Duke and John Astin's son. Tommy's wife is Cary Grant and Diane Cannon's daughter, Teddy's wife is someone from Jefferson Airplane's daughter. Even Lewis has an acting father - although she has made her own name in the business.",
         "This movie had two major problems to contend with: being a sequel and being an adaptation, and the two problems were very related. First of all, \"Terms of Endearment\" the novel and \"Terms of Endearment\" the movie have huge differences. (Garrett Breedlove isn't even in the book and Rosie was married with several children.) What I think is great about \"The Evening Star\" is that it tries to hold true to the book and the first movie. Perhaps most importantly, it shows how important Hector and Rosie were in Aurora's life. As a fan of both the books and the first movie, I was happy to see how well this movie brought them all together. It's one of my favorites.",
         "Terms of Endearement is one my my favorite movies. Evening Star was entertaining, but not as good. (Some of the situations seemed contrived) But.... The scene at the end when Aurora is surrounded by her family during her last moments was very touching to me. My grown daughter was watching the movie with me and I eased into the kitchen to weep, and I, slightly embarrassed, told her I was having a \"mommie moment.\" I saw this film on TV not too long after my own mother died. She would have loved to have gone that way,peacefully, at home, with her family around her. Me too, for that matter.",
         "If you read my comments about \"Terms of Endearment\" (1983), you will notice I said it was a film I avoided for a while, then finally got around to seeing. In fact, I only heard about the sequel, \"The Evening Star\" shortly after I saw \"Terms.\" In fact, \"Star\" came on TV shortly after I learned about it and I decided to give it a watch, even though I was probably going to be bored and disappointed. To my surprise, it was quite the opposite. It may start off on a boring start, but soon you will find yourself very involved with the characters and the multi-story plot, just like \"Terms.\" Shirley MacLaine handled herself pretty well in this, maybe even more so than \"Terms,\" but Miranda Richardson and Juliette Lewis seem out of place and they overact sometimes. Jack Nicholson's cameo was quite appropriate within the plot and he does a great job. Like the first film, the ending is memorable and falls in the \"tear-jerking\" category.",
         "When I saw \"Terms of Endearment\", it was my understanding before the movie that I would cry my eyes out for days. Well, I didn't. I cried for 6 or 7 minutes. Let me just say that I cried for a lot longer in this movie. For a sequel, it's excellent. It's almost like a story in a story. In Aurora's later years, when her grandchildren are grown up and she even has a great-grand son (who enjoys singing \"For she's a jolly good butt whole which nobody can deny\" to Aurora's great annoyance) Aurora is still looking for the love of her life. She's still chasing after men, and finds one at, that, with her counselor/physchiatrist played by Bill Paxton. The romantic scenes between these two are unmissable. But here's where the problems strike the movie. In the first movie, Aurora was a little bit more....well.... unpremiscuous as you could possibly get. Here, she's a little more floozy-ish. Aurora changes from \"Terms of Endearment\" to this movie. This is still an excellent movie, with an extrememly heart-felt, and sad ending. I loved it! For those who liked \"Terms\", you'll love \"The Evening Star.\" Shirley MacLaine shines. :)",
         "I liked it. I love McMurtry and I think the movie does a good job recreating his whacky characters. Although the teenage year crises are exaggerated, anyone with teenagers can appreciate the trials and tribulations of those years. The way in which all the children turn out to be good people proves that the early years of development can help young people (and parents and grandparents) to survive the difficult teens.",
         "As a movie standing by itself, The Evening Star is a decent film with strong performances by MacLaine and Richardson. However, as a sequel to Terms of Endearment, the movie is mostly middling. The plot line starts off about fifteen to sixteen years after Terms ended. The grandchildren are now all grown, and each has their own problems. Aurora remains the queen bee, but feels like she is losing her family, as her grandchildren resent her interfering and blame her for their current state. Added to the mix is Patsy, Emma's rich best friend and Aurora's nemesis who feels like she could have done a better job raising Melanie. Also along for the ride is Rosie, Aurora's long term maid and companion. The movie mainly follows Aurora as she attempts to deal with life, by dating various men and trying to put her grandchildren on the right path. There are a number of problems with this movie. The first being the complete lack of Flap Horton, the children's father. Here, he has no role in his children's lives, and he is only briefly mentioned as living in New Mexico. The second issue is the character of Melanie. She is essentially a stand in for Emma in this movie, but the dynamic between her and Aurora is underdeveloped and does not work very well. The other two grandchildren, Tommy and Teddy, are even more underdeveloped. The fourth issue is the virtual cavalcade of death this movie becomes in its second half where three main characters die! The one positive note is the Patsy/Aurora relationship. Both actresses have a good chemistry and play well off each other. You can feel the way each resents the other, but it is also understood that at the end of the day, there is a grudging respect. So overall, not a bad movie, but don't watch it expecting another Terms."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Rysher Entertainment"],
      "summaries": [
         "Continuing the story of Aurora Greenway in her latter years. After the death of her daughter, Aurora struggled to keep her family together, but has one grandson in jail, a rebellious granddaughter, and another grandson living just above the poverty line.",
         "She's back-and as delightfully feisty as ever! The generations grow, but life still spins around Aurora like a cyclone: her rebellious granddaughter wants to run off with Mr. Wrong; a snooty rival has come up with new ways to meddle in Aurora's life; her longtime spinster housekeeper is ready to ditch domestic work for the domestic bliss of matrimony; her great-grandson is like a poison pill; and her shrink is more than eager to cross the line separating client relationships and romantic entanglement. Welcome back Aurora. We've missed you.",
         "Determined to keep the promise she made to her late daughter, Aurora Greenway does her best to raise three grandchildren with constant opposition from Emma's best friend Patsy. She visits eldest grandson Tommy in prison, who awaits the possibility of parole, and struggles to break through the hate he harbors since the death of his mother. She also watches younger grandson Teddy struggle to make a living and provide for his budding family. Aurora focuses her hope for a better future towards her youngest Melanie who becomes a rebellious college student whose taste in men is unacceptable by her standards. Aurora comes to terms with the sacrifices she's made for others and ultimately embraces the thought of finding her own happiness. She begins to chronicle her life in an effort to recollect and organize the events that shaped who she is. Through exploring love, experiencing loss, and endearing efforts to bring her family back together, she changes over the years. With help of an old friend, she lays a loved one to rest and finally allows herself to age gracefully into her twilight years. The Evening Star is a touching continuation of a story that shines brightly along with Terms of Endearment."
      ],
      "budget": 0
   },
   "movielensId": 1410,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-25",
      "dvdReleaseDate": "2001-02-27",
      "directors": ["Robert Harling"],
      "runtime": 129,
      "movieId": 1410,
      "title": "The Evening Star",
      "mpaa": "PG-13",
      "actors": [
         "Shirley MacLaine",
         "Jack Nicholson",
         "Bill Paxton",
         "Juliette Lewis",
         "Miranda Richardson",
         "Ben Johnson",
         "Scott Wolf",
         "George Newbern",
         "Donald Moffat",
         "Jennifer Grant",
         "Mackenzie Astin"
      ],
      "imdbMovieId": "0116240",
      "originalTitle": "The Evening Star",
      "genres": [
         "Drama",
         "Romance",
         "Family",
         "Comedy"
      ],
      "youtubeTrailerIds": ["oYDzQ1QTwxY"],
      "plotSummary": "Continuing the story of Aurora Greenway in her latter years. After the death of her daughter, Aurora struggled to keep her family together, but has one grandson in jail, a rebellious granddaughter, and another grandson living just above the poverty line.",
      "tmdbMovieId": 30285,
      "avgRating": 3.01399,
      "releaseYear": "1996",
      "numRatings": 786,
      "posterPath": "/oU0Y04XTz4lPf3il6i4SCK1bLPa.jpg"
   }
}