{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "strike",
            "id": 4112
         },
         {
            "name": "ireland",
            "id": 14985
         },
         {
            "name": "candlelight vigil",
            "id": 166625
         },
         {
            "name": "british prison",
            "id": 212738
         },
         {
            "name": "struggle",
            "id": 212739
         }
      ],
      "imdb_id": "tt0117690",
      "video": false,
      "title": "Some Mother's Son",
      "recommendations": [],
      "backdrop_path": "/8DnZy12VlZUtUmuF4jrIcA9qKi1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kathleen Quigley",
               "gender": 1,
               "credit_id": "52fe4955c3a36847f8194b8b",
               "name": "Helen Mirren",
               "profile_path": "/4EGgBJPUBz68ZrnFuLVo01r0uND.jpg",
               "id": 15735,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Annie Higgins",
               "gender": 1,
               "credit_id": "52fe4955c3a36847f8194b8f",
               "name": "Fionnula Flanagan",
               "profile_path": "/bQPNTSyBXdfwOXcwjCdzFXDSDVO.jpg",
               "id": 58068,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gerard Quigley",
               "gender": 2,
               "credit_id": "52fe4955c3a36847f8194b93",
               "name": "Aidan Gillen",
               "profile_path": "/w37z62Ex1kxqLTyI3SRySmiVsDB.jpg",
               "id": 49735,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Frank Higgins",
               "gender": 2,
               "credit_id": "55350562c3a368523e003772",
               "name": "David O'Hara",
               "profile_path": "/zPWpTV19nPLawd1E9A1jUDdcT2H.jpg",
               "id": 2482,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Bobby Sands",
               "gender": 2,
               "credit_id": "553505729251417ae3005466",
               "name": "John Lynch",
               "profile_path": "/2OHQ4Hck4QlCqDjQ4mK6OMW65n3.jpg",
               "id": 28743,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Farnsworth",
               "gender": 2,
               "credit_id": "5535057f9251417eb8001755",
               "name": "Tom Hollander",
               "profile_path": "/w3jpQ0Lcus7voaq0tKGd4xv2X1D.jpg",
               "id": 2441,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Danny Boyle",
               "gender": 2,
               "credit_id": "553505a9c3a3680bdc0021a4",
               "name": "Ciarán Hinds",
               "profile_path": "/h5n8B12WoY1UAZjzSVEup4vsoBw.jpg",
               "id": 8785,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Alice Quigley",
               "gender": 1,
               "credit_id": "553505bec3a368523e003782",
               "name": "Geraldine O'Rawe",
               "profile_path": null,
               "id": 89021,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Harrington",
               "gender": 2,
               "credit_id": "553505d2c3a3681c3500101f",
               "name": "Tim Woodward",
               "profile_path": "/7v8GLhxum0ukLqEJCfBMSrUApdz.jpg",
               "id": 27659,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4955c3a36847f8194b87",
               "name": "Terry George",
               "profile_path": "/bQDk9TM3y1pswHHKLoeb9bV88S9.jpg",
               "id": 2589,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5535049192514125dc0039a7",
               "name": "Terry George",
               "profile_path": "/bQDk9TM3y1pswHHKLoeb9bV88S9.jpg",
               "id": 2589,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5535049cc3a36848ca00651f",
               "name": "Jim Sheridan",
               "profile_path": "/mfukw1JcUsXmUzt6IoaayMaescv.jpg",
               "id": 53334,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 0.834245,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         }
      ],
      "id": 58102,
      "vote_count": 8,
      "budget": 0,
      "overview": "Based on the true story of the 1981 hunger strike in a British prison, in which IRA prisoner Bobby Sands led a protest against the treatment of IRA prisoners as criminals rather than as prisoners of war. The film focuses on the mothers of two of the strikers, and their struggle to save the lives of their sons.",
      "similar": [
         252178,
         369557,
         5723,
         1116,
         783,
         20766,
         146233,
         167073,
         393457,
         408,
         11412,
         10647,
         22821,
         25195,
         19994,
         6023,
         3175,
         10360,
         10139,
         205220
      ],
      "original_title": "Some Mother's Son",
      "runtime": 112,
      "poster_path": "/rdORRGJMGfYFuZWhuvrai8TyogE.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Gaeilge",
            "iso_639_1": "ga"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hell's Kitchen Films",
            "id": 2307,
            "origin_country": ""
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         }
      ],
      "release_date": "1996-12-25",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Between love and loyalty... Between life and death... Lies a choice no mother should have to make.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Terry George"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Terry George",
         "Jim Sheridan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117690/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTEzMDMzNzM2OTdeQTJeQWpwZ15BbWU3MDU3OTM2MjU@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Helen Mirren, Fionnula Flanagan, Aidan Gillen | See full cast and crew »"],
      "reviews": [
         "SOME MOTHER`S SON starts with some archive video of Magaret Thatcher making a speech after winning the 1979 British general election followed by a sequence of British government officials getting together with one of them saying \" The rules < On Northern Ireland and terrorism have changed > have changed , the policy is now isolation , criminalization and demoralization \" . This is a very strange thing to say about the situation in Northern Ireland in 1979 since despite the change in government there was no change in policy . The IRA were making a grand job isolating themselves from the mainstream nationalist community throughout the 1970s with incidents like \" Bloody Friday \" which were killing and maiming as many catholics as protestants . Criminalization ? Well the IRA have always been outlawed on both sides of the border since partition in 1922 , oh and convicted terrorists , loyalisist or republican , lost all political status in 1976 . Anyone found convicted of terrorist convictions after March 1976 was no longer eligible for political status within the Northern Ireland prison system . This was introduced by the Labour government`s Northern Ireland secetary Merlyn Rees not as insinuated here Thatcher`s Conservative government . As for demoralization the Provisional IRA were very much demoralized before Thatcher came into government . By 1975 they realised unification with the South wasn`t going to happen , had become embroiled in fueds with the Official IRA and loyalist terror groups while most of their members had been killed or imprisoned , not imprisoned in Long Kesh as in the early 1970s but in the new purpose built Maze with its strict regime ( Criminalization is a demoralizing thing ) while recruitment into the ranks was drying up ( If you go around blowing up innocent civilians you can expect this to happen ) , as I said Isolation , criminalization and demoralization weren`t the invention of Thatcher Another serious factual error that leapt out at me was the court room scene. In a Northern Ireland \" Diplock \" court used to try people up for terrorist offences ( Remember both loyalist and republican defendants were tried this way )there`s three judges used but here we see only one who is a toffee nosed Englishman as are the defence barristers . In most cases Diplock judges were Irish , as are defence and prosecuting attorneys , but not only are most defence lawyers Irish they`re nearly all Irish catholics ! The most notorious loyalist murder gang \" The Shankhill butchers \" - whose idea of a good night out was to kidnap the nearest suspected catholic passerby and slowly skin him alive - where defended by a catholic lawyer , so how on earth a film that struts its credentials as being \" Based on factual events \" can get away with this misrepresentation of a Northern Ireland court is beyond me . There are also several iinaccurate details in geography and anachronisms like the Brits uniforms ( The polycarbide helmets they wear weren`t introduced untill 1986 ) which I couldn`t help but notice These above comments are facts which can`t be disputed . They can`t be disputed because they are facts , so I won`t put too much opinion on SOME MOTHER`S SON . It is very well acted and it was very good to see that for a brief moment Helen Mirren`s character Kathleen Quigley comes to the realisation that she`s being manipulated by the IRA / Sinn Fein but this is a brief moment in a film that`s preceeded by polemical opinion which screams \" Britain is entirely responsible for the troubles \" and finishes with a caption giving the names of the ten IRA/INLA hunger strikers . I guess it would have been too much to print the names of those murdered by these particular hunger strikers ?",
         "THIS REVIEW CONTAINS SPOILERS An excellent piece of film making which shows the oppression the Irish people have endured under British rule and the lengths the hunger strikers had to go to get POW status and to show the world how the Irish people where being treated by the Thatcher government. thought Helen Mirren was excellent in this film as was Fionnula Flanagan and Aidan Gillen. However I didn't think John Lynch was very convincing as Bobby Sands. WARNING SPOILERS: Only thing found a bit unrealistic about this film was at the funeral scene the IRA had AK-47 riles in reality they didn't get them until around 1986 (the film is based in 1981) when the Gaddafi shipments came through. Plus in the court scene the lawyers are all English in reality they where mostly Irish.",
         "I saw this film when it first came out but after reading two rather diverse but equally recommended books on the subject (\"Ten men dead\" by David Beresford and \"Nor Meekly serve my time\" Edited by Brian Campbell, Laurence McKeown and Felim O'Hagen) , I figured I'd like to see it again. The story portrayed in the film echoes the 2nd book in particular so closely at times that I expected to see the three men credited (They were actually H Block prisoners who took part in the protest and hunger strikes themselves). Of course from that perspective it is understandable that some would claim that it tends towards bias or discriminates towards a one sided view on a very complex issue. The reality of the film is that whilst the majority of the characters save Bobby Sands are fictional, many of them, with just a little background reading are recognisable as real life people such as Fr Denis Faul, Bik McFarlane, \"The Mounain Climber\" and a composite of Gerry Adams/Danny Morrison. It is a charge fairly frequently levelled at Jim Sheridan that he embellishes or takes liberty with factual real events such as in Michael Collins or In America - However, that is usually levelled by someone with an obvious axe to grind or viewing from an opposite perspective. So whilst it is desirable for a good film to document even real facts in an understandable way in less than two hours it is also nice to be entertained and have your curiosity aroused so that you can read further on the subject if you so desire. Some Mothers Son is probably one of these types of movies where the viewer's experience and insight is best enhanced by prior knowledge or at least some background of the events which out of necessity the film is compelled to synopsise and simplify some times. The facts surrounding this turbulent period in Northern Irish history is that after a prolonged \"dirty protest\" to be recognised as prisoners of war instead of criminals or terrorists, in 1981 the republican H-Block prison inmates embarked on a hunger strike which by the time it had ended some 6 months later had seen ten of them die but more significantly for the republican movement in NI had seen a wider world focus on them and also had seen a new dawn towards the use of the ballot box instead of the Armalite assault rifle as a means to an end by Sin Fein/IRA which 25 years later is culminating in an electorally strong Sinn Fein and a decommissioned largely stood down IRA. All in all therefore, as a pen picture which goes some way towards giving one a basic insight into the Northern Ireland Hunger strike of 1981 it does a good job which is greatly helped by very good performances by Helen Mirren, Fionnula O Flanigan Gerald McSorley and John Lynch in particular. Oh and if the soundtrack sounds vaguely familiar it may be because it is by Bill Whelan of Riverdance fame.",
         "The music from \"Some Mother's Son\", composed and conducted by Bill Whelan, is hauntingly beautiful. Eleanor McEvoy's vocal on \"The Seabird\" is outstanding. However, it is too bad the storyline in the movie doesn't match the quality of the music. Quite frankly, the movie was boring! Helen Mirren and Fionnula Flanagan give first rate performances as the mothers (Kathleen Quigley and Annie Higgins) of two IRA terrorists imprisoned following a rocket attack on British soldiers. David O'Hara (Frank Higgins) plays the hard core murderer who appears to enjoy killing the British. Aiden Gillen is Gerard Quigley, the unlikely terrorist, who aids his friend Higgins in the attack. O'Hara and Gillen are very believable in their roles. In fact all of the actors are good. The problem is with the storyline and lack of action after the initial rocket attack and subsequent capture of Higgins and Quigley. The scene involving the IRA's retaliation murder of the Maze prison guards happens far too quickly for the viewer to understand what is going on. And let's face, watching people starve to death is not very exciting. I still gave this movie 6 out of 10, because of the fine acting and music. Irish44",
         "break, break, break, on thy cold grey stones, oh sea I saw this movie when it first came out, and just watched it again last night. I still feel that it's an important movie, and also that everyone in the audience except for me <insert smile here> is missing the point. It's not about the right or wrong of the IRA/Sinn Fein or Thatcher's administration, it's about a more-or-less unprecedented friendship that evolves between two sons' mothers, and how they deal with their sons' impending self-imposed deaths, a friendship that quite suddenly excludes class issues, precisely because it is about _mother's sons_. This is evoked in many subtle ways: Mrs Quigley's daughter leaves her job at the bank because no one trusts her after her brother has been arrested, and ends up tending bar somewhere outside North Ireland -- rather declassee for a young woman who'd been working in a bank; Mrs Higgins lives her life on a bicycle, gets a driving lesson on the sea-strand from Mrs Quigley, and they both end up getting saved from an incoming tide by British/North Irish soldiers. If you check the screenplay, you can see the change in the use of forenames and last names between the two women -- it's unfair to expect Yanks to pick that up. I can't even begin to explain it to my friends, and hell, I live in a border state. There's a unifying theme in this movie and it's the sea: the sea the mothers are connected to, and that their sons are not permitted to see.",
         "With an excellent cast, soundtrack and photography this film's one flaw is that it must over-simplify a complex and pivotal episode in Irish history. Despite that it does a fairly good job of capturing the essence of what happened, smartly exposing the viewer to this rarely seen world through the eyes of a middle-class mother whose son, unknown to her, is caught up in the incendiary world of 'the Troubles' of Northern Ireland. Convicted of taking part in an attack on British forces as part of an IRA Active Service Unit, her son quickly finds himself the cell-mate of soon-to-be-IRA-icon/martyr, Bobby Sands. Although the film does not really explore the personality of this seminal figure (for ex: that he was a poet), it does convey the gravity of the situation he was thrust in as well as the huge impact the hunger strike had on the Northern Irish, indeed people around the world. But more so, this film is about the suffering that the women in these situations, particularly the mothers (hence the title) must endure. They have no choice in the tragedy that forces itself on their lives, yet they must find ways to overcome and affect what positive change they can. Some say there is not enough \"action\" in the film. It is not an \"action\" movie. There are plenty of Dolph Lundgren vehicles out there if that is all you want. This film is about how episodes of moving history effects everyday people's lives.",
         "I only loosely knew about the Irish Hunger Strikers when I saw \"Some Mother's Son\". It shocked me what the movie portrayed. It's about not only the men themselves, but how two of the mothers have to try and maintain hope as the men remain in jail, starving because they dared to resist the British occupation. True, the whole situation in Northern Ireland may be a controversial one, but this movie gives it all a humanizing aspect, showing what it really feels like to have to experience the oppression every day. Helen Mirren, as one of the mothers, turns in as good a performance as we can expect from her (why has she never won an Oscar?) as does Fionnula Flanagan, as another mother. Definitely a movie that I recommend.",
         "While it is difficult to separate oneself from the politics of \"the troubles\" I think its important to keep in mind that this is a film, not a documentary. Its goal is to be historically authentic, not accurate. The message is one that speaks to mothers on all sides of the political divide. I think that one of the reviewers unfortunately missed the point of the movie which is featured in the title. As a film this is an incredibly moving portrait of the horror, sacrifice and absurdity of war. The cast is outstanding; Helen Mirren is simply stunning, Fionnula Flanagan gives a powerful performance, Aidan Gillen is stirring as Helen Mirren's son and Bobby Sands' cell mate and finally John Lynch portrays the role of Bobby Sands quite fairly. The writers and director Terry George and Jim Sheridan have done an outstanding job writing and filming a story that transcends conflict and speaks to humanity we all share. While it shows the injustice of the position from which many of the North Ireland Catholics faced (and therein lies its political slant) the title firmly roots this film as so much more. I highly recommend this film for its historical authenticity and the brilliant performance by Helen Mirren.",
         "There are some excellent, nuanced performances in this movie, particularly from the two leads, Helen Mirren and Fionnula Flanagan (an underrated character actress best known for her work in \"The Others\"). But by no means is this easy to watch - and it's best appreciated, whatever your view on the long-standing conflict, if you have some idea of the history first, and the passion that still surrounds Bobby Sands. Tim Pat Coogan's \"The Troubles,\" while a mammoth volume, summarizes the death and destruction that have been visited on all three of the major players - British, Catholic, Protestant. Interestingly, Helen Mirren also starred in \"Cal\", another movie about the \"Troubles\" of Northern Ireland, playing a Protestant widow who falls in love with a Catholic man. In both movies, Mirren's character endures the unthinkable - watching the people she loves best being torn by sectarian violence. Yet in \"Cal,\" Mirren's character is more passive, having things \"happen\" to her. In \"Some Mother's Son\", Mirren and Flanagan take action, their passion for their children stirring them to activism, right or wrong.",
         "Its ashame that more people don't know about this subject. I found this film to be very touching with a very strong moral. Yes the movie is about the I.R.A. and some of its most famous 'soldiers', however, the film touched on who is affected by these actions. I don't agree with the I.R.A but found myself empathetic to the families of the prisoners involved. Despite what the previous poster stated, this movie was pre-911 and touches not on the terrorists acts, but on the consquences of their actions. Helen Mirren was brilliant in this movie, as always. Its not exactley Michael Collins on the subject, and a lot of it was 'glamorized' for Hollywood, but all in all worth watching."
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Hell's Kitchen Films"
      ],
      "summaries": ["Based on the true story of the 1981 hunger strike in a British prison, in which IRA prisoner Bobby Sands led a protest against the treatment of IRA prisoners as criminals rather than as prisoners of war. The film focuses on the mothers of two of the strikers, and their struggle to save the lives of their sons."],
      "budget": 0
   },
   "movielensId": 1412,
   "movielens": {
      "languages": [
         "English",
         "Gaeilge"
      ],
      "releaseDate": "1996-12-25",
      "dvdReleaseDate": "2011-05-06",
      "directors": ["Terry George"],
      "runtime": 112,
      "movieId": 1412,
      "title": "Some Mother's Son",
      "mpaa": "",
      "actors": [
         "Helen Mirren",
         "Fionnula Flanagan",
         "Aidan Gillen",
         "David O'Hara",
         "John Lynch",
         "Tom Hollander",
         "Ciarán Hinds",
         "Geraldine O'Rawe",
         "Tim Woodward"
      ],
      "imdbMovieId": "0117690",
      "originalTitle": "Some Mother's Son",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["nUWtyUSC-NE"],
      "plotSummary": "Based on the true story of the 1981 hunger strike in a British prison, in which IRA prisoner Bobby Sands led a protest against the treatment of IRA prisoners as criminals rather than as prisoners of war. The film focuses on the mothers of two of the strikers, and their struggle to save the lives of their sons.",
      "tmdbMovieId": 58102,
      "avgRating": 3.73621,
      "releaseYear": "1996",
      "numRatings": 290,
      "posterPath": "/rdORRGJMGfYFuZWhuvrai8TyogE.jpg"
   }
}