{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0118163",
      "video": false,
      "title": "The Whole Wide World",
      "recommendations": [
         52654,
         27444,
         241432,
         38986,
         16405,
         80919,
         36046,
         63437,
         31605,
         63848,
         40798,
         55123,
         121822,
         19965,
         24502,
         48375,
         14868,
         54794,
         18293,
         79926
      ],
      "backdrop_path": "/3GOPhzfzeUyXD0hNLtvFd3CD3Xp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Robert E. Howard",
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b573",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Novalyne Price",
               "gender": 1,
               "credit_id": "52fe477d9251416c7509b577",
               "name": "Renée Zellweger",
               "profile_path": "/aeUnfem148WrhpQcmiUuSRGhCYU.jpg",
               "id": 9137,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Mrs. Howard",
               "gender": 1,
               "credit_id": "52fe477d9251416c7509b57b",
               "name": "Ann Wedgeworth",
               "profile_path": "/qi153PFDSHi5afMBkdEqquXwxWc.jpg",
               "id": 83145,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Dr. Howard",
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b57f",
               "name": "Harve Presnell",
               "profile_path": "/hH4HYzCa5BzWxOs76HQnDBOKe4c.jpg",
               "id": 3907,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Clyde Smith",
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b583",
               "name": "Benjamin Mouton",
               "profile_path": "/nzYS12c1c7GNnsnce1ysfOTgLyz.jpg",
               "id": 10488,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b54b",
               "name": "Dan Ireland",
               "profile_path": null,
               "id": 69099,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b551",
               "name": "Carl Colpaert",
               "profile_path": null,
               "id": 83142,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b557",
               "name": "Kevin Reidy",
               "profile_path": null,
               "id": 83143,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b55d",
               "name": "Dan Ireland",
               "profile_path": null,
               "id": 69099,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b563",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe477d9251416c7509b569",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe477d9251416c7509b56f",
               "name": "Michael Scott Myers",
               "profile_path": null,
               "id": 83144,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.716986,
      "production_countries": [],
      "id": 18451,
      "vote_count": 10,
      "budget": 1300000,
      "overview": "Based on her acclaimed autobiographical book, THE WHOLE WIDE WORLD tells the story of Novalyne Price, an attractive feisty West Texas schoolteacher and her bittersweet, romantic and turbulent relationship with Robert E. Howard, the great pulp fiction writer of the 1930's.",
      "similar": [
         226,
         2142,
         3134,
         49950,
         23483,
         298312,
         11564,
         4771,
         6075,
         205,
         339692,
         281957,
         281,
         979,
         769,
         812,
         395834,
         277547,
         1939,
         445954
      ],
      "original_title": "The Whole Wide World",
      "runtime": 106,
      "poster_path": "/bdQysMSn1A7PwXPTkxAEWXwurIr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-12-20",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dan Ireland"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Novalyne Price Ellis",
         "Michael Scott Myers"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118163/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMDUwODI1OF5BMl5BanBnXkFtZTcwMDY3MjAwMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Vincent D'Onofrio, Renée Zellweger, Ann Wedgeworth | See full cast and crew »"],
      "reviews": [
         "Before I saw this movie a few years ago, I had never heard of \"Robert E Howard\". Since then, I've educated myself on who Robert E Howard was...and who Novalynn was. He was extraordinary and she drank him up. It's incredible that someone took her book and made a movie out of the story. Even more incredible is how perfectly it was all orchestrated. The characters were fantastic (Especially Vincent DiOnofrio). The script was great, the filmwork was beautiful, the timing was right on. I will never grow tired of this movie. And I'll continue to turn it onto whoever comes over to my house and hasn't seen it yet. The Whole Wide World is a masterpiece!",
         "This is an easy vote. A real, well acted old time story of star crossed loves. Cutting edge acting by Vincent D'Onofrio as Robert and his girl Rene Z. An emotional, tender, and heartbreaking story. Both actors pull out your emotions and put them through the wringer. Beautifully filmed and the music fits the mood. Vincent was perfect. His intense face, which he uses as an emotional barometer, captures and relays the tortures Robert E Howard experienced. It is how films used to be - memorable. This was Rene Z's first serious work, and I will say she has never come close again in touch the emotional triggers although she is big box office. Her thanks to Vincent on receiving her first Academy awards speaks volumes \" Thank you Vincent for teaching me how to work.\" They were a lovely team together with a special bond both actors created together. I did not want to leave the characters and return to reality. In closing, this \"little movie\" budget wise and distribution wise, is actually a far greater achievement then it's modest budget could foresee. This film should have been dubbed as one of the greats instead of shelved and forgotten.",
         "It's a good film, but it's absolutely painful to watch, as you repeatedly wish they'd put aside their insecurities and get together. The best screen kiss in recent memory is in this film and it gives you a taste of the power they would've had if they would've always stayed together, instead of straying alone. One of the most emotionally abusive films of the last year, it's more of a realistic romance instead of the perfect one featured in films such as \"You've Got Mail\". This and many other films serve as a reminder that most great romances are not without torturous actions from both halves.",
         "I found this movie while searching through a reduced DVD bin. But once I saw Vincent D'onofrio in the lead I knew I would not be disappointed; and of course I wasn't. He is one of the most talented and underrated actors gracing the indie screen today. Although he has had several big budget roles (MIB-The Cell to name a couple) he is a character actor and does extremely well with character driven films. I'd never heard of Robert E. Howard until I watched the WWW and I couldn't think of a better person to introduce him to me than Mr. D'onofrio. The way he portrays his tortured existence and his need for companionship and acceptance was done with such brilliance and conviction, you can really appreciate how much Bob Howard lived inside his own head and yet longed to be part of the world around him. Renee Zellweger also turned in a notable performance as Novaline Price. She skillfully portrayed the love, hope and irritation she often had for Bob. Together D'onofrio and Zellwegger not only showed the pain of unrequited love, but the richness of friendship. I recommend this film to anyone looking for great acting, wonderful cinematography and a delightful score. Curl up, turn the lights down, and enjoy. I promise the characters will stay with you long after the final credits.",
         "I was thrilled to read the (almost) unanimous praise for this FANTASTIC little movie by fellow viewers, and I must chime in with my wholehearted agreement. Every once in a while you blunder across an under-financed and straight-to-video movie that just absolutely flattens you with that rare convergence of talent, story & production, and you're reminded anew of just how powerful a film can be. Most of the previous postings give a good outline of the plot, so I won't recap it here. \"The Whole Wide World\" is remarkable in all sorts of ways, but I must use my space here to further celebrate the masterful acting of the leads, Vincent D'Onfrio (as Bob Howard) and Renee (as Novalyne Price). Indeed, the skill of the portrayals completely conveys the sense of time, place and emotional temperament necessary to draw us into their worlds--and break our hearts. And yeah, you're just absolutely made of stone if you're not weeping just a little as the credits roll(or trying hard not to). It's testament to D'Onfrio's amazing talent that we can clearly see Bob's misanthropic shortcomings, but still we hope this tragic misfit of a guy can (as another fan wrote here)\"meet her half way.\" A DEEP, insightful performance by Vincent who has quietly been doing the same in lesser roles for decades now. And I gotta give Renee her full due as well. She was EXCELLENT, fully credible, spiky, tender, flirtatious, frustrated, and ultimately emotionally exhausted trying to figure out this neurotic but strangely charming man she tried to get close to. Seeing this movie reminds me of \"Casablanca\" in the sense that you can't imagine anyone else in the Bogart & Bergman roles; no doubt other actors would have given their all, but I can't see how anyone other than Vincent & Renee could have spiked our hearts so fiercely. Who would have ever thought that such a GREAT movie could be made of the abortive love life of Robert E. Howard? Of course that's not really what makes the movie great--as Flaubert said when asked to identify Madame Bovary, he replied \"I am;\" and so it is with \"The Whole Wide World,\" where we are poignantly reminded of our own failures to engage with life and love in the ways we believe they should play out. Again, I'm THRILLED to see how many other fans recognize the unique quality of this movie. I encountered it obliquely, noting its synopsis in the New Yorker back in '96 and thinking \"what a curious thing to base a movie on.\" For some reason my sister tracked it down and loaned me a dubbed-from-TV video cassette; crummy video and sound, but the movie still BLEW ME AWAY (and it still does--thankfully it's now available on DVD). Given Renee's star power I don't think it will ever vanish completely, but we can only hope others will take a chance on this little masterpiece so it can one day receive the acclaim its excellence deserves. I'd also be remiss if I didn't put in a small plug here for Robert E. Howard the pulp fictioneer; it wasn't complete hyperbole for Novalyne to dub him \"the best pulp fiction writer...\" His writing stands up well today; plenty of brawny page-turning adventure that still delivers fabulous escapist thrills for guys. But if some of us guys can watch this movie and worship it, I'd bet at least a few of the girls can read some Robert E. Howard today and get a sense of the tough-but-hurting guy depicted in the movie. But one certainly need not read Howard to appreciate this amazing movie on its own stellar merits.",
         "A wonderful romantic movie and obviously a labor of love for all concerned in its production. \"One Who Walked Alone\" as a miraculously excellent memoir, written by Novaline Price-Ellis decades after the events portrayed, based upon notes she had written at the time. The interplay between Novaline and Robert is mostly conversations when he takes her for a drive and \"shoots off his mouth.\" Here's the greatest action writer in history, with worldwide fans, living with his mother in a town where nobody sees him as either hero or star, just a big over-sized hunk who lives with his folks. Vincent d'Ofrino is ALWAYS a joy to watch and Rene Zellwiger can always be depended upon for a solid performance. As for sex appeal, Rene is definitely not a plump or fat Brigit Jones but rather she's slender, lithe, and not heavy enough to hold down a job as a paperweight. In other words, just what this 6'4\" hunk goes after --- every time. But aside from that, Whole Wide World is the kind of great movie you'll never forget. Search for it in VHS or DVD and go to a specialty store if need be.",
         "If there was only 1 movie ever, I would suggest anyone to watch, this would be the movie that I would suggest. I came across it on Netflix, DVD rentals, and rented it because the storyline seemed interesting, and I like Renee. I had never heard of this movie, and at the time it came out in 1996, I was working too many hours to even know what was in the movie theaters. Vincent D'Onofrio is more than amazing in this role, and should have been nominated and won the Oscar for this part. For me, his portrayal of his character in this movie is the best I have ever seen any actor do. Vincent's portrayal brings out Renee's character beautifully; how could she not act like she did, working against such an amazing actor. This screenplay is beautifully written, from Novalyne Price-Ellis's true book she wrote herself, covering her relationship with Robert E. Howard. I had no idea who he was, but after this movie, have read up on his life, and will purchase Novalyne's book, \"One Who Walked ALone\", from which this movie was taken. Great directing, screenplay, photography, acting, music; a movie that could not have been put together any more beautifully. BRAVO to all, thank you for one of the best movie experiences I have had, at the age of 48. Shame on whomever did not spend the money to distribute and advertise the heck out of this movie when it came out in 1996. I will purchase the DVD, and will buy it for gifts for many, but wish they had put more in the \"special features\", than only Renee's chat. Why not all of the \"deleted scenes\", \"the making of\", etc...Janet, NYC, Feb 2007",
         "I saw online that this movie would be on TV and, since I love Renee Zellweger, I decided to give it a try. What I found was a rare movie that combines a tragic yet realistic romance with over-the-top performances that make the movie worth watching. For some it might get off to a slow start, but stay with it if you're the least bit interested. I made the mistake of playing around on the computer the first time I watched it, and I missed a lot. This movie deserves your full attention. Based on the memoir by Novalyn Price about her relationship with pulp writer Bob Howard, the film does an excellent job of showing the on-and-off romance between grade-school teacher Novalyn and full-time writer Bob from both sides. Novalyn truly likes Bob, even loves him at one point, but Bob rides her off, saying \"he can't be tied down.\" But once Novalyn starts dating Truett Benson, Bob's friend, Bob suddenly realizes what a special person Novalyn is and that he can't live without her. He tries several attempts to win her back, but all end either in tears or a fight. Every time Novalyn tries to give him a second chance to prove he loves her, he goes and spends all his time caring for his sick mother, not leaving her for a second. I know you're saying, \"What's wrong with that? It just means he loved his mama.\" But as Novalyn points out, Bob is a grown man who should be leading his own life and being able to let go of his mother and get out once in awhile. While most movies like these just go on and on about how one person can't live without the other, this one has you wondering if the two will really end up together. And unlike most romances where you're waiting for them to unlock lips, \"Wide World\" takes many twists and turns in the romance department;you may think you know what's going to happen, but you really don't [unless you already know the complete full story of Howard's life]. The performances by the two leads alone make the movie worth watching;anyone who appreciates good acting should definitely check this one out. Vincent D'Nofrio is amazing, in a performance that would make the real Bob Howard proud I'm sure. He was really overlooked and should have gotten way more recognition for this role. If his other movies are as good as this, it's really sad he doesn't have a more well-known career. There is some justice in the world though, because Renee Zellweger has gone on to become a major star after this part, as she should have. She has a warmth and sincerity that comes across in her acting and makes you root for her the whole time. You often forget she's acting because her delivery is so natural, and she has several emotional scenes to show her depth. I;m a big fan of hers, and this movie didn't disappoint. It's too bad this movie didn't get more recognition, but do yourself a favor and catch it the next time it's on TV. You won't be sorry.",
         "Usually I treat \"love stories\" with a thinly veiled contempt. Call me cynical, but most are contrived, sappy, and predictable. The Whole Wide World is anything but, and like most stories that break your heart, it's a true one - not something created by the overactive imagination of a Hollywood exec. The basic story: based on the memoirs of Novalyne Price, The Whole Wide World is her recollection of the relationship she had with Conan creator and pulp fiction writer, Robert E. Howard, before his tragic suicide. The time period is 1930's and the place is small town Texas. Novalyne is a school teacher who wishes to be a published writer, and Howard is already established as a pulp fiction maverick. Both are in their late 20's. The performances in this film are outstanding. Vincent D'Onofrio practically leaps off of the screen. His character is infuriating, heartbreaking, yet so fragile. Renee Zellweger filmed this movie just before she got the call to appear in Jerry Macguire, and she shines as Novalyne Price. Price was a smart, witty, and stubborn lady - in a time when such things were not considered very ladylike. Novalyne and Robert were introduced by a mutual acquaintance, and thus began their disjointed and devoted friendship. There was obviously so much love between them, but circumstances, Howard's mental illness, and his unreasonable devotion to his mother prevented the ir relationship from ever reaching it's potential. The film shows their ups and downs and the connection they had between them. It's a tragic, very real human story and more than worth two hours of your time. Just make sure you have a tissue ready because it is a tear jerker. It never lowers itself to petty sentimentality though. The Whole Wide World will touch you via pure emotional story telling - kudos to the writer who adapted Price's novel. It's criminal that the DVD and video are not available in the United States! Various cable channels are playing it regularly, and the DVD is available in Canada. Try to catch it if you can!",
         "All the praise for this movie in the other comments here should be taken as read. This is one of my favourite films, for many many reasons. It should be noted that the story is very much from Novalyne Price's viewpoint, which explains the movie-of-the-week feel that sometimes arises. If this movie had been shot from Howard's point of view, we can be pretty sure it would have been a lot darker, more lurid and more violent! The way the film supports Novalyne's opinions rather than Howard's is, I guess, in keeping with the story, i.e. romance foundering on Novalyne's inability to accept Howard for who he is, flaws and all. (Am I the only one who thought Novalyne was heartless to insist Howard stop caring for his dying mother?) It's an age-old story: the pain of romance made impossible by differing interests and natures."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cineville",
         "Kushner-Locke Company, The"
      ],
      "summaries": ["In Texas in the 1930s, young schoolteacher Novalyne Price meets a handsome, eccentric, interesting young man named Robert Howard. He's a successful writer - of the pulp stories of 'Conan the Barbarian'; she's an aspiring one. A friendship develops into a sort of courtship. Based on a memoir by Novalyne Price."],
      "budget": 1300000
   },
   "movielensId": 1413,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-20",
      "dvdReleaseDate": "2003-07-29",
      "directors": ["Dan Ireland"],
      "runtime": 106,
      "movieId": 1413,
      "title": "The Whole Wide World",
      "mpaa": "",
      "actors": [
         "Vincent D'Onofrio",
         "Renée Zellweger",
         "Ann Wedgeworth",
         "Harve Presnell",
         "Benjamin Mouton"
      ],
      "imdbMovieId": "0118163",
      "originalTitle": "The Whole Wide World",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["2qPFXcvTQV4"],
      "plotSummary": "Based on her acclaimed autobiographical book, THE WHOLE WIDE WORLD tells the story of Novalyne Price, an attractive feisty West Texas schoolteacher and her bittersweet, romantic and turbulent relationship with Robert E. Howard, the great pulp fiction writer of the 1930's.",
      "tmdbMovieId": 18451,
      "avgRating": 3.55814,
      "releaseYear": "1996",
      "numRatings": 387,
      "posterPath": "/bdQysMSn1A7PwXPTkxAEWXwurIr.jpg"
   }
}