{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "schizophrenia",
            "id": 222
         },
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "therapist",
            "id": 2726
         },
         {
            "name": "therapy",
            "id": 40952
         },
         {
            "name": "child wish",
            "id": 168386
         }
      ],
      "imdb_id": "tt0112362",
      "video": false,
      "title": "Angel Baby",
      "recommendations": [],
      "backdrop_path": "/sY3vxtBT46H1Duo38dZqWGESzW5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe4372c3a36847f8054dff",
               "name": "John Lynch",
               "profile_path": "/2OHQ4Hck4QlCqDjQ4mK6OMW65n3.jpg",
               "id": 28743,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe4372c3a36847f8054e03",
               "name": "Jacqueline McKenzie",
               "profile_path": "/qBAp4Syl6GhbhZFV96BSDM8Fxjv.jpg",
               "id": 28744,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Morris Goodman",
               "gender": 2,
               "credit_id": "52fe4372c3a36847f8054e07",
               "name": "Colin Friels",
               "profile_path": "/tXKCpTwCs4TZYdQ6p5Kch7sRkkS.jpg",
               "id": 27753,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Louise Goodman",
               "gender": 1,
               "credit_id": "52fe4372c3a36847f8054e0b",
               "name": "Deborra-Lee Furness",
               "profile_path": "/dPSTYhaFfGmgSODAiRvRiKdl6dZ.jpg",
               "id": 28745,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rowan",
               "gender": 0,
               "credit_id": "52fe4372c3a36847f8054e0f",
               "name": "Geoff Brooks",
               "profile_path": null,
               "id": 28746,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Frank",
               "gender": 0,
               "credit_id": "52fe4372c3a36847f8054e13",
               "name": "Humphrey Bower",
               "profile_path": null,
               "id": 28747,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Dr. Singani",
               "gender": 0,
               "credit_id": "52fe4372c3a36847f8054e17",
               "name": "Alex Pinder",
               "profile_path": null,
               "id": 28748,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4372c3a36847f8054df5",
               "name": "Michael Rymer",
               "profile_path": "/w3iQNN1LAVsTbF4wyReOadjSojJ.jpg",
               "id": 28741,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4372c3a36847f8054dfb",
               "name": "Michael Rymer",
               "profile_path": "/w3iQNN1LAVsTbF4wyReOadjSojJ.jpg",
               "id": 28741,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.105594,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 2892,
      "vote_count": 4,
      "budget": 0,
      "overview": "Two schizophrenics meet during therapy and fall in love. Unfortunately they are on a road to nowhere...",
      "similar": [
         1018,
         40807,
         37135,
         453,
         76494,
         301337,
         381283,
         110415,
         11472,
         63,
         810,
         2758,
         9732,
         9659,
         9506,
         4141,
         2123,
         340837,
         204922,
         195589
      ],
      "original_title": "Angel Baby",
      "runtime": 105,
      "poster_path": "/aCvCn3PIdnEAPpHreswg2YXhrEI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/w7d3hoHQaC0XwjrxEG1yPeuUhu5.png",
         "name": "Australian Film Commission",
         "id": 417,
         "origin_country": "AU"
      }],
      "release_date": "1995-09-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "An extraordinary story of love's transcendent power.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Rymer"],
      "runtime": 105,
      "synopsis": "Harry(John Lynch) and Kate(Jacqueline Mckenzie) are schizophrenics.Their first meeting is at one of the group sessions they have to attend at the clinic where they are both outpatients.From the first moment Harry sets eyes on Kate, he is in love. She is intense, with dark eye-pencil lining her eyes, and strawberry blonde hair. Harry tells his brother later, I worship her. But he hasn't spoken to her yet. Harry is staying with his brother(Morris) and his family. One day after their therapy sessions; when Kate's boarding a bus, Harry follows her. Kate realizes she is being followed, and moves to the front of the bus. Harry follows her. The bus arrives at a stop, and Kate suddenly flees out the back door. Harry races after her. He chases her through a park and she finally stops and confronts him,\"what are you doing? Why are you following me?\". He is too shy to answer. In their cordial conversation she reveals that during childhood she was raped by her father.Suddenly she remembers something & hurries back towards the bus stop. She races back to the sidewalk, but the bus had left. She panics, dropping her bag, she screams at Harry,\" I needed to be on that bus. I need a television!!!\". Harry grabs her hand and she runs along with him. They run across a bridge towards the city. He takes her to a store with TVs airing Wheel of Fortune. Kate crouches on the sidewalk, taking out her journal, she starts watching the show, and writing things down. She tells him that she gets messages at Wheel of Fortune from Astral, her guardian angel. Kate glances up at Harry and barks,\" And dont you dare laugh at me\". He shakes his head, he wont, he wont laugh. Harry and Kate's love affair heats up immediately. They devour one another in love scenes passionate and raw. Harry has Kate over for dinner at his brothers house. She wears a skimpy orange dress showing too much skin. She nervously smokes. She refuses to use a fork, and tries to cut her meat with a spoon, for reasons known only to her. Morris' wife asks Kate how things are going with Harry, and Kate replies, freely, somewhat flatly, Hes the best lover Ive ever had. Hes got a sideways move that rocks my world. Later Harry reveals that they have mutually decided to move in together. Harry and Kate both intend on taking up a job.They move in together, and there are funny scenes where they look through apartments at the realtors office and add up the numbers of the addresses and apartment numbers, and reject places because they are not numerically calming. They believe that there is a vast interconnected system out there, and if they can just align themselves correctly with the messages they are being given, from Astral, they will be safe.Kate becomes pregnant. Morris and his wife express concern on their decision to have a baby & after an heated argument with his brother Harry declares that he too has a right to have a family like him. As Harry walks away from them Kate follows him. Harry and Kate stand on the edge of the bridge, in the golden light of sunset, fearful of what will happen with their baby, fearful of how they will survive, afraid of the madness coming again knowing what that is, what that will mean and they flap their arms like the birds, cawing, cawing, cawing reaching out to one another to grasp hands, worried, quite evident in their eyes, but also laughing. Laughing not because they are happy. But laughing because all they have is the moment. In order to avoid any complications to the baby,so that it may not inherit their disorder Kate decides to go off her anti-psychotics for the safety of the baby. Harry, in an act of solidarity, goes off his as well, and they sit over the toilet, flushing them down, the bright green pills whirling down the drain, reminiscent of the image of the wheel of fortune on TV, incessantly spinning, colors over colors, telling them the future.But things go haywire for them after an awkward incident at a shopping mall wherein we see Kate's hallucinations reappear, haunting her to flee from the scene to a dark corner of the mall. Harry comforts her but the lack of medication affects him as well for the other day he is fired by his employer after revelation of his medical condition. Harry's hallucinations torment him as he pounds at the side of his head.Meanwhile Kate realizes that Harry has lost his job and this further adds to her already deteriorating mental state.Traumatized she locks herself up in a bathroom from where she is taken to the hospital after Morris discovers her crouching in the bathroom. At the hospital Harry is informed that Kate doesn't want to see him anymore and she would undergo her treatment in the hospital. Harry later finds her and helps her escape from the hospital after showing her a phrase(Run & Hide) that appeared in Wheels of Fortune. He hides her at a developing infrastructure site without informing Morris with whom now he lives. Harry later returns to his room to find Kate's medication but Morris confronts him and he agrees to send her back to hospital & reveal her whereabouts if Morris would bring her medication. Kate has a sudden miscarriage and she's rushed to the hospital. In the hospital, Kate dies while giving birth to their daughter. Harry asks his brother to take care of his daughter and walks to the bridge where Kate and Harry once stood to \"fly\". Harry climbs to the top of the railing imagining Kate by her side telling her she won't wait for too long there.As Harry gazes the sun, the screen fades and Harry's further actions are open for interpretation.",
      "writers": ["Michael Rymer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112362/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwMDkzNTU5Ml5BMl5BanBnXkFtZTcwMTkzMTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Lynch, Jacqueline McKenzie, Colin Friels | See full cast and crew »"],
      "reviews": [
         "When I first saw this film, I felt torn apart by the complexity of love. In particular, the love that exists between the lead characters. It is hard enough in the \"real world\" for people to have a love without the interference of others. In this film, the love story is exceptional. The two people have schizophrenia, an illness not of split personality, but of hallucinations that don't exist & voices that are heard but have no face. So, under all this still lies the human need for love. And these two people find it. Pure & simplified. Until things start to go wrong again. The challenges that faced the lead actors was to make believable both their love story & their illness. In particular, Jacqueline McKenzie is an amazing & articulate actor & remains true to her character's situation & beliefs throughout the film. I decided to make a point of mentioning the film for it's true portrayal of a greatly misunderstood & yet common illness. For all the films about cancer, alcoholism & other illnesses, mental illnesses are still generally misunderstood & ignorantly ill-portrayed. Previous to \"A Beautiful Mind\", this is one of the films that portrays this illness both realistically beautifully, and for those reasons alone it can help people to understand more about an illness that most probably affects someone you know.",
         "If you read the plot description of this film - two patients in a mental hospital fall in love, decide to move in together, one of them gets pregnant, and the two decide to go off medication for the baby's sake, with tragic results - you might think this is an American-type disease-of-the-week movie, but you'd be wrong. This is a tough and wrenching film which doesn't shy away from the tough questions. The ending is a puzzlement, because I'm not sure what it means, but other than that, this is powerful stuff. John Lynch and Jacqueline McKenzie deserve to be commended, as does writer-director Michael Rymer.",
         "The issue presented in the Australian movie 'Angel Baby' is one that is very close to me. I am talking about mental illness and how destructive any of them can be to individuals that get it. I have been affected by both depression and a mild case of schizophrenia (the illness that is shown here) and the highs and lows that come with those illnesses. This film is important as shows what it takes to overcome a mental illness and what affects they can have on your life and those around you. A funny, haunting love story, 'Angel Baby' tells the story of two lost souls, Harry and Kate, who fall in love against the odds and find hope strength in each other to accomplish the impossible. Full of humour, compassion and hope, Angel Baby is a testament to the power of love and a roller-coaster journey to the magical fringes of the human psyche. There is a lot to like about and take in with this movie. The writer /director Michael Rymer has bought a very interesting Australian movie to our screen. The story that we get here is one that is probably not all that uncommon, but is not known in our community. It accentuates the difficulties that people have when they are battling any mental illness and what rash choices they make when they are unable function mentally. This story also had the wonderful aspects that show Kate's obsessions of seeing messages from a TV game-show, while I am glad that the story shows both Kate and Harry choosing a life that they are probably not able to keep in complete control of because of their mental illness issues. Then as director, Rymer makes some very impressive moves. I love how the movie makes us as the audience feel like we are experiencing what the mental illness is like that both Kate and Harry actually have. I believe this mainly through the extraordinary camera work that is used, with all of its different views and angles. This aspect of the movie is helped by its cinematographer Ellery Ryan, who captures it all perfectly. I also love the choice of scenery used in 'Angel Baby', such as the shots of the city and the grand 'West gate bridge', which is used to great effect in the film. The leading cast to this movie was outstanding. Harry (John Lynch) and Kate (Jacqueline Mackenzie) are wonderful on screen together. They were both very convincing as both very mentally ill patients and it is through their performances that I believe this. There were some very real moments (well that is what they felt like for me) in this film where I believed these actors were suffering a mental illness for real. One such incident is when Kate is totally taken aback by being hit by kid skate-boarding at the local shopping centre. What I saw was a haunting sort of vision, one that I can relate to, and one that I was glad too see. The rest of the cast is pretty good as well. Harry has concerned friends, the Goodman's. Morris (Colin Friels) and Louise (Deborra-Lee Furness) both show at individual times that they are truly concerned with the situation they find Harry and his girl in. Their son, Sam Goodman, (Daniel Daperis) was another important character, who has a terrific scene with Harry, about being unable to sleep one. What Harry helps Sam out with is ironic, considering the situation that we see Harry gets himself into. I watched Angel Baby and 'Cosi', (another Australian movie, which deals with mental illness) back to back. Cosi was not as good as Angel Baby in my view, but the two films are completely different. One is from a totally serious point of view, while the other is coming from the comedic perspective about mental illness. I am still yet to see the classic Australian film 'Shine', starring Geoffrey Rush. But from what I have been told, it must be another worthwhile movie about how mental illness affects people, even brilliant and successful individuals. I am a firm believer that mental illness is an issue in society that is culturally misunderstood by most people. I believe this because people are either misinformed or misdiagnosed, or they immediately dismiss a person with such a problem, saying either 'they are making excuses for themselves' or 'they should just snap out of it'. I personally hate that point of view as it is not only arrogant, but it is also a very naïve point of view in my opinion. I say that compassion should be shown instead of criticism, while understanding and sensitivity should be learnt instead of straight dismissal and sheer arrogance. I guess my only criticism of Angel Baby is that it has a very limited cast, but perhaps that was a deliberate move, to show both Harry and Kate, for as long as they could. I would have preferred a bit bigger cast. I am glad that we were able to see all sorts of ideas, visions and images presented about how mental illness can affect people in 'Angel Baby', and are eternally grateful that an Australian movie is willing and daring enough to show it. For that, I thank the makers and actors from the bottom of my heart. CMRS gives 'Angel Baby': 4.5 (Very Good \u0096 Brilliant Film)",
         "Stunning, heartfelt film by little-known director Rymer is most notable for brilliant performances by Lynch and McKenzie, the latter in her best role ever. Maltin called it (incredibly) `over-elaborate treatment of the subject matter' - it's quite the opposite, as mental illness is far too often swept under the carpet in today's society. Friels' character is expertly written, as a brother who cares for his troubled sibling but can't offer any solution, and who doesn't want his family being dragged into Harry's problems. The film's significance was reflected in its performance at the AFI Awards.",
         "I was continuously moving towards my TV-set to help those two youths struggling to overcome their illness and trying to manage in a world who doesn't cope with their needs. Excellent acting from all parties. The film appealed to my rushing out to find someone to comfort. I'm an older grown-up, but I have never in my entire life been so moved by a movie. I loved it.",
         "I saw Angel Baby by accident in the early hours of one morning, and I was pleasantly surprised by what I saw. It is basically a modern day love story, with some tragic consequences. A seemingly normal but schizophrenic Harry sees the mentally unstable and superstitious Kate, and it is love at first sight for Harry, but Kate needs some convincing. Eventually the two are infatuated with each other and are caught up in a passionate relationship, and it all goes downhill from there for Kate and Harry. Truly brilliant and emotional performances from John Lynch (Harry), and the truly beautiful Jacqueline McKenzie (Kate), with great support from Colin Friels as Harry's brother.",
         "The two movies I have cried most to have to be this one and Grave of the Fireflies. Both are excellent movies that moves your very soul. If you are going to watch this make sure you watch it with someone you love and can hug.",
         "I don't know enough about psychosis to comment on the accuracy of the film, but it was certainly convincing to me. I can only hope that Australian society is as sympathetic as it is presented here. As a matter of fact, my personal contact with a psychotic showed American society off the screen much more civilized than Hollywood does. All the actors come through well, but my prize would go to the woman. Some may think the ending a cheap shot, but it's hard to stop a realistic film from going on forever.",
         "In terms of drawing a direct and raw emotional response to the characters, Angel Baby is probably the best film I have ever seen. Because the characters go through some torrid times, the viewer is drawn into some very unpleasant territory. But I emerged emotionally fulfilled, and really feeling as though I had connected with the mental state of the characters. If this is what you seek from a movie, then please see this one.",
         "this movie was showed today during abnormal psychology lecture in Haifa university. it is a beautiful movie with a beautiful soundtrack. it made me a bit sad for the rest of the day..."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Astral Films",
         "Australian Film Commission, The",
         "Australian Film Finance Corporation (AFFC)"
      ],
      "summaries": ["Two schizophrenics meet during therapy and fall passionately in love. Ahead of them lies the inevitable road to disaster...one they share to the end."],
      "budget": 0
   },
   "movielensId": 1428,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-09",
      "dvdReleaseDate": null,
      "directors": ["Michael Rymer"],
      "runtime": 105,
      "movieId": 1428,
      "title": "Angel Baby",
      "mpaa": null,
      "actors": [
         "John Lynch",
         "Jacqueline McKenzie",
         "Colin Friels",
         "Deborra-Lee Furness",
         "Geoff Brooks",
         "Humphrey Bower",
         "Alex Pinder"
      ],
      "imdbMovieId": "0112362",
      "originalTitle": "Angel Baby",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["rx9wZfaxIfQ"],
      "plotSummary": "Two schizophrenics meet during therapy and fall in love. Unfortunately they are on a road to nowhere...",
      "tmdbMovieId": 2892,
      "avgRating": 3.42643,
      "releaseYear": "1995",
      "numRatings": 333,
      "posterPath": "/aCvCn3PIdnEAPpHreswg2YXhrEI.jpg"
   }
}