{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120414",
      "video": false,
      "title": "Underworld",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Johnny Crown / Johnny Alt",
               "gender": 2,
               "credit_id": "52fe492d9251416c910a51e1",
               "name": "Denis Leary",
               "profile_path": "/lnk4HjUeqDlT6Kg9PaQsVIDpl56.jpg",
               "id": 5724,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Frank Gavilan / Frank Cassady / Richard Essex",
               "gender": 2,
               "credit_id": "52fe492d9251416c910a51e5",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Dr. Leah",
               "gender": 1,
               "credit_id": "52fe492d9251416c910a51e9",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ned Lynch",
               "gender": 2,
               "credit_id": "52fe492d9251416c910a51ed",
               "name": "Larry Bishop",
               "profile_path": "/blmoGBCRnKtkatY4F6aB7uCfWzz.jpg",
               "id": 34721,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Will Cassady",
               "gender": 2,
               "credit_id": "52fe492d9251416c910a51f1",
               "name": "Abe Vigoda",
               "profile_path": "/luWKPNb58IgJ2ovrtgPAzHGLLYL.jpg",
               "id": 3093,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe492d9251416c910a51f5",
               "name": "Traci Lords",
               "profile_path": "/40n1G3p2sGxnsU0m8tfIlthMatA.jpg",
               "id": 10826,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Stan",
               "gender": 2,
               "credit_id": "52fe492d9251416c910a51f9",
               "name": "Robert Costanzo",
               "profile_path": "/vyUeNk56Yv7xyHztgVa8UBEIasu.jpg",
               "id": 33492,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Smilin' Phil Fox / Todd Streeb",
               "gender": 0,
               "credit_id": "59fc32c3c3a3681a3f023a1e",
               "name": "Jimmie F. Skaggs",
               "profile_path": null,
               "id": 133771,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dan 'Iceberg' Eagan",
               "gender": 2,
               "credit_id": "59fc32d1c3a3681aa5029364",
               "name": "James Tolkan",
               "profile_path": "/mB9vHaDMzy5Z5pPWOliA6MJ3gTq.jpg",
               "id": 1072,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Joyce Alt / Simone",
               "gender": 1,
               "credit_id": "59fc32dd92514113a6025679",
               "name": "Heidi Schanz",
               "profile_path": "/svkz78fByMnD4K5LbQx903ao5I0.jpg",
               "id": 11321,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Julianne",
               "gender": 1,
               "credit_id": "59fc32e9c3a3681abb0265ee",
               "name": "Cristi Conaway",
               "profile_path": "/5bbfOgGXmNf2MHQn0f6q7aY12bx.jpg",
               "id": 5130,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Janette",
               "gender": 1,
               "credit_id": "59fc32f392514113bf02639d",
               "name": "Angela Jones",
               "profile_path": "/p7pNCt4uBTDk9kRkPU3BFfXfEPq.jpg",
               "id": 71836,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Mitch Reed",
               "gender": 2,
               "credit_id": "59fc32fe925141138b027db6",
               "name": "Michael David Simms",
               "profile_path": null,
               "id": 116048,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Ava",
               "gender": 0,
               "credit_id": "59fc3305c3a3681abb02660c",
               "name": "Amy Moon",
               "profile_path": null,
               "id": 1681400,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe492d9251416c910a51d7",
               "name": "Roger Christian",
               "profile_path": null,
               "id": 5058,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe492d9251416c910a51dd",
               "name": "Larry Bishop",
               "profile_path": "/blmoGBCRnKtkatY4F6aB7uCfWzz.jpg",
               "id": 34721,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59fc3348c3a3681abb026657",
               "name": "Robert Vince",
               "profile_path": null,
               "id": 61244,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59fc3352c3a3681a1b0284f0",
               "name": "William Vince",
               "profile_path": null,
               "id": 5358,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59fc3366925141138b027e17",
               "name": "Anthony Marinelli",
               "profile_path": null,
               "id": 28155,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "59fc337392514113a60256fe",
               "name": "Steven Bernstein",
               "profile_path": null,
               "id": 6899,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "59fc3380c3a3681acd02687f",
               "name": "Traci Lords",
               "profile_path": "/40n1G3p2sGxnsU0m8tfIlthMatA.jpg",
               "id": 10826,
               "department": "Sound",
               "job": "Songs"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.500969,
      "production_countries": [],
      "id": 85242,
      "vote_count": 2,
      "budget": 0,
      "overview": "A crook sets out to get revenge on the thugs who hurt his father in this bloody noir-style crime drama. After being released from prison, Johnny Crown (Denis Leary) goes after Frank (Joe Mantegna), one of the mobsters involved in a series of Father's Day killings. But Johnny isn't certain Frank is responsible for his father's injuries and seeks help from a sex therapist (Annabella Sciorra) to make sure he's got the right man.",
      "similar": [],
      "original_title": "Underworld",
      "runtime": 95,
      "poster_path": "/g24CCEoFbyNoSATL3bMWWZbJjhE.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-06-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Sometimes revenge is the best therapy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roger Christian"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Larry Bishop"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120414/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwODQ1MzUxNl5BMl5BanBnXkFtZTcwODcyNDUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Denis Leary, Joe Mantegna, Annabella Sciorra | See full cast and crew »"],
      "reviews": [
         "Why everyone in general knocks this movie is beyond me. No it's not the greatest gangster film ever made, but is certainly far from the worst! It's Dennis Leary's show, and he does an outstanding job. Sort of like a funnier, quirkier, and slightly less hard boiled version of Pulp Fiction. Again NO it's not the Godfather or Goodfellas, and is not a \"classic\" It is a minor gem that deserves far better than the lousy 4 point something it gets here. Check it out and decide for yourself! for fans of the genre you won't be wasting your time.",
         "This film is really the close cousin of another film called \"Trigger Happy\" with Richard Dreyfuss, anyway, this film is set in the same Other Universe, one where there are no police and no rules. Johnny Crown (Leary) is out to get the people who turned his father into a vegatable and all hands point to the mysterious Frank Gavilan. Some have said that this is a Tarantino or John Woo wannabe, no way! The writing by Larry Bishop is frequently hilarious (he also wrote Trigger Happy), he keeps the action moving, from Leary's endless one-liners to the idea that the man who put a bullet in his fathers head might be just too close to home. Cool moments in the film include Ned (who killed Ed) going back to his roots, this means getting rid of everything, including money, jewels, car and Traci Lords, the hitmen shooting up the bar for something to do and that sandwich! It came out in the wake of Pulp Fiction, but other crime movies came out then too, good ones at that: Trigger Happy, City Of Industry, Albino Alligator etc. Underworld might be obscure, I own the video, but I'll never trade it in until I get the DVD (unavailable in the UK), that's how good this film is. Absolute gem. 10/10",
         "This entire movie takes place in the dark, which is unfortunately where it leaves the viewer unfortunate enough to waste his time watching \"Underworld\". This is exactly the kind of movie that is easy to hate. It introduces endless characters with no development. People we don't know are getting shot for no reason. The film is supposedly hip, but in reality is nonsensical, long, boring, self important crap. No police are involved, even though gangland assassinations are taking place on a schedule that makes Al Capone look like a small time hood. The dialog is repetitive nonsense that has nothing to do with what is on the screen. This is a totally failed film that should be avoided. - MERK",
         "I picked up this movie for a few dollars at a local discount store in town. It advertised Denis Leary & Joe Mantegna, plus the box promised \"In the style of The Usual Suspects and Reservoir Dogs\". I bought it and threw it on my DVD shelf, not really thinking about it. But last night I was in the mood for some crime, so I threw it in. I really don't know what to say. The film just kind of falls flat with a whole lot of unnecessary dialogue. I think they were trying to go for a Tarantino thing by having incredibly long scenes of Leary explaining where he wants his money to go or the beauty of Rodgers and Hammerstein, but while somewhat humorous in the end it just seems like padding. That's not to say Leary makes it boring, quite the opposite. Leary is well known for his tirades. And for what he has to work with, he actually keeps the long dialogue bits somewhat watchable. Joe Mantegna does his best, but his role just isn't very well written. He's mostly there to be a quiet straight-man for Leary's insane ramblings. When given a chance he has shining moments, but those are few and far between. But as for the rest of the film, it just kind of falls flat without any fanfare. The script is too long and kind of confusing, if only for the fact that major plot points are surrounded by stilted dialogue chunks so you can't really pay attention to grab hear them. Editing is very by the book, however there's a few aesthetically pleasing moments of lighting and direction that might surprise you. All in all, if you're a strong fan of either Leary or the modern crime genre, it's worth a look for only it's hour and a half run time. But if you have something better or just not in the mood, this film isn't going to turn any heads.",
         "This very underrated film is a great example of modern film noir. It is classic Leary, and I heartily recommend it if you like your gangster movies quirky and twisty. The ending is a shock, and the path to get there, the story told by Dennis Leary's character is a wild ride. Give this film a chance, it deserves it. I read a review which compared the film unfavourably to Pulp Fiction, it is unfortunate that title was mentioned on the back of the DVD, don't blame anyone but the marketing dept. Underworld has more in common with The Two Jakes than Pulp Fiction. As you can see I loved this film, it gets a massive thumbs up from me.",
         "This is one of the best black comedies that I have ever seen! Oh, it's highly, highly, highly underrated! I've found the tape in action and in drama, but never in comedy, where I feel that it belongs! Take for example the first scene involving the Red Car: Slow buildup, absolutely bloody execution, glass and flesh everywhere; and then an approving nod and the gunner exclaiming in nonchalant fashion \"This is gonna be the best goddamn father's day I've ever had.\" It doesn't stop there. We have the execution of a beyond-amazingly beautiful girl (Traci Lords) for nearly nothing other than a bored antagonist's whim; we don't even really know if she's suspected of cheating on him... he's just... bored. Add to this a hilarious bar scene that might begin something like \"a bunch of assassins walked into a bar...\"... they're tired of waiting, so they clean their guns... they're bored at the delay, so they shoot the bottles; they're frustrated at their employer's procrastination, so they pull out automatic weapons and unload on the bar, the bartender... and finally the outright hilarious shot of the scariest of them putting a gun to his head: they shoot each other. Yes, it's terribly violent; yes, it's not for everyone. But this is the one of the most fabulously overlooked films ever! Awesome! Check it out, but ignore the section you found it in.",
         "Spoilers! While this film is entertaining if you like violent mafia related movies, it's wholly unoriginal and confusing to boot. The main ingredient seems to be Denis Leary being violent, causing violence and enjoying it all. This is also the best ingredient. The other main ingredient is Joe Mantegna being, well, Joe Mantegna like he always is. Not bad either. But the plot is weak. It's Cape Fear combined with Pulp Fiction and Reservoir Dogs. But the main rip-off has to be John Woo. For two scenes. 1) The scene in which the 7 hitmen shoot eachother is a classic John Woo scene. 2) The final scene where the 4 people hold guns to eachother is basically a clone of the classic standoff scenes John Woo always uses. Furthermore, the scenes of the trunk copy John Woo. The usage of two guns copies John Woo (Dan \"Iceberg\" Eagan) and the list goes on and on. But hey, not all movies can be original.",
         "This movie is an obvious rip-off of Underworld USA starring Cliff Robertson. You owe it to yourself to invest a couple of hours and watch the original. I found this one to be disjointed and hard to follow, with a lot of scenes that didn't make much sense. I'm not opposed to violence in movies but this whole thing seemed to be nothing more than an excuse to blow away one person after another, many of whom were only marginally connected with the storyline. With everyone else getting killed, all through the movie I wondered why Frank didn't just blow Johnny's brains out. He certainly could have and Johnny sure didn't act like someone that could be trusted. Another thing that bothers me is the sex scenes; why do these people have sex with their clothes on? Is that supposed to turn us on? Surely they didn't think they had a shot at a PG rating. Nothing in this movie seemed to play out naturally. as if one were watching people in real life, instead it was done in a heavy-handed and shallow manner.",
         "I share the same opinion regarding Underworld as the previous comment. I sat through the 1.5 hours of this movie wondering what this story was all about and more importantly why the author and/or director had made certain decisions for the plot. On the whole I found the movie to be unbalanced, consisting of strange sub-plots which (IMHO) actually had nothing to do with the movie. Furthermore, when writing a thriller I'd say you want your viewers to wonder about the story and not about the way the story is filmed...",
         "The key to \"Underworld\" (1996) is that it's written by Larry Bishop, who also acts in it. Bishop is Joey Bishop's son. Joey was a comedian with a dry wit and sense of humor, and this is what Larry gives us here. Larry seems to have picked up this style of black comedy from his father. This appeals to some people, but tends not to be that funny to others. Judging it on its own merits without bias against the relative remoteness and quirkiness of this kind of humor is hard. One has to adopt a cynical attitude to get it and think it's funny. Some of it parodies other films. On the whole, I think this comes out pretty much average as black humor or below par, a 5 at best. Why? Basically it's a writer's movie, and from there it's an actor's movie. It's a showcase for Denis Leary and Joe Mantegna. Leary does a great job. Mantegna does too. I always enjoy Mantegna's work, or should I say his \"presence\". He has a unique delivery of lines and even intonation, sort of clipped. You always wonder what he's up to really, like he's concealing his emotions. He always seems the same and yet he doesn't do an injustice to the character. It seems that all the characters are Joe Mantegna. It's really not so. In this one, he shows some anger at times. At others, he has a deep negative feeling toward his father (Abe Vigoda) for some unspeakable division of the past. To Leary he shows impassive courage and sometimes boredom. Mantegna really does act and get into character. He also underacts, remaining always cool, in these fascinating performances. His love-making with Anabella Sciorra is not what anyone would call passionate. Leary has rather long monologues and does as well as anyone can with some of their basic flatness, not really being that funny because they're not incisive enough or deep enough to get to us really. Some of it falls into the \"who cares?\" category. If there's going to be a monologue on psychopath vs. sociopath, at least make it witty. Larry Bishop is no Oscar Wilde, and that's for sure. Leary is doing an extended routine for Larry Bishop. It's almost a stage play. The plot is not important here. There's some big and violent shoot-em-ups. The first one is like a St. Valentine's Day massacre. This serves no purpose, unless it's supposed to be a parody and thus funny. But it falls flat. It's pointless. How many people find slaughter to be amusing? This kind of material does not have broad appeal. But if its popularity is on the rise because of other movies that do the same kind of thing in an increasingly decadent strain of our culture, this one is at best average."
      ],
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "productionCompanies": [
         "Trimark Pictures",
         "Keystone Pictures",
         "Underworld Films"
      ],
      "summaries": ["After spending seven years behind bars, Johnny Crown is back on the street, with lots of cash, a psychotherapy degree and a burning desire to find and punish gangsters who had killed his father. One of the people involved is Frank Gavillan, who unwillingly follows Johnny in his demonical and ultraviolent crusade."],
      "budget": 0
   },
   "movielensId": 1430,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-06-01",
      "dvdReleaseDate": "1998-05-12",
      "directors": ["Roger Christian"],
      "runtime": 95,
      "movieId": 1430,
      "title": "Underworld",
      "mpaa": "R",
      "actors": [
         "Denis Leary",
         "Joe Mantegna",
         "Annabella Sciorra",
         "Larry Bishop",
         "Abe Vigoda",
         "Traci Lords",
         "Robert Costanzo",
         "Jimmie F. Skaggs",
         "James Tolkan",
         "Heidi Schanz",
         "Cristi Conaway",
         "Angela Jones",
         "Michael David Simms",
         "Amy Moon"
      ],
      "imdbMovieId": "0120414",
      "originalTitle": "Underworld",
      "genres": [
         "Drama",
         "Action",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A crook sets out to get revenge on the thugs who hurt his father in this bloody noir-style crime drama. After being released from prison, Johnny Crown (Denis Leary) goes after Frank (Joe Mantegna), one of the mobsters involved in a series of Father's Day killings. But Johnny isn't certain Frank is responsible for his father's injuries and seeks help from a sex therapist (Annabella Sciorra) to make sure he's got the right man.",
      "tmdbMovieId": 85242,
      "avgRating": 3.20852,
      "releaseYear": "1996",
      "numRatings": 223,
      "posterPath": "/g24CCEoFbyNoSATL3bMWWZbJjhE.jpg"
   }
}