{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "based on novel",
         "id": 818
      }],
      "imdb_id": "tt0110425",
      "video": false,
      "title": "The Machine",
      "recommendations": [],
      "backdrop_path": "/iXWSzm021PLxw8Hzz9MIMzqpr1u.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d599251416c91112fbd",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d599251416c91112fc1",
               "name": "Nathalie Baye",
               "profile_path": "/1oDCTomK09eXEZwMTniNNciH7zp.jpg",
               "id": 136761,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d599251416c91112fc5",
               "name": "Didier Bourdon",
               "profile_path": "/llffnXLuelL2gCu6LFH7aPiva4f.jpg",
               "id": 59031,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d599251416c91112fc9",
               "name": "Natalia Wörner",
               "profile_path": "/1TzcqAk4TpBRbKidN3rwBfmlKWh.jpg",
               "id": 38541,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d599251416c91112fcd",
               "name": "Julie Depardieu",
               "profile_path": "/1CqOj8rs54oO4F6MEbefYkc9mfT.jpg",
               "id": 37920,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4d599251416c91112fb9",
            "name": "François Dupeyron",
            "profile_path": null,
            "id": 5005,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.777689,
      "production_countries": [],
      "id": 197537,
      "vote_count": 3,
      "budget": 0,
      "overview": "This deftly made French psychological thriller terrifies with its exploration of an experiment gone horribly wrong. Dr. Marc Lacroix, a psychiatrist specializing in brain functions, is obsessed with the link between mind and spirit. To find his link he studies the criminally insane. He builds a secret machine, known only to his mistress Marianne, in which he hopes to exchange minds between humans. He simultaneously wants to help the mentally ill recover, and he wants to experience their madness. He chooses the psychotic killer, Zyto, a man who stabbed at least three women, for his experiment. The initial experiment is successful and the two exchange minds. But trouble ensues when Zyto refuses to reverse the switch. There is little Marc can do when Zyto takes over Marc's life, and more ominously his wife and child whom are unknowingly in mortal danger. Marc, encased in Zyto's body, is returned to the asylum. Will Marc's wife recognize the danger? Will Zyto kill again?",
      "similar": [
         281957,
         101299,
         49529,
         6114,
         336843,
         133805,
         521,
         449176,
         392044,
         182560,
         1586,
         1903,
         2048,
         65754,
         198663,
         5503,
         116,
         562,
         75780,
         299687
      ],
      "original_title": "La machine",
      "runtime": 96,
      "poster_path": "/o7eK0ItZhqrQm8E4BTsRmili3ad.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1994-05-28",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["François Dupeyron"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "René Belletto",
         "François Dupeyron"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0110425/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDQ4NjMwMDA4Nl5BMl5BanBnXkFtZTYwMTQzNjk4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gérard Depardieu, Nathalie Baye, Didier Bourdon | See full cast and crew »"],
      "reviews": [
         "This was one of those rare cases in which the opposite occurs: a movie that should have been stupid and hokey but turned out to be well-done and a good thriller. Yes, a very pleasant surprise. A man invents a machine which can switch the inward beings (at least the brain) of two humans so....the doctor winds up being a killer while the killer becomes him, the doctor in actions and thoughts. This \"fact\" is hidden because the two people still have the old face and body of the person they used to be, so no one else can see the two people have switched \"identities.\"\" Anyway.....there is very good suspense in this film as the good guy tries to save his wife and family from being killed by the deranged human. Yeah, I know....it sounds confusing and stupid, but it isn't. The film also boasts a few shocking scenes and twists at the end. Recommended.",
         "\"La Machine\" is a violent, very well-made thriller, which proves that when the French aren't too preoccupied with \"art\" or \"social shock\", they can make a genre movie just as good as any similar American product. The director shows remarkable attention to detail, and the performances are versatile enough to help you \"buy\" the various transformations of the characters. Not an exceptional movie, but a gripping one. (***)",
         "A psychiatrist (Gerard Depardieu) and his woman-stabbing patient accidently exchange minds with a machine (the machine) he developed. The maniac overthrows him before the transfer-back process and stays in the body. Now the psychiatrist is locked away in the clinic and the madman is at home with the psychiatrist's wife and child. Queer sounding story but nevertheless a fascinating, exciting \"mind-exchange\" movie. 8/10",
         "I wouldn't call La machine a perfect movie, but it is well done and gives good thrills mostly by fitting music and cinematography, while hardly displaying gore. You can create enough tension by just showing a door-knob slowly opening. Having seen 36 Quai d'Orfevres and Boudu in the last few days, I must say Gérard Depardieu is impressive in yet another type of role (or should we say, three?) Only in the end I lost track who is now in whose body... To blame this film to be a \"pre-make\" of Face/Off made three years later is obviously silly. But I notice quite some similarities with the cutely named \"The Man Who Changed His Mind\" (1936/I), with Boris Karloff - and, of course, many dissimilarities as well. I liked this movie, and give it 7/10.",
         "***SPOILERS*** ***SPOILERS*** Those who think that this is the worst film ever made are completely missing the point.I know that \"La Machine\" has its share of flaws,but it's still exciting and it can be a real gut-puncher at times.Depardieu is excellent in the different personalities he has to affect,the rest of the cast is also splendid.yes,the similarities between this one and overrated John Woo's actioner \"Face Off\"(I love his Hong Kong stuff,but films he does in Hollywood are pathetic crap,though)are obvious.So is \"La Machine\" worth watching?Of course yes,but beware:there are two extremely brutal and disturbing knife killings in this film.Especially the last scene when young boy stabs to death his mother is really harrowing.10 out of 10.",
         "Dr. Lacroix (Depardieu) has constructed a machine which will allow him to exchange personalities with one of his patients, a misogynistic multiple murderer (Bourdon). This thriller is a variation on the Frankenstein theme with the monster as a serial killer's mind unleashed in a psychologist's body. The film is under-budgeted and reliant on dialogue as many French films are. It can all seem a little overwrought and contrived at times, but still it's fairly good. Depardieu is convincing in the different personalities he has to affect. He is united with his frequent costar Nathalie Baye, although her role is a small one this time. There is even a very faint echo of the \"What makes a marriage?\" theme from their earlier film Le retour de Martin Guerre. So faint you probably won't notice.",
         "this film is superb. I found the idea excellent and do not remember having seen something like it. Depardieu is brilliant as usual one would say; he deserves very special acknowledgment for this film where his talent is more than useful and very well utilized. Didier Bourdon is also very good in a part quite different from what he usually does; he shows in this film that he can be much more of an actor than what he has be doing for years with Les Inconnus on the funny side (although this was very good too); Nathalie Baye is a good an actor as she is beautiful, and the little boy (Erwan Baynaud) should not be forgotten; he was only 11 when he played this film. This film should be much more famous and appreciated. I first saw it around 1995 when it first came out, and saw it again today (feb 2005) with the same pleasure. It definitely is one of the 12 best films I know.",
         "I really hate to admit this but \"La Machine\" has got a certain place in my all time greatest French movies top 10. (Same list includes remarkable classics from beloved \"Jean de Florette\" and \"Manon des sources\" to notorious \"Dobermann\".) \"La Machine\" may just be a laughingstock to anyone who appreciates an intelligent entertainment we normally expect to get from film industry of France. It's an undervalued movie. I like it, and I'm sure I'm not the only one. Plot is ridiculous but still, very effective and it totally grips the viewer to it's powerful hold and doesn't let go until the end credits breaks the excitement one can't help of having. Gérard Depardieu - who is without a moment of doubt one of the finest European actors ever - is (once again) the engine that keeps this movie rolling. His unshakable and stylish performance in the leading role is just fabulous. Great film, that's all there is to is. Couple of years later John Woo directed a fantastic little masterpiece called \"Face/off\" in Hollywood. Pay attention to the obvious resemblance.",
         "It's my first day on IMDb and my first move here will be to say to the world how awful is this movie. The worst i have ever seen in my life (and i used to be an horror picture fan so you can believe me, i have seen real Z movies). In La Machine, Depardieu plays like a puppet and Didier Bourdon is so ridiculous i felt ashamed for him, I really felt the Chill of Shame. Thanks God, the scenario worth nothing so nothing is wasted.",
         "Since the movie was made in 1994, it's difficult to say that the plot was inspired by the brilliant movie \"Face Off\", made in 1997. Nevertheless, while you're watching the movie, you can't help thinking about the 1997 John Woo movie where the main character trade place with a dangerous killer. In both movies, the \"bad guy\" ends up sleeping with the \"hero\"'s wife, he threatens the \"hero\"'s wife and kid. They also switch lives where the hero ends up in jail (or asylum) and the bad guy enjoy a comfortable life in a beautiful house, next to the hero's wife and kid. \"The Machine\" doesn't have the juice of \"Face Off\" because they don't go deeply into everyone's personality and life. It seems like a shallow replicate of the John Woo movie without the special effects and cinematography. Good luck !"
      ],
      "genres": [
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "France 2 Cinéma",
         "Hachette Première",
         "M6 Films"
      ],
      "summaries": ["Marc Lacroix is a psychiatrist, a student of the brain, with a rocky marriage, a mistress, and a ten-year-old son. He also has a secret laboratory where he's built a machine he thinks will allow him to penetrate the mind of any person hooked up to the machine with him. He tests it with Zyto, a psychopath who has killed three women. The machine fails and exchanges the men's brains. Zyto passes himself off as Marc, and Marc (now in Zyto's body) escapes from the asylum to the flat of his mistress. She tries to warn Marc's wife, exposing herself to Zyto. All are now in grave danger. Can Lacroix find a way to get Zyto back to the machine before irreversible damage is done?"],
      "budget": 0
   },
   "movielensId": 1433,
   "movielens": {
      "languages": [""],
      "releaseDate": "1994-05-28",
      "dvdReleaseDate": null,
      "directors": ["François Dupeyron"],
      "runtime": 96,
      "movieId": 1433,
      "title": "The Machine",
      "mpaa": null,
      "actors": [
         "Gérard Depardieu",
         "Nathalie Baye",
         "Didier Bourdon",
         "Natalia Wörner",
         "Julie Depardieu"
      ],
      "imdbMovieId": "0110425",
      "originalTitle": "La machine",
      "genres": [
         "Horror",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "This deftly made French psychological thriller terrifies with its exploration of an experiment gone horribly wrong. Dr. Marc Lacroix, a psychiatrist specializing in brain functions, is obsessed with the link between mind and spirit. To find his link he studies the criminally insane. He builds a secret machine, known only to his mistress Marianne, in which he hopes to exchange minds between humans. He simultaneously wants to help the mentally ill recover, and he wants to experience their madness. He chooses the psychotic killer, Zyto, a man who stabbed at least three women, for his experiment. The initial experiment is successful and the two exchange minds. But trouble ensues when Zyto refuses to reverse the switch. There is little Marc can do when Zyto takes over Marc's life, and more ominously his wife and child whom are unknowingly in mortal danger. Marc, encased in Zyto's body, is returned to the asylum. Will Marc's wife recognize the danger? Will Zyto kill again?",
      "tmdbMovieId": 197537,
      "avgRating": 2.2,
      "releaseYear": "1994",
      "numRatings": 70,
      "posterPath": "/o7eK0ItZhqrQm8E4BTsRmili3ad.jpg"
   }
}