{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "sports car",
            "id": 999
         },
         {
            "name": "puberty",
            "id": 1525
         },
         {
            "name": "diary",
            "id": 2913
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "dead body",
            "id": 10877
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "kite",
            "id": 210547
         }
      ],
      "imdb_id": "tt0106535",
      "video": false,
      "title": "The Cement Garden",
      "recommendations": [
         246166,
         49475,
         150906,
         73311,
         41653,
         87693,
         89873,
         69916,
         214157,
         48273,
         178907,
         49653,
         57489,
         72593,
         33560,
         1836,
         158864,
         39428,
         81375
      ],
      "backdrop_path": "/4TDPg0783dc2jVyJZbQ0jxslLz6.jpg",
      "revenue": 322975,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe461e9251416c7506dba9",
               "name": "Andrew Robertson",
               "profile_path": "/l8X5JRYxdRFQeKDu8cnyyldWOyu.jpg",
               "id": 31945,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Julie",
               "gender": 1,
               "credit_id": "52fe461e9251416c7506dbad",
               "name": "Charlotte Gainsbourg",
               "profile_path": "/hWUtcljrFsaSf9ZFTgjIoo4FxfQ.jpg",
               "id": 4273,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Sue",
               "gender": 0,
               "credit_id": "52fe461e9251416c7506dbb1",
               "name": "Alice Coulthard",
               "profile_path": "/5MmKQn7WQD8XB3yt9NzaBZ7Rmkg.jpg",
               "id": 143447,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Tom",
               "gender": 0,
               "credit_id": "52fe461e9251416c7506dbb5",
               "name": "Ned Birkin",
               "profile_path": null,
               "id": 143448,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe461e9251416c7506dbb9",
               "name": "Sinéad Cusack",
               "profile_path": "/r9eWOKN1WtE7RMDAwIhOpMRh3wL.jpg",
               "id": 11281,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Father",
               "gender": 2,
               "credit_id": "52fe461e9251416c7506dbbd",
               "name": "Hanns Zischler",
               "profile_path": "/zlVtIH2P4cZLyftZZcfFo037N3t.jpg",
               "id": 169,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Derek, Julie's Friend",
               "gender": 0,
               "credit_id": "52fe461e9251416c7506dbc1",
               "name": "Jochen Horst",
               "profile_path": "/gwGgAoIg2073Lgrw1tnxRvAcCl9.jpg",
               "id": 44636,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "William",
               "gender": 0,
               "credit_id": "52fe461e9251416c7506dbc5",
               "name": "Gareth Brown",
               "profile_path": null,
               "id": 143449,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Commander Hunt (voice)",
               "gender": 2,
               "credit_id": "52fe461e9251416c7506dbc9",
               "name": "William Hootkins",
               "profile_path": "/lGPSg64fsqbWS5PUFKsUKLNOqsx.jpg",
               "id": 663,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Truck Driver",
               "gender": 0,
               "credit_id": "52fe461e9251416c7506dbcd",
               "name": "Dick Flockhart",
               "profile_path": null,
               "id": 143450,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Driver's Mate",
               "gender": 0,
               "credit_id": "52fe461e9251416c7506dbd1",
               "name": "Mike Clarke",
               "profile_path": null,
               "id": 1439,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461e9251416c7506db99",
               "name": "Andrew Birkin",
               "profile_path": null,
               "id": 2355,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe461e9251416c7506db9f",
               "name": "Ian McEwan",
               "profile_path": null,
               "id": 36589,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe461e9251416c7506dba5",
               "name": "Andrew Birkin",
               "profile_path": null,
               "id": 2355,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59d9d64d925141252c03941e",
               "name": "Ed Shearmur",
               "profile_path": null,
               "id": 1999,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "59d9d673c3a3686227037e9e",
               "name": "Stephen Blackman",
               "profile_path": null,
               "id": 1058110,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59d9d69ac3a36861df03e9ac",
               "name": "Toby Tremlett",
               "profile_path": null,
               "id": 1902208,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.462789,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 14832,
      "vote_count": 28,
      "budget": 0,
      "overview": "After the death of her husband, the mother of Julie, Jack, Sue and Tom begins to suffer from a mysterious illness. Aware that she is going to have to go into hospital she opens a bank account for the children, so that they can be financially self-sufficient and will be able to avoid being taken into care by the authorities. Unfortunately she also dies and Julie and Jack (the older, teenage children) decide to hide her body in the basement so that they can have free reign of their household. Soon Tom has taken to dressing as a girl whilst Sue has become increasingly reticent, confiding only to her diary, meanwhile Jack and Julie sense an attraction developing for each other. However Julie's new beau, Derek, threatens to unearth the many dark secrets within this family as he becomes increasingly suspicious of Jack.",
      "similar": [
         14748,
         4476,
         8967,
         4347,
         235,
         873,
         10229,
         13,
         14,
         595,
         112160,
         81774,
         80752,
         11216,
         634,
         281957,
         340666,
         376867,
         452507,
         398818
      ],
      "original_title": "The Cement Garden",
      "runtime": 105,
      "poster_path": "/7bVAVixfrGcy8SeKElC8t2FynEd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Laurentic Film Productions",
            "id": 20147,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Neue Constantin Film",
            "id": 13096,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Torii Production",
            "id": 20148,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zweites Deutsches Fernsehen (ZDF)",
            "id": 4606,
            "origin_country": ""
         }
      ],
      "release_date": "1993-02-20",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Love knows no limits.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Birkin"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Andrew Birkin",
         "Ian McEwan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106535/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAxMTQwNTE3NTBeQTJeQWpwZ15BbWU3MDIxMzQzMzE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Charlotte Gainsbourg, Andrew Robertson, Alice Coulthard | See full cast and crew »"],
      "reviews": [
         "Disarmingly strange film about a family of children fending for themselves after first their father, then their mother dies. Oldest son Jack eschews responsibility, leaving next oldest Julie to handle the everyday chores. In the midst of all these devestating changes, Jack and Julie begin to develop a singularly unusual bond, one that is threatened when Julie invites the outside world into their private domain by dating an older man. This film sparks comparisons to the similarly themed OUR MOTHER'S HOUSE, but the two films differ dramatically. While the children in OUR MOTHER'S HOUSE construct an elaborate fantasy world for themselves(based in part on the dead mother's fanatic religious beliefs), there's no such pretentious in THE CEMENT GARDEN. The children live in a cinder block house, with a cement garden out back, on a plot surrounded by a flat, desolate looking landscape. There are several scenes where the children sit around saying nothing, doing nothing, something that never happens in the other film's active household. The costumes and household furnishings are nondescript; you can't figure out if this film is set in the sixties or the nineties. The overall feel is one of banality, lethargy, and a total absence of passion or vitality. Perhaps it's only in a situation like this that the relationship Jack and Julie have can flourish, and Jack can transform from a petulant, self-absorbed boy to a responsible, loving young man. Strange atmosphere, but very rewarding.",
         "It's a real pity that 'Name Of The Rose' scriptwriter Andrew Birkin hasn't directed anything since 'The Cement Garden' if this puzzling and disturbing movie is any indication of his talent. Birkin also wrote this superb adaptation of Ian McEwan's perverse and haunting novel. A hypnotic study of a family of children left to fend for themselves, while wrestling with their forbidden desires and obsessions, it crosses over into almost Ballardian territory. The casting of Andrew Robertson and Charlotte Gainsbourg as the androgynous older siblings is the main reason why this odd movie is so successful. To add to the incestuous overtones, Gainsbourg is Birkin's niece, and first gained notoriety duetting with her legendary father Serge on a pop ditty titled \"Lemon Incest\" while barely in her teens. The layers continue by Birkin casting his own son Ned as the younger cross-dressing brother. This is a very strange and beautiful movie. Highly recommended.",
         "The premise of offspring who try to hold their family together after parents' death or desertion has been done a number of times, most notably in \"Our Mother's House\" (1967), a little-known masterpiece directed by John Clayton. Here the emphasis is different though, concentrating on the developing intimacy between the oldest sibling Julie and her brother Jack. This is presented in a matter-of-fact and non-judgmental fashion, seeming to fit \"naturally,\" as Jack in fact says, with their increasingly weird circumstances. Be warned: there is much adolescent nudity here, including a wild transcendental dance-in-the-rain performed very well by Andrew Robertson. BTW, that scene is reproduced almost identically in \"Edges of the Lord\" (2001), but with a much younger boy. Ned Birkin, whom I suspect of being director Andrew Birkin's close kin (an irony unintended I'm sure) plays the cross-dressing younger brother, and his sub-plot is not developed, which is probably just as well since he exhibits little talent. I suppose this is included to emphasize the point that in a family untrammeled by conventional moralities, each individual is accepted with whatever modus operandi \"works\" for him or her. Not an altogether bad idea when one considers it\u0085",
         "Andrew Birkin's Fantastic The Cement Garden (based on Ian McEwan's controversial Novel of the same name.) follows awkward and feminine looking Teenager Jack (Andrew Robertson) and his family that live in a council-house surrounded by ruins somewhere in England. Jack is a hard to like character at first, spending most time either looking at himself in the mirror or roaming the ruins to read and masturbate. In contrast to narcissistic and rebellious Jack we have his sweet, reliable and compassionate sister Julie (Charlotte Gainsbourg) who appears to be wise beyond her years. There's also youngest brother Tom, who wants to be a girl (and gets bullied as result in school) and younger sister Sue, who is rather quiet and internal and keeps a diary. Jack's father is strict and eager to criticise all of his kid's actions. Jack's father is sick of keeping up with the garden and plans to cover it up with cement, asking Jack to help him out. Jack soon leaves the old man alone after getting a glimpse of his sister Julie's legs and disappears to the bathroom to masturbate to his own reflection. In a wonderfully edited scene, his father dies of an heart attack and lands with his face in the cement just as Jack is about to cum. Jack first seems careless over the death of his father and continues perving over his sister, and nearly rapes her following an erotic tickle fight. Soon after the death of the father their mother falls sick and is unable to get out of bed, since Jack is to lazy; his sister takes over doing most of the duties in the house. and more games start between the two siblings; after she bosses him around on his birthday she purposefully teases and arouses him with a handstand. (revealing her knickers to him) Julie seems to be very aware of the control she can have over her brother. And despite her motherly and mature nature might not be as sweet as she first appeared to be. It is impossible to take your eyes of Charlotte Gainsbourg, Crossing lines between Tomboy and Femme fatale. The mother passes away from her illness only months after the death of the father and the 4 children are now all alone. Afraid that they will be split up and put in orphanages they hide their mother's death by burying her under the cement. (Loved this scene when the cement ran over her dead body, simply beautifully shot and then followed by a flash-back of the kids burying their then living mother in the sand during a Family vacation) The photography overall is superb, from the agoraphobic eagle-eye views of ruins, grey skies, big black shadows and almost monochrome images that create a hostile and dead world where it would almost seem like the kids are the last survivors of a nuclear blast. Despite grief and alienation from the world, The kid's are in a way liberated; youngest boy Tom starts openly wearing dresses and a wig, while Julie starts dating a 30 year old, much to the jealousy and dislike of her brother Jack. I started to warm up to Jack, who despite spending so much time looking into the mirror actually seems like he never quite feel well in his skin, Andrew Robertson subtle performance is wonderful and as the film progresses all characters are extremely well fleshed out on screen, the dialogues feel natural (even if sometimes deliberately awkward) Also loved the tone and pacing; a hauntingly beautiful, sensual and gripping film. 10/10",
         "I like Ian McEwans writings, especially his early short stories, and this is a generous contribution to the haunting quality of his work (much better than Comfort of Strangers or A Good Son). Charlotte Gainsbourg is wonderful as the impish sister and Andrew Robertson does very well hiding behind his shag cut and masturbating in his private bunker. Camera work is wonderful in a fantastic location in middle of English dump sites with broken houses and bricks. Film´s strength rests not on incest but on superbly explicating a child´s value that it places on it´s family over the rest of the world. Reminds me of long ago isolated family vacations fighting and playing with siblings and forgetting everyone else, just stuck in time. Ignore the poor shock value trailer (``...but he is your brother!´´´) and dip your head into this haunting world of adolescence. Very sad and beautiful. Don´t see with siblings or Mom, I did (an uncomfortable mistake).",
         "The Cement Garden is based on a book by Ian McEwan and follows a group of siblings as they try to cope with the loss of their parents. However, there is much more to this film than merely the basic plot outline; through interesting character design, surreal locations and a gentle stream of shocking happenings; writer-director Andrew Birkin has created a truly unique and fascinating piece of cinema. Of all the films I have seen, I can't think of a single one that is really anything like this one. The film takes place in and around an isolated house surrounded by concrete (presumably on the edge of a town). The house is inhabited by two adults and four children; until the father dies of a heart attack, and the mother's health deteriorates until her eventual death shortly thereafter. This then leaves the four children to fend for themselves. The eldest siblings, Julie and Jack, decide to hide the mother's body in the basement rather than allowing themselves to go into care. The event affects each of the children in different ways. The Cement Garden is characterised by its setting; a large and morose house stands amidst a landscape made purely of concrete. This location serves the story as it creates isolation and separates the central family from the rest of the population. The film's colour scheme is based on grey and the gloominess of it helps to enforce the melancholy nature of the story. The film features plenty of shocks and breaks many taboos; but everything is presented in such a gentle manner that most of things featured actually seem quite normal, and that in turn makes them even more shocking. The film really is quite daring, and even more so for the fact that the central cast is so young. The dialogue can be quite awkward at times but the actors make the best of it. The film does become more surreal as it moves along, and while the ending of the film is not really a surprise; it still does manage to provide a shock. Overall, The Cement Garden is an excellent adaptation and well worth a look.",
         "I have heard people writing comments about being shocked by the sexuality in this movie and about being shocked by who was involved in producing it (i.e. relatives). Consider this: the actress who plays Julie was not 14-15 years old when this was shot, she was 22! It's called acting. And, her older \"brother\", an actor who was no relation, was 19. So, get over it folks. It's a movie, a slow moving but very well done movie. Truth is, I'm sorry if this movie offends some people. But, for goodness sakes, it's a story on a screen that is not even that racy. The movie is actually paced quite well to fit the somber mood and really, who can complain about the acting. I think some who have found any serious fault in the production are just trying to justify their uncomfortable feelings about the subject matter. Anyway, read the other comments, choose for yourself whether or not you care to watch it. But, if you are not put off by the subject matter, you will find a beautiful and sad story.",
         "This is one of those movies that is disturbing because it seems like a scenario that could happen in real life, and probably does. I won't go into details because almost anything that I could write about this film would be a spoiler. Suffice to say, that a family of youngsters makes is forced to make a rash decision out of desperation and then deal with the consequences of their actions. The viewer is then forced confront moral issues that are both difficult and troubling in a complex way. Unlike, the standard Hollywood film - or even the standard English film for that matter, this film is about shades of grey instead of blacks and whites. It is filled with compassion and pathos. A real throwback to the kind of movie that marked the great English cinema of the mid 60's. You can almost see a young Tom Courtney starring in this film if it had been made 3 decades earlier. A wonderful film!",
         "There's an almost heroic honesty to this urbanized, co-ed \"Lord of the Flies\"-ish love story. A square stone house serves as the isolated island while the jungle is the familiar setting of urban sprawl and other people. Director Andrew Birkin, in adapting Ian McEwan's novel (The Comfort of Strangers) to the screen, doesn't try to shock us. He just ignores our prejudices and lets fall away our preconceptions. What emerges is a sense of liberation from the usual hypocrisy. The love story is an acting out of sister-brother incest, almost a celebration of it. \"Seems natural to me\" is what fifteen-year-old Jack (Andrew Robertson) says while in the naked embrace of his older sister Julie (Charlotte Gainsbourg). I could almost buy it, but I know of the \"kibbutz effect\" in which it was found that unrelated children growing up together virtually never married one another. If sister and brother grow up separately there can be sexual excitement between them, but if they grow up in the same household they tend to find each other sexually boring. Family members usually work out the sexual tension through play at an early age so that by the time they are sexually mature, they are looking elsewhere. That's how the incest taboo works. Its purpose is to channel the sexual drive outward, the better to mix the gene pool. For the individual, incest is not an attractive option socially or economically because it is so much better to increase one's family and influence by joining with someone from another tribe or band. If you marry your sister, you don't gain any brothers. Consequently the average person recoils at the mere suggestion of incest, and it is this mindless, knee jerk reaction that this film attacks. Consider isolated families in the pre-history. What other reproductive choice would they have? Certainly it is better to reproduce in the hope that the next generation might find partners. This evolutionary wisdom is what is captured here. The sexual drive is seen as stronger than society's ephemeral prejudices, and rightly so since our genes must survive even when the society is stupid and self-destructive in its mores. Birkin's direction lacks focus in the beginning and the editing seems brilliant and disjointed by turns, but Birkin eschews even the hint of a cliché and ends up with a slightly flawed, but engrossing, strikingly original work of cinematic art. I'm disappointed that the sound track did not include the seventies Motown tune, \"It's a Family Affair.\" (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "I have to admit the film is disturbing, and frank. The subject matter is dark, yet there are moments of honest humor. The performances by Charlotte Gainsburg and others are so impressive I became lost in their world. It's a world where a small family can exist surrounded by nothing but concrete and rubble. It is very troubling, and thought provoking... and the end is not one of hope nor hopelessness.. A very good film!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Laurentic Film Productions",
         "Neue Constantin Film",
         "Torii Production"
      ],
      "summaries": ["After the death of her husband, the mother of Julie, Jack, Sue and Tom begins to suffer from a mysterious illness. Aware that she is going to have to go into hospital she opens a bank account for the children, so that they can be financially self-sufficient and will be able to avoid being taken into care by the authorities. Unfortunately she also dies and Julie and Jack (the older, teenage children) decide to hide her body in the basement so that they can have free reign of their household. Soon Tom has taken to dressing as a girl whilst Sue has become increasingly reticent, confiding only to her diary, meanwhile Jack and Julie sense an attraction developing for each other. However Julie's new beau, Derek, threatens to unearth the many dark secrets within this family as he becomes increasingly suspicious of Jack."],
      "budget": 0
   },
   "movielensId": 1437,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-02-20",
      "dvdReleaseDate": "2000-08-15",
      "directors": ["Andrew Birkin"],
      "runtime": 105,
      "movieId": 1437,
      "title": "The Cement Garden",
      "mpaa": "",
      "actors": [
         "Andrew Robertson",
         "Charlotte Gainsbourg",
         "Alice Coulthard",
         "Ned Birkin",
         "Sinéad Cusack",
         "Hanns Zischler",
         "Jochen Horst",
         "Gareth Brown",
         "William Hootkins",
         "Dick Flockhart",
         "Mike Clarke"
      ],
      "imdbMovieId": "0106535",
      "originalTitle": "The Cement Garden",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["mBzAFD3kF3w"],
      "plotSummary": "After the death of her husband, the mother of Julie, Jack, Sue and Tom begins to suffer from a mysterious illness. Aware that she is going to have to go into hospital she opens a bank account for the children, so that they can be financially self-sufficient and will be able to avoid being taken into care by the authorities. Unfortunately she also dies and Julie and Jack (the older, teenage children) decide to hide her body in the basement so that they can have free reign of their household. Soon Tom has taken to dressing as a girl whilst Sue has become increasingly reticent, confiding only to her diary, meanwhile Jack and Julie sense an attraction developing for each other. However Julie's new beau, Derek, threatens to unearth the many dark secrets within this family as he becomes increasingly suspicious of Jack.",
      "tmdbMovieId": 14832,
      "avgRating": 3.66667,
      "releaseYear": "1993",
      "numRatings": 342,
      "posterPath": "/7bVAVixfrGcy8SeKElC8t2FynEd.jpg"
   }
}