{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119644",
      "video": false,
      "title": "Meet Wally Sparks",
      "recommendations": [
         61418,
         63437,
         157036,
         25576,
         38132,
         97313,
         52117,
         250622,
         18856,
         51321,
         38981,
         112969,
         76297,
         44647,
         26176,
         52736,
         78406,
         88448,
         47892,
         37270
      ],
      "backdrop_path": "/uAseEs8DD6EPspebajKUQ4t49Pz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Wally Sparks",
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf549",
               "name": "Rodney Dangerfield",
               "profile_path": "/bbuVnFU4j19wN5gtUwHU3xzODGH.jpg",
               "id": 3198,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sandy Gallo",
               "gender": 1,
               "credit_id": "52fe4595c3a36847f80cf54d",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lenny Spencer",
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf551",
               "name": "Burt Reynolds",
               "profile_path": "/g5AyPAhdr5OtHVRGLD3i8Gw4oas.jpg",
               "id": 16475,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gov. Floyd Preston",
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf55b",
               "name": "David Ogden Stiers",
               "profile_path": "/zngM0eXq6RuYZmdocsAY2AMKUja.jpg",
               "id": 28010,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Helen Williams",
               "gender": 0,
               "credit_id": "58b61cf09251416129004bb6",
               "name": "Rita McKenzie",
               "profile_path": null,
               "id": 1668544,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Priscilla Preston",
               "gender": 1,
               "credit_id": "58b61cfd9251411d1400294b",
               "name": "Lisa Thornhill",
               "profile_path": "/AfnRDI8DUlYjutYXcDjksXDr8Jo.jpg",
               "id": 47058,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Harvey Bishop",
               "gender": 0,
               "credit_id": "58b61d0ac3a36806780021f8",
               "name": "Mark L. Taylor",
               "profile_path": "/uvqfJeuIQEHvbEDJWDZJcTBlzNy.jpg",
               "id": 78003,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Emily Preston",
               "gender": 1,
               "credit_id": "58b61d159251412ab1001f63",
               "name": "Cindy Williams",
               "profile_path": "/zqGqPA1OKurP3LbaujJuyny6xTv.jpg",
               "id": 8434,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Harry Karp",
               "gender": 2,
               "credit_id": "58b61d21c3a3687bbc002b01",
               "name": "Gilbert Gottfried",
               "profile_path": "/cu15UEyL3wnUtTAF5KfuyxxjVzH.jpg",
               "id": 15832,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "New York Cab Driver",
               "gender": 2,
               "credit_id": "58b61d2d9251416129004bcf",
               "name": "Tony Danza",
               "profile_path": "/zuGqT0ZJQFm0GMUnEa32jYu75Fy.jpg",
               "id": 18298,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Rapper Announcer",
               "gender": 0,
               "credit_id": "58b61d3c9251411d14002979",
               "name": "Sir Mix-a-Lot",
               "profile_path": null,
               "id": 1223663,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Martha Karp",
               "gender": 1,
               "credit_id": "58b61d4bc3a3680ee20020f4",
               "name": "Julia Sweeney",
               "profile_path": "/mOl6ecUZ1F6XIh1jvPnxzkrRMXn.jpg",
               "id": 11806,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Porn Actor",
               "gender": 2,
               "credit_id": "58b61d609251412f83001eda",
               "name": "Ron Jeremy",
               "profile_path": "/l4aDQlLafsG3N4pJ3W6YjpMXWI3.jpg",
               "id": 42545,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Lola Larue",
               "gender": 1,
               "credit_id": "58b61d6b9251411d14002999",
               "name": "Cindy Ambuehl",
               "profile_path": "/dzxVT04oxEZhYidDi9faAu2kmyX.jpg",
               "id": 79583,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Judge Randel Williams",
               "gender": 2,
               "credit_id": "58b61d78c3a3687bbc002b38",
               "name": "Alan Rachins",
               "profile_path": "/zM62T7sKS5SdRM4fZAmtx0PzwDt.jpg",
               "id": 105626,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Dixie (uncredited)",
               "gender": 1,
               "credit_id": "58b61d94c3a368067800225f",
               "name": "Rochelle Swanson",
               "profile_path": "/vv4PTrsB7kGUW1YqpnhijZjrT14.jpg",
               "id": 101093,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Tim Allen",
               "gender": 2,
               "credit_id": "5ac2c8bcc3a3682d33026b1d",
               "name": "Tim Allen",
               "profile_path": "/uX2xVf6pMmPepxnvFWyBtjexzgY.jpg",
               "id": 12898,
               "order": 16
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4595c3a36847f80cf557",
            "name": "Peter Baldwin",
            "profile_path": null,
            "id": 34651,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.894223,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40506,
      "vote_count": 12,
      "budget": 0,
      "overview": "Wally Sparks is a tabloid TV show reporter who's trying to boost ratings on his show. He goes to the governor's mansion to uncover a sex scandal.",
      "similar": [],
      "original_title": "Meet Wally Sparks",
      "runtime": 105,
      "poster_path": "/mD30gucf7NkKNFyqEMEag7l63VO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Baldwin"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Harry Basil",
         "Rodney Dangerfield"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119644/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2MjM0NjA3NV5BMl5BanBnXkFtZTcwOTYxNzIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rodney Dangerfield, Debi Mazar, David Ogden Stiers | See full cast and crew »"],
      "reviews": [
         "\"Meet Wally Sparks\" is a screwball comedy in the vein of an Adam Sandler vehicle or latter-day \"National Lampoon\" movie. Sure, it's dumb. Sure, it's cheap. Sure, there's no Palm D'Or award sitting on the director's shelf. But some movies are not destined for accolades or AFI lists or anything above the $8.99-and-under used video rack at Blockbuster. This movie has a drunken horse, three Southern ladies (one of them Cindy Williams) dancing in their skivvies to \"Whole Lotta Shakin' Going On\", a fight between Sumo wrestlers and WWF stars, and Tony Danza reprising his role as Tony from \"Taxi\" doing a Rodney Dangerfield impression. Oh, and lest it be overlooked, RODNEY FRIGGIN' DANGERFIELD. Come on. It's goofy, it's fun, it doesn't cost more than the price of a pack of cigarettes to own. Rodney and Oscar may not mix, but live-action cartoons and Rodney go pretty well together.",
         "Comedian Rodney Dangerfield took on the topic of shock TV in Meet Wally Sparks. A few sparks a generated, but it helps if you have an appreciation for the Police Academy films to enjoy this film. Which I do somewhat. Meet Wally Sparks also borrows liberally from the plot of The Man Who Came To Dinner. In this case Dangerfield in the title role becomes the man who stayed at the governor's mansion. Georgia Governor David Ogden Stiers who slips as neatly into a southern accent as he did a Boston one as Charles Emerson Winchester in MASH is advised that he can score a few cheap political points as a 'family values' candidate by attacking the outrageous talk show host Wally Sparks. Which gets a response from Sparks for Stiers to guest on his show and explain his objections. Then Stiers's son Glenn Walker Harris, Jr. steals an invite to a campaign fundraiser and sends it to Dangerfield who then comes down to Atlanta and promptly injures himself, necessitating he not be moved from there. After The Man Who Came To Dinner, the film then digresses into a pale imitation of The Fortune Cookie as it turns out Dangerfield isn't half as hurt as he makes out. All that was missing was Walter Matthau threatening to sue to the state of Georgia. Talk about deep pockets. The humor is pretty crude, not unlike what you see on these shows. But it's actually done with a gentle hand. There were some lost opportunities in this film to make some valid points. As did those two other far better satirical films which Meet Wally Sparks liberally borrowed from. Still fans of the late Rodney Dangerfeld will respect the film and will some others, just not enough.",
         "i thought it was a funny movie,and a few scenes were very funny. it's never boring or stupid. there are a few,and i do mean few scenes that are unfunny,but not stupid. the plot holes are the only thing that keeps this movie from a bulls-eye,but it still has a number of laughs. i give meet wally sparks **1/2 out of ****",
         "Poor Rodney Dangerfield. The man was a comic legend who seemed to do everything right when it came to stand-up comedy. The guy not only made a name for himself later in life, becoming a household name while in his mid-50's, but he also mentored future big name comedians including Jim Carrey, Sam Kinison, Bob Saget, Roseanne, Tim Allen, and many others. For a while, it seemed like he could be great in movies, too. \"Caddyshack\" (1980) is still a comedy classic, while \"Easy Money\" (1983) and \"Back To School\" (1986) showed he could headline a movie successfully as well. Although \"Ladybugs\" (1992) was not a perfect movie, it still had its laughs. Then came \"Meet Wally Sparks\" (1997), Rodney's final theatrically-released movie in which he had a starring role (thereby excluding his chilling supporting role in \"Natural Born Killers\" (1994), and a strong cameo in \"Little Nicky\" (2000)). Dangerfield would have many more bad movies to come (\"The Godson\" (1999), \"Back By Midnight\" (2002)), but all of those would go straight to video. It is amazing that \"Meet Wally Sparks\" did not go directly to video upon its release, because it is void of laughs (even from Mr. No Respect himself), its jokes and physical gags are almost always predictable, its characters are carbon copied from better movies, and its plot is completely all over the place. So who is Wally Sparks? As you find in the first five minutes of the film, he is a talk show host similar to Jerry Springer and Sally Jesse Raphael (both of whom cameo as themselves in this movie). His on-air antics violate many FCC regulations, causing sponsors to pull their advertising. TV network owner Lenny Spencer (Burt Reynolds, sporting a ridiculous-looking toupee that served as a missed joke opportunity for Dangerfield) seriously considers pulling the plug on the controversial show, but Sparks' producer Sandy Gallo (Debi Mazar, best known as Ray Liotta's coke-addicted mistress in \"Goodfellas\" (1990)) makes a last ditch effort to save their careers. She plans on having Sparks tape his show from the house of his most staunch critic, Georgia governor Floyd Preston (David Ogden Stiers), while also staying at his house. In a contrived plot point that is not very well executed, Governor Preston is advised not to simply kick Sparks out of his house because the poll numbers for his U.S. Senate campaign suggest that Sparks' presence will give him a better chance of winning his upcoming election. With Sparks continuing to scrape the bottom of the barrel by inviting guests on his show ranging from porn stars to steroid-induced professional wrestlers, hilarity ensues in the Governor's mansion. Or does it? The answer is no. \"Meet Wally Sparks\" is a prime example of a movie that, through outrageous physical gags, tries way too hard to be funny. Dangerfield's one-liners also feel weak and incredibly forced. When he rides a drunken horse into a cocktail party held by Gov. Preston, he actually says, \"Hey, quit horsing around!\" All I could do was sigh, and wish that Bill Murray would appear chasing a gopher. Of course, Murray doesn't make an appearance in this movie. Instead, we have a barrage of useless celebrity cameos. Most of them are by real talk show hosts, and A-list stand-up comedians appear as well. Perhaps the least impressive cameo was by Michael Bolton, who loves Wally Sparks' show so much that he sings a song and dedicates it to him. Who made this movie and thought a cameo by such a second-rate adult contemporary artist would benefit this movie? On the other hand, not even appearances by celebrities who actually do have talent, such as Jay Leno and Tim Allen, succeeded in bringing any more laughs. In the midst of the predictable humor and wasted cameos, the plot was all over the place. The fact that Wally Sparks is a controversial talk show host would have brought enough laughs if it was incorporated into a story that spoofed the talk show trend of the 1990's. Before reality shows, celebrities were all about having their own talk shows. There could have been some way to parody that TV trend. Instead, we get a mess of a story involving a politician who is less concerned with improving the budget of his state, and instead wastes his time fighting against a show clearly protected by the First Amendment. There are also complicated subplots involving a love story between Sparks' son and Gov. Preston's daughter, Sparks himself pretending to be paralyzed, a conspiracy over a theme park being built over a Civil War battle ground, and a hoax sex scandal that potentially jeopardizes Preston's hopes of being elected Senator. The movie feels too long at 105 minutes, primarily because the subplots throw off the pace of the story. After only an hour, I wanted this film done because I didn't care about any of the characters. I just wanted the last hour of my life back. Rodney Dangerfield is still one of the greatest stand-up comedians ever. It's just too bad that he never made a funny film after \"Back To School\". The fact that he co-wrote the screenplay to this movie does not help his legacy. He made a wise move by not appearing in \"Caddyshack II\" (1987), but somehow his fate with future movies was not as well-thought- out.",
         "Rodney said, promoting his movie, when people write movies they think they're writing \"Gone with the Wind.\" This movie is FAR from \"Gone with the Wind,\" but if you're as much as a fan of Rodney as I am--and who doesn't love him?--you will have a great time! I can't understand why this movie didn't fare well at the box office. When I went to see it, there were only a few people, but the few that were in there were laughing hysterically! I saw it twice in theaters, and the second audience was doing the same! Especially the statue-penis scene. I think that has to one of the funniest moments ever captured on film and that really brought the house down! Of course, expect to see a chock full of Rodney one-liners, including: \"We now come to a part of the show called 'It's Hard to Believe.' Or as my wife used to say...\"I can't believe it's hard\" and \"The problem with me is I'm sitting on top of the world, and I've got hemmerhoids!\" I'm not going to give away the rest of the lines, because that would be sinful. The gags are absolutely priceless! Sure, this is another outrageous comedy with the plot structure of a TV sitcom, but with Rodney in the front seat--How can you possibly go wrong? Also, keep your eye out for cameos by numerous talk show hosts and a special appearance by Burt Reynolds in one of his worst wigs...LOL. My score: 8 (out of 10)",
         "I am a huge fan of Rodney and thought this movie was hysterically funny!!! Trust me anyone who enjoys Rodney Dangerfield humour will LOVE this flick!!! If you didn't like it the first time (and you are a Rodney fan), Trust me watch it again, it's even better the 2nd time around!!! His one-liners were originally crude & FUNNY!!! Quote: I am here to spread Joy, if I can find her? Many many cameo appearances from celebrities and movie stars (from Michal Bolton to Bert Reynolds to porn king Ron Jeremy) adds to this enjoyable flick! Definitely recommend for all Rodney fans!!!",
         "A lot of energy was put into this movie. Dangerfield has some funny one-liners, but a lot of them are not funny, or you'll guess before he utters them. The plot is alternately meandering or frozen for long periods of time. (And the plot should have stayed at the talk show subject, not some dumb plot about Dangerfield crashing a govenor's pad.) Replay the climatic interview scene after watching it once - you'll see that some of Dangerfield's actions don't make that much sense. Also, see how many times the director shoots Dangerfield from the neck down - obviously, it's a stunt double. A memo to Burt Reynolds: don't wear that particular toupee again.",
         "\"The Wally Sparks Show\" - starring trashy Rodney Dangerfield (as Wally Sparks) - is taking a dump on its sponsors. Although popular, the show loses ad revenue and is threatened with cancellation. Network big-wig Burt Reynolds (as Lenny Spencer) orders Mr. Dangerfield to clean up his act. Spearheading a campaign to clean-up Talk TV is conservative \"family values\" politician David Ogden Stiers (as Floyd Preston), the governor of Georgia. Hoping to improve his image, Dangerfield accepts an invitation to the governor's mansion from Mr. Stiers' son Glenn Walker Harris Jr. (a \"Wally Sparks\" fan)... For a sophomoric sex comedy starring Dangerfield, this isn't too bad. The director works well with a funny supporting cast, especially co-stars Debi Mazar and Eamonn Roche. As usual, first lady Cindy Williams (as Emily Preston) is an asset. Her strip poker sequence is hilarious. The film may be trying to satirize TV talk show hosts like Jerry Springer and Geraldo Rivera - who cleverly elicit trash talk from guests, but stay out of the mud. Howard Stern is a more apt comparison, but probably declined a appearance. There are plenty of other cameos, most inspired being Tony Danza as a New York \"Taxi\" driver. ***** Meet Wally Sparks (1/16/97) Peter Baldwin ~ Rodney Dangerfield, David Ogden Stiers, Cindy Williams, Debi Mazar",
         "At the movie's start, we see a lot of clips (most of them probably fake) from real talk shows, as well as the vulgar Wally Sparks on his own program that gives the FCC and advertisers nightmares. Jerry Springer comments, \"Hey, at least this isn't 'The Wally Sparks Show.'\" The network has finally had enough. It's over, says network head Lenny Spencer. Wally convinces Spencer to give him another chance, saying he will clean things up. Spencer reluctantly agrees. The idea on how to give the show a fresh image comes from Georgia governor Floyd Preston. The conservative family values advocate has written Wally complaining that this is not the sort of thing his son should be watching. Preston has had a change of heart and wants Wally to attend a black-tie event at his mansion. At least that's what the letter says ... Preston's young son Robby watches the show just to annoy his father, and having Wally actually show up will really get him riled. The results are hilarious. Not entirely unlike \"Caddyshack\", a superior film where Rodney Dangerfield shocks the country club set with his crude behavior. And things are about to get a whole lot worse. Furthermore, Preston is trying to get re-elected, and any bad publicity could hurt his chances. Still, he needs to learn to care more about his family, and by the end I think he gets that message. Wally also has problems in his relationship with grown son Dean, but I believe this experience may have helped him as well. This wasn't Dangerfield's best performance, but he was still quite good. Debi Mazar also did a great job as Wally's producer, and David Ogden Stiers did his usual fine job. Despite his fake accent, I was impressed with Glenn Walker Harris as Robby. He reminded me of Jonathan Taylor Thomas in \"Home Improvement\", though Thomas is better. Lesley-Anne Down also stood out in one scene as a nurse who wasn't a nurse. Speaking of fake accents, Mark L. Taylor, as Preston's campaign manager, REALLY overdid it. This is NOT a film that should be seen by kids. If you are offended by Howard Stern's style of humor, it might be best to stay away. Not that the vulgarity was constant, but it was certainly pushing the limits of what TV allows. I don't know how much was edited out. The movie had plenty of physical comedy in addition to crude jokes. Most of the pratfalls came from poor network lackey Alan Miller, sent by Spencer to follow Wally and gather dirt on him. Some other highlights included the scene right after Gov. Preston showed off his horse, and the Wally Sparks episode featuring American wrestlers and Sumo wrestlers, in which Wally claimed to speak Japanese (though his translation included the word \"Toyota\"). And the governor's grown daughter Priscilla was not supposed to come home so early. There was also a scene reminiscent of \"Risky Business\". You won't believe who dances in underwear. (No, not him). Celebrities were all over the place. It added realism to see Jay Leno comment on TV about Wally, though I don't know how good the E! commentators were. Tony Danza drove a cab! I don't remember his \"Taxi\" character that clearly but he reminded me more of Tony Micelli than Tony Banta. I've never seen a worse performance from Bob Saget. How did I ever enjoy \"Full House\" and \"Funniest Home Videos\" with him? I enjoyed the big-band music at the black-tie event until Michael Bolton showed up and managed to do a watered-down impression of Ray Charles singing you-know-what. Bolton is often compared to Kenny G, who may have been doing the music for some of the romantic scenes (I won't say who was romantic with whom). At least it was his annoying style. If you've never heard Devo do anything but \"Whip It\", stay around for the closing credits and hear them do Beatnik jazz. They're quite good. I had a good time. I can deal with naughty humor on occasion.",
         "I feel so sorry for the big names in this movie AND Rodney Dangerfield because this thing is just an embarrassment for all concerned and this comes from a fan of most of them, including Rodney. If you can make it through the opening credits without wincing, then maybe you'll make it through the rest of the movie which really doesn't get any better, at least in the half I managed to complete. The first 10 minutes are sophomoric but I might be selling sophomores short. After watching that, I decided to catch up on emails while listening and occasionally looking up at the TV. I was thinking that there MUST be something coming to justify the positive reviews here in IMDb and the participation by the well-known actors. But if there was, there should have introduced it earlier. Thank goodness I was able to catch up on the emails otherwise it would have been a complete waste of the 45 minutes I kept it on before shutting down the whole system. Now, I'm going to clean the TV and make a sincere effort to forget what was just on it. If anyone asks me when the US began its downward slide, I'll say 1997 and reference \"Meet Wally Sparks\"."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Largo Entertainment",
         "Thinkfactory Media",
         "Wally Sparks Productions"
      ],
      "summaries": ["Wally Sparks is a tabloid TV show reporter who's trying to boost ratings on his show. He goes to the governor's mansion to uncover a sex scandal."],
      "budget": 0
   },
   "movielensId": 1439,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "1998-07-14",
      "directors": ["Peter Baldwin"],
      "runtime": 105,
      "movieId": 1439,
      "title": "Meet Wally Sparks",
      "mpaa": "R",
      "actors": [
         "Rodney Dangerfield",
         "Debi Mazar",
         "Burt Reynolds",
         "David Ogden Stiers",
         "Rita McKenzie",
         "Lisa Thornhill",
         "Mark L. Taylor",
         "Cindy Williams",
         "Gilbert Gottfried",
         "Tony Danza",
         "Sir Mix-a-Lot",
         "Julia Sweeney",
         "Ron Jeremy",
         "Cindy Ambuehl",
         "Alan Rachins",
         "Rochelle Swanson"
      ],
      "imdbMovieId": "0119644",
      "originalTitle": "Meet Wally Sparks",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Wally Sparks is a tabloid TV show reporter who's trying to boost ratings on his show. He goes to the governor's mansion to uncover a sex scandal.",
      "tmdbMovieId": 40506,
      "avgRating": 2.32514,
      "releaseYear": "1997",
      "numRatings": 366,
      "posterPath": "/mD30gucf7NkKNFyqEMEag7l63VO.jpg"
   }
}