{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "true love",
            "id": 188993
         },
         {
            "name": "irish catholic",
            "id": 208725
         }
      ],
      "imdb_id": "tt0112585",
      "video": false,
      "title": "The Brothers McMullen",
      "recommendations": [
         25221,
         13482,
         83946,
         31911,
         24113,
         34045,
         14585
      ],
      "backdrop_path": "/y7YENq9ZbQIdBFcFGVphKuq8t41.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Susan",
               "gender": 1,
               "credit_id": "52fe46cf9251416c75084379",
               "name": "Shari Albert",
               "profile_path": "/vSkUxmsX0vRLaE6sp6FfmAHKx7x.jpg",
               "id": 86308,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Audrey",
               "gender": 1,
               "credit_id": "52fe46cf9251416c7508437d",
               "name": "Maxine Bahns",
               "profile_path": "/vI2TFKHuz9DTgQunzcrV9qJI7yc.jpg",
               "id": 21398,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mrs McMullen",
               "gender": 0,
               "credit_id": "52fe46cf9251416c75084381",
               "name": "Catharine Bolz",
               "profile_path": null,
               "id": 86309,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Molly McMullen",
               "gender": 1,
               "credit_id": "52fe46cf9251416c75084385",
               "name": "Connie Britton",
               "profile_path": "/dbX2i37hwEst6FeL0QH5QgZcsQ3.jpg",
               "id": 86310,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Barry/Finbar McMullen",
               "gender": 2,
               "credit_id": "52fe46cf9251416c75084389",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Marty",
               "gender": 0,
               "credit_id": "52fe46cf9251416c7508438d",
               "name": "Peter Johansen",
               "profile_path": null,
               "id": 86311,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Leslie",
               "gender": 1,
               "credit_id": "52fe46cf9251416c75084391",
               "name": "Jennifer Jostyn",
               "profile_path": "/ryxfr10cqSMdWQT8oWQG5OBgFQ2.jpg",
               "id": 27739,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Patrick McMullen",
               "gender": 2,
               "credit_id": "52fe46cf9251416c75084395",
               "name": "Michael McGlone",
               "profile_path": "/rB2uLTM2xh2O2aKri8OgPDKM0tK.jpg",
               "id": 69298,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Ann",
               "gender": 0,
               "credit_id": "52fe46cf9251416c75084399",
               "name": "Elizabeth McKay",
               "profile_path": null,
               "id": 86312,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Jack McMullen",
               "gender": 2,
               "credit_id": "52fe46cf9251416c7508439d",
               "name": "Jack Mulcahy",
               "profile_path": "/a7vuis8rvVovHON18huW08E4bQU.jpg",
               "id": 86313,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cf9251416c750843a3",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546e3054c3a368453b000037",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56e9e4ec9251417bc300467b",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56e9e50ec3a3682d6c004d1c",
               "name": "Dick Fisher",
               "profile_path": null,
               "id": 950276,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56e9e56ec3a3682d6c004d2a",
               "name": "Dick Fisher",
               "profile_path": null,
               "id": 950276,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "584aa3b0c3a368141a020471",
               "name": "Dick Fisher",
               "profile_path": null,
               "id": 950276,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "584aa3d192514119af01e448",
               "name": "Seamus Egan",
               "profile_path": null,
               "id": 1482555,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.613342,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16388,
      "vote_count": 29,
      "budget": 0,
      "overview": "Deals with the lives of the three Irish Catholic McMullen brothers from Long Island, New York, over three months, as they grapple with basic ideas and values — love, sex, marriage, religion and family — in the 1990s. Directed, written, produced by and starring Edward Burns.",
      "similar": [
         1024,
         13523,
         226,
         1259,
         276,
         290762,
         862,
         38,
         19913,
         1903,
         50544,
         1643,
         316021,
         888,
         16980,
         24420,
         44564,
         9769,
         23949,
         49950
      ],
      "original_title": "The Brothers McMullen",
      "runtime": 98,
      "poster_path": "/8YlwQ2BBH6PY3Tl0bOf0fLep31h.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
         "name": "Fox Searchlight Pictures",
         "id": 43,
         "origin_country": "US"
      }],
      "release_date": "1995-08-09",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Sometimes the Best Friends Are the Ones You've Known Your Whole Life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Edward Burns"],
      "runtime": 98,
      "synopsis": "The film begins with Finbar \"Barry\" McMullen (Edward Burns) standing at the grave of his recently deceased father, along with his mother, who tells him that she's returning to her native Ireland to be with Finbar O'Shaughnessy (after whom Barry is named), her sweetheart of long ago. She tells Barry that while she gave Barry's father 35 of the best years of her life, she's going to start living life her way with the man she really loves. While this could be interpreted as disrespect for the memory of the family patriarch, it is later revealed in the movie that he was an alcoholic and abused his family prior to his death. Flashing forward five years later, Barry's older brother Jack (Jack Mulcahy) has purchased their parents' Long Island home and lives in it with his wife Molly (Connie Britton), who is pressing Jack to start a family due to Irish tradition, despite his reluctance. The truth is, Jack is torn between his love for Molly and his lust for Ann (Elizabeth Makay), a former romantic interest of Barry's. Jack begins an affair with Ann behind Molly's back. Meanwhile, Barry and the youngest brother, Pat (Mike McGlone) ask to temporarily move in with Jack, to which he reluctantly agrees. Pat and Barry, like their brother, are basically overgrown teenagers torn between prolonged adolescence and commitment to marriage. Pat plans to break his engagement to Susan (Shari Albert), but becomes depressed when she breaks up with him, citing his indecisiveness about their relationship and the problems that could come between two faiths, as Susan is Jewish and Pat is a devout Irish Catholic. Barry shows no interest in a long-term relationship, until he meets Audrey (Maxine Bahns), a woman whom he accuses of \"stealing\" an apartment that he was trying to rent for himself. Though things do not go well between them at first, they warm up to one another and start a relationship. Molly learns of Jack's affair after finding a wrapped condom in his pants as she is cleaning up after him one day. She confronts Jack, but he refuses to discuss it. His brothers also try to intervene, but to no avail as he tells them, that by Catholic tradition, no one can intervene in a married couple's disputes. After much pleading, Susan decides to take Pat back. But almost immediately after she does so, Pat decides to end the relationship for good. The reason is Leslie, a girl-next-door type who likes to work on her father's car... a sharp contrast to Susan's materialistic personality; Leslie offers Pat nothing more than simple friendship. The friendship develops into something a little more when they decide to head out to California together in a classic car that Leslie has her eye on. Jack, knowing he has to make a choice between his wife and his mistress, finally breaks it off for good with Ann, despite his repeated attempts to do so in the past. Hurt by the rejection that she's heard many times before from Jack, Ann tells him to never call her again. He then returns home determined to rebuild his wounded marriage, but not before paying a visit to his father's grave, promising (in a voice-over) that he will be a better husband to his wife than his father was, pouring a bottle of Irish whiskey over the grave. Barry decides to move in with Audrey and take their relationship to the next level. The movie ends with all three brothers gathering at the family homestead with a newfound belief in love and a desire to not let the ghosts of the past stand in their way.",
      "writers": ["Edward Burns"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112585/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwODk3MDU5N15BMl5BanBnXkFtZTcwMTE2NTYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Mulcahy, Michael McGlone, Edward Burns | See full cast and crew »"],
      "reviews": [
         "* * * (3 out of 5) The Brothers McMullen Directed by: Edward Burns, 1995 Catholic guilt meets Irish-American post-grunge cynicism in this 1995 Grand Jury Prize winner of the Sundance festival. Ostensibly made by a man \u0096 and for men (count the many beers) \u0096 director/writer/actor Edward Burns nevertheless impresses in every category. At times a bit sappy, yet Burns is focused on behavior and conversations and wisely makes the most of these.",
         "'The Brothers McMullen', written, directed by and starring Edward Burns (on an extremely low-budget), invites us into the cosy relationship between three Irish-American brothers and their own relationships with God and members of the opposite sex. It is a conventional wisdom that a good story needs a beginning, a middle and an end, yet 'The Brothers McMullen' seems to be all middle - and engagingly so. Burns gives us a glimpse into the lives of these three brothers as they struggle to find their way through personal emotional turning points and re-evaluate their belief systems. The film is dominated by perceptive, sensitive and realistic dialogue throughout. The dilemmas of these three brothers are instantly recognisable to anyone in their twenties or thirties, their inner conflicts easy to identify with. This film is beautifully acted, and particularly likeable is Mike McGlone as the youngest brother who desperately tries to hold on to what he believes is his genuine Catholic conviction whilst searching for 'true love'. Burns' script is witty, warm, honest and wonderfully unpretentious. Burns himself turns in a great performance of the ever-maligned man who is 'afraid of commitment', yet somehow manages to remain intensely appealing and prevents his character from appearing to be a cliché. A rare gem among contemporary movies - one which is fuelled by words and not actions. Refreshing.",
         "I never saw \"The Brothers McMullen\" in the theater, but I just watched it on video. I have to say that I liked it in spite of its flaws. It just had this superficial, breezy feel to it, like it's really not a movie but a pilot for a sit-com. All it's missing is the laugh-track. The stories about the three brothers were well done, especially Barry's story (the middle brother). But I kept thinking the most interesting character in this story is the dead father, and he's not even in the movie. The brothers mention their father several times, usually in some disparaging way. You don't find out many facts about him, except that their mother never loved him. Apparently the sons didn't love him either. The three brothers are desperate, each in their own way, to not end up like their father. The dead Mr. McMullen was characterized as an alcoholic, wife-abusing, stern and unhappy man. And yet Mr. McMullen had no trouble committing to one woman, which apparently Barry can't manage to do. Mr. McMullen remained faithful (apparently) in a 35 year marriage and raised 3 sons, which oldest son Jack can't bring himself to do. Mr. McMullen remained true to his religious and cultural upbringing, which youngest son Patrick is about to turn his back on when he splits for California. So maybe that father wasn't such a failure after all. The sons won't realize this until they become husbands and fathers themselves. But they haven't reached that point yet, they're still growing up and figuring things out. It's nice to see how they help each other and take turns giving \"parental\" advice to each other. I'd like to see this same story with these same characters, told 20 years before, and 20 years after the time of this movie. I'd like to meet the mother in Ireland as she greets her American grandchildren. Now that would be an interesting sequel.",
         "THE BROTHERS McMULLEN (1995) ***1/2 Edward Burns, Mike McGlone, Jack Mulcahy, Maxine Bahns, Elizabeth P. McKay, Shari Albert, Connie Britton, Jennifer Jostyn. Sort of an Irish-American Woody Allen flick but with style and originality: Burns (who stars, wrote and directed) filmed this on a budget at $20,000 and won The Sundance Film Fest's Jury Prize after being passed on every level. Three close and quarrelsome Irish/Catholic brothers from Long Island confront sex, sin, guilt, infidelity, commitment and finally love in this delightfully funny and smart slice of life.",
         "I think Edward Burns is a brilliant man - a genius. He has the ability to make great, touching movies about REAL characters, and the humor is never far away. This is a very funny movie, with some unforgettable scenes (e g: see the \"Summary\"). The actors do their jobs with a presence rarely seen on film. They never once overact, and everything they say or do seems natural. There is one major flaw in the movie though, but I'm not going to give it away. I can say this though: It has something to do with the time. I saw this one after I saw \"She's the One\" and there are some similarities. However, this doesn't effect either movie in a negative way. In fact; I love both of them equally. I just wish I could get hold of \"No Looking Back\". It hasn't been released here in Sweden yet (not even on video). Well... anyway, if you for some reason haven't seen \"The Brothers McMullen\" - or \"She's the One\" for that matter - I suggest you run the the nearest video store right now and rent it (preferably both), or better yet: buy them!",
         "I don't have much to say of this amazing film, except that it is an example how years from now, when Edward Burns receives life time achievement awards for all of his many talents, the people who were smart enough to see this film will be able to tell their children of how they could see this day coming from decades away. His ability to take three men and tell their story brilliantly without ever straying from something realistic, and still getting his happy ending, is surreal. He is an amazement and inspiration for all young film makers.",
         "I just finished watching this on TV. The story is about several weeks in the lives of three bothers. Circumstances (what they are is unimportant) have caused the two younger bachelor brothers to move in with their older married brother and his family. The script explores the relationships between three loving Irish Catholic American brothers, each with a distinctive personality, and the relationships each has with the women in their lives. It's about real love and romance (not the sappy romantic comedy type), fears of commitment, and the twists and turns these men go through in dealing with that aspect of their lives. Their Catholicism has a lot to do with the story. At one point Patrick says to his Jewish girl friend, \"I go to Church every week; you go to Temple only once or twice a year.\" She replies, \"Yes, but your religion is crazy.\" Although the most religious of the three, Patrick, goes against the Church's teachings in that he uses condoms; but, he worries about going to Hell should he commit other serious sin. Marriage to all of them means a life-long commitment. Their mother's life set the standard for them. She had lived 35 years in a forced, loveless marriage until her husband passed away. That freed her to go to the man she had been in love with when circumstances caused her to marry the boys' father. Abortion was out of the question, as was divorce. Ed Burns is credited with writing and directing the film and he also is very credible as the middle brother. While the entire cast made their characters seem real, the actor who in my mind stood out is Mike McGlone, who plays Patrick, the youngest brother who has a kind of altar boy personality. Perhaps Ed Burns' choice of camera angles gets some of the credit for making his performance particularly memorable, but McGlone brought something special to that part.",
         "EDWARD BURNS is the writer/producer/director/actor of this charming piece of casual film-making on a shoestring budget that he turned out twelve years ago, obviously based on characters he cares about and knows intimately. It has the intimate immediacy of MARTY, another such tale about a lonely Brooklyn butcher looking for true love and the right marriage prospect to end his bachelor days. In THE BROTHERS McMULLEN we have MARTY compounded by three--namely, the Irish brothers on Long Island who seem to indulge in endless dialog about life, love and the pursuit of happiness while sipping their favorite beers, each involved in a troublesome relationship that has them questioning their inner conflicts born by a Catholic conscience. It's not exactly up to the Woody Allen standard of such tales, but the dialog is fresh enough and natural, the modest settings are appropriate for the story and the jaunty Irish music on the soundtrack does its job. Nothing complex here. Just a warm, engaging, occasionally funny tale of average guys struggling with their fixed ideas of moral values, each unable to come to terms with inner conflicts--and two of them simply unable to make commitments to the women they love. The film is really carried by the three brothers: EDWARD BURNS as the one least able to commit, and JACK MULCAHY and MIKE McGLONE as his troubled siblings. Summing up: Nothing really special, but it did win a couple of awards at film festivals.",
         "I am a man who is of Irish decent, has an older brother who I am still close with but used to fight with (physically) constantly, and grew up in the Northeast, so I felt more of a familiarity towards this film than people in other demographics. For those reasons alone, this film holds a special place in my movie-loving heart than others I have seen before. Having said that, you don't have to be Irish-American or even male to love this movie. Sure, it looks grainy even on DVD, but any movie fan can tell you that it's not how clear a movie is or how much it costs, but how good the characters are or the story is. For this movie, both criteria was met. Edwards Burns wrote this film brilliantly, for starters. Burns wrote himself as the funnyman, and he did a great job with that role. He has some very memorable lines, most especially the part where he's talking to his younger brother Patrick (Mike McGlone) about women's ways while using a banana. Other writers would have stooped really low with such a prop, but Burns used it metaphorically in a way that was both funny and smart. He also had great chemistry with Maxine Bahns. Of course, Burns didn't leave all the funny lines to himself. Mike McGlone is also very good as Patrick, the younger brother who uses his Catholic upbringing as an excuse not to marry his longtime girlfriend. His character is perhaps the most interesting because he's so complex and has many contradictory qualities: he loves but is afraid to commit, he's religious but abides by the rules when convenient, and he's smart but does really dumb things. Contrast that performance to his role in Burns' followup, \"She's The One\", and you'll see that McGlone is one of the most underrated actors working today. Of course, with the movie centering around the three brothers, not mentioning Jack Mulcahy as older brother Jack would be blasphemous. Mulcahy played a very good straight man to Burns and McGlone. The movie makes you believe in the beginning that he has everything together, but he eventually loses it. However, he does so in an understated way that seems very realistic in a lot of ways. You'd have to see the movie to find out. There's not too much else to say about the movie: it just worked! The dialogue was brilliantly written and perfectly executed by the entire cast, the situations were entirely believable, and the on-location shooting in New York was a brilliant move on Burns' part. It's as if New York was its own character. Being from New England, seeing the New York Yankees clothing some of the cast wore got under my skin a little, but I won't get too picky. Although Edward Burns got his due for this movie (Winner of Best Picture at Sundance, Two Thumbs Up from Siskel & Ebert), he hasn't really gotten the respect he deserves since this film was made. He's directed eight movies as of the date this review has been written, and my guess is that in another ten years, he will earn the same respect as Woody Allen and Albert Brooks from film critics and fans alike. He had a great start as a young independent filmmaker, and I know he'll make more good films as a director as well.",
         "Fifteen thousand pounds to many is a great deal of money, but in Hollywood it'd barely make a runner's salary. So really it's an unbelievable effort to produce a movie for this amount of money and win a Grand Jury Prize at the Sundance Film Festival in 1995, as well as recognition for Ed Burns as an all-round director/actor/producer/writer extraordinaire. The end product being The Brothers McMullen; a project made literally in his own backyard, using his own friends and associates as his crew (such as his 'then' girlfriend who is his girlfriend in the film and his friend). The protagonist is Burns' character Barry, the middle brother, who is the wittiest, has the sharpest lines, and many would think the film is partly autobiographical because of this. Barry is a writer, jumps from woman to woman, makes wise guy remarks, and then he meets Audrey, played by Maxine Bahns, and is forced to get over his fear of commitment. How does he deal with it? Jack, the older brother, is a middle-aged teacher, who's quieter and loves his wife, but has to deal with the feelings of infidelity. How does he deal with it? Then there's Patrick, the younger religious sibling, a do-gooder who's soon to get married into a Jewish family, but he gets cold feet. Then hot feet. Then cold feet. He then gets his fiancé pregnant. Then he meets someone else. He then has to deal has to deal with the guilt. Or does he learn not to? Three very different brothers, the three Irish New Yorkers feed each other their advice and wisdom of love. It's not an original plot, but it works. Conversations flow from JFK, women, families, love, alcohol, their violent father, to family bonding, with a whole lot of swearing in between and Irish fiddle music in the background. Burns is something of a Plastic Paddy. Nevertheless, there's a lot of great word play, the plot isn't pretentious or trying to be too clever. It's heart-warming, without being soppy. Minus points: one can appreciate Burn is an all-rounder, but he should maybe step outside his own box and become a character in the movie \u0096 stop writing and starring as himself \u0096 it's a bit egotistical. The acting was a bit amateur, especially Maxine Bahns \u0096 though this can be forgiven for the fact they were at the time just that - amateurs. The editing was a bit disjointed in places. It doesn't flow as well as it could do. Then again, it only cost, as stated £15,000. It has to be expected. I appreciated it a lot. A debut movie, that cost £15,000, cannot get much better. If you like Irish-American culture, take pleasure of budget movies and enjoy witty rom-coms \u0096 try this."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Brothers McMullen Productions",
         "Marlboro Road Gang Productions",
         "Videography Productions"
      ],
      "summaries": [
         "This angst-filled tale of three Irish-Catholic brothers explores men's relationships with women. Three different situations are set up on parallel plotlines, with each brother facing a different kind of crisis. Their common bond as family, as well as close lifelong friends, allows them to express their feelings frankly and intimately, as they talk and discuss their concerns among each other. Jack finds himself in a marriage gone stale and under pressure to start a family that he does not yet feel ready for. Barry, dedicated to his film career and almost pathologically averse to any type of commitment in a relationship, is suddenly artistically successful and finds true love, both for the first time and both pulling him in opposite directions. Patrick is torn between his love for his religion and ethnic heritage and his love for Susan, his longtime Jewish girlfriend. Ultimately, they are all asked to resist temptation of one sort or another, with various poignant outcomes.",
         "After their mother leaves to Ireland to meet her true love whom she had waited for 35 years to meet, Jack, Barry and Patrick finds their own. Jack, happily married to Molly, is having an affair with Ann. Barry, a screenwriter, does not believe in true love, and does not want to settle. Patrick, who is a faithful Catholic, is engaged to Susan, but is having doubts. Jack, Barry, and Patrick are trying to give advises to each other. When Jack meets the beautiful Audrey...",
         "Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity."
      ],
      "budget": 25000
   },
   "movielensId": 144,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-08-09",
      "dvdReleaseDate": "2000-10-03",
      "directors": ["Edward Burns"],
      "runtime": 98,
      "movieId": 144,
      "title": "The Brothers McMullen",
      "mpaa": "R",
      "actors": [
         "Shari Albert",
         "Maxine Bahns",
         "Catharine Bolz",
         "Connie Britton",
         "Edward Burns",
         "Peter Johansen",
         "Jennifer Jostyn",
         "Michael McGlone",
         "Elizabeth McKay",
         "Jack Mulcahy"
      ],
      "imdbMovieId": "0112585",
      "originalTitle": "The Brothers McMullen",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["QEFxzbRLOmg"],
      "plotSummary": "Deals with the lives of the three Irish Catholic McMullen brothers from Long Island, New York, over three months, as they grapple with basic ideas and values — love, sex, marriage, religion and family — in the 1990s. Directed, written, produced by and starring Edward Burns.",
      "tmdbMovieId": 16388,
      "avgRating": 3.46585,
      "releaseYear": "1995",
      "numRatings": 4671,
      "posterPath": "/8YlwQ2BBH6PY3Tl0bOf0fLep31h.jpg"
   }
}