{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "terror",
            "id": 321
         },
         {
            "name": "exotic island",
            "id": 911
         },
         {
            "name": "terrorist",
            "id": 949
         },
         {
            "name": "u.s. navy",
            "id": 4410
         },
         {
            "name": "base",
            "id": 6417
         },
         {
            "name": "based on tv series",
            "id": 10988
         }
      ],
      "imdb_id": "tt0119640",
      "video": false,
      "title": "McHale's Navy",
      "recommendations": [
         83489,
         73249,
         30440,
         30500,
         18856,
         32872,
         12257,
         26626,
         41971,
         12479,
         7269,
         40150,
         25697,
         76297,
         35196,
         17832,
         90616,
         15513,
         78552,
         31220
      ],
      "backdrop_path": "/tWX6b2QkYVQgIG28HLOk9uKRLbk.jpg",
      "revenue": 4529843,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Lt. Cmdr. Quinton McHale",
               "gender": 2,
               "credit_id": "52fe46279251416c7506efb1",
               "name": "Tom Arnold",
               "profile_path": "/udJkmZPrQs4D8NPV8u4BEv3rNLX.jpg",
               "id": 74036,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Capt. Wallace B. Binghampton",
               "gender": 2,
               "credit_id": "52fe46279251416c7506efa5",
               "name": "Dean Stockwell",
               "profile_path": "/gooE10UOH6t4geqsEbji9NiQalP.jpg",
               "id": 923,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Lt. Penelope Carpenter",
               "gender": 1,
               "credit_id": "52fe46279251416c7506efb9",
               "name": "Debra Messing",
               "profile_path": "/d2LQbdccJbMSDC9Qm6vTn4qa0Ly.jpg",
               "id": 23959,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Ensign Charles Parker",
               "gender": 2,
               "credit_id": "546a22beeaeb816b46003752",
               "name": "David Alan Grier",
               "profile_path": "/5tkt3qRZTco4sz604aTIarQ0m8W.jpg",
               "id": 58563,
               "order": 3
            },
            {
               "cast_id": 2,
               "character": "Virgil",
               "gender": 2,
               "credit_id": "52fe46279251416c7506efa9",
               "name": "Bruce Campbell",
               "profile_path": "/hZ2fW0gpPIBvXxT5suJzaPZQCz.jpg",
               "id": 11357,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Happy",
               "gender": 2,
               "credit_id": "52fe46279251416c7506efad",
               "name": "French Stewart",
               "profile_path": "/8IpVIyRvwRAeWjsGtM7eAcZlj4t.jpg",
               "id": 67711,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Maj. Vladikov",
               "gender": 2,
               "credit_id": "52fe46279251416c7506efb5",
               "name": "Tim Curry",
               "profile_path": "/hPyCIUATIvrzPx8ZbsIJ15l5u8u.jpg",
               "id": 13472,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Admiral Quinton McHale Sr.",
               "gender": 2,
               "credit_id": "52fe46279251416c7506efbd",
               "name": "Ernest Borgnine",
               "profile_path": "/kQhcGAc2TgohrvLZSYapT2SHRby.jpg",
               "id": 7502,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46279251416c7506efc3",
               "name": "Bryan Spicer",
               "profile_path": "/yyqVSx1GZlUQbAPncdrgzcqSNVX.jpg",
               "id": 42111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46279251416c7506efc9",
               "name": "Peter Crabbe",
               "profile_path": null,
               "id": 83292,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46279251416c7506efcf",
               "name": "Andy Rose",
               "profile_path": null,
               "id": 96380,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.763162,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14908,
      "vote_count": 30,
      "budget": 0,
      "overview": "Retired Lieutenant Commander Quinton McHale spends his days puttering around the Caribbean in the old PT-73 selling homebrew, ice cream, and swimsuit calendars. He's brought out of retirement when his old nemesis turned the second best terrorist in the world, Major Vladikov, takes over the island of San Moreno and starts building a nuclear launch silo on it. With help from his old crew and hindrances from Captain Wallace B. Binghampton, who sank a cruise liner a while back, McHale tries to put Vladikov out of business.",
      "similar": [
         7461,
         691,
         817,
         36955,
         68721,
         14869,
         72559,
         387,
         75674,
         5125,
         201088,
         818,
         1907,
         36557,
         98566,
         49026,
         44833,
         1669,
         12113,
         22
      ],
      "original_title": "McHale's Navy",
      "runtime": 108,
      "poster_path": "/nPT7TBckS0YWugsgNmcFJoiYRpH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "The Bubble Factory",
            "id": 27128,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sheinberg Productions",
            "id": 38664,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-18",
      "vote_average": 4.3,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "McHale's Navy Collection",
         "id": 393564,
         "poster_path": null
      },
      "tagline": "He's Under Siege and Out-of-Control.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bryan Spicer"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Peter Crabbe",
         "Andy Rose"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3MzEzODMxM15BMl5BanBnXkFtZTcwNjg4ODAwMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Arnold, Dean Stockwell, Ernest Borgnine | See full cast and crew »"],
      "reviews": [
         "I just caught this movie on Encore. I'd never had much interest in seeing it based on the negative comments that have been made about it. It was much better than I (and a lot of other people) gave it credit for being. I came to the IMDB site because the credits went by too fast and I wanted to check some of the actors. I was surprised to find that so many people really disliked this film. First of all, I'd like to point out that the original show was fantasy. C'mon--does anyone really think that the series represented what it was like in the South Pacific during the Second World War? It also doesn't give you much of a starting point except the characters and their interactions. With apologies to Tim Conway, Joe Flynn, et. al., the original series had only one star--Ernest Borgnine. It was called McHale's Navy for a reason. So it's fitting that Tom Arnold should be the focus of the movie. I think they did keep to the spirit of the original series and, where these comments started, the movie was just as much a fantasy as the series was. In terms of the plot, it too kept with the spirit of the original series. For those of you looking for plot depth or profound characters missed the point of both the series and the movie. It was supposed to be entertainment, escapism, with a mild segue into reality. If you want something profound, watch Schindler's List or something by Kurasawa, or anything Shakespeare by Brannagh. But don't ask me to eat the same thing for dinner each night--I'll get tired of it and I'll yearn for cotton candy. Movies of this type are called \"guilty pleasures.\" They're supposed to be fun. Having said that, one man's fun is another man's Bergman. This movie isn't going to be everyone's cup of tea but it isn't a bad movie. Just take it for what it is--a little bit of fun, a little bit of fantasy.",
         "Yup... I guess I WAS right. I MUST be the only person in this entire country who absolutely enjoyed this film. Yes, it wasn't as good as the original TV show, but name one remake that HAS been?..... Anyone?..... I didn't think so. However, if you compare this movie to an episode of the show, you'll see that the formula was fairly well preserved. McHale seemed very in character to me, as did Binghampton. And I have a little theory that says that if an actor/actress from the original show agrees to have a role in the remake, then they have approved of it. So, I'm not about to argue with Mr. Borgnine, although I have no reason to anyway. I thought Dean Stockwell as Capt. Binghampton was absolutely hilarious, and I think he did an imitation of his voice very well. This movie made me a fan of David Alan Grier--he was brilliant in this movie. Yes, the movie was cheesy, corny, and whatever synonyms you can think of. But it was funny and every time I want a good laugh, this is the first movie I pop into the VCR.",
         "The acting isn't the best and the story line is pretty stupid but it's a fun movie. Don't over analyze it because it's supposed to be a funny and retarded movie. Why else would Tom Arnold be in it? lol If you are a serious or uptight person who only appreciates high budget awarded winning films than don't bother watching it. On the other hand, if you are like me and enjoy watching all types of movies from low budget yet entertaining disasters to box office hits than you would probably enjoy this movie. I love Tim Curry as Vladikov. He is a great actor and always does extremely funny roles. I love this movie.It was extremely cheesy but it is so entertaining. When ever I want a good laugh this is one of the films I watch.",
         "OK for starters, this movie deserves far better than the 3.8 it currently holds, hence my 8/10. In truth, this film is a great piece of entertainment, and I can think of few films that are as mindless as they are funny. This is not meant to be Oscar material, but succeeds in entertaining from beginning to end. Bruce Campbell of course makes this worth seeing by himself, but the rest of the cast hold their own. Tom Arnold usually is seen as a bad indicator of quality, but his cheesy dialog has its moments. Rent it, buy it, just watch it, and judge for yourself. It will not be a waste of time.",
         "I know most people hate McHale's navy, but I really don't care. I thought it was pretty funny. Tim Curry was really good as the villain, Vladikov (the #2 best terrorist in the world). Bruce Campbell is pretty good. David Allen Grier was, as usual, great as Ens. Charles T. Parker. I'd never seen the original series, but I'm glad that they had Ernest Borgnine, the original McHale, as Cobra. And, last, but DEFFINITELY not least, Tom Arnold. I used to watch Roseanne, and always liked his obnoxious humor. It's even better in McHale's Navy. He's got some unique style, that guy. Well, I've chatted long enough. PS. Tim Curry and Tom Arnold had both been in an episode of Roseanne.",
         "I watched this on a commercial station and between each advert break they flashed up the title card as 'McHale's War' instead of McHale's Navy, and that seemed to sum up the complete lack of interest this film generates in almost everybody. The TV station couldn't even get the title right. This is a bad film \u0096 a comedy that is consistently and forcefully unfunny. I didn't laugh once throughout the entire hellish running time, and only managed the barest ghost of a smile on a couple of occasions. Let's face it \u0096 any film in which Tom Arnold is the star is in trouble from the off. For all I know he may well be a wonderful person but he isn't a star and he isn't a comedian. The only time he's funny is during the 'action' sequences and when he tries to act serious: his nostrils flare a little and his eyes widen a touch and that's it \u0096 it's a kind of one-size-fits-all expression for every emotion he is called upon to express. He's supposed to be one of those charismatic types in this film, the type of guy everyone warms to the moment he opens his mouth. That's right \u0096 Tom Arnold. Did some casting executive read this part and really think to himself 'why, that's a part just tailor-made for that Tom Arnold chap? Hmmm. Dean Stockwell is also in this, he's quite a good actor but he's awful here \u0096 in fact he hasn't been much good in anything since Married to the Mob. Tim Curry is just a cartoon character in a flesh suit these days and sleepwalks through his role. The running joke about his being the second greatest terrorist in the world is done to death in the first twenty minutes of the film and then thankfully forgotten. Only the ever-solid Bill Campbell is worth a look, but his part is woefully small. The TV show was around before my time, so I've no point of reference with regard to how accurately this film captures the atmosphere of the show, but somehow I can't believe it was as lame as this. If it was the film would never have been greenlighted. Do yourself a favour and do what everyone involved in this mess should have done: give it a wide, wide berth.",
         "It was hard to tell if they were trying to be \"so bad that it was funny\" or if it was just that bad. The movie suffers from continuity issues to incorrect uniforms and not being funny. Special effects were low budget. They did not try to disguise that models were being blown up or that sets did not make sense. The cast has several familiar faces but the acting was below standard. The characters were too cartoonish and over exaggerated. Some plot mechanics are stretched too thin to be believable. It is OK to be unreal in fiction, but the audience needs to believe the story. That aspect was not accomplished. Not the worst movie but it is a bad one. It has very little to do with the namesake 1960's TV show.",
         "Naval commander McHale has left the service and set-up trade on a Caribbean island, which supplies his former mates at a military base nearby with all their needs. The base is now commanded by Capt. Binghampton and island governor has a deal with a terrorist to use the island as base. McHale gets back into his crew when his arch-enemy Major Vladikov sets up an operation to destroy the island..... 1997 was a random year for comedy, you had watchable guff like Rocketman and Most Wanted, but then you had awful, brain dead movies like Gone Fishin', and this film. I don't think that it matters that I have never seen the series, but I get the jist. I'm guessing it was a lot like St. Bilko, but set at sea. Arnold is an okay screen presence, and is a wonderful supporting character, as seen in True Lies, and even Exit Wounds. But the man cannot carry a movie, and Carpool and this prove it, and no matter how many zany supporting characters there are, it doesn't help him. The story is awful, Messing looks desperate, and Curry hams it up almost illegally. There's a big explosion at the end and Dean Stockwell looks bored. Like I was after this dirge.",
         "Is it as good as the original series? No it isn't. Is it is the worst film ever? No, there are much worse- Disaster Movie, Home Alone 4, The Garbage Pail Kids Movie, Superbabies:Baby Geniuses 2 and Titanic:The Animated Movie are all much worse than this. Is it a bad film? I personally don't think so. Yes the plot is predictable and falls into stupidity one too many times. Yes there are some hits and misses in the jokes and script, I actually found a lot of it funny but some of them(ie. Vladikov's 2nd best terrorist in the world boast) got old quite fast. And yes French Stewart is given very little to do. Despite this, I found myself enjoying it. I don't know why, I just did. The film looks nice enough, some of the scenery is colourful and the photography is decent enough. I liked the soundtrack too, especially Working on My Tan which was a nice addition. While corny, the script did get some laughs from me, and Bruce Campbell while underused is fun to watch. The direction is okay, the film moves quickly and is fairly short while nicely rounded off. The cast are fine on the whole. Ernest Borgnine is a joy as always as is Dean Stockwell whose comic talent here almost equals his TV counterpart Joe Flynn, as is Tim Curry(anybody who knows me knows I am a fan of Tim's), and Tom Arnold and Debra Messing are appealing too. Overall, hardly something to rave about but I personally don't think it deserves the panning it gets. 7/10 Bethany Cox",
         "Quint McHale (Tom Arnold) has made a fine life of smuggling contraband through the United States Navy in San Moreno. But his old nemesis, Major Vladikov, has set up base on a nearby island and is looking to become the world's best terrorist. While this movie is quite stupid, it's also really fun and I did find some parts amusing. It's a clean sort of fun, which you don't see much of any more, and I appreciated that. Strictly PG. And I enjoyed watching men follow Tom Arnold around (which, according to Bruce Campbell, is mostly all him and French Stewart were directed to do -- and if you watch for this, you'll see it right away). We also have Dean Stockwell, Debra Messing (before she was big), Tim Curry and Ernest Borgnine (the original McHale from the TV series). I am suspicious that whoever wrote this also wrote the \"Maverick\" movie, because there are some eerie similarities (some of which I can't get into without spoiling it). I don't know if that's a good thing or a very bad thing. I should also note this movie felt, to me, degrading to women. On one hand they're congratulating Penelope Carpenter (Messing) on her accomplishments as a woman, but then the next moment they are treating her different than everyone else. She is seen as supportive and inferior, and really her only purpose in the plot is to be a romantic interest for McHale -- the ultimate in secondary characters. Normally this wouldn't bother me, but they made it so obvious. All in all, I really did enjoy this movie. Why it received such a poor response from viewers, I don't know. The cast is eclectic and fun, the jokes silly but endearing. And as long as you like Tom Arnold (I don't mind him) you should be able to enjoy this film. Everyone seems to confuse it with \"Down Periscope\", which is too bad -- this is a good one in its own right."
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": [
         "Bubble Factory, The",
         "Sheinberg Productions"
      ],
      "summaries": [
         "Retired Lieutenant Commander Quinton McHale spends his days puttering around the Caribbean in the old PT-73 selling homebrew, ice cream, and swimsuit calendars. He's brought out of retirement when his old nemesis turned the second best terrorist in the world, Major Vladikov, takes over the island of San Moreno and starts building a nuclear launch silo on it. With help from his old crew and hindrances from Captain Wallace B. Binghampton, who sank a cruise liner a while back, McHale tries to put Vladikov out of business.",
         "Naval commander McHale has left the service and set-up shop on Caribbean island, which supplies his former mates at a military base nearby with everything. The base is now commanded by hard-headed Capt. Binghampton and island governor has a deal with a terrorist to use the island as base. McHale gets back into his crew when his arch-enemy Major Vladikov sets up an operation to destroy the island."
      ],
      "budget": 31190000
   },
   "movielensId": 1445,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-04-18",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Bryan Spicer"],
      "runtime": 108,
      "movieId": 1445,
      "title": "McHale's Navy",
      "mpaa": "PG",
      "actors": [
         "Tom Arnold",
         "Dean Stockwell",
         "Debra Messing",
         "David Alan Grier",
         "Bruce Campbell",
         "French Stewart",
         "Tim Curry",
         "Ernest Borgnine"
      ],
      "imdbMovieId": "0119640",
      "originalTitle": "McHale's Navy",
      "genres": [
         "Action",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["K_MLWXe3PCc"],
      "plotSummary": "Retired Lieutenant Commander Quinton McHale spends his days puttering around the Caribbean in the old PT-73 selling homebrew, ice cream, and swimsuit calendars. He's brought out of retirement when his old nemesis turned the second best terrorist in the world, Major Vladikov, takes over the island of San Moreno and starts building a nuclear launch silo on it. With help from his old crew and hindrances from Captain Wallace B. Binghampton, who sank a cruise liner a while back, McHale tries to put Vladikov out of business.",
      "tmdbMovieId": 14908,
      "avgRating": 2.32417,
      "releaseYear": "1997",
      "numRatings": 1419,
      "posterPath": "/nPT7TBckS0YWugsgNmcFJoiYRpH.jpg"
   }
}