{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "drug addiction",
            "id": 1803
         },
         {
            "name": "suspicion of murder",
            "id": 2619
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "withdrawal",
            "id": 164605
         }
      ],
      "imdb_id": "tt0119225",
      "video": false,
      "title": "Gridlock'd",
      "recommendations": [
         19092,
         11443,
         10952,
         16136,
         14398,
         14469,
         14759,
         10381,
         10279,
         8291,
         24701,
         10126,
         4997,
         7501,
         9448,
         174344,
         5965,
         50374,
         76785,
         39787
      ],
      "backdrop_path": "/wsQQ1hOlNCzIjMzQw26RReULylS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ezekiel 'Spoon' Whitmore",
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045869",
               "name": "Tupac Amaru Shakur",
               "profile_path": "/qPpFzmTKEcxEea6J4UTI5ic1tsf.jpg",
               "id": 54422,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alexander 'Stretch' Rawland",
               "gender": 2,
               "credit_id": "52fe44eb9251416c7504586d",
               "name": "Tim Roth",
               "profile_path": "/hgaIXIW9GKnZhrweplBonG7uhhP.jpg",
               "id": 3129,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Barbara 'Cookie' Cook",
               "gender": 1,
               "credit_id": "52fe44eb9251416c75045871",
               "name": "Thandie Newton",
               "profile_path": "/sW6XsnM2DkX6ujOXZ38aIQAMIWi.jpg",
               "id": 9030,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Woodson",
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045875",
               "name": "Charles Fleischer",
               "profile_path": "/vlF5j4y3lEKO6wXJ1R98ixUmebx.jpg",
               "id": 12826,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Blind Man",
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045879",
               "name": "Howard Hesseman",
               "profile_path": "/AvzHr1Ul5xmcoGvmGW8t9mrwBTG.jpg",
               "id": 35516,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "D-Reper",
               "gender": 2,
               "credit_id": "5a2c84b10e0a264cd0143461",
               "name": "Vondie Curtis-Hall",
               "profile_path": "/tH7QvQ9ST9zLuZZsTHzxMXkgtIy.jpg",
               "id": 6198,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Cop #1",
               "gender": 2,
               "credit_id": "5a2c84c4c3a3680b93144a02",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c7504587f",
               "name": "Vondie Curtis-Hall",
               "profile_path": "/tH7QvQ9ST9zLuZZsTHzxMXkgtIy.jpg",
               "id": 6198,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045885",
               "name": "Vondie Curtis-Hall",
               "profile_path": "/tH7QvQ9ST9zLuZZsTHzxMXkgtIy.jpg",
               "id": 6198,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c7504588b",
               "name": "Ted Field",
               "profile_path": "/qmB7sZcgRUq7mRFBSTlSsVXh7sH.jpg",
               "id": 9196,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44eb9251416c75045891",
               "name": "Erica Huggins",
               "profile_path": null,
               "id": 51385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045897",
               "name": "Damian Jones",
               "profile_path": null,
               "id": 55480,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c7504589d",
               "name": "Scott Kroopf",
               "profile_path": null,
               "id": 9184,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c750458a3",
               "name": "Russell Simmons",
               "profile_path": "/914DmPLCzQwoUQpW1tBYIiKWgpj.jpg",
               "id": 60474,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c750458a9",
               "name": "Paul Webster",
               "profile_path": "/fze6uF1oCdDYJFA5tbVhKX9nwW3.jpg",
               "id": 21378,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c750458af",
               "name": "Stewart Copeland",
               "profile_path": "/e0spn3RZW1DCziwyCQsSNPyQIU5.jpg",
               "id": 2987,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eb9251416c750458b5",
               "name": "Bill Pope",
               "profile_path": null,
               "id": 9341,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c750458bb",
               "name": "Christopher Koefoed",
               "profile_path": null,
               "id": 57779,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.57488,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12489,
      "vote_count": 77,
      "budget": 0,
      "overview": "After a friend overdoses, Spoon and Stretch decide to kick their drug habits and attempt to enroll in a government detox program. Their efforts are hampered by seemingly endless red tape, as they are shuffled from one office to another while being chased by drug dealers and the police.",
      "similar": [
         4771,
         429733,
         15069,
         20676,
         96,
         979,
         281,
         75780,
         339692,
         193893,
         395834,
         507,
         152532,
         4997,
         984,
         2142,
         25376,
         21484,
         1266,
         10651
      ],
      "original_title": "Gridlock'd",
      "runtime": 91,
      "poster_path": "/pmjhOXwqm5JO2Q99ZZKaPUtJvGO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
         "name": "PolyGram Filmed Entertainment",
         "id": 1382,
         "origin_country": ""
      }],
      "release_date": "1997-01-29",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Life is a traffic jam.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vondie Curtis-Hall"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Vondie Curtis-Hall"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119225/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA3OTQ5OTMwM15BMl5BanBnXkFtZTcwODI4MTU1MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Tupac Shakur, Tim Roth, Thandie Newton | See full cast and crew »"],
      "reviews": [
         "Rhythm is the key of this superb movie, the elapse is basically an endless chase that keeps you awake all through the movie. Besides the whole atmosphere is very cool the decadence of the junkie world has a glamour of its own, mostly when it's magnificent represented by Tim Roth (the acid James Cagney) and Tupac Shakur who really shows us his acting skills here. You gonna love him. The movie is basically perfect in the sense there's nothing to criticize: On every single aspect the movie is magnificent. Vondie Curtis-Hall simply couldn't make a better debut as a director.",
         "Great movie! One of the best movies i've ever seen! This film shows how hard and difficult is to quit drugs and find a place for treatment when you're a poor person! Great acting, great plot and very well direct. This is NOT another movie about drugs and drug addicted only, its about burocracy of the healthcare system, how bad it is unless you have money and how it affects this people. Watch this movie if you can, its really good.",
         "On New Years Eve, jazz musicians Stretch, Spoon and Cookie are using when Cookie overdoses. This is all the motivation Spoon needs to kick and both he and Stretch resolve to give it up. They spend the next day trying to get into a rehab clinic while also getting accidentally mixed up in a murder enquiry. This is a very dark satire on the bureaucracy of the US healthcare system - a wonderful system if you can afford it, unfortunately not for the millions of disenfranchised who are outside the system. Like Stretch and Spoon. The film shows the frustration they experience with a system that is not focused on the needs of their customers but is layer upon layer of paperwork and bureaucracy. The film shows them getting the round around when all they want to do is kick. However this is not all one sided - the film is intelligent enough to know that both clients and system need to give some. As one of the health care workers says \"we have rules. You expect the world to stop just because today you've decided to kick. Like we've all been waiting for this day for 10 years!\" This is very clever because the film doesn't want to be too sympathetic to junkies after all. However it also rightly sees the major problems that exist in the system. The subplot involving the drug-related murder is a good addition to the plot as it compliments the range of problems they are experiencing, and somehow it doesn't seem to fit in too badly with the story even though it relies on several coincidences to get it moving. The direction is good, the flashbacks are well handled visually and in terms of placing them within the film. The feel of the film is gritty and unrealistic, the drug use is viewed neutrally - the good side of it sits beside the bad side and neither is pushed more than the other. Vondie Curtis Hall is a great actor (with a cameo role here and plenty of great performances in Passion Fish, Drop Squad, Crooklyn), here he shows that he is a good director as well (I can forgive him for Glitter!). But the story is what makes this film - it's dark right up till the end, but the ending feels like a cop out - is it a flashback or is it a happy ending? I don't know. The performances are roundly good. The chemistry between Tupac and Roth is natural, with Tupac playing it calm and Roth being more angry and aggressive. Both are convincing - Tupac is a good example of a musician crossing over into film and giving a good performance - Master P et al please take note and stop being so arrogant! This is a fitting testimony to Tupac's talent. Roth is good as always with his American accent. Thandie Newton is very good looking and is a good actress but here she's not totally convincing - epically during the jazz scenes where she doesn't really have the voice to be convincing. Outside of these three the rest of the cast throws up some well known faces - Vondie Curtis Hall is good and Lucy Liu makes a brief pre-fame appearance. Overall a solid drama that is a good satire that is greatly helped by the chemistry between Tupac and Tim Roth.",
         "This movie was just a lot of fun, no matter how you try and break it down. I saw it because of Tim Roth, and I'm glad I did; Tupac Shakur was just as enjoyable to watch, along with smaller roles from the now much-more-famous Thandie Newton and Lucy Liu. In retrospect, the character development isn't anything incredibly deep, but it still has incredibly funny and dramatic moments despite this. It plays like a stageplay on a skateboard, bouncing from place to place, the journey more important than the destination. Maybe that sounds a little silly, but it's still a lot of fun to watch and a lot of fun to go on a ride with these characters. Definitely a great kick, as we patiently wait for another film from mostly-actor Vondie-Curtis Hall.",
         "Recently I saw `Gridlock'd' on BET, in edited format - however I enjoyed this movie great deal. On one hand, it describes the unpredictable and often dangerous lives of drug addicts - dealing with murder, overdoes, unemployment, STDs, etc. - in doing so it once again explicates the consequences of substance abuse. On the other hand - it depicts the absurdity of government bureaucracy and healthcare system in USA. Although being Canadian myself and enjoying privileges of \"free\" healthcare, one can still relate to the misfortunes of this movie's protagonists in their search to end their deadly habit - in their losing fight against \"the system\". Acting is expectedly good - Tim Roth does his usual swaggy/ cool style, even with his character's boundaries; while the viewer enjoys one of the last appearances by the \"fallen soldier\", controversial rapper Tupac Shakur, whose main fascination was dealing with social issues such as the themes of this movie. Some interesting cameos too, not to spoil, I won't elaborate. Even watching edited version, I figured out that there is high amount of profanities and violence involved - however, I believe that is prudent to explicate the social issues of this movie. Good acting, believable/dynamic story; and although not a family movie, a definite \"must\" to any (PG14+) movie fan. 7/10",
         "This movie rocks! That's all I can say about it. 2Pac is great, and what to say about Tim Roth? He's awesome. The chemistry between Shakur, and Roth is powerful. The situations are really cool, and you can't help but enjoy this movie. Recommended for everyone.",
         "From the very first to the very last scenes of this film, I sat immobile, bug-eyed, and completely agog at the sight of my own painfully hopeless experience as a strung-out junk zombie. And I wonder: why did they never screen this film for us in rehab? Not only is \"Gridlock'd\" an exciting, intelligent, and visually riveting film, it is also dead on the money in its depiction of the excruciating emotional, spiritual, and material bankruptcy of a junkie's living death. Stretch and Spoon are well fleshed-out characters with which I can identify in almost every aspect, and are beautifully portrayed by Shakur and Roth. The true genius of this story is that, despite its grim and uncomfortably blunt treatment of its subject matter, it manages to convey a message of hope that no matter how deeply entrenched in addiction one may be, one CAN break the shackles of substance abuse and realize that one's life is worth saving.",
         "With no plot and very little in the way of action, it is amazing that this little film works so effectively. Basically a day-in-the-life tale following the misfortunes of two drug addicts, Stretch (Roth) & Spoon (Shakur), as they desperately try to kick heroin and avoid the unfortunate attention of a local gangster (Curtis-Hall). The dialogue is sparky and funny, and the two leads are very impressive. Shakur is a true revelation, and Roth plays the part he always plays very well. The film tries to be very moral at times, but isn't, and the music in the film steps on the wrong side of ridiculous. But as a good night in front of the TV, Gridlock'd succeeds magnificently.",
         "Extraordinary chemistry between Tim Roth and Tupac Shakur is the best feature about this movie. The situations are really interesting with a bit of black humor and some action going on. Tupac Shakur, against all criticism, delivers a solid, believable, likable performance. Tim Roth is amazing and delivers a badass performance as the \"cool\" junkie with a bad attitude. I really dig how they care for each other and how they help each other whenever there's trouble. The drug sub-plot is also interesting and very good carried on. Years ago I mentioned on another review that this was the best on-screen duo of 1997. I still think the same.",
         "Imagine the lives of the two musicians, Stretch and Spoon, part of a jazz combo that receive a warning sign when the other member of the group, the sultry Cookie, the singer, is found almost comatose after a drug overdose. Stretch and Spoon decide they have been lucky, so far; they must change their lives and their dependency on drugs. Alas, the system is against them. The two embark in a vain attempt to be enrolled in Medicaid so they can be detoxed. Everything turns against them. To vent their frustrations, they visit the drug dealing Mud, but they are surprised what they find in the apartment. Then, to make matters worse, they are chased by a dangerous duo who want something they took from Mud's place that belong to them. The pair get into all kinds of hot water. They are even shown on the television news as the probable culprits for offing their friend. In every government agency the two visit, they are dealt a blow, as nothing comes as simple as what they thought would be a cinch. In order to accomplish being admitted to a hospital and be treated, Spoon asks his buddy to stab him, after Stretch has been shot in the arm. In a hilarious sequence, Stretch tries in vein to do what his friends want him to do. \"Gridlock'd\" directed by Vondie Curtis Hall, an actor making his debut behind the camera, is a personal triumph. Mr. Hall got an excellent crew to work with and amazing performances from Tim Roth and Tupac Shakur, a rap star who died too young. Mr. Shakur impresses as he holds his own against a more experienced film actor of the stature of Mr. Roth. Both are great fun to watch. Thandie Newton, a gorgeous actress, plays Cookie, a sort of singer with an unique style. John Sayles, who had directed Mr. Hall in \"Passion Fish\" has a brief role as a cop. This film will delight viewers with its fast pace in the mean streets of Detroit. The language might put some people off, but it works fine in the context of the action and what the characters are supposed to be."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Def Pictures",
         "Dragon Pictures",
         "Interscope Communications"
      ],
      "summaries": ["After a friend overdoses, Spoon and Stretch decide to kick their drug habits and attempt to enroll in a government detox program. Their efforts are hampered by seemingly endless red tape, as they are shuffled from one office to another while being chased by drug dealers and the police."],
      "budget": 0
   },
   "movielensId": 1447,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-29",
      "dvdReleaseDate": "2002-11-05",
      "directors": ["Vondie Curtis-Hall"],
      "runtime": 91,
      "movieId": 1447,
      "title": "Gridlock'd",
      "mpaa": "R",
      "actors": [
         "Tupac Amaru Shakur",
         "Tim Roth",
         "Thandie Newton",
         "Charles Fleischer",
         "Howard Hesseman",
         "Vondie Curtis-Hall",
         "John Sayles"
      ],
      "imdbMovieId": "0119225",
      "originalTitle": "Gridlock'd",
      "genres": [
         "Crime",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["Zz12rUg_15c"],
      "plotSummary": "After a friend overdoses, Spoon and Stretch decide to kick their drug habits and attempt to enroll in a government detox program. Their efforts are hampered by seemingly endless red tape, as they are shuffled from one office to another while being chased by drug dealers and the police.",
      "tmdbMovieId": 12489,
      "avgRating": 3.27865,
      "releaseYear": "1997",
      "numRatings": 637,
      "posterPath": "/pmjhOXwqm5JO2Q99ZZKaPUtJvGO.jpg"
   }
}