{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "missouri",
            "id": 5900
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "mechanic",
            "id": 10260
         },
         {
            "name": "in the closet",
            "id": 11524
         },
         {
            "name": "mockumentary",
            "id": 11800
         },
         {
            "name": "improvisation",
            "id": 14529
         },
         {
            "name": "whispering",
            "id": 157409
         },
         {
            "name": "travel agent",
            "id": 160510
         },
         {
            "name": "amateur theater",
            "id": 160511
         },
         {
            "name": "dairy queen",
            "id": 160512
         },
         {
            "name": "alien contact",
            "id": 160515
         },
         {
            "name": "fake documentary",
            "id": 160517
         },
         {
            "name": "city council",
            "id": 160518
         },
         {
            "name": "chinese restaurant",
            "id": 160528
         },
         {
            "name": "product licensing",
            "id": 160529
         },
         {
            "name": "hidden character",
            "id": 160530
         }
      ],
      "imdb_id": "tt0118111",
      "video": false,
      "title": "Waiting for Guffman",
      "recommendations": [
         14799,
         13785,
         13370,
         14585,
         10608,
         11446,
         2107,
         21991,
         10631,
         9452,
         15258,
         18203,
         441,
         27845,
         9430,
         12186,
         10141,
         14776,
         12626,
         14742
      ],
      "backdrop_path": "/b5W9ZsLqL0KsH7b7CAq0EBR6rtg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Corky St. Clair",
               "gender": 2,
               "credit_id": "52fe46d59251416c750850f1",
               "name": "Christopher Guest",
               "profile_path": "/fhEQq0q2aR2sh4HU824xunoyAce.jpg",
               "id": 13524,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Allan Pearl",
               "gender": 2,
               "credit_id": "52fe46d59251416c750850f5",
               "name": "Eugene Levy",
               "profile_path": "/69IBiDjU1gSqtrcGOA7PA7aEYsc.jpg",
               "id": 26510,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ron Albertson",
               "gender": 2,
               "credit_id": "52fe46d59251416c750850f9",
               "name": "Fred Willard",
               "profile_path": "/j1jWdqmklfIH4hpAbw1DK0gPMX0.jpg",
               "id": 20753,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sheila Albertson",
               "gender": 1,
               "credit_id": "52fe46d59251416c750850fd",
               "name": "Catherine O'Hara",
               "profile_path": "/nDlIwrkmvz11mwsKSTAbM2dfDgC.jpg",
               "id": 11514,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Steve Stark",
               "gender": 2,
               "credit_id": "52fe46d59251416c75085113",
               "name": "Michael Hitchcock",
               "profile_path": "/73p9EPqV8fmjRyYnsFW9iFzuuqH.jpg",
               "id": 75463,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Glenn Welsch",
               "gender": 2,
               "credit_id": "52fe46d59251416c75085117",
               "name": "Larry Miller",
               "profile_path": "/xA8zCxNrwtamLaLWNBkLyX5tGtU.jpg",
               "id": 1211,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Libby Mae Brown",
               "gender": 1,
               "credit_id": "52fe46d59251416c7508511b",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Lloyd Miller",
               "gender": 2,
               "credit_id": "52fe46d59251416c7508511f",
               "name": "Bob Balaban",
               "profile_path": "/3g7IKz8ycv0opDxmpoBxsQkUslU.jpg",
               "id": 12438,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Phil Burgess",
               "gender": 2,
               "credit_id": "57a24956925141351e0000cc",
               "name": "Don Lake",
               "profile_path": "/zwm0HhAhxay84Co22rSkHwhJPBG.jpg",
               "id": 27530,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "UFO Expert",
               "gender": 2,
               "credit_id": "57a24965925141354f0000ad",
               "name": "David Cross",
               "profile_path": "/aHSmsfJ48W59WlGB5ZiTjK67I0D.jpg",
               "id": 212,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "UFO Abductee",
               "gender": 2,
               "credit_id": "57a2498092514135df0000a9",
               "name": "Paul Dooley",
               "profile_path": "/rnzvqo7oR2IwSfN2Ayh3ysc4WNt.jpg",
               "id": 15900,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Clifford Wooley",
               "gender": 2,
               "credit_id": "57a2499892514135df0000ba",
               "name": "Lewis Arquette",
               "profile_path": "/uPlzI6d6zjJ8epskb5GepEtkNJF.jpg",
               "id": 75465,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Johnny Savage",
               "gender": 0,
               "credit_id": "57a249ae92514106720011cd",
               "name": "Matt Keeslar",
               "profile_path": "/grucMGE9xHQ4uoE0QSD0dZVQTKe.jpg",
               "id": 35598,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Red Savage",
               "gender": 2,
               "credit_id": "57a249bb92514122650007fe",
               "name": "Brian Doyle-Murray",
               "profile_path": "/fRLFXdb8UQvJs4euZ2sE6CpjbXn.jpg",
               "id": 1535,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Roy Loomis",
               "gender": 2,
               "credit_id": "57a249cec3a36825cf0000c0",
               "name": "Paul Benedict",
               "profile_path": "/Al8zMhyw1EpWVySU0XONYGfXcvB.jpg",
               "id": 41243,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Gwen Fabin-Blunt",
               "gender": 1,
               "credit_id": "57a249fec3a36825a6000101",
               "name": "Deborah Theaker",
               "profile_path": "/w742zR3zkSbDUpfqwvvpCLabq3z.jpg",
               "id": 167212,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d59251416c75085103",
               "name": "Christopher Guest",
               "profile_path": "/fhEQq0q2aR2sh4HU824xunoyAce.jpg",
               "id": 13524,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d59251416c75085109",
               "name": "Eugene Levy",
               "profile_path": "/69IBiDjU1gSqtrcGOA7PA7aEYsc.jpg",
               "id": 26510,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d59251416c7508510f",
               "name": "Christopher Guest",
               "profile_path": "/fhEQq0q2aR2sh4HU824xunoyAce.jpg",
               "id": 13524,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 4.371484,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16448,
      "vote_count": 85,
      "budget": 0,
      "overview": "Corky St. Clair is a director, actor and dancer in Blaine, Missouri. When it comes time to celebrate Blaine's 150th anniversary, Corky resolves to bring down the house in Broadway style in this hilarious mockumentary from the people who brought you \"This is Spinal Tap!\"",
      "similar": [
         298312,
         359940,
         2142,
         278924,
         692,
         3134,
         18480,
         1730,
         13785,
         12149,
         11564,
         10139,
         24124,
         25155,
         16367,
         11421,
         12521,
         10900,
         10017,
         27723
      ],
      "original_title": "Waiting for Guffman",
      "runtime": 84,
      "poster_path": "/4rjbIRSS5DZAmyMzCgKnsC89LOB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/voYCwlBHJQANtjvm5MNIkCF1dDH.png",
            "name": "Sony Pictures Classics",
            "id": 58,
            "origin_country": "US"
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pale Morning Dun",
            "id": 8841,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "All Night Productions",
            "id": 8842,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-31",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "There's a good reason some talent remains undiscovered.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christopher Guest"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Christopher Guest",
         "Eugene Levy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118111/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5ODAzMDA4NF5BMl5BanBnXkFtZTcwNjc0MTkxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Guest, Fred Willard, Catherine O'Hara | See full cast and crew »"],
      "reviews": [
         "I'm not sure why I waited to so long to see this film as I've known about it for quite some time now, but it was purely delightful. I spent the weekend catching up on my Christopher Guest films, and watched `A Mighty Wind' then `Best in Show' and saved Guffman for last. While I still thought `A Mighty Wind' was better, (in the same way that Sprite is better than 7-Up\u0085 there's really no difference, just maybe an iota of something indescribable that is better) `Waiting for Guffman' is still huddled in there with `Best in Show' as a fantastic film. One thing that I noticed about `Guffman' over the others is that while all of his films have a little heart to them, this film had just a little bit more. I can also see that Guest, while having more of an acting role in this film, went on to lessen his roles substantially, but he really is a good actor. All of the actors show immense versatility, (especially Catherine O'Hara, whose hair in this film made me laugh constantly) but Guest actually surprised me. The fact that the films are primarily ad-libbed is most impressive in `Guffman' in my opinion, and the direction, while very subtle in all of the films, does not rely on editing to lead (or sometimes, create) a gag as much as his later films do. All of Guest's films are fairly short (clocking in at 90 minutes or less) so I would suggest that if you haven't seen any or all of his mockumentaries, to just schedule a film festival with some friends and watch them in order. It's fun to compare them, and to watch the same actors take on different personas, and `Waiting for Guffman' is a strong and hilarious piece of work. --Shelly",
         "Civic pride and the desire to perform bring an eclectic group of people together in the mock documentary, or `mockumentary,' `Waiting for Guffman,' directed by Christopher Guest. As he did with his more recent outing, `Best In Show,' Guest uses his satirical format to tell the story of the good people of Blaine, Mo., who are planning a celebration to commemorate the sesquicentennial of their fair town, the highlight of which will be a play depicting the history of Blaine. And how fortunate they are, as the celebrated director Corky St. Clair (Guest), who has had some close encounters with Broadway, has recently settled down in Blaine and has agreed to undertake the monumental task of directing the play, which he decides to present as a musical. He has the High School band/music teacher, Lloyd Miller (Bob Balaban) to provide the music; now all he has to do is assemble his cast. So he posts an announcement for auditions, and with that, the action begins. St. Clair has a grand vision of what his musical will be, and once rehearsals begin and he realizes just how good it is, he contacts some people he knows from his brush with the Great White Way, who agree to send a representative, Guffman, to see the show. St. Clair, of course, is walking on air, as he sees this as a chance at the big time; he's convinced they're going all the way to Broadway with this one. And on the night of the show, anticipation runs high as St. Clair and the members of the cast wait for Guffman to arrive. They've even reserved a folding chair in the front row for him, and as the curtain goes up, they hold their breath awaiting the first glimpse of The Man himself. Guest takes you through the whole process, from the auditions to the final show, and through interviews you get to know the townsfolk and their feelings about living in Blaine and their thoughts on the sesquicentennial and St. Clair's elaborate musical. And as you meet these people, I guarantee you're going to run into more than a few from your own experience; and anyone who's ever had anything to do with community theater on any level, is definitely going to be able to identify with the characters and situations presented here. Written by Guest and Eugene Levy, the screenplay is rife with insight into human nature on a level with anything ever written by Thackeray or Twain. The humor is dry and subtle; never forced, it evolves totally from the characters and the situations Guest and Levy have created. And, as David Byrne did with `True Stories,' they play up the humor of every day life in a small town without ever making fun or maligning it in any way; there are no `cheap shots' employed just for the sake of a laugh. It's all delivered good-naturedly and with taste. If they seem to be laughing at anyone, rest assured, it's themselves above all. Among those involved in bringing this piece of Americana to life are Fred Willard as Ron Albertson, and Catherine O'Hara as his wife, Sheila, who together run a local travel agency, but are entertainers at heart and jump at the chance to perform in St. Clair's musical; Parker Posey as Libby Mae Brown, who hopes to leave her job at the Dairy Queen behind when the show moves to Broadway; Eugene Levy as Dr. Allan Pearl, a dentist with a latent desire to perform who finally gets his chance with St. Clair; and Matt Keeslar as Johnny Savage, the mechanic who never realized where he real talents lay until St. Clair came along, and winds up on the stage, much to the chagrin of his dubious father, Red, played by Brian Doyle-Murray. The performances by one and all are first rate, and it gives that necessary sense of realism to the film that really makes it work; these are not actors you're watching, but real people in a very real town. The supporting cast includes Don Lake (Blaine Historian Phil Burgess), Paul Dooley (UFO Abductee), Linda Kash (Mrs. Pearl), Miriam Flynn (Costume Dresser), Jill Parker-Jones (Stage Manager), Larry Miller (Glen Welsch, Mayor), Deborah Theaker (Gwen Fabin-Blunt, Councilwoman), Michael Hitchcock (Steve Stark, Councilman) and Scott Williamson (Tucker Livingston, Councilman). Alfred Hitchcock may be the Master of Suspense, but with `Waiting for Guffman,' Christopher Guest proves beyond the shadow of a doubt that he is the Master of the `Mockumentary.' He has an eye for detail and an innate sense of what makes people tick, and he fills his film with all the nuance and quirks of life that can be found every day in any small town or metropolis across the country. With this film he holds up the mirror and says, `Go ahead, take a look,' and it gives you a chance to let your hair down and perhaps realize that everything isn't quite as serious as it seems sometimes; a chance to laugh at yourself and the guy next to you, with nothing but the best intentions, while affording you the opportunity of just having some good, old fashioned fun. And that's the magic of the movies. I rate this one 9/10.",
         "Sometimes dry, sometimes bubbling satire of middle America chronicles Corky Corkoran's (Guest) efforts to put on a spectacle commemorating the town of Blaine's 150th anniversary. Told in \"mockumentary\" style like most of Guest's films. Corky drafts an odd assortment of local talent to bring his historical revue to life, including the local dentist (Levy) and travel agent couple (O'Hara and Willard). Like \"Spinal Tap\", this film mercilessly spoofs the \"artistic\" pretentions of Corky and his cast, but the audience ends up feeling genuine affection for the characters, the provincial backwater of Blaine, and even Corky's awful show with laughable music and acting. Guest's performance, as well as several of the others, is very funny and memorable. A likeable comedy that some audiences may find too slow... much funnier than his later (and more popular) \"Best of Show\".",
         "Some people might say this film's improvisational nature is dull and slow, it's the complete opposite. Just imagine a movie completely improvised? Not only does it take talent, it takes guts and charisma to stay with something so bold. While the ending was a little abrupt, this film was still one to enjoy. Christopher Guest seems to have playing a homosexual down to a hilt. If it wasn't for his role in Best in Show, I thought he would forever be typecast as an eccentric gay character. A fun film to watch if you're into alternate types of comedy. But this film also says a little something about the human condition. We aren't all people who wait for each other to speak and are perfectly capable of leading a group of people. This is Guest's gift: he can accentuate the insecurities we have within ourselves and portray it perfectly on celluloid.",
         "It's amazing that Christopher Guest (and the great Eugene Levy) aren't more known. If I had my way, they'd be household names. With so many less talented actors making more money and films than these guys, it's proves it's an unfair world and an unfair biz. Waiting for Guffman is a hilarious film. A great cast and a funny concept make this a classic. These are really talented people in this film, especially when you realize a lot of it was adlibbed. \"Only two people can do it all: Barbara Striesand and Corky...\" \"I hate you and I hate your ass face.\" I still laugh every time I see it. Eugene Levy (my favorite SCTV cast member) is so funny in this movie, I really wish he did more stuff. The man's a genius. When you see these all time great comedy lists, ignore them. They were picked by 80 year old men who still think Buster Keaton is the funniest human to ever live. You'll never find movies like this on those lists. But this movie deserves to be. It's up there with \"The Odd Couple\" and \"Airplane.\" Definitely check it out.",
         "This is the first of several films that Christopher Guest and his friends have made using a very unusual style. Instead of a clearly defined script, some very talented actors (such as Eugene Levy, Catherine O'Hara, Fred Willard and others) took a script idea and improvised throughout. The film was then created using the best bits and I can honestly say that there is nothing like this film. While some of the jokes are very, very dry and occasionally fall flat, there is a subtle charm and wit to the film as you follow a group of 3rd rate local actors who have insane visions of Broadway. The film is ostensibly about a very local stage production about the founding of some small town. While these sort of pageants have been ubiquitous in small town America, this one is unique because supposedly a guy by the name of Guffman is coming to town and plans two see it. Guffman, it seems, is from Broadway and the cast has the temerity to believe that maybe they'll impress him so much that they'll become major stars. Considering the quality of the acting is well below that of an average high school production, this is very absurd. Yet, although ridiculous, there is a certain something in many of these people that is very likable so there is some depth to the film--you aren't just laughing at yokels who have ridiculous aspirations. I thoroughly enjoyed the film and think that people who like their humor subtle and perhaps a bit painful will enjoy this film. People who prefer broad comedy probably won't enjoy this very much.",
         "The current climate of cinematic comedy is comparable, to an extent, to the trend in horror: everything is geared toward pull-out-all-stops excess that is more disgusting than entertaining. We should thank our lucky stars for Christopher Guest, a consistently surprising filmmaker (he directed \"Best in Show\" and wrote \"This is Spinal Tap\") who makes 'mockumentaries' that play like actual documentaries. \"Waiting for Guffman\" follows Corky St. Clair (Guest), a flamboyant stage director who gathers a group of 'eclectic' locals (a cross-eyed dentist; a husband-and-wife travel agent team; a Dairy Queen employee) for a production about the sleepy town in which they live (its claim to fame being home of the footstool). There is a hilarious authenticity to the behind-the-scenes footage, but the film never laughs at its subjects--as viewers, we share Corky's (admittedly delusional) passion with bittersweet good humor. The supporting cast--consisting of Guest regulars Eugene Levy, Catherine O'Hara, Parker Posey, Fred Willard, Bob Balaban, and Larry Miller--is in top form here. \"Waiting for Guffman\" is a quiet comedy gem about a dull, quiet town. And it's also ridiculously rated \"R\" for two quick instances of F-word usage (way to call it, MPAA!).",
         "Without exaggeration, I can tell you that I've seen this movie at least 30 times. And I always find something new about it. For instance, in Ron & Sheila's audition with their treatment of \"Midnight At The Oasis\", it took me about 10 viewings til I noticed that Sheila is mouthing the words to Ron because of his problems remembering his lines. I really don't know where to begin listing my favorite things about this movie - Ron's \"medical reason\" for his sole trip outside of Blaine, Dr. Pearl's Carson impressions, Sheila's \"less-is-more\" acting approach, Corky's tantrums (\"I hate you, and I hate your ass face!\"), Libba Mae's description of her job at Dairy Queen, councilman Steve Stark admiration for Corky (\"GOD, I wish I was in the show\"), there is not a wasted moment in this film. It's stupid of me to try to list them here. The extras on the DVD feature a ton of scenes that weren't in the movie. There's some additional Corky items in his memorabilia collection, including towels from \"Hamlet On Ice\", alternate epilogues for both Ron & Sheila and also Dr. Pearl, a scene of Corky driving around town telling people they made the cast, a nutty scene of Ron's whiffle-ball reenactment of Bill Mazeroski's famous home-run, dinner at Johnny Savage's house, and extra stuff from the musical - \"Nothing Ever Happens In Blaine\", \"This Bulging River\" and also a whacked-out White House scene. But the piece de resistance of the deleted scenes is Libby Mae's other audition piece which is so subtly twisted that you just need to see it yourself. It's debatable whether this movie is outright cruel in making fun of small townsfolk & community theater types. But the more I watch it and get into it, I think that everybody in the movie has a strong amount of affection for their characters. I don't know; you watch it 30 times and tell me what you think.",
         "Christopher Guest has the knack for creating films where genuine laughter never stops. We saw this film when it was originally released, but caught it recently in the retrospect of Mr. Guest's films shown recently here. \"Waiting for Guffman\" is, to this humble viewer, probably his best creation to date. Not only is this a funny movie, it shows the genius of Mr. Guest at his best. Corky St. Clair, the director from the New York stage seems completely out of place in Blaine, Mo. He is too witty for that small little town, where he is clearly adored, not only by the local thespians, but by the whole municipal council. Some of the lines one hears coming from Corky's mouth are so amazing that one wonders if the citizens of Blaine fully realize they have a gem living in town. The players auditioning for Corky's new production about Blaine's beginnings, live in a world of themselves. Ron and Sheila Albertson, are the star of other productions, so they return again for the new show. Libby Mae Brown works in the Dairy Queen, but her ambition is to be a star. Even the local dentist, Dr. Allan Pearl, is attracted to become a performer. There are two other underlying plots going on in the film. There is the history part, or how Blaine came to be, and the other notorious incident of the flying saucer that came into town and took several of the citizens for a tour of the space craft and we are being told about it by the people that experienced that adventure. Christopher Guest makes a wonderful Corky St. Clair. Mr. Guest knows what makes Corky great. Corky, no doubt, is a composite of people Mr. Guest must have known at one time or another. Corky is an enormous achievement for Mr. Guest as a writer and as a performer. Fred Willard and Catherine O'Hara are incredible in their take of the Albertsons, the travel agents without a clue of what's going on outside Blaine. Ron's delicate operation is explained in some detail to the horrified Mrs. Pearl. Eugene Levy, Mr. Guest's frequent collaborator is right on the money as the dentist with singing aspirations. Parker Posey, is the girl who thinks Broadway is only a few steps away. Paul Dooley, Don Lake, Larry Miller,Linda Kash, are among the citizens of Blaine one gets to know in the film. Of course, none of this would have been possible without Christopher Guest. It's a shame we don't get to see more of him, but that makes even better whatever he decides to offer us from time to time.",
         "'Waiting for Guffman', while lacking the expansive detail of the seminal 'This is Spinal Tap', is still a worthy addition to Guest's filmography. The story, as ever, is really quite irrelevant, as the pleasure to be had from these films is in meeting the characters that the actors forge from intensive improvisation. What never ceases to amaze is that these 'improvised' characters have more depth, subtlety and believability than the large majority of traditionally crafted and scripted characters. Equally as impressive is the refusal to turn any character into an object of derision. For all their seeming vacuous vanity and ego driven foibles, these are essentially good people. The entire movie is infused with a benign joy and heartfelt warmth that is irresistible. As others have said, the highlight of the movie is a scene that can only be seen in the DVD extras \u0096 Libby Mae Brown's audition monologue \u0096 an incredibly well written and executed performance that reveals more about her character and Posie's talent than many award winning turns. As ever, the musical numbers by 'Taps' Guest, McKean and Shearer are brilliant \u0096 catchy and witty and performed just on the right side of endearing amateurishness. An excellent movie, that compensates for the lack of laugh-out-loud moments with well crafted, beautifully realized characters, and inspired songs."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Pale Morning Dun",
         "All Night Productions"
      ],
      "summaries": [
         "A town of Blaine, Missouri is preparing for celebrations of its 150th anniversary. Corky St.Clair, an off-off-off-off-off-Broadway director is putting together an amateur theater show about the town's history, starring a local dentist, a couple of travel agents, a Dairy Queen waitress, and a car repairman. He invites a Broadway theater critic Mr. Guffman to see the opening night of the show.",
         "The residents of Blaine, Missouri - the self-proclaimed home of the first UFO landing in the United States (Blaine residents beg to differ with Roswell's claims) and stool capital of the world - are excited about the town's upcoming sesquicentennial celebrations, which will have as its centerpiece the original musical production, \"Red, White and Blaine\". Assisted by high school music teacher Lloyd Miller, Corky St. Clair, the musical's writer/composer and former New York theater professional (off off off off Broadway) who currently leads the Blaine Community Players, will helm the production. Corky and Lloyd are excited about their 'talented' cast of locals and the production as a whole, Corky and Lloyd who themselves are as untalented and unaware as their cast. Corky and company are especially anticipating the presence of Mort Guffman in the audience on opening night, he a representative of the prestigious New York based Oppenheimer Organization. In Corky's mind, a favorable review from Guffman means that the production is heading to Broadway. Through all the ups and downs and more downs of the pre-production, everyone in Blaine still can't wait for opening night and the arrival of Guffman, upon who the cast and crew's dreams rest.",
         "An aspiring director and the marginally talented amateur cast of a hokey small-town Missouri musical production go overboard when they learn that someone from Broadway will be in attendance."
      ],
      "budget": 4000000
   },
   "movielensId": 1449,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-31",
      "dvdReleaseDate": "2001-08-21",
      "directors": ["Christopher Guest"],
      "runtime": 84,
      "movieId": 1449,
      "title": "Waiting for Guffman",
      "mpaa": "R",
      "actors": [
         "Christopher Guest",
         "Eugene Levy",
         "Fred Willard",
         "Catherine O'Hara",
         "Michael Hitchcock",
         "Larry Miller",
         "Parker Posey",
         "Bob Balaban",
         "Don Lake",
         "David Cross",
         "Paul Dooley",
         "Lewis Arquette",
         "Matt Keeslar",
         "Brian Doyle-Murray",
         "Paul Benedict",
         "Deborah Theaker"
      ],
      "imdbMovieId": "0118111",
      "originalTitle": "Waiting for Guffman",
      "genres": [
         "Music",
         "Comedy"
      ],
      "youtubeTrailerIds": ["fmkjNb3jiJc"],
      "plotSummary": "Corky St. Clair is a director, actor and dancer in Blaine, Missouri. When it comes time to celebrate Blaine's 150th anniversary, Corky resolves to bring down the house in Broadway style in this hilarious mockumentary from the people who brought you \"This is Spinal Tap!\"",
      "tmdbMovieId": 16448,
      "avgRating": 3.9189,
      "releaseYear": "1996",
      "numRatings": 6837,
      "posterPath": "/4rjbIRSS5DZAmyMzCgKnsC89LOB.jpg"
   }
}