{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt0116754",
      "video": false,
      "title": "Prisoner of the Mountains",
      "recommendations": [
         61460,
         86723,
         65386,
         23898,
         43685,
         61998,
         64293,
         29358,
         72892,
         43336,
         54140,
         63899,
         124096,
         39088,
         81527,
         49653,
         20525,
         44768,
         79701,
         55204
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Sacha Kostylin",
               "gender": 2,
               "credit_id": "52fe48e6c3a36847f817f8eb",
               "name": "Oleg Menshikov",
               "profile_path": "/fj6Ie4e1LTVfXKWUpZtD1IOCub7.jpg",
               "id": 82795,
               "order": 0
            },
            {
               "cast_id": 22,
               "character": "Ivan (Vanya) Zhilin",
               "gender": 2,
               "credit_id": "599c7a699251411ef8002f23",
               "name": "Sergei Bodrov Jr.",
               "profile_path": "/jlF4STOkQGsXmZfeaIqGacckVYn.jpg",
               "id": 71871,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Abdul-Murat",
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f8f3",
               "name": "Jemal Sikharulidze",
               "profile_path": null,
               "id": 223410,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Dina",
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f8f7",
               "name": "Susanna Mekhraliyeva",
               "profile_path": null,
               "id": 223411,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Hasan",
               "gender": 2,
               "credit_id": "52fe48e6c3a36847f817f8fb",
               "name": "Aleksandr Bureyev",
               "profile_path": "/7eB9t1u4zb7OAmwlzE9KHw3lYx7.jpg",
               "id": 223412,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Zhilin's Mother",
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f8ff",
               "name": "Valentina Fedotova",
               "profile_path": null,
               "id": 223413,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Maslov, the Russian Commander",
               "gender": 2,
               "credit_id": "52fe48e6c3a36847f817f903",
               "name": "Aleksei Zharkov",
               "profile_path": "/fVsugSmWdU1dVDG7f3C7QFYhc1T.jpg",
               "id": 39792,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f8db",
               "name": "Sergei Bodrov",
               "profile_path": "/9f4SPMNwQDA64lkSRgNhvrb1etf.jpg",
               "id": 130938,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f8e1",
               "name": "Boris Giller",
               "profile_path": null,
               "id": 223407,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e6c3a36847f817f8e7",
               "name": "Leo Tolstoy",
               "profile_path": "/9aao2Es6ciI1LmGPH7ZptPfS7fK.jpg",
               "id": 20875,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f90f",
               "name": "Carolyn Cavallero",
               "profile_path": null,
               "id": 141176,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f915",
               "name": "Boris Giller",
               "profile_path": null,
               "id": 223407,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e6c3a36847f817f91b",
               "name": "Eduard Krapivsky",
               "profile_path": null,
               "id": 223415,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e6c3a36847f817f921",
               "name": "Leonid Desyatnikov",
               "profile_path": null,
               "id": 223416,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "599c7a529251411f2e002e1f",
               "name": "Sergei Bodrov Jr.",
               "profile_path": "/jlF4STOkQGsXmZfeaIqGacckVYn.jpg",
               "id": 71871,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53c7e277c3a368626c003d39",
               "name": "Arif Aliyev",
               "profile_path": null,
               "id": 145641,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5705183492514147270013af",
               "name": "Pavel Lebeshev",
               "profile_path": "/vrDJfkLzBb9lgzr17Q2YbMgwhqG.jpg",
               "id": 69538,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a929c570e0a2616bd01c371",
               "name": "Sergei Bodrov",
               "profile_path": "/9f4SPMNwQDA64lkSRgNhvrb1etf.jpg",
               "id": 130938,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.189537,
      "production_countries": [
         {
            "iso_3166_1": "RU",
            "name": "Russia"
         },
         {
            "iso_3166_1": "KZ",
            "name": "Kazakhstan"
         }
      ],
      "id": 55936,
      "vote_count": 17,
      "budget": 0,
      "overview": "Based upon a short story by Leo Tolstoy, two Russian soldiers, Sacha and Vania, are ambushed by Muslim rebels in the grandly forbidding Caucasus and taken prisoner. Although complete understanding never fully emerges, their bittersweet ordeal reveals the human soul of two vastly different cultures.",
      "similar": [],
      "original_title": "Кавказский пленник",
      "runtime": 99,
      "poster_path": "/5Okpptte8iNVkGUOnvJ1d32fpVE.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [],
      "release_date": "1996-03-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "An extraordinary story of hope, courage and humanity.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sergey Bodrov"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Arif Aliev",
         "Sergey Bodrov"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0116754/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIxOTM1OTM3MF5BMl5BanBnXkFtZTcwMjQ0Mjk3OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Oleg Menshikov, Sergey Bodrov Jr., Susanna Mekhraliyeva | See full cast and crew »"],
      "reviews": [
         "The simple story of two men captured an imprisoned in a small village develops actually to one of the most poetic and effective peace messages of our times. Based on stable and very well described characters and by the use of magical photography of a small village in Caucausus the movie helps us face the tragedy of war and the madness of human conflict as well. The movie is about two Russians captured by the rebels, kept as hostages by an old man whose son is also in prison by the Russians. Since the old man wants to trade the two Russians with his son he insists that they must not be killed, he keeps them as a hope for his own tragical mission, to rescue his own son, despite the fact that other rebels want hostages killed. One of the Russians, actually a young and unexperenced soldier ends up respecting that small village. The relations among villagers and hostages, the deep human touch between the young Russian and the niece of the old man become the real story in the middle of the war. The viewer confronts since the very beginning what war is about, the importance of human existence and life and the madness of human conflicts. Above all is life, creativity (the youg Russian repairs clocks), laugh and drink. While poverty and sadness reigns in the village tradition and human figures seem to survive. Those human values survive for a few moments before reality shows the cruel side of life once again. The movie is extremely poetic, images and folkloric scenes are well dressed with silent and simple russian music, silence and well developed scenes (the old man loading his son's dead body, the mother of the Russian and the old man meet each other as ennemies with the same feelings though as parenthood is above all wars, the young Russian is afraid to die). Although the actors are not famous you will appreciate the natural talent of the actor playing the old man, a perfect tall-thin shape which dominates the screen. This movie is a must, a call of nature of humanism, a message which can't lose its modernity.",
         "So much for the silly, honest summary. I've seen it twice but both times on t.v. and, both times, with Czech subtitles. Not being Czech, I have a slightly sticky time watching foreign films here. Despite these disadvantages, I love this film. The acting is superior to anything I've seen recently. And, of course, you know, I've a weakness for Bodrov Jr. (Vanja.) While following his somewhat shy and innocent character, you run up against Mensikov (Sasha) playing a professional soldier who knows probability and gusto at the same time. This is not your common Hollywood 'let's throw two opposites together and create tension.' They've been taken hostage by Sikharulidze (Abdul, in a performance of great strength and restraint) hoping to exchange them for his son (a captive of the Russians.) This is war but on the ground where its victims live. There is an immense respect for the lives of the Kavkaske people. The music, customs, faith, food and lives of these tough families is shown without judgment. How damned refreshing. I recommend this film to anyone who likes a fine story, excellent acting, stunning cinematography and mesmerizing music.",
         "In the war between Russia and Chechnya, the two Russian soldiers Sacha (Oleg Menshikov) and Vanya (Sergei Bodrov Jr.) are ambushed and made prisoners of war by a group of Chechens. The old man Abdul-Murat (Dzhemal Sikharulidze) wants to exchange them by his last son, who was arrested by the Russian troops. His other two sons were killed by the Russians, and his family is composed only by his teenager daughter Dina (Susanna Mekhraliyeva) and himself. The two soldiers are kept alive in his village, while Abdul tries to negotiate them with the Russian Commander Maslov (Aleksei Zharkov). Sacha and Vanya are very different persons and while together, they get closer. Sacha has the mentality of a soldier, intending to kill the Chechens from the village, while Vanya is a teacher and prefers to try to understand the locals behavior and culture, performing small jobs for them, like fixing clocks. Vanya falls in love with Dina. This beautiful movie is another magnificent anti-war movie. The touching story, supported by an excellent cast and the Caucasian locations, makes this movie a worthwhile entertainment. My vote is nine. Title (Brazil): `Prisioneiros das Montanhas' (`Prisoners of the Mountains')",
         "I rented this film expecting something a bit different - maybe something in the style of \"Kukushka\" - a story with a deep understanding of human nature, but with a feel good ending. I got an even better film. This film sneaked into my heart slowly and quietly. Like Vanya, I grew to understand and love its characters, regardless of \"sides\". As the plot developed, I understood how easy it was for one side to mistake the other one's intentions; how tradition, so important for people's cultural survival, ended up working against them, fueling the fire that perpetuated the hate; how one side's disregard about the other one's culture/mentality, and the stereotypical way of looking at the enemy added to the mistrust and hatred between both sides. The story is told with cinematic brilliance: simply, almost austerely, with tiny details that make the viewer grow an affectionate, understanding eye for the characters: little Dina, with her lonely, pure heart, adorning herself for Vanya and telling him about her grandmother's necklace, or explaining with the wisdom of a grown-up why she and he could never marry; the children and the Muslim soldiers dancing and playing according to their customs; tongueless Hassan; Vanya's mother hitting the Russian commander when she realizes his methods would get her son killed instead of rescued, dare-devil Sacha with his phlegmatic, humorous yet realistic view on life and war; the Russian Commander's appreciation for good quality food and vodka, etc. Then, there are the human interactions between the two sides: the Russian soldiers trading weapons for vodka with the enemy; the Muslim soldiers showing respect for the two Russian prisoners who managed to clear a road of mines and stay alive; Hassan procuring alcohol for the two prisoners and letting them dance and enjoy themselves, the Muslim villager asking Vanya to fix his clock... The cinematography is excellent; the beauty of the film comes not from any artificially enhanced imaging of the beautiful, harsh landscape, but from authenticity and masterful lens work. This film is unadulterated by big budget glitzy details; one almost feels is watching a documentary of the life in that part of the world, which makes the plot of the film hit like real events would and affect us almost as if we were on that mountain too. Many people are killed in this film, yet one feels there are no good or bad characters, only human beings locked in a conflict that perpetuates itself, because each side's quest for justice is confused with exacting retribution or revenge. Vanya and, eventually, Abdul see that, but like everyone else, they're prisoners of their own circumstances. The film's ending tore at my heart. As the helicopters were flying towards the village, I realized that was the only logical, true to life ending. A happy end that would please the viewer, where things were clarified and Abdul's final act of humanity and compassion was not fruitless, was not possible without turning the film into a fairy tale for adults. A complex, poignant story told in a masterful way.",
         "Sergei Bodrov shows here that he is one of the most talented filmmakers in Russia today, with this riveting tale from the Chechen war. \"Kavkazskij plennik\" stars his own son Sergei jr. and Oleg Menshikov and both do a fabulous job as the Russian soldiers imprisoned by the Chechens in Caucasus. This movie is just what the world needed at such a time-an open hearted and humanistic telling about the evils of war and the uselesness of it all. Although the Russians can sometimes seem portrayed as the better side here and Chechens as ruthless, primitive, barbaric religious fanatics, the portrayal of the Russian commander quickly erases that impression. Here we see the laid back and careless attitude that mirrors the real Russian generals' attitude. The film is pretty tragic, from the death of Menshikov's character and to the tragic and unfortunate killing of Abdul-Murat's son, yet it leaves some hope in the end as Abdul-Murat shows pity for the young soldier whose mother has appealed for his release directly to him. But just as you think that this film will end well, the airplanes come. The ending is truly remarkable and well shot. It echoes the message of the absurdity of war and leaves us with little hope for the peace in the Caucasus.10 out of 10.",
         "Prisoner of the Mountains provides an inside look into the Russia/Chechnya conflict through the eyes of two captured Russian soldiers, Vania and Sacha. The unlikely duo forms a friendship out of their will to escape their imprisonment. Despite the serious basis for the story (the continuing war between the two countries), the film is very multifaceted in that it contains comedy, love, and suspense. In this respect, I greatly disagree with another user who described the film as `bleak, tedious, and uneventful.' The main reason this film succeeds is that it does not only focus on the war and battles between the two sides, but rather develops the underside of the conflict-the characters on both sides. This user likens this film to watching polar bears sleeping because violence only makes up ten per cent of the plot. I have seen movies that are as boring as this analogy. Prisoner of the Mountains does not qualify as this type of film. Bodrov incorporates many different types of scenes in the plot action that evoke a variety of emotions from the audience. There are serious scenes, such as when Sacha and Vania are captured, which elicit fear and apprehension in the viewer. In contrast, there are also more humorous scenes, as in when Vania continues to meddle with the gun he and Sacha stole, after Sacha warns him to be careful, and the gun fires, causing them to lose their only bullet. In this respect, Bodrov makes his film very well-rounded by incorporating various types of scenes that play to different emotions. While the central plot is serious in its portrayal of the war, Bodrov includes less intense scenes in order make the film more interesting and develop the personalities of the characters. The scenes in which Vania and Sacha are shown `getting drunk, whittling, chatting with passers-by, and making friends with their captors' serve to help the audience understand the backgrounds of all of the characters, as well as show character transformation. Through discussions between the two soldiers, the audience discovers that Sacha's at first exterior most likely results from the fact that he is an orphan. In time, we see how Sacha grows to respect Vania, despite his naive nature, and becomes a father-figure to the younger soldier, ultimately sacrificing his life for him. Moreover, we learn how Dina grows fond of Vania and ultimately defies her father to help him escape. In this respect, these scenes are the main point of the movie. In this viewer's desire to see violence, I think he missed the obvious. Bodrov wants the viewer to understand the feelings and motivations of characters on both sides of the conflict. Had the film shown one battle after another, the audience would not have been able to understand the characters because only fighting would have been shown. In this respect, the non-violent scenes are critical to character development as well as the overall impact of the film on the audience. While violence is the setting for the film, it is not meant to be the sole focus of the plot. Consequently, rating this film based on its lack of violence does not do it justice because violent scenes purposely comprise only a part of the action. This reaction would be similar to evaluating a straight play, which had a few musical numbers, as if it were a musical; you would obviously be let down and give it poor marks because your expectations would be too high. In this way, I do not feel that more violent scenes would have added anything to this film. Bodrov sought to illustrate the general tense atmosphere of the situation through the initial capture of the soldiers, the failed escape of the soldiers, the death of Abdoul's son and the expected shooting of Vania. These incidences of violence effectively convey the difficult environment to the audience. Additional killing would have been gratuitous in light of Bodrov's main emphasis of character development. Overall, I found this film to be incredibly engaging and interesting for its depiction of the bitter conflict between the two countries. As a westerner, I can say that the scenery was nice, but that it was not the only good aspect of the film as this viewer states. Perhaps the name and subject of this film is misleading. To a person who wants to see a lot of violence in films, Prisoner of the Mountains would not be my first recommendation. To this viewer, I would suggest The Betrayed, another film on the Russian/Chechnya conflict with significant violent footage. In forming impressions of films, it is important to take into consideration why the director made the film as he/she did. In this instance, it is clear that Bodrov did not only want to present the violent nature of the war, but that he desired to explore the individuals behind the conflict.",
         "In this film, I can find almost everything what I like in a movie. It presents the life of a small community, their thoughts, their feelings and their habits. It has a nice atmosphere, beautiful sights, good actors, and a strong story. What else do you want? Another reason to love Russian movies.",
         "There are probably a lot of prejudices people have against Russian film. Mine were gone after I had seen this one. \"Kavkazskij plennik\" is a film about a youth who's being sent to Chechnya to fight for the Russian army. He's together with another Russian soldier being captured in Chechnya by an older Chechnyan man who wants to change them for his own son, who's is being held by the Russians. There being locked into an old house high among the Caucasian mountains. Soon a friendship develops between them and young girl who brings them food and water. This movie was made after and during the last months of the first Chechnyan war. Everybody's a victim and there is nothing to win in this war, specially for the Russians. It is just a matter of how much you lose. The persons in this film do not hate each other because their fighting on different sides. The Chechnyans probably hates what these Russian soldiers represent, but they know that this war isn't caused by these two Russians. They are both just a small, meaningless part of it. Russia does not give a damn about their lives, probably because it's leaders have lost the humane touch, while calculating their offensives. Lives have been reduced into numbers on white sheet. But there are people who care, even among the \"enemies\". Normal people still show respect for humanity. The rhythm of the movie is great, it leaves the viewer enough time to think and also find the deeper thoughts from the movie. The music is well selected too, I just cant get that tune out of my head. This together with a realistic humane aspect gives this movie a strong pacifistic tune. Definitely worth to take a look at.",
         "I liked this movie very much. It showed the human side of war. It is a compelling view of life during wartime, as seen through the eyes of a handful of individuals, each with his own perspective and agenda. The story is a warm, sometimes depressing, but ultimately hopeful look at human nature at it's best, and worst.",
         "Without doubt the dirtiest war of the late 20th Century was the war in Chechnya . It was actually two wars from 1994to 1996 and flared up in to a second war that lasted from 1999 to 2007 and even today there's acts of sporadic violence . The wars have cost the Russians as much as 8,000 military while the Chechens themselves may have lost 250,000 people both combatants and civilian , a quarter of the population of Chechnya . The worst thing is neither can claim any moral high ground . The Chechens may claim to be victims of genocide but any resistance that involves massacring civilians at Russian schools , cinemas and hospitals has a hard time of claiming victim hood The most compelling account of the conflict comes from the pen of Arkady Babchenko in his book One Soldier's War In Chechnya . It tells of his time as a conscript in the Russian army in the first war and of his time as a regular volunteer in the second war . What quickly becomes apparent is what a brutal institution the Russian army is . Recruits spend the first year of their service under \" the rule of the grandfathers \" soldiers in their second year where recruits are subject to effective slavery at its most brutal and unrelenting which will shock anyone who has any military understanding PRISONER OF THE MOUNTAINS is set during the first Chechen war where two Russian soldiers , Sgt Kostylin and Private Zhilin , are captured by rebels . The film does allude to the structural gulf between an experienced soldier like Kostylin and a recruit like Zhilin , the older soldier doesn't believe the Chechens will trade the recruit because he's unimportant to the Russian army but this is quickly forgotten about as the film moves in to predictable and simplistic territory that states that no matter the conflict and the uniforms we wear we are all human beings caught up in situations made by others It's a well enough made film but by the same token there's nothing outstanding about it either . There's also the problem that if you've read Babchenko's book featuring the very real atrocities each side has committed against the other - in fact each side also commits atrocities on their own - then it does have a rather Walt Disney feel"
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": ["Karavan"],
      "summaries": [
         "Based upon a short story by Leo Tolstoy, two Russian soldiers, Sacha and Vania, are ambushed by Muslim rebels in the grandly forbidding Caucasus and taken prisoner. Although complete understanding never fully emerges, their bittersweet ordeal reveals the human soul of two vastly different cultures.",
         "Vanya is a raw recruit in the Russian army, leaving behind his mother when sent to the Caucasus where Islamic separatists wage guerrilla war. Vanya's tank patrol is ambushed; he and a hard-bitten sergeant (Sacha) survive, kept alive because a village elder, Abdul Murat, wants to trade them for his son, a prisoner in a Russian stockade. The Russian commander lacks the nerve to make the exchange, so Murat has Vanya write to his mother, begging her to come and plead for the trade. Time is the enemy: Sacha seeks to escape, and the villagers urge Murat to execute the pair. Loyalties are complicated by their interactions with the mute jailer and with Murat's teenage daughter.",
         "Two Russian soldiers, one battle-seasoned and the other barely into his boots and uniform, are taken prisoner by an anxious Islamic father from a remote village hoping to trade them for his captured son."
      ],
      "budget": 0
   },
   "movielensId": 1450,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1996-03-15",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Sergei Bodrov Jr."],
      "runtime": 99,
      "movieId": 1450,
      "title": "Prisoner of the Mountains",
      "mpaa": "",
      "actors": [
         "Oleg Menshikov",
         "Sergei Bodrov Jr.",
         "Jemal Sikharulidze",
         "Susanna Mekhraliyeva",
         "Aleksandr Bureyev",
         "Valentina Fedotova",
         "Aleksei Zharkov"
      ],
      "imdbMovieId": "0116754",
      "originalTitle": "Кавказский пленник",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Based upon a short story by Leo Tolstoy, two Russian soldiers, Sacha and Vania, are ambushed by Muslim rebels in the grandly forbidding Caucasus and taken prisoner. Although complete understanding never fully emerges, their bittersweet ordeal reveals the human soul of two vastly different cultures.",
      "tmdbMovieId": 55936,
      "avgRating": 3.71667,
      "releaseYear": "1996",
      "numRatings": 300,
      "posterPath": "/4S0VyYoGpXQqlWag5pWKOCgAYia.jpg"
   }
}