{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dictator",
            "id": 407
         },
         {
            "name": "female protagonist",
            "id": 11322
         },
         {
            "name": "beautician",
            "id": 208664
         }
      ],
      "imdb_id": "tt0118691",
      "video": false,
      "title": "The Beautician and the Beast",
      "recommendations": [
         21352,
         11107,
         15170,
         41582,
         47881,
         8986,
         18856,
         18862,
         48287,
         36929,
         17949,
         83489,
         20551,
         33657,
         17745,
         31220,
         71142,
         45712,
         42001,
         51321
      ],
      "backdrop_path": "/uqzLcR5akw1AK6pHbBp0MUVJLct.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Boris Pochenko",
               "gender": 2,
               "credit_id": "52fe474f9251416c75094de5",
               "name": "Timothy Dalton",
               "profile_path": "/n7QJKtA7jTwGHVuL5cPkqzu7CDG.jpg",
               "id": 10669,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joy Miller",
               "gender": 1,
               "credit_id": "52fe474f9251416c75094de9",
               "name": "Fran Drescher",
               "profile_path": "/vQxr8CRgyDkH3GTFLwacs9W9tF4.jpg",
               "id": 53122,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jerry Miller",
               "gender": 2,
               "credit_id": "52fe474f9251416c75094df9",
               "name": "Michael Lerner",
               "profile_path": "/7VlkzO1z5wh96UCXpPZ0rUFx8aN.jpg",
               "id": 4250,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ira Grushinsky",
               "gender": 2,
               "credit_id": "546a354b22136e68cc003aa0",
               "name": "Ian McNeice",
               "profile_path": "/v217qBNPrwNBvcu9F3BVBPE0AwM.jpg",
               "id": 3547,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Leonid Kleist",
               "gender": 2,
               "credit_id": "546a355beaeb816b55003bd9",
               "name": "Patrick Malahide",
               "profile_path": "/pv65v8oEhLo0ibCz1K23UCoKMuS.jpg",
               "id": 8979,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Katrina Pochenko",
               "gender": 1,
               "credit_id": "546a3569eaeb816b580038b1",
               "name": "Lisa Jakub",
               "profile_path": "/1iw0l7zewS6L1FzQCKJTHu5Eg0e.jpg",
               "id": 8987,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Consuela",
               "gender": 1,
               "credit_id": "581608089251415a7f00d985",
               "name": "Tamara Mello",
               "profile_path": "/xYEvziWM0OpyktDS0FzbRzviSQa.jpg",
               "id": 102313,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe474f9251416c75094def",
               "name": "Ken Kwapis",
               "profile_path": "/oPjor2KnZcSXmtude62KT62yBsu.jpg",
               "id": 29009,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe474f9251416c75094df5",
               "name": "Todd Graff",
               "profile_path": "/jk44OP76UtK5D8bmNkJFqagwziq.jpg",
               "id": 18342,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5547900ac3a368573b00875e",
               "name": "John Dillon",
               "profile_path": null,
               "id": 1460488,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.253441,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17894,
      "vote_count": 69,
      "budget": 16000000,
      "overview": "The story follows the misadventures of a New York City beautician who is mistakenly hired as the school teacher for the children of the president of a small Eastern European country.",
      "similar": [
         3525,
         10765,
         50456,
         297762,
         376290,
         15472,
         390582,
         360814,
         293768,
         459928,
         70,
         290595,
         11412,
         315837,
         76493,
         269149,
         9502,
         914,
         402897,
         346685
      ],
      "original_title": "The Beautician and the Beast",
      "runtime": 105,
      "poster_path": "/2XrA1Kq1USLQJCh0uZv3WWfYUBm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1997-02-07",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Once upon a time...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ken Kwapis"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Todd Graff"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118691/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzE5Njc5MjMxN15BMl5BanBnXkFtZTcwNjI0MDAwMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Fran Drescher, Timothy Dalton, Ian McNeice | See full cast and crew »"],
      "reviews": [
         "First of all, I'll let everyone know that I gave this movie (worthy of a 7) a 10 just because the overall rating deserves to be A LOT higher than it is! Secondly, everyone who gave this movie a bad rating needs to stop rating movies altogether. What's not to like about this movie that is charming, cute, innocent, and funny?? Fran Drescher may have been type-casted right off the Nanny, but who cares!!???!! What did you expect her to act like in the film!?! Were you expecting an oscar worthy performance!!!??? Did you think she was the next Gwyneth Paltrow, or Julianne Moore??? If you saw the previews and have half a brain, you would have known exactly what to expect. I had no expectations for this movie (nor should anyone have) besides a good laugh. And that's exactly what it delivers. Fran is absolutely perfect for the role of Joy Miller and she is even more charming and funny in this movie than Sandra Bullock is in Miss Congeniality (another great movie by all accounts, and I'm not downing the always fantastic Sandra). You people need to STOP ANALYZING MOVIES FOR WHAT THEY'RE NOT AND LEARN TO ENJOY THEM FOR WHAT THEY ARE!!!!!!!!",
         "I don't care if Timothy Dalton has a shitty accent in this movie. I don't care if Fran Drescher has a nasal voice. So what that Slovetzia doesn't exist, and the bad people are dark, gloomy western stereotypes of former eastern regimes. I don't care, as long as I enjoy watching it. I totally adore this movie. It leaves me with a giggle and a big smile on my face, and movies that do that make just as much sense to me as Schindler's List, if I'm in the mood to watch that kind of movie. I love a movie, where I can put my brain on stand by and just enjoy it. I've just received the movie today, and I know, that tonight will be chips and dip night in front of the TV. Just can't wait to watch it again. A big 10 from me for the entertainment value.",
         "This is such an adorable movie. Fran Drescher absolutely blew me away, I had no idea she was so talented -- in this movie she absolutely shines!! Her character \"Joy Miller\" is the Nanny all over again...but this time she has been hired (mistakenly) to teach the four children of a eastern-European dictator. She has amazing comic timing and plays well of off co-star Timothy Dalton, who is a wonderful President of Slovetzia, the tiny (made-up) country that most of the movie takes place in. He is at once a pompous and loveable character...his transformation from Beast to Man is a delight to watch. The plot is a mixture of \"The Sound of Music,\" \"The King and I,\" \"Beauty and the Beast,\" and a kind of twisted Cinderella...but it all meshes together for an endearing (though very predictable) movie. A change from Tim Dalton's usual dramatic/spy movie genre...who knew he could be so funny? But he is, and the movie is adorable and I would highly recommend this if your a fan of Fran Drescher, Tim Dalton or romantic comedies in general!!",
         "I have never enjoyed The Nanny, but I'm a fan of Timothy Dalton. It seems inconceivable that any casting director thought to put these two actors together, but, by some warped cosmic thing, it kind of worked in this movie. Granted, the script is predictable and borrows angles from classics from The King and I, Sound of Music and even I Love Lucy. Yet, when I want to watch something brainless and lighthearted (admit it--we all have those moments) I'll opt for this movie.",
         "While I won't say that this is an excellent movie, I still like it for its irreverent sense of humor. The acting's pretty average, there seem to be so many plots going on at the same time, but it still makes for an entertaining and interesting watch, if only to see the Nanny in her first major big-screen role. She brings the trademark we know so well to the movie - her nasal voice and pre-occupation with the trivial stuff, but she also brings a kind of sensitivity we've never seen before in the Nanny series. I quite like some of the scenes - how she teaches the kids what she knows (airline miles), the massage scene, the home-coming, and a lot of others that just seem to be made just for her.",
         "I have to admit that, for a while anyway, I had a serious crush on Fran Drescher. Those outfits (in Joe's chauvinistic voice): \"OH, YEAH!!!\" That big '80's hair. And that voice (except when she got whiny)??? Uh-huh-huh! Uh-huh-huh! \"The Nanny\" was a good show, though not great. It was raunchy and funny, though, to me (and maybe this is me being more old-fashioned than I'll admit), raunchy sex jokes do not go together with family entertainment. Thus, I was always convinced that it was in a bad time slot. NBC doesn't show \"Law & Order\" at 8:00 (or 7:00 if you're in Mississippi like me). Nitpickiness aside, when I heard that she was doing a movie titled \"The Beautician and the Beast,\" I was quite skeptical. I didn't think that it would be any good. But I sucked up any doubts I had and saw it anyway. I have to admit that, while it's not the best, it's not the worst, either. I actually liked this movie. Granted, the movie is VERY dated (for the most part, Communism is dead), quite predictable (can you say \"The Nanny?\") and can get downright stupid (what's with the chicken?). But it can also be funny, like when Joy, Fran's character, gets the workers to strike, in the tradition of Norma Rae, thus angering Boris Pochenko, played adequately by Timothy Dalton. And there were a lot of raunchy references to her relatives, i.e. one of her aunts having to have facial hair removed. And, without giving anything away, I thought the begining was really cute as well. Not to mention that I was really impressed with a scene near the end of the film where she stands up to Boris. To me, it sounded as if she was really acting, speaking past her quirky voice and speaking the lines with gusto. That may explain how she got a part in a Woody Allen movie, even if it's a bit part. This film isn't for everybody, especially if you're put off by Fran's voice. And, though there are no sex scenes, there are benign sexual references, not to mention mild language. Others might say \"bring the whole family,\" but I wouldn't. While *I* think she's funny (like I said before), I believe her humor is too raunchy for family entertainment. And some of her humor deals with generalizations, which may explain why you don't see her being compared to Julia Roberts, Jennifer Lopez or Rene Russo, strong women who aren't afraid to be \"one of the boys.\"",
         "'The Beautician and the Beast' follows the line of the immensely 'The Sound of Music' and Drescher's own popular sitcom 'The Nanny'. It has the usual mushiness and fluffiness that other American rom-coms have (although this one is set in Eastern Europe) and it's accompanied by a nice soundtrack. However, what really sets this one apart is the delightfully funny Fran Drescher. Her character is no different from her unique persona as Nanny's Fran Fine but even so, her wit, charisma and comic timing are perfect. Those who find her annoying in 'The Nanny' would most likely hate this movie but for me, this actress makes it somewhat likable. Timothy Dalton as the beautician (just kidding) is quite adequate (his fake accent is hilarious) and both actors share a good chemistry. The rest are just okay, mostly gap fillers. There is nothing path-breaking about this movie but if one is a fan of Ms. Drescher then why not give this a try if you've got nothing else to lose?",
         "I think that this was a really adorable movie. Perfect for one of those rainy, there's nothing to do days. I think that Fran Drescher was really lovable in this movie and Timothy Dalton, for once, seemed to take on a somewhat light-hearted role.",
         "I saw this movie in the theater on a hunch and it was a really cute film. The premise is very similar to Fran's \"Nanny\" role (although in this case, she's the \"tutor\"). It's clean, the laughs are consistent, and it's a great family film. I'm not saying the film certified for Oscar, but kids would love it.",
         "I was apprehensive when this film came on TV, but as there was nothing else on and I was bored I decided to give it a go. It began badly as I found Fran Drescher incredibly annoying, mainly due to her piercing New York accent. Timothy Dalton was fantastic in his role, and made me laugh a number of times. Ian McNeice was also quite good in what was essentially just a rehash of his role in Ace Ventura: When Nature Calls. The script wasn't excellent but did the job. The film did begin to lose momentum as Timothy Dalton became less beast-ly and the film is about half an hour too long, but those are really the only bad points. This film isn't a work of art, but it provides nice escapism for two hours. 6/10."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "High School Sweethearts",
         "Koch Company",
         "Paramount Pictures"
      ],
      "summaries": [
         "A beautician in America is mistakenly thought to be an academic teacher by a representative of an Eastern European dictator. She is invited to their country on that mistaken belief and is asked to be the tutor of the dictator's children. While there, she tries to Westernize the whole country.",
         "A New York cosmetologist mistakenly thought to be a science teacher is offered a job to teach the children of an Eastern European dictator."
      ],
      "budget": 16000000
   },
   "movielensId": 1453,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-02-07",
      "dvdReleaseDate": "2003-06-24",
      "directors": ["Ken Kwapis"],
      "runtime": 105,
      "movieId": 1453,
      "title": "The Beautician and the Beast",
      "mpaa": "PG",
      "actors": [
         "Timothy Dalton",
         "Fran Drescher",
         "Michael Lerner",
         "Ian McNeice",
         "Patrick Malahide",
         "Lisa Jakub",
         "Tamara Mello"
      ],
      "imdbMovieId": "0118691",
      "originalTitle": "The Beautician and the Beast",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["uKIKvg8NRqU"],
      "plotSummary": "The story follows the misadventures of a New York City beautician who is mistakenly hired as the school teacher for the children of the president of a small Eastern European country.",
      "tmdbMovieId": 17894,
      "avgRating": 2.44952,
      "releaseYear": "1997",
      "numRatings": 1783,
      "posterPath": "/2XrA1Kq1USLQJCh0uZv3WWfYUBm.jpg"
   }
}