{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0116565",
      "video": false,
      "title": "Hotel de Love",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Rick Dunne",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd33",
               "name": "Aden Young",
               "profile_path": "/iox7pYeOOg1c3z7Z8EgAJkpxbE.jpg",
               "id": 144081,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Melissa Morrison",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819bd37",
               "name": "Saffron Burrows",
               "profile_path": "/1X9gJnDIYE4N52UtPZ9qM3Bi2TM.jpg",
               "id": 9825,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Stephen Dunne",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd3b",
               "name": "Simon Bossell",
               "profile_path": null,
               "id": 133686,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Allison Leigh",
               "gender": 1,
               "credit_id": "52fe4978c3a36847f819bd3f",
               "name": "Pippa Grandison",
               "profile_path": null,
               "id": 3059,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Jack Dunne",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd43",
               "name": "Ray Barrett",
               "profile_path": "/5fi1hkUfaKO1A9ukQqmO8rnWfKu.jpg",
               "id": 34657,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Edith Dunne",
               "gender": 1,
               "credit_id": "52fe4978c3a36847f819bd47",
               "name": "Julia Blake",
               "profile_path": "/dUGeDN3JbXsQM6DtM2uCIh1NJyv.jpg",
               "id": 77561,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Norman Carey",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd4b",
               "name": "Peter O'Brien",
               "profile_path": "/ebW9eoPY57aR1CKp8G82Hl9PyL.jpg",
               "id": 63295,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Janet Campbell",
               "gender": 1,
               "credit_id": "52fe4978c3a36847f819bd4f",
               "name": "Belinda McClory",
               "profile_path": "/kH5KJ0QuSN2MgYqRP4JSdnCcE9K.jpg",
               "id": 9376,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bcf9",
               "name": "Craig Rosenberg",
               "profile_path": null,
               "id": 58922,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bcff",
               "name": "Craig Rosenberg",
               "profile_path": null,
               "id": 58922,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd05",
               "name": "Graham Burke",
               "profile_path": "/zdw6PxHq7CrvV4MnPnbf8Qfeio6.jpg",
               "id": 59774,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd0b",
               "name": "Greg Coote",
               "profile_path": null,
               "id": 71192,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd11",
               "name": "Peter Heller",
               "profile_path": null,
               "id": 53966,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd17",
               "name": "Michael Lake",
               "profile_path": null,
               "id": 84758,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819bd23",
               "name": "Alex Waislitz",
               "profile_path": null,
               "id": 228633,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819bd29",
               "name": "Heloise Waislitz",
               "profile_path": null,
               "id": 228634,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd2f",
               "name": "Bill Murphy",
               "profile_path": null,
               "id": 63962,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819bd55",
               "name": "Stephen F. Windon",
               "profile_path": null,
               "id": 58192,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58b73671c3a368594e00114c",
               "name": "David Parker",
               "profile_path": null,
               "id": 1414130,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.416094,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 58911,
      "vote_count": 3,
      "budget": 0,
      "overview": "10 years ago at a party, Steven thinks he sees the girl of his dreams, Melissa. Just as he's about to make his move, his twin brother Rick gets to her first and they fall in love. Steven watches his brother's relationship bloom, longing for Melissa all the while. Eventually, Melissa leaves to go to college and the brothers go on with their lives. Steven becomes a workaholic to block out his feelings about Melissa and Rick becomes a spineless bellboy at the Hotel de Love, after a later girl friend stood him up at the altar. Enter Steven and Rick's warring parents visiting the Hotel de Love for their anniversary. Re-enter Melissa with her current boyfriend, Norman. Suddenly Rick and Steven have a second chance at Melissa. Also there's Alison the palm reader, Susie behind the counter, the owner/piano player, and the freshly married couple.",
      "similar": [
         3134,
         948,
         8810,
         281,
         298312,
         4638,
         10212,
         11564,
         43923,
         133805,
         2142,
         1359,
         141,
         185,
         10285,
         431,
         101,
         205,
         681,
         949
      ],
      "original_title": "Hotel de Love",
      "runtime": 95,
      "poster_path": "/8DpN8xCQobzNO7DjROEVkVC55BR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Village Roadshow",
            "id": 6824,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pratt FIlms",
            "id": 6825,
            "origin_country": ""
         }
      ],
      "release_date": "1996-12-19",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "A comedy about the romantically challenged and passionately confused.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Craig Rosenberg"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Craig Rosenberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116565/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2OTA0MzE0NF5BMl5BanBnXkFtZTcwMjA2NjEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Aden Young, Saffron Burrows, Simon Bossell | See full cast and crew »"],
      "reviews": [
         "Hotel de Love is an obscure comedy from Australian writer-director Craig Rosenberg that is worth the wait after an initial slow start. What begins like just another teen angst whine fest suddenly becomes positively Shakespearian fun in the tradition of Midsummer Night's Dream, with twin brothers trapped by a lost early love for all the wrong reasons. When the gal of their dreams shows up ten years later with her fiancée at a bizarre honeymoon hotel, the twins start a mad campaign for her affections and haul the audience along with them. The twin's dysfunctional parents are added to the mixups as guests of the hotel along with one brother's hotel palm reader girlfriend. The actors probably save what could have been just a remake of half a dozen late fifties or early sixties Hollywood comedies, but the film is written fast and is self-satirical and punctuated with whacky sets and excellent music choices. Australian actor Simon Bossell stars as the obsessed brother who never gets the girl. American sci-fi audiences might recognize him from a guest shot on Farscape in the 2nd season's \"A Clockwork Nebari\" episode. His frantic physical comedy steals most of the movie. Saffron Burrows is the object of obsession. Burrows is a promising British actress who played Dr. Susan McCallister opposite the likes of Thomas Jane, LL Cool J, Michael Rapaport and Samuel L. Jackson in Renny Harlin's flawed underwater thriller Deep Blue Sea (1999) and also co-starred with Freddie Prinze Jr. in the much more unexciting Wing Commander the same year. She's very good here, however, reminiscent of Paula Prentiss and Geena Davis. Obviously an actress in need of a good script. Aden Young also does OK as the brother who wins Saffron in the end. He's a Canadian actor who looks like Farscape's Ben Browder, but he's not quite as funny. The Farscape connections are interesting though, because one reason this film may eventually acquire cult status in the future is a brief bit part topless scene with Australian actress Raelee Hill, who was Farscape's Sikozu (2002-2003). Male Scapers won't be disappointed, believe me.",
         "Most Australian comedies that I have seen have disappointed me because their seemingly mandatory quirkiness is instantly supposed to be funny. For me at least, weird behaviour does not necessarily equal big laughs. \"Hotel de Love\" seemed to be a little less quirky, and perhaps that is why I liked it. That is not to say that this is without flaws, for it has one big one. But even though this film spends too much time showing the LEAST interesting couple, the other relationships are sufficiently interesting to overcome this mistake. I can't call this anything great, but it is certainly a pleasant way to kill some time.",
         "Farce, either on stage or in film, requires truly great timing. In the case of film, that places an even greater burden on the editor, the one who chooses where and how to do the cuts at just the right millisecond. In \"Hotel De Love\" we have a very broad sort of farce that unfortunately lingers always a bit too long on its sight gags and double-takes. That is doubly annoying because one senses that both the conception and the script itself have potential. In the hands of, say, someone like Billy Wilder, this film might have gone somewhere. Of course that assumes the acting might have been less amateurish as well, but who knows? As it is, one really well executed scene is followed by a lesser one, followed by a non-sequitur, followed by something sentimental and not very funny. The British have taken over romantic comedy from Hollywood -- the kind appealing mainly to women -- as in anything featuring Hugh Grant or Rupert Everett. Australia seems to do better with serious drama or tongue-in-cheek stuff like \"Priscilla\" or \"The Sum of Us.\" Maybe it's time for Nicole Kidman to try an old Rosalind Russell script opposite, say, Russell Crowe, set in Sydney. (Melbourne seems a bit irrelevant, like Winnipeg or Bristol.) Not that there's anything wrong with sentimentality. It's just that really good farce needs a subtle edge, and this one doesn't have it.",
         "Most romantic comedies these days seem content to get by on charm, but this is genuinely funny and romantic, despite the somewhat gaudy setting of a honeymoon hotel. Although there are quite a few flourishes (like the piano player playing kitsch 70's hits and being the one everyone talks to), it's grounded in real passions and feelings, which also helps the comedy. I especially like the scene between Melissa and Rick where they tell the truth to each other. I didn't know any of the actors in this movie except Saffron Burrows (who I hope goes on to bigger things), but they were all excellent as well.",
         "I have watched many films from Down Under and tremendously enjoyed most of them. Australian films have a distinct \"flavour\"; probably part of it comes from the accent!!! However, the title of this one did not even attract me at first but I thought I'd give it a try after reading a short review of the film in some magazine. And I'm glad I did. In spite of all the \"kitsch\", it was certainly a good watch........it actually left a pleasant aftertaste! In fact, it would not have been as good without the \"kitsch\". Well played out by the actors/actresses.....a memorable one being the piano player/hotel owner with his songs.",
         "Twin brothers fall in love with the same woman (Burrows) as teens. Fast forward ten years and they own a honeymoon retreat, encounter their old flame who has come for her wedding, and attempt to pick up where they left off in spite of the presence of the groom. What follows in the denouement is a bit clumsy and awkward at times with low end production value and relatively unknown actors. However, factor in some side characters and an ample helping of vintage pop love songs and you have a mildly amusing little flick with some heart which should make an okay small screen watch for those in the mood for romcom fare. Keep expectations real and enjoy. (C+)",
         "I've watched this move multiple times, and always come away happy. The fraternal twin brothers (Aden Young and Simon Bossell) are both so different, and yet both yearn for love, they think for the same woman. The brothers' parents are absurd, and show the difficulties when you fail to express what you want and need. Aden Young is beautifully handsome, and Saffron Burrows is stunning; the ache Aden's character feels for her is easy to understand. Simon Bossell's character feels things intensely, but has to learn to look (and wait) for love in the right places. The ending is quite beautiful, even though much of the movie is absurd! I say this is a screwball comedy because the love the brothers' feel makes them act in crazy ways reminding me of Katherine Hepburn's character in Bringing Up Baby. In Bossell's character's case, the love arises absurdly, yet he finds a way to make it all work out. The idea of the movie is that often love is right in front of us, but we can't see it. If you like screwball romantic comedies, and enjoy silliness as well as absurdity in relationships, I think you can't go wrong watching this delightful movie.",
         "Warning: If you haven't seen this movie, there might be a spoiler in here. Here's the spoiler: In the end everybody is happy! Hope I didn't give anything away there. This is a movie that I would put in a very special category. It may not be the most well made, or well acted movie. It certainly doesn't have the best script. It isn't the funniest movie I've seen, and it isn't the most romantic. But that doesn't matter. I still loved this movie. Some movies weren't meant to be analyzed, they were just meant to be enjoyed. Now on to the plot. The story revolves around twin brothers Stephen and Rick Dunne. Both brothers fall for the same girl when they are teenagers. She moves away and ten years pass. In those ten years, Stephen obsesses over her, and Rick gets stood up at the altar. They all meet again at a tacky hotel where Rick is the manager, and the chase is on. Aside from being a very attractive woman, Melissa never gave me any reason why a person should be in love with her for 10 years. She was just sort of there. Allison, on the other hand, is a person I could see a guy fussing about for way more then 10 years. I loved how Ronny had the perfect song for every occasion in the film. And I still get chills every time I watch that last frame of the movie when the two lovers just say \"Hi\" to each other. I give this movie a 9/10 just for the sheer reason that I have seen it well over 25 times and I still love watching it every time.",
         "First of all, it was made by Australians, so they all have neat accents! The setting is eccentric yet fun. This film was particularly enjoyable because of the interplay between the two brothers, Rick and Stephen. Although they begin as total opposites, the beauty of the drama truly arises and they become more like each other.",
         "The actors who played the brothers in this film really make it. The old guy who played the piano in the hotel was brilliant. His facial expressions are priceless! The ending is just what the doctor ordered!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Pratt Films",
         "Village Roadshow Pictures"
      ],
      "summaries": [
         "10 years ago at a party, Steven thinks he sees the girl of his dreams, Melissa. Just as he's about to make his move, his twin brother Rick gets to her first and they fall in love. Steven watches his brother's relationship bloom, longing for Melissa all the while. Eventually, Melissa leaves to go to college and the brothers go on with their lives. Steven becomes a workaholic to block out his feelings about Melissa and Rick becomes a spineless bellboy at the Hotel de Love, after a later girl friend stood him up at the altar. Enter Steven and Rick's warring parents visiting the Hotel de Love for their anniversary. Re-enter Melissa with her current boyfriend, Norman. Suddenly Rick and Steven have a second chance at Melissa. Also there's Alison the palm reader, Susie behind the counter, the owner/piano player, and the freshly married couple.",
         "Twin brothers meet a childhood sweetheart at a tacky hotel and rediscover their love as they renew their competition for her affection."
      ],
      "budget": 0
   },
   "movielensId": 1455,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-19",
      "dvdReleaseDate": null,
      "directors": ["Craig Rosenberg"],
      "runtime": 95,
      "movieId": 1455,
      "title": "Hotel de Love",
      "mpaa": "R",
      "actors": [
         "Aden Young",
         "Saffron Burrows",
         "Simon Bossell",
         "Pippa Grandison",
         "Ray Barrett",
         "Julia Blake",
         "Peter O'Brien",
         "Belinda McClory"
      ],
      "imdbMovieId": "0116565",
      "originalTitle": "Hotel de Love",
      "genres": [
         "Comedy",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "10 years ago at a party, Steven thinks he sees the girl of his dreams, Melissa. Just as he's about to make his move, his twin brother Rick gets to her first and they fall in love. Steven watches his brother's relationship bloom, longing for Melissa all the while. Eventually, Melissa leaves to go to college and the brothers go on with their lives. Steven becomes a workaholic to block out his feelings about Melissa and Rick becomes a spineless bellboy at the Hotel de Love, after a later girl friend stood him up at the altar. Enter Steven and Rick's warring parents visiting the Hotel de Love for their anniversary. Re-enter Melissa with her current boyfriend, Norman. Suddenly Rick and Steven have a second chance at Melissa. Also there's Alison the palm reader, Susie behind the counter, the owner/piano player, and the freshly married couple.",
      "tmdbMovieId": 58911,
      "avgRating": 3.07735,
      "releaseYear": "1996",
      "numRatings": 181,
      "posterPath": "/8DpN8xCQobzNO7DjROEVkVC55BR.jpg"
   }
}