{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "neo-nazi",
            "id": 376
         },
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "hunting human beings",
            "id": 4323
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "scam",
            "id": 11454
         },
         {
            "name": "hispanic",
            "id": 41334
         }
      ],
      "imdb_id": "tt0119887",
      "video": false,
      "title": "The Pest",
      "recommendations": [
         55731,
         16299,
         36278,
         33657,
         18862,
         9308,
         25674,
         18550,
         47881,
         20551,
         9458,
         34309,
         41579,
         83489,
         13203,
         17770,
         45712,
         22590,
         35645,
         118430
      ],
      "backdrop_path": "/4iWJu8ldm5rDc8bZcB6ctJtEgCw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Pestario 'Pest' Vargas",
               "gender": 2,
               "credit_id": "52fe47559251416c75095945",
               "name": "John Leguizamo",
               "profile_path": "/rbq24AzthnwRXUYcVfUnP5bKN50.jpg",
               "id": 5723,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gustav",
               "gender": 2,
               "credit_id": "52fe47559251416c75095949",
               "name": "Jeffrey Jones",
               "profile_path": "/96J47E34mbjqnhiW9dbLuBqyqmD.jpg",
               "id": 4004,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himmel",
               "gender": 2,
               "credit_id": "52fe47559251416c7509594d",
               "name": "Edoardo Ballerini",
               "profile_path": "/2Xkuux55UDZ3LSlOx9tIkQLrDdQ.jpg",
               "id": 21359,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Glen Livitt",
               "gender": 2,
               "credit_id": "52fe47559251416c75095963",
               "name": "Pat Skipper",
               "profile_path": "/yz3OrX0JKWcNDLLc8TBoRUhWAcC.jpg",
               "id": 6326,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Bagpipe Player",
               "gender": 2,
               "credit_id": "5a2e462d0e0a264cca15aa54",
               "name": "Les Lannom",
               "profile_path": null,
               "id": 119856,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47559251416c75095953",
               "name": "R. Paul Miller",
               "profile_path": null,
               "id": 60865,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47559251416c75095959",
               "name": "David Bar Katz",
               "profile_path": null,
               "id": 85810,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47559251416c7509595f",
               "name": "John Leguizamo",
               "profile_path": "/rbq24AzthnwRXUYcVfUnP5bKN50.jpg",
               "id": 5723,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.775343,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17949,
      "vote_count": 43,
      "budget": 17000000,
      "overview": "Fast-talking Latino con artist Pestario \"Pest\" Vargas is the target of Scottish mobsters to whom he owes a considerable debt. Willing to do anything to raise money and avoid severe injury or death, Vargas agrees to a very unusual job -- he will be transported to a remote island and hunted by Gustav Shank, a racist German executive. If he can survive a full day and night, Vargas gets $50,000 and will be set free. Is he wily enough to elude Shank?",
      "similar": [
         2142,
         298312,
         11564,
         681,
         955,
         23483,
         8810,
         59967,
         562,
         445954,
         9053,
         10285,
         431,
         205,
         948,
         769,
         4771,
         261023,
         238636,
         281
      ],
      "original_title": "The Pest",
      "runtime": 82,
      "poster_path": "/zKklykkg4tQry6xJrOaggxMHnN0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Bubble Factory",
            "id": 27128,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         }
      ],
      "release_date": "1997-02-07",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "What kind of freakazoid would let someone hunt him just for $50.000… Next question.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Paul Miller"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "David Bar Katz",
         "John Leguizamo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119887/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMjE4NTcxMV5BMl5BanBnXkFtZTYwMzQ5ODg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Leguizamo, Jeffrey Jones, Freddy Rodríguez | See full cast and crew »"],
      "reviews": [
         "This is a comedy spoof of Van Damme's 'Hard Target' and Ice-T's 'Surviving The Game'. It takes an ethnic con-artist and gives him a chance to win $50,000 if he makes it to the end of the race. The twist the plot follows is someone is hunting him for sport. Once this is realized by our main character, he's got to find a way to stop this and save his own life at the same time. Using John Leguizamo as the main character offers a bit of crude slapstick comedy that does present very funny episodes during the movie. For some the plot slows down and the rugged humor is a little too childish. What would you expect from a spoof? We're not trying to recreate a cinematic masterpiece in all seriousness, but the point is well argued that there could have been more development in the script and screenplay. The cast was well chosen for the picture and this is definitely something for the college cult classic movie watchers to incorporate in to their stash as the years go by for good laughs and an occasional throw pillow moment. The picture is truly not for those who don't enjoy simple humor antics that parody childish home behavior. This movie is definitely worth renting once or twice for viewing with a good crowd of friends.",
         "\"The Pest\" Pestario Vargas (John Leguizamo) is a low rent con man from Miami's South Beach who has fallen deeply in debt to ill tempered members of the Scottish mafia. Pest is desperate to raise $50,000 to stave off having his legs broken, Vargas takes an offer for a very high paying one day job from Gustav Shank (Jeffrey Jones), a German businessman visiting Florida. However, it's not until later that Vargas finds out what Shank has in mind. The lunatic white supremacist Shank transports Vargas to his island compound, \"Little Germany,\" and announces that he will hunt him as wild game. If Vargas can survive for 24 hours, he gets the cash; otherwise, his head will join the others stuffed and mounted on Shank's wall. I know this movie got bad rating, but you must understand its supposed to be funny and it is just stupid harmless fun. John Leguizamo is very funny as \"The Pest\" and what a great choice as the bad guy \"Ed Rooney\" Jeffrey Jones. If you are looking for some stupid laughs this movie is for you.",
         "I found this movie Very enjoyable. I was laughing out loud and I really enjoyed the humor of it. If you are familiar with John Leguizamo's comedy and you are a fan of it this movie is a must see. It is a take on the novel \"The Most Dangerous Game\" and it focuses on the event's Pestario (Leguizamo) must overcome such as the fact the Scottish mob is after him, a crazy German nazi, Gustav, (Jeffrey Jones) is hunting him, and Gustav's homosexual son ,Himmel (Edoardo Ballerini), who is obsessed with \"snakes\", is obsessed with him too! This comedy moves fast yet is highly enjoyable!",
         "Obviously this didn't win any awards for excellency, but it wasn't that horrible of a movie either. It showed bits and pieces of comedic genius mixed in with lowbrow and downright idiotic slapstick. Could this be a deeper and uncomfortable view into the twisted mind of Leguizamo (who must have been on a diet of sugar and caffeine throughout the filming of The Pest)? For what it's worth, about 20 minutes into the movie I wanted to kill his character, Pest. Hopefully that's what the writer intended... It was worth the $1.50 I paid for it, but it wouldn't last 1 second against true comedic genius like Pee Wee's Big Adventure.",
         "The pest is a unique movie in that it is ridiculous as possible, yet in all honesty I was entertained by it. This movie is a really bad version of the story \"A Most Dangerous Game\". As bad as this movie is it is entertaining to some extent. There is a great scene when the pest is being hunted by the Scottish mob regarding the birthday of a famous Scotsman which is just so absurd that I could not help laughing. This is not a great movie... in fact it IS a bad movie, one that you're likely to see in the $5.00 bin at walmart. But for a cheap laugh (and with disturbing foresight into the future of slang) it's worth seeing at least once.",
         "What can I say about this film. Well I'd no intention of watching it when I did, before then I'd never heard of it, but sure enough on a bus trip in Eastern Europe I was going to take in the whole film. Well there we were, myself, my wife and two other travel buds on a bus from Plovdiv to Veliko Tarnovo in Bulgaria. It was a route I knew well, crappy road windy hills. Not a nice journey to experience whilst still in the depths of a Mastika hangover. Still these things have to be done. Any how this film just came up on our journey, and with a hangover it really was the funniest film I'd ever seen, although trying to watch it whilst trying not to be sick was something of a challenge. It had not helped that after a short pit stop on the way we got back on the bus last and had ended up on the worst seats, the one's at the back. So I might well just have been on a ferry crossing in rough seas. Going green doesn't't even describe it. Any back to the film, well this stupid idiotic film came on, and bizarrely enough it was excellent. Totally carried by the sharp intensity of lead actor, yes that guy that also did the voice over for the Ice Age Sloth. I felt like I was watching Jim Carrey before Jim Carriey's time. Only this guy John Leguizamo seemed to have even more energy. Needless to say I was constantly in stitches followed by the need for deep breaths and focus to overcome the nasty green spells. After a night on the sauce or during, I'd highly recommend this film. Certainly a departure from the main.",
         "\"The Pest\" has moments of mind-numbing stupidity (and at least five fart jokes too many). It's also offensive in its homophobic attitude, and its anti-German sentiments are so strong that you would think the script was written in 1940. But it still is a very easy film to watch, because it looks slick, it moves fast, and it has one hell of a driving music beat to it. It also has some hints of surrealism (the \"dueling car stereos\" scene), and does make you laugh a couple of times: not so much with Leguizamo's \"impressions\" (which are mostly awful), but at other, rather unexpected moments (the \"Stop repeating what I'm saying! I mean it!\" scene). I'd say it generally makes you laugh more often than many other comedies that have a higher reputation. (**1/2)",
         "PEST suffers from a lack of follow-through. With the right editing and focus, this could have been comparable to one of the early Peter Sellers' Inspector Clouseau movies. Here's an example of a cinematic half-measure: John Leguizamo (playing the title character) slips all the way down a staircase and tries to be nonchalant about it. The scene is shot in such a way that you only see the upper part of his body. You don't see his feet slipping. You don't see his feet even begin to slip. It's clear the shot was set up either to avoid danger to the actor or to avoid the tedium of filming the slide down the stairs. If a slapstick movie is what this team wanted to make, they could have hired a stuntman or done some trick photography. Instead, the effect is that the viewer notices that nobody actually slid down a staircase. Because the song the Pest sings in the opening credits is filled with lines from old comedies and Warner Brothers cartoons, the viewer expects the Pest to be a combination of Bugs Bunny, Daffy Duck and any number of other forcefully comic characters. On a stage, Leguizamo controls his game. But the director of THE PEST has no comic timing and scenes which should have had a real edge are dulled. The one standout performance is by Eduordo Ballerini in a thankless role. That his character seems to have a sense of conflict is entirely Ballerini's own doing; the script and the direction don't allow the extra dimension, but he found it. His performance is the reason to watch this movie. John Leguizamo is an actor who embraces the world, but he's playing to an audience he perceives as closed-minded. This must enrage him.",
         "This is the funniest movie I've ever seen... I've seen it about 15 times and I laugh my butt every time I watch it. John Leguizamo is the greatest. This is, by far, his best movie. I love all the little things that happen throughout the movie, they're hilarious.",
         "This is one of those movies that you will find more humorous nuances in every time you see it. You may hate it the first time you see it, but it will grow on you every time you see it after that (as was the case with many for another cult movie, The Rocky Horror Picture Show). True comedy is getting harder to find in movies (and has been since the 80's) but The Pest proves that there is indeed someone out there who still knows how to write a hilarious movie without retrograding to the overwhelming sexual and violent mannerisms of most movies which are degrading society today. Kudos to John Leguizamo for a wonderful portrayal of a hyperactive, streetwise young man who uses his wits to get by in modern Miami. His physical and verbal antics kept me rolling around throughout the movie! And Jeffrey Jones -- what else can I say? There is no better choice for the archetypical \"gotta-hate-him\" character who thinks he's doing the right thing but is proven wrong (as he was also in Ferris Bueller, Howard the Duck, Beetlejuice, etc.). He is simply THE MAN!!! If there is one person who deserves the popularity and money unneedingly shed on professional athletes and political figures, Jeffrey Jones is that man... Too bad this movie had such a short theater run...I never got to see it in one because I didn't hear about it until nearly a year later. So go rent or (even better) buy the movie; I promise that, unless you have gastrointestinal problems plaguing you, you will enjoy this movie! And in the words of Pestario, my rating is -- \"nine stinky dinky!\" out of ten."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Bubble Factory, The",
         "TriStar Pictures"
      ],
      "summaries": [
         "Miami scam artist Pest Vargas is on the run from the Scottish mob and a German headhunter, the mob after 50,000 dollars, the German guy after his head. Pest dons many disguises in an attempt to evade their clutches.",
         "A Miami con man agrees to be the human target for a Neo-Nazi manhunter, in order to collect $50,000 if he survives."
      ],
      "budget": 17000000
   },
   "movielensId": 1456,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-02-07",
      "dvdReleaseDate": "2000-06-13",
      "directors": ["R. Paul Miller"],
      "runtime": 82,
      "movieId": 1456,
      "title": "The Pest",
      "mpaa": "PG-13",
      "actors": [
         "John Leguizamo",
         "Jeffrey Jones",
         "Edoardo Ballerini",
         "Pat Skipper",
         "Les Lannom"
      ],
      "imdbMovieId": "0119887",
      "originalTitle": "The Pest",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["_2ZlZxtNll8"],
      "plotSummary": "Fast-talking Latino con artist Pestario \"Pest\" Vargas is the target of Scottish mobsters to whom he owes a considerable debt. Willing to do anything to raise money and avoid severe injury or death, Vargas agrees to a very unusual job -- he will be transported to a remote island and hunted by Gustav Shank, a racist German executive. If he can survive a full day and night, Vargas gets $50,000 and will be set free. Is he wily enough to elude Shank?",
      "tmdbMovieId": 17949,
      "avgRating": 2.24788,
      "releaseYear": "1997",
      "numRatings": 589,
      "posterPath": "/zKklykkg4tQry6xJrOaggxMHnN0.jpg"
   }
}