{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "culture clash",
            "id": 1463
         },
         {
            "name": "romantic comedy",
            "id": 9799
         },
         {
            "name": "pregnancy",
            "id": 13149
         }
      ],
      "imdb_id": "tt0119141",
      "video": false,
      "title": "Fools Rush In",
      "recommendations": [
         12771,
         10780,
         11622,
         12658,
         11648,
         2621,
         10407,
         10563,
         2122,
         11467,
         2612,
         6472,
         26255,
         10660,
         2020,
         11472,
         11777,
         10878,
         9304,
         11846
      ],
      "backdrop_path": "/moXYmj79ClxEz5rxs2jmpO1CLEQ.jpg",
      "revenue": 29481428,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alex Whitman",
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e629",
               "name": "Matthew Perry",
               "profile_path": "/oSKEEDXDNnwWdQ68qfDVD6Q7Pxp.jpg",
               "id": 14408,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Isabel Fuentes",
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e62d",
               "name": "Salma Hayek",
               "profile_path": "/u5mg73xKVqm8oT93HoMmsgQHyoK.jpg",
               "id": 3136,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e631",
               "name": "Jon Tenney",
               "profile_path": "/fiG1bW6DX1szsRDPIYjfIKPQ0kV.jpg",
               "id": 4602,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lanie",
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e635",
               "name": "Siobhan Fallon",
               "profile_path": "/wVFa8GiY0xdOLFsvGygy9RMtcBc.jpg",
               "id": 6751,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Great Grandma",
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e675",
               "name": "Angelina Torres",
               "profile_path": null,
               "id": 20360,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Richard Whitman",
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e679",
               "name": "John Bennett Perry",
               "profile_path": "/bzFhwuXsdZiOHRtBgz4XVELIFYO.jpg",
               "id": 20361,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Nan Whitman",
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e67d",
               "name": "Jill Clayburgh",
               "profile_path": "/twrfhIvbqHuJ7nXVpehvU6nyi6R.jpg",
               "id": 20362,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Cathy Stewart",
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e681",
               "name": "Suzanne Snyder",
               "profile_path": "/90FrTcjJudpeIYUjUzlO6XAmvnt.jpg",
               "id": 20363,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Amalia",
               "gender": 0,
               "credit_id": "52fe4327c3a36847f803e685",
               "name": "Anne Betancourt",
               "profile_path": "/6UU5P4DzjJTSBFztIu1nALT2tk0.jpg",
               "id": 13029,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Juan Fuentes",
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e689",
               "name": "Mark Adair-Rios",
               "profile_path": "/rX4d1e5jlF5P73qynjjUzJslB0c.jpg",
               "id": 4511,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Judd Marshall",
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e68d",
               "name": "Stanley DeSantis",
               "profile_path": "/4cHxkhTd7oklyNkdva9WJp0FLrX.jpg",
               "id": 4171,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Antonio Fuentes",
               "gender": 0,
               "credit_id": "52fe4327c3a36847f803e691",
               "name": "Josh Cruze",
               "profile_path": "/v3QrQzH0uGV9pd1dNR5Ue6a74qO.jpg",
               "id": 4665,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Petra",
               "gender": 0,
               "credit_id": "52fe4327c3a36847f803e695",
               "name": "Angela Lanza",
               "profile_path": "/zmf6TMWMVCdnuUfpgdnioaICk1L.jpg",
               "id": 4666,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Phil",
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e699",
               "name": "Chris Bauer",
               "profile_path": "/3KYVMaGkWTEDQ0T9lsu85pVbP4T.jpg",
               "id": 4445,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Chuy",
               "gender": 0,
               "credit_id": "577e438f925141440c000d63",
               "name": "Carlos Gómez",
               "profile_path": "/nBxwoMv1zrhNXyEjYXbcdmAdmF0.jpg",
               "id": 115874,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e625",
               "name": "Andy Tennant",
               "profile_path": "/9gK8xFzybwDnWENijTdDHiP4M6o.jpg",
               "id": 17167,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e63b",
               "name": "Katherine Reback",
               "profile_path": null,
               "id": 20356,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4327c3a36847f803e641",
               "name": "Doug Draizin",
               "profile_path": null,
               "id": 20357,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e647",
               "name": "Michael McDonnell",
               "profile_path": null,
               "id": 9034,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e64d",
               "name": "Robbie Greenberg",
               "profile_path": null,
               "id": 18257,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e653",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e659",
               "name": "Roger Bondelli",
               "profile_path": null,
               "id": 17164,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e65f",
               "name": "Juel Bestrop",
               "profile_path": null,
               "id": 14377,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4327c3a36847f803e665",
               "name": "Edward Pisoni",
               "profile_path": null,
               "id": 20358,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4327c3a36847f803e66b",
               "name": "Leslie Morales",
               "profile_path": null,
               "id": 9321,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe4327c3a36847f803e671",
               "name": "Kimberly A. Tillman",
               "profile_path": null,
               "id": 20359,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "57bb915792514176e000062f",
               "name": "David Crank",
               "profile_path": null,
               "id": 958921,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.308732,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1968,
      "vote_count": 172,
      "budget": 0,
      "overview": "Alex Whitman (Matthew Perry) is a designer from New York City who is sent to Las Vegas to supervise the construction of a nightclub that his firm has been hired to build. Alex is a straight-laced WASP-ish type who, while enjoying a night on the town, meets Isabel Fuentes (Salma Hayek), a free-spirited Mexican-American photographer. Alex and Isabel are overtaken by lust at first sight and end up sp",
      "similar": [
         34806,
         10160,
         95610,
         20943,
         37135,
         9029,
         1581,
         1824,
         810,
         2898,
         2642,
         8488,
         544,
         4141,
         88,
         284,
         9522,
         2758,
         193893,
         153
      ],
      "original_title": "Fools Rush In",
      "runtime": 109,
      "poster_path": "/e1rzqz7ehOk6uzu7Wkgu4q3L8CK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1997-02-14",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "What if finding the love of your life meant changing the life that you loved?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andy Tennant"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Joan Taylor",
         "Katherine Reback"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119141/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0NDQyODM3MF5BMl5BanBnXkFtZTcwMjc1NTkxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Perry, Salma Hayek, Jon Tenney | See full cast and crew »"],
      "reviews": [
         "This is one of those movies that I can't help but love. It certainly isn't the best movie ever, but Perry and Hayek both turn in wonderful performances. You can't help but like both of them. You care for the characters. And that is something that is becoming more and more rare in today's movies. The supporting cast does a great job as well, especially Perry's real father and Jill Clayburgh as his parents. It probably is the first time Hayek shows that she is a star and can carry a movie (or at least half of it) on her back. Perry brings a great sense of comedy to the movie. Some of his scenes and lines are laugh-out-loud funny. On top of that, the story is just quirky enough (based on a real-life romance) that the entire situation makes you chuckle.",
         "Alex Whitman (Matthew Perry) is a New Yorker sent to Las Vegas to oversee a construction project. There he meets Isabel Fuentes (Salma Hayek) and some serious chemistry brings them together for one night. But Alex doesn't see Isabel again until 3 months later, when he learns that she is pregnant. On a whim and a prayer, he proposes. However, there's more to marriage than a Vegas chapel and an Elvis impersonator, as Alex and Isabel soon learn\u0085 Overall, Fools Rush In follows the same formula of any romantic comedy - Two people fall in love and then a problem arises that breaks them apart for a period of time and then eventually one of them wakes up, the problem is resolved, they say I love you and live happily ever after. - I know, but I still absolutely love this film. There's just something so delightful and enchanting about it. Matthew Perry and Salma Hayek are both so loveable and the story is fresh and vibrant with a big heart. It's one of my all-time favourite movies.",
         "I'd seen this movie several times on some of the cable channels and liked it well enough that I went and bought the DVD. Since I received it, I found that the overall theme of the movie is learning to love someone else more than yourself. Yes, there are elements of two cultures colliding (and that's not just the Mexican American culture colliding with the WASPs but also a strong theme of east coast versus west coast) but that simply allows the showcasing of some of the best (and funniest) aspects of each. In the end, it is the strong performances by Salma Hayek and Matthew Perry that make the movie so special. The scene where Salma is going to go to the bathroom and Matthew leaves (and is brought back by Salma with her underwear down around her knees) is particularly delightful. I laughed so hard at the scene where Matthew is brought home full of cactus and says \"Lucy you've got some explaining to do\" that my wife came in to see if I had hurt myself. All in all a very pleasant experience.",
         "I don't know what anybody is talking about. This movie is great. I am a guy and I usually don't like \"chick-flicks\" but i thought this movie was great. Salma Hayek was unbelievable. She has me hooked on her. She is perfect in this movie. Matthew Perry was not exactly very strong on his part but he was still performed well. Hayek is by far one of the best actresses out there and I don't know why she wasn't \"discovered\" after her performance in this movie. I can watch this movie over and over again and I will never get sick of it. It makes you feel warm inside and makes you want what Isabel and Alex have. I became a huge Salma Hayek fan after watching this movie. It is highly recommended. Whoever said that this movie was not good, does not know what they are talking about. Sure it is predictable, but almost all movies are, that is no excuse to pass up on this movie. Watch it you won't regret it! Also, Salma is in After The Sunset, which is out now! Go watch it. Salma is great and beautiful as usual.",
         "I just saw Fools Rush In recently, and I loved it. If this review was based solely on my personal opinion, I would have rated it even higher, but I'm trying to be objective here. (Note the word 'trying' :D ) I can honestly say I enjoyed this movie whole-heartedly, even though it had its not-so-shining moments. I actually decided to watch it because Matthew Perry was in it, but the movie really proved to be great all on its own. The storyline is a pure romantic comedy setup, as other reviewers have noted. It's not exactly the most original plot line. However, certain plot points put a slightly new and different spin on things, and I think these (along with some clever dialogue and great acting and chemistry) save the movie from being totally unoriginal. There were a couple times where I was thrown for a loop, but towards the end, I had pretty much figured out how the movie would end. Well, not EXACTLY how the movie would end, but I had the basic idea. However, the plot progressed in such a way that, even though I knew what was coming, I was still on edge. All in all, a good movie to watch, buy, or rent. Personally, I'm just waiting for a chance to run out and buy the DVD, but that's me: the biggest sucker ever for romantic comedies. But I promise: if you watch this movie, you won't regret it.",
         "Matthew Perry does a great job playing a \"Chandler-like\" character in this film. Selma Hayek is believable in the movie. Perry's and Hayek's on-screen chemistry work well together in this romantic comedy that has a touch of drama in it. Matthew Perry is a young man that has been on the \"upperwardly mobile\" career path without strings or attachments. Perry discovers that what he thought was most important to him - isn't that important after all is said and done. The cultural differences of Perry and Hayek are illustrated very well in several different scenes. The scene where the couple's parents meet, sharply illustrated their differences and at the same time showed that they had things in common also. The film work and the colors are beautiful and rich. I have watched the movie twice, and it was as entertaining and touching the second time as it was the first.",
         "'Fools Rush In' is one of my favorite romantic comedies. Though, I know that many will dislike it but I'd take it anyday over any Julia Roberts rom-com. It's sweet without having too much sugar. It's one I have repeatedly watched and never got bored of. Director Andy Tenant deserves credit for putting it all together. It has the unusual pairing of Matthew Perry and Salma Hayek (which really works). Both share a great chemistry and look good together. While Perry's Alex is a little similar to Chandler Bing (except with a much bigger problem to deal with), the actor knows how to make the audience like him. Hayek as the vibrant, stubborn, mean but adorable Isabel is simply brilliant. The rest of the cast provide adequate support. The movie is full of light and delightful moments. Though there are certain aspects of culture clash, it is all presented in a humorous manner. Supporting the movie is a wonderful soundtrack, some fine location shots and the funny screenplay itself (which is predictable but doesn't spoil the fun on the way).",
         "Ooo, I absolutely love this movie! it was funny, cute, sexy, and it also made me cry. I love Matthew Perry, though, so that's probably 97% of why I like this movie. If you aren't a Matthew Perry fan, or an S. Hayek fan, then this probably isn't for you. But it was really good anyway. I loved the proposal part of the movie. This was a movie that I taped from TV, then watched, and I'm really glad I did. I don't know if this is a movie you would want to buy, but I highly recommend taping it if its on. I love Matthew Perry's acting, and I love this movie. This is a really good movie to see with your girlfriends, cause its a real chich flick-but laugh out loud funny.",
         "If you are a woman who loves fantasy and romance novels/films, this might be a good 90 mins getaway for you. The beginning seems unreal and foolish (something like Britney Spears marrying her childhood sweetheart in Vegas only to annul it the next day). Basically, its boy meets girl in restaurant, both had a one night stand, girl disappeared next morning, only to come back to boy 3 months later to tell him that she is pregnant with his child. Girl brings boy back to meet her family, boy decided to marry her in Vegas with Elvis Presley as witness. I don't know if anyone would really do something like that in the real world, without making sure that the girl is really pregnant with your kid and not someone else's, or worse - marrying a total stranger. Story goes on with boy not telling his wife that he is from New York and will be moving back there when his construction project ends, and also lied to her about his parents being in Europe and therefore couldn't tell his folks that they got married. So the wife got upset and mad, pretended to have a miscarriage and left him to go back to Mexico. But the ending was really sweet and you'll wish your husband can be as sweet as Matthew Perry (who discovered he had married his wife not because she was pregnant but because he loved her, and had to navigate his way to central Mexico/Vegas/Hoover Dam to win his wife back).",
         "I really enjoy this movie. I've seen it many times and it never fails to touch me. Great messages about life and love, reality and perception. Matthew Perry and Selma Hayek are both funny in this movie. She is amazingly sexy in it too. I give it 9 out of 10 stars. Make you review your life goals and what's important to you, as the characters do in this film. I can honestly say this film had an impact on me and always does. The story is very credible. Selma is so compelling it makes every guy want to go out and find a girl just like her immediately. Then take her home and marry her. Matthew does, then screws up and loses her, then figures it out and gets her back again -- for good."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Sparks fly and cultures collide in this romantic comedy about a casual night of passion that turns into the love of a lifetime. Alex Whitman is a New Yorker sent to Las Vegas to oversee a construction project. There he meets Isabel Fuentes, and some serious chemistry brings them together for one night. But Alex doesn't see Isabel again until three months later, when he learns she is pregnant. On a whim and prayer, he proposes. However, there's more to marriage than a Vegas chapel and an Elvis impersonator, as Alex and Isabel soon learn.",
         "After a chance meeting in Las Vegas and a night together at his place, a young American construction supervisor, Alex Whitman, leaves Mexican photographer Isabel Fuentes pregnant. She finds him a few months later just to let him know what happened. In the rush of the moment he follows her and they decide to get married. After that, a clash of customs and ideas develops in their families and in their relationship because of their different cultural and national backgrounds.",
         "After a one night stand with Isabel, Alex realizes that she is pregnant and they decide to get married. However, along with the marriage comes compromise of one's own cultural traditions."
      ],
      "budget": 0
   },
   "movielensId": 1457,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-02-14",
      "dvdReleaseDate": "1998-02-10",
      "directors": ["Andy Tennant"],
      "runtime": 109,
      "movieId": 1457,
      "title": "Fools Rush In",
      "mpaa": "PG-13",
      "actors": [
         "Matthew Perry",
         "Salma Hayek",
         "Jon Tenney",
         "Siobhan Fallon",
         "Angelina Torres",
         "John Bennett Perry",
         "Jill Clayburgh",
         "Suzanne Snyder",
         "Anne Betancourt",
         "Mark Adair-Rios",
         "Stanley DeSantis",
         "Josh Cruze",
         "Angela Lanza",
         "Chris Bauer",
         "Carlos Gómez"
      ],
      "imdbMovieId": "0119141",
      "originalTitle": "Fools Rush In",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["R2xe_xxuiUY"],
      "plotSummary": "Alex Whitman (Matthew Perry) is a designer from New York City who is sent to Las Vegas to supervise the construction of a nightclub that his firm has been hired to build. Alex is a straight-laced WASP-ish type who, while enjoying a night on the town, meets Isabel Fuentes (Salma Hayek), a free-spirited Mexican-American photographer. Alex and Isabel are overtaken by lust at first sight and end up sp",
      "tmdbMovieId": 1968,
      "avgRating": 3.10077,
      "releaseYear": "1997",
      "numRatings": 3126,
      "posterPath": "/e1rzqz7ehOk6uzu7Wkgu4q3L8CK.jpg"
   }
}