{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120357",
      "video": false,
      "title": "Touch",
      "recommendations": [
         27350,
         189299,
         13571,
         41235
      ],
      "backdrop_path": "/lgJgANOatuPtgHrpo3rB8rPKdgZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b86f",
               "name": "LL Cool J",
               "profile_path": "/dyDxzZo3buNTntxWehyW66aS5Mo.jpg",
               "id": 36424,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Debra Lusanne",
               "gender": 1,
               "credit_id": "52fe4658c3a368484e08b873",
               "name": "Gina Gershon",
               "profile_path": "/jaUQhGVmemkSyS5O0fcRkhGTOUq.jpg",
               "id": 11150,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Virginia Worrel",
               "gender": 1,
               "credit_id": "52fe4658c3a368484e08b877",
               "name": "Conchata Ferrell",
               "profile_path": "/p7KiBF2blE5KOXKrXMrVpMgCYZX.jpg",
               "id": 1909,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Elwin Worrel",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b87b",
               "name": "John Doe",
               "profile_path": "/EuDIT3BBTqkkLKD8wgp7MwuGCx.jpg",
               "id": 42746,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Bill Hill",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b87f",
               "name": "Christopher Walken",
               "profile_path": "/ApgDL7nudR9T2GpjCG4vESgymO2.jpg",
               "id": 4690,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Juvenal / Charlie Lawson",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b883",
               "name": "Skeet Ulrich",
               "profile_path": "/id0y6bKmNSpr2pYU2Qkiv11EyvR.jpg",
               "id": 22108,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Alisha",
               "gender": 1,
               "credit_id": "59bd7e6c9251413561018172",
               "name": "María Celedonio",
               "profile_path": "/wU8pPR8giJJpoTen5gHyN3vjT4X.jpg",
               "id": 141384,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Scruffy Staff Worker",
               "gender": 0,
               "credit_id": "52fe4658c3a368484e08b88b",
               "name": "Chris Hogan",
               "profile_path": "/zp5unnFH8NI7GBH4Iyiv1toq3NL.jpg",
               "id": 90659,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Father Donahue",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b88f",
               "name": "Anthony Zerbe",
               "profile_path": "/ekhT4eIQP3XloHFTRr0THiVP9ve.jpg",
               "id": 2516,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Lynn Marie Faulkner",
               "gender": 1,
               "credit_id": "52fe4658c3a368484e08b893",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Court Clerk",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b897",
               "name": "William Newman",
               "profile_path": "/tSFsRnK1jfCc50yinO5MpFnJL3c.jpg",
               "id": 77027,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "August Murray",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b89b",
               "name": "Tom Arnold",
               "profile_path": "/udJkmZPrQs4D8NPV8u4BEv3rNLX.jpg",
               "id": 74036,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Greg Czarnicki",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b89f",
               "name": "Breckin Meyer",
               "profile_path": "/7V3hXjmSJXApsuu2aGkEgFFAy03.jpg",
               "id": 33654,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Bailiff",
               "gender": 0,
               "credit_id": "52fe4658c3a368484e08b8a3",
               "name": "Matt O'Toole",
               "profile_path": "/kNWX5D3SU9Z666M8OcOy5QUF3my.jpg",
               "id": 79651,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Judge",
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b8a7",
               "name": "Richard Fancy",
               "profile_path": "/gqMB9kzTff3X42jhG8doZIftzTe.jpg",
               "id": 65748,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Kathy Worthington",
               "gender": 1,
               "credit_id": "56a946cb9251417dcb001f69",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b85f",
               "name": "Paul Schrader",
               "profile_path": "/hLdjFQOtgnvgKVL73dH6CWluicy.jpg",
               "id": 1035,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b865",
               "name": "Elmore Leonard",
               "profile_path": "/vL1oMCp0EE8kgSNJEPDPrMs7qVs.jpg",
               "id": 2235,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4658c3a368484e08b86b",
               "name": "Paul Schrader",
               "profile_path": "/hLdjFQOtgnvgKVL73dH6CWluicy.jpg",
               "id": 1035,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5ac401819251412720040a0c",
               "name": "Edward Lachman",
               "profile_path": "/yXhB83p1aRpJzd3qKke6uBYescB.jpg",
               "id": 6345,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5ac4018ac3a3682d66047912",
               "name": "Cara Silverman",
               "profile_path": null,
               "id": 56716,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac4019cc3a3682d6604792b",
               "name": "Dave Grohl",
               "profile_path": "/ywJweFzFBeZXXJNmDnWT0xLrH37.jpg",
               "id": 533061,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5ac401c40e0a260c4d04298d",
               "name": "Lila Cazès",
               "profile_path": null,
               "id": 6113,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5ac401cf92514126c103c661",
               "name": "Fida Attieh",
               "profile_path": null,
               "id": 947937,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.288524,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61563,
      "vote_count": 10,
      "budget": 0,
      "overview": "When Juvenal, a presumed miracle worker, appears on the scene Bill Hill attempts to exploit him but his plans go astray with the untimely intervention of August Murray and the developing relationship between Juvenal and Lynn Faulkner.",
      "similar": [],
      "original_title": "Touch",
      "runtime": 96,
      "poster_path": "/zNQMixGaxdHB5BlYIixb6xqbShf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Artists",
         "id": 60,
         "origin_country": ""
      }],
      "release_date": "1997-02-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "A Wicked Comedy",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Schrader"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Elmore Leonard",
         "Paul Schrader"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120357/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMzE0OTU3Nl5BMl5BanBnXkFtZTcwNTI1OTEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bridget Fonda, Christopher Walken, Skeet Ulrich | See full cast and crew »"],
      "reviews": [
         "While TOUCH may not be up to the level of GET SHORTY, OUT OF SIGHT, or JACKIE BROWN, it's not a bad little movie. Certainly it's an odd book from Leonard, as he admitted in his introduction, but it worked for me, and given Paul Schraeder's history with religious themed films(TAXI DRIVER, THE LAST TEMPTATION OF CHRIST), it seemed natural he would direct. This is not a great movie, because Schraeder doesn't go as deep as Leonard did into his characters, and some of the humor doesn't translate. But most of it does, and this avoids the heavy-handedness of most movies about angels/healers/devils. Part of that is due to Skeet Ulrich, who should avoid hearing Johnny Depp comparisons after this movie, because he shows a personality all of his own. And Bridget Fonda pairs up nicely with him. This movie even gets a good performance out of Tom Arnold. All in all, underrated and deserves checking out.",
         "Elmore Leonard novels tend to deal with sleazy characters operating at the fringes of society. \"Touch\" is a strange book in that the sleaze bags are presented in a different light. They're not the obvious con men, but they are people that are trying to take advantage of a situation that is perceived as a money producing scheme. Paul Schrader has adapted and directed, but the essence of the book is somehow elusive by what is presented to us. Yes, we realize that Bill Hill is into making a fast buck if he can sell Juvenal as the miracle worker with supernatural powers. In fact, this theme has been done more successfully in other films. What the director accomplishes are good performances from his cast. At times the movie feels flat and without a clear direction as where it wants to go; we don't care too much about Juvenal after he loses his 'touch' and he becomes a mere mortal. Skeet Ulrich is excellent as Juvenal; this actor is always a welcome sight in any movie he is in. Christopher Walken turns a controlled performance as Bill Hill, the man in search of a good con that will do anything to get it done. Bridget Fonda is also low key as Lynn, the skeptical woman who sees good in Juvenal and ends up falling for him. Also very effective is Tom Arnold, the man that wants to take the church into the right path and will stop at nothing to protect his own views.",
         "Don't be fooled by the subject matter - an ex-monk, who can heal the sick by touching them, but suffers stigmata each time and gets caught up in a whirl of religious fanatics, big-business evangelists and ratings-hungry media - this is a sweet and touching romantic comedy! Leave it to Paul Schrader to find a way to do some heavy soul-searching without getting heavy-handed, yet always remaining quirky as we know him from his dramas. A wonderful supporting cast (Christopher Walken, Tom Arnold, Janeane Garofalo, Lolita Davidovich and Gina Gershon) adds color and texture to the story without detracting from the quiet chemistry going on between Skeet Ulrich and Bridget Fonda. When Ulrich says without grandeur that he believes in God and miracles, you don't even think twice about it - you believe every word he says at face value. A rare performance.",
         "Occasionally Elmore Leonard writes about something other than the underworld. Here his wonderful dialogue and amusing characters are centered around, not a bank robber or ex-con, but a young man who receives miraculous stigmata. The tone is stirical and the comedy is quite dark; definitely worth a look. After Get Shorty Hollywood seemed to finally get how to translate Leonard to the screen, and Touch certainly belongs in the company of Get Shorty, Jackie Brown, and Out of Sight. The cast is perfect in this one, with Skeet Ulrich and Bridget Fonda the best they've been so far, plus Christopher Walken in full glory, and Tom Arnold (yes, That Tom Arnold) just dead on as a religious zealot. This one didn't get much of a theatrical run so go find it at the video store.",
         "Interesting characters and a great cast, but the script really left them with nowhere to go. Bridget Fonda was lovely and I will check out her work in other films (last one of hers I saw was Doc Hollywood in 1991). Will also keep a lookout for Skeet Ulrich who brought a nice blend of charm and mystique to the role of the central character. Christopher Walken is competent as usual, but this is not the sort of part I enjoy seeing him play. Tom Arnold did a good job as the obsessed religious fanatic. I found the labeling of this movie as a comedy strange, but it is hard to say how else it should be categorized. It is definitely a subtle and wry brand of humor. I don't think I laughed aloud even once. One thought provoking thing about the movie is that it shows that people can do good things without being wholly good, and bad things without being wholly bad. That may sound obvious, but too often movie characters are one-dimensional. For example if someone is exploitive (especially in a comedy), they also turn out to be evil to the core. A better script with some added time for plot development would have made this a much more satisfying picture.",
         "Paul Schrader can be very erratic as a director. I think Affliction is his best film, by far, and this movie and Blue Collar are his next best. That said, you cannot be immune to the basic conceit and find it provocative, much less enjoyable. If you can accept that the Skeet Ulrich character may have St. Francis like qualities, and can really heal sick and handicapped people, Touch is a wonderful film. Christopher Walken (as always) is excellent as the ambitions and unseemly tent-show preacher, hell bent on making a fortune from the \"healer-man\"; and the others in the cast, Bridget Fonda, Anthony Zerbe and Tom Arnold especially, are excellent, too. Arnold, in particular, brings an amazing zeal and perfect, inadvertent humour to his portrayal of a slightly militarist, born again, religious fanatic. Certainly the movie raises more questions than it answers, and it is not quite as spiritually provocative or deep as Bigas Luna's Renacer, but it is certainly well worth watching.",
         "`You are an odour in the nostrils of God,' jabbers religious zealot August Murray (Tom Arnold). He is damning sometime revivalist Bill Hill's (Christopher Walken) cynical marketing of Christ-like figure Juvenal (Skeet Ulrich essentially playing Edward Scissorhands minus the blades). Hill wearing a glitzy gold jacket and an enormous `Thank You Jesus' necklace sees a book deal and a slot on the awful Debra Lusanne Show (Gina Gershon superb at mimicking Ricki Lake with a snarl) for the innocent healer, who has stigmata on his rib cage. In lesser hands than Paul Schrader, Elmore Leonard's non-crime novel could have become an overwrought toil in the evils of America's salacious media. However, Touch is actually a wryly amusing and unhurried look at faith and exploitation. The histrionics and belly laughs are bestowed upon the cameos, who obviously capture the best lines: `Do they make condoms that protect the soul' (Arnold) and `Controversy is the oxygen I breathe' (Gershon). Ultimately, best savoured on video. --Ben Walsh",
         "\"Touch\" sticks Ulrich at the center as a young man with stigmata and maybe something more...healing power, the second coming, whatever. Around him are sundry characters ranging from mildly peculiar to very peculiar who want to use his questionable power to suit their own agendas. This unfortunate flick appears to be telling a story but fizzles in the end. A very unsatisfying, forgettable watch and a waste of a good cast. In short, a flop.",
         "A comedy that tries a little too hard to be offbeat. Ulrich is Juvenile, an oblivious ex-Franciscan monk who has the power of stigmata. He can heal those he touches. Walken is a religious profiteer who attempts to make a few bucks of Juvenile by elisting Fonda's help. The tongue-in-cheek satire does not mix well its use of slapstick, and most of the jokes end up flopping around on the floor for a few moments too long. No one seems to be having much fun in their roles, except for Tom Arnold, who's having too much fun as the annoying christian extremist trying to bring people to the old ways of worship. His energetic idiocy succeeds all too well in annoying.",
         "This was a total waste of my time. Not only did the movie lack a clear message, but the choppy nature left you guessing what the story was about. The acting wasn't convincing and the special effects were decidely poor. It's no wonder I never heard of this movie before I saw it on TV."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Initial Productions",
         "Lumière International"
      ],
      "summaries": [
         "When Juvenal, a presumed miracle worker, appears on the scene Bill Hill attempts to exploit him but his plans go astray with the untimely intervention of August Murray and the developing relationship between Juvenal and Lynn Faulkner.",
         "With the discovery of Juvenal, a miracle healer, evangelist turned RV dealer Bill Hill envisions riches. Hill manages to snare Juvenal with the help of a former associate, Lynn Faulkner. However, Hill's plans of book deals and TV talk show visits hits a snag when Lynn falls for Juvenal and has second thoughts about exploiting him. With this new situation, another thorn in Hill's side arrives in the form of the Reverend August Murray, who sees Lynn as a corrupting influence on Juvenal and is determined to free him of her."
      ],
      "budget": 0
   },
   "movielensId": 1458,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-02-14",
      "dvdReleaseDate": null,
      "directors": ["Paul Schrader"],
      "runtime": 96,
      "movieId": 1458,
      "title": "Touch",
      "mpaa": "R",
      "actors": [
         "LL Cool J",
         "Gina Gershon",
         "Conchata Ferrell",
         "John Doe",
         "Christopher Walken",
         "Skeet Ulrich",
         "María Celedonio",
         "Chris Hogan",
         "Anthony Zerbe",
         "Bridget Fonda",
         "William Newman",
         "Tom Arnold",
         "Breckin Meyer",
         "Matt O'Toole",
         "Richard Fancy",
         "Janeane Garofalo"
      ],
      "imdbMovieId": "0120357",
      "originalTitle": "Touch",
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Juvenal, a presumed miracle worker, appears on the scene Bill Hill attempts to exploit him but his plans go astray with the untimely intervention of August Murray and the developing relationship between Juvenal and Lynn Faulkner.",
      "tmdbMovieId": 61563,
      "avgRating": 3.03125,
      "releaseYear": "1997",
      "numRatings": 240,
      "posterPath": "/zNQMixGaxdHB5BlYIixb6xqbShf.jpg"
   }
}