{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bride",
            "id": 3582
         },
         {
            "name": "wedding night",
            "id": 4317
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "parents",
            "id": 159947
         }
      ],
      "imdb_id": "tt0120318",
      "video": false,
      "title": "That Old Feeling",
      "recommendations": [
         41779,
         71357,
         79008,
         101887,
         25221,
         30528,
         48862,
         40509,
         25189,
         27397,
         289040,
         114740,
         17978,
         39128,
         84720,
         91445,
         27224,
         31633,
         20682,
         9941
      ],
      "backdrop_path": "/qsF1VxJc0WLnu9G1OQ7eQv1i9A5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dan De Mora",
               "gender": 2,
               "credit_id": "52fe44dec3a368484e03b8bd",
               "name": "Dennis Farina",
               "profile_path": "/o649nAtUimSZxEV6xa5JbMSgsED.jpg",
               "id": 1117,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Molly De Mora",
               "gender": 1,
               "credit_id": "52fe44dec3a368484e03b8c1",
               "name": "Paula Marshall",
               "profile_path": "/631RjKeHEmOGwq6Pw9ijs8w9dtR.jpg",
               "id": 59449,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joey Donna",
               "gender": 2,
               "credit_id": "52fe44dec3a368484e03b8c5",
               "name": "Danny Nucci",
               "profile_path": "/q1KztDGVWkVzbKYlj5GAoojpQc4.jpg",
               "id": 8540,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lilly Leonard",
               "gender": 1,
               "credit_id": "52fe44dec3a368484e03b8c9",
               "name": "Bette Midler",
               "profile_path": "/ylGKhmHKUa1fBvvbA0kvdn3eFNn.jpg",
               "id": 73931,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Rowena",
               "gender": 1,
               "credit_id": "52fe44dec3a368484e03b8f1",
               "name": "Gail O'Grady",
               "profile_path": "/e2moRkIxkuZXZDHFbbocKvA5SUR.jpg",
               "id": 26009,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Alan",
               "gender": 2,
               "credit_id": "52fe44dec3a368484e03b8f5",
               "name": "David Rasche",
               "profile_path": "/9qDHYBJViTtFeGbErb2bQwj6u4F.jpg",
               "id": 33533,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dec3a368484e03b8cf",
               "name": "Carl Reiner",
               "profile_path": "/AtDqJQkl7dH2m19kPio3cosfbes.jpg",
               "id": 1895,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44dec3a368484e03b8d5",
               "name": "Leslie Dixon",
               "profile_path": null,
               "id": 11708,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44dec3a368484e03b8db",
               "name": "Leslie Dixon",
               "profile_path": null,
               "id": 11708,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44dec3a368484e03b8e1",
               "name": "Bonnie Bruckheimer",
               "profile_path": null,
               "id": 58070,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dec3a368484e03b8e7",
               "name": "Richard Halsey",
               "profile_path": null,
               "id": 1918,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dec3a368484e03b8ed",
               "name": "Patrick Williams",
               "profile_path": null,
               "id": 7422,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "55350bc7925141388b001605",
               "name": "Steve Mason",
               "profile_path": null,
               "id": 51981,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "55350bdc9251417ae3005531",
               "name": "Nancy Nayor",
               "profile_path": "/43LHN7kjcpvsSBBoshm4C1GUouP.jpg",
               "id": 13585,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55350bf19251417ae3005534",
               "name": "Sandy Veneziano",
               "profile_path": null,
               "id": 2396,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "55350c1a9251416f8800282d",
               "name": "Alicia Keywan",
               "profile_path": null,
               "id": 33612,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "55350c3492514140b5005942",
               "name": "Steve Shewchuk",
               "profile_path": null,
               "id": 15223,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "55350c5f9251417eb8001881",
               "name": "Robert De Mora",
               "profile_path": null,
               "id": 1005624,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "55350c7cc3a3681c3500112f",
               "name": "Robert Ramos",
               "profile_path": null,
               "id": 1457038,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "55350c999251416f88002847",
               "name": "James D. Brown",
               "profile_path": null,
               "id": 1286355,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "55350cb6c3a3682226007be3",
               "name": "Angela Levin",
               "profile_path": null,
               "id": 23427,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "55350ce5c3a3682dc200225d",
               "name": "Patricia Green",
               "profile_path": null,
               "id": 1457044,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "55350d24925141675e001e63",
               "name": "Angelo Colavecchia",
               "profile_path": null,
               "id": 1399927,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "55350d4a9251416f88002862",
               "name": "Andrew Casey",
               "profile_path": null,
               "id": 1399974,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "55350d5ec3a36834430018d0",
               "name": "Takashi Seida",
               "profile_path": null,
               "id": 1392106,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "55350d7bc3a3680bdc00229f",
               "name": "Ross Clydesdale",
               "profile_path": null,
               "id": 36807,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55350d99c3a36848ca0066ac",
               "name": "Blanche McDermaid",
               "profile_path": null,
               "id": 1457045,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5675e71d92514179e10039b3",
               "name": "Jack Keller",
               "profile_path": null,
               "id": 1551320,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.181225,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25796,
      "vote_count": 18,
      "budget": 0,
      "overview": "A bride's divorced parents find their old feelings for each other during the wedding reception and over the course of the next few days upsetting the newlywed's honeymoon.",
      "similar": [
         712,
         6557,
         3933,
         2959,
         50124,
         24,
         72207,
         2018,
         25195,
         11003,
         1597,
         37247,
         8273,
         9029,
         9522,
         82695,
         3563,
         11778,
         55721,
         291870
      ],
      "original_title": "That Old Feeling",
      "runtime": 105,
      "poster_path": "/tKvnzlzNJK0f1abseNPupFF3s36.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Boy of the Year",
            "id": 8855,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "The Bubble Factory",
            "id": 27128,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "All Girl Productions",
            "id": 10535,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-04",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "It was the perfect wedding except for two things... the bride's parents.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Carl Reiner"],
      "runtime": 105,
      "synopsis": "Sometimes you find out that the love you left is the only one you really want -- no matter what.",
      "writers": ["Leslie Dixon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120318/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTAyNDA0MDY0OF5BMl5BanBnXkFtZTcwMzUxNTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bette Midler, Dennis Farina, Paula Marshall | See full cast and crew »"],
      "reviews": [
         "This is a lovely romp without a wasted moment. The often quite broad comedy is believable due to the great script and fine acting. The story cuts to the chase in a way that is refreshing (see the scene where Lilly and Dan go outside at the wedding). The leads are all appealing, especially Danny Nucci and Paula Marshall as an unlikely duo and Bette Midler and Dennis Farina, who are evidently having a fabulous time. This is just flat out enjoyable and well-written, the way a lot of comedies were in the golden days of Hollywood. And like those great classic comedies, this is not a sappy sentimental story with any false nobility. People admit to not being perfect. They don't try to be anything they're not - or if they do they are quickly deflated. The underlying theme is \"be true to yourself and don't get sucked into the boring b.s. of life.\" This is the kind of subversive edge that the great screwballs had, right down to including a pompous wannabe politician and a gold-digging second wife. Bravo. If only they'd make more like this. How about a sequel or the same team coming back together for another project?",
         "When I first saw this movie on tv it seemed way over-exaggerated so I decided not to watch it again. Oddly enough when a second time came around to view it I did tune in and really started to appreciate the humor of it all. It's so downright funny, at times in the extreme, yet how true to life in some moments. It grows on you! Needless to say, when I like a movie that much I go and buy the video too. It's an endearing comedy to lighten your day, overall entertainment, and everyone does a fine job with their part in this \"over the top\" comedy. Try it, you'll like it!",
         "I didnt think that this movie would be any good but i rented it anyway. Boy was I wrong because this movie is so funny especially Bette Midler and Dennis Farrina as a two people who love each other that much that they hate each others guts. And there is more romance, I willl not say between who.... but its so cute. Rent this movie IT'S FUNNY!!!!",
         "This movie just saved my day - I know this is not a movie for everyone, but I fell in love with in the first minutes. This movie has the certain \"something\", which I find rare in movies these days - you can clearly see that everyone has had great fun doing this. Bette Midler and Dennis Farina pull out the best roles, and the casting is awesome overall. I might just be naive, but this film kept surprising me all the time, and I can't recall the last time any movie has gone by so fast. There is not great depths in the plot, it's just plain old 'feel good have fun' hour and a half ! Worked for me, went straight into my top ten !",
         "This movie is adorable. I've seen it about six times but I never tire of it. I enjoy the comedy between Bette Midler and Dennis Farina, who are both fantastic, but watch this movie for Paula Marshall and Danny Nucci. They are both hilarious and sweet. This movie may not be the most popular one, but I'd rather watch this than many of the romantic comedies that have come out recently. Rent it, especially if you're a romantic comedy fan! It's great!!!",
         "This was a fun movie. Admittedly, it was not the best film ever made, but it hangs together well enough, and is quite enjoyable. Molly DeMora (Paula Marshall) is about to marry Keith Marks (Jamie Denton), the rather stuffy son of a Replubican Senator. Unfortunately for Molly, this means that she will have to invite both of her parents, who have been divorced since she was a little girl, and still don't get along well. Her mother, Lilly Leonard (Bette Midler), is a famous actress who is now married to a psycho-babbling therapist, Alan (David Rasche). Her father, Dan DeMora (Dennis Farina) is a famous writer who has married Rowena (Gail O'Grady), the woman he left Lilly for. Molly expects some sparks to fly between her parents, but the ones that do surprise even her, as they rekindle their romance (in an hilarious scene involving a rocking Volkswagen), and leave the reception together. Unfortunately, Keith fears that these kinds of antics will cause a scandal, something detrimental to both his career and his father's. So, he rather sternly orders Molly to handle the situation, which she does, with a paparazzo photographer (Danny Nucci) hot on her tail. However, as Molly tries to bring her parents to their senses, she starts to wonder if maybe they shouldn't be together after all - and if maybe she doesn't belong with Keith. Admittedly, it's a silly story. In spite of that, it's still a well written one, and a well acted movie. Midler is hilarious as always. Farina shows an ability to charm even while playing for laughs. Nucci does a great job of showing a decent human being in spite of the slimy way he makes a living. Denton is wonderfully stuffy. But the best performance is Marshall, who seems to have an absolute gift for comedy. Yes, it's a silly movie, but every now and then, you need a silly little diversion, and this is just the thing for those times.",
         "I didn't have high expectations for this movie but was I surprised. This was one of the funniest romantic comedies that's come along for quite some time. Bette Midler and Dennis Farina are great! Paula Marshall and Danny Nucci have some really good scenes. Jayne Eastwood as Aunt Iris is a hoot. Perfect casting in this one all the way. If you have been married for awhile you can practically feel the sparks sizzling between Midler and Farina. The music was even enjoyable. The latin music at the wedding makes you feel like dancing. Bette Midler and Dennis Farina prove that some things get better with age...",
         "As larger-than-life as she is, Bette Midler manages to allow her co-stars to share the spotlight a little in this naughty comedy. David Rasche and Gail O'Grady could each carry a film on their own, and Farina's role fits him like a glove. Rasche was my favorite character. Jennifer Aniston was offered Paula Marshall's role as the daughter, but they wouldn't pony up $1 million for her. Marshall is fine, but Aniston may have been worth it to draw more people into the theatre and make this film the bigger hit it deserved to be. Her stuffed shirt of a husband exudes a sexy stuffed-shirtedness. But Nucci is annoying and his supposedly comic scenes with Marshall fall flat. He's supposed to be likabke, he's not. With Carl Reiner directing, it would hard to not find this film funny, and unpredictable. This film is not for people with conservative morals, but everyone else should enjoy it.",
         "Dennis Farnina and Bette Midler are the best chemistry match for this outrageously screwball comedy. Attending their daughter's wedding, after 14 years of being divorced from each other, and remarrying, the two despise each other and pull absolutely no punches. After a major screaming match at the reception, the two are put out in the street and told to calm down. It is at this point that the old feeling captures them and the picture becomes an absolute madcap comedy. The duo run off and are pursued by the daughter, and a photographer who can't stop snapping pictures of Midler. While on their escapades, the daughter realizes that she has feelings for the photographer. She has married into a political Republican family who pride themselves on good family values. Some values. While waiting for his bride to return, the young husband gets drunk and has a one-night fling with Farina's second wife! The ending is an absolute pip in the tradition of the 1930 screwball comedies. This is a marvelously crafted film- one of the best of this type that I've seen in years.",
         "I know it was only a romantic comedy but this has been one of my favorite movies since the first time I watched it. I can never get enough of it. It's like Groundhog Day. This movie does not get annoying if I watch it a hundred times because I just love it so much. The acting is hilarious, I love the plot and the script is wonderful. And of course, who could complain about Danny Nucci?! Definitely one of my favorites! I love how Joey seems so annoying in the beginning. The audience is convinced not to like him yet when he starts opening up to her about taking the pictures and how he thought she was beautiful at her birthday party, it brings them closer. I have always thought this was the most romantic movie I have ever seen and I have yet to find one that has outshone it. But you know the saddest thing about this? I haven't even bought it on tape or DVD yet! *sighs* I really have to do that soon! Anyway, if you're just browsing and you don't know whether or not you should watch this, trust me, it's wonderful, you should!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "All Girl Productions",
         "Boy of the Year",
         "Bubble Factory, The"
      ],
      "summaries": [
         "Lily and Dan are a couple who have been divorced for years. When their daughter, Molly gets married she invites them. At the reception, Lily and Dan bicker loudly so Molly asks them to leave. It's while they are alone that their banter turns into passion and they get it on. Later while Molly is having her wedding night she discovers her parents together and freaks out. the next day they run off and their partners are wondering where they are. Molly decides to try and find them and she enlists a paparazzi who's been following her mother to help find them.",
         "When Molly's parents see each other for the first time in 14 years, Molly thought a shouting match at the reception was the worst thing that could happen. But as the spark of her parents love is rekindled in a car in the parking lot, things get much worse for the newlywed...",
         "A bride's divorced parents find their old feelings for each other during the wedding reception and over the course of the next few days upsetting the newlywed's honeymoon."
      ],
      "budget": 0
   },
   "movielensId": 1463,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1997-04-04",
      "dvdReleaseDate": "1998-04-28",
      "directors": ["Carl Reiner"],
      "runtime": 105,
      "movieId": 1463,
      "title": "That Old Feeling",
      "mpaa": "",
      "actors": [
         "Dennis Farina",
         "Paula Marshall",
         "Danny Nucci",
         "Bette Midler",
         "Gail O'Grady",
         "David Rasche"
      ],
      "imdbMovieId": "0120318",
      "originalTitle": "That Old Feeling",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["SO0xPrFVNgw"],
      "plotSummary": "A bride's divorced parents find their old feelings for each other during the wedding reception and over the course of the next few days upsetting the newlywed's honeymoon.",
      "tmdbMovieId": 25796,
      "avgRating": 3.08724,
      "releaseYear": "1997",
      "numRatings": 384,
      "posterPath": "/tKvnzlzNJK0f1abseNPupFF3s36.jpg"
   }
}