{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0117544",
      "video": false,
      "title": "Salut cousin !",
      "recommendations": [332],
      "backdrop_path": "/pHRUjjHvHSC3nJgUulHsvE5N8CD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alilo",
               "gender": 0,
               "credit_id": "52fe4616c3a368484e07e2f7",
               "name": "Gad Elmaleh",
               "profile_path": "/ay3csj0Wmn8OppIcArmHRiwmBLc.jpg",
               "id": 51100,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mok",
               "gender": 0,
               "credit_id": "52fe4616c3a368484e07e2fb",
               "name": "Messaoud Hattau",
               "profile_path": null,
               "id": 230466,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Fatoumata",
               "gender": 0,
               "credit_id": "52fe4616c3a368484e07e2ff",
               "name": "Magaly Berdy",
               "profile_path": "/2IkKahEZXXd2OTeKpI5aLk7XoDQ.jpg",
               "id": 230467,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Laurence",
               "gender": 1,
               "credit_id": "54c6b9da92514167870002c5",
               "name": "Ann-Gisel Glass",
               "profile_path": "/xz8c8xuMZwDVWMHzlnJukXFtYGv.jpg",
               "id": 1161730,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Maurice",
               "gender": 2,
               "credit_id": "52fe4616c3a368484e07e307",
               "name": "Jean Benguigui",
               "profile_path": "/p2XMWRNPJx1aUZbUUTCEvrB4r9T.jpg",
               "id": 35899,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Claude",
               "gender": 0,
               "credit_id": "52fe4616c3a368484e07e30b",
               "name": "Xavier Maly",
               "profile_path": "/AhqMSPil8kMHHxiiAntGKBYRmle.jpg",
               "id": 96416,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Le voisin",
               "gender": 2,
               "credit_id": "52fe4616c3a368484e07e30f",
               "name": "Cheik Doukouré",
               "profile_path": "/7iSGcpFeVgotR5NDuX2AAD7cabf.jpg",
               "id": 230469,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4616c3a368484e07e2f3",
            "name": "Merzak Allouache",
            "profile_path": null,
            "id": 82307,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.217122,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DZ",
            "name": "Algeria"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "LU",
            "name": "Luxembourg"
         }
      ],
      "id": 60083,
      "vote_count": 5,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "Salut cousin !",
      "runtime": null,
      "poster_path": "/dKckqZgfBfQs8oOQuHJlPhhSEkK.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1996-11-20",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Merzak Allouache"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Merzak Allouache",
         "Caroline Thivel"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0117544/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI4OTMzNjk5Ml5BMl5BanBnXkFtZTcwMjE1MTMyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Gad Elmaleh, Messaoud Hattau, Magaly Berdy | See full cast and crew »"],
      "reviews": [
         "Salut portrays post-modern French society, through the eyes of Maghrebines, truthfully and comically. The characters, despite certain eccentricities, are real and the actors who play them are truly talented. The movie follows a few days of an Algerian man, Alilo's, \"business\" trip to Paris where he stays with his cousin who has lived in the city for years. He is unfamiliar with the metropolitan ways of the city of that of his cousin. However, he soon finds that he is in love and wishes to stay in the city. Amidst that, we see the underlying problems peoples of Maghreb and immigrant decent face in France today.",
         "This is a pretty dull type of French movie, more focused on the misery of life than anything else. It is not weirdly bizarre as movies by such directors as Luc Besson and Marc Caro (and his colleague). Anyway, it still has its interesting points as it is about being separated from one's homeland, and baring responsibility for a friend's misfortunes. Allouache is an Algerian who migrated to France after making a rather harsh movie directed at the Algerian government. In this movie the violence and chaos in Algeria is constantly referred too and we see people from their who have different reactions to it. The clothes designer calls Algeria his homeland, and listens to music to remind him of it, but he cannot return because of the violence there. The cousin of the main character simply does not care, but he has his own problems. The main character calls Algeria home, and desires to return, but cannot until he has completed his chore, that is to pick up a case for his boss. At first he loses the address, then he is encouraged to stay one more day, and finally the case is lost. While watching the movie I was expecting the case to be full of drugs, but that wasn't the problem. The theme of this movie is being separated from one's homeland, and not being able to return. In essence, he cannot return as he no longer has the case, so he clutches to a woman who has also been deserted by her boyfriend. The cousin is an interesting character as he is a gambler, a liar, and a cheat, yet he has one noble characteristic - he is concerned mostly for a friend of his girlfriend who was seriously injured after a nightclub fire. He refuses help from his parents, and not only lies about them, but avoids them and tries to get his cousin to avoid them. The reason is not clearly explained, but it is probably because he refuses to rely upon anybody, and would rather go his own way. As previously said, this movie has a very bleak and frustrating view of life, being separated from one's homeland. This is in essence a Christian experience as we are separated from our true homeland, heaven. We desire to return, but cannot until we are called there, so as such we must remain in a bleak and empty world sharing the message of the grace of God and encouraging other displaced citizens of heaven from despair.",
         "I happened to see this film on TV and I'm happy of it! It is a touching story of a young Algerian man, Alilo, who comes to Paris and wants to meet his relatives who have immigrated there years ago. He meets his cousin Mok who pretends to be the succesful person of his family. At first, Alilo believes him but finds out the truth when he visits the family. Nothing is like Mok has said. The film is very realistic, sometimes almost depressing. Alilo, who is used to people disappearing and getting killed in Algeria, expects France to be a paradise. But living there as an immigrant isn't such easy. Still, these people love Paris. The cultural differences between the native Algerians and the immigrated ones become clear through the film. Alilo, who never has spoken to a girl outside the family, falls in the first one who speaks to him. Parisians seem very free to him and he seems very clumsy to them. In fact, he's a very nice and polite young man who tries to learn what he can on his adventerous trip. How is it going to end?"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Artémis Productions",
         "Cléa Productions",
         "Flash Back Audiovisuel"
      ],
      "summaries": [
         "Alilo arrives in Paris, met by his hip cousin Mok. Alilo is to pick up a suitcase of dresses to smuggle back to Algiers for resale. He's lost the dressmaker's address and his boss is gone for five days, so he stays in the Moskova neighborhood of the 18th arrondissement with Mok. Mok makes rap music of Jean de La Fontaine's fables, invents fabrications of his own, is in debt to his bookie, and in love with a punk rocker. Alilo's old-country sweetness, in contrast with Mok's big-city neuroses, gets the attention of Fatoumata, a lovely African neighbor. Once Alilo gets the dresses, he must return to Algiers, but it seems he's only started to live: is there any way he can stay?",
         "Salut Cousin! is the tale of two Algerian cousins and their mishaps in the racially volatile environment of Paris."
      ],
      "budget": 0
   },
   "movielensId": 1467,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-11-20",
      "dvdReleaseDate": null,
      "directors": ["Merzak Allouache"],
      "runtime": 0,
      "movieId": 1467,
      "title": "Salut cousin !",
      "mpaa": null,
      "actors": [
         "Gad Elmaleh",
         "Messaoud Hattau",
         "Magaly Berdy",
         "Ann-Gisel Glass",
         "Jean Benguigui",
         "Xavier Maly",
         "Cheik Doukouré"
      ],
      "imdbMovieId": "0117544",
      "originalTitle": "Salut cousin !",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 60083,
      "avgRating": 2.77143,
      "releaseYear": "1996",
      "numRatings": 35,
      "posterPath": "/dKckqZgfBfQs8oOQuHJlPhhSEkK.jpg"
   }
}