{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "date",
            "id": 248
         },
         {
            "name": "sexuality",
            "id": 738
         },
         {
            "name": "blind date",
            "id": 4513
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "romantic comedy",
            "id": 9799
         },
         {
            "name": "best friend",
            "id": 12392
         }
      ],
      "imdb_id": "tt0118750",
      "video": false,
      "title": "Booty Call",
      "recommendations": [
         28121,
         60082,
         22067,
         24066,
         38937,
         77530,
         19489,
         24792,
         16096,
         39310,
         33644,
         25973,
         53862,
         150889,
         12251,
         27360,
         49471,
         15278,
         32556,
         128124
      ],
      "backdrop_path": "/zLzvx8cyaPq1TBhxbKyjn97twN5.jpg",
      "revenue": 20060051,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bunz",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013dd3",
               "name": "Jamie Foxx",
               "profile_path": "/cDRGXCNrwf1p9jouw9GzhU2vWP7.jpg",
               "id": 134,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rushon",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013dd7",
               "name": "Tommy Davidson",
               "profile_path": "/q0f7F4jYfZ5XvcaeBxtbQlfltLX.jpg",
               "id": 88059,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lysterine",
               "gender": 1,
               "credit_id": "52fe442cc3a368484e013ddb",
               "name": "Vivica A. Fox",
               "profile_path": "/uxTOzgRhk0VkbK1ZiOrQSTYuzAl.jpg",
               "id": 2535,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nikki",
               "gender": 1,
               "credit_id": "52fe442cc3a368484e013ddf",
               "name": "Tamala Jones",
               "profile_path": "/gG0PHm94ArObvF8LqbuoaWP2ye5.jpg",
               "id": 59154,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Arguing Woman",
               "gender": 0,
               "credit_id": "52fe442dc3a368484e013df5",
               "name": "Amy Monique Waddell",
               "profile_path": null,
               "id": 956126,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Arguing Man",
               "gender": 0,
               "credit_id": "52fe442dc3a368484e013df9",
               "name": "Wiley Moore",
               "profile_path": null,
               "id": 187952,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Ug Lee",
               "gender": 0,
               "credit_id": "52fe442dc3a368484e013dfd",
               "name": "Kam Ray Chan",
               "profile_path": null,
               "id": 199872,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mr. Chiu",
               "gender": 2,
               "credit_id": "52fe442dc3a368484e013e01",
               "name": "Ric Young",
               "profile_path": "/nqhFfFdZ73cEjLjAuLW19f3d7EO.jpg",
               "id": 11397,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Yoyo",
               "gender": 0,
               "credit_id": "52fe442dc3a368484e013e05",
               "name": "Ammie Sin",
               "profile_path": null,
               "id": 955176,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Singh",
               "gender": 0,
               "credit_id": "52fe442dc3a368484e013e09",
               "name": "Scott LaRose",
               "profile_path": "/z0ycpwF75FUkAeIFORdnVXyJ7dd.jpg",
               "id": 84212,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Judge Peabody",
               "gender": 2,
               "credit_id": "52fe442dc3a368484e013e0d",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Judge's Woman",
               "gender": 0,
               "credit_id": "52fe442dc3a368484e013e11",
               "name": "Olivia Yap",
               "profile_path": null,
               "id": 982680,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013de5",
               "name": "Jeff Pollack",
               "profile_path": null,
               "id": 88060,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe442cc3a368484e013deb",
               "name": "Takashi Bufford",
               "profile_path": null,
               "id": 57679,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013df1",
               "name": "J. Stanford Parker",
               "profile_path": null,
               "id": 170266,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 5.252989,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21915,
      "vote_count": 36,
      "budget": 0,
      "overview": "Rushon is sexually pent-up and ready to take thing things to the next level with his girlfriend, Nikki. But when he calls for a date, she asks to make it a double -- bringing along her brash friend Lysterine, whom Rushon sets up with his lewd buddy, Bunz. Things go better than expected. As the evening transitions from the restaurant to the bedroom, the two men go on a madcap search for what will surely make the night complete: condoms.",
      "similar": [
         19913,
         449176,
         13523,
         376660,
         44564,
         40807,
         862,
         13,
         72105,
         64688,
         41630,
         50544,
         77338,
         272693,
         10625,
         8839,
         277547,
         290762,
         888,
         397422
      ],
      "original_title": "Booty Call",
      "runtime": 79,
      "poster_path": "/k08rbDlwwftDynJnNkIiuaADcrj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1997-02-26",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Some guys will do anything for a little something.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Pollack"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Takashi Bufford",
         "J. Stanford Parker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118750/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NTgwODY2M15BMl5BanBnXkFtZTYwNDk4OTE5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Jamie Foxx, Tommy Davidson, Vivica A. Fox | See full cast and crew »"],
      "reviews": [
         "Come on, when you're planning on seeing a movie entitled \"Booty Call\" you're obviously not anticipating a Disney comedy. This film delivers just as much raunch as its title suggests. The comedy is sometimes overdone and sometimes plagued by lame sitcom material, but I still got tons of laughs. Jamie Foxx is a terrific comic actor, and he delivers many funny--and memorable--one-liners. Even when the story runs flat, he livens it up with his quirky sense of humor. There's also a good cameo by multi-talented comedian Bernie Mac, who has some of the funniest cameo roles in movie history. I enjoyed the two Middle Eastern guys who worked at the convenience store. Sure, they were stereotyped caricatures of what a foreigner at a corner store or 7 Eleven would act like, but they were still extremely funny. This film has a chock full of outrageous, yet original moments. The argument in the Chinese restaurant is a classic! If you're looking for good, clean fun--\"Booty Call\" is NOT the movie to see! But if you're looking for big laughs, no matter how raunchy and profane, you will have a blast! Don't leave this call on hold! My score: 7 (out of 10)",
         "Forget race. Forget age. Forget social status. We all know the perils of getting, and giving, some; because of that, the humor of this movie is universal. This is one of those unbelievably rare comedies that is funny all the way through. Not only that, there are so many jokes and gags, that you will probably miss some of them because you're too busy laughing at the last one. Excellent movie to rent for a \"stay-at-home\" date.",
         "This is one of the most mindlessly hilarious movies ever made. Definitely Jamie Foxx's best. Although the middle is kind of slow (with the exception of the convenience store - Are we going to do this or what Judge?) the movie as a whole has some of the best lines ever for a beer-fest, watch-it-with-the-guys Saturday afternoon movie. See the movie for the writing, stay for the dance in the nightclub where Tommy Davidson busts out the best dance moves on reel until Rush Hour :) If you're even remotely a fan of outrageous trash talking and completely random lines (\"Was ya gonna wait till I turned into a butterfly?\" and \"You need a cigarette to bring you down?\" LOL!) then this movie is a must see. Otherwise stay away as this is going to offend and bore you. 10/10 for some, and a 3/10 for others. Watch at your discretion!",
         "Booty Call is one of the funniest movies to come along in many years. Jamie Foxx absolutely steals the show. He has some really funny, memorable lines, and is adept at physical humor. Even though the material is of an overtly sexual nature, the message of the film is definitely that monogamy is cool. A real over-achiever of a film. Was probably made on a shoestring budget, but delivers more laughs than any high-priced Eddie Murphy comedy. A must-see!",
         "I know this movie has it's critics only being rated 4.9/10, but so many characters in this movie led by Jamie Foxx were hilarious. I first saw this movie in 1999 and waited until 2006 for it's release on DVD. Booty Call is a comedy based on the dating scene and the struggle it can become; especially if you're a guy. Jamie Foxx played Bunz who was practically a dog on heat going to any length to score before sunrise, hence the movie's title Booty Call. His best mate and side kick in this adventure - Rushon who brought a serious side to the movie as he was more involved in a relationship. Along the way I found this movie really reached it's peak when the two guys visited the convenient store, where two Indian immigrants worked behind the counter who I thought added so much to this movie making it hilarious. Even Judge Peabody played by Bernie Mac delivered a great short appearance preaching the gospel and the danger's of sex even though he was on his way home with a prostitute. The movie does slow down a little towards the end when the couples visited the hospital, but still there were scenes that delivered a laugh. In all it's a short film but you will find it enjoyable from the restaurant scene in the beginning to the very end credits. And not a bad soundtrack if R & B and hip hop is your preferred choice in music. 9/10 - Based on the written material and the characters.",
         "Enjoyed this film from the very beginning to the end and it had me laughing until my sides hurt. Jamie Foxx, (Bunz) along with Tommy Davidson, (Rushon) gave an outstanding performance as two guys trying to score with two gals who demanded Glad Wrap and were very particular about the type of condoms the guys were going to utilize. Vivica A Fox,(Lysterine) and Tamala Jones (Nikki) gave a great supporting role as the gals who Bunz and Rushon tried to score with. This film goes all around in Chinatown, a hospital and plenty of bedrooms and even a taxi cab. If you like Jamie Foxx and love his acting and comedy, this is the film you will greatly enjoy viewing.",
         "One of the first Jamie Fox films I ever saw years ago and loved it! He is really funny in this movie and you could see he was going to be a big star. Its definitely not a film everyone would enjoy but if you like films like 'Friday' and anything with the Wayans brothers you will be laughing out loud. There are a good few scenes that were extremely funny, in-particular the supermarket scenes where the main characters visit several times during one crazy night and are ridiculed by the two staff who do remind me of Apu from the Simpsons. Also the scene where Rushon and Bunz (Jamie Fox) wrap themselves in cling-film made me cry with laughter! Vivica A Fox was good in the film as well but the show is stolen by Jamie Fox. Highly recommend this movie.Great 'pick me up' film.",
         "A male chauvinist friend of mine and I rented this movie and liked it. It was good, cheap, raunchy, sexual, crude laughs, but laughs none the less. I think there are some very good quotable scenes in there as well. However, if you are actually expecting to see any nudity, there isn't any in there. Excuse my stereotype, but because of the vast amounts of (not so subtle) innuendo and profanity, most women that I know would probably not find this movie as hilarious as I did.",
         "For those of you who don't know it, a Booty Call is is a telephone call, other communication, or visitation made with the sole intent of engaging in sex or other forms of sexual release with the person being contacted. Traditionally this social practice, especially the term booty call, is associated with a person calling another person for a sexual encounter after having already established either a casual or more serious relationship involving sexual relations. Now, stars of this film seem to have a great time, and you will too. I wish Cedric the Entertainer had been here, but hey, not all films are purrfect. 8 out of 8. See ya'll.",
         "I find that, more than any other movie genre, comedy is a matter of personal taste. One person can come whole-heartedly recommend a film to you as being eyeball-busting funny, only for you to sit there stoney-faced throughout. This film perfectly illustrates that point. The user ratings and comments for this film have been pretty negative, but I've rarely laughed so much at a comedy. Yes, it's stupid and full of slapstick, but it has some great lines and the actors look like they're having fun. And unlike other similar films, it's not just a star vehicle for a money-mad, unfunny rapper. If you're planning a night in with a few drinks or *whatever* and you \"like this sort of thing\", this is a good bet."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Turman-Morrissey Company, The"
      ],
      "summaries": [
         "Bunz and Rushon are two best buddies who are looking forward to dating two ladies, Lysterine and Nikki. When the two boys get their lives altogether, they all fall in love. But will their lives stay peaceful?",
         "Two friends who have gone too long without sex set out to get some."
      ],
      "budget": 0
   },
   "movielensId": 1468,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-02-26",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Jeff Pollack"],
      "runtime": 79,
      "movieId": 1468,
      "title": "Booty Call",
      "mpaa": "R",
      "actors": [
         "Jamie Foxx",
         "Tommy Davidson",
         "Vivica A. Fox",
         "Tamala Jones",
         "Amy Monique Waddell",
         "Wiley Moore",
         "Kam Ray Chan",
         "Ric Young",
         "Ammie Sin",
         "Scott LaRose",
         "Bernie Mac",
         "Olivia Yap"
      ],
      "imdbMovieId": "0118750",
      "originalTitle": "Booty Call",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Rushon is sexually pent-up and ready to take thing things to the next level with his girlfriend, Nikki. But when he calls for a date, she asks to make it a double -- bringing along her brash friend Lysterine, whom Rushon sets up with his lewd buddy, Bunz. Things go better than expected. As the evening transitions from the restaurant to the bedroom, the two men go on a madcap search for what will surely make the night complete: condoms.",
      "tmdbMovieId": 21915,
      "avgRating": 2.5873,
      "releaseYear": "1997",
      "numRatings": 1283,
      "posterPath": "/k08rbDlwwftDynJnNkIiuaADcrj.jpg"
   }
}