{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "addiction",
            "id": 6782
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "drugs",
            "id": 14964
         }
      ],
      "imdb_id": "tt0112461",
      "video": false,
      "title": "The Basketball Diaries",
      "recommendations": [
         9819,
         8092,
         1587,
         1907,
         9894,
         36834,
         10537,
         11468,
         12106,
         10220,
         1630,
         4148,
         451,
         11443,
         9344,
         10218,
         11517,
         1900,
         10909,
         10279
      ],
      "backdrop_path": "/k66qUqJM7H2AXr7Iz94J3mQXigy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Jim Carroll",
               "gender": 2,
               "credit_id": "52fe43779251416c750116ab",
               "name": "Leonardo DiCaprio",
               "profile_path": "/A85WIRIKVsD2DeUSc8wQ4fOKc4e.jpg",
               "id": 6193,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Jim's Mother",
               "gender": 0,
               "credit_id": "52fe43779251416c750116af",
               "name": "Lorraine Bracco",
               "profile_path": "/8khTSZIrHEMbBiH6HSAOzOnnbmB.jpg",
               "id": 11478,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Pedro",
               "gender": 2,
               "credit_id": "52fe43779251416c750116b3",
               "name": "James Madio",
               "profile_path": "/3s32FSsr95w6nGtoH5f9sPk1mPw.jpg",
               "id": 65395,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "52fe43779251416c750116b7",
               "name": "Mark Wahlberg",
               "profile_path": "/z2wJh5n7qZRUE1y9uB8UrivAV2b.jpg",
               "id": 13240,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Swifty",
               "gender": 2,
               "credit_id": "52fe43779251416c750116d7",
               "name": "Bruno Kirby",
               "profile_path": "/jGRVym5zAQZix5N4ZRabuE3XKHm.jpg",
               "id": 9257,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Neutron",
               "gender": 2,
               "credit_id": "52fe43779251416c750116bb",
               "name": "Patrick McGaw",
               "profile_path": "/llU9JbZRO4Nl1LizqlW9yUWVA1S.jpg",
               "id": 186526,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Diane Moody",
               "gender": 1,
               "credit_id": "52fe43779251416c750116bf",
               "name": "Juliette Lewis",
               "profile_path": "/eeEx3v5ElBHvlrJjULlj5I3EpPF.jpg",
               "id": 3196,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Bobby",
               "gender": 2,
               "credit_id": "52fe43779251416c750116c3",
               "name": "Michael Imperioli",
               "profile_path": "/3AupsGJOUaAiXXaq626wzKaLiZ8.jpg",
               "id": 11486,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Reggie",
               "gender": 2,
               "credit_id": "52fe43779251416c750116c7",
               "name": "Ernie Hudson",
               "profile_path": "/h6hSUIuvJEjUih3wgMqYOZhNe57.jpg",
               "id": 8874,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Manny",
               "gender": 0,
               "credit_id": "52fe43779251416c750116cb",
               "name": "Manny Alfaro",
               "profile_path": null,
               "id": 163985,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Winkie",
               "gender": 0,
               "credit_id": "52fe43779251416c750116cf",
               "name": "Cynthia Daniel",
               "profile_path": null,
               "id": 185889,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Blinkie",
               "gender": 1,
               "credit_id": "52fe43779251416c750116d3",
               "name": "Brittany Daniel",
               "profile_path": "/3c7mCIY8wiUBANoxzl3oz1UOpgp.jpg",
               "id": 35476,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43779251416c7501167d",
               "name": "Scott Kalvert",
               "profile_path": null,
               "id": 65390,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43779251416c75011683",
               "name": "Jim Carroll",
               "profile_path": "/ltRN9Ny6x9JXgdikT9Gr9MUbRaY.jpg",
               "id": 65391,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe43779251416c75011689",
               "name": "Bryan Goluboff",
               "profile_path": null,
               "id": 65392,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43779251416c7501168f",
               "name": "Liz Heller",
               "profile_path": null,
               "id": 65393,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43779251416c75011695",
               "name": "John Bard Manulis",
               "profile_path": null,
               "id": 38800,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43779251416c7501169b",
               "name": "Graeme Revell",
               "profile_path": "/g2Nhv2OCV8ygLYxkeDbhlqnrv7Z.jpg",
               "id": 5912,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43779251416c750116a1",
               "name": "David Phillips",
               "profile_path": null,
               "id": 65394,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43779251416c750116a7",
               "name": "Dana Congdon",
               "profile_path": null,
               "id": 56907,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5554b72f9251410d770013a8",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5554b758c3a3682083002c2d",
               "name": "Lisa Katcher",
               "profile_path": null,
               "id": 1467080,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 12.713634,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10474,
      "vote_count": 605,
      "budget": 0,
      "overview": "Film adaptation of street tough Jim Carroll's epistle about his kaleidoscopic free fall into the harrowing world of drug addiction.",
      "similar": [
         9655,
         10637,
         22881,
         8923,
         9291,
         489,
         2300,
         273481,
         323677,
         9563,
         2323,
         86130,
         13416,
         6075,
         4771,
         12163,
         15070,
         319,
         979,
         1578
      ],
      "original_title": "The Basketball Diaries",
      "runtime": 102,
      "poster_path": "/8BkedYL5LdpkyHc7JtuohMr8a9N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Island Pictures",
            "id": 3492,
            "origin_country": ""
         }
      ],
      "release_date": "1995-04-21",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "The true story of the death of innocence and the birth of an artist.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Kalvert"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Jim Carroll",
         "Bryan Goluboff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112461/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDY3MDMyNzE1N15BMl5BanBnXkFtZTcwOTg1MTcyNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leonardo DiCaprio, Lorraine Bracco, Marilyn Sokol | See full cast and crew »"],
      "reviews": [
         "I can't believe that Requiem For A Dream is on the top 250 list but this isn't. I never thought this movie would be so incredibly underrated! This was the only movie that made me completely swear off drugs. The characters are so young and vulnerable and you get to see them slowly fall into this world of drugs and violence and be completely swept away. In Requiem For A Dream, the characters start out doing some harder drugs and you barely get to see where everything goes wrong, it just seemed to be like that all of a sudden. The characters aren't as likable and I thought it ended a bit abruptly leaving us no knowledge of what is to become of the characters. I have to give it props though for some brilliant scenes like when they all go into the fetal position at the end. Basketball Diaries on the other hand gets you involved and attached to the characters. You get to watch them throw away their basketball careers and their lives. The part where Lewis is going through withdrawal is so real and horrible. And after he goes through all that pain, he throws it away and goes straight back to the drugs. This movie is so incredible, I really wish more people would see it and think the same. Shay",
         "I think 'The basketball diaries' is a realistic and very important movie. It shows the road that one walks to being addicted to drugs. From taking dope once a week to taking dope every day, every hour. Leonardo DiCaprio playes a basketballplayer, a schoolkid(Jim Carrol) who walks this path. He experiments with drugs 'till there is no way back. He gets himself in all kinds of stupid situations. He starts robbing stores, ripping off money from old ladies just to get some cash for dope. His life is beginning to look like a living hell. His basketballcoach wants to have sex with him, and when he passes out on the basketballfield due to taking a wrong kind of 'pep-pil', he gets kicked out of the basketball team and from school. From this moment on everything goes in a downward spiral for DiCaprio. An excellent scenario you would say, and it is. The acting from DiCaprio is great. We saw it earlier on in his career when he got oscar-nominated for 'What's eating gilbert grape'. A gripping drama in which he playes a disabled kid. But in 'The basketball diaries' he playes an equally difficult part. Not a lot actors would have put down this kid who's life is wrecked, and who is constantly thinking about dope as well as DiCaprio did. The statement the movie delivers is a powerfull one. Being addicted to drugs is horrible. Usually people learn about this aspect trough seminars or televisonshows such as Oprah Winfrey. But it never really gets the kind of attention and understanding from the audience as 'The Basketball diaries' delivers. The amazing performance by DiCaprio, the fact that this movie is actually based on a true story and the reality the movie is set in, 'The basketball diaries' deserves a 9 out of 10.",
         "Beings that this was Leonardo's first leading role, he was very impressive as Jim Carroll. The movie also stars Lorraine Bracco, Marc Wahlberg, James Madio and Patrick McGaw as his mother and sidekicks respectfully. As an ex-addict myself, I could relate to his story and everything he went through. The movie was so real it brought up a lot of old memories that I thought I had forgotten. I wish every young person was made to see this movie as it takes the fun and games out of even recreational drug use. Not even the strong survive. I give it two thumbs way up and my sincere thanks to Jim Carroll for fighting off his demons to write \"The Baasketball Diaries\".",
         "When you've watched plenty of movies based on some drug-addict life story you can't help compare them... I mean, the story is always the same: a guy begins having drugs for fun, or because he's boring, or just because he's young and wants to try new experiences, then he gets hooked, starts to rob or to prostitute himself, and eventually ends up in prison. That's what we see in Christiane F., El Pico, Trainspotting, Drugstore Cowboy... There may be differences in the form, and in the characters, but the content is always the same. The dinstictive feature of Basketball Diaries is that the main character actually exists: Jim Carroll, a writer-singer-performer born in NYC in the 50's. And this is supposed to be his autobiography (or the cinema adaptation of some diaries he wrote when he was a teenager, heroin-addicted). Because of that, Basketball D. is more poetic than the rest of the movies I named before, the voice over of DiCaprio's character is present all along the film, telling us about his thoughts (rather nihilistic's) , with a style near to Burroughs or Jack Kerouac, urban poetry, tough and without ornament. Maybe that's the strong point of Basketball Diaries, because movies such as Christiane F. or El Pico recreates much better what it means to be a drug-addict, they're much more explicit, more dirty, much harder... DiCaprio's performance deserves a new paragraph, 'cause it's simply astonishing. His best performance EVER, plenty of different shades. As he did in Gilbert Grape or This Boy's Life, he shows us how versatile he can be. If only he'd choose better the films he works in. My rate: 7/10",
         "This is a very good depressing movie. But, you can't make a good anti-drug movie without making it depressing. DiCaprio is brilliant. Arnie from What's Eating Gilbert Grape, Richard from The Beach, and Jim Carroll from the Basketball Diaries are about Leo's deepest characters. He is an excellent actor. The scenes that get you the most are the withdrawal scenes, and everytime he confronts his mother in the movie. This movie deserves a 10",
         "If the U.S. government wanted to win the \"war on drugs\", all they had to do was show this film in every high school in America ... a lot cheaper than running the D.E.A., I reckon. There are other films which could fit into this group; \"Midnight Express\" comes to mind. During the short time that I spent living in Toronto, I saw a shocking number of people whose lives were destroyed by drugs. I believe that the real root of the drug pandemic lies in the fact that young people don't understand the nature of hard drugs like cocaine and heroin. I take my hat off to Leo. He is a much better actor than people give him credit for being.",
         "This movie was Leonardo's first leading role, and he does great work as Jim Carroll. The movie cheats him from time to time, but he gives a consistent and believable performance. He is helped by an excellent supporting cast, especially Mark Wahlberg and Lorraine Bracco. Kids who think drugs are fun and games should see this movie, which gets extra credit for not glamorizing drugs.",
         "An uncompromising script and a solid performance from Leonardo Di Caprio help make THE BASKETBALL DIARIES a powerful and memorable film experience. Leo plays Jim Carroll, a high school student with a love of basketball and a flare for writing whose life goes right down the toilet when he becomes a heroine addict. Yes, perhaps Leo gets hooked a little too quickly but everything that happens to him after he gets hooked is totally real. Along with CLEAN AND SOBER, this movie so clearly and honestly demonstrates where drug addiction can take you...how nothing else becomes important but how and where that next high is coming from. There is one harrowing scene after another here. We see Jim returning to his mother (Lorraine Bracco) after being kicked out of the house and we see Jim turn from begging child to threatening thug in a matter of seconds, a scene brilliantly performed by DiCaprio. We see Jim and his friends beat up an old lady for her purse and we even see Jim prostitute himself with a man in order to get money. It's a frightening and realistic spiral downward that Jim takes and he does make it back, but it is important to remember when watching this film that a lot don't. DiCaprio gets solid support from future star Mark Wahlberg, Bruno Kirby, Jr., Juliette Lewis, and Michael Imperioli. A harrowing film experience that will not be forgotten once the credits roll.",
         "There is a type of disease associated with St. Vitus and this film qualifies in the comparison because it's quirky, fast, and it never stops moving. Director Scott Kalvert gives the movie a 'look' that makes the Manhattan of the period when it supposedly takes place, believable. Leonardo DiCaprio was at his best in the film. His performance is very nuanced and in your face, at the same time. Mr. DiCaprio makes you feel the pain Jim is going through; he is a lost soul. Not being a fan of Mark Wahlberg, I must confess that in this film, be it because of the direction, or whatever, he shines, as Mickey. As Jim's mother, Lorraine Bracco has never been better in anything she has been in recent memory. Bruno Kirby is perfectly creepy as the coach of St. Vitus High School. As far as the connection with the Columbine School massacre, since the sequence where Jim is involved is a dream, it's easy to understand how the twisted minds of the ones responsible for the killings would have taken this scene as a model for their terrible crime.",
         "May I say, that I was impressed with this movie. It shows the truth of drugs and what they can do to you. After I saw this movie, I went out and found the book and read it. It's more sad then the movie, but still seeing Leonardo's performance is very effective. Jim Carrol is a high school basketball player who once in a while gets stoned with his friends. But eventually he becomes brutally addicted to the drugs and looses everything he has worked for. To Leonardo, you did good. 8/10"
      ],
      "genres": [
         "Biography",
         "Crime",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Island Pictures"
      ],
      "summaries": [
         "Film adaptation of street tough Jim Carroll's epistle about his kaleidoscopic free fall into the harrowing world of drug addiction. As a member of a seemingly unbeatable high school basketball squad, Jim's life centers around the basketball court and the court becomes a metaphor for the world in his mind. A best friend who is dying of leukemia, a coach (\"Swifty\") who takes unacceptable liberties with the boys on his team, teenage sexual angst, and an unhealthy appetite for heroin -- all of these begin to encroach on young Jim's dream of becoming a basketball star. Soon, the dark streets of New York become a refuge from his mother's mounting concern for her son. He can't go home and his only escape from the reality of the streets is heroin for which he steals, robs and prostitutes himself. Only with the help of Reggie, an older neighborhood friend with whom Jim \"picked up a game\" now and then, is he able to begin the long journey back to sanity.",
         "Jim Carroll is a high school basketball player. His life centers around the basketball, and his dream is being a basketball star. Once in a while he gets stoned with his friends, and step by step, he falls into the dark world of crime and drugs. Once his mother expelled him out of the house, he goes into the streets of New York, and together with his friends they take drugs for which they steal, rob and even kill. As the time pass, Jim's situation becomes worse. It looks like he will never get out from the his drug addiction."
      ],
      "budget": 0
   },
   "movielensId": 147,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-21",
      "dvdReleaseDate": "2003-07-29",
      "directors": ["Scott Kalvert"],
      "runtime": 102,
      "movieId": 147,
      "title": "The Basketball Diaries",
      "mpaa": "R",
      "actors": [
         "Leonardo DiCaprio",
         "Lorraine Bracco",
         "James Madio",
         "Mark Wahlberg",
         "Bruno Kirby",
         "Patrick McGaw",
         "Juliette Lewis",
         "Michael Imperioli",
         "Ernie Hudson",
         "Manny Alfaro",
         "Cynthia Daniel",
         "Brittany Daniel"
      ],
      "imdbMovieId": "0112461",
      "originalTitle": "The Basketball Diaries",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": ["W5eVnwe6Pxs"],
      "plotSummary": "Film adaptation of street tough Jim Carroll's epistle about his kaleidoscopic free fall into the harrowing world of drug addiction.",
      "tmdbMovieId": 10474,
      "avgRating": 3.60039,
      "releaseYear": "1995",
      "numRatings": 5065,
      "posterPath": "/8BkedYL5LdpkyHc7JtuohMr8a9N.jpg"
   }
}