{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "release from prison",
            "id": 3398
         },
         {
            "name": "on the run",
            "id": 10562
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "bank robbery attempt",
            "id": 199080
         }
      ],
      "imdb_id": "tt0118702",
      "video": false,
      "title": "Best Men",
      "recommendations": [
         34601,
         174344
      ],
      "backdrop_path": "/qEDt3mhtPV5vOKJkrq6wnRW5kMn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Buzz",
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac029",
               "name": "Dean Cain",
               "profile_path": "/cICjOmo5KZWdfJLBvIExDE6Ma5f.jpg",
               "id": 21721,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Taddy",
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac02d",
               "name": "Andy Dick",
               "profile_path": "/ebNRu8oV7Ifv5aoP23UyNnx0lZS.jpg",
               "id": 43120,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac031",
               "name": "Sean Patrick Flanery",
               "profile_path": "/1xgb9WblosYkvTGoh0yDuZII9ok.jpg",
               "id": 54789,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sol",
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac035",
               "name": "Mitchell Whitfield",
               "profile_path": "/xvLWnBsTbUmW9KcDkH7pvi5W6v0.jpg",
               "id": 19505,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hope",
               "gender": 1,
               "credit_id": "52fe47fb9251416c750ac039",
               "name": "Drew Barrymore",
               "profile_path": "/y8GKPHsBXVGIGBdDzdNxjm0IbKF.jpg",
               "id": 69597,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Edie",
               "gender": 1,
               "credit_id": "52fe47fb9251416c750ac03d",
               "name": "Kathryn Joosten",
               "profile_path": "/kkPEyfRYwrbSdQQwOwQo8qFTiKP.jpg",
               "id": 106935,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Jesse",
               "gender": 2,
               "credit_id": "5481bb2fc3a36829ae005aaf",
               "name": "Luke Wilson",
               "profile_path": "/n7CRA7h1z3FVOzBJ5EjfSrPQbvl.jpg",
               "id": 36422,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Sheriff Phillips",
               "gender": 2,
               "credit_id": "5481bb3dc3a36817a50062b7",
               "name": "Fred Ward",
               "profile_path": "/ybRDXraWsQ6zyqPUIAWITwuOWug.jpg",
               "id": 10430,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Hoover",
               "gender": 2,
               "credit_id": "5481bb4f9251414d21006051",
               "name": "Raymond J. Barry",
               "profile_path": "/k4WDNgYHOUgRaPQIsZUPUxl1lO6.jpg",
               "id": 10361,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47fb9251416c750ac025",
               "name": "Tamra Davis",
               "profile_path": "/6bKtaisEKoCI6NcmTkJfGRngbc4.jpg",
               "id": 57691,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac043",
               "name": "Mark Mothersbaugh",
               "profile_path": "/AoQ4Prrg039LlQiwBNANXn8VVkg.jpg",
               "id": 5666,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac049",
               "name": "James Glennon",
               "profile_path": null,
               "id": 35511,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac055",
               "name": "Tracy Fraim",
               "profile_path": null,
               "id": 144129,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47fb9251416c750ac05b",
               "name": "Art Edler Brown",
               "profile_path": null,
               "id": 1013330,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47fb9251416c750ac061",
               "name": "Art Edler Brown",
               "profile_path": null,
               "id": 1013330,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac067",
               "name": "Brad Krevoy",
               "profile_path": null,
               "id": 51702,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac06d",
               "name": "Bradley Jenkel",
               "profile_path": null,
               "id": 57871,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47fb9251416c750ac073",
               "name": "Christopher Buchanan",
               "profile_path": null,
               "id": 80425,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe47fb9251416c750ac079",
               "name": "Deborah Ridpath",
               "profile_path": null,
               "id": 1013469,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac07f",
               "name": "Tracy Fraim",
               "profile_path": null,
               "id": 144129,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac085",
               "name": "Jeff Ivers",
               "profile_path": null,
               "id": 58202,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47fb9251416c750ac08b",
               "name": "Steven Stabler",
               "profile_path": null,
               "id": 51703,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47fb9251416c750ac091",
               "name": "Arianne Phillips",
               "profile_path": null,
               "id": 32797,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "566610df92514179d4000ed1",
               "name": "Kim Davis-Wagner",
               "profile_path": null,
               "id": 961165,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.022227,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19952,
      "vote_count": 9,
      "budget": 1000000,
      "overview": "Four tuxedo clad men showing up at a penitentiary to meet a friend who has just been released after three years in prison and is going straight from the jail to marry his girlfriend. En route to the wedding, one of the men asks to stop by a bank to pick up some cash. As it turns out, he is a wanted bank robber who uses Shakespeare passages during his robberies and thus has become known as \"Hamlet\". Soon all five men are caught up in the bank and involved in the robbery as they end up in a hostage situation. The hostage negotiator shows up who turns out to be Hamlet's father.",
      "similar": [
         8346,
         858,
         634,
         693,
         93456,
         49519,
         112160,
         437557,
         24684,
         258480,
         43923,
         427900,
         9261,
         455,
         450438,
         141,
         948,
         5176,
         260346,
         242224
      ],
      "original_title": "Best Men",
      "runtime": 90,
      "poster_path": "/fsr7E30XwGmW7UIOpVuAt2tcHYY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Rank Organisation",
            "id": 364,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Motion Picture Corporation of America (MPCA)",
            "id": 11061,
            "origin_country": ""
         },
         {
            "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
            "name": "Orion Pictures",
            "id": 41,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "A comedy thriller about four men, a wedding and everybody's funeral.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tamra Davis"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Art Edler Brown",
         "Tracy Fraim"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118702/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkyNDg2NzM0N15BMl5BanBnXkFtZTcwMjEwMTAyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Dean Cain, Andy Dick, Sean Patrick Flanery | See full cast and crew »"],
      "reviews": [
         "My friend bought this movie out of the $5 bin at Walmart for a laugh. I was just expecting a stupid, mindless romantic comedy. What I found was a brilliant piece of work. The script is quite impressive. The story actually focuses on the \"Best Men\" like it says, not on the bride and groom. The whole film is chock full of lovable (and not so lovable) vibrant characters from nerdy little Teddy to Billy, the classical romantic hero, to Buzz the top-notch soldier with a heart of gold to Sol the lawyer you don't want to trust. Why had I never heard of this movie before?!? This definitely deserves a place on the shelf for anyone who loves comedy and good writing.",
         "Great movie..it has comedy, drama, unexpected events, love and real interaction among friends..people you know slightly and total strangers who interact and mesh well in the storyline. Good cast; and for all of you Dean Cain fans, he shows a buff chest. Drew adds an interesting twist to the bride-to-be. Luke Wilson is again great in his role, he gives real depth to his role. The male stars interact like they actually know their roles and the little quirks in their relationships just seems to draw you more into the story and Drew is believable as the bride to be and has a friendship with each of the 5 male stars. I seldom recommend movies, but this is definitely one I plan on seeing a few times just because it was written so well I know I probably missed a few things the first time.",
         "The movie started out very promisingly and I thought that it was going to be a hilarious comedy. But it turned out to be better than that. The characters of each person have been acted out flawlessly. The setting is good. I can see why some people did not like it. They expected a comedy and got a drama instead. It has a bit of comedy in it, but I guess people were expecting more. The lines recited from Shakespeare are extremely well chosen and just right for the movie. This, by the way, encouraged me to read Hamlet. The role of Drew Barrymore is small, but significant. It was quite funny seeing the whole public against the FBI. The ending was quite unexpected. Anyway, I think that this is a beautiful movie and should be seen with an open mind.",
         "Never heard of this movie, but it was the best bet on the box. Had a thoroughly good time! Excellent writing, direction and performances. Nothing unpredictable - the Hamlet tie-in says it all, even the characters know they are playing out a tragedy and tell each other. But the predictability of the plot comes from the inevitability of the scenario, which in turn comes from the characters. If the resolutions are a little trite, its because its basically a tragedy played out on an action comedy set and there isn't time to beat about the bush. If you liked the wit and love of life in Strictly Ballroom, you'll like this.",
         "When I rented this movie, I was thinking that it would be a comedy. Instead, this movie turned out to be more of a drama. I was very surprised with this movie and even a little curious as to why I had never heard of it before seeing it at the video store. Perhaps it is because it isn't a comedy like most people would expect. I really liked this movie. It isn't a vehicle for Drew Barrymore, if that is what you are expecting, but her part is one that she does well in. Dean Cain also turns in a worthy performance. I think most will be surprised at how touching and even moving this movie is if they give it a chance.",
         "I too rented this movie because I am a Drew Barrymore fan, but wasn't sad that she had a relatively small part. That's not a dis on Drew (she did just fine), but more a commentary on how good a script it was. The acting was all around solid with Dean Cain leading the pack... and surprise, surprise, Andy Dick giving his comic character some interesting depth. Did this movie get a theatrical release? If not, it's a shame... it's one of those small indie films that could really find an audience.",
         "An entertaining movie from beginning to end. It delivers a clever story line with a blend of humor, drama and tragedy reminiscent of the TV series M*A*S*H. I was a bit surprised by the relatively low average score, but the statistics indicate that a healthy percentage of viewers found the story compelling as I did.",
         "There is a bank robber known as Hamlet working the area who quotes Shakespeare during his robberies. Four friends Buzz (Dean Cain), Teddy (Andy Dick), Billy (Sean Patrick Flanery), and Sol (Mitchell Whitfield) have come to pick up Jesse (Luke Wilson) from prison released after around 3 years. They are all dressed in tuxedos going to Jesse's wedding with Hope (Drew Barrymore). Billy is dropped off at the bank who turns out to be the masked bandit Hamlet. Then the rest of the guys go into the bank. They are surprised by Billy's bank robbery, and join in. Sheriff Phillips (Fred Ward) surrounds the group, and turns out to be Billy's dad. This is a poor copy of 'Dog Day Afternoon'. Billy is way too pathetic. The FBI is way too ridiculous. The other people in the group makes no sense. It's trying to be a quirky action comedy. Except that it's more stupid than funny. And it's a horrible idea to have Andy Dick who is hamming it up for the camera. I think the filmmakers are attempting at a Tarantino-like DDA movie but they don't have the skills to pull it off. It comes off as a weak homage to the great movie.",
         "This movie tells us an interesting, unusual, and uneven tale of angst, love, disaffection, and friendship. The groom, and four guys in the wedding party, are on their way to the wedding when one of them (who turns out to be the son of the town sheriff) decides to rob a bank, and all of them get involved. It is hard to imagine a more bizarre start to a story. The screenplay could have been a lot better; the characters could have been a lot better developed; the story could have been a lot more realistic. But in spite of all that, each time I tried to turn it off, something happened that kept me going, all the way to the end! There's a lot of movies that can't manage that trick. I wouldn't spend a lot of money to see it, but on the other hand, if it turns up on cable, and you want a change of pace, it's definitely worth a try. It might just hit you the right way.",
         "There are some movies so bad,that when you watch them on video or TV,you wonder, \"Why did they bother with this?\" \"Why didn't they shelve it?\" That's what I wondered when I caught this unoriginal,cliché' filled movie on late night TV. The first hour of this movie (including commercials) is truly a mess and completely unbelievable. While I can see the possibility of a man getting out of jail and going to his waiting bride, I could not buy how he and his friends end up helping their buddy \"Hamlet\" (Billy)in the bank and keeping their fellow towns-people hostage. Even more ridiculous is that because the guys are \"nice\",they end up basically helping them too. Dean Cain is really the only convincing male actor of the five (at least in the first 1/2). Although his coming out of the bank,with guns blazing is just plain stupid,along with the fact that he's wearing guns under his tuxedo in the first place. Andy Dick seems to only be able to play one character his whole career,a strange,nerdy kind of Matthew from \"News Radio\" boy-man. He really has no place here and his \"tell off the wife over the phone\" scene has been done way too many times in movies and TV shows,it's completely unoriginal. As is most of this blatant small town rip-off of \"Dog Day Afternoon\" (which they at least acknowledge their ripping off). We get a sheriff who's the father of wanted criminal \"Hamlet\". We also get the cliché' of the crowd cheering for \"Hamlet\" like he's some kind of Robin Hood folk hero! \"I went to high school with that guy!\" Says one of them,then they're chanting \"Hamlet\" over & over. So,we get the \"you we're never there for me dad\" plot,which has also been done in movies TV shows. Which made it hard to be sympathetic,but not just in that case,I couldn't sympathize with any of these characters. Even after finding out about their personal downfalls. The Vietnam vet is so much a cartoon that what could have been a great character is wasted. As are the acting talents of Drew Barrymore. Her presence in all this is spread quite thin. Then there's the expected FBI converging on the town,with the leader who just wants to blast the bad guys away. He and the sheriff are of course at at odds with each other and the other big city FBI men make fun of the small town's people. \"They should be used to shot gun weddings here.\" (Referring to Barrymore and her boyfriend wanting to get married in the middle of a hostage situation.) I really only got into the movie when the more truthful and real elements came into play. When Andy is the first to get shot and then the FBI shooting up Cain and \"Hamlet's\" get away bus in a scene somewhat similar to the ending of Clint Eastwood's,\"The Gauntlet\". \"Hamlet\" and father make amends just before that and Dad let's his son get away. (Oh please!) Then the final two biggest rip off's of all. Barrymore and soon to be husband are given the stolen money by \"Hamlet\" and they fly of in the Vietnam Vet's helicopter and escape scott free. Shades of \"D.B. Cooper\"! Dean Cain and \"Hamlet\" then have one bullet each in their guns after the bus crashes and their all shot up. Just like the final scene in \"Butch Cassidy and The Sundance Kid\" they come running out together and Cain takes down the leader of the FBI,who he swore he'd take out. All the supposed \"reasons\" these characters have for letting themselves into this mess are contrived and flimsy at best. I would say if this movie had been made a long time ago and had there not been \"Dog Day Afternoon\",it might seem more plausible but even the intense last half,which did hold my interest,is not enough to like this movie. Four stars for the final,intense attempted getaway chase scene and \"Hamlet's\" very well spoken Shakespearian quotes,which do fit in here and the movie thankfully taking a needed turn into reality. Otheriwse,I'd never bother with \"Best Men\" again. (END)"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Motion Picture Corporation of America (MPCA)",
         "Orion Pictures",
         "Rank Organisation, The"
      ],
      "summaries": ["The film opens with 4 tuxedo clad men showing up at a penitentiary to meet a friend who has just been released after three years in prison and is going straight from the jail to marry his girl friend. En route to the wedding, one of the men asks to stop by a bank to pick up some cash. As it turns out, he is a wanted bank robber who uses Shakespeare passages during his robberies and thus has become known as \"Hamlet\". Soon all five men are caught up in the bank and involved in the robbery as they end up in a hostage situation. The hostage negotiator shows up who turns out to be Hamlet's father. As the men are all known to those being robbed, this quirky comedy takes a left turn as their hostages all work to support the men."],
      "budget": 10000000
   },
   "movielensId": 1473,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "2002-04-16",
      "directors": ["Tamra Davis"],
      "runtime": 90,
      "movieId": 1473,
      "title": "Best Men",
      "mpaa": "R",
      "actors": [
         "Dean Cain",
         "Andy Dick",
         "Sean Patrick Flanery",
         "Mitchell Whitfield",
         "Drew Barrymore",
         "Kathryn Joosten",
         "Luke Wilson",
         "Fred Ward",
         "Raymond J. Barry"
      ],
      "imdbMovieId": "0118702",
      "originalTitle": "Best Men",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["YrMM2d20cAw"],
      "plotSummary": "Four tuxedo clad men showing up at a penitentiary to meet a friend who has just been released after three years in prison and is going straight from the jail to marry his girlfriend. En route to the wedding, one of the men asks to stop by a bank to pick up some cash. As it turns out, he is a wanted bank robber who uses Shakespeare passages during his robberies and thus has become known as \"Hamlet\". Soon all five men are caught up in the bank and involved in the robbery as they end up in a hostage situation. The hostage negotiator shows up who turns out to be Hamlet's father.",
      "tmdbMovieId": 19952,
      "avgRating": 2.90496,
      "releaseYear": "1997",
      "numRatings": 242,
      "posterPath": "/fsr7E30XwGmW7UIOpVuAt2tcHYY.jpg"
   }
}