{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "ex-boyfriend",
            "id": 1594
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "african american",
            "id": 11243
         }
      ],
      "imdb_id": "tt0119572",
      "video": false,
      "title": "Love Jones",
      "recommendations": [
         20322,
         16158,
         28121,
         22067,
         54982,
         29473,
         29464,
         25462,
         16560,
         19848,
         29461,
         37964,
         34322,
         16162,
         39310,
         31016,
         60013,
         8291,
         32035,
         14544
      ],
      "backdrop_path": "/95T3mZxzl82XyNg0SfDFTME2Z4q.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Darius Lovehall",
               "gender": 2,
               "credit_id": "52fe4541c3a368484e04fb87",
               "name": "Larenz Tate",
               "profile_path": "/ApN0l0NF1fUp61PwffW09ZqEUMW.jpg",
               "id": 18291,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nina Mosley",
               "gender": 1,
               "credit_id": "52fe4541c3a368484e04fb8b",
               "name": "Nia Long",
               "profile_path": "/q01J3WgNd96GR7CcSxx56N8qwSZ.jpg",
               "id": 9781,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Savon Garrison",
               "gender": 2,
               "credit_id": "52fe4541c3a368484e04fb8f",
               "name": "Isaiah Washington",
               "profile_path": "/kK4nEwvY0MFwCsQ17E0w0El7G9P.jpg",
               "id": 21353,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Hollywood",
               "gender": 2,
               "credit_id": "52fe4541c3a368484e04fba3",
               "name": "Bill Bellamy",
               "profile_path": "/khQmLcjaaIgVQr5d91drXVnMhzF.jpg",
               "id": 77896,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Josie Nichols",
               "gender": 1,
               "credit_id": "52fe4541c3a368484e04fba7",
               "name": "Lisa Nicole Carson",
               "profile_path": "/tBSQsDwvA7G4hLzsHwE2wCi2Yzy.jpg",
               "id": 55274,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Tracey Powell",
               "gender": 0,
               "credit_id": "52fe4541c3a368484e04fbab",
               "name": "Marie-Françoise Theodore",
               "profile_path": "/khipwBSRSHbeYsIAZbla8mR4UFg.jpg",
               "id": 1142326,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4541c3a368484e04fb95",
               "name": "Theodore Witcher",
               "profile_path": null,
               "id": 120515,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4541c3a368484e04fb9b",
               "name": "Theodore Witcher",
               "profile_path": null,
               "id": 120515,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.277088,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27322,
      "vote_count": 19,
      "budget": 10000000,
      "overview": "Darius Lovehall is a young black poet in Chicago who starts dating Nina Moseley, a beautiful and talented photographer. While trying to figure out if they've got a \"love thing\" or are just \"kicking it,\" they hang out with their friends, talking about love and sex. Then Nina tests the strength of Darius' feelings and sets a chain of romantic complications into motion.",
      "similar": [
         979,
         3134,
         2149,
         11826,
         4771,
         80752,
         281,
         339692,
         281957,
         395834,
         507,
         74997,
         226,
         2142,
         527,
         429733,
         8012,
         22705,
         298312,
         9093
      ],
      "original_title": "Love Jones",
      "runtime": 104,
      "poster_path": "/ruBMPmpsm9DOmq3YLlfpdEJnMoW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Addis Wechsler Pictures",
            "id": 4665,
            "origin_country": ""
         }
      ],
      "release_date": "1997-03-14",
      "vote_average": 8.2,
      "belongs_to_collection": null,
      "tagline": "Get Together. Fall Apart. Start Over.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Theodore Witcher"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["Theodore Witcher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119572/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2NjYxMDczNV5BMl5BanBnXkFtZTcwODAwODAyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Larenz Tate, Nia Long, Isaiah Washington | See full cast and crew »"],
      "reviews": [
         "Love Jones explores the passionate and intelligent sides of love, and it does so deliciously. Larenz Tate and Nia Long deliver performances as understated as the film's smart jazz and R&B soundtrack -- their approaches give their characters dimension and depth. But make no mistake -- this film offers elements of entertainment and political correctness in director Theodore Witcher's offering of multi-layered African-American characters. If comparisons must be made, Love Jones compares to the best in Woody Allen's Annie Hall and Manhattan, as those films explore desire and passion through words in addition to physical attractions. Recommend this film to the scores of filmgoers who missed its limited theatrical release -- better yet, serve it up as a first course conversation starter during your next gathering with friends. It's sure to spark equally passionate discussion, and that's always a good thing.",
         "This is in my top 5 when I name my favorite movies of all time. There wasn't a single character in this movie that didn't act more than they were. The hardest role in a movie may BE to perhaps, play someone that you'd see everyday, or someone that you'd be everyday, and they pull it off so naturally. It just reminded me SO much about how me and my peeps would kick it on weekends...one couch...snacks, and crazy stories and philosophies on life. I love nights like that. To add to it, who WOULDN'T want to have the type of relationship that Nia and Larenz endured? Good or Bad...it was so sexy and warm and black and beautiful...Definitely a keeper, and PACKED with unforgettable quotes that ALL can relate to. Definitely somethin for the movie collection.",
         "One of my favorite movies of all time. Beautifully done, well written and well acted. It portrayed 20 something blacks in a way I don't think has yet been duplicated, and the dialog? Hmmmm, so stimulating. Makes me want to find love like that........",
         "Love Jones cleverly portrays young African-American men and women in a clear, positive, realistic sense. I feel that all of the actors and actresses were magnificent and really did a great job at capturing the mood. Nia Long and Larenz Tate worked well together and I hope to see more work from the two of them. As a matter of fact all of the actors/actresses did such a fine job it would be great to see another romantic-comedy from them. This movie can be compared to most any well-written, romantic comedy. If you have not seen this movie already I strongly recommend that you do, it can definitely give you another perspective on life and love.",
         "This movie features some of the best ensemble work I've seen in film or on stage. The actors play off each other with a skill and vivacity that in no way can be achieved through editing. \"Love Jones\" a good story, period. But it is also an excellent portrayal of the urban, middle-income, twenty-something African-American set that is not often seen.",
         "This is my favorite love story it has every element that a good love story should have. Poetry, jazz, friendships the ups and downs in a relationships. Finally a movie that shows positive aspects of the black community. Larenz Tate was great I can't picture anyone else playing the role of Darius. He recited that poem like he had written it himself and meant every word. I own this movie and if I had the time I would watch it everyday it always makes me feel better and that's what a good movie should do. Also, the character Savon could not had been any better dealing with the subject of marriage. We would all like to find a Darius out there but most of us just settle for watching this movie. My vote is 10/10",
         "After viewing this movie, lets say, around 8 times, the story line has never bored me. Each character has their own distinct personality and their own views of \"love\". This movie has timeless, almost realistic, love lessons. Filled with philosophies on love, a jazzy soundtrack, and great actors is why I would call it a classic.",
         "It's a shame this movie didn't get more play in theatres. It's a rich, textured love story with believable, all-too-human characters, who are too busy gaming and protecting their hearts to recognize The Real Thing when they experience it. One of the most pleasurable aspects of this movie is its setting in Chicago, among hip, artistic, literate, middle-class African-Americans who discuss poetry, music and literature. Another is his Royal Fineness, Larenz Tate -- and if you are even half a fan of his, you NEED to see this film! His boyish cockiness and vulnerability are perfect for the role of Darius. Nia Long also shines as Nina, who longs to tell Darius she loves him but is afraid the break \"the Rules.\" A great movie to watch curled up on the couch with your sweetie!",
         "I think it's about 3 years ago when I saw this movie. Accidentally I revisited the info-site for it here and immediately I felt good again! I remembered seeing this movie and loving life again! It showed me I could find love and what-do-you-know?? I have a boyfriend for a year and a half now and love is definitely there..",
         "I think this is one of the best movies of all time. I just think it shows realistically what romance and especially black romance is all about. Would love to know what others think as well. The acting was just out done. Where is Tate anyway? It has been awhile since I have seen him in anything, however I think he has out did his acting performance in this movie!"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Addis Wechsler Pictures"],
      "summaries": ["Darius Lovehall is a young black poet in Chicago who starts dating Nina Moseley, a beautiful and talented photographer. While trying to figure out if they've got a \"love thing\" or are just \"kicking it,\" they hang out with their friend, talking about love and sex. Then Nina tests the strength of Darius' feelings and sets a chain of romantic complications into motion."],
      "budget": 10000000
   },
   "movielensId": 1477,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-03-14",
      "dvdReleaseDate": "1999-07-27",
      "directors": ["Theodore Witcher"],
      "runtime": 104,
      "movieId": 1477,
      "title": "Love Jones",
      "mpaa": "R",
      "actors": [
         "Larenz Tate",
         "Nia Long",
         "Isaiah Washington",
         "Bill Bellamy",
         "Lisa Nicole Carson",
         "Marie-Françoise Theodore"
      ],
      "imdbMovieId": "0119572",
      "originalTitle": "Love Jones",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["xNMoQ_Cqt4E"],
      "plotSummary": "Darius Lovehall is a young black poet in Chicago who starts dating Nina Moseley, a beautiful and talented photographer. While trying to figure out if they've got a \"love thing\" or are just \"kicking it,\" they hang out with their friend, talking about love and sex. Then Nina tests the strength of Darius' feelings and sets a chain of romantic complications into motion.",
      "tmdbMovieId": 27322,
      "avgRating": 3.34719,
      "releaseYear": "1997",
      "numRatings": 409,
      "posterPath": "/ruBMPmpsm9DOmq3YLlfpdEJnMoW.jpg"
   }
}