{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "male friendship",
            "id": 3230
         },
         {
            "name": "van",
            "id": 4580
         },
         {
            "name": "dublin",
            "id": 4729
         },
         {
            "name": "snack bar",
            "id": 6618
         },
         {
            "name": "soccer",
            "id": 13042
         },
         {
            "name": "unemployment",
            "id": 156052
         }
      ],
      "imdb_id": "tt0118064",
      "video": false,
      "title": "The Van",
      "recommendations": [
         58777,
         57565,
         77368,
         43028,
         37673,
         78281,
         32069,
         30278,
         43780,
         82550,
         29451,
         39428,
         71445,
         27142,
         337114,
         115553,
         79645,
         75364,
         120393,
         42719
      ],
      "backdrop_path": "/fQkujNO9q5QUW3RSMVfJJzP4EoO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe44919251416c750395cb",
               "name": "Colm Meaney",
               "profile_path": "/irPAowqDk7llCvm8uyCJuBClzJw.jpg",
               "id": 17782,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "'Bimbo'",
               "gender": 2,
               "credit_id": "52fe44919251416c750395cf",
               "name": "Donal O'Kelly",
               "profile_path": null,
               "id": 70684,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe44919251416c750395d3",
               "name": "Ger Ryan",
               "profile_path": "/s28QyTEZsflL7W7BvemRseMJqVt.jpg",
               "id": 70685,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mary",
               "gender": 0,
               "credit_id": "52fe44919251416c750395d7",
               "name": "Caroline Rothwell",
               "profile_path": null,
               "id": 70686,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "5879d3f59251415499005207",
               "name": "Brendan O'Carroll",
               "profile_path": "/nwnNJnn9Paj2RGaDJ9cw6sE7KRr.jpg",
               "id": 112827,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Crushed Girl",
               "gender": 1,
               "credit_id": "5a959acfc3a368117300084b",
               "name": "Eileen Walsh",
               "profile_path": "/vQfrnNfyQDiwc1pys052Hg8zSqy.jpg",
               "id": 53999,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44919251416c750395dd",
               "name": "Stephen Frears",
               "profile_path": "/8IewTBLTPujw1t1MwpXba8cCXOU.jpg",
               "id": 3224,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c750395e3",
               "name": "Roddy Doyle",
               "profile_path": null,
               "id": 70144,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c750395e9",
               "name": "Roddy Doyle",
               "profile_path": null,
               "id": 70144,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe44919251416c750395ef",
               "name": "Lynda Myles",
               "profile_path": null,
               "id": 50872,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c750395f5",
               "name": "Mark Shivas",
               "profile_path": null,
               "id": 55982,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c750395fb",
               "name": "Eric Clapton",
               "profile_path": "/5Y9eRWlz7AMR4eofCm6OVSZkc1s.jpg",
               "id": 2585,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c75039601",
               "name": "Richard Hartley",
               "profile_path": null,
               "id": 39023,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c75039607",
               "name": "Oliver Stapleton",
               "profile_path": "/wfzgRB2LbfKvKJ50NZYebi9nv1c.jpg",
               "id": 16425,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c7503960d",
               "name": "Mick Audsley",
               "profile_path": null,
               "id": 294,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.757717,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 11844,
      "vote_count": 19,
      "budget": 0,
      "overview": "Set in \"Barrytown\", a fictitious working-class quarter of Dublin. \"Bimbo\" Reeves gets laid off from his job. With his redundancy, he buys a van and sells fish and chips with his buddy Larry. Due to Ireland's surprising success at the 1990 FIFA World Cup, their business starts off well, but the relationship between the two friends soon becomes strained as Bimbo behaves more like a typical boss.",
      "similar": [
         21641,
         1611,
         457917,
         12229,
         62441,
         25432,
         8344,
         302324,
         203574,
         1881,
         53818,
         1914,
         289229,
         13630,
         218837,
         255714,
         203568,
         360134,
         168771,
         102863
      ],
      "original_title": "The Van",
      "runtime": 100,
      "poster_path": "/ezSLtI2l3g7iB0YXzkceMytfrAN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
         "name": "Fox Searchlight Pictures",
         "id": 43,
         "origin_country": "US"
      }],
      "release_date": "1996-05-11",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/9oFt5bWxS0oRVHGFJG5rrbb4lWl.jpg",
         "name": "Barrytown Trilogy",
         "id": 207952,
         "poster_path": "/cccGPuXNUJyrM3P8SEltSlXEwxY.jpg"
      },
      "tagline": "A comedy About Friends, Family and Fish.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stephen Frears"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Roddy Doyle",
         "Roddy Doyle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118064/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczOTAzNzg0Ml5BMl5BanBnXkFtZTcwOTAwNzAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Colm Meaney, Donal O'Kelly, Ger Ryan | See full cast and crew »"],
      "reviews": [
         "In November 1989, in Ireland, the baker Bimbo (Donal O'Kelly) is fired from his job and he does not feel comfortable with the situation. His best friend Larry (Colm Meaney), who is also unemployed and living with his low welfare with his wife Mary (Caroline Rothwell) and their children, is resigned with his situation and tries to console his friend. But Bimbo is supported by his wife Maggie (Ger Ryan) and decides to buy an abandoned van without engine in a junkyard to open a business of hamburger, French fries and fried codfish and invites Larry to work with him. Soon they have financial success but their friendship is compromised. \"The Van\" is a dramatic comedy directed by Stephen Frears that has a funny and exciting beginning and an unpleasant conclusion. The friendship of Larry and Bimbo is beautiful to see and their success is what every viewer expects to see. However, the final twist with the attitude of the big-mouth and envious Larry is disappointing. Maybe the bitter story is more realistic this way but I would prefer a happy ending, valuating friendship and hard work. My vote is five. Title (Brazil): \"A Van\" (\"The Van\")",
         "OK, apparently, Colm Meaney (happy birthday, Colm!) is best known for a \"Star Trek\" role, but I always associate him with his roles in adaptations of Roddy Doyle novels. They are \"The Commitments\", \"The Snapper\" and \"The Van\". The last one casts as a down-on-his-luck Dubliner who with his friend finds a grimy abandoned van and opens it up. While I mostly liked the movie, it did have the problem of showing the Irish drinking and moping about life's travails; is that the only way to stereotype people from the Emerald Isle? But otherwise, I found it a pretty good look at working-class life in Ireland. Once again, Stephen Frears added another accomplishment to his resume, recently continued with \"The Queen\". I recommend it, and see whether or not you want to get a bite to eat from any random van after watching this.",
         "The Van, a 1996 Stephen Frears film who would go on to much better things, takes on the ideas of desperate, inglorious situations and scenarios, such as unemployment, and wraps them up into packages ready to be delivered as comedy. There is nothing at all funny about the situation the two leads in the film find themselves in, but there is something distinctly charming about the way in which they deal with it. While not essentially British, a given thanks to the over emphasis on how wonderful it was for the characters to witness the Irish football team pull back a goal and hold on for a draw against the English, while most of the other matches go unnoticed. However, it is directed by an Englishman and the film does posses rather a few items that were written about in regards to some growing fears and concerns simmering at the time within the British film industry, with particular attention to the comedy genre. If we recall Claire Monk's writings in the late 1990s, we might think of films such as Brassed Off and The Full Monty as being films depicting jobless British males turning to alternate methods of money making to get by; effectively rendering the crisis of post-industrialism (closure of mines and steel mills) as a crisis of masculinity. She also writes about these films transitioning problematic situations into comic solutions. These ideas and scenarios might be applicable to The Van, a film that spins job-loss and perceived men in crisis into a series of jokes and gags; a film that, like said examples, see the leads turn to either an entertainment or cultural supply and demand industry, in which they eventually come to relish. One of the two leads in The Van is Bimbo (O'Kelly), a man who has lost his job and gets by off of his redundancy money. The other is Larry (Meaney), and between them, they aim to get a portable fast food outlet up and running. Whilst it's not about becoming strippers or brass-band musicians, it is essentially about two men turning to cooking and meal preparation by way of getting by. Its set up; a male panic, followed by a lot of sitting around complete with head scratching before hitting upon an idea to move into what is a form of the cooking industry, sees the two leads adopt a culinary position; something that Monk may have been alluding two when she describes early 1990s 'new men' as having to now share the once sole motherly burdens; this of course includes cooking and meal preparation. Yes, it's a fast-food van but the progressive realisation that the only way to deal with the 'panic' is to do something thought of initially as somewhat unthinkable and hapless, is certainly explored; the last resort, 'you'll never see me doing that/in one of those things' notion is tested before becoming the source of humour. One character refers to burger vans as portable 'food poisoning', before succumbing to working within one later on. The van of the title acts as both a physical representation for the nucleus of the two leads' study, but also as a cinematic space in which it is able to play out. When we first encounter the van, it is located in a desolate and sorry place; a place that sees its characters struggle to push their way through all the other hazards around it just to catch a glimpse. The van is broken, worn-out and decrepit \u0096 it's seen better days. But the van is transformed; it is updated and goes through a process of modernity before, in time, is back up and running and solving the characters' problems. The process the van goes through is similar to that of the main characters, as these beaten and well-worn individuals whom have seen better days suddenly becoming success stories again; garnering a final day in the sun. But if The Van is supposed to be a comedy, blending in the harsh and realistic working class life of terrace house living; cramped conditions; redundancy and frustrations with one's overall life with what is, I think, supposed to be a 'feel-good' approach; then it's not a terribly funny one. One of the film's stranger scenes applies a very visceral sense of humour whilst exploiting what little knowledge these perceived men in crisis actually know about the kitchen 'space'; that being when Larry scolds himself whilst trying to deep fry fish and fry eggs, with the fat popping and jumping up onto his forehead and hands thus scolding him. It's an odd scene; a scene in which the male is ill-suited to his culinary surroundings, we are invited to laugh before realising that if he doesn't get back in there, give it another crack and get it right then his life will get doubly worse in an instant. But The Van has charm, although its charm isn't really enough. It doesn't invite us to laugh at two people on the skids as much as it does invite us to marvel and be entertained at the manner in which they refuse to buckle and hit rock-bottom. The film's humour is too wavy, either settling for scenes in which its characters are under the influence of alcohol or instances in which the burger van is mobbed by a sea of customers all shouting and ordering at once which, and granted, I haven't ordered many meals from many burger vans, but I'm smart enough to know, just doesn't happen. However, you might say its inconsistencies and its broad, uneven feel help in adding to its overall charm of two people just trying to get by; and I wouldn't really begrudge anyone for being fond of it for that.",
         "This is the story of two men belonging to the the Irish working class who after being sacked decide to start a business with a van for making and selling hamburgers and the like stuff. After a while their mutual relationship turns into a boss-employee one and things began to become worse until because friendship is thicker than money they began again to get well along with each other. The story is told in a half serious half funny way. It's very simple but not the less deep because of that. It's full of amusing episodes and details of everyday life but its very true, authentic and realistic.",
         "When Brenda 'Bimbo' Reeves is laid off he finds himself on the dole and irking out a unfulfilling life with friend Larry. When a 'friend' sells them a clapped out old chip van Bimbo and Larry decide to make a go of it and, once they have removed an inch of grease from the van and worked out how to move it without an engine, they are in business. With the pubs crammed due to the 1990 World Cup, business looks great and, as Ireland continue to win their way through the tournament, things just look like getting better and better. Being from Northern Ireland myself, I always find something to like in Doyle's very typical delivery and, as such, will always give the films adapted from his work a try. With The Van doing average business in the cinemas, I had to wait till it came onto television before I could get a chance to see it and it was as I expected, an enjoyable working-class fable of friendship set against the backdrop of unemployment. As such it is pretty good \u0096 providing good humour throughout as well as a nice build of tension between the two friends. What I didn't think it did very well was deliver something beyond the boundaries the film had set itself. By this I mean I had expected that the film would be more realistic whereas it really was more of a fable with a moral about friendship over money; it is not a bad thing that it did this but the film could have been stronger with it in my opinion. However, for what it tries to do it manages to be slight but amusing with a good little turn into the dramatic towards the end to set up the lesson for the day. The cast fit the bill for this type of material as well; Meaney may well have been in several big American hits but he is more at home here and he is a totally convincing working class Irish man. O'Kelly is just as good for different reasons \u0096 he is the same class but one who thought he was out; maybe you need to have lived around these sorts of areas but I thought he was realistic enough. The two have good chemistry and the support cast are also good value. Overall this is not the best of Doyle's films but it is an enjoyable little slice of Irish life \u0096 albeit very simplified and served up in a sauce of cheerful poverty. The script doesn't go deeper than the superficial issues of friendship but this still work well enough and they produce an enjoyable little Irish fable that is amusing as it delivers a lesson about friendship that is thankfully free of sentimentality or slush.",
         "Anyone who lived through the drama of the Italia 90 World Cup in Ireland should watch this movie. It brings back the drama and memories..but that is not all. The film really shows how friendship comes with a price. Simple folk, simple situation and the humour of the Irish really create a great story. My favourite moment in the film is when a little chubby kid strolls up to the van and asks for a choc ice. I won't spoil it but what happens then had me in stitches. GENIUS!",
         "Two Irish men with wives and children find themselves on the dole. One of them buys a large van and turns it into a \"chippy.\" Naturally, he asks his best friend to work there with him. These two approaching-middle-age men have to work incredibly hard, but do have some success at the venture. It doesn't take long, however, for the friendship to get in the way. The one who fronted the money for the van is the boss, and the other one who didn't put up any money to get the small business going is the employee, who eventually becomes bitter at drawing a weekly paycheck from his best friend, who joins a union and begins antagonizing his best friend about labor laws, and whose insecurity in life shows clearly -- after all, the job isn't glamorous by any means, and of course, the reality of it is far removed from his dreams, we should imagine. The tension grows between the two. Set in Ireland during a World Cup Finals competition in soccer, this film gives us an intimate, grungy peek at the everyday realities of the poor in Ireland. It's \"grand\" to venture forth and set up one's own business and get off the dole, but of course, things are unlikely to run smoothly.",
         "YES, it's a european movie...thank God! What I like best in this movie is that it doesn't take place in that clean \"US-environment\" with all those actors, who look like super-models. It's a real life story with people, who could be just your neighbours, which adds even more to the realism. They're all so emotional, so funny, so \"average\" looking, so...real! You can't help but love them after just a few minutes! In addition, this film is very very funny, the plot is good and offers occasions for a lot of funny situations, although I think you just have to like this kind of humour. Like I said, this is a very \"real\" film and so are the jokes. Just imagine you'd be a tourist in that small town somewhere in Ireland and you watch all those funny and odd people there. Sounds boring? Well, I didn't think so! Of course, it's also well shot. It looks different from a US Film (not a crime...yet) and maybe not too expensive, but hey, do you really need a lot of money to make a good comedy? ;) There really should be more of these films. If you liked \"Waking Ned\", \"The Full Monty\" and \"Brassed Off\", you're gonna love this one.",
         "Roddy Doyle's Barrytown trilogy was an affectionate, humorous but unsentimental look at life in the poor suburbs of Dublin; all three books have now been turned into films. 'The Commitments', directed by Alan Parker, was virtually a musical; in the original, Doyle hilariously peppered his text with fragments of the lyrics of the songs his protagonists (a soul band) were singing; in the film, the songs were played straight, and pretty much in their entirety, and some of the subtleties of the plot were also lost. Stephen Frears did better in making a low key film of book two, and is also at the directorial helm for this film of the final book. 'The Van' represented a slight change of direction for Doyle, a weighter piece of fiction than his earlier efforts; but it's still fun, and a sensitive portrait of male friendship. However, I don't like the film very much, even though it is quite faithful to the book in both content and tone; for in spite of this, it has lost the spark, and the vision, that the writing possessed, and appears coarse and clumsy in comparison. An Eric Clapton score is used insensitively, underscoring dialogue with unnecessary frequency; the acting (especially from Colm Meaney) renders the characters close to parody; the camera work is needlessly jumpy; while the plot is reduced to a series of set-piece encounters. This is supposedly a naturalistic movie, but never manages to convey the rhythms of ordinary life. While judged as against other films that tell tales of working class survival, it has not the political anger of the works of Ken Loach, the emotional impact of 'Brassed Off' or the jauntiness of 'The Full Monty'. Perhaps the most cruel cinematic comparison, however, brought to obvious attention by the prominent presence of a decrepit snack van, is with Mike Leigh's 'Life is Sweet', a film whose originality and desperate humour make a stark contrast with the dull clichéd Oirishisms on display here. Conclusion: read the book instead.",
         "It's November 1989. Bimbo (Donal O'Kelly) is fired from the bakery. His best mate Larry (Colm Meaney) is struggling with only welfare for the coming Christmas. Bimbo is about to consider a MacDonald McJob when the guys are shown a food van. It's a piece of junk that doesn't even have an engine. Bimbo's wife buys the van and he invites Larry to join him selling fish and chips. Their chips van does smashingly as Ireland advances in the World Cup. It's a steady decline from 'The Commitments' to 'The Snapper' and then to this. A more direct connection would have been better but I'm not an entertainment lawyer. It's still a fun watch. Donal O'Kelly doesn't have the screen presence. Colm Meaney is back and he overshadows everybody else. The trick is to make these poor losers lovable. Colm Meaney has that in spades. It would be better for them to get a steady young kid as their third. The relationship in the van is where this movie could have excel more. The guys' friendship could be more likable. I especially didn't like them picking up the ladies at the bar. Even their bickering could have been done with a lighter touch. Nevertheless it's still a fun ride."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Beacon Communications",
         "British Broadcasting Corporation (BBC)",
         "Deadly Films"
      ],
      "summaries": [
         "The third installment of Irish author Roddy Doyle's 'Barrytown Trilogy', following 'The Commitments' and 'The Snapper', depicts the hilarious yet poignant adventures of Bimbo. Upon being fired from his job at the bakery, Bimbo and his best mate go into business for themselves and purchase a chipper (a fish and chips van); but will the pressures of financial success sour their friendship forever?",
         "In November 1989, in Ireland, the baker Bimbo is fired from his job and he does not feel comfortable with the situation. His best friend Larry, who is also unemployed and living with his low welfare with his wife Mary and their children, is resigned with his situation and tries to console his friend. But Bimbo is supported by his wife Maggie and decides to buy an abandoned van without engine in a junkyard to open a business of hamburger, French fries and fried codfish and invites Larry to work with him. Soon they have financial success but their friendship is compromised."
      ],
      "budget": 0
   },
   "movielensId": 1482,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-11",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["Stephen Frears"],
      "runtime": 100,
      "movieId": 1482,
      "title": "The Van",
      "mpaa": "R",
      "actors": [
         "Colm Meaney",
         "Donal O'Kelly",
         "Ger Ryan",
         "Caroline Rothwell",
         "Brendan O'Carroll"
      ],
      "imdbMovieId": "0118064",
      "originalTitle": "The Van",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Set in \"Barrytown\", a fictitious working-class quarter of Dublin. \"Bimbo\" Reeves gets laid off from his job. With his redundancy, he buys a van and sells fish and chips with his buddy Larry. Due to Ireland's surprising success at the 1990 FIFA World Cup, their business starts off well, but the relationship between the two friends soon becomes strained as Bimbo behaves more like a typical boss.",
      "tmdbMovieId": 11844,
      "avgRating": 3.38224,
      "releaseYear": "1996",
      "numRatings": 535,
      "posterPath": "/ezSLtI2l3g7iB0YXzkceMytfrAN.jpg"
   }
}