{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "rooftop",
            "id": 15219
         },
         {
            "name": "bickering",
            "id": 177972
         },
         {
            "name": "chance meeting",
            "id": 177973
         },
         {
            "name": "drunkenness",
            "id": 188991
         }
      ],
      "imdb_id": "tt0116041",
      "video": false,
      "title": "The Daytrippers",
      "recommendations": [
         36196,
         34941,
         60158,
         29371,
         34574,
         513,
         42548,
         21828,
         12718,
         42318,
         12793
      ],
      "backdrop_path": "/G12G3sBco0rFeqTxTwWd7DsYGT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Louis D'Amico",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414cd",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Eliza D'Amico",
               "gender": 1,
               "credit_id": "52fe47a8c3a36847f81414d1",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jo Malone",
               "gender": 1,
               "credit_id": "52fe47a8c3a36847f81414d5",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Carl Petrovic",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414d9",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jim Malone",
               "gender": 0,
               "credit_id": "52fe47a8c3a36847f81414ef",
               "name": "Pat McNamara",
               "profile_path": null,
               "id": 1174793,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Rita Malone",
               "gender": 1,
               "credit_id": "52fe47a8c3a36847f81414f3",
               "name": "Anne Meara",
               "profile_path": "/oNZszKpUZHfbT1mk2cD53uuZsnp.jpg",
               "id": 32394,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Eddie Masler",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414fb",
               "name": "Campbell Scott",
               "profile_path": "/LpYIN2jh58sHaUFM2r3G4G0iE6.jpg",
               "id": 55152,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Aaron",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414ff",
               "name": "Marc Grapey",
               "profile_path": "/9S5FY4JJOGc8ea4wLRkskAnvdcF.jpg",
               "id": 1174795,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Cassandra",
               "gender": 1,
               "credit_id": "57dd1968c3a36862580022a1",
               "name": "Stephanie Venditto",
               "profile_path": null,
               "id": 1174794,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414c9",
               "name": "Greg Mottola",
               "profile_path": "/dC1BKEyTzgTqqy8c5MmSZrRLhNR.jpg",
               "id": 54733,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414df",
               "name": "Greg Mottola",
               "profile_path": "/dC1BKEyTzgTqqy8c5MmSZrRLhNR.jpg",
               "id": 54733,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414e5",
               "name": "John Inwood",
               "profile_path": null,
               "id": 94312,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a8c3a36847f81414eb",
               "name": "Anne McCabe",
               "profile_path": null,
               "id": 5884,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 2.758695,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 49806,
      "vote_count": 14,
      "budget": 0,
      "overview": "Eliza D'Amico thinks her marriage to Louis is going great, until she finds a mysterious love note to her husband. Concerned, she goes to her mother for advice. Eliza, her parents, her sister Jo and Jo's boyfriend all pile into a station wagon, to go to the city to confront Louis with the letter. On the way, the five explore their relations with each other, and meet many interesting people.",
      "similar": [
         32868,
         9716,
         112160,
         244772,
         2252,
         1586,
         13,
         14,
         35,
         141,
         281957,
         242224,
         452507,
         397243,
         806,
         10774,
         9654,
         298312,
         260346,
         2142
      ],
      "original_title": "The Daytrippers",
      "runtime": 87,
      "poster_path": "/A2Vlb2xzn0jvKLgjiYoj6U8VDDf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-01-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "It's a family affair",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Greg Mottola"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Greg Mottola"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116041/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4ODM1OTM0Ml5BMl5BanBnXkFtZTcwNjcwODAyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Hope Davis, Stanley Tucci, Parker Posey | See full cast and crew »"],
      "reviews": [
         "Truly one of the funniest, most original films of the mid 90's. The casting is truly inspired-Anne Meara gives a knockout performance as an overbearing, but well-meaning suburban mother; Hope Davis is marvelous (as usual) as an optimistic, sort of numb wife on a mission to see if her husband is indeed cheating on her; Liev Schreiber is wonderful as the superb Parker Posey's aspiring writer boyfriend; Campbell Scott steals the movie as a lusty writer Eddie; and of course Stanley Tucci turns in another great performance as the catalyst character in the film. His screen time is brief, but he shines brightly. Marcia Gay Harden's cameo as a neurotic party guest had me practically on the floor laughing. The story unfolds naturally, taking the viewer on the same emotional journey as the characters. There's never a dull moment, and the film is an indie classic filled with thought-provoking dialogue and terrific character sketches.",
         "While I've been meaning to see this film for years, (I think the trailer was on the Reservoir Dogs VHS that I wore out before I bought it on DVD) it was one of probably hundreds of films that I put on my back burner. So when I recently saw it was on a pay channel I jumped on it, and am very glad that I did finally see this gem. The Daytrippers involves a woman (Davis) whose resolve that she is happily married is tested when she finds an excerpt from a love poem that fell from her husband's (Tucci) clothes. She elects to go to her mother (Meara) for advice and ends up going on a day trip to NYC to ask her husband about it. Along for the ride is her father, (McNamara) her sister, (Posey) and her sister's boyfriend (Schrieber). Of course, if they were able to simply confront her husband it would be easy; unfortunately he is no where to be found, so they willingly engage in amateur sleuthing to put together the story while they drive around the city looking for him. The plot is a fairly simple one, but the character development is the true star of the film. While Parker Posey is known best for playing `quirky yet intelligent' characters, her role seems more of a natural addition in this film rather than a run-of-the-mill portrayal for her. Meara is nearly maddening as a meddling mother, and McNamara, a well established character actor is heartbreakingly sweet as the weary father. Davis and Tucci are both fantastic as usual, and while Tucci's role is a small one, he exhibits his usual passion that makes him an exciting actor. Davis gives her character a palpable fragility that just barely makes room for the modicum of strength that is holding her together. In my opinion, the true breakout star of the film is Schrieber as Carl Petrovic, `the boyfriend'. His character has so many facets to his personality and becomes such a complex study that is so rare in a supporting character. And Schrieber's portrayal is brilliant and both comedic and heart-breaking in it's subtle profundity. Schreiber has been on my radar since I saw him in RKO 281 brilliantly portraying one of my personal heroes, Orson Welles, and after viewing this performance I plan to seek out more of his work. The Daytrippers has been an independent film darling for years now and I can see why. It is an intelligent, emotional and well-written and acted film that will hold an appeal for most who take the time to view it. --Shelly",
         "A Long Island woman finds a love letter in her house and suspects her husband of cheating. Her over-protective (and very pro-active) family convinces her to confront her husband at his workplace in Manhattan. They all (wife, mom, dad, sister and sister's boyfriend) pile into the station wagon to hunt down the scoundrel. In their efforts to find him they meet a bunch of interesting characters and learn a little bit more about their own feelings for one another. This movie is so sweet in its examination of family loyalty and so honest in its examination of long-failed relationships in denial that I feel it is easily one of the most satisfying video rentals I've ever experienced. There's enough comedy throughout to provide laughs (especially any and all jokes at the expense of Liev Schreiber's pretentious novelist) and the realistic sisterly affection shared by Parker Posey and Hope Davis is genuinely touching. Also provides a subtle examination of the Long Islander's relationship to Manhattan - the latter acting as an unfamiliar, answerless maze through which the family has to pass in order to find the truth.",
         "Simple plot, witty dialogue, and tremendous actors make this movie a pleasure. Campbell Scott is the most underrated actor of our generation. His bit part in Daytrippers makes the movie worth seeing. Schreiber is great, as well. The Malone sisters are tolerable, but the humor begins and ends with their incessantly controlling mother.",
         "Underrated and underseen. Daytrippers is like a younger Woody Allen, mixing comedy with angst. Fresh and funny, real and absurd, empathetic. Terrific first movie as writer/ director.",
         "As an avid Parker Posey fan, I rented this little number to see one of her indie accomplishments--what I got was very interesting. Eliza (Hope Davis) packs up her family to question her husband (Stanley Tucci) about a mysterious love note found in their bedroom. Including her wild sister (Parker Posey), her enlightened boyfriend (Liev Schreiber) and her annoying overbearing mother (Anne Meara), Eliza encounters doubts about her husband and her family also realizes the importances of their own relationships. Lots of surprises! Great performances! Great low budget film. Parker Rocks!",
         "Daytrippers is a progressive drama about a family that takes an adventure into New York City after Eliza (Hope Davis) discovers a love letter that may uncover an affair between her husband and somebody named Sandy. Anne Meara does a good job as the typical East Coast, controlling mother. The indie-film queen Parker Posey plays Eliza's little sister whose boyfriend Carl, played by Liev Schreiber, is an exaggeration of the young, snobbish, know-it-all author. The family is hardly functional which makes this film particularly honest. The key to Daytrippers is not the plot, which never fails to keep you watching, but the dialogue and the situations. Pay close attention to the characters that the family meets in the city. They all embody some kind of contradictions that make you think a little bit. Look for the scene where Marc Grapey begins describing his sexual exploits by condemning such practices. If you are looking for a drama that provokes you, this is one of them. There are no happy endings and none of the issues raised are resolved. Fans of Parker Posey will especially enjoy her performance in this one.",
         "Wonderful film about love and betrayal. Amazing cast that provides laughs in all of the right places. Anne Meara was incredible as the mother and Parker Posey was hilarious as usual. I was intrigued from the beginning to the end and highly recommend The Daytrippers.",
         "... a believably bickering family, portrayed by skilled actors, w/some wonderful ham stuff by Anne Meara and Parker Posey, and more subtle stuff from Hope Davis and Liev Schreiber. The story had a distinctly voyeuristic feel, as if the screenwriter was exorcising some history and making it more entertaining, often hilarious (and interesting?) than a painful history he may have lived through. A cinema verite re-creation by world class skilled actors. As the family's lives unravel, driving around in a freezing cold NYC winter evening, there is a quiet lingering shot of the World Trade Center that is unintentionally haunting, and gives the film (made in 1996) an unintended resonance.",
         "This is a hilarious film... beautifully-written, hysterically-acted, excellently directed. Rent it. See it. Liev Schrieber is great, and so is Parker Posey. Greg Mottola will be, one day, a great director. He's also a very funny writer, and was able to make a story that's both moving and funny."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Alliance Communications Corporation",
         "Cinépix Film Properties (CFP)",
         "Fiasco Photoplays"
      ],
      "summaries": [
         "Eliza D'Amico thinks her marriage to Louis is going great, until she finds a mysterious love note to her husband. Concerned, she goes to her mother for advice. Eliza, her parents, her sister Jo and Jo's boyfriend all pile into a station wagon, to go to the city to confront Louis with the letter. On the way, the five explore their relations with each other, and meet many interesting people.",
         "Eliza D'Amico loves her husband, Louis D'Amico, and she believes he loves her. Her beliefs are tested when, on the day after Thanksgiving, she finds behind her bedroom dresser what appears to be a love letter written by someone named Sandy, the letter which references poet Andrew Marvel. Not knowing what the letter really means, Eliza decides to ask her parents, working class Jim and Rita Malone, Eliza's sister Jo Malone, and Jo's intellectual boyfriend Carl Petrovic - the latter two who are visiting from Michigan for the holiday weekend - what they think the letter means. The five decide to drive from the Malone's Deer Park, Long Island home into New York City to find Louis and/or find clues as to the meaning of the letter's contents. As they go on their search through the day and into night, they do find more and more evidence, which they all believe is still inconclusive. But they also meet a variety of people with whom they share their story, and learn the story of these new people. These people include a sex starved man who tells the story of his latest sexual conquest to anyone who will listen, a writer who out-intellectualizes Carl, a father and son one who is hiding from the law, sisters dealing with their mother's estate, and a woman who is trying to pick up her ex-boyfriend at a party. Through it all, the day's events not only affect Eliza and her marriage, but the family dynamic as well.",
         "When a happily married woman discovers a love letter written by her husband to an unknown party, she enlists her dysfunctional family to discover the truth."
      ],
      "budget": 0
   },
   "movielensId": 1484,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": "2000-06-20",
      "directors": ["Greg Mottola"],
      "runtime": 87,
      "movieId": 1484,
      "title": "The Daytrippers",
      "mpaa": "R",
      "actors": [
         "Stanley Tucci",
         "Hope Davis",
         "Parker Posey",
         "Liev Schreiber",
         "Pat McNamara",
         "Anne Meara",
         "Campbell Scott",
         "Marc Grapey",
         "Stephanie Venditto"
      ],
      "imdbMovieId": "0116041",
      "originalTitle": "The Daytrippers",
      "genres": [
         "Comedy",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["oK7YDkwSud8"],
      "plotSummary": "Eliza D'Amico thinks her marriage to Louis is going great, until she finds a mysterious love note to her husband. Concerned, she goes to her mother for advice. Eliza, her parents, her sister Jo and Jo's boyfriend all pile into a station wagon, to go to the city to confront Louis with the letter. On the way, the five explore their relations with each other, and meet many interesting people.",
      "tmdbMovieId": 49806,
      "avgRating": 3.69636,
      "releaseYear": "1996",
      "numRatings": 1072,
      "posterPath": "/A2Vlb2xzn0jvKLgjiYoj6U8VDDf.jpg"
   }
}