{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117422",
      "video": false,
      "title": "The Quiet Room",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mother",
               "gender": 1,
               "credit_id": "574147d2925141282b002af8",
               "name": "Celine O'Leary",
               "profile_path": "/8BxnVdoJiIEXAHcifPpSYIn0exD.jpg",
               "id": 1040111,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Father",
               "gender": 2,
               "credit_id": "574147f6c3a3680727004312",
               "name": "Paul Blackwell",
               "profile_path": "/trKFaMohgm2kAACO4lDAg47kawN.jpg",
               "id": 37293,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Girl Age 7",
               "gender": 0,
               "credit_id": "5741480d92514128f60027fa",
               "name": "Chloe Ferguson",
               "profile_path": null,
               "id": 1001714,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Girl Age 3",
               "gender": 0,
               "credit_id": "574148149251417251001538",
               "name": "Phoebe Ferguson",
               "profile_path": null,
               "id": 1001715,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Kate",
               "gender": 0,
               "credit_id": "5741481dc3a3680727004328",
               "name": "Kate Greetham",
               "profile_path": null,
               "id": 1623896,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Workman",
               "gender": 0,
               "credit_id": "57414826925141282b002b13",
               "name": "Todd Telford",
               "profile_path": null,
               "id": 1623897,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe49f59251416c910be749",
            "name": "Rolf de Heer",
            "profile_path": "/rrOPgrvHpr0GB8xfk12NUZdiNZZ.jpg",
            "id": 112674,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.071862,
      "production_countries": [],
      "id": 88423,
      "vote_count": 2,
      "budget": 0,
      "overview": "A seven-year-old girl adopts a vow of silence in protest when her quarrelsome parents grow increasingly hostile to one another.",
      "similar": [],
      "original_title": "The Quiet Room",
      "runtime": 93,
      "poster_path": "/g9qQS1IyrWPbe08AqRadBXdHKDW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-03-21",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Sometimes silence speaks volumes.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rolf de Heer"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Rolf de Heer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117422/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMTYzNzk1OV5BMl5BanBnXkFtZTcwMDU0NDQzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Celine O'Leary, Paul Blackwell, Chloe Ferguson | See full cast and crew »"],
      "reviews": [
         "I got \"The Quiet Room\" on the basis of the cover in the video store. It was a risk and a risk that was absolutely worth taking. There are few films that attempt to understand the thinking of a kid. There are even fewer films that have an actor that can portray it. In this film there are both. There is nothing cutesy here. The girl, a seven year old, has decided not to speak because of the conflict between her parents. That's essentially it. But there is so much in the honesty of the child's monologue that resonates with any person who has been a child trying to understand the irrational world of grownups. This film is brilliant.",
         "It was this movie which really opened my eyes to the possibilities of one movie can bring. This is a masterpiece which really brings up the feelings, I mean that sort of tension without word. The girl simply closes herself off, while she wants to speak, in her heart, but none of her parents understand. I was very touched by this movie this is a very great piece of work by Rolf, a classic, I'm looking forward to see \"The old man who read love stories\" and more of his work in the future. I'd recommend this movie to absolutely everyone, be warned though you have to be more patience while watching.",
         "I found a used copy of this on ebay and bought it because I saw Bad Boy Bubby (one of Rolf's earlier films) and loved it. While it was completely different, I enjoyed it just as much as I did Bubby. I've read other users complain of how De Heer spells out everything in his films and doesn't give the viewers a chance to pick up on things for themselves... When this movie started, I felt the same way but soon got used to it and was able to look past it. The film is about a girl who decided to quit talking, but we hear narration through out the film, answering all of her parents questions, etc. More silence might have made for a better film, but it also could have made it a bit more boring. It did drag a bit as is, but the girl was great in the movie (even her stupid rhymes) and I couldn't stop watching. Being a child of divorce, one of the fight scenes hit a little close to home. I remember feeling exactly as the girl did when it happened in my family, covering my head trying to block it out, crying etc. This movie took me right back to those times, like it or not. I liked how none of the characters had names and also how small the cast was. The movie works because of how simple it was. I'm curious to see more of Rolf's films now, too bad none of the rental stores here carry any of his stuff.",
         "This movie opened my eyes and got me down to a 7 year old's level. Actually I should say up to a 7 year old's level, in this movie the adults seemed more childish than the child! It was great to see life in a not so harmonious household from the child's point of view! So many things I've heard myself say to my own child, the mother in the film said and I swear I will always think before speaking to my kids! It's a very original and thought provoking movie - I recommend it to everyone!",
         "1st watched 10/15/1999 - 8 out of 10(Dir-Rolf De Heer): Excellent story of a child's perspective on life with parents who are having a hard time making things work.Definetly not a hollywood movie, but rather a slice of real life.Why can't us Americans make more time for movie's like this?(This film is Australian made.)",
         "This film is one of my favorite films of all time. Because I loved the way the girl talked in her head, she talked more like a grown person, not a 8 year old. Her humor was dry, but funny. And the way she loved her parents, even with their faults was remarkable. The actress who played the little girl did some of the best acting I have ever seen. She hit my heartstrings. The parents were awesome too, playing out two people on the verge of a divorce. Even the babysitter was good. so all in all the acting was superb. The director really stood out with this movie, being able to make a hard-to-shoot film look easy. My hat is off to him. I recommend this film for a 'Thinker' movie buff.",
         "I wish that I had been able to view this movie before my divorce. Perhaps I would have been better able to understand what my children were going through instead of just the pain of loss, fear, anger, and confusion that they certainly must have felt. We as adults must learn to understand that our children too have feelings and need to be heard as well as understood when we as adults go about changing their lives without first doing everything to keep our families intact. This movie through the eyes and voice of a silent child was insightful and and I think that every adult should view it before going about destroying their lives as well as the lives of their children.",
         "This movie is GREAT! It has a very unique point of view, learning about divorce through the eyes of a child. The audience is given the ability to read the childs mind, in a sense, because she is unable to speak. Very much worth watching!!",
         "I was glad to notice a movie by Rolf de Heer in the TV guide, since I really liked his \"Bad Boy Bubby\". But this was a totally different movie. It's about a girl who decides not to speak to her parents anymore to get them closer together since their marriage is not what it once was. But what I really wanted to point out is the use of colors in this movie. I didn't see it at first but there are two main colors used to indicate the mood of the people. Blue points out a very sad mood, whereas red points out the opposite, happiness. Notice the extremely red sweater the girl is suddenly wearing near the end of the movie...",
         "I was very interested in the premise of the story as described on the cover...that a young girl, without the words to express what she feels, becomes convinced of the uselessness of words and stops talking. I think this is brilliant! (I often wonder what is in my own children's minds when they stare off in silence.) However, I was quite unimpressed with the story's unfolding. I was left feeling rather annoyed by the abundant use of voice over which spoiled the whole idea of her silence for me. I wanted to see things as she saw them and feel the tension that only silence can create but instead I was assaulted by a constant stream of interpretations and explanations that were already there in the action or in her beautifully expressive face. While the child actors were usually very engaging, I found it difficult to reconcile the erratic speech patterns as written, especially in the adults, with an interpretation of the world from the young girl's point of view. In all, I was disappointed. Such a wonderful premise but such poor writing and character development. Deep sigh."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Fandango",
         "Marvel Movies",
         "SBS Independent"
      ],
      "summaries": ["A seven-year-old girl adopts a vow of silence in protest when her quarrelsome parents grow increasingly hostile to one another."],
      "budget": 0
   },
   "movielensId": 1486,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-21",
      "dvdReleaseDate": null,
      "directors": ["Rolf de Heer"],
      "runtime": 93,
      "movieId": 1486,
      "title": "The Quiet Room",
      "mpaa": null,
      "actors": [
         "Celine O'Leary",
         "Paul Blackwell",
         "Chloe Ferguson",
         "Phoebe Ferguson",
         "Kate Greetham",
         "Todd Telford"
      ],
      "imdbMovieId": "0117422",
      "originalTitle": "The Quiet Room",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A seven-year-old girl adopts a vow of silence in protest when her quarrelsome parents grow increasingly hostile to one another.",
      "tmdbMovieId": 88423,
      "avgRating": 3.3883,
      "releaseYear": "1996",
      "numRatings": 94,
      "posterPath": "/g9qQS1IyrWPbe08AqRadBXdHKDW.jpg"
   }
}