{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116931",
      "video": false,
      "title": "Love and Other Catastrophes",
      "recommendations": [
         85330,
         133823,
         94583,
         59807,
         24078,
         33582,
         44880,
         35801,
         60013,
         20718,
         106538,
         12793,
         62677,
         29134,
         30124,
         16151,
         9867,
         28871,
         36799,
         16605
      ],
      "backdrop_path": "/4Rj21fEh375tly2NSn8a6eElKS5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4956c3a368484e126681",
               "name": "Matt Day",
               "profile_path": "/ngzxTaydI2tTo1j9KwQ9yG2lMo.jpg",
               "id": 3068,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4956c3a368484e126685",
               "name": "Matthew Dyktynski",
               "profile_path": null,
               "id": 79105,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4956c3a368484e126689",
               "name": "Alice Garner",
               "profile_path": null,
               "id": 38784,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4956c3a368484e12668d",
               "name": "Frances O'Connor",
               "profile_path": "/tWGMS7DciV43tlxA6UEc2UqxrhL.jpg",
               "id": 1518,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4956c3a368484e126691",
               "name": "Radha Mitchell",
               "profile_path": "/kKbnljNC07nqiucGeouxhKESXUC.jpg",
               "id": 8329,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4956c3a368484e126695",
               "name": "Suzi Dougherty",
               "profile_path": null,
               "id": 186977,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4956c3a368484e126699",
               "name": "Kym Gyngell",
               "profile_path": "/8abaTPxOMOUqlRWKZFYy7mGthXz.jpg",
               "id": 75193,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4956c3a368484e126659",
               "name": "Emma-Kate Croghan",
               "profile_path": null,
               "id": 142513,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4956c3a368484e12665f",
               "name": "Stavros Kazantzidis",
               "profile_path": null,
               "id": 67583,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4956c3a368484e126665",
               "name": "Yael Bergman",
               "profile_path": null,
               "id": 278228,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4956c3a368484e12666b",
               "name": "Emma-Kate Croghan",
               "profile_path": null,
               "id": 142513,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4956c3a368484e126671",
               "name": "Helen Bandis",
               "profile_path": null,
               "id": 581055,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4956c3a368484e126677",
               "name": "Oleh Witer",
               "profile_path": null,
               "id": 581056,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4956c3a368484e12667d",
               "name": "Justin Brickle",
               "profile_path": null,
               "id": 413105,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.551215,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 76996,
      "vote_count": 10,
      "budget": 0,
      "overview": "A day in the life of two film-school students trying to find love and another house-mate.",
      "similar": [
         376660,
         112160,
         258480,
         43923,
         12793,
         11421,
         10735,
         244772,
         376867,
         11216,
         858,
         634,
         773,
         437557,
         449176,
         401898,
         391713,
         398818,
         24684,
         244264
      ],
      "original_title": "Love and Other Catastrophes",
      "runtime": 78,
      "poster_path": "/dhlW5z7HSFZDUIYu85PuPdriY4L.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-08-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Emma-Kate Croghan"],
      "runtime": 76,
      "synopsis": "A warm and witty 90s screwball comedy about love, fate and other pressing concerns. Mia (OConnor) and Alice (Garner) have just moved into a warehouse apartment but are still minus a housemate. Danni (Mitchell), Mia's girlfriend is keen to move in, but Mia fears committment. Mia, who can be a solopsistic bitch (but in the nicest possible way) is obsesed with her favourite lecturer and becomes embroiled in a beaurocratic nightmare as she persues him to his new department. Alice a frustrated perfectionist is four years late with her thesis on 'Doris Day as feminiest warrior'. She is looking for the perfect man but can't find anyone who fits her rigorous criteria. Feeling the need for change she falls for the most unsuitable male possible... Ari (Matthew Dyktynski), a Classics student, part time gigolo and the Warren Beatty of the campus. Little does she know she ahs her own secret admirer... Michael (Matt Day), a shy medical student who is living in the share house from hell and wants out. Their search for love transcends the boundaries of the University and their respecive disciplines. As the day ends and the party begins events begin to unscramble in unexpected ways. Omina Vincit Amor... Love Conquers All",
      "writers": [
         "Stavros Kazantzidis",
         "Yael Bergman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116931/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5NjkxNDk1OV5BMl5BanBnXkFtZTcwMzA2NDMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Frances O'Connor, Alice Garner, Matt Day | See full cast and crew »"],
      "reviews": [
         "This low-budget comedy was the debut of Emma Kate Groghan and it remains one of the freshest Australian romantic comedies in recent years. Given the limitations of the budget, one would have expected it to fall flat at times; the opposite is true. The cast do a very good job with the offbeat script, most notably Frances Connor and Radha Mitchell. Set in a Melbourne University, Connor takes center stage in a tale of unrequited love and missed glances. The comedic element is often tempered with dark touches which makes a change from the usual limitations of romantic comedies. The end might be a tad obvious but it gels in well with the genuine feel-good nature of the film.",
         "this is one of the few successful attempts at trying to capture the vitality, the heart-break, the ecstacy and the madness of college life and campus romances. this is about the desperate and hurried search of adolescents, on the brink of adulthood, for meaningful romances and fulfilling careers. the terrible reality of their tribulations and the utter pettiness of their failures, the monstrosities of their triumphs and the fleetingness of their celebrations. debutante director emma kate croghan captures all this beautifully in putting together a few days in the lives of group of friends. the shoe-string budget of $37,000, provides for the warmth and credibility of the characters and their situations. clearly this is a movie that would have been a disaster with a million dollar budget. the characters are portrayed extremely realistically by the fresh actors and each of the characters shines through with their ability to convey the humor of their plights. all in all, a delightful movie that does not tax the viewer much, but takes one along for a voyeuristic look into campus lives. this might not be one of the three best movies of my life (watch the movie to understand the significance of top three movies) but it is one of the top 5 English language movies of the 90s, whose central theme is love. 5. chasing amy 4. as good as it gets 3. love and other catastrophes 2. before sunrise 1. high fidelity anyway, this one is a winner. a delightful 9!",
         "When a movie lover like me is watching a movie like this one, his heart becomes happy, really happy. The characters love movies, they are talking seriously about them, with some respectuous words. I hope that the director of this one will going far in her career because she has a lot of talent.",
         "In the last day for changing the course in the Melbourne University, the lesbian cinema student Mia (Frances O'Connor) misses her girlfriend Danni (Radha Mitchell), who is dating Savita (Suzi Dougherty), and is trapped in the bureaucracy of the university to transfer to another course. Her mate and best friend Alice (Alice Garner) is seeking out a roommate to share the expenses of their new house, and is alone trying to find a boyfriend that is left-handed and enjoys the same movies as she. Alice is having trouble to complete her thesis about Doris Day, and she has organized a party for that night in their house. Meanwhile the popular student of medicine Ari (Matthew Dyktynski) befriends the lonely Michael Douglas (Matt Day), who has difficulties to relate with girls and wants to move from his house. Ari introduces Michael to Mia and Alice and they invite him to their party. Along the night, Mia and Danny resolve their issues while Alice and Michael find that they have many points in common. \"Love and Other Catastrophes\" is a dull, but entertaining low-budget movie. The story is extremely simple and boring in some moments, like for example, when Mia is fighting against the stupid bureaucracy of her university. Nevertheless, the cast is extremely charismatic and shows chemistry, and the young actors and actresses have great performances. My vote is six. Title (Brazil): \"Amor e Outras Catástrofes\" (\"Love and Other Catastrophes\")",
         "\"Love and Other Catastrophes\" is co-written and co-produced by a Jewish Australian woman, makes some jokes on Woody Allen, and doesn't repeat any of his stereotypes. There's an interesting Jewish character or two - including a guy named Ari who is a lothario and a guy considering a circumcision due to the demands of his Jewish girlfriend. It fits nicely in the genre of twentysomething roommates seeking love, i.e. \"Singles,\" \"Kicking and Screaming,\" etc. The lesbian couple is treated completely naturally and romantically and is really the most interesting couple. None of the guys even assume the lesbian's straight best friend is gay, as I think would happen in most American films. The film student satires are a bit heavy handed, but on a whole it's a cute, funny first-time movie casually made. I only recognized two songs out of the whole soundtrack as it was filled with Australian rock 'n' roll I've never heard before. (originally written 4/2/1997)",
         "This film is for anyone who's in (or was in) university and fallen 'victim' to a bureaucratic bungle. As the title says, the film focuses on \"love and other catastrophes\", the \"catastrophes\" being many problems young people face such as the one above-mentioned, moving out of home finding a place to live, fitting into a new environment, making new friends and finding your own identity. The \"love\" aspect is about finding your one true love and whether or not he/she exists, and if they do not exist, do you settle for someone who does not fit all your \"criteria\"? I give this film 8/10. I would have preferred it to be longer, even though the ending was quite good. All the characters are likeable and unique, Frances O'Connor does a great job at playing Mia. I highly recommend this film to anyone especially those in the 18-25ish age group.",
         "I've seen lots of films in my life , and this is one of the best . This film talks about why we are always looking for love, and why we lose this love for stupid things . If you are a romantic person , this is a film for you , don´t think about it and see it . I'm sure you´ll never be able to forget the film , I know what I'm writing .",
         "An excellent film. Many will miss the references to life, mainly due to not living it. But it struck a major chord with those that have. A must see if you have enjoyed your college years, or are pursuing them now. A good reference for those attempting fate.",
         "This movie is the perfect romantic pick me up. I can watch it every day-- it's short and sweet. Gay or straight, if you want a movie about wanting and hoping and angsting and college and partying and breaking up and making up and discovering and love, this is it. Frances O'Conner is excellent in this, her first film role.",
         "I always seem to love these good ol' Aussie comedy movies. This one is no exception. \"Love & Other Catastrophies\" is no doubt a great film. Without fail it delivers laughs all the way through, and most times its very easy to identify with all of the characters. I strongly suggest this movie for a video night with a few friends, pizza & beers, that is if you're over 18 :) OVERALL : 4.5 / 5"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Beyond Films",
         "New Vision Films",
         "Screwball Five"
      ],
      "summaries": [
         "Two female students struggling to complete their university degrees seek a flatmate. At the same time Michael, a medical student, is looking for a new place to stay.",
         "A day in the life of two film-school students trying to find love and another house-mate."
      ],
      "budget": 250000
   },
   "movielensId": 1493,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-01",
      "dvdReleaseDate": null,
      "directors": ["Emma-Kate Croghan"],
      "runtime": 78,
      "movieId": 1493,
      "title": "Love and Other Catastrophes",
      "mpaa": "",
      "actors": [
         "Matt Day",
         "Matthew Dyktynski",
         "Alice Garner",
         "Frances O'Connor",
         "Radha Mitchell",
         "Suzi Dougherty",
         "Kym Gyngell"
      ],
      "imdbMovieId": "0116931",
      "originalTitle": "Love and Other Catastrophes",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A day in the life of two film-school students trying to find love and another house-mate.",
      "tmdbMovieId": 76996,
      "avgRating": 3.40598,
      "releaseYear": "1996",
      "numRatings": 234,
      "posterPath": "/dhlW5z7HSFZDUIYu85PuPdriY4L.jpg"
   }
}