{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "terrorist",
            "id": 949
         },
         {
            "name": "switzerland",
            "id": 1223
         },
         {
            "name": "undercover",
            "id": 1568
         },
         {
            "name": "arms dealer",
            "id": 6163
         },
         {
            "name": "revenge",
            "id": 9748
         }
      ],
      "imdb_id": "tt0119013",
      "video": false,
      "title": "Double Team",
      "recommendations": [
         9594,
         10861,
         9091,
         10413,
         2019,
         9103,
         37498,
         10596,
         3513,
         17466,
         8831,
         10134,
         9399,
         8860,
         9349,
         10222,
         10366,
         10908,
         11667,
         37632
      ],
      "backdrop_path": "/cqU8kX6VbT4dxV5mx1t3HxW9d3f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Quinn",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c21",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Yaz",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c25",
               "name": "Dennis Rodman",
               "profile_path": "/WnICmjnl9nrtaZrNbU2GHsNvgQ.jpg",
               "id": 21397,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Stavros",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c29",
               "name": "Mickey Rourke",
               "profile_path": "/AvGzQ8fvjurGmZW3W1wlQ5WfSeT.jpg",
               "id": 2295,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Goldsmythe",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c2d",
               "name": "Paul Freeman",
               "profile_path": "/gWRX09kyrzTFFehwE53cJtps2fx.jpg",
               "id": 652,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 1,
               "credit_id": "53be539ac3a3684cec002c8d",
               "name": "Valéria Cavalli",
               "profile_path": "/2xJftgbMZSj09HZI3UreGbLGXxa.jpg",
               "id": 24591,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Kofi",
               "gender": 2,
               "credit_id": "59960e0a92514124da00501b",
               "name": "Bruno Bilotta",
               "profile_path": "/2vF1hUDvNivRToIDIoMNO0MZw9v.jpg",
               "id": 27401,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "James",
               "gender": 0,
               "credit_id": "59960e31c3a3686db30052a1",
               "name": "Mario Opinato",
               "profile_path": "/cLBVj89IZWpY9vD9fGQP1uGLHmo.jpg",
               "id": 1105263,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Mossad Agent",
               "gender": 2,
               "credit_id": "5a37f8d8c3a36814b906562f",
               "name": "Ottaviano Dell'Acqua",
               "profile_path": "/sZcBEm4CeZgqughAzlNNpMw11wo.jpg",
               "id": 68330,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Stavros Goon",
               "gender": 2,
               "credit_id": "5a37f8e4925141547b0648e2",
               "name": "Angelo Ragusa",
               "profile_path": "/zbYSheDT9EvuKXsTuYamppo7WdW.jpg",
               "id": 1026047,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Brother Ramulu",
               "gender": 2,
               "credit_id": "5a37f8fa0e0a264cbe1e7791",
               "name": "Ted Rusoff",
               "profile_path": "/xxYvCAmU0JI1yUJ7q8lbpYPjS6q.jpg",
               "id": 1016074,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Brother Regulo",
               "gender": 2,
               "credit_id": "5a37f906925141032c1f0b8b",
               "name": "Umberto Raho",
               "profile_path": "/iD9wuNlT1Do5FjTsJpVW6K41Z4B.jpg",
               "id": 25816,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Colony Resident",
               "gender": 2,
               "credit_id": "5a37f920c3a36814b9065673",
               "name": "Orso Maria Guerrini",
               "profile_path": "/9Gpe7JoCuCeKqiriAqDsrvOVBLi.jpg",
               "id": 27198,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c33",
               "name": "Tsui Hark",
               "profile_path": "/spPu64ewZ4Gwo2UzBfKIjfAj9BT.jpg",
               "id": 26760,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c39",
               "name": "Don Jakoby",
               "profile_path": null,
               "id": 51346,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b3c3f",
               "name": "Paul Mones",
               "profile_path": "/1qGLKfuj55YRA4W2989JPYtPjUo.jpg",
               "id": 56987,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c45",
               "name": "David Rodgers",
               "profile_path": null,
               "id": 57602,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c4b",
               "name": "Moshe Diamant",
               "profile_path": null,
               "id": 56032,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c51",
               "name": "Don Jakoby",
               "profile_path": null,
               "id": 51346,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c57",
               "name": "Gary Chang",
               "profile_path": null,
               "id": 40438,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c5d",
               "name": "Peter Pau",
               "profile_path": "/pWDiUIJB2OpROUNgcMvcX4pZOwu.jpg",
               "id": 1633,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3c63",
               "name": "Bill Pankow",
               "profile_path": "/3cX0GVPg9YnqRFKFoZ5Xa7fjSX5.jpg",
               "id": 1264,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b3c69",
               "name": "Jean-Daniel Fernandez-Qundez",
               "profile_path": null,
               "id": 58380,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a3da4059251411fab0008ba",
               "name": "Sammo Hung",
               "profile_path": "/hpqwIMmLLpn0mMmpi4EhzARK24K.jpg",
               "id": 62410,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.739747,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9405,
      "vote_count": 210,
      "budget": 30000000,
      "overview": "He's a one-man arsenal... with enough voltage to rock the free world. They Don't Play by the Rules. You're either on their side...or in their way. America's top counter-terrorist usually works alone...this time he's got company.",
      "similar": [
         8456,
         24,
         562,
         281,
         14869,
         55292,
         281957,
         445954,
         9053,
         6312,
         8292,
         40805,
         3134,
         979,
         238636,
         395834,
         357096,
         1701,
         96,
         185
      ],
      "original_title": "Double Team",
      "runtime": 93,
      "poster_path": "/pRGhrtm5zAnsblDI5xXzzwVcHY6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Mandalay Entertainment",
            "id": 1236,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-04",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "America's top counter-terrorist usually works alone... this time he's got company.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Hark Tsui"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Don Jakoby",
         "Don Jakoby"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119013/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMTI3NTE3Ml5BMl5BanBnXkFtZTcwMDM5NTgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Claude Van Damme, Dennis Rodman, Mickey Rourke | See full cast and crew »"],
      "reviews": [
         "The script for Double Team was originally called \"The Colony\" and by several accounts, it was actually quite good. Apparently, it went through many major alterations on its way to production until the final product bore little resemblance in tone and quality to the original script. Does this mean Double Team is a disaster? Not really, but its clear all the changes created some problems. On the one hand, you have the participation of famed Hong Kong director Tsui Hark and world-class cinematographer Peter Pau. They manage to create some of the coolest, trippiest, most fantastical visuals this side of a MTV video and better still, do so without the excessively choppy editing that usually accompanies \"MTV-style\" films. You actually get to appreciate the luxuriously-shot images, though the film is by no means slow-paced. Better still, it's one of the few Van Damme movies that realizes the best Van Damme movies are the ones which absolutely never rely on Van Damme's acting (or anyone else's for that matter) to carry the film along. It's all action, goofily entertaining plot twists, and sweet visuals. As an action-packed, overblown, eye-candy fantasy, Double Team works very well. On the other hand, it's painfully obvious that Double Team used to have a smarter script which called for a far more subtle and serious approach. Had these \"intelligent\" elements been completely erased or dumbed-down for the final product, this wouldn't have been a problem. However, it seems that some of the more subtle plot developments were left in and they do NOT mesh well with Tsui's and the rest of the final script's \"jackhammer\" approach to the story. For example, at one point a prescription label left on the wall is supposed to be noticed by Van Damme's character who then uses the name of the doctor on the label as a clue. However, unless you're paying very very close attention you'd never know that. It's so small on screen, the label may as well have been blank. And the shot where the label is taken off the prescription bottle is far too quick and unclear. A single extra shot showing a closeup of the label would've cleared things up immensely. But it never happens. The film contains several instances like this where a single clarifying shot or an extra line of explanatory dialogue would've made things much clearer. The result is that what seem like glaring plot holes (even for this kind of movie) are in fact due to badly explained plot points. Such an obscure presentation might have worked on a quieter, more \"intelligent\" spy film where the audience knows they aren't going to be spoon-fed the plot. But after 40 minutes of terrible one-liners and ridiculous action, the last thing that should be required of Double Team's audience is to suddenly pay close attention to what's happening. I don't know whether Tsui Hark was trying to keep in some subtle elements while reconciling it with the rapid-fire approach, or whether he just didn't care about such details and wanted to keep things moving (Probably the latter, as his subsequent movie, Knock Off, experimented with this abstract, to-hell-with-storytelling visual approach to the nth degree). Whatever the case, the result is a pretty wild but somewhat confusing action movie that could've been much better with minor changes.",
         "Continuing the tradition of successful Hong Kong directors going to Hollywood only to end up directing Jean-Claude Van Damme movies comes Tsui Hark with 'Double Team'. John Woo must have gotten lucky when he went to Hollywood: Ringo Lam is still making Van Damme movies, and Tsui Hark went back to Hong Kong after this and 'Knock Off'. I have nothing against Van Damme, but he seems to be some sort of trial-by-fire for any Hong Kong director with ambitions of making action films in Hollywood: If a director succeeds, he go on to Dolph Lundgren and then mainstream Hollywood action (John Woo), otherwise the director is faced with sticking with Van Damme movies or going back to Hong Kong. Counter-terrorist Jack Quinn (Van Damme) is planning to retire after one final mission to nail the villainous Stavros (Mickey Rourke). The mission goes incredibly wrong: Stravos gets away, but somehow his son is killed in the cross-fire. Out for revenge, Stavros kidnaps the pregnant Kathryn Quinn (Natacha Lindinger), and the only way Jack can save is wife is team up with Yaz (Dennis Rodman) and kick-box his way to a happy ending. Watching 'Double Team', I thought it was pretty clear than even Van Damme realizes that his movies are a joke to all but the most hardcore of action fans. Australian sketch comedy show 'Full Frontal' (featuring a not-so-famous Eric Bana) regularly took stabs at Van Damme for a good year or so (\"YOU LAUGHTER CRACKIN' AT ME? ARRRGGGHHHHH!\"), coincidentally around when 'Double Team' would have been released. At no point does 'Double Team' make any attempt to be taken as a serious action movie. All the fight scenes are played for laughs, if only slight chuckles. Van Damme gets to fight a tiger and use a coke-machine to shield himself from an explosion. All it really amounts to be is 90 minutes of action fun. While fans of director Tsui Hark would be disappointed with this effort, something good came of Hark's short-lived collaborations with Van Damme: He went back to Hong Kong and directed the incredibly awesome 'Time and Tide' (which did not feature Jean-Claude Van Damme at all). 'Double Team' doesn't come to close to being one of Van Damme's best, and it might not even please hard-core Van Damme fans, but its all in good fun - 5/10",
         "His on-the-court abilities envied (no, I didn't say his \"personality\") by most aspiring NBA forwards, Dennis Rodman teams up with the envy of most men, and the heart throb of most women, Jean-Claude Van Damme, in a high intensity, destroy everything in the way, movie! Backed by a stellar performance by Mickey Rourke, the trio do well at keeping you on the edge. Did you ever think that Dennis Rodman might one day make good as an actor? Neither did I, but when the perfect part is filled by the perfect character, anything is possible. Dennis portrays a quirky, black market arms dealer. He also happens to know counter-terrorist, Jean-Claude Van Damme, pretty well. Opening scenes display a normal evening of crowds, laughter, and screams of enjoyment and thrills. These typical carnival sounds are soon stifled by screams of terror as automatic weapons are opened up on the crowd. Van Damme is on the scene, however. He chases down the villain, Rourke in a multi level building (looked like a hospital). Windows exploded as bullets wized through them from all directions. grenades tossed by Rourke destroyed all in their path. Just as Van Damme gets Rourke cornered, the villain slips into a nursery full of baby beds. Rourke uses Van Damme's weakness for valuing human life against him here. Using two well placed incendiary grenades Rourke kills agent Van Damme in the dual. Leaving behind a pregnant wife, Van Damme is dead to the outside world. The agency for which he works, has him recovering on a remote and top secret island. Here he is to track the world's most nefarious terrorists (by way of a massive satellite computer) and offer advice to agencies on how to capture or destroy them. Van Damme is also informed that he may never leave the island and must report to a fingerprint screen at certain times of the day in his room in order that his constant presence may be accounted for. A violation of the rules set forth on the island would be cause for his actual termination from existence. Passion for regaining control of his life, and a deep, bitter sense of revenge against Rourke are all that he can focus on as he continues to recover from wounds and works to strengthen his body again. O-kay, where does Dennis Rodman come into the picture, you may be asking. No man can always stand alone. Watch and discover how Van Damme plans his escape back to real life, and what part Dennis will play in taking down his arch nemesis, Rourke. I love Van Damme movies. I pretty much enjoy most martial artist flicks, though. Stellar performances by Van Damme and Rourke as usual, backed by a surprisingly great performance by an unlikely star, as well as lots of fast-paced action, kept me in tune with the movie right from the start,and all the way to the closing credits! A fantastic film for the high intensity, action enthusiast!",
         "I just love bad movies. Now many don't make the cut because they simply don't suck to the magnitude needed to make them a \"bad classic\". This film, however, rockets past others and makes no attempt to disguise its crap-value by including a good actor, plot twist, or a clever bit of dialogue. No, this movie fails (succeeds?) in all categories. I went to the premiere a couple of years back, and still regret that fateful day. Only one other film has traumatized me to that extent (I payed full admission for Congo on the premiere...). Sometimes, no amount of comments will prepare you for a true impact of a film. Schindler's List, Kids, Saving Private Ryan, and... Double Team. See this movie, you will never be the same again.",
         "Despite the strong start, Van Damme movies certainly fell off in quality as the 90's went on. DOUBLE TEAM is easily one of his lesser efforts despite some inspired casting and a few somewhat new ideas. Unfortunately, you've seen almost all of it before, including the name, which is almost indistinguishable from DOUBLE IMPACT or DEATH WARRANT. The idea of Van Damme teaming up with Dennis Rodman is so ludicrous that it's worthwhile for novelty\u0085 and the icing on the cake is that the two team up against Mickey Rourke\u0085 and have a 3-way shirtless fistfight in what I assume is supposed to be the Roman Coliseum (plenty of shades of RETURN OF THE DRAGON) at the end too\u0085 with a Tiger and landmines to boot! Well, the overall plot about Van Damme's pregnant wife getting kidnapped so Rourke can replace his adopted son with Van Damme's (?) doesn't amount to a hill of beans and quite poorly links together its many action sequences. The only neat non-action bit is a long section dealing with Van Damme going off the grid and joining a \"colony\" of other former CIA agents who have faked their own deaths. The flipside is that this lifestyle isn't quite utopic and ends up being a prison (a la \"The Prisoner\") for Van Damme as he's playing the same revenge-driven character he always plays. Rourke and Rodman are equally 1-dimensional and Rodman manages to change his costume (and hairstyle) repeatedly between scenes which supposedly take place on the same day! It turns out that the whole faking-his-death thing was completely pointless as the first thing Van Damme does when he escapes it to lure Rourke into a trap which he blows right away once he spots his wife and tries to run after her\u0085 but whatever, we're not in this sort of thing because of the story. We're here to see Van Damme kick people in the face and break things. Unfortunately it's marred heavily with lots of intentional humor and bad basketball-related one-liners from Rodman's character, who I'm pretty sure isn't far different from Rodman himself. See? If your actors can't act, just not have them even bother trying to take on characters. Works like a charm. Fans of Italian crime and action movies will have a field day spotting cameos by some genre stalwarts. Bruno Bilotta (aka Karl Landgren), star of numerous poor 80's exploitation films, plays Rourke's main sniper and even scores a fight scene with Van Damme! Ottaviano Dell'Acqua plays a random Italian agent gunned down in glorious slow motion while Angelo Ragusa gets stabbed in the back and shot by a pair of not-so-helpless women. Ted Rusoff (a perennial figure in the world of ADR and voice dubbing going back to the AIP days of Samuel Z. Arkoff) plays a monk for the umpteenth time and even eurocrime great Orso Maria Guerrini is wasted in a nothing background role with no lines! This is no exception to the endless cycle of Van Damme teaming up with Hong Kong directors to attempt to repeat the same success as HARD TARGET and do for the likes of Ringo Lam what that film did for John Woo. Director Tsui Hark makes sure to throw in some patented kung fu fight scenes complete with plenty of gunplay, knifeplay, and attempts at strangulation. Add to that a complete overboard use of dutch angles and requisite poor CGI to make one generic 90's action movie experience complete! Worth it just to see Van Damme side-kick a growling tiger in the face, even if it does seem more the work of VFX than choreography.",
         "Double Team is the third movie that Van Damme has done for a former HONG-KONG action-movie director. He has done \"Hard Target\" for John Woo and \"Maximum Risk\" for Ringo Lam. Double Team is directed by rather splendid Tsui Hark. Hark is excellent at directing action-scenes and Double Team is a good way for him to start in Hollywood. Van Damme plays agent Jack Quinn, and is sent out to kill super-terrorist Stavros, who is played by Mickey Rourke. Quinn fails and is therefore sent sent to a place called \"The Colony\". \"The Colony\" is a place where the world's most dangerous terrorists/agents are sent. These agents/terrorists are too dangerous to go free on the street and too valuable to kill. Quinn escapes from the colony and goes after Stavroes for revenge. Quinn is helped by Yaz, who is played by the basket-star Dennis Rodmann. Double Team is full of well made action and martial-art scenes. However, it`s far from perfect. The whole plot is very silly, there are huge logical gaps and holes in the story and Mickey Rourke is far from convincing as a villain. Double Team isn`t a film for everybody. But it`s definetly worth to rent it for an action-fan. I give this movie 7 out of 10.",
         "WOW! I think Van-Damme out did himself on this one. Before you watch this movie you have to prepare yourself for the non-stop action, I mean non-stop. Rodman, even has a couple good one-liners, but not as good as Van-Damme. The movie is probably one of the most entertaining masterpieces that the action genre has seen. Van-Damme really puts his skills to work in this movie, and Mickey Rourke was cast perfectly in this movie, and his on-screen chemistry with Van-Damme is just spectacular. A brilliant story line and Damme good action are what really bring this movie together, the action scenes are like watching Michelangelo's David take shape and all you can do is stand in awe at it's beauty. Van-Damme is a man on a mission, and won't stop for anything on this roller coaster ride of excitement, laughter, and adventure.",
         "(Contains minor spoilers) In contrast to the many negative reviews, I really enjoyed this movie very much. You mustn't take it serious, that's the point. There are so many scenes which are so incredible ridiculous that it makes a good movie again: Rodman throwing bad guys around like they were basketballs, the Colloseum exploding (!) and the Coke Machines flying around, that knife toe guy... fantastic. Mickey Rourke is great - he only knows to play one kind of man: a brute ashtray macho villian, but he's a real expert in that. Even Van Damme is good: his first film without having him suffering all the time (I used to think, he is some kind of \"anti-hero\" because he is allways suffering so much in his movies). The directing and camera work is really amazing, the plot is ridiculous, but the Action is highly enjoyable.",
         "A lot of people seem to forget that Van Damme isn't trying to make a really great movie. He doesn't usually care about the plot or the acting. He wants to make an action movie. That is the only reason I ever watch his movies and he never fails to deliver, including in this movie. Sure you cringe at the corny acting and dialogue when it happens, but the action sequences totally make up for it. I also enjoy when a movie doesn't take place in the US or Canada. I'm just bored with that. In this movie they go to Antwerp and Rome. Very cool settings for the movie. Over all I was quite pleased. The director, Tsui Hark (I have NO idea how you pronounce that), is always quite reliable in making a good action movie. It was just a good action movie, people. Don't look at it for more than what it was.",
         "I actually really enjoyed this JCVD effort, it a had a fair but of money thrown at it in this case $30m plus, it's stylishly filmed, JCVD is as wooden as ever, but there's plenty of action which is what you want in a JCVD flick, and I even don't mind Rodman's performance, he's far from being the worst actor I've ever seen, but the worst part of this movie is that it becomes needlessly complicated especially on the 'Island' which is a reference surely to the 1960's cult TV show with the now late Patrick Mcgoohan. This film ended up looking like a very good Straight to Video job which is why it surely tanked at the Box Office & after a few more theatrical disasters such as Knock Off & Universal Soldier: The Return (neither of which were that bad) JCVD has been reduced along with Steven Seagal,Dolph Lundgren & Wesley Snipes into straight-to-DVD releases of varying quality but he still has a loyal band of fans who rent/buy these releases, me included. ***1/2 out of *****"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Mandalay Entertainment",
         "One Story Pictures",
         "Columbia Pictures"
      ],
      "summaries": [
         "Counter-terrorist Jack Quinn misses his target, Stavros, on the eve of his final mission. From there, he is sent to \"The Colony\", a rebirth for presumed-dead assassins. He breaks free from there, and seeks the aid of Yaz, a weapons dealer, for his final battle with Stavros.",
         "Having retiring from the CIA, where he was an anti-terrorist operative, Jack Paul Quinn spends his days poolside at his house in Nice, France with his pregnant wife Katherine Rose Quinn. But international terrorist Stavros, an old enemy of Quinn's, has resurfaced, and the CIA wants Quinn to come out of retirement, and go after Stavros. Quinn reluctantly accepts the assignment. Quinn goes to Antwerp, Belgium and hooks up with flamboyant arms dealer Yaz, who has the newest fully-automatic weapons. With Quinn's assembled delta-force, an ambush is set for Stavros at a local amusement park. Stavros arrives, and greets his girlfriend...and his son. Quinn finds himself unable to shoot Stavros with his son. This moment of hesitation is costly, and Quinn's entire team is killed off in a shoot-out with Stavros' men -- a shoot-out in which Stavros's son and girlfriend are both killed. Quinn chases Stavros into a nearby hospital, and they battle it out in a nursery full of newborn babies. Quinn is knocked out cold, and Stavros escapes, vowing revenge on Quinn for the deaths of his son and girlfriend, not knowing that Quinn was not the agent who killed them. When Quinn comes to, he finds himself in \"The Colony,\" a place where \"those who are too valuable to kill and too dangerous to set free\" use their special skills around the world as \"the last line of defense against global terrorism.\" Using virtual reality and mouseless-graphical-user-interfaces, they solve all the world's bombings, hijackings, and terrorist attacks. The only problem is that no one can ever leave The Colony. That's why Quinn's superiors tell Katherine that Quinn is dead. Not long after his arrival, Quinn finds evidence that Katherine is being targeted by Stavros, and so Quinn hatches an elaborate plan to escape from the Colony so he can protect Katherine. Once out of The Colony, Quinn hooks up with Yaz, and they learn that Stavros has kidnapped Katherine and taken her to Rome, planning to get revenge on Quinn through the baby, which Katherine has given birth to. Quinn and Yaz set out for Rome to rescue Katherine. It all comes to a head in a Roman coliseum in a showdown featuring a tiger, land mines...and the baby.",
         "Jack Quinn, Yaz, and Stavros don't belong to any army and they don't play by any rules. This action-espionage thriller ignites in the cloak and dagger world of international spies, covert agents and high-tech terrorists.",
         "Jack Quinn is top counter-terrorist, and before his final mission he misses terrorist Stavros. Stavros had his son killed in earlier fight and as revenge he is hunting Quinn's pregnant wife. Quinn joins forces with vivid arms dealer Yaz to fight Stavros."
      ],
      "budget": 30000000
   },
   "movielensId": 1497,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-04-04",
      "dvdReleaseDate": "1998-03-31",
      "directors": ["Tsui Hark"],
      "runtime": 93,
      "movieId": 1497,
      "title": "Double Team",
      "mpaa": "R",
      "actors": [
         "Jean-Claude Van Damme",
         "Dennis Rodman",
         "Mickey Rourke",
         "Paul Freeman",
         "Valéria Cavalli",
         "Bruno Bilotta",
         "Mario Opinato",
         "Ottaviano Dell'Acqua",
         "Angelo Ragusa",
         "Ted Rusoff",
         "Umberto Raho",
         "Orso Maria Guerrini"
      ],
      "imdbMovieId": "0119013",
      "originalTitle": "Double Team",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["S3qxgFbThIU"],
      "plotSummary": "He's a one-man arsenal... with enough voltage to rock the free world. They Don't Play by the Rules. You're either on their side...or in their way. America's top counter-terrorist usually works alone...this time he's got company.",
      "tmdbMovieId": 9405,
      "avgRating": 2.29248,
      "releaseYear": "1997",
      "numRatings": 824,
      "posterPath": "/pRGhrtm5zAnsblDI5xXzzwVcHY6.jpg"
   }
}