{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "blackmail",
         "id": 1936
      }],
      "imdb_id": "tt0116762",
      "video": false,
      "title": "Keys to Tulsa",
      "recommendations": [
         27984,
         39140,
         58028,
         76800,
         24073,
         15719,
         42570,
         24050,
         40876,
         42176,
         29162,
         26271,
         1873,
         21176,
         19753,
         52471,
         1363,
         23312,
         78406,
         32035
      ],
      "backdrop_path": "/q1DXyNWXejDeyAXnv5CePddpnoN.jpg",
      "revenue": 57252,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Richter Boudreau",
               "gender": 2,
               "credit_id": "52fe4bf0c3a36847f8219e09",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ronnie Stover",
               "gender": 2,
               "credit_id": "52fe4bf0c3a36847f8219e0d",
               "name": "James Spader",
               "profile_path": "/gFDjZje8P0S3MzHuw1cxiYuHBX5.jpg",
               "id": 13548,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Vicky Michaels Stover",
               "gender": 1,
               "credit_id": "52fe4bf0c3a36847f8219e11",
               "name": "Deborah Kara Unger",
               "profile_path": "/ye75IqbNmFdEuvU9Td0eFKwtA0i.jpg",
               "id": 13549,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cherry",
               "gender": 1,
               "credit_id": "52fe4bf0c3a36847f8219e15",
               "name": "Joanna Going",
               "profile_path": "/8wPmJGGj4HEUfaYzYjoL1AzOSlf.jpg",
               "id": 59662,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Keith Michaels",
               "gender": 2,
               "credit_id": "52fe4bf0c3a36847f8219e19",
               "name": "Michael Rooker",
               "profile_path": "/bvmf7TIjCyRPrBNrmZ5qyePTL5y.jpg",
               "id": 12132,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Cynthia Boudreau",
               "gender": 1,
               "credit_id": "52fe4bf0c3a36847f8219e1d",
               "name": "Mary Tyler Moore",
               "profile_path": "/xUPqdaH5E8FsXIwuT4vccz7l6Xl.jpg",
               "id": 21277,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Harmon Shaw",
               "gender": 2,
               "credit_id": "52fe4bf0c3a36847f8219e21",
               "name": "James Coburn",
               "profile_path": "/sEouHlYr1hOzl3u6E4KV6gIJSPd.jpg",
               "id": 5563,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Chip Carlson",
               "gender": 2,
               "credit_id": "52fe4bf0c3a36847f8219e25",
               "name": "Peter Strauss",
               "profile_path": "/ufx1trct43k7UcT4DpoIMPZXi5A.jpg",
               "id": 21368,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Trudy",
               "gender": 1,
               "credit_id": "52fe4bf0c3a36847f8219e29",
               "name": "Cameron Diaz",
               "profile_path": "/ahFkUN9Sm8oF1txUHE5JcJ95Ere.jpg",
               "id": 6941,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Bedford Shaw",
               "gender": 2,
               "credit_id": "52fe4bf0c3a36847f8219e2d",
               "name": "Marco Perella",
               "profile_path": "/ppQo61R0oYdyFVOI1YP6jImUbPU.jpg",
               "id": 994259,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4befc3a36847f8219e05",
               "name": "Leslie Greif",
               "profile_path": null,
               "id": 51575,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56bdea2fc3a36817ef003a5c",
               "name": "Brian Fair Berkey",
               "profile_path": null,
               "id": 1576304,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "56bdea3ac3a36817f4003b71",
               "name": "Harley Peyton",
               "profile_path": null,
               "id": 15795,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56bdea4d925141734d00391e",
               "name": "Stephen Endelman",
               "profile_path": "/1ey21aHi5U3FS5iZeVwvnodwSrX.jpg",
               "id": 21276,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56bdea58c3a36817f90037ed",
               "name": "Robert Fraisse",
               "profile_path": null,
               "id": 2596,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56bdea6992514173560039b0",
               "name": "Derek R. Hill",
               "profile_path": "/bNW0bkugEjK2Hu9Kic5HgVL75LT.jpg",
               "id": 12131,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "56bdea76925141734d003926",
               "name": "Marie France",
               "profile_path": null,
               "id": 60479,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "56bdea9b925141734d003930",
               "name": "Leslie Greif",
               "profile_path": null,
               "id": 51575,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56bdeaa99251417359003946",
               "name": "Harley Peyton",
               "profile_path": null,
               "id": 15795,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56bdeab892514140a6001846",
               "name": "Peter Isacksen",
               "profile_path": null,
               "id": 106250,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56bdeac8925141734d003942",
               "name": "Michael Birnbaum",
               "profile_path": null,
               "id": 31708,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.569448,
      "production_countries": [],
      "id": 118991,
      "vote_count": 6,
      "budget": 0,
      "overview": "Richter Boudreau is on a bad streak: Languishing in the shadow of his celebrity mother, he loses his job as a film critic for the town paper, and now he's been approached with a dangerous proposition that ultimately leads to blackmail. Richter's friend Ronnie ropes him into a scheme to steal the inheritance of his wife, Vicky.",
      "similar": [
         30159,
         4771,
         320,
         3597,
         1645,
         9445,
         521,
         9769,
         910,
         4723,
         109099,
         403642,
         118534,
         28055,
         68626,
         352173,
         30346,
         35080,
         27622,
         10349
      ],
      "original_title": "Keys to Tulsa",
      "runtime": 113,
      "poster_path": "/vfWpvdOslSYuB9SFcolypW1gsjN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-04-11",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Two Men Taken By One Woman",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Leslie Greif"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Brian Fair Berkey",
         "Harley Peyton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116762/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMDQ5ODQ3Ml5BMl5BanBnXkFtZTcwMDUwMTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Eric Stoltz, James Spader, Deborah Kara Unger | See full cast and crew »"],
      "reviews": [
         "Call me crazy, but I really enjoyed this flick. I'm not nominating anyone for awards, but can't help but love the cast. Being a heterosexual male, I am in TOTAL love with Joanna Going and Deborah Unger. SO SHOOT ME. This one's for fun, gang. Not all movies have to reinvent the wheel. So pop a cool one and dig in...",
         "Forget what some of those other reviewers said--this is a good movie! (Perhaps the plot twists were a little too challenging for them to follow.) The acting is great--especially Deborah Unger and James Spader. And Mary Tyler Moore does a great holier-than-thou slut-turned-society-swell. And Cameron Diaz is dead-on as a ditzy blind date. And Joanna Going does a hot striptease. And ... and ... hell, just see it.",
         "The first time I watched this movie, I hated it. The second time I watched it, I liked it. The third time, it actually started to make sense. So ultimately there IS a cohesive plot, you just have to really pay attention, or watch it a few more times, which you won't mind doing if you like seeing a very-close-to-naked Eric Stoltz or a viciously sexy James Spader strutting around like Elvis. Or, if you prefer women, there's the beautiful and talented Deborah Unger, some gratuitous strippers, and this completely unrealistic Cherry girl who keeps peeling off her clothes at the first drop of alcohol. The reason I didn't like this film is the dialogue is so trite and predictable that you roll your eyes after every other line, and even though 1997 wasn't that long ago, this film feels completed dated. The didjeri doo (however you spell it) music is completely out of place, and obviously just trying to be trendy. Cameron Diaz serves no purpose except to be annoying, and the Keith/brother character is so offensive and unlikable that I was actually disappointed when he didn't blow his own head off. The 'adolescent male' conversation he has in the bar with Richter was almost enough to make me stop watching. I did think the acting was good. I especially liked the interplay between James Spader and Deborah Unger. These two also appeared as a married couple in David Cronenberg's Crash, but their characters in that were completely different. So I thought this film was a good example of their versatility. Otherwise, the film is worth a rent to see James Coburn say 'sit down son, have a . . . nut.' And of course, half naked Eric Stoltz and James Spader as Elvis. Can't go wrong there!",
         "While I may be wrong about many things, compelling trash is not one of them. This film, like the much under-appreciated \"Freeway\" is NOT a \"so-bad-it's-good\" film. Rather, it is \"Dynasty\" for very corrupt smart folks. The film has a definite made-for-cable pace, but I think this adds to its \"colored-umbrella in my drink\" ambiance. Kind of like \"Miami Vice\" should have been. The primary reasons to see this film are the acting and the script. First, Eric Stoltz is wonderfully blissed out and funny. Second, Spader does a great stretch in this film, and he makes the catch. Third, Ms. Going walks on water. Fourth, so does Michael Rooker. Trust me; you really want to see James Coburn say \"We, Richter, we're men, we love our women badly.\" It's a grade \"A\" genuine hoot and a half. And Cameron Diaz has precisely 3 minutes of screen time.",
         "Keys To Tulsa spends most of its two-hour length teetering on the brink of being a convoluted mess, but the wit and charm of the script and the cast combine to make it a worthwhile watch. Eric Stoltz is hilarious as the hapless Richter, delivering some great one-liners and generally appearing to enjoy the hell out of most of the movie despite his character's fairly pathetic situation. There are a lot of characters with a lot of back story in Keys To Tulsa, and at times it's easy to forget who has done what to whom. (There are also three characters named Richter, Victor and Vicki in this movie, which may work on paper, but phonetically it's a little jarring, and there's no apparent reason for them to have such similar-sounding names.) Overall, though, it works as kind of a slapsticky film noir. Mary Tyler Moore is a scream as Richter's mother, and Michael Rooker is reliably freaky as Richter's childhood friend. Give this one a shot. It's not what you'd call high art, but it's a lot of fun.",
         "Handsome red-haired Eric Stoltz (as Richter Boudreau) has trouble making ends meet on the salary he makes as a \"Tulsa\" Okalahoma newspaper movie critic. One end he likes to meet is his nose to a line of coke, though Mr. Stoltz never seems to get a buzz off the stuff. He also smokes cigarettes constantly, probably because nobody told him you have to inhale the dammed things for the desired effect; since the character Stoltz plays would work just as well if he did not smoke, why he pretends is a mystery. Another end Stoltz likes to meet is the one that finds what he calls the \"nether regions\" of topless house-guests who spread their legs, like strung-out stripper Joanna Going (as Cherry). Her line, \"Sometimes I feel like a little animal protein,\" is a tip off. Ms. Going is introduced by Stoltz' dark hair-dyed dealer James Spader (as Ronnie Stover). Mr. Spader, who fills his tight clothing well, is married to Stoltz' lusciously lusty ex, Deborah Kara Unger (as Vicky). Trigger-happy Michael Rooker (as Keith) connects everyone. Supporting and cameo shots come from Mary Tyler Moore, James Coburn, Cameron Diaz, and Peter Strauss. The DVD sleeve touts Ms. Diaz as one of the top-billed stars, but her \"comic\" interlude lasts only a few minutes. The synopsis reads, \"The black sheep son of a wealthy Tulsa family returns to the world he'd renounced and is forced into a blackmail scheme by his high school sweetheart's menacing husband. When he helps the only eyewitness to a murder, he gets caught in a web of revenge, deceit and redemption.\" Sometimes \"Tulsa\" seems an awful lot like a \"Hollywood\" acting class. Stoltz seems to play it straight, while most of the others seem to be having some scenery-chewing fun with their characters. This film was promoted as a \"crime thriller\" but often looks like it was really intended to be a \"comedy thriller\" - at least, that is how it comes across. In any case, it's not entirely clear - or successful - but the society \"party\" scene is funny, with Ms. Moore, Going and Josh Ridgway (as Billy) seeming to capture the film's mood. ***** Keys to Tulsa (11/20/96) Leslie Grief ~ Eric Stoltz, James Spader, Joanna Going, Mary Tyler Moore",
         "\"Keys To Tulsa\" is not completely uninteresting - that would be impossible with the cast it has (including a made-up-to-look-like-Elvis James Spader and a HOT Deborah Unger). But the story never seems to build and the movie drags from one purposeless dialogue scene to another; it goes on so long that it begins to resemble a soap opera. Certainly the only two tense scenes are not enough for the \"thriller\" this was misleadingly promoted as. (**)",
         "Had this been produced by a major studio with an experienced director at the helm, this movie would of been so much better. Keys to Tulsa contains both the look and music of countless straight to video/cable movies from the same period. Which is a shame because the cast is great and was clearly game for anything. Fans of David Cronenberg's Crash will find it amusing to see James Spader and Deborah Kara Unger reuniting, playing a trailer trash couple instead of a yuppie couple. But just like in Crash, their characters aren't exactly faithful to each other. However it's the beautiful Joanna Going who steals the show, looking like a skinnier and smaller breasted Alyssa Milano as the stripper named Cherry who is constantly under the influence of drugs and/or alcohol at all the wrong times. It's surprising to know that she was around 34 when she made this movie, as she looks more like 24. Adding more insult to her great performance, despite her large role her name nor picture is nowhere to be found on the region 1 DVD case from Artisan. Meanwhile, Cameron Diaz who only has a cameo that lasts a few minutes at the beginning of the film has second billing.",
         "This is a really good movie. I mean that. Great acting, dialogue, and full bodied plot keep this film moving just fine. You'll need to dig this one up in VHS at your local video dealer, but it's well worth the search. This one's a gem. 7 of 10",
         "About twenty minutes into this movie, I was already bored. Quite simply, these characters were fairly dull. Occasionally, something enjoyable would happen, but then things would slow down again. Fortunately, my patience was eventually rewarded, and the ending to this movie wasn't bad at all. However, it was by no means good enough to justify sitting through the first ninety minutes. So, I would say that the movie was mediocre overall, and considering all of the talent in the cast, I'd call this a disappointment."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Empire Pictures",
         "Incorporated Television Company (ITC)",
         "Polygram Filmed Entertainment"
      ],
      "summaries": ["Richter Boudreau is a son of local celebrity Cynthia who is not very successful and works as a film critic for local newspaper. In a short time he loses his job, heritage, and one of his \"friends\" starts to blackmail him. His only hope is that others around him are even bigger dummies."],
      "budget": 0
   },
   "movielensId": 1501,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-04-11",
      "dvdReleaseDate": "2002-12-17",
      "directors": ["Leslie Greif"],
      "runtime": 113,
      "movieId": 1501,
      "title": "Keys to Tulsa",
      "mpaa": "R",
      "actors": [
         "Eric Stoltz",
         "James Spader",
         "Deborah Kara Unger",
         "Joanna Going",
         "Michael Rooker",
         "Mary Tyler Moore",
         "James Coburn",
         "Peter Strauss",
         "Cameron Diaz",
         "Marco Perella"
      ],
      "imdbMovieId": "0116762",
      "originalTitle": "Keys to Tulsa",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Richter Boudreau is on a bad streak: Languishing in the shadow of his celebrity mother, he loses his job as a film critic for the town paper, and now he's been approached with a dangerous proposition that ultimately leads to blackmail. Richter's friend Ronnie ropes him into a scheme to steal the inheritance of his wife, Vicky.",
      "tmdbMovieId": 118991,
      "avgRating": 2.57311,
      "releaseYear": "1997",
      "numRatings": 212,
      "posterPath": "/vfWpvdOslSYuB9SFcolypW1gsjN.jpg"
   }
}