{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "necrophilia",
            "id": 5919
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116783",
      "video": false,
      "title": "Kissed",
      "recommendations": [
         465,
         69324,
         25636,
         36832,
         205763,
         1836,
         148547,
         94653,
         196625,
         55613,
         289933,
         147553,
         16539,
         131933,
         106222,
         3173,
         13414,
         41801,
         13021,
         26195
      ],
      "backdrop_path": "/f0XiCsqRawJITSsYImJNvKcJ80V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sandra Larson",
               "gender": 1,
               "credit_id": "52fe4422c3a368484e01143f",
               "name": "Molly Parker",
               "profile_path": "/iCG1XrXkg09R9eK52PYUEA3HVX5.jpg",
               "id": 27125,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Matt",
               "gender": 2,
               "credit_id": "52fe4422c3a368484e011443",
               "name": "Peter Outerbridge",
               "profile_path": "/a3OpOcxpBWi30MsgFTYLsWFwFoV.jpg",
               "id": 12978,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mr. Wallis",
               "gender": 2,
               "credit_id": "52fe4422c3a368484e011451",
               "name": "Jay Brazeau",
               "profile_path": "/oSFswqMxjLCAwVpEG2yK6NzLUiP.jpg",
               "id": 63791,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Young Sandra",
               "gender": 0,
               "credit_id": "52fe4422c3a368484e011455",
               "name": "Natasha Morley",
               "profile_path": null,
               "id": 1193401,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Carol",
               "gender": 0,
               "credit_id": "56007348c3a368062200008f",
               "name": "Jessie Winter Mudie",
               "profile_path": null,
               "id": 1513189,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Jan",
               "gender": 0,
               "credit_id": "560073559251415c5c00009f",
               "name": "James Timmons",
               "profile_path": null,
               "id": 1513190,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Biology Teacher",
               "gender": 0,
               "credit_id": "56007369c3a36806190000c9",
               "name": "Joe Maffei",
               "profile_path": null,
               "id": 1235368,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Detective",
               "gender": 0,
               "credit_id": "56007376c3a36806190000cb",
               "name": "Robert Thurston",
               "profile_path": null,
               "id": 1235485,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Mother Larson",
               "gender": 0,
               "credit_id": "5600738cc3a36806280000b5",
               "name": "Annabel Kershaw",
               "profile_path": "/1VqbvAohBwFhETZtDe76JXQcxKm.jpg",
               "id": 53715,
               "order": 8
            },
            {
               "cast_id": 3,
               "character": "Father Larson",
               "gender": 2,
               "credit_id": "52fe4422c3a368484e011447",
               "name": "Tim Dixon",
               "profile_path": "/jVSmxZvN880UdLmIURsNsBbGlYZ.jpg",
               "id": 87740,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4422c3a368484e01145b",
               "name": "Angus Fraser",
               "profile_path": null,
               "id": 272210,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4422c3a368484e011467",
               "name": "Barbara Gowdy",
               "profile_path": null,
               "id": 150552,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "576852fac3a3682817000227",
               "name": "Lynne Stopkewich",
               "profile_path": null,
               "id": 1215282,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57685306c3a36807e0000548",
               "name": "Lynne Stopkewich",
               "profile_path": null,
               "id": 1215282,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.593505,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 21626,
      "vote_count": 27,
      "budget": 0,
      "overview": "Over the years, a child's romantic ideals about death blossom into necrophilia, the study of embalming and the most profound relationship of her life.",
      "similar": [
         258480,
         370663,
         244772,
         401898,
         12793,
         27586,
         858,
         141,
         634,
         242224,
         112160,
         376867,
         10818,
         11421,
         43923,
         340485,
         250124,
         513,
         11634,
         437557
      ],
      "original_title": "Kissed",
      "runtime": 78,
      "poster_path": "/hB4ghYHSZ3y2ItB0EohQEtADqKD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canada Council Media Arts",
            "id": 25686,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Boneyard Film Company Inc.",
            "id": 25687,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Columbia Film",
            "id": 10316,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-07",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Love Knows No Bounds.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lynne Stopkewich"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "Angus Fraser",
         "Lynne Stopkewich"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116783/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2NDEzMDE2Nl5BMl5BanBnXkFtZTcwNDM4NzAzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Molly Parker, Peter Outerbridge, Jay Brazeau | See full cast and crew »"],
      "reviews": [
         "There is no more natural preoccupation than death. Everyone is aware that they are going to die but no one knows precisely what death is. We all come to terms with our mortality in our own way. Most of us try to think about death as little as possible, choosing denial. Some turn to religion for comforting beliefs about death, others embrace a \"death culture\", as Goths do. A very small number of people embrace death to the extent that cadavers become sexually attractive to them. Kissed is a beautiful story about a young woman named Sandra who explores death through necrophilia. When Matt, a fellow student she becomes romantically involved with, becomes infatuated with her he desperately tries to understand her and to incorporate himself into her necrophilic lifestyle. They both, each in their own way, use the powerful nature of love and lust to explore their feelings about death. The acting is both professional and believable and the audience can relate to the complex characters even though none of us is ever likely to personally experience such a bizarre situation. Even when Matt's need to be loved by Sandra makes him strange and frightening, the story only feels more familiar when we realize how much we have changed ourselves for lovers. Isn't life about finding someone to love before the time is up? The sex and nudity are artistic, not pornographic. I went away from this movie feeling like I had witnessed something important and special. It may be disturbing at times, but Kissed is never revolting. I would not have believed that a movie about this subject matter could be so beautifully and sensitively made. If you ever find yourself anxious about death or plan to die someday, I highly recommend this passionate exploration of our most primal fear.",
         "I remember seeing this movie whenit was released in the theatres in Canada. We went to see the movie knowing nothing about it. I was a surprise as to the subject and I remember many people were shocked and repelled just by the subject. I was actually thrilled by the way the subject was approached. It wasn't vulgar, obscene or bawdy; on the contrary it was sensitive, almost romantic. One emphasizes with the main character, a girl who is attracted by dead persons. I felt seduced, almost hypnotised by many scenes. All in all a very special and an excellent movie, but one which may not be seen superficially.",
         "I loved this movie. I get so damn sick of the horror films that portray the funeral service and industry as gruesome, gory and horrifying. I am in the funeral service as well as mortuary school. First of all, I don't believe this movie is about necrophilia beneath the surface. It is about this woman's relationship with death. Gore, blood, guts and other stuff come from fear. There is no respect in that in my opinion. That is for people who are afraid of their own mortality. We are all going to die. It is beautiful that the director and writer were able to explore their relationship with death. Death is intriguing and dark because it is unknown. I think this movie really looked at the main character's relationship with death, herself and her own mortality through her love for the dead. Only, it was presented in a literal fashion. It seemed as though the plot was a great manifestation of the theme, which may be our understanding of life, death and rebirth. Yes, sex is life and death is rebirth. And yes, I find the idea of having sex with the dead literally repulsive, working with the dead on a daily basis. I don't believe that was the message of the movie. One thing I learned in the funeral service is that it is life that we deal with day to day, not death. It is helping the living deal with loss. That is love. If only there were more cerebral, psychological and spiritual movies that touch this topic but unfortunately we are left with gore!! Anyone know of any other movies like this?",
         "Film lovers: Please don't pay too much attention to the Marco Devilboy review of this unusual film. I can understand someone not enjoying KISSED because it deals with a supremely unappetizing subject. But then it quietly, delicately opens up that subject (and the characters involved) and wraps the viewer in an embrace that becomes both irresistible and horrifying. The movie works. When I first saw it, it introduced me to a young actress I have since followed and never seen give a bad performance: Molly Parker. Peter Outerbridge is wonderful, too. Recalling this film now, several years after first watching it, such a rush of thoughts and feelings come back to me that I will probably have to see it once again. If you are willing to go somewhere you never imagined you would find yourself--and then deal with what you discover there--KISSED is not to missed.",
         "This film is quite frankly the only one that has ever brought tears to my eyes. This compelling and profound stir of taboo makes quick work of my knees and I've grown quite fond of it. The acting in this movie was shockingly surreal. Their ability to guide the undertones in effect are rather impressive and my attempts at criticism can only accumulate around the sound editing in which some transitional music and whatnot seemed lesser than par. Nothing in this piece has been overworked or emphasized to exhaustion. I am more than impressed by the simplicity that guides an endless river of emotion in which it captures the one thing.. the one word so overused, abused and neglected; love.",
         "This movie is by far the most beautiful movie I have ever seen to date. If you like dark or Gothic movies, this is for you! The acting and story line is brilliant. I thought about this movie for weeks after I watched It. I like things like Six Feet Under, and morgue movies & TV shows. This film was excellent. How someone can be so fixated on one thing, makes it so beautiful. I might be sick to enjoy it by reading what the other persons comment said but it's not sick. These things do happen and this storyline is really interesting. Okay so you may not want see or hear about sleeping with corpses but if you look past that, you'll see the real beauty of the movie. I recommend this movie. You will not be disappointed!",
         "Maybe the greatest achievement of the film is that it was able to deal with an subject such as necrophilia without falling into tastelessness. It's easy getting horrified at the idea of people being sexually attracted for corpses, but the relationship of mankind with death (That primigenial and fascinating fear) can go that far and, if you think of it, it goes way far beyond . If you are not willing to get into any reflexions about how the dead are treated, you may fell uneasy about the film. The contrast between Sandra and the other people manipulating bodies (the teachers, the embalmer) is rather eloquent. But what I personally liked the best about it is how it figures relationships, elucidating the insane need of one not having the other have its own and private corner, the need of forcing the other to share it, and the woe that comes from not being able to stand it. In this line, necrophilia becomes just an excuse.",
         "Someone asked in another comment about why Matt, played by Peter Outerbridge, would give his life to Sandra, Molly Parker. It is simple. After reading the short story \"We So Seldom Look On Love\" written by Canadian author Barbara Gowdy (\"The White Bone\"), I came to understand the movie a little better. Matt is infatuated with Sandra. To be with her is complicated. The simplicity of love itself is not an issue here. He knows he cannot have her true love because that only goes to her \"special\" lovers. To truly feel, she must indulge herself in her passion. Matt is powerless and cannot give Sandra what she wants, until the end. He knows that only then can she love him completely. When Matt hangs himself, he crosses over and can be loved by Sandra the way he wants to be loved by her. As she performs her loving touch on him as one of her many lovers, Matt has become hers in mind, body and soul. He will be inside of her forever, the way he wanted to be.",
         "Movies about necrophilia are incredibly rare,mainly because this subject matter is too offensive for many filmmakers.So kudos should go to Lynne Stopkevich for creating this brave film(I'm dying to see her new feature \"Suspicious River\").\"Kissed\" isn't just another exploitation film-the depiction of necrophilia in it is really subtle.It's still more disturbing than many gross-out shockers,because it's so well-made.The acting is excellent and the direction is well-handled.So if you like this movie check out such necro-horrors like \"Aftermath\"(1993),\"Buio Omega\"(1979)and \"Neromantik\" series(1987,1992).The music(especially closing song)is amazing too!",
         "The story in this movie is, as often quoted, controversial - and its a story one could expect a great movie of. However, this one fails strongly to get deep into the issue, to what *really* drives Sandra (the girl in the movie) to her different sexual experiences, and likewise, how her \"boyfriend\" *really* feels about it which eventually leads to the tragic ending. It is very shallow and only touches on the edge of the mystery. 78 minutes running time could easily be extended by half an hour in order to incorporate this. A better script and a better director would probably lift the movie up to the unreasonable high average it has reached at IMDB..."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Boneyard Film Company Inc.",
         "British Columbia Film",
         "Canada Council Media Arts"
      ],
      "summaries": [
         "Sandra Larson has always been fascinated by the entire sensory experience surrounding death: its touch, smell and look. As a child, she would search out dead animals and perform ritualistic burials. As a young woman, Sandra gets a job at Wallis Funeral Home, first as a general assistant, then progressing to study to become an embalmer. At the funeral home, she begins to take her fascination with death to the next level by becoming a necrophiliac. But she also begins her first ever relationship with Matt, a medical student, with who she is totally open about her necrophilia. He finds this aspect of her compelling. He becomes all consumed with her as she is consumed with dead people. The questions become how far he will take this fascination with her to understand fully what is going through her emotional being, how far she will allow him to go, and how far can her feelings for him extend as a live being.",
         "Over the years, a child's romantic ideals about death blossom into necrophilia, the study of embalming and the most profound relationship of her life."
      ],
      "budget": 0
   },
   "movielensId": 1502,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-07",
      "dvdReleaseDate": "2005-08-23",
      "directors": ["Lynne Stopkewich"],
      "runtime": 78,
      "movieId": 1502,
      "title": "Kissed",
      "mpaa": "R",
      "actors": [
         "Molly Parker",
         "Peter Outerbridge",
         "Jay Brazeau",
         "Natasha Morley",
         "Jessie Winter Mudie",
         "James Timmons",
         "Joe Maffei",
         "Robert Thurston",
         "Annabel Kershaw",
         "Tim Dixon"
      ],
      "imdbMovieId": "0116783",
      "originalTitle": "Kissed",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["0-AjGvCSHmE"],
      "plotSummary": "Over the years, a child's romantic ideals about death blossom into necrophilia, the study of embalming and the most profound relationship of her life.",
      "tmdbMovieId": 21626,
      "avgRating": 3.34799,
      "releaseYear": "1996",
      "numRatings": 273,
      "posterPath": "/hB4ghYHSZ3y2ItB0EohQEtADqKD.jpg"
   }
}