{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mexico",
            "id": 534
         },
         {
            "name": "vacation",
            "id": 6876
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "head",
            "id": 33709
         }
      ],
      "imdb_id": "tt0118541",
      "video": false,
      "title": "8 Heads in a Duffel Bag",
      "recommendations": [
         29973,
         20678,
         9054,
         10896,
         38246,
         17207,
         31000,
         41852,
         13937,
         13997,
         61225,
         25164,
         53287,
         22590,
         48123,
         107934,
         157036,
         61418,
         55538,
         19324
      ],
      "backdrop_path": "/ylrePNdaQ6iqdp0LqlfEZAyg6fg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe45bf9251416c75061103",
               "name": "Joe Pesci",
               "profile_path": "/2CaYAhUZgkAeqtpIzuqGcqArsOy.jpg",
               "id": 4517,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Laurie Bennett",
               "gender": 1,
               "credit_id": "52fe45bf9251416c750610f7",
               "name": "Kristy Swanson",
               "profile_path": "/wxLklfVHTuVg3O7XT4vBpgzc0Tm.jpg",
               "id": 56128,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dick Bennett",
               "gender": 2,
               "credit_id": "52fe45bf9251416c750610fb",
               "name": "George Hamilton",
               "profile_path": "/2ryjNrkHMMyxwFQ4Z2cEIdiBvvh.jpg",
               "id": 3267,
               "order": 2
            },
            {
               "cast_id": 22,
               "character": "Annette Bennett",
               "gender": 1,
               "credit_id": "52fe45bf9251416c7506113f",
               "name": "Dyan Cannon",
               "profile_path": "/izkeTrXplwngcqgUhBBvepn7kbT.jpg",
               "id": 40403,
               "order": 3
            },
            {
               "cast_id": 24,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe45bf9251416c75061147",
               "name": "Andy Comeau",
               "profile_path": "/aeiZJ8ET3vL6GkV9vD71PVHiqF5.jpg",
               "id": 25990,
               "order": 4
            },
            {
               "cast_id": 23,
               "character": "Ernie",
               "gender": 2,
               "credit_id": "52fe45bf9251416c75061143",
               "name": "David Spade",
               "profile_path": "/tamKFAKdB1Q2mllHYHXxqg3YUXr.jpg",
               "id": 60950,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Fern",
               "gender": 1,
               "credit_id": "52fe45bf9251416c750610ff",
               "name": "Ernestine Mercer",
               "profile_path": null,
               "id": 77581,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Rico",
               "gender": 2,
               "credit_id": "52fe45bf9251416c75061107",
               "name": "Anthony Mangano",
               "profile_path": "/yGuKdqVXDG95i6xg3fKisiGebdo.jpg",
               "id": 77585,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Benny",
               "gender": 2,
               "credit_id": "52fe45bf9251416c7506110b",
               "name": "Joe Basile",
               "profile_path": "/j7hg42fJNwdCHrSV7jXN4sJOHKK.jpg",
               "id": 77586,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Paco",
               "gender": 2,
               "credit_id": "52fe45bf9251416c7506110f",
               "name": "Frank Roman",
               "profile_path": null,
               "id": 77587,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Big Sep",
               "gender": 2,
               "credit_id": "52fe45bf9251416c75061113",
               "name": "Howard George",
               "profile_path": null,
               "id": 77588,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Head of Hugo",
               "gender": 0,
               "credit_id": "52fe45bf9251416c75061117",
               "name": "Tom Platz",
               "profile_path": null,
               "id": 35715,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Head of Marty",
               "gender": 2,
               "credit_id": "52fe45bf9251416c7506111b",
               "name": "Endre Hules",
               "profile_path": "/cmxqIcfikG6rr5ag45ZkhYMP51Z.jpg",
               "id": 43461,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Head of Jamal",
               "gender": 2,
               "credit_id": "52fe45bf9251416c7506111f",
               "name": "Calvin Levels",
               "profile_path": null,
               "id": 77589,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Head of Little Joey",
               "gender": 0,
               "credit_id": "52fe45bf9251416c75061123",
               "name": "John Zurlo",
               "profile_path": null,
               "id": 77592,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Head of Frank",
               "gender": 0,
               "credit_id": "52fe45bf9251416c75061127",
               "name": "Roger Cobra",
               "profile_path": null,
               "id": 77594,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Head of Isaiah",
               "gender": 2,
               "credit_id": "52fe45bf9251416c7506112b",
               "name": "Jeff Sanders",
               "profile_path": null,
               "id": 77596,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Head of Benito",
               "gender": 0,
               "credit_id": "52fe45bf9251416c7506112f",
               "name": "Ric Sarabia",
               "profile_path": "/cjmoAK7MjGk9EDoICx8jHBGTUtb.jpg",
               "id": 77597,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Steve",
               "gender": 2,
               "credit_id": "52fe45bf9251416c7506114b",
               "name": "Todd Louiso",
               "profile_path": "/e4PTxmKUB0qGBusuNjqMvhjGELK.jpg",
               "id": 3230,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bf9251416c75061135",
               "name": "Tom Schulman",
               "profile_path": null,
               "id": 2691,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bf9251416c7506113b",
               "name": "Tom Schulman",
               "profile_path": null,
               "id": 2691,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 6.330838,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 13982,
      "vote_count": 46,
      "budget": 0,
      "overview": "Mafia hitman Tommy Spinelli (Joe Pesci) is flying to San Diego with a bag that holds eight severed heads, which he's bringing to his superiors to prove that some troublesome rival mobsters are permanently out of the picture. When his bag gets accidentally switched at the airport, Tommy must track down his duffel bag and the 8 heads it contains.",
      "similar": [
         15069,
         984,
         96,
         807,
         4771,
         75780,
         357096,
         10651,
         11423,
         2749,
         18587,
         26390,
         15762,
         37645,
         12150,
         1949,
         979,
         4638,
         193893,
         281
      ],
      "original_title": "8 Heads in a Duffel Bag",
      "runtime": 95,
      "poster_path": "/t9ZzvSgXpbhp6RxpT5nFXwuAwj5.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Brad Krevoy & Steve Stabler production",
            "id": 3581,
            "origin_country": ""
         },
         {
            "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
            "name": "Orion Pictures",
            "id": 41,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-18",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A mindless comedy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tom Schulman"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Tom Schulman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118541/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4NjU0NDc2Ml5BMl5BanBnXkFtZTcwMTM3NjYxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Pesci, Andy Comeau, Kristy Swanson | See full cast and crew »"],
      "reviews": [
         "Quite a load of laughs in this movie. Funny and entertaining, as well as maintaining interest by throwing in a few surprises and twists. Fine acting by most of the actors, in the sense that they manage to capture the uproarious mood of the movie throughout, with its series of laugh-invoking antics designed to prevent innocent people of knowing what's in the duffel bag, while seeking to try to either get rid or exchange for the correct bags. Not a classic comedy in any sense, but one which will keep you laughing and smirking throughout, without resorting to gags all the time to make you enjoy.",
         "I went in to this film with absolutely no expectation at all and thoroughly enjoyed every minute of it. It is in some parts so daft that you just can't help but snigger. Joe Pesci is great as a Mafia man assigned to bring back the heads of 8 'hits' he has made on the West coast. Enter a medical student, with a similar looking bag, his girlfriend and her family and you have the recipe for good crude comedy. Worth checking out if you are in the mood for a chuckle.",
         "The rest of the IMDb reviewers have got it about right. This is a good film. Nothing special or brilliant, but it does what it sets out to do which is to make you laugh - and it does so much better than most films of its kind. I started watching this expecting to change channels quite quickly. I only gave it a chance at all because Joe Pesci was in it - which is never a bad asset for a film. What happened was I found myself smiling quite a lot, and then laughing quite a lot. Not uproariously or uncontrollably. But out loud, and more than once. Pesci is good - but so is just about everyone else. And the script is wickedly funny too. It's much less predictable than most of its kind, There are twists which are genuinely surprising and interesting, and the film stays pretty fresh (even though in truth it's probably 20 minutes too long). I'm quite a harsh marker, so a 6 from me is quite a compliment for a film like this. Well-written, nicely-paced, silly without being annoying, and containing some funny performances and a lot of good moments, you will like this one if you give it a chance.",
         "Before I watched this movie I already read the reviews on IMDb. Almost everybody says it is an awful movie. Well, I'm in a good mood today and I'm not going to follow everybody's opinion. I liked it, not all the time, but it was OK. Joe Pesci is a mobster who has two days to deliver 8 heads of other criminals to his boss. If he fails his head will be the next to be cut off. Of course on the airport his bag is switched with another one. Not all the gags and jokes are good. There are some very predictable and embarrassing ones. Not only embarrassing for a great actor like Joe Pesci, but also for the guy who came up with them. However, there were some terrific ones as well, the best perhaps is the dream sequence. I'm not going to tell what happened, but it is really hilarious. Overall I would call it an enjoyable movie when you are able to switch off your brain for once. I gave it a 6/10, which isn't bad for this kind of movies.",
         "8 Heads in a Duffel Bag is a great example of a perfect situation comedy film. The events and(especially)the reaction to those events is comedy at its best. The directing conveys the humorous, yet dangerous tone of the film in a very superb way. The writing tells a story full of insane circumstances happening to normal, everyday people. The acting of the film, most notably that of Joe Pesci and David Spade, is such a huge part of the comedy that the film definitely couldn't have had otherwise. All in all, perfect writing, perfect acting. Watch and laugh. Travis.",
         "A thoroughly enjoyable comedy with Joe Pesci again proving why he is my favourite actor with this hilarious performance as Tommy Spinelli.David Spade and Kristy Swanson are also very funny in their roles and some moments are so funny that you will not be able to control yourself with laughter. I would seriously recommend this film to anyone who loves a good laugh.",
         "Sure, there's nothing funny about a bagman carrying the heads of eight murdered men across the country, but this movie is a scream. Pesci is wonderful. The story is obvious--swapped luggage--but it's never been done like this before. You won't believe that you could laugh so hard at something this unfunny, but you will!",
         "A mob bagman (Joe Pesci) finds that his luggage, containing the proof of his latest hit, has been switched. This was a nice departure for David Spade, stepping away from \"Saturday Night Live\", though still staying within comedy. Not his best work, but also probably not his fault. As a whole, the movie never really takes off the way it should. The exception is an awesome dream sequence, perhaps one of the better dream sequences ever filmed. Sadly, this one minute is the very best -- the rest of the film does not live up to the great title. Overall, it is quite tame on the violence and gore for the subject matter. If the same story was done without it being comedy, who knows how great this might have been?",
         "You won't laugh your head off at \"8 Heads in a Duffel Bag\" because this decapitated comedy of errors is about as funny as a frontal lobotomy. Pint-sized Joe Pesci of \"Goodfellas\" plays Tommy, a combustible, crew-cut, wise-guy who must deliver a duffel bag of eight heads to a vengeful crime boss. Basically, the mob chieftain insists on verifying the contents for himself. Andy Comeau co-stars as a clean-cut college kid named Charlie, with a duffel bag of duds, bound for a weekend in Mexico with his cute girlfriend Laurie Bennett (Kristy Swanson of \"Buffy the Vampire Slayer\") and her stuffy parents. Dyan Cannon and George Hamilton play Laurie's mother and father Annette and Dick Bennett. Tommy and Charlie take the same flight out, sit next to each other, but don't hit it off. Guess whose bags do the duffel shuffle in all the airport chaos. When Tommy learns he has snagged the wrong bag, he heads off for Charlie's college fraternity house. He tortures Charlie's two pin-headed med school pals Ernie (David Spade) and Steve (Todd Louiso) who cannot tell Tommy a thing because they know nothing about Charlie's plans. How much laughter can you generate from of a scene where a thug snaps a wet towel at two naked frat boys? Meanwhile, in Mexico, David's future mother-in-law, Annette Bennett (Dyan Cannon of \"Bob, Carol, Ted, and Alice\") discovers the grisly contents of the bag and turn into a basket case. Charlie and his girlfriend try to lose the heads, but nothing they do works. Thieves steal Dick Bennett's truck fro them, and a coyote snatches one of the noggins. Dick winds up in a Mexican hoosegow after two heads show up in his baggage at the airport. Eventually, just as Tommy is about to snuff the frats, Charlie calls. Charlie and Tommy agree to get their heads together. By this time, writer & director Tom Schulman has devoted half of the movie to time spent in Mexico on the labored comedy of characters up to their ears in head games. The lowbrow plot gets even more complicated and less humorous. Tommy finds out that Charlie might have let a couple of heads roll, so he forces Ernie and Steve to help him come up with two replacement craniums. While all of this is happening, two more mob guys trail Tommy across the border. It seems that the headstrong crime boss is pretty head up waiting for his heads. Bennett's mother, a chain-smoking battle ax, shows up, too. The trouble with \"8 Heads\" is that Schulman spends too much time bringing Tommy and Charlie together. A good comedy of errors depends on nimble timing, witty humor, and a snappy story. \"8 Heads\" squanders too much time on plot filler and gets a little too mean-spirited, particularly when Tommy spews profanities galore. The confusion that guillotines the best laid plans of the heroes rarely elicits a laugh. Tommy looks like a headbanger who wandered in from a Martin Scorsese bloodbath. You know you're in trouble at a comedy when the movie allots more time to the exposition than the gags. You know you're watching an empty-heded comedy when the movie characters resort to jokes about the film. You know the movie-makers are desperate when the resort to a dream sequence. They have the heads warble a tune in Tommy's dreams, while their headless bodies attack him. Pretty soon you notice, too, that the laughs get to be fewer and far between. When one of the characters suggests a better plan than what the writer gave to the star, you know you're in a bad movie. Charlie criticizes Tommy for not flying the heads out on a privately chartered jet. Sure, the heads would arrive intact, but there would be no comedy. Anyway, it shows what a numbskull Tommy is. You'd at least mark your bag if you were toting around severed body parts, right? Compared with the wise guys that he impersonated in \"Goodfellas\" and \"Casino,\" Pesci's errand boy Tommy is just plain cranky. He loves to smash phones and brandish his giant automatic pistol. Tommy makes a terrible hero because he's never sympathetic and he is much too stupid. Indeed, it is fun to see a couple of 1960s era stars like Cannon and Hamilton co-star in a 1990s film, but they're wasted in stereotypical supporting roles. Hamilton phones in most of his lines to his mother, trying to persuade her not to visit their motel. Spade sleepwalks through a role that demands very little of his enormously dry talent. \"8 Heads in a Duffel Bag\" belongs to the corpse comedy genre. Even \"Weekend at Bernie's 2\" was one head and one body about this multi-cranical farce. Pesci fans will wonder why he gave his nod to this skullduggery.",
         "Perhaps inspired by the Warren Oates classic \"Bring Me the Head of Alffredo Garcia\", this heads in a bag comedy has a strong opening, and a somewhat ridiculous finish. The actor's do quite well with what is essentially a one joke movie. \"8 Heads in a Duffel Bag\" starts as black comedy, but eventually morphs into nothing more than slapstick. The ending at the airport is especially weak, as any idea of how to conclude the film seems to have been lost. Nevertheless, the strong, \"dark\" first half, along with above average comedy material saves the movie, and compared to some of today's lame comedies, I can recommend seeing \"8 Heads in a Duffel Bag.\" - MERK"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Orion Pictures",
         "Rank Organisation, The"
      ],
      "summaries": [
         "This is a very black comedy. A mob courier is hired to transport the heads of eight murder victims to a mob boss. However, the duffel bag gets mixed up with the bag of a college student who is off on a vacation in Mexico with his girlfriend and her parents. However, the mother is a recovering alcoholic whom everyone believes is delusional when she claims to have found heads.",
         "Tommy, a wiseguy is sent by his boss to get the 8 heads of 8 men he took a contract on. At the airport there was a little mix-up and Tommy got the bag of Charlie, a student who is accompanying his girlfriend, Laurie, who is on vacation with her parents in Mexico. Tommy goes to Charlie's school in Maryland and grabs two of his friends and roughs them up. Charlie upon discovering that he has the wrong bag, tries to keep it from Laurie and her parents. Charlie then calls his friends and learns that Tommy is there, who wants his heads back so he agrees to meet him in the States but before they leave, two of the heads that Charlie had, ended up in Laurie's father's bag and when they are discovered he is arrested. Charlie must find a way to get help him and appease Tommy, who is now being pursued by the men who killed the 8 men, who are being threatened by Tommy's boss for failure to produce the heads.",
         "A mob bagman finds that his luggage, containing the proof of his latest hit, has been switched."
      ],
      "budget": 3000000
   },
   "movielensId": 1503,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1997-04-18",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["Tom Schulman"],
      "runtime": 95,
      "movieId": 1503,
      "title": "8 Heads in a Duffel Bag",
      "mpaa": "R",
      "actors": [
         "Joe Pesci",
         "Kristy Swanson",
         "George Hamilton",
         "Dyan Cannon",
         "Andy Comeau",
         "David Spade",
         "Ernestine Mercer",
         "Anthony Mangano",
         "Joe Basile",
         "Frank Roman",
         "Howard George",
         "Tom Platz",
         "Endre Hules",
         "Calvin Levels",
         "John Zurlo",
         "Roger Cobra",
         "Jeff Sanders",
         "Ric Sarabia",
         "Todd Louiso"
      ],
      "imdbMovieId": "0118541",
      "originalTitle": "8 Heads in a Duffel Bag",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["l59Ps8fyQ0s"],
      "plotSummary": "Mafia hitman Tommy Spinelli (Joe Pesci) is flying to San Diego with a bag that holds eight severed heads, which he's bringing to his superiors to prove that some troublesome rival mobsters are permanently out of the picture. When his bag gets accidentally switched at the airport, Tommy must track down his duffel bag and the 8 heads it contains.",
      "tmdbMovieId": 13982,
      "avgRating": 2.62809,
      "releaseYear": "1997",
      "numRatings": 1374,
      "posterPath": "/t9ZzvSgXpbhp6RxpT5nFXwuAwj5.jpg"
   }
}