{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113314",
      "video": false,
      "title": "Hollow Reed",
      "recommendations": [
         33247,
         32700,
         106837,
         14187,
         41166,
         42134,
         35161,
         33766,
         44746,
         48464,
         42264,
         19958,
         41944,
         16659,
         36614
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Martyn Wyatt",
               "gender": 2,
               "credit_id": "52fe49459251416c750c2a53",
               "name": "Martin Donovan",
               "profile_path": "/bNS43B8maD5A4UYSWy4UjgHru1a.jpg",
               "id": 42993,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tom Dixon",
               "gender": 2,
               "credit_id": "52fe49459251416c750c2a57",
               "name": "Ian Hart",
               "profile_path": "/35KSRxsFR20QGDhIrZn7G4Jkc2g.jpg",
               "id": 10985,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Hannah Wyatt",
               "gender": 1,
               "credit_id": "52fe49459251416c750c2a5b",
               "name": "Joely Richardson",
               "profile_path": "/fgjpKio6sMD5AxOWQwAdgJQErhm.jpg",
               "id": 20810,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frank Donally",
               "gender": 2,
               "credit_id": "52fe49459251416c750c2a5f",
               "name": "Jason Flemyng",
               "profile_path": "/kzzQoiO3bbi2UeDJL9QtBT5jaQn.jpg",
               "id": 973,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Razmu",
               "gender": 1,
               "credit_id": "52fe49459251416c750c2a63",
               "name": "Shaheen Khan",
               "profile_path": "/qc3DeFeSYLT17vB1cAvnT0jL7ih.jpg",
               "id": 6218,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jamie's Mother",
               "gender": 1,
               "credit_id": "52fe49459251416c750c2a67",
               "name": "Kelly Hunter",
               "profile_path": "/eyl58Ycj9Zm6ci8WLK1oYIsEs2P.jpg",
               "id": 192940,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Record Shop Girl",
               "gender": 0,
               "credit_id": "52fe49459251416c750c2a6b",
               "name": "Jane Hill",
               "profile_path": null,
               "id": 590162,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe49459251416c750c2a71",
            "name": "Angela Pope",
            "profile_path": null,
            "id": 1016352,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.131477,
      "production_countries": [],
      "id": 93946,
      "vote_count": 7,
      "budget": 0,
      "overview": "Following the break-up of his marriage after revealing his homosexuality, GP Martin Wyatt loses custody of his son Oliver to his now ex-wife Hannah and her new partner Frank. It is not long, however, until Oliver appears at the house of Martin and his new lover Tom claiming to have been beaten up by boys in the park. After another incident, Martin puts two and two together and comes to the conclusion that Frank has been beating Oliver without Hannah's knowledge. Martin then begins a long courtroom custody battle to win back his son.",
      "similar": [],
      "original_title": "Hollow Reed",
      "runtime": 102,
      "poster_path": "/zjaQJflPr8y7abdpnBKTiK7p56l.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-06-24",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Something has come between Hannah and Martin that will change their lives forever",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Angela Pope"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Neville Bolt",
         "Paula Milne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113314/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4OTM0NDEzMl5BMl5BanBnXkFtZTcwODE0ODcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sam Bould, Martin Donovan, Ian Hart | See full cast and crew »"],
      "reviews": [
         "The subject of child abuse is not a pleasant one and often the made-for-TV dramas dealing with this subject present a one-dimensional view. But this movie gets very deeply into the complex dynamics of a such a case. The story revolves around ten-year-old Oliver (Sam Bould) who lives with his divorced mother Hannah (Joely Richardson) and her boyfriend Frank (Jason Flemyng). The boy loves his mother as well as his father Martyn (Martin Donoval) who precipitated the divorce in order to live with his male partner Tom (Ian Hart). The movie starts with Oliver having run to his father's house with a bloodied face. Oliver passes it off as his having been in a fight. Martyn is a medical doctor and takes Oliver to the hospital and finds out that his physical wounds in this instance are not threatening. But sometime later when Oliver shows up with broken bones in his wrist, that he tries to blame on having been caused by slamming a car door on it, Martyn checks it out and determines that the injury is not consistent with Oliver's story and he initiates court proceedings to get custody of the child. Frank and Hannah are very much in love and Hannah cannot believe that Frank is to blame for Oliver's injuries and she feels that Martyn is just trying a power play to get custody of Oliver and irritate her. This is a pretty straightforward setup, but it is here where the movie becomes very involving. We come to understand why Oliver tries to hide the truth and stay with his mother, even though he wants to be with his father. We get enough insight into Frank to understand why he behaves as he does and, even though we cannot forgive his actions, we see that he is not a total monster and we can even have some sympathy for him. And then there is the whole issue of whether homosexual men should be allowed to have custody of a child, and that is explored in some depth. Martyn and Tom have the most natural homosexual relationship that I have seen in film, but the relationship is not idealized. There are visits by social workers and a court hearing that is viciously brutal, especially the questioning of Martyn about intimate details of his relationship with Tom. One reason that this story is so affecting is the superb acting by all concerned, particularly by the young Bould. He is totally believable in conveying the traumas he experiences and you suffer with him. The saddest thing about the situation these people find themselves in is that none of them is really a bad person, but they are drawn into circumstances that are psychologically damaging to all of them, particularly the boy. This movie successfully treats many themes: child abuse, the far-reaching and long-term effects of divorce, sexual discrimination, society's duty to children, and the suitability of gays as parents. At the end there is no nice neat resolution in this honest and realistic film.",
         "Potent and moving drama, finely performed and well told. The screenplay is solid, and flows realistically, without melodramatic histrionics or overt manipulation of the viewer. The difficult and horrendous subject of child abuse, is intelligently handled, and still evokes a stunning portrayal. Angela Pope directs the film and its characters through many subjects that could involve several films, let alone one. The screenplay is sharp, the actors carry out great performances. Rarely, in a movie, have gay characters been shown to be so human, not a pasted cliche. Don't miss this fine motion picture. Highly recommended.",
         "The script for \"Hollow Red\" is finely written, with fully dimensional characters, believable situations, and sharp plot twists. The acting is faultless, with the entire cast bringing poignant character realizations to their work. The direction, editing, and scoring all contribute to a moving drama. One is absorbed from beginning to end, and experiences a cathartic feeling at the finale. The only aspect which may date this film a bit is the British courtroom attitude toward the homosexual lifestyle. In that respect, it roots itself in the late '90s. However, even that element is historically honest and truthful. A fine film from English contemporary cinema.",
         "This movie was perfect in just about every way. The cinematography, acting, you name it. I give it a 10/10 and highly recommend it. However, I did see some slight problems - Tom's (the father's live-in boyfriend) character was never really developed much, and, other than one, eh, 'uninhibited' scene of gay love, there was really not much feeling of love between the two. However, I suppose that the relationship was done as well as could be expected, though. All in all, it was a great movie, and it's 'pros' far outweigh it's 'cons'. It has achieved the status of 'near perfection' in my mind, which only one other movie had done before this.",
         "Profoundly sensitive topic handled in a superb manner. I could feel the father's anguish and the child's and feel that while the movie may make some uncomfortable, it is a topic that is not going to go away and perhaps though sensitive coverage such as this, there will be more understanding and tolerance. I was held spellbound from the very beginning and as a mother myself, wonder why the child's mother was not aware something was wrong with him. It was painfully obvious to me as an observer, in just observing Oliver, that something was not right. Did she honestly not know, and then I would have to consider how close she truly was to her son, or did she know and ignore, which is so much worse. Can a quest for happiness, or fulfillment, even make us blind to our obligations to our children? I sincerely hope not. I am glad it ended as it did, but would like to have seen a little further into the future.",
         "In addition to its excellent cinematic qualities (including an intelligent and powerful script), this heartbreaking film's message about the depth of a gay father's love for his child is a moving and important statement.",
         "Oliver Wyatt [Sam Bould], who's at the centre of this drama, felt he would bring on more drama and feel blamed, coupled with the abuse he put up with if he expressed his feelings about it. Martyn Wyatt [Martin Donovan], who's the ex-husband and father to Oliver, battled discrimination from his wife and the court system to save his son. Tom Dixon [Ian Hart], Martyn's boyfriend, who stood by helplessly yet made the occassional attempt, ended up even more frustrated. Hannah Wyatt [Joely Richardson], who was torn between a possible failed relationship with her current boyfriend and the welfare of her son. Frank Donally [Jason Flemyng], the one who's oblivious to his treatment of the boy and trapped wrestling his own demons. All well-played roles by fine actors.",
         "When I rented this movie with friends, I expected it to be a trite melodrama of the \"TV-movie of the week\" variety. But it has two things going for it that elevate the film above soap opera. The first is the performance of young Sam Bould as the abused child. One of the best performances from a young actor I have ever seen, without a trace of cutesiness, mugging, or self-consciousness. The second is the character of Hannah. Here is a deeply flawed woman who willingly puts her own son through hell, and yet so skillfully written and played by Joely Richardson, I sympathized with her throughout. This is an extraordinary character, and I was really impressed by the way she was handled. The one major flaw of this film is that the two gay men are wonderful parents, and the straight couple are such awful parents...the film is so pro-gay it verges on being anti-straight. But, as stated above, Joely Richardson's performance keeps you from making any easy judgments about Hannah. She saves the film from treacly melodrama.",
         "This film provides some of the best performances and best casting of any film I have ever seen. The child, Oliver, is compelling in a way I have never seen before, and the major roles are exquisitely performed by all. The story will keep you on edge, and the twists and turns of the plot are totally enthralling and surprising. Film-making at its very best. The climax of the film is one of the best scenes I have ever seen in any movie. Superb.",
         "This film provides some of the best performances and best casting of any film I have ever seen. The child, Oliver, is compelling in a way I have never seen before, and the major roles are exquisitely performed by all. The story will keep you on edge, and the twists and turns of the plot are totally enthralling and surprising. Film-making at its very best. The climax of the film is one of the best scenes I have ever seen in any movie. Superb."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Channel Four Films",
         "Eurimages",
         "Euro Media Guaranties"
      ],
      "summaries": ["Following the break-up of his marriage after revealing his homosexuality, GP Martin Wyatt loses custody of his son Oliver to his now ex-wife Hannah and her new partner Frank. It is not long, however, until Oliver appears at the house of Martin and his new lover Tom claiming to have been beaten up by boys in the park. After another incident, Martin puts two and two together and comes to the conclusion that Frank has been beating Oliver without Hannah's knowledge. Martin then begins a long courtroom custody battle to win back his son."],
      "budget": 0
   },
   "movielensId": 1504,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-06-24",
      "dvdReleaseDate": null,
      "directors": ["Angela Pope"],
      "runtime": 102,
      "movieId": 1504,
      "title": "Hollow Reed",
      "mpaa": "",
      "actors": [
         "Martin Donovan",
         "Ian Hart",
         "Joely Richardson",
         "Jason Flemyng",
         "Shaheen Khan",
         "Kelly Hunter",
         "Jane Hill"
      ],
      "imdbMovieId": "0113314",
      "originalTitle": "Hollow Reed",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Following the break-up of his marriage after revealing his homosexuality, GP Martin Wyatt loses custody of his son Oliver to his now ex-wife Hannah and her new partner Frank. It is not long, however, until Oliver appears at the house of Martin and his new lover Tom claiming to have been beaten up by boys in the park. After another incident, Martin puts two and two together and comes to the conclusion that Frank has been beating Oliver without Hannah's knowledge. Martin then begins a long courtroom custody battle to win back his son.",
      "tmdbMovieId": 93946,
      "avgRating": 3.44792,
      "releaseYear": "1996",
      "numRatings": 144,
      "posterPath": "/zjaQJflPr8y7abdpnBKTiK7p56l.jpg"
   }
}