{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "japanese",
            "id": 907
         },
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "singapore",
            "id": 4224
         }
      ],
      "imdb_id": "tt0119859",
      "video": false,
      "title": "Paradise Road",
      "recommendations": [
         63437,
         49803,
         27141,
         27984,
         25576,
         38509,
         15503,
         18451,
         20511,
         18713,
         34615,
         78406,
         26176,
         33766,
         24488,
         16399,
         27444,
         145066,
         61418,
         118991
      ],
      "backdrop_path": "/dlUBOryv6pTSqseV4PpGwqyRDX7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Adrienne Pargiter",
               "gender": 1,
               "credit_id": "52fe4962c3a368484e128a8b",
               "name": "Glenn Close",
               "profile_path": "/fF6tCfuvuUhaePm5onUNnIE4FvL.jpg",
               "id": 515,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Verstak",
               "gender": 1,
               "credit_id": "52fe4962c3a368484e128a8f",
               "name": "Frances McDormand",
               "profile_path": "/jodV4NuQAvxQWIHxqnop1jUX77N.jpg",
               "id": 3910,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Daisy 'Margaret' Drummond",
               "gender": 1,
               "credit_id": "52fe4962c3a368484e128a93",
               "name": "Pauline Collins",
               "profile_path": "/tcMcWOGJ7fPRxvHxZtzkb26ha79.jpg",
               "id": 83437,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Susan Macarthy",
               "gender": 1,
               "credit_id": "52fe4962c3a368484e128a97",
               "name": "Cate Blanchett",
               "profile_path": "/5HikVWKfkkUa8aLdCMHtREBECIn.jpg",
               "id": 112,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Topsy Merritt",
               "gender": 1,
               "credit_id": "52fe4962c3a368484e128a9b",
               "name": "Julianna Margulies",
               "profile_path": "/cnYT0hvQe5Ue6qDf16AvQoPGKto.jpg",
               "id": 25654,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Rosemary Leighton-Jones",
               "gender": 1,
               "credit_id": "546b6b5592514101f2001f45",
               "name": "Jennifer Ehle",
               "profile_path": "/lZsU6KrXXkIVtcvJmlPKwPRtBkn.jpg",
               "id": 49971,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mrs. Dickson",
               "gender": 1,
               "credit_id": "546b6b6692514101f8001e1b",
               "name": "Wendy Hughes",
               "profile_path": "/vB0fDnhvJt48sZDoj3ldhH9NkCc.jpg",
               "id": 42134,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Sister Wilhelminia",
               "gender": 0,
               "credit_id": "546b6b79c3a3680d78001dcf",
               "name": "Johanna ter Steege",
               "profile_path": "/fWY2HuHSORn5EnPqFJ8sSJia2ME.jpg",
               "id": 55851,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Mrs. Roberts",
               "gender": 1,
               "credit_id": "5648b3d4c3a3682601007f9d",
               "name": "Elizabeth Spriggs",
               "profile_path": "/dwzoE4S0dFJRoxTcvvfjOuSp4Sx.jpg",
               "id": 1220119,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mrs. Tippler",
               "gender": 0,
               "credit_id": "5648b3ebc3a3682620007f6e",
               "name": "Pamela Rabe",
               "profile_path": "/xVkyLuupFcjv92hiiCgHYCCogLU.jpg",
               "id": 217137,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sergeant Tomiashi, 'The Snake'",
               "gender": 2,
               "credit_id": "5648b406c3a3682611007b72",
               "name": "Clyde Kusatsu",
               "profile_path": "/gM5vHl3hl0CgKJxeqwjyeOdhzjP.jpg",
               "id": 2249,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Captain Tanaka",
               "gender": 2,
               "credit_id": "5648b417c3a3682608007c7c",
               "name": "Stan Egi",
               "profile_path": null,
               "id": 51806,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "the interpreter",
               "gender": 2,
               "credit_id": "5648b451c3a3682620007f7e",
               "name": "David Chung",
               "profile_path": null,
               "id": 99848,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Colonel Hirota",
               "gender": 0,
               "credit_id": "5648b4749251413ae1007829",
               "name": "Sab Shimono",
               "profile_path": "/jgbTTB8hCfKARta5yGkHrq2DFB.jpg",
               "id": 85500,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Mrs. Pike",
               "gender": 0,
               "credit_id": "5648b4859251413ae100782e",
               "name": "Penne Hackforth-Jones",
               "profile_path": "/moG7UmJzI3YAgEOqrhcbRCcxRT4.jpg",
               "id": 110009,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Wing",
               "gender": 0,
               "credit_id": "5648b4bf9251413ae1007840",
               "name": "Pauline Chan",
               "profile_path": null,
               "id": 60513,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Edna",
               "gender": 1,
               "credit_id": "5648b4d5c3a3682620007f9a",
               "name": "Lisa Hensley",
               "profile_path": "/lBEEPUeSqpRdyrpAlAT0WBn3QO.jpg",
               "id": 75541,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Oggi",
               "gender": 1,
               "credit_id": "5648b4e89251413ad7007b9e",
               "name": "Susie Porter",
               "profile_path": "/yGBEkCewo9itoskguyCjo0hD97Z.jpg",
               "id": 51671,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Bett",
               "gender": 0,
               "credit_id": "5648b4f99251413e7f0076bf",
               "name": "Anita Hegh",
               "profile_path": "/iVrT2e64aLVnMPdLdJeFc9hho7l.jpg",
               "id": 94871,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Bill Seary",
               "gender": 2,
               "credit_id": "5648b5819251413acc007cc6",
               "name": "Aden Young",
               "profile_path": "/iox7pYeOOg1c3z7Z8EgAJkpxbE.jpg",
               "id": 144081,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4962c3a368484e128aa1",
               "name": "Bruce Beresford",
               "profile_path": "/2BM92YfwzMpFkk5IlNZfZqPmODy.jpg",
               "id": 5696,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546b6b3fc3a3680d75001db4",
               "name": "Bruce Beresford",
               "profile_path": "/2BM92YfwzMpFkk5IlNZfZqPmODy.jpg",
               "id": 5696,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5648b54b9251413ad7007baf",
               "name": "Peter James",
               "profile_path": null,
               "id": 5708,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 9.646408,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 77223,
      "vote_count": 27,
      "budget": 16000000,
      "overview": "Paradise Road is a 1997 film which tells the story of a group of English, American, Dutch and Australian women who are imprisoned in Sumatra during World War II. It was directed by Bruce Beresford and stars Glenn Close as beatific Adrienne Pargiter, Frances McDormand as the brash Dr. Verstak, Pauline Collins as missionary Margaret Drummond (based on missionary Margaret Dryburgh), Julianna Margulies as American socialite Topsy Merritt, Jennifer Ehle as British doyenne and model Rosemary Leighton Jones, Cate Blanchett as Australian nurse Susan McCarthy and Elizabeth Spriggs as dowager Imogene Roberts. Basing his picture on real events, Bruce Beresford tells the story of a vocal orchestra created by the women in a Japanese P.O.W. camp, a classic survivors' tale extolling women's ability to survive hardship and atrocity through perseverance, solidarity and creativity.",
      "similar": [
         278,
         10447,
         10734,
         107846,
         5925,
         9291,
         1368,
         1429,
         1701,
         708,
         76640,
         27578,
         38234,
         135397,
         5924,
         5971,
         575,
         873,
         6075,
         826
      ],
      "original_title": "Paradise Road",
      "runtime": 122,
      "poster_path": "/A6leUBF4WYHyPs75dOO0UF5WFaJ.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Samson Productions",
            "id": 5368,
            "origin_country": ""
         },
         {
            "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
            "name": "Fox Searchlight Pictures",
            "id": 43,
            "origin_country": "US"
         },
         {
            "logo_path": "/tpFpsqbleCzEE2p5EgvUq6ozfCA.png",
            "name": "Village Roadshow Pictures",
            "id": 79,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-11",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Bruce Beresford"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "David Giles",
         "Martin Meader"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzOTA1MzYxM15BMl5BanBnXkFtZTcwMzc5NDIyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Glenn Close, Frances McDormand, Pauline Collins | See full cast and crew »"],
      "reviews": [
         "Paradise Road is based on the true story of women POWs in Sumatra during WWII. The film, for the most part, follows what really happened... with one glaring exception! The incident that is prominently missing from Paradise Road is the Bangka Island massacre, which was one of the worst atrocities committed against women POWs during WWII and is an integral part of this story. After their ship, The SS Vyner Brooke, was sunk, the survivors made for the nearest land which was Bangka Island. They came to shore in different places but a group of more than a hundred people ended up on Radji beach. The group consisted of 22 Australian Army nurses, some civilian men, women and children, and 30 British soldiers from another ship which had been sunk. The island was fully occupied by the Japanese and the group unanimously decided to give themselves up. The group leader set off to find someone to surrender to. The civilian women and children began walking towards the main town on the island. The 22 nurses remained behind with the men and the soldiers (many of whom were badly wounded), an elderly British woman also remained with her wounded husband. When the group leader returned with a group of 20 Japanese, they ignored all requests for surrender. The Japanese shot and bayoneted the men, then ordered the 23 women to walk into the ocean. When they reached waist depth, the Japanese open fired with a machine gun and mowed the women down. There was one survivor. One of the nurses, Vivian Bullwinkel, was shot through the side and survived by pretending to be dead. She hid in the jungle for 12 days, caring for a British soldier who had been bayoneted and left for dead (he later died). Eventually, she gave herself up and was re-united with the rest of the women in the prison camp in Muntok. When she told them what had happened on the beach and they quickly realised that they would all be killed if the Japanese learned there was a witness to the massacre. So they made a pact not to speak of it again until they were free. Paradise Road is a fictional film based loosely on fact, not a documentary. Sometimes it is necessary to make changes to the real sequence of events in order for the film's structure and pacing to work. I do accept this and I would prefer to see a good film rather than a accurate one. But in leaving out the massacre on the beach, the film does a disservice to these women. These women were aware, from the start of their internment, that the Japanese were capable of atrocities on a massive scale and that there was no safety in numbers. They lived in a constant state of fear that the Japanese would repeat such an act or learn that Vivian Bullwinkel had survived the massacre and kill them all. Paradise Road tries to portray Japanese atrocities with a fictitious incident where a woman is set on fire (which did not really happen) but this does not compare to the scale of the 80 people massacred on Radji beach and the effect it had on the women in the camp. There were 32 Australian Army nurses in the camp and the women who died on the beach were their friends and colleagues. They were from the same unit and had nursed together for the first two years of the war. All their interactions with the Japanese guards were coloured by the knowledge that they had murdered 22 of their friends in cold blood. Paradise Road is a very good movie and I suspect it will become the definitive film about female POWs during WWII. Which sadly means that the 22 women who were murdered on Radji beach will be lost from memory... and they deserve better than that. If you want to learn more about the women POWs of Sumatra, I suggest you read \"White Coolies: Australian Nurses Behind Enemy Lines,\" the diary kept by camp survivor Betty Jeffrey, or read the biography \"Bullwinkel\" by Norman G. Manners. There is also an excellent 1985 documentary called \"Song of Survival\", and a really tacky episode of \"Willesee's Australians\" that dramatises the story of Vivian Bullwinkel.",
         "Why didn't more people see this film? This is what makes it great: As an ensemble piece it works wonderfully - the cast are truly magnificent. Glenn Close is fabulous as the 'central' character and most well known 'star', but she does not monopolise all the scenes and screen time. She blends in with what is a wonderful cast, and does so impeccably. Why she hasn't been given more kudos as an actress is beyond me - she is stunning. The film worked perfectly because of what comes across as a genuine rapport between the female cast. Each actress brings a different element to the story - Jennifer Ehle is strong willed and beautiful, Julianna Marguilles fiesty and dominant, Pauline Collins has such a human quality which she conveys to perfection, Cate Blanchett portrays wonderfully a quiet woman with a rebellious side. All compliment and balance each other. The actresses succeed admirably in bringing to the fore the bond that grew between their real life inspirations for this story. The direction is precise and the cinematogrpahy beautiful. Despite the bleak context, Japan still looks vibrant and colourful, full of life. The score. I can't do justice to the score in words - the vocal orchestra formed by the women is just beautiful and poignant to listen to and really does need to be heard to be understood. Somehow the actresses manage to make the music symbolise their humanity and spirit. It works wonderfully. Overall, this is a heartfelt film with a profound message of hope which runs all the way through it. 'Paradise Road' is one of those rare films which reminds you of the indestructible nature of the human spirit. I wish there were more films like this one, and I wish more people had have seen this film. In a word it's a gem.",
         "This film gripped me from the opening scene in the hotel ballroom and prooved to be a class act right to the end. Director Bruce Beresford's track record includes Driving Miss Daisy, Tender Mercies and Breaker Morant, so Paradise Road came as a special treat, not realising at the time of viewing that he had directed these films. The realistic scenes of violence had a tremendous impact in contrast to some of the wonderful underplaying of the leading actresses, notably Glenn Close and Pauline Collins. The Japanese actors, although unknown to me were chillingly effective. I can only hope for more films of this calibre but alas they are few and far between.",
         "A little slow to start, but the plot picks up early in the film, and leaves you thinking about \"What would you do in their position?\" - not just the women internees, but also the Japanese Soldiers involved at the time. All are involved with their own emotions, as controlled from 'authorities' above them. Based on a true event, you can watch this film and empathise with all of the characters (both 'Goodies' and 'Baddies'). You'll be left thinking very hard about the persons who 'did it' for real. In the middle of the film, when the Vocal Orchestra perform Dvorak's \"New World Symphony\" without instruments, and at the end of the film, \"Londonerry Air\" (Oh Danny Boy), a box of tissues may be required accessories.",
         "[SPOILER] I caught this movie on cable when it had started maybe half an hour before. I hadn't watched it before because I thought it would be corny. It wasn't that bad, I think, but even if it were hideous, there was one scene that made the movie worthy: the one in which the Japanese commander sings to Close's character. I read a text by Umberto Eco about ethics, in which he explained that you failed to respect others' rights when you don't see those others as equals, and this scene was the perfect example. It was beautiful and, at the same time, terrible to see that this man, who almost kills her in other circumstances, has the human need to be acknowledged and approved by her. It is beautiful and terrible to see how he can disrespect her human rights and at the same time respect her opinion so much. And you can see it in Close's face: the perplexity of recognizing for a moment her captor as a human being who is capable of terror and beauty. Eco was absolutely right: music is too human a skill; you cannot listen to somebody who sings and still regard him/her as something inferior. And yet the roles cannot change that easily. Hate becomes harder, but is there anyway. The scene was very powerful for me, because it summarized a war too well: a chaos where everybody is dehumanized and everybody fights to be human again.",
         "I love this movie because I love the characterization of the women in it. I felt powerfully with the women, felt I knew them, felt complete identification with most of them. I actually think it's hard to specify the actions and words that will make a character both realistic and sympathetic. Showing mere suffering won't do it. But here, Mr. Beresford has been able to stir such warm feelings (particularly toward the Roberts girl, the Glenn Close and Jennifer Ehle, her Dutch friend, and the Cate Blanchett characters). The romanticism, cheer and background of the Ehle character are particularly well drawn. This is a far superior movie to 'Platoon', by the way - and a wonderful tribute to those who went through the awful 3.5 year ordeal. Another thing I quite liked (these days) was to see a movie that did not attempt to make the Caucasians the moral villain relative to the other race depicted. This is not a movie concerned with p.c. appearances - the Japanese are not shown as somehow merely \"different\", a difference we \"simply cannot understand or judge\" because of our different culture. Setting a woman on fire for bargaining for medicine for a sick elderly woman is brutality in any culture - and this movie does not attempt to minimize the moral wrong. Bravo, Mr. Beresford.",
         "I stumbled across this movie surfing TV channels late one night. I was drawn right into the plot, and thought it was an incredible story, incredibly well-told. It's a true story, which I previously did not know anything about, but should have. Both the story, itself, and the film, should be much, much better known. It is also one of Glenn Close's best performances. Her performance, and the film, itself, are absoultely gripping! If you like true-life stories that are extremely well-done, such as \"We Were Soldiers,\" then this one is of a similar genre, but with the main characters being women.",
         "'Paradise Road' is not the first time the story of European and Australian prisoners of the Japanese during WW2 has been told - there is a famous old movie of Neville Shute's 'A Town Like Alice' and the BBC's wonderful tv series, 'Tenko', from the early 1980s. Nevertheless there is certainly scope for this film, which tells the story of a group of largely upper class women who have to come to terms with captivity and brutality as a 'defeated race' and somehow survive the war. The particular twist to this film is the fact-based story of the choir a group of women started in one camp. In other ways, however, the story is practically identical to 'Tenko', only crammed into around 2 hours instead of 30. This means that the effect is very much like watching one of those Reduced Shakespeare Company shows that do the Complete Works of Shakespeare in one performance. Virtually nothing happens in Paradise Road that doesn't happen in Tenko - fair enough, since it is fact based, but you feel like you're watching whole episodes crammed into a single line and you find yourself desperate for more character development - you never find out, for example, who Glenn Close's character really _is_. Despite this, the acting is top-hole and the script-writing is quite sparky, while production values are for the most part extremely high - this is a very good looking film. And therein lies a problem. While the violence is not sanitised, the starvation is. The women in this film appear to have suffered no more ill effects after 3 years of captivity and hard labour than a healthy sun tan and fetching urchin-style crop. The fight-in-the-shower scene shows us an array of perfect bodies with no sores, sunburn, bruises, skin diseases etc. (Again, Tenko did this much better.) When some of the women are meant to be dying of starvation towards the end the idea that these healthy women are meant to be suffering is so laughable as to be more like amateur dramatics than professional movie making. In failing to give a sense of the struggle to survive that the real women went through, this film diminishes their courage and does not do them justice. This film is watchable, however, and tells stories that need to be told. Watch it by all means - but 'Tenko' is now out on video, so get that next!",
         "The film was both moving and heart warming. It shows the unbelievable story of a group of women surviving a PoW camp against all the odds. I found it hard to believe that anyone was made to live in the conditions they were put in and live to tell the story. The acting was excellent and i don't think this film has got the praise it deserves. It is made even more moving by the fact it is based on a true story.",
         "First class work here. The film follows a group of women captured in Asia by the Japanese, and interned as enemy aliens. It shows the inhuman brutality that the Japanese inflicted on anyone they considered to be of an inferior race. (i.e. not Japanese) (for that matter anyone not samurai) As a coping mechanism, and partially in defiance of their captors, the women form a vocal orchestra, playing the parts of classical music with only their voices. The music soothes the women, those in the orchestra, and those who aren't. The Japanese soldiers even come to enjoy the sound, and the atrocity rate drops a couple of notches. Stand out performances abound here. In fact I can't really single out any of the cast. They were all good, including the Japanese actors. I had thought from the reviews that the music would be the largest part of the film, with just the backdrop of the prison camp, but it really wasn't. I recommend this film."
      ],
      "genres": [
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": [
         "Village Roadshow Pictures",
         "Samson Productions",
         "Planet Pictures"
      ],
      "summaries": [
         "The group of women from different countries and social levels are prisoners in a Japanese POW camp, where one of them, Adrienne, who is a graduate of the Royal Academy of Music, organizes a vocal band in spite of their guards resistance.",
         "When the Japanese over-run Singapore in 1942 many women and children end up in prison camp. Although of different ages, nationalities and backgrounds, a bond grows up as they face the lack of food and medicine and the brutal behaviour of their captors. They even start organizing a voice orchestra using remembered musical scores painstakingly written out again.",
         "Fact-based recounting of a group of women who are imprisoned on the island of Sumatra by the Japanese during World War II and used music as a relief to their misery."
      ],
      "budget": 16000000
   },
   "movielensId": 1507,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-04-11",
      "dvdReleaseDate": "2001-03-13",
      "directors": ["Bruce Beresford"],
      "runtime": 122,
      "movieId": 1507,
      "title": "Paradise Road",
      "mpaa": "",
      "actors": [
         "Glenn Close",
         "Frances McDormand",
         "Pauline Collins",
         "Cate Blanchett",
         "Julianna Margulies",
         "Jennifer Ehle",
         "Wendy Hughes",
         "Johanna ter Steege",
         "Elizabeth Spriggs",
         "Pamela Rabe",
         "Clyde Kusatsu",
         "Stan Egi",
         "David Chung",
         "Sab Shimono",
         "Penne Hackforth-Jones",
         "Pauline Chan",
         "Lisa Hensley",
         "Susie Porter",
         "Anita Hegh",
         "Aden Young"
      ],
      "imdbMovieId": "0119859",
      "originalTitle": "Paradise Road",
      "genres": [
         "War",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["3C4Khj5D7lI"],
      "plotSummary": "Paradise Road is a 1997 film which tells the story of a group of English, American, Dutch and Australian women who are imprisoned in Sumatra during World War II. It was directed by Bruce Beresford and stars Glenn Close as beatific Adrienne Pargiter, Frances McDormand as the brash Dr. Verstak, Pauline Collins as missionary Margaret Drummond (based on missionary Margaret Dryburgh), Julianna Margulies as American socialite Topsy Merritt, Jennifer Ehle as British doyenne and model Rosemary Leighton Jones, Cate Blanchett as Australian nurse Susan McCarthy and Elizabeth Spriggs as dowager Imogene Roberts. Basing his picture on real events, Bruce Beresford tells the story of a vocal orchestra created by the women in a Japanese P.O.W. camp, a classic survivors' tale extolling women's ability to survive hardship and atrocity through perseverance, solidarity and creativity.",
      "tmdbMovieId": 77223,
      "avgRating": 3.40323,
      "releaseYear": "1997",
      "numRatings": 403,
      "posterPath": "/A6leUBF4WYHyPs75dOO0UF5WFaJ.jpg"
   }
}