{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "grifter",
            "id": 159607
         },
         {
            "name": "road movie",
            "id": 167043
         },
         {
            "name": "scam artist",
            "id": 186894
         },
         {
            "name": "irish traveller",
            "id": 208674
         }
      ],
      "imdb_id": "tt0120366",
      "video": false,
      "title": "Traveller",
      "recommendations": [
         93116,
         29741,
         46439,
         49354
      ],
      "backdrop_path": "/4JvzRmePWEHriPzh6PadITTl8iU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bokky",
               "gender": 2,
               "credit_id": "52fe447f9251416c91012de1",
               "name": "Bill Paxton",
               "profile_path": "/53Ln1wTC0OCLzBF4HNlwhMXYgOU.jpg",
               "id": 2053,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jean",
               "gender": 1,
               "credit_id": "52fe447f9251416c91012de9",
               "name": "Julianna Margulies",
               "profile_path": "/cnYT0hvQe5Ue6qDf16AvQoPGKto.jpg",
               "id": 25654,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Double D",
               "gender": 2,
               "credit_id": "52fe447f9251416c91012ded",
               "name": "James Gammon",
               "profile_path": "/4oTidbjDQ8XU3LHot249SMlVLn4.jpg",
               "id": 16433,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe447f9251416c91012df1",
               "name": "Nikki DeLoach",
               "profile_path": "/h8lP9YDAksFxBSBiSjhclc8h2qt.jpg",
               "id": 59750,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Boss Jack Costello",
               "gender": 2,
               "credit_id": "52fe447f9251416c91012e01",
               "name": "Luke Askew",
               "profile_path": "/nlV0bfadoMjbz7vxmLl5zALc86H.jpg",
               "id": 8962,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Shane",
               "gender": 1,
               "credit_id": "52fe447f9251416c91012e05",
               "name": "Danielle Keaton",
               "profile_path": null,
               "id": 94554,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "59e392ef9251410b67000172",
               "name": "Mark Wahlberg",
               "profile_path": "/z2wJh5n7qZRUE1y9uB8UrivAV2b.jpg",
               "id": 13240,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447f9251416c91012df7",
               "name": "Jack Green",
               "profile_path": null,
               "id": 356,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe447f9251416c91012dfd",
               "name": "Jim McGlynn",
               "profile_path": null,
               "id": 985930,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.657106,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31465,
      "vote_count": 6,
      "budget": 0,
      "overview": "A young man, Pat, visits the clan of gypsy-like grifters (Irish Travellers) in rural North Carolina from whom he is descended. He is at first rejected, but cousin Bokky takes him on as an apprentice. Pat learns the game while Bokky falls in love and desires a different life. Written by Jeff Hole",
      "similar": [
         1696,
         11564,
         2142,
         3134,
         948,
         8810,
         298312,
         141,
         185,
         101,
         205,
         949,
         23483,
         769,
         773,
         793,
         4771,
         4638,
         241,
         550
      ],
      "original_title": "Traveller",
      "runtime": 101,
      "poster_path": "/h7j4YhdMk1Dd8EfROo0GNuoBoHy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MDP Worldwide",
            "id": 10828,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Banner Entertainment",
            "id": 38764,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-18",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Swindlers. Scammers. Con-men. As American as apple-pie.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack N. Green"],
      "runtime": 101,
      "synopsis": "On the highways and backwoods of the rural south, a coterie of Irish grifters live in a world distinctly and exclusively their own. Moving from town to town, the Travellers make their living through the family business, conning and scamming nearly everyone whose path they cross. Into this world ventures Pat O'Hara who returns to the Travellers to bury his father, once a Traveller cast out for marrying an outsider. He is shunned by the head of the clan but cautiously accepted by Bokky who takes the young man under his wing and teaches him the way of their forefathers. The two take to the road running con jobs and always staying one step ahead of the law. Along the way they meet Jean, a hard working bartender and single mother, and promptly devise a plan to swindle away her hard-earned money. But Bokky's instinct for quick cash and fast getaways runs into an unexpected obstacle... his heart.",
      "writers": ["Jim McGlynn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120366/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2NTk5ODA3Ml5BMl5BanBnXkFtZTcwMjE3MjAzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Paxton, Mark Wahlberg, Julianna Margulies | See full cast and crew »"],
      "reviews": [
         "This could have been an interesting movie but it didn't live up to its promise. For one, the \"traveller\" culture of itinerant Irish grifters is explored very sketchily, if at all. The violent climax seems like an import from a totally different kind of movie. The only really entertaining scam was the one that Bokky and Pat pull on Jean, the bartender Bokky ends up falling for. The rest were either so simple as to be dull (the phony sealant, the trailers) or so complex you couldn't follow them (the scam involving the Turks). There are much better movies about con men; \"House of Games\" is probably my favorite. The acting alone makes \"Traveller\" worth watching. Bill Paxton is very good as Bokky, a likeable rogue with a sincere face and an awakening conscience, and he credibly conveys his growing love for Jean; his anguish when he has unwittingly put her in grave danger is palpably and painfully real. Julianne Margulies brings warmth and spunk to her potrayal of Jean, and the romantic chemistry between her and Paxton is undeniable. Mark Wahlberg, in one of his first \"real\" roles, projects just the right mix of boyish vulnerability, charm (in the scenes where he's romancing Kate, the clan boss's daughter), and cool-dude moxie. As the old grifter \"Double D,\" James Gammon is a lot of fun to watch whenever he's onscreen. Unfortunately, the screenplay doesn't do enough to develop the two main characters. For instance, Bokky seems to have a good heart; yet he's been conning people for years (not even siphoning some extra cash from rich people for whom it's merely a drop in the bucket, but cheating poor and ignorant folk -- in some cases, cheating them out of their life's savings), and somehow it never bothered him until he met Jean. That doesn't make much sense. As for Pat, I think the film should have told us more about his life \"on the outside.\" We gather that he's poor and doesn't have too many opportunities (though he's dressed nicely enough when he arrives for his father's burial), but it's still hard to understand exactly why he's so eager to be a part of the \"family\" and to join a lifestyle in which his choices, even about things as basic as whom to marry, will be severely restricted, or why he thinks it's so terrible that Bokky risks being excommunicated from the Travellers. (Bokky's on-the-road life certainly doesn't look like being \"on top of the world\" to me.) Pat's relationship with Kate is treated as an afterthought, maybe a plot device to give him a reason to come back to the Travellers camp. Because of these flaws, the character development that could have been the strongest part of this movie never really gels. The shaky plot structure, especially toward the end, compounds the problems.",
         "\"Traveller\" boasts nothing spectacular (unless you count James Gammons blowing everyone off the screen in every scene he's in), but is smart little movie and a fine choice for a lazy Sunday afternoon. Bill Paxton, taking a break from blockbusters like \"Twister\" and \"Titanic,\" stars and executive produced this slice-of-life drama, and he's solid as a member of a quaint Irish, gypsy-like nomadic group that cheats people out of money. Mark Wahlberg, who is becoming one of the finest young actors working today, plays his protege, and Gammons comes along as an outsider who helps the pair out on a gig. Julianna Marguiles of \"ER\" also shows up as Paxton's love interest. The acting is uniformly fine, the cheating schemes are twisty and unpredictable, and the story is nicely touching. Though not without some ordinary moments (Wahlberg's romance wastes time, why the ultra-violent ending?), this is a fine sleeper of a film.",
         "After reviewing the comments found here, I find myself wondering if the film I've seen four or five times could possibly be the same one described in several of the reviews here. \"Thinly disguised agendas, unrealistic plot lines, uncertain performances.\" I don't understand the issues here. Traveller is a fine movie, worthy of much wider exposure than it ever received. The performances by Paxton, Marguiles and Wahlberg are all top notch, and rate among the finest work I've seen any of the three produce. James Gammon's performance is a tremendous character piece and even those who don't like \"Traveller\" should watch that with spellbound interest. (Ebert's Stanton-Walsh rule should apply here.) The script could use a little tightening in places it's true. And I will agree that I would have liked to see more of the back woods life, but that's a selfish interest and not something that was integral to the success of the film. We see that old home life in every shade of Paxton's performance. He carries it with him constantly, only letting go of it in brief moments with Marguiles. Wahlberg's performance is described elsewhere as \"uncertain.\" In my mind, that's the point. Pat is uncertain. That's the performance. That's the character. That's acting. He never knows where he stands. He rarely if ever knows what he wants, let alone what he'll be able to possess. This movie tries to be a lot of things. And it succeeds in most. It is a road movie, a romance, a con, a story of failed redemption and more. It's a North Carolinian mafia movie. Sure it's not \"The Godfather.\" But it ain't \"Mobsters\" either.",
         "The smooth scams and chemistry between the actors in this film work well. The rest, not so much. I'm a sucker for movies about con-men, and the tricks they pull in this movie seem both original and believable. But despite fine acting and an interesting backdrop, you just keep getting the feeling that a lot of stuff was thrown together while the script was being written. Both of the quasi-romances are hard to buy, and the ending seems like a scene from the \"Death Wish\" series tacked onto a character study. Probably worth checking out, but not a great movie.",
         "Traveller doesn't really know what it wants to do. It ends up as a strange mix of road drama and romance, but whatever it's doing, it works. Paxton provides a creditable performance as the experienced Traveller, and Margulies shines in her role as Jean; their relationship is nicely understated, and well played. However, it's Wahlberg who provides the uncertainty in this movie - he doesn't really know how he is playing his character. As for the much criticised turn to violence in the finale, it is indeed unexpected, but not altogether unwelcome and it makes for an interesting climax. The film is very good, but it could so easily have been excellent.",
         "...you'll do far better enjoying Guy Ritchie's \"Snatch\" in which Brad Pitt's Mickey brings that entire Celtic sub-culture to near preternatural perfection. It's also a much better movie. I feel that Traveler wastes so much of its potential impact with lame ripoff schemes and a confusing sense of who and what the Travelers actually are. Also, setting it in America is like setting a movie about Eskimo life (not that I'm comparing Travelers to Alaskan natives by any means) in New Orleans. North Carolina? Paxton and Marky Mark are talented performers but this film, while certainly watchable, doesn't really seem to get to the point.",
         "This was totally interesting to watch, but it needed two things: (1) to be based in some kind of reality; (2) to have a conclusion for the characters. In the picture, you see Marky Mark getting into a romance with the daughter of the capo di capos, but absolutely nothing comes of it. And what happens to Bill Paxton's girlfriend. And even the scheme for the counterfeit bills, which should have been crystal clear, did not hold together. And who are these people? I get the feeling that the filmmakers were trying not to call them gypsies or roma--fear of offending an ethnic group. Rather, they seemed to be some combination of Irish and Italian. But the movie would make more sense if it were clearly grounded in a real group of people. But, that said, I still enjoyed every minute of it. It just ended too soon.",
         "To satisfy one reviewer's curiosity: These people do exist, or at least clans like them exist. There is a well-known Scottish clan who are con artists, doing roofing jobs, driveway sealing, etc. that are no good. They gather yearly in Cincinnati, OH at which time the local media warn people to beware of them and their \"work\". Their graves are marked by rather gaudy headstones and monuments in Cincinati's Spring Grove Cemetery. The cemetery has been the resting place of prominent cincinnati families since the 19th century. I first was told of these people (perhaps the name of the clan is MacDonald) when I was shown the cemetery many years ago. Their red granite monuments stuck out like sore thumbs amongst the more sedate ones of proper Cincinnatians. As to whether an Irish clan of travellers exists, I do not know, but the Scottish clan does. As to the movie--Nice, small film. Nice work by Bill Paxton and Mark Wahlberg.",
         "I'm only 15 minutes into the movie and already mad at the writers. Having watched 4 seasons of American Gypsies, My Big Fat Gypsy Wedding (UK and US versions), and other documentaries on real gypsies, I know that most gypsies are NOT crooks, cheats, swindlers, grifters, scammers, and so on. All this movie is doing is perpetuating negative, damaging stereotypes about this American subculture with a rich, long, and interesting history. Had the writers stuck to the truth about Gypsy culture, the story would be much, much better. Although I am not a gypsy, I believe that every culture or group of people has a right to be portrayed accurately, based on fact and not supposition. This is why I am so upset by this film. Already, I have considered changing the channel (I'm watching it on Showtime), but I've decided to stick it out and see just how I feel after seeing the complete story. Down with prejudice, up with truth!",
         "The only thing that stood out for me after watching the movie was the name Vincent Chase. I found it interesting that Mark Walhberg the producer of Entourage worked with Vincent Chase the actor. Of course there is no photograph of Vincent Case anywhere The name was subsequently used by Adrian Grenier as Vincent Chase the lead role in Entourage. The movie was not bad and could have had a different female lead besides Julianna Margulies. Margulies was good but would have been better if she would have shed some of her clothes during the sex scenes with Bill Paxton to spice up the chemistry."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Banner Entertainment",
         "MDP Worldwide"
      ],
      "summaries": ["A young man, Pat, visits the clan of gypsy-like grifters (Irish Travellers) in rural North Carolina from whom he is descended. He is at first rejected, but cousin Bokky takes him on as an apprentice. Pat learns the game while Bokky falls in love and desires a different life."],
      "budget": 0
   },
   "movielensId": 1508,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-04-18",
      "dvdReleaseDate": "2000-07-25",
      "directors": ["Jack Green"],
      "runtime": 101,
      "movieId": 1508,
      "title": "Traveller",
      "mpaa": "R",
      "actors": [
         "Bill Paxton",
         "Julianna Margulies",
         "James Gammon",
         "Nikki DeLoach",
         "Luke Askew",
         "Danielle Keaton",
         "Mark Wahlberg"
      ],
      "imdbMovieId": "0120366",
      "originalTitle": "Traveller",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": ["9dOZyrzR7R0"],
      "plotSummary": "A young man, Pat, visits the clan of gypsy-like grifters (Irish Travellers) in rural North Carolina from whom he is descended. He is at first rejected, but cousin Bokky takes him on as an apprentice. Pat learns the game while Bokky falls in love and desires a different life. Written by Jeff Hole",
      "tmdbMovieId": 31465,
      "avgRating": 3.30751,
      "releaseYear": "1997",
      "numRatings": 213,
      "posterPath": "/h7j4YhdMk1Dd8EfROo0GNuoBoHy.jpg"
   }
}