{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "role of women",
            "id": 2273
         },
         {
            "name": "lesbian relationship",
            "id": 9833
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "white woman",
            "id": 199656
         }
      ],
      "imdb_id": "tt0118586",
      "video": false,
      "title": "All Over Me",
      "recommendations": [
         114931,
         29371,
         12808,
         513,
         177851,
         44305,
         46989,
         42548,
         10520,
         133605,
         56823,
         18212,
         106538,
         37636,
         43088,
         12802,
         230428,
         118075,
         21060,
         44895
      ],
      "backdrop_path": "/qRhTEvvnZxJxUpGbM4qwrDMv8WN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Claude",
               "gender": 1,
               "credit_id": "52fe45239251416c7504d09d",
               "name": "Alison Folland",
               "profile_path": "/j4LkS9pycdpKECqZ4bCTqMtZrHA.jpg",
               "id": 2841,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "52fe45239251416c7504d0a1",
               "name": "Tara Subkoff",
               "profile_path": "/qBbSymmytAOqgAGlll3sN5LXih3.jpg",
               "id": 61111,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe45239251416c7504d0a5",
               "name": "Cole Hauser",
               "profile_path": "/2izzcOrZpt22ObHjSNq3qRhrGHu.jpg",
               "id": 6614,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jesse",
               "gender": 2,
               "credit_id": "52fe45239251416c7504d0a9",
               "name": "Wilson Cruz",
               "profile_path": "/3LeVIilQnq53TYpxhBqAEpUJfuw.jpg",
               "id": 54453,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe45239251416c7504d0ad",
               "name": "Leisha Hailey",
               "profile_path": "/f2W0tXQKYbRZuxiIdg7RucQqJrS.jpg",
               "id": 18660,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Gus",
               "gender": 2,
               "credit_id": "52fe45239251416c7504d0b1",
               "name": "Shawn Hatosy",
               "profile_path": "/deVcvUyZEybTQuyBYiioVJ4Lyst.jpg",
               "id": 52647,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Don",
               "gender": 2,
               "credit_id": "52fe45239251416c7504d0b5",
               "name": "Vincent Pastore",
               "profile_path": "/4SlzY9TtgQKDVu2GIYu3M73MxeP.jpg",
               "id": 47774,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45239251416c7504d093",
               "name": "Alex Sichel",
               "profile_path": null,
               "id": 73622,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe45239251416c7504d099",
               "name": "Sylvia Sichel",
               "profile_path": null,
               "id": 73628,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "564df343c3a368602400bff6",
               "name": "Dolly Hall",
               "profile_path": null,
               "id": 33650,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "564df35692514158f6005f8a",
               "name": "Leisha Hailey",
               "profile_path": "/f2W0tXQKYbRZuxiIdg7RucQqJrS.jpg",
               "id": 18660,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "564df3669251414dc400a5c5",
               "name": "Miki Navazio",
               "profile_path": null,
               "id": 1538328,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "564df377c3a368602800af73",
               "name": "Joe DeSalvo",
               "profile_path": null,
               "id": 786406,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "564df38ac3a368602800af77",
               "name": "Sabine Hoffman",
               "profile_path": null,
               "id": 932147,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "564df39a9251414dcd00aa62",
               "name": "Lina Todd",
               "profile_path": "/d4BTPVOh4Vj2Rhc7dHiYrF4BxDp.jpg",
               "id": 67702,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "564df3b19251414dc400a5d1",
               "name": "Amy Beth Silver",
               "profile_path": null,
               "id": 65916,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "564df3c29251414dcd00aa6b",
               "name": "Kristen Vallow",
               "profile_path": null,
               "id": 1538329,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "564df3d5c3a368603500aa51",
               "name": "Kevin Donaldson",
               "profile_path": null,
               "id": 1522809,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "564df3e8c3a3682a1a005ae2",
               "name": "Victoria Farrell",
               "profile_path": null,
               "id": 54900,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "564df40f92514158f6005fa7",
               "name": "Bill Coleman",
               "profile_path": null,
               "id": 1538330,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "564df459c3a368603500aa61",
               "name": "Jamie Babbit",
               "profile_path": "/6RacsuB5pCLuy4qcIA7FeTxhYZM.jpg",
               "id": 59466,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.789294,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 12793,
      "vote_count": 18,
      "budget": 0,
      "overview": "Claude and Ellen are best friends who live in a not-so-nice area of New York. They're involved in the subculture of 90s youth, complete with drugs, live music, and homophobia. All is changed one night when a violent and meaningless death rocks their lives.",
      "similar": [
         258480,
         449176,
         376867,
         26280,
         9261,
         338189,
         11421,
         370663,
         1213,
         244772,
         546,
         184352,
         468,
         10938,
         1378,
         40807,
         41630,
         112160,
         858,
         141
      ],
      "original_title": "All Over Me",
      "runtime": 93,
      "poster_path": "/t6pWT0Ldi2IUaGxQBMlZVKL1BXh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Slam Pictures",
            "id": 68247,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Baldini Pictures",
            "id": 2705,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Medusa Pictures",
            "id": 68248,
            "origin_country": ""
         }
      ],
      "release_date": "1997-02-15",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alex Sichel"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Sylvia Sichel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118586/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MzY4NzI0M15BMl5BanBnXkFtZTcwMjQ0MDY5Mg@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Alison Folland, Tara Subkoff, Cole Hauser | See full cast and crew »"],
      "reviews": [
         "Dreaming of becoming a rock star and hanging out, Claude (Alison Folland) is just like any other fifteen year-old girl. Almost. As the school year nears an end, she finds her relationship with Ellen (Tara Subkoff) strained. And a new friend, Luke, enters her life. Ellen is suddenly caught up in her new boyfriend, (Cole Hauser). However, Claude doesn't feel the same way about guys. Claude is attracted to girls. To be specific, she's fallen in love with Ellen. And all that happens is Ellen gets closer and closer to Mark. When Ellen begins a downward spiral into drugs, alcohol, and late-night partying, Claude has to make a decision. Will she be there for Ellen when she needs her most? Or will she stop letting Ellen use her? To complicate things more, a new love interest enters Claude's life and another friend makes an exit. Claude is forced to weigh the importance of her relationship with Ellen against her conscience. In the end she has to do the right thing and deal with her best friend hating her. In a matter of days, Claude loses two friends, gains one, and also gains a love. And in the end there is no looking back. This film is the ideal indie movie. Subkoff and Folland shine along with the rest of the excellent cast. Superb writing and cinematography combined with a hip urban soundtrack make this a must see.",
         "Alison Folland plays Claude with such understanding and moving intimacy, letting us in on all of Claude's feelings with such effortless grace that you wonder why the hell isn't this terrific woman isn't getting Gwyneth Paltrow's roles? Maybe she's too damn good for them. She makes her characters so real (she did the same with To Die For's Lydia) I could go on and on. But there's more to this movie than Folland's masterfull take on it. The movie is about a 15-year-old girl named Claude in Hell's Kitchen. She hangs out with Ellen (Tara Subkoff) and is in love with her. These conflicted feelings usually accompany gay-teen-coming-of-age movies, but never before has it seemed so honest. Claude makes friends with a gay neighbor named Luke (Pat Briggs from Psychotica) who helps her become more realized about her gay feelings. She seems like every teen out there, gay or straight, dealing with their emotions and trying to make sense of everything. She meets Lucy (Leisha Hailey of the Murmurs) who puts her emotions exactly where Claude can see them. Ellen is no help though. She's even more screwed-up. She confuses Claude by not minding a kiss every now and then, mean while dating a loser drug dealer, who eventually devides the two after the death of Luke. The most powerful scene of any movie I've seen in a long time takes place the first time Claude goes over to Lucy's house. Claude (a Patti Smith fan) turns on her song \"Pissing in a River\" and is emotionally overwhelmed while a confused Lucy watches helplessly. It's such a rare rock 'n roll moment of power that well represents a beautiful movie.",
         "The setting is Hell's Kitchen, the time the 90s, the lead characters, some confused, angst-ridden teens. There's not much plot here, nor much character development. Just a brief walk on the wild side of big city life. Focusing on a sensually ambivalent girl and her off and on lovers and acquaintances, there are very good performances and atmospheric details to savor. Competently directed, with a rich rock track, these short vignettes explore a feminine teen scene rarely depicted in films. Make no mistake, though, this journey is definitely not for everyone, and only those who have the energy, stamina and interest in examining tough urban life from a young feminine perspective, will be rewarded.",
         "I loved this movie. The writing was right on, fantastic. This movie could have been very bad had it not been for the wonderful dialogue and the dynamics between the well crafted and developed characters. The casting was superb. Alison is soooo good. And Leisha has the best hair! The soundtrack is great, it included my favorite band, which was a surprise for me! I loved this movie's subtlness messages and how it's so open to interpretation. For instance, when Ellen says \"I hate you.\" It's a great friendship movie and spoke powerfully to me as I've been in Claude's kind of position before. I watched it twice in one day.",
         "I just watched this film on IFC and was really impressed with how well done it was, the acting is really fantastic as well. This one was a sweet story and had real depth of the people we watched in the film. Bravo all around!",
         "I love this movie! It is so real, and people of all ages and sexual preferences can relate to this storyline and the characters. The characters are intense and dramatic but are fresh faces and are real, none of them are made up to be portrayed as perfect, gorgeous and although most of them especially Leisha Hailey are good looking, they are not made up to be that way, they are natural, and it is good to see. I think that teenagers especially those who are confused about their sexuality can appreciate a movie like this, because it is saying that they are not the only one out there who has these problems and it could be somewhat of a comfort.",
         "While I do not think it was a bad made film and the acting was decent, it was not enough to hold my attention. I would not say it was a horrible movie or the worst I have ever seen, but I also do not think I would be telling people to run out and see it. The character Ellen made me want to smack her and also the girl Claude for putting up with crap from Ellen. If you look closely there are several people who have gone onto bigger and better things that are in this not so well known film. It is easy to see the inner struggle between a girl trying to grow into herself and trying to be loyal to her undeserving best friend. This is a movie anyone who has an undeserving best friend should see.",
         "Alison Folland is a young woman in a shabby section of New York who, after a tempestuous friendship with blond, impatient Tara Subkoff, and the murder of her gay buddy Luke, comes to terms with her own lesbianism and finds a happy and accommodating partner in Lucy, a band leader in a place that looks like the Swing Rendezvous in the Village used to look. Maybe that makes it sound more complicated than it is. It's really a rather simple movie, a little pedantic, a delicate character study rather than a mystery or action movie. Roughly speaking, all the gays are good and all the straight people are messed up. That's not too hard to follow, is it? Well, there are a couple of exceptions, but not many. Don, the Italian owner of the pizza restaurant where Alison and a gay guy both work, is straight but sympathetic. He's briefly in about four scenes. But it's hard to care about Don's character one way or the other because he serves up these GREAT pizzas (we only get a glimpse but can practically smell it) that make Domino's and Pizza Hut look like impostors. Try to get a pizza like that at four in the morning in northern Scotland! The rest of the straight guys are represented by the boyfriend of Alison's mother, who, in the absence of the mother, begins dangling his insinuations in front of the girl herself, who looks about 16. The straight adolescent goons who ball Subkoff when they feel like it and throw her out when they're bored with her are little more than perambulating pustules. Folland plays a dumpy adolescent who is shy but sensitive. In fact, however, she has a splendid face with modelesque features, fey and pixie-like. Her bone structure is pretty big though and, alas, the configuration of her weight suggests a strong genetic component. There won't be much she'll be able to do about it. It shouldn't matter, but it always does. Subkoff, her inconstant adolescent friend, has a more conventional and rather skinny figure but her voice, features, and demeanor are coarser than Folland's. She looks like Buffy the Vampire Slayer if Buffy were the vampire instead of the slayer. She has probably the most demanding role in the film and brings it off marvelously, a complex character very nicely rendered. The photography and location shooting are just fine. And the movie does middle-class urban dwellers a big favor. You know those young chicks you see on the streets? The ones with violently pink hair done up in a fashion resembling a tangled mop? The ones with maybe a jail-house tat around their biceps? With their clothes half drooping off and that silver ring dangling from their pipiks? Well, only some of them are dangerous stoners. Many of them are just playing with their appearance, as adolescents are want to do in all cultures, and they may be a little thoughtless but fundamentally decent people. I'd watch out for the guys though, especially if they're straight. They have a slight tendency to murder people they find offensive. At least that's what the film suggests.",
         "All Over Me is a film that isn't so much about telling a story as much as it is about feelings and emotions within the characters that are not so obvious at first. The intentions and desires of the characters unfolds as the movie progresses at a very slow pace, and the dialog is intentionally bland, not sharp in any way, as if it was real life. There is no attempt by the filmmaker or actors to make this look like it is a movie, beyond some rather artsy shots here and there. It is simply a window into a young girls life and the small, confused, somewhat corrupted world that surrounds her while she is making another transition in her development in life. This is a very subtle film with very few shifts in tone. The action that leads to the most drastic shift in the film is not even seen, only talked about later on. Even the more climatic moments result in not much happening, though tension does build on a number of occasions. The acting is top notch. In fact, the acting is so superb that it almost makes me wish that the script had just a little more zing to it since the actors could have definitely pulled off some colorful dialog and made for some classic scenes. Regardless of that, All over Me is a good enough film, though if you can't get into the characters or want to see a movie that feels like a movie and not a documentation of life, you won't dig it.",
         "Personally, I find this a very good movie in the way how it handles the subjects love, friendship, argue, sadness and violence. There are also lesbian and gay characters in it. It's a good and realistic story and I think it can help some young lesbian and gay persons if they watch this movie. It's for anyone good to watch this. Alison Folland (I'm a big fan of hers) plays Claude. She is in love with her friend Ellen. Ellen on the other hand is dating Mark but he don't care (much) about her and helps her taking drugs. He is also busy with criminal activities. Claude finds it difficult to see Ellen with him because of her feelings and later on she finds out more and more that he is a bad person. The friendship between Claude and Ellen first is kinda special but later on they get argue because Ellen is very much influenced by Mark. There is also a murder in the story. It's someone Claude knows and it effects her as well. At some moment, Claude meets Lucy, a girl in a music store. They like each other but don't talk yet. Later on someone says that she should try a certain bar so that she can meet people there. In that bar are playing girl bands. She does and finds Lucy again by some lucky chance! I won't tell you how the movie continues because it's nicer for you if you watch it yourself! Also, I find the music good and I think it suits the story. And by looking at the clothing of the characters we can see that the weather is warm."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Baldini Pictures",
         "Medusa Pictures",
         "Slam Pictures"
      ],
      "summaries": ["Claude and Ellen are best friends who live in a not-so-nice area of New York. They're involved in the subculture of 90s youth, complete with drugs, live music, and homophobia. All is changed one night when a violent and meaningless death rocks their lives."],
      "budget": 0
   },
   "movielensId": 1509,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-02-15",
      "dvdReleaseDate": "2005-06-14",
      "directors": ["Alex Sichel"],
      "runtime": 93,
      "movieId": 1509,
      "title": "All Over Me",
      "mpaa": "",
      "actors": [
         "Alison Folland",
         "Tara Subkoff",
         "Cole Hauser",
         "Wilson Cruz",
         "Leisha Hailey",
         "Shawn Hatosy",
         "Vincent Pastore"
      ],
      "imdbMovieId": "0118586",
      "originalTitle": "All Over Me",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["at1VECYv_tw"],
      "plotSummary": "Claude and Ellen are best friends who live in a not-so-nice area of New York. They're involved in the subculture of 90s youth, complete with drugs, live music, and homophobia. All is changed one night when a violent and meaningless death rocks their lives.",
      "tmdbMovieId": 12793,
      "avgRating": 3.44159,
      "releaseYear": "1997",
      "numRatings": 214,
      "posterPath": "/t6pWT0Ldi2IUaGxQBMlZVKL1BXh.jpg"
   }
}