{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "new zealand",
         "id": 2658
      }],
      "imdb_id": "tt0115760",
      "video": false,
      "title": "Broken English",
      "recommendations": [],
      "backdrop_path": "/8zwdOkqmOnXORt7iuaMtqTUm2q6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ivan",
               "gender": 2,
               "credit_id": "52fe4ab1c3a368484e161f43",
               "name": "Rade Serbedzija",
               "profile_path": "/hbP9ku9cP8Q2cmdB9WIcpkPJaIL.jpg",
               "id": 1118,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Nina",
               "gender": 0,
               "credit_id": "53d14fe20e0a265de700d200",
               "name": "Aleksandra Vujcic",
               "profile_path": null,
               "id": 1345951,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "53d14ff50e0a265df000d0e4",
               "name": "Julian Arahanga",
               "profile_path": "/jFNdkOB6UhQEsN5Bo5Q5d2qT9YX.jpg",
               "id": 7244,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Darko",
               "gender": 2,
               "credit_id": "53d150080e0a265dea00d137",
               "name": "Marton Csokas",
               "profile_path": "/g36Ydyv0YbwXLOQ2KzGjFfkCDo1.jpg",
               "id": 20982,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ab1c3a368484e161f3f",
               "name": "Gregor Nicholas",
               "profile_path": null,
               "id": 938945,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53d14fa80e0a265dfa00cfe6",
               "name": "Gregor Nicholas",
               "profile_path": null,
               "id": 938945,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53d14fb60e0a265df000d0e0",
               "name": "Johanna Pigott",
               "profile_path": null,
               "id": 1233745,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53d14fc40e0a265e0100cd4d",
               "name": "James Salter",
               "profile_path": null,
               "id": 129710,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.076458,
      "production_countries": [{
         "iso_3166_1": "NZ",
         "name": "New Zealand"
      }],
      "id": 124680,
      "vote_count": 2,
      "budget": 0,
      "overview": "Ivan is the fierce patriarch of a family of Croatian refugees in Auckland. Nina is his daughter, ready to live on her own, despite his angry objections. Eddie is the Maori she takes as her lover. Nina works at a restaurant where Eddie cooks. For a price, she agrees to marry a Chinese, another restaurant employee, so that he (and his Chinese wife) can establish permanent residency. The money gives her the independence she needs to leave her parents' house and move in with Eddie. Complications arise when Eddie realizes the depth of her father's fury and the strength of Nina's family ties.",
      "similar": [
         527,
         713,
         1088,
         39356,
         201865,
         246741,
         371645,
         283322,
         763,
         9912,
         108994,
         8748,
         361315,
         9964,
         3603,
         32932,
         14627,
         108812,
         258030,
         361318
      ],
      "original_title": "Broken English",
      "runtime": 92,
      "poster_path": "/5RjC7mxdE7trBEWA6vQxdktbRut.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "",
            "iso_639_1": "mi"
         },
         {
            "name": "",
            "iso_639_1": "sh"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Village Roadshow Pictures Worldwide",
            "id": 28273,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Communicado Productions",
            "id": 28274,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "New Zealand Film Commission",
            "id": 294,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "New Zealand On Air",
            "id": 295,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Sometimes when you make love you make war.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gregor Nicholas"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Gregor Nicholas",
         "Johanna Pigott"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115760/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1NTgwNTE4MV5BMl5BanBnXkFtZTcwMDgwMDIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Aleksandra Vujcic, Julian Arahanga, Rade Serbedzija | See full cast and crew »"],
      "reviews": [
         "Nina, young, beautiful and sexy, driven out from war-torn Croatia, has emigrated with her family to Auckland, New Zealand. Why New Zealand? Well it seems Mum was born there (there is an old established \"Dalmatian\" community in the region famously associated with the wine industry). Dad has quickly found work as a building contractor and seems to be doing well. Ironically, having been driven out of his own country by Serbian ethnic cleansing, he finds NZ's mild multi-racial society impossible to tolerate, at least when his gorgeous daughter falls seriously in lust with Eddie, a handsome Maori, in the kitchen of the Chinese restaurant where they both work. Being a fairly typical NZ movie, the theme is played for comedy rather than tragedy, though there is plenty of tension. An erotic scene early on dissolves into a minor domestic mishap. Cars get their windows smashed but no-one gets their head smashed in. The real tragedy is back home in Croatia via home videos from remaining relatives. The young couple progress from 90% lust /10% affection to about 50/50, though it's a rocky road. Dad however just can't adjust. Civil enough with his Tongan (\"coconut\") neighbours, the idea of his little girl having it off with any Maori sends him ballistic (it could have been worse - the lover might have been Serbian). With his knucklehead son, he attempts to break them up, with predictable lack of success. It's a great sketch of a tough, admirable (in some ways) but unadaptable man. Why is he like that? At the end we're none the wiser. Nor do we get to understand Mum's position, which seems to be total submission. She may be NZ born but she isn't a typical post 1960 NZ wife. There's a mildly amusing sub-plot regarding an immigration scam run by Nina and Eddies's employer, with the characters involved verging on caricature. But the main theme is that youth will do what it's going to do (sex, mostly) for good or ill and the oldies might as well stand clear. A nicely made and well paced light piece from the producers of the rather more serious \"Once Were Warriors.\"",
         "This movie was hard to track down. Living as I do in America, I had to order a VHS copy. I saw the NC-17 version, by the way, which I didn't find to be too graphic. The sex scene was extremely sexy and I thought the actors playing Nina and Eddie, the young couple at the center of the movie, had a ton of chemistry. You could believe they were attracted to each other. Nina, the Croation daughter of Ivan, was an interesting character: a wild rebel and a scared child eager to remain her father's favorite all in one. The actor who played Ivan did the best job, as a man who fled his homeland due to ethnic cleansing and finds himself obsessed with race and dissatisfied with his new life in New Zealand. The beginning half of this movie was more enjoyable than the latter half, when the story devolves into a slightly predictable romantic comedy and none of the interesting implications about class, race, and family are dealt with in a serious way. However, a lot of romantic movies never even ask the audience to think about anything greater at all, so Broken English still comes out ahead of more traditional movie fare. Perhaps it's because this movie comes from the producers of \"Once Were Warriors\" which is one of my favorite dramas of all time. Watch for the romance between Nina and Eddie (played by Julien Arahanga from \"Once Were Warriors\",) Ivan, and Martin Csokas' portrayal of Ivan's menacing son.",
         "I really liked this film. It was a love story like West Side Story. It has probably been 7 or 8 years since I last saw this film. I think a film is especially meaningful when it is related to some real crisis or event. In the case it was the migration of Croatian refugees to New Zealand and their conflicts with the Maori which said a lot about the issues of race, class and ethnicity. But what has really stuck with me was the music. The recurring gypsy/tango musical interlude made the film for me. It is in my ears right now sort of like the theme for \"Last Tango in Paris\". I thought there was no published soundtrack made for this film. Please if you are aware of where to obtain a copy of this soundtrack, please let me know.",
         "It looks as if I am among the few who found the directing and production to be flawless. Janet McIver was also the production manager of Whale Rider and Once Were Warriors. Broken English is a delicate movie where the father tries to balance self-control and the love for his family. It is a harsh look at bigotry, and the ramifications of such behavior. Unlike Once Were Warriors, Broken English scores with great acting and has a much better script. True to life, the movie doesn't offer simple answers for the problems the cast deal with. If you're a fan of viewing different cultures, you will most likely enjoy this movie. I enjoyed this movie much more than the other two listed above.",
         "There have been a lot of great culture clash stories, and culture clash love stories, over the years, but this isn't one of them. Part of the problem is we have three cultures here (New Zealand, Bosnian, and Chinese), yet we really don't explore them in depth (except perhaps the Bosnians), so there seems no apparent reason why the New Zealand and Bosnians wouldn't get along except for plot purposes. And while the sex between the two main characters is well-handled, it seems to be the only thing the relationship is based on; we don't really see them get to know each other. The two main characters are appealing, and the two actors who were in ONCE WERE WARRIORS(here playing brothers instead of father and son) are both good, but it still falls short.",
         "I found 'Broken English' one night at the video store when I was bored and couldn't find anything else to rent. I read the caption and that was enough to perk up interest. I have to say I thought the movie was pretty cool, although I agree that there are major gaps in what makes people like Ivan and his son Darko tick. The racism of Ivan, of course, is just ridiculous. Not that they used it in the film, but that he should have the gall to treat the Maori culture so shabbily (what is that black child doing in the family if he doesn't like black people??). After all, his family came to NZ fleeing war, not the other way around. The Maori were happily (hopefully so)going about their business long before the Croats showed up (probably the same could be said for the English, the Scots, the Irish and all the other Euro-peans arriving on boats to lord and rule for all these years). At least the film gives people, particularly American audiences, a glimpse into a little known culture like New Zealand (kiwi fruit and Russell Crowe, that's about it--and he gets tagged as Aussie most of the time). A shame is that Marton Csokas only gets to give himself to us as a straight-up meat head (a very good portrayal, but a meat head nonetheless) because he's a talented fellow. Ah, well, such is life. Tee",
         "In a nutshell, this is a romance story that involves a culture clashes between New Zealanders, Chinese and Bosnians. Since the characters were unappealing, I found it impossible to get \"involved\" in their romances and problems. I don't understand the NC-17 rating, either. The sex scenes weren't anything that strong to warrant that rating, nor is the movie filled with just sex. The language isn't the best with a lot of f-words, but that doesn't warrant a NC-17 rating, either. It was a modern-day Romeo and Juliet story with a lot lower morals that what you would have seen in the real Romeo and Juliet days. Frankly, I found the movie boring, but women would probably like this movie a lot more than men, if the language didn't turn them off. The scenery was nice but I wasn't surprised at that. I have yet to see something filmed in New Zealand that wasn't beautiful. That must be a great-looking country.",
         "The plot of \"Broken English\" is easy to summarize: Boy and girl meet. Boy and girl like each other. Girl's father is violent and jealous. Father hates boy. Boy must subdue father. Boy fights father and wins. (Unfortunately, boy accidently runs over father's vicious but hapless dog in the process.) Boy and girl live happily ever after. The video jacket says \"Broken English\" was made by the producers of \"Once Were Warriors.\" Many of the two movies' elements are similar (notably the primitive father in each), though this one has only about one-fifth the quantity of stomach-churning violence of the greatly overrated \"Once Were Warriors.\" But in both movies, the father exhibits much violently stupid behavior, and midway through this one I wondered, \"Why don't the police just lock the guy up?\" I gave \"Broken English\" a rating of six.",
         "\"Broken English\" is about a Croatian woman who lives with her old world parents in New Zealand and falls in love with a Maori man which, of course, causes problems while she acts as though she had no clue that would happen. Duh. Though it manages a modicum of entertainment, this film seems to know where it wants to go but has to pound square characters through round holes to make the plot work. In the process there are too many tongue clucking moments where the film's credibility is breached such as when a modern Maori man fights and chants like an ancient Maori warrior or a woman swims with dolphins which, as we learn, they only do with pregnant women...yeah, right. The characters in \"Broken English\" are in serious need of some conflict resolution...something which no one seeks as it would destroy the contrived drama. \"Once Were Warriors\" this film is not. However, it is an okay watch for those into Kiwi flicks with time on their hands. (C+)",
         "A disappointing film to say the least. Characters were stereotypically portrayed. Doesn't surprise me if this was directed by a Englishman who wanted to update Griffith's Broken Blossom. Avoid."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Communicado Productions",
         "New Zealand Film Commission",
         "New Zealand On Air"
      ],
      "summaries": ["Ivan is the fierce patriarch of a family of Croatian refugees in Auckland. Nina is his daughter, ready to live on her own, despite his angry objections. Eddie is the Maori she takes as her lover. Nina works at a restaurant where Eddie cooks. For a price, she agrees to marry a Chinese, another restaurant employee, so that he (and his Chinese wife) can establish permanent residency. The money gives her the independence she needs to leave her parents' house and move in with Eddie. Complications arise when Eddie realizes the depth of her father's fury and the strength of Nina's family ties."],
      "budget": 0
   },
   "movielensId": 1519,
   "movielens": {
      "languages": [
         "English",
         "日本語",
         "",
         ""
      ],
      "releaseDate": "1996-09-09",
      "dvdReleaseDate": null,
      "directors": ["Gregor Nicholas"],
      "runtime": 92,
      "movieId": 1519,
      "title": "Broken English",
      "mpaa": null,
      "actors": [
         "Rade Serbedzija",
         "Aleksandra Vujcic",
         "Julian Arahanga",
         "Marton Csokas"
      ],
      "imdbMovieId": "0115760",
      "originalTitle": "Broken English",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ivan is the fierce patriarch of a family of Croatian refugees in Auckland. Nina is his daughter, ready to live on her own, despite his angry objections. Eddie is the Maori she takes as her lover. Nina works at a restaurant where Eddie cooks. For a price, she agrees to marry a Chinese, another restaurant employee, so that he (and his Chinese wife) can establish permanent residency. The money gives her the independence she needs to leave her parents' house and move in with Eddie. Complications arise when Eddie realizes the depth of her father's fury and the strength of Nina's family ties.",
      "tmdbMovieId": 124680,
      "avgRating": 3.28125,
      "releaseYear": "1996",
      "numRatings": 128,
      "posterPath": "/5RjC7mxdE7trBEWA6vQxdktbRut.jpg"
   }
}