{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "philosophy",
            "id": 490
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "violence",
            "id": 14819
         }
      ],
      "imdb_id": "tt0112288",
      "video": false,
      "title": "The Addiction",
      "recommendations": [
         21612,
         25690,
         42848,
         27636,
         22307,
         26503,
         87710,
         55066,
         29437,
         90949,
         204761,
         47212,
         44562,
         28498,
         39261,
         169644,
         42707,
         37936,
         19094,
         56529
      ],
      "backdrop_path": "/wXJAMyI543CdRGcmqpCCaV0dNzz.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "58319cf392514162cf024411",
         "content": "Even for an arthouse vampire film, it's pretentious, and that's quite an achievement. Existentialism abounds but substance (no pun intended) does not.\r\n\r\nGood for audio sampling though.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._\r\n",
         "url": "https://www.themoviedb.org/review/58319cf392514162cf024411"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kathleen Conklin",
               "gender": 1,
               "credit_id": "52fe45889251416c91035a23",
               "name": "Lili Taylor",
               "profile_path": "/pIJ4Enx6kIC9srLkDfGpEzfNlDZ.jpg",
               "id": 3127,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Peina",
               "gender": 2,
               "credit_id": "52fe45889251416c91035a27",
               "name": "Christopher Walken",
               "profile_path": "/ApgDL7nudR9T2GpjCG4vESgymO2.jpg",
               "id": 4690,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Casanova",
               "gender": 1,
               "credit_id": "52fe45889251416c91035a2b",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jean",
               "gender": 1,
               "credit_id": "52fe45889251416c91035a2f",
               "name": "Edie Falco",
               "profile_path": "/3cPF1o5oag20UXtCYkZeCTtcTFx.jpg",
               "id": 36190,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Missionary",
               "gender": 2,
               "credit_id": "52fe45889251416c91035a33",
               "name": "Michael Imperioli",
               "profile_path": "/3AupsGJOUaAiXXaq626wzKaLiZ8.jpg",
               "id": 11486,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Professor",
               "gender": 2,
               "credit_id": "5778fba292514152ef00064f",
               "name": "Paul Calderon",
               "profile_path": "/2v8spXfKtaMbFZ25FrVsV0SAPwW.jpg",
               "id": 3137,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45889251416c91035a39",
               "name": "Abel Ferrara",
               "profile_path": "/spMsMgsJs8qwhLXgQO9VGNm9Rcn.jpg",
               "id": 39104,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45889251416c91035a3f",
               "name": "Nicholas St. John",
               "profile_path": null,
               "id": 59113,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45889251416c91035a45",
               "name": "Ken Kelsch",
               "profile_path": "/uOYnWQFm5bdXQPafDsh8YVUZQew.jpg",
               "id": 45535,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45889251416c91035a4b",
               "name": "Mayin Lo",
               "profile_path": null,
               "id": 35144,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "598c6495c3a36873bd00faa6",
               "name": "Fernando Sulichin",
               "profile_path": "/ar6EopE5P0rULjYKkzyd6sDKuCK.jpg",
               "id": 71332,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "598c64a89251410801011442",
               "name": "Denis Hann",
               "profile_path": null,
               "id": 1867336,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "598c64b592514108150119a3",
               "name": "Joe Delia",
               "profile_path": null,
               "id": 39107,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 2.857341,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34996,
      "vote_count": 58,
      "budget": 0,
      "overview": "A vampiric doctoral student tries to follow the philosophy of a nocturnal comrade and control her thirst for blood.",
      "similar": [
         9538,
         341006,
         9373,
         10781,
         588,
         769,
         4771,
         339692,
         381288,
         301846,
         74997,
         429733,
         12662,
         434873,
         49950,
         134350,
         10185,
         8649,
         294963,
         396940
      ],
      "original_title": "The Addiction",
      "runtime": 82,
      "poster_path": "/ej0gD547grj5QMoKuzqKyHuc3Xi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "October Films",
            "id": 236,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fastnet Films",
            "id": 5353,
            "origin_country": "IE"
         },
         {
            "logo_path": null,
            "name": "Guild",
            "id": 1214,
            "origin_country": ""
         }
      ],
      "release_date": "1995-01-10",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The dark is their sunlight. What makes them different is what keeps them alive.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Abel Ferrara"],
      "runtime": 82,
      "synopsis": "New York University. Walking home after viewing a disturbing lecture documenting atrocities from the Vietnam War, doctoral candidate Kathy Conklin (Lili Taylor) is singled out to receive a vampire's 'kiss'. However, Casanova (Annabella Sciorra) is an atypical vampire in that she gives Kathy a chance to save herself by simply saying \"Go away\" like she means it. But Kathy can only mutter, \"Please,\" so she ends up in the infirmary with a bite on her neck and a policeman telling her she's lucky her assailant didn't slit her throat. \"One aspect of determinism is manifested in the fact that the unsaved don't recognize the sin in their lives.\" Kathy starts to feel ill during one of her lectures, and rushes to the lavatory where she vomits blood. She winds up back in the infirmary where the attending physician diagnoses \"chronic anemia exacerbated by this traumatic event.\" The next day she meets her friend Jean (Edie Falco) for lunch but merely picks at her food and feels ill watching Jean scarf down a hamburger. \"The old adage from Santayana, that those who don't learn from history are doomed to repeat it, is a lie. There is no history. Everything we are is eternally with us.\" Kathy has begun covering her mirrors in her apartment, and wearing sunglasses to class to protect her eyes from the sun. Her hunger for blood starting to grow, she uses a syringe to extract blood from the arm of a sleeping homeless man, but it doesn't help. She makes arrangements to meet with her advising professor to show him what she's done so far on her dissertation, which is nothing. They wind up back at her apartment, where he becomes a victim. The next day, while in the university library, Kathy invites an anthropology student to her apartment to study and have coffee. The student becomes a victim when she doesn't say, \"Get out of here.\" \"All men counting stars are equivalent in every way to God.\" [Feuerbach] Kathy's appetite for blood is becoming insatiable. She feeds on a young black guy looking for some \"white tail\". Kathy even corners her friend Jean in the ladies room at a local bar, challenging her to \"look sin in the eye and tell me to go,\" but all Jean can do is blubber, \"Please,\" so Kathy makes another victim of Jean. \"Mankind has striven to exist beyond good and evil from the beginning.\" [Nietzsche] Now, rapidly descending deep into her addiction, Kathy tails a possible victim whose first words to her are, \"Why don't you just tell me to leave you alone...like you mean it.\" He turns out to be Peina (Christopher Walken), a old vampire who invites Kathy to his loft. Peina tells Kathy that he has been \"fasting\" for four years and has learned to live without blood through the strength of his will. Peina tries to advise Kathy on living as a vampire without having to give in to the addiction. \"The point is to blend in,\" he says, \"not to stand out like a sore thumb.\" He then proceeds to feed on Kathy. Suffering from the pangs of her addiction, Kathy attempts to slit her wrist, but \"you can't kill what's already dead,\" says Peina. She begs him to help her, but he refuses. Instead, he tells her to read the book The Naked Lunch. \"I felt the wind...the wings of madness.\" [Baudelaire] Kathy weathers it through the day but gives in to the pangs that night. She walks the streets, stumbling along, holding her stomach and looking for a \"fix.\" When a passerby sees her lying on the sidewalk, he offers help, but she leaps at his neck like a hungry cat. Claiming that she now understands what all this is about, Kathy begins to work again on her dissertation. \"Our addiction is evil,\" she writes. The propensity for this evil lies in our weakness before it. Kierkegaard was right. There IS an awful precipice before us. But he was wrong about the leap. There's a difference between jumping and being pushed. You reach a point where you are forced to face your own needs. And the fact that you can't terminate your situation settles on you with full force. There is a dual nature to the addiction. It satisfies the hunger, but it also dulls our perception so we're helped to forget how ill we really are. We drink to escape the fact that we're alcoholics. Existence is the search for relief from our habit, and our habit is the only relief we can find.\" To celebrate the completion of her dissertation and attainment of her Ph.D., Kathy decides to invite the dean, her professors, and some of her friends to a party at her apartment. On her way home, Kathy meets a prostelytizer who hands her a pamphlet. She invites him to come inside, but he refuses, the only one who has refused to let 'sin' in. As her hunger grows again, Kathy rolls on the floor in agony, screaming repeatedly, \"I will not submit!\" But submit she finally does when, as the guests start arriving, she asks Jean, now a vampire herself, to bring her a girl on which to feed. Feeling satiated, Kathy attends her party and, after a short speech during which she thanks the faculty and offers to share with everyone what she has learned during her years of study, she leaps at the dean's neck. Thereafter begins an horrific orgy in which Kathy and her vampire friends feast on the humans. After drinking her fill and then some, Kathy begins to feel ill and, like a sick drunk, wanders the streets, talking to herself, covered with blood, and barfing on the sidewalk. She winds up in the hospital again. In an attempt to end her existence, she asks the nurse to open the blinds. As the sunshine slowly descends over Kathy's body, the blinds are suddenly closed and Casanova is standing there. \"We're not evil because of the evil we do,\" Casanova says. \"We do evil because we ARE evil.\" \"Bleeding trees waiting for Judgement Day when we can all hang ourselves from our own branches.\" [Dante] A priest stops by to visit and Kathy begs for absolution. He does and she apparently passes on. In the very confusing final scene, Kathy places a rose on her own grave in broad daylight and walks away, having repented her bloodlust and is reborn as human flesh once again. \"In the end, we stand before the light and our true nature is revealed. Self-revelation is annhilation of self.\" [Kathy Conklin] Original Synopsis by bj_kuehl.",
      "writers": ["Nicholas St. John"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112288/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2MjA5MTk3OV5BMl5BanBnXkFtZTcwMDc2ODkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lili Taylor, Christopher Walken, Annabella Sciorra | See full cast and crew »"],
      "reviews": [
         "Abel Ferrara's moody, allegorical vampire tale makes fascinating and pointed statements on sin and redemption, spirituality and the nature of good (there's precious little of it) and evil (no one is safe from it). And unfortunately, but not surprisingly, it was relatively ignored in America. Lili Taylor gives a brooding, glib and haunting central performance as Kathleen Conklin, a New York University grad student who is pulled into an alley and bitten by a seductive female vampire (Annabella Sciorra), from which she emerges uncontrollably drawn into a world of violence and insatiable cravings for human blood. Ferrara's irredeemable urban hell landscape is more immediate and frightening than a million Transylvanias and by contrasting Taylor's \"addiction\" to the horrors of the past (war atrocities, the Holocaust) and present (heroine, AIDS), the film has more bite and impact than any fang-bearing, gore or special effects could even attempt to muster up. Nicolas St. John's intriguing philosophical screenplay and Ken Kelsch's gorgeous black and white photography (creating a world solely of light and dark, which is a key element in the plot), are not to be overlooked either. Call it pretentious for the philosophy references (Sarte, Nietzche...) if you want, but this highly intelligent and disturbing low-budgeter is one of the most accomplished and well-thought out horror films I've ever seen. Don't let over-hyped, attention hogging Hollywood productions like BRAM STOKER'S Dracula or INTERVIEW WITH A VAMPIRE keep you from seeing it.",
         "'The Addiction' is one of the most original vampire movies ever made. In fact, I can't think of another one quite like it. Abel Ferrara has made some strange and disturbing movies in his time, and this one is as strange and disturbing as any. Lili Taylor ('I Shot Andy Warhol') is brilliant as a troubled, soul searching philosophy student who has an unexpected and life-changing encounter with a mysterious stranger ('Cop Land's Annabella Sciorra). Dark, deep, sometimes blackly humorous, and frequently too obscure for its own good, this can be heavy going at times, but is never less than interesting. Christopher Walken, who did some superb work for Ferrara in his classic 'The King Of New York', has only a cameo here, but what a cameo! Walken is terrific and unforgettable. The rest of the supporting cast includes 'The Sopranos' Edie Falco and (briefly) Michael Imperioli, Paul Calderon ('Girlfight'), and Kathryn Erbe ('Stir Of Echoes'). This is a unique movie that will be appreciated by those with an open mind and preference for \"difficult\" viewing. Recommended.",
         "This movie was even scarier for me since I spent 2/3 of my life in New York City and all the settings were in my family's neighborhood! The acting was first rate, as was the storyline and cinematography, but all the philosophical dissertations annoyed the HELL out of me because it reminded me of some of the intellectual snobs I went to school with who had lower IQ's than my cat. Upon reading the previous review, it just occurred to me that all the snobbery made perfect sense. The character was probably in shock for several weeks. In HER mind, a vampire wouldn't resist his or her impulses they would just become feral. As such, to her, this constant internal dialogue of trying to figure out whether or not her addictions are psychological or supernatural somehow proves her normalcy (at least in her universe). Christopher Walken was GENIUS and so convincing that I never EVER want to meet him in person! His explanation of his adaptation to his vampirism made it seem so normal (it REALLY felt like he was giving the audience a confession under the guise of acting) that you got the sense that he WASN'T acting! I have to say that the graduation scene is one of the single most disturbing things that I have ever seen in my life! I saw it coming, but never really acknowledged before seeing this, that horror movies are realistic because all the writers/directors have to do is open up the local newspaper to see what a real monster is!",
         "Sublime, intriguing vampire flic from the very weird mind of Abel Ferrara, the man who brought the world The King of New York, Driller Killer, and Nine Lives of a Wet Pussy. This moody, stylish, esoteric treatise mixes vampires, drug addiction, and Kierkegaard. A bit too talky for some, and more than a little pretentious, The Addiction nonetheless delivers some very disturbing imagery and beautiful b/w cinematography. For those who prefer their vamps with more of a philosophical..bite. Lili Taylor is wonderful as the bookworm innocent drawn into a world of hopeless addiction and bloodletting. But Ferrara's night children are not Anne Rice's brooding, romantic loners - they are as brutal and savage as any street addict, jonesing for another fix. Christopher Walken provides yet another classy cameo, this time as a ray of vampire hope, showing Taylor's character that the addiction can be controlled, that humanity, while not restored, can be at least mimicked. This moovie will not be for all...tastes, but the MooCow says show it to yer artsy-fartsy friends & watch them recoil. :=8)",
         "In the sister film to the Funeral philosophy student Kathleen Conklin is dragged into an alley and bitten by Casanova and left to bleed. Despite hospital care she begins to change and have strange desires. With her desires controlling her turns to Peina for help. A sister film in that both film share a crew, a writer and some of the cast. The genres are very different but the themes are the same \u0096 religion and redemption. The vampire thing isn't played like it usually is \u0096 stakes through the heart etc, these are mentioned but not laboured. Instead the story is about the origins of sin and the extent it controls us and how we can be redeemed. It cleverly uses the vampire myth as an allegory for wider human evil \u0096 `We are not sinners because we sin, we sin because we are sinners. We aren't evil because we do evil, we do evil because we are evil'. At times it gets a little heavy \u0096 the ending in particular takes some interpretation and the message can be easily misunderstood. However ignoring the message this also stands up as a great vampire film \u0096 the party which turns into a massacre is as good (if not better) then the nightclub opening of Blade, and much more meaningful to boot. Ferrara is a master director who has never followed the money to blockbusters \u0096 here he is in total control of his themes and the film rarely loses focus. His clever use of music is also good \u0096 a blend of all styles. The theme song feels like it's going to be a 1980's romantic comedy, but this blends straight into hip-hop and others to create a mix that never feels strange \u0096 in fact a baseline seems to run under the whole film like a heartbeat. Lili Taylor is on top form as Conklin and commands attention the whole time. Walken and Sciorra are both good but have less screen time than in the Funeral, however here, as there, they have key lines of dialogue that carry tremendous weight. Sopranos co-stars Falco and Imperioli are both good but are no more than bit players. The real stars are Ferrara and writer Nicolas St John, who wrote this and The Funeral after the death of his son. Overall this is a great film that serves up more for thought than for action. To this end it won't please those expecting a Blade style vampire film but to fans of Ferrara used to his themes this will be very enjoyable.",
         "I haven't seen THE ADDICTION in ten years, but I do recommend it from what I remember. And the list of attractive concepts are, envelope please: Lili Taylor, Christopher Walken, Anabella Sciorra, black and white meta-fictional film, and of course vampires galore! Abel Ferrara has directed other well known movies such as Bad Lieutenant, California, and the Funeral. Of these movies, I mildly recommend the first two but definitely not the third. The Funeral is plain boring and dreary, while the other two entertain by showing the gritty side of human nature. Caution, if you're the type of vampire fan who must have each actor decked out in fangs and yellow contacts, then steer clear of this movie, since it's really questionable whether the characters in THE ADDICTION are actually vampires or are just plain junkies in nice clothes. Lastly, there is a very complex philosophical feel to THE ADDICTION, as Lili Taylor muses about life and death in deep conversations in different venues around New York City: a college book store, movie theater, etc. I recommend any philosopher out there to grab THE ADDICTION off the shelves as soon as possible. Speaking of the mid-90's, that short-lived era was a golden age for indie actors like Lili Taylor and Parker Posey. Taylor got a taste of vampire-hood early on in this movie, and fortunately for us, and for the committee, Posey got her fangs in Blade 3, which I was very happy to see happen. I mean, come on, all those party girls are really vampires at heart. JY Jimboduck-dot-com",
         "I found this movie to be such an accurate reflection of the way society functions. Vampirism could easily be seen as an economic transaction, in the way we feed off one another (i.e., we rob each other of blood/money, both of which are needed to survive). From a Marxist perspective, we can see that capitalism is economic and social barbarism. For so many reasons, I cannot stop recommending this movie to everybody I know. Dialogue, cinematography, cast choice, lighting, set/setting, I cannot think of one factor that was left to chance. Stimulate your brain and see this movie NOW!",
         "I loved this film. I was an NYU grad student and the process of getting my doctorate and writing the dissertation and dealing with the committee were perfectly captured by all the aspects of the vampire's experience and transformation. The hunger she felt was so accurate. I recall those days of struggle and grad student doubts about ever finishing and feeling as if no one would appreciate what I had written. The writers captured all that perfectly in the scenes of her trying to write and focus, all while something else was pulling on her and transforming her. The film itself was well acted and the emotional atmosphere was captured perfectly. The street scenes incorporated the neighborhood beautifully, especially in the way people in the village actually live there. It was a dark wonderful film and I have recommended it to many people, especially those currently in grad school, writing their dissertations. I hope it is released on DVD soon. I keep looking.",
         "SPOILER ALERT Am I the only one who \"got\" this film? I don't usually enjoy movies shot in black and white, nor \"artsy fartsy\" movies, but this one really had something to say of great significance (stated explicitly in the final words of the film), and it was also entertaining (at least I found it to be). I don't agree with the general reviewer's attitude toward the holocaust scenes. The central message of the film does NOT deny reality to suffering, but explicitly acknowledges it (the fact that the holocaust was \"real\" and vampires are \"not real\" is entirely beside the point). Suffering IS real, and is the common thread linking the vampire/addict and the holocaust victim. Has anyone else noticed that the central philosophy of the movie is not nihilism, but nondualism? How the endless cycle of pain/pleasure (also known as \"addiction\") controls all of us to one extent or another, and how all pleasure takes place against a background of pain -- an endless cycle of suffering for most of humanity? The film also examines the notion of \"free will\" in detail, and ultimately concludes that \"my will against yours\" is the cause of much \"evil.\" Nondualism concludes that \"free will\" is an oxymoron, and denies reality to the concept of personal volition. This movie reaches much the same conclusion. Ultimately, the main character's spiritual redemption at the end of the movie demonstrates nondualism, not nihilism (a nihilistic ending would be the suicide or death of the main character in a particular violent fashion). Yet she is redeemed, and realizes that annihilation of \"self\" (the ego, will, conflict, separation, addiction, the cause of suffering) is the only true path of redemption. This is a spiritual, non-dual message. If anyone who hasn't heard of the perspective of nondualism is curious, try your favorite search engine and searching on \"nonduality\" and/or \"advaita.\" Rating: 9/10",
         "It's not about vampires, it is about resistance, or lack of it. About what may be right around the corner, about discipline, or about lack of discipline. About being in the wrong place at the wrong time. It can happen to anybody, and it happens to everybody. It's a pyramid scheme. Beautiful black and white composition by Abel Ferrara tied tightly in a wonderfully creative Joe Delia score. Casting the usual Ferrara/indie suspects: Paul Calderone, Edie Falco, Kathryn Erbe, Lili Taylor, Annabella Sciorra. The theme of the movie presents 4 new questions for every one it answers. Do we have a choice? Can we resist? And just when we think we have it all figured out, Christopher Walken has to show up and throw an entirely new lilt on things. Such is life."
      ],
      "genres": [
         "Horror",
         "Drama"
      ],
      "productionCompanies": [
         "Fast Films",
         "Guild",
         "October Films"
      ],
      "summaries": [
         "Kathleen Conklin, a doctoral student in philosophy, finds herself with a new perspective on the nature of evil and humanity after being bitten by a vampire in New York City....",
         "Kathleen Conklin was just a normal student attending college. While walking home one night she is dragged off the street and bitten by a strange woman. Soon Kathleen goes from being a normal student to being a vampire. Kathleen's need for blood is similar to a drug addict's need for drugs, and we watch as she goes from one fix to the next.",
         "A New York philosophy grad student turns into a vampire after getting bitten by one, and then tries to come to terms with her new lifestyle and frequent craving for human blood."
      ],
      "budget": 0
   },
   "movielensId": 152,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-10",
      "dvdReleaseDate": null,
      "directors": ["Abel Ferrara"],
      "runtime": 82,
      "movieId": 152,
      "title": "The Addiction",
      "mpaa": "R",
      "actors": [
         "Lili Taylor",
         "Christopher Walken",
         "Annabella Sciorra",
         "Edie Falco",
         "Michael Imperioli",
         "Paul Calderon"
      ],
      "imdbMovieId": "0112288",
      "originalTitle": "The Addiction",
      "genres": [
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": ["0wgIIsXz-Vk"],
      "plotSummary": "A vampiric doctoral student tries to follow the philosophy of a nocturnal comrade and control her thirst for blood.",
      "tmdbMovieId": 34996,
      "avgRating": 3.09703,
      "releaseYear": "1995",
      "numRatings": 706,
      "posterPath": "/ej0gD547grj5QMoKuzqKyHuc3Xi.jpg"
   }
}