{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0117482",
      "video": false,
      "title": "Ripe",
      "recommendations": [51363],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Violet",
               "gender": 1,
               "credit_id": "52fe4ab6c3a368484e162f4b",
               "name": "Monica Keena",
               "profile_path": "/f4dD2ohtjJZweo6nbvu38OpSsCO.jpg",
               "id": 18315,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rosie",
               "gender": 1,
               "credit_id": "52fe4ab6c3a368484e162f4f",
               "name": "Daisy Eagan",
               "profile_path": "/5c5d8t5ZWBvmtAuDnA6VRXQMTDp.jpg",
               "id": 204122,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Pete",
               "gender": 2,
               "credit_id": "5548dda392514155fd00235b",
               "name": "Gordon Currie",
               "profile_path": "/h06Vpwv0XHCogV4xULwNBVXN6dI.jpg",
               "id": 51539,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ken",
               "gender": 2,
               "credit_id": "5548ddb0c3a368788c0020c3",
               "name": "Ron Brice",
               "profile_path": "/zVPzpQ5eh4RtLdqyEDjqBFO8SMq.jpg",
               "id": 75602,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Janet Wyman",
               "gender": 1,
               "credit_id": "5548ddbe92514156090023db",
               "name": "Karen Lynn Gorney",
               "profile_path": "/bRBDTVAqJASn38LVDrBKVMZawIu.jpg",
               "id": 67787,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ab6c3a368484e162f47",
               "name": "Mo Ogrodnik",
               "profile_path": null,
               "id": 974866,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5548dd9592514155fd002358",
               "name": "Mo Ogrodnik",
               "profile_path": null,
               "id": 974866,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "595494bc9251412ac70498ec",
               "name": "Anton Sanko",
               "profile_path": null,
               "id": 1181479,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "595494c79251411dbd0283bc",
               "name": "Wolfgang Held",
               "profile_path": "/jkbEpBOJfNXLUcvLshwAaKpqUmm.jpg",
               "id": 1099440,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "595494d4c3a368382e02b1ae",
               "name": "Sarah Durham",
               "profile_path": null,
               "id": 1841037,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "595494dcc3a36809c60495fa",
               "name": "Eve Battaglia",
               "profile_path": null,
               "id": 7438,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "595494e49251412b2304741a",
               "name": "Sally Rowe",
               "profile_path": null,
               "id": 556891,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "595494ea9251412b31049e4e",
               "name": "Hannah Moseley",
               "profile_path": null,
               "id": 1337394,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "595494f19251412ac7049923",
               "name": "Janie Bryant",
               "profile_path": null,
               "id": 1522041,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.720661,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 124843,
      "vote_count": 6,
      "budget": 0,
      "overview": "When their abusive parents are killed in a car crash, twin sisters Rosie and Violet vow to run away to Kentucky in search of a better life. While on the road, the girls meet up with Pete, a drifter working as a grounds keeper on a derelict army base, who takes them in. While Violet falls for him, Rosie becomes increasingly angry and hostile, and the sisters' childhood bond is eventually destroyed forever.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         112160,
         858,
         141,
         634,
         242224,
         376867,
         394117,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Ripe",
      "runtime": 92,
      "poster_path": "/mzjRWVmEIpMLEBhDgDuKXPuHBjE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Virgin Wood Productions",
            "id": 52741,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "C&P Productions",
            "id": 3989,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-10",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "No one stays innocent forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mo Ogrodnik"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Mo Ogrodnik"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117482/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODkwMjAwMDkyN15BMl5BanBnXkFtZTcwNDYxMjEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Monica Keena, Daisy Eagan, Gordon Currie | See full cast and crew »"],
      "reviews": [
         "C'mon people! Give the director a break. This film ain't so bad. In fact, I think it is one of the better coming-of-age films I've seen. Despite some areas of imperfection, are the technicalities that important? Who cares if some pieces of the plot are questionable...the performances are heartfelt and strong. I was especially impressed with Daisy Eagan's performance as Rosie, the bitter and rejected twin of Violet, played by Monica Keena. After their parents die in an accident, Rosie and Violet head to Kentucky, where they plan to start over. On the way, they hitch a ride to an army base where they meet Pete (Gordon Currie), a loner who is living on the base. He eventually decides to let them live with him temporarily while they work on the base to earn money for their trip. Throughout the film, Rosie and Violet become progressively more detached from one another, physically and emotionally. Violet, the prettier and more sexually aggressive of the two, develops a crush on Pete, while her sister discovers a fascination with guns after meeting Ken (Ron Brice), an army official working on the base. When Rosie discovers that Violet has lost her virginity to Pete, she becomes dangerously jealous. She sees Pete as a threat to the bond that she and Violet share as sisters and devises a plan to get rid of him. The ending will shock and amaze you. It is by far one of the most devastating conclusions although it is genuinely real. This film is an excellent examination of how bonds between siblings are corrupted by the natural and inevitable events that shape sexual maturity.",
         "as the director says, coming of age movies are so laced with sweetness and lace that you would think puberty for girls was a picnic (not verbatim)...this movie shows the confusion and frustration that young girls go through when dealing with the fact they may look, act, and be able to feel older, but in actuality are still just little girls. Its a classic case of wrong time, wrong place for them. The men in this movie, are evil just from being opportunistic to the girls. While the movie is intense in several parts, I think the fact the girls are actually in the right age groups as the characters really throws me for a loop. Casting them was daring and edgy, and about time to do something like that... nobody is right in this film, nobody wins, and everyone loses something... Q",
         "This film, alternately side-splittingly funny and stunningly bizarre,is destined to become a cult classic. It's difficult to decide if the filmmakers were wanting to make a seriocomic social commentary or just indulging a penchant for the outlandish. Either way, this is a movie that must truly be seen to be believed. After two viewings I can't really say whether I like it or dislike it, but I can certainly recommend it to viewers as a film unlike any other. Besides, if it airs on The IFC, it's got have something going for it, right?",
         "There's no rule that says that true events necessarily seem real on screen. It's actually probably more difficult to make a realistic fictional film than to translate a tragic, but true, event to film. Mo Ogrodnik experiences this problem with his first fictional film, 1996's Ripe. Based on an apparently true story of two fourteen year old girls who survive a car crash which kills their parents, Ripe is ostensibly about the bond between sisters and their different ways of dealing with the onset of adolescence. Both physically mature, the two girls run away from the accident and find residence at a military base, where they find a home with a long-haired biker. Out of tragedy comes further tragedy. As evidenced by the film's poster (featuring Monica Keena's nymphet Violet biting into an apple), Ogrodnik, who got his start making documentaries, seems to think he has a provocative story of innocence lost and a fall from grace. The problem is that what he really has is a connection of completely unmotivated actions featuring a string of characters who are completely without depth. Keena's Violet is becoming interested in sex. Daisy Eagen's Rose is becoming interested in Violence. And Peter, the man who takes them in, is basically just there. He has no past and no dialogue to give any sense at all of who he is. I guess the film has a nice look. Wolfgang Held's cinematography calls to mind the empty spaces and spare setting of Badlands, a slightly similar kinda-true story of innocence and violence. But the style is to service of nothing. The plot can't move because everything that happens either seems unbearably tacky (every scene involving the soldiers at the base is like a bad copy of every basic training movie ever made, from Biloxi Blues to Full Metal Jacket). Keena (whose recurring role on Dawson's Creek marks the only time you would have ever seen any member of the cast) and Eagan give decent performances, but it's tough to get involved with the characters' internal lives because of the paucity of closeups. As Peter, Gordon Currie is fairly awful. He's given nothing to do and yet he still comes of only as shrill. He seems neither sympathetic, nor creepy and probably the film would like him to be one or the other. Basically he's a cypher. Ripe is only marginally provocative and it produces no real emotion. As studies of young sexuality it's inferior to the underrated Adrian Lynne Lolita. And as a story of young girls made old before their time it pales in comparison to Manny and Lo. I guess I'd probably give it a 3.5 outta 10 because I've certainly seen worse films, but I sure can't think of much to recommend it.",
         "This is one of a rarity of movies, where instead of a bowl of popcorn one should watch it with a bottle of vodka. To be completely honest we are a group of people who actually know the man, Mo Ogrodnik, and decided to drink ourselves stupid to this film. The cinematic aspect of Wolfgang Something's photography seems to have left out both close-ups and breasts. Mo and Wolfgang's collaborative effort revealed the passion of the two actresses, plastic peens holding passion. There's also beetle banging. As Violet would have put it: \"This (plastic peen) goes up your butt\". The rat porn and subsequent rat smashing is awesome. Alright. So if you are still reading, let us explain who we are. Mo Ogrodnik teaches at NYU and we are a group of her students, who, finishing a film class with her, decided to get poop- faced and watch here directorial debut. She also wrote Uptown Girls. I can't tell you how much that's been hammered into our skulls. So this movie is quite the experience. At the very bottom of this post will be a drinking game we created for this movie. About 13 minutes into this game, none of us could see straight. The sheer amount of Dido's in the first thirty minutes created enough reasons to drink to pacify an elephant.There was something secretly pleasurable about seeing two underage girls hit on a Kurt Cobain lookalike with absolutely no context, save for his mysterious scene at the convenience store where he was oh-so-naturally reading a local newspaper. Because that's what we all do. The heart-shaped glasses were delightfully derivative of Lolita. And something about that provocative scene of the nude chin-up boy suggests the director's history of homosexual pornographic experiments. We wish we were kidding. Enough intellectual contemplation. ON TO THE DRINKING GAME! This will ensure that the viewing experience is a positive one. It's very simple, and very likely to send at least one member of your party to immediate care. The Mo Ogrodnik/Ripe Drinking Game: 1. Every time you see anything related to pornography, take a drink. 2. Every time you see auteur Mo Ogrodnik's name appear, take a drink. 3. Sex. 4. (plastic peen) require two drinks. 5. Any time somebody points a gun at another character, take a drink. -At this point you will probably need to refill/pee pee any remaining sobriety from your body.- 6. Any time there is blood (INCLUDING \"LADY BLOOD\"), please take a sip! 7. The underused hula-hoop girl requires one drink per second. 8. Gratuitous use of the \"magic black man\" requires one drink. 9. If you can't figure out the through-line, KEEP DRINKING, Beyotch. 10. Whenever you are able to predict a line, take a drink. Trust us. It's easy. That's it, internet! Keep drinking, and try not to get riped. -Hawaiian Smirnoff Punch, Jr.",
         "I have watched this film several times, it never fails to creep me out. The film explores the lives of two pubescent girls who have never experienced a normal life. As the father of two grown daughters, I squirm at the film's brief glimpses into their demented home life. If the parents had not been killed in a car crash, their children may well have turned on them. For reasons left unexplained, the two girls determine to leave their unidentified home state for Kentucky; after surviving a car crash that kills their parents. The two girls are fraternal twins, and could hardly be more different. Rosie is the more aggressive and intelligent of the twins. She is filled with rage at her dead father and that rage is going to find an outlet when some man offends her. Violet is the more passive and naive of the two girls. She is more advanced into puberty than her sister and is really vulnerable to the first man who will treat her better than her abusive father. When the two girls stow away in the back of a pickup truck, they land in the home of an itinerant grounds keeper on an Army Post. The film was probably using an abandoned Army Post for these location shots. No operational Army Post would become so decrepit if the commanding officer hoped to have a successful career. The supposedly authentic military vehicles were really a hoot to see. I doubt that many of them would even run. The film soldiers on this Post are really homo erotic in their behavior. I suppose this tendency would pass muster in Hollywood, but never in the real Army. There is only one officer on this post and only one mid-level NCO. The budget limitations on this film really showed in the lack of anything resembling a real command structure. The two girls set up what passes for housekeeping in their limited experience. They sleep in their undies on sofa cushions on the living room floor of the shack that serves as living quarters for the grounds keeper. It took no mental giant to see that eventually the grounds keeper would wind up sleeping with one or both of these vulnerable young girls. The two girls start to drift apart when their environment is no longer as hostile as their horrible home life. Violet starts to make friends with the grounds keeper she works with daily. He is obviously responding emotionally to her feminine charms and that is very appealing to her developing sexuality. Rosie is enraged with both the grounds keeper and her sister as the formerly united front breaks down. The plot has the two girls attending a dance as supposed dates for the grounds keeper. They somehow came up with dresses that could pass muster for this event despite having been out on the road without anything more than the clothes on their backs. Obviously, some shopping never shown in the film would have been necessary to outfit the twins. Well, the film ends as Rosie maneuvers the grounds keeper into a vulnerable situation where she can murder him. Violet reacts by breaking the last bond with her sister and skipping out with the money stolen from the dead grounds keeper. My skin crawled as the abandoned Rosie hums a little tune as she plays Russian Roulette with the revolver she used to kill the grounds keeper. I suppose that I wanted to see the twins recover from their damaged childhood and live worthwhile lives. The eventual fate of Violet is left a blank. Rosie most likely commits suicide. Sadly, that happens in real life. This film really got to me despite its production flaws and limited budget. I really was yelling for Rosie to put down the gun as the film credits started rolling. This film would not be a wise choice for young children for obvious reasons.",
         "Ripe is a story about two 14-year-old sisters who, in their immature view of the world, strike out for Kentucky because they think for some reason it's a beautiful place where life is easy. On their way, they get sidetracked and decide to stay a while at a derelict army base that bears no resemblance to any base I have ever seen. There is no security and no discipline. The girls live with a long-haired guy whose job, it seems, is to run errands for the base. The best part of this film is the acting by the two lead actresses. Unfortunately the characters they play have no redeeming features (nor does any other character). They are thieves with a penchant for violence. The writer/director makes it clear in the first scenes that violence is a part of their natures. Their only allegiance is to each other, and that allegiance is at risk as they grow up and they discover an outside world. The main problem with the film is the writing. The film does not have a viewpoint, it just seems to record happenings, which are often bizarre. Whenever one of the two main characters has an opportunity to learn something, the story thwarts that possibility--unless you think that learning to shoot a gun is a significant learning experience. I found the film emotionally flat and disappointingly pointless.",
         "This movie did attempt to capture the naive idealism that many young teenaged girls have for fun, friendship, escape, danger, sex, maturity, etc. The problem was that it failed to establish these things on every single level; which is why it failed to build a decent story around them. I couldn't follow the point of any part of this story, nor any reason why I should care. This movie is not an exploration into pedophilia at all. It's basically about a girl being in love with her sister, and her sister being in love with the idea of \"men\". While the latter tries out her love of men, the former tries to win her sister back by \"getting even\". The plot is weak, the characters are weak, and the reality of it all was similar to an amateur porn filmmaker (without the sexual substance).",
         "Thinly-cloaked retelling of the Garden-of-Eden story -- nothing new, nothing shocking, although I feel that that is what the filmmakers were going for. The idea is trite. Strong performance from Daisy Eagan, that's about it. I believed she was 13, and I was interested in her character. The rest left me cold.",
         "\"Ripe\" is one of those awful indies which manages to get into circulation and give indies a bad name. Telling a stupidly incongruous tale of pubescent twin sisters who crawl from a firey car crash which kills their parents and then hit the road while happily shoplifting, making goo-goo eyes at some guy, and ending up on an Army post so dilapidated no Army would want it (yeah, right!). An apparent attempt at a coming of age flick, \"Ripe\" is an almost complete loser which wanders aimlessly as the players drift in and out of character finally ending clumsily with nary a shred of credibility to be found anywhere. Not recommended for anyone."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "C&P Productions",
         "Virgin Wood Productions"
      ],
      "summaries": ["When their abusive parents are killed in a car crash, twin sisters Rosie and Violet vow to run away to Kentucky in search of a better life. While on the road, the girls meet up with Pete, a drifter working as a grounds keeper on a derelict army base, who takes them in. While Violet falls for him, Rosie becomes increasingly angry and hostile, and the sisters' childhood bond is eventually destroyed forever."],
      "budget": 0
   },
   "movielensId": 1522,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-10",
      "dvdReleaseDate": "2005-04-05",
      "directors": ["Mo Ogrodnik"],
      "runtime": 92,
      "movieId": 1522,
      "title": "Ripe",
      "mpaa": null,
      "actors": [
         "Monica Keena",
         "Daisy Eagan",
         "Gordon Currie",
         "Ron Brice",
         "Karen Lynn Gorney"
      ],
      "imdbMovieId": "0117482",
      "originalTitle": "Ripe",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["EyvCKIqRqFU"],
      "plotSummary": "When their abusive parents are killed in a car crash, twin sisters Rosie and Violet vow to run away to Kentucky in search of a better life. While on the road, the girls meet up with Pete, a drifter working as a grounds keeper on a derelict army base, who takes them in. While Violet falls for him, Rosie becomes increasingly angry and hostile, and the sisters' childhood bond is eventually destroyed forever.",
      "tmdbMovieId": 124843,
      "avgRating": 2.675,
      "releaseYear": "1996",
      "numRatings": 40,
      "posterPath": "/mzjRWVmEIpMLEBhDgDuKXPuHBjE.jpg"
   }
}