{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "new mexico",
            "id": 1508
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "maniac",
            "id": 14805
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "criminal",
            "id": 15009
         },
         {
            "name": "on the road",
            "id": 15291
         }
      ],
      "imdb_id": "tt0120383",
      "video": false,
      "title": "Truth or Consequences, N.M.",
      "recommendations": [
         55249,
         7513,
         62001,
         24231,
         15414,
         31037,
         40862,
         43249,
         34477,
         250622,
         36775,
         45169,
         2036,
         87293,
         50477,
         122930,
         283749,
         35284,
         15320,
         55922
      ],
      "backdrop_path": "/wZDRjLMqFVLF9rbGr1Bvnj7WgDX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Raymond Lembecke",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d265",
               "name": "Vincent Gallo",
               "profile_path": "/tkWaZr3WmLm2SxeXymlbYSfRaZW.jpg",
               "id": 22461,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Curtis Freley",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d269",
               "name": "Kiefer Sutherland",
               "profile_path": "/4YvDfOfD4TgyzDkLGoq76g5BZNe.jpg",
               "id": 2628,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d26d",
               "name": "Max Perlich",
               "profile_path": "/baFBjA3vKNqZCbXrJepVweeLj3d.jpg",
               "id": 7268,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tony Vago",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d271",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Eddie Grillo",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d275",
               "name": "John C. McGinley",
               "profile_path": "/6AJL0ylRtJ9vcR57yEenhWHXHFt.jpg",
               "id": 11885,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sir",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d279",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gordon",
               "gender": 2,
               "credit_id": "5303b61692514121a762d1ad",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marcus",
               "gender": 2,
               "credit_id": "5303b65a92514121956214f0",
               "name": "Mykelti Williamson",
               "profile_path": "/8TTxzpuvvpw2tB8xZBCDslYupNU.jpg",
               "id": 34,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Addy",
               "gender": 1,
               "credit_id": "5303b66b92514121a762d671",
               "name": "Kim Dickens",
               "profile_path": "/yIXBljS46WXvRk2gma3ravVBBgU.jpg",
               "id": 21165,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44569251416c9100d27f",
               "name": "Kiefer Sutherland",
               "profile_path": "/4YvDfOfD4TgyzDkLGoq76g5BZNe.jpg",
               "id": 2628,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546b98b6c3a368513a00037f",
               "name": "Brad Mirman",
               "profile_path": null,
               "id": 22007,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.16304,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31017,
      "vote_count": 17,
      "budget": 0,
      "overview": "Raymond Lembecke (Vincent Gallo) is a con just out of prison after serving time for selling drugs for his mob boss Tony Vago (Rod Steiger). (Lembecke was innocent and took the rap for Vago.) Lembecke thinks Vago owes him big time so, when his former boss gets him a measly job in a warehouse, he decides on revenge and plans to steal a million dollars worth of drugs from him.",
      "similar": [
         4771,
         339692,
         507,
         281,
         10651,
         23397,
         2749,
         6075,
         979,
         769,
         1538,
         1572,
         59967,
         562,
         395990,
         868,
         8067,
         4997,
         984,
         429200
      ],
      "original_title": "Truth or Consequences, N.M.",
      "runtime": 106,
      "poster_path": "/lIxSz6X5esmCYw2OJw76r6OI2Cv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Triumph Films",
            "id": 23098,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Higgins-Messick-Wayne",
            "id": 38782,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ink Slinger Productions",
            "id": 38783,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Life's harsh. Why behave?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kiefer Sutherland"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Brad Mirman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120383/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0OTQxMTM2Ml5BMl5BanBnXkFtZTcwMTMyNDIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Kiefer Sutherland, Kim Dickens, Vincent Gallo | See full cast and crew »"],
      "reviews": [
         "Another heist-gone-wrong movie. It's been done before - criminals are cool etc. However this is still pretty good and thrilling all the way through. It is rarely slow or dull. All the actors are good with Gallo really bringing his character to life and making you feel for him. Sutherland does a good job of directing and even plays the crazy killer well. The film evens tackles the issue of us viewing these people as cool - not something many do - and challenges us on our admiration of them (even if it is on a basic level). Yes, you seen it before - but that doesn't mean it's totally unoriginal or not entertaining to watch.",
         "Bonnie and Clyde. Now there was a classic. That movie was as much a classic as a cult movie as a ground-breaker. Over the years, we have seen many different \"versions\" of this movie, the best one probably being Thelma & Louise (1991). But after seeing Truth Or Consequences, N.M., I'd say this is the movie that resembles the most this masterpiece. Donald Sutherland. Now there is a great actor. Probably one of the best living actors in today's movie industry. His small roles in A Time To Kill (1996) and JFK (1991) are just as mesmerising as his big roles like in The Assignment (1997). If you were to ask me \"Who do you think will be the next Donald Sutherland?\", I would have to say \"No one\". But after seeing Truth Or Consequences, N.M., I'd say Kiefer Sutherland could become as great an actor as his father is. As for a great director, well, that doesn't seem to be a problem in Hollywood right for many young directors are developing themselves into great ones and many of the older great directors are still around and while not necessarily becoming one of the greatest directors in the industry, Kiefer Sutherland seems to have as much of an acting talent as of a directing talent. The movie's story seems very simple and in a way it is. A drug deal gone awry leaves about six dead people including five cops and four young people on the run from the law. But as the movie develops, so does the story. Hostages, undercover cop, drug lords, pregnancy, the Mob, and life on the road all mix together into this delightful mixture of love and guns. In 1967's Bonnie & Clyde, Warren Beatty was a criminal at the beginning of the movie and always wanted to rob and unfortunately killed people. In 1991's Thelma & Louise, the two women had gone on a vacation with no intention to become criminals but unfortunately were dragged into that world by a murder involving a would-be rapist. In Truth Or Consequences, N.M., only Kiefer Sutherland's character starts off as a crazy maniac with the intention of killing people and this is why this movie differs from the two others. What lead these people to be criminals is an internal action, an action caused by Kiefer Sutehrland's character, an action that could have been avoided contrarily to those of Bonnie & Clyde and Thelma & Louise. Equally good in the movie are Vincent Gallo and Mykelti Williamson. Gallo plays the head of the gang, a man with a conscience who has no desire in killing people and whose only goal is to go down to Mexico with his girlfriend (Kim Dickens)and get married. Williamson has the hardest role of the movie as an undercover drug enforcement agent and must change the way he acts and talks in presence of Vincent Gallo, Kiefer Sutherland, and Kim Dickens. The cast also includes two very small roles, one for Rod Steiger and the other for Martin Sheen who are both in top shape. But the movie belongs to the four young people on the run who act out the movie to perfection.",
         "Neat little thriller about a group of ex cons who while ripping off a drug dealer accidentally kill an undercover cop, forcing them to take to the road. They head for Las Vegas to sell the stolen drugs taking along with them a couple as hostages as they are pursued by both the cops, and the drug dealers associates, who are not best pleased with what they have done. The film moves at a reasonable pace and the acting is good, especially from leads, Gallo, Williamson and an evil Kiefer Sutherland, who clearly enjoys his role as the psychotic Curtis. It's just a shame that the plot seems to run out of steam for the last 20 or so minutes but it does come together again for an exciting finale. Well worth checking out. Sutherland also directed.",
         "Much-maligned Keifer Sutherland's career has taken a relative nose-dive since the heady days of his Brat-pack success in Lost Boys and Young Guns. But, here he proves to be a surprise hit behind the camera, co-starring in and directing this well paced and exciting outlaw drama. Brad Mirman's plot keeps the action moving, presents twists at every corner and establishes engaging characters. The real key is both Sutherland's own frenetic performance, his directing style and the chemistry between Kim Dickens and the superb Vincent Gallo. A rare treat, with characters you can root for from the very start. Has a great little soundtrack too!",
         "Not a bad effort from Kiefer Sutherland on his directorial debut. This little crime caper is fairly derivative of recent Tarantino films, with the discussion of the quarter looking somewhat out of place, Tarantino could have pulled something like that off with snappier dialogue but it just didn't work. Overall though it's a nice little film with some decent action and some cool lines and a nice black convertible car though as is often the case with these little crime capers the ending is pretty weak and predictable. Vincent Gallo put in another decent performance as did Kim Dickens, who you can see more of in a better film that this, The Zero Effect. Also of note was the incredibly pretty Grace Phillips as Donna, she puts in a good performance as the shocked wife of Raymond. The idea of Raymond sympathising/envying the criminals was an interesting one, though I found the transformation to be less than credible. Overall this was a nice action film and you can do a lot worse.",
         "Decided to gamble on this unknown movie after it was recieving so much praise from my Video Shop members, and its great. I'm quite suprised it didn't get a cinema release.. Hopefully after the success of Kiefer Sutherlands \"24\" it might gain some more recognition from fans of the series. I doubt they will be dissapointed as this is a classy action/thriller with first class acting and a perfect soundtrack.. Highly recommended",
         "I love American road movies. such cool. I enjoyed the scenes of the coin and what they said about the coin granting all knowing. And at end before he die he gets it and only sees his own death. wonderful done! I have come to see a lot of movies from new Mexico, united states. many i enjoy that are like this. the crime, the drama, the violence is like a beautiful death for all the characters. I was not sad from the death of all the characters. The writing is good and you root for the \"villians\" not the police. though it is tragic, the film was shot very beautifully. I think anyone who likes violent movies would enjoy this movie. Sutherlund is very scary as a villain character.",
         "This was a pretty violent movie with good actors. I liked it. Lots of action and good characters. This is an action movie based on its characters. Kiefer Sutherland plays a trigger happy, Vincent Gallo plays a sensitive and careful criminal who has a girlfriend that is pregnant. The end of the movie is very intense with the dirge and everything.....Whoa!! This is an awesome film. Watch it!!! I give it 84%.",
         "Although derivitative of Tarantino and especially of Carl Franklin's \"One False Move,\" Kiefer Sutherland's directorial debut is quite self-assured. Kevin Pollak's character as a hostage who is strangely drawn to the lifestyle of his captors is terrific despite his formulaic \"coming-around\" at the end. Mykelti Williamson and Grace Phillips as Pollak's girlfriend are both revelations. Vincent Gallo is an unusual actor and definitely an acquired taste, but he works well here with Kim Dickens as his Bonnie. In all, a film you'll be pleasantly surprised with as a bargain rental.",
         "As the film starts out, you see a prison and its horrible conditions and you wonder why anyone decides this is a good place to serve time in for 20 or 50 long years and more! A convict is being released and you can see he is very happy to have served his time and a nice sexy girlfriend is waiting outside the prison walls in a nice car to pick him up and hopefully start a new and better way of life. This convict no sooner gets out jail and he meets up with Kiefer Sutherland, (Curtis Freley), who is a very wild and Soul lacking human being who will stop at nothing to put your Lights Out for GOOD ! The entire picture takes you from one car to another car and they also hold a guy and his girl hostage and take them all over the country and of course, they are heading for New Mexico. Great film, with good acting and entertaining from beginning to end."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Higgins-Messick-Wayne",
         "Ink Slinger Productions",
         "Triumph Films"
      ],
      "summaries": [
         "A drug deal goes wrong causing a foursome, led by a lunatic killer, to go on the run. A couple in a recreational vehicle are initially kidnapped, but soon the male hostage is emulating his kidnappers and wants to stay involved in the chase.",
         "Raymond Lembecke, who was just freed from prison, meets his girlfriend Addy again and plans a robbery of a drug dealer together with Marcus and Curtis. Everything goes awfully wrong and they run out of the city, kidnapping middle-class couple Gordon and Donna in the process. They come to a small New Mexico town, where they try to give the stolen drugs to powerful mob boss Tony Vago and live in the house of former Raymond's cellmate Wayne.",
         "Former inmate Raymond Lembecke has just been released from prison, and, having after met up with his girlfriend, Abby, plans a drug sale to the mafia boss, Tony Vaago, in which they have no idea the drugs belonged to him. After the steal goes wrong, they find themselves fleeing authorities en route to Vaago to make the sale. When they are informed of their situation, the sale goes horribly wrong and they are once again forced to flee, eventually winding up in the middle of a remote New Mexico town, Raymond's brothers house.",
         "A group of crooks, an ex con, his friend and a gun crazy gangster plan a drug heist, but not everything goes as planned."
      ],
      "budget": 0
   },
   "movielensId": 1523,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "1998-07-29",
      "directors": ["Kiefer Sutherland"],
      "runtime": 106,
      "movieId": 1523,
      "title": "Truth or Consequences, N.M.",
      "mpaa": "",
      "actors": [
         "Vincent Gallo",
         "Kiefer Sutherland",
         "Max Perlich",
         "Rod Steiger",
         "John C. McGinley",
         "Martin Sheen",
         "Kevin Pollak",
         "Mykelti Williamson",
         "Kim Dickens"
      ],
      "imdbMovieId": "0120383",
      "originalTitle": "Truth or Consequences, N.M.",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["2gxjyajlMKU"],
      "plotSummary": "Raymond Lembecke (Vincent Gallo) is a con just out of prison after serving time for selling drugs for his mob boss Tony Vago (Rod Steiger). (Lembecke was innocent and took the rap for Vago.) Lembecke thinks Vago owes him big time so, when his former boss gets him a measly job in a warehouse, he decides on revenge and plans to steal a million dollars worth of drugs from him.",
      "tmdbMovieId": 31017,
      "avgRating": 2.86376,
      "releaseYear": "1997",
      "numRatings": 367,
      "posterPath": "/lIxSz6X5esmCYw2OJw76r6OI2Cv.jpg"
   }
}