{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "mythology",
            "id": 2035
         },
         {
            "name": "chinese food",
            "id": 163607
         },
         {
            "name": "kangaroo",
            "id": 208662
         }
      ],
      "imdb_id": "tt0120479",
      "video": false,
      "title": "Warriors of Virtue",
      "recommendations": [
         27345,
         397931,
         136984,
         99754,
         279756,
         134237,
         43079,
         3288,
         118430,
         33657,
         102059,
         231082,
         77291,
         11955,
         25697,
         80346,
         116158,
         195796,
         18553,
         20551
      ],
      "backdrop_path": "/rZmoZs4sUagFgIip0HwTZpNJaiY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Komodo",
               "gender": 2,
               "credit_id": "546a21d422136e284f00159f",
               "name": "Angus Macfadyen",
               "profile_path": "/qTplz89WHXM4dGu0PVSarWEYHcO.jpg",
               "id": 2464,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ryan Jeffers",
               "gender": 2,
               "credit_id": "546a21e022136e68c9003cc1",
               "name": "Mario Yedidia",
               "profile_path": null,
               "id": 533016,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Elysia",
               "gender": 1,
               "credit_id": "546a21eceaeb816b4f0036ba",
               "name": "Marley Shelton",
               "profile_path": "/n3XgupzMwQfX7YyTjolsnbhIIyV.jpg",
               "id": 6407,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Master Chung (as Chao-Li Chi)",
               "gender": 2,
               "credit_id": "546a2200eaeb816b580036c5",
               "name": "Chao Li Chi",
               "profile_path": "/5lZxwvy3PXREMu9m1arB9Z3o9Sk.jpg",
               "id": 995587,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Yun",
               "gender": 2,
               "credit_id": "5aa029f19251415815015dce",
               "name": "Jack Tate",
               "profile_path": null,
               "id": 1219513,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Yee",
               "gender": 2,
               "credit_id": "5aa029fe0e0a2632770118c4",
               "name": "Doug Jones",
               "profile_path": "/rpvvWATYWHGjedJea0G97XufOwU.jpg",
               "id": 17005,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "546a21b122136e68cf0038e6",
               "name": "Ronny Yu",
               "profile_path": "/uOCTwD8l6WDvo1kMAEvnF5pBnAH.jpg",
               "id": 17268,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546a21ba22136e68d8003448",
               "name": "Michael Vickerman",
               "profile_path": null,
               "id": 150953,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "546a21c5eaeb816b4b003781",
               "name": "Hugh Kelley",
               "profile_path": null,
               "id": 1173667,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54b40da39251416fe1005ce6",
               "name": "Richard Trus",
               "profile_path": null,
               "id": 1410526,
               "department": "Visual Effects",
               "job": "Visual Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 3.278975,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 49478,
      "vote_count": 13,
      "budget": 0,
      "overview": "A young man, Ryan, suffering from a disability, wishes to join the other kids from his schools football team. During an initiation rite, Ryan is swept away through a whirlpool to the land of Tao. There he is hunted by the evil Lord Komodo, who desires the boy as a key to enter the real world. Ryan is rescued by the protectors of Tao, five humanoid kangaroos, each embued with the five elements and virtues. Ryan learns his valuable lesson while saving the land of Tao.",
      "similar": [
         18823,
         57165,
         10323,
         205584,
         34584,
         32657,
         620,
         297762,
         10637,
         22881,
         9291,
         652,
         293767,
         4942,
         9276,
         321741,
         9563,
         37404,
         13416,
         13680
      ],
      "original_title": "Warriors of Virtue",
      "runtime": 103,
      "poster_path": "/8fT8cttGyXx36P24W0tum2QxsLf.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "China Film Co-Production Corporation",
            "id": 2269,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Law Brothers Entertainment",
            "id": 38662,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "IJL Creations",
            "id": 38663,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-05-02",
      "vote_average": 4.6,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Warriors of Virtue Collection",
         "id": 174407,
         "poster_path": null
      },
      "tagline": "In a world beyond your imagination a battle for the universe has begun.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ronny Yu"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Michael Vickerman",
         "Hugh Kelley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120479/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzOTg4MzM5MV5BMl5BanBnXkFtZTcwNzIwNTc3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Angus Macfadyen, Mario Yedidia, Marley Shelton | See full cast and crew »"],
      "reviews": [
         "This movie was actually very good for what it was trying to do, which is give a summary (very simply) of the VERY esoteric chinese philosophy of Taoism. Those who know nothing of Taoism will definitely find that this movie does not make much sense in some places. All of the characters are embodiments of the virtues and faults presented in the Taoist Philosophy. Yes, this makes for quite the challenge to present it in childrens movie no less. The movie is fun if you dont take it to seriously. It would seem that some of the people posting here thought they were there to see Gone With the Wind or some other Epic or adult piece. Take it as lighthearted and as a possible education on a foreign way of thought, if you are into that new things. (Then again you could just read books on Taoism to get a somewhat clearer view) 3 out of 5 for production, 4 out 5 for accomplishment",
         "I read all the comments about this movie, and I started to watch this movie with low expectations, everyone was saying that this movie sucks. But then at half the movie, I realized that the suckers were the ones writting the reviews. Let me tell you that at the end of the movie I wished that it had not one but several sequels with the same quality in general. The producers really created something imaginative, the director just rocks with this movie, the acting is real good. This movie is way up there, and even better in some aspects, with Matrix and Blade, the story even though it is not truly original in itself, it delivers the goods. The action and martial arts, and the conveyance of the feelings and emotions, is for all ages not just for kids. Do not believe the fools that say this movie is awful. Please watch this movie if you want to see something spectacular and emotive. This movie deserves a double ten out of nine!!.",
         "Warriors of Virtue is a rather strange movie, but I find it a great bore. While the idea of martial art marsupials seems goofy and stupid, but at least it would be entertaining. This movie, however, seems to have a consistency of dragging dialogues, confusing setups, and poor delivery. It takes forever for the action to start up, and when it does, the cinematography is unnecessary and often hard to make out. The very idea of the movie may sound silly, it had promise to at least be ridiculously entertaining, but the slow route it takes and the basic \"nothingness\" it envelopes kind of makes it not so much a good movie. However, the one thing that always brought me back to this film was the villain. The acting in the villain's case is just so over-the-top and enjoyably hilarious that he makes the film worth watching. Give him props because he was starred in other movies like \"Titus.\"",
         "This film is one of those forgotten 90s rip-offs from the Ninja Turtle fall out. It's easy to forget how insane the turtle craze was but it is also easy to forget that the original TMNT movie was actually pretty decent. Most of it's sequels and copies were not. Which brings us to this little gem... It's a film so bad it's good. The fight scenes are sloe-mo with wind-blown leaves for no reason other than effect. The warriors of virtue are kangaroos with martial art skills, they personify the virtues eg patience....and it's fight to the death between good and evil. All told it's a great movie for kids that the adults can enjoy while pretending to be too old for it.",
         "I absolutely adore this movie! It's a wonderful family film, it has a great storyline, and the fight sequences aren't all that bad. The only bad thing is when they slow the camera down slightly for effect (and that's not even terrible in itself). The characters are lovable, there are several quite funny parts, and it leaves you with a warm feeling in your heart. Warriors of Virtue is a masterpiece. PS - in case anyone didn't know, the poster at the top of the page is not the poster for this Warriors of Virtue movie. That's the poster for the other version, from either Japan or China (can't remember). The actual poster has Mario Yedidia on it. You can find it on Google :)",
         "Well, as one of the other users pointed out, this movie is in fact based on the Taoist philosophy, which is somewhat religious. It uses most of the 8 virtues, as listed in ancient Chinese philosophy, which many people still value. For people who are unaware of all this, especially those who care little for virtues and vices, I can see why this movie seemed so bad. However, I do not think it is anywhere near the worst/cheesiest movie of all time. I personally enjoyed it immensely when I saw it as a child and later as a teenager. Why are people being so harsh? Do they not appreciate the concept of peer pressure and the triumph of good over evil. Well to be more precise, the movie revealed bad people as having good in them, which I think is important for everyone to remember. People today are so very self-cantered and unforgiving and in this light, I believe this movie is more than just a kid's movie or action-flick and as such, deserves more credit than it is currently getting.",
         "Alright, I admit going in that I was predisposed to dislike this movie. I have studied Taoism for many years, and I guess I don't take kindly to it being reduced down to a 90 minute family friendly event. Although it came highly recommended to me, I was put off by it's kid friendly approach to something as complex as Eastern Philosophy. Through out the film, I could not shake the vision I had of a Roos vs Turtles sequel. Although not as bad as I feared, this film looks for all the world like it was edited by a Cuisinart. The over extended climatic fight scene had so many different editing styles present that it nearly gave me an epileptic fit. Either that, or my digital TV is on the blink. I really cannot recommend this film to anybody except possible a few hard core gamers who would get off on the cartoon-like action sequences.",
         "After I saw this film I had mixed feelings about it. The film has a good production design and some very well done fight scenes. On the other hand it has a lousy script. As soon as anybody opens his his mouth you start to cry and beg him/her to shut it immediately because it is really annoying to hear the same old cliches over and over again. It seems that the entire budget was invested in fight scenes etc. and the pitiful rest into the story and/or the actors. I give this film 5 out of 10.",
         "First of all, yes it seemed to be one of the knock off attempts, of Teenage Mutant Ninja Turtles, but The Warriors of Virtue was not the first to take from TMNT, anyone remember Street Sharks? Also I seen other reviews all over the web mention clichés...... what kids action movie does not have cliché lines? It comes with the territory. Yes it gives a lot of reference to Taoist (Daoist) philosophy, that could be confusing to a foreign ethnicity and youth. Yet, would you rather them give a detailed account of the Tao belief system or just reference? How much reference was made to Asian martial arts philosophy in TMNT? The script was lacking, but the scenery, costumes, martial arts, cinematography and ideology of the film carried the story where the script failed. Not many children's movies with bad scripting can come close. It is obvious where the money went, when you actually look at the action scenes, costume and set design. Imagine how many \"roo\" costume repairs and adjustments were made because of the action scenes. So lets take a closer look at the screenplay writers, shall we? Michael Vickerman and Hugh Kelley, both of them never wrote a screenplay before Warriors of Virtue and none of the films they are known for on IMDb have ratings that even go above 6.0 and most are below a 5.0, the lowest being Michael Vickerman's The Wicked with a 3.7/10. I think that may answer the issues with the script. So I give it a 9, I would give a ten had the script not been written by inexperienced and dull writers, who still have not improved much, with very little under their belt even today, 17 years later.",
         "People this show is for kids, your taking it to seriously. I use to beg my dad to rent this movie on VHS when is was like 6 or 8 and now I'm 20 and still love the movie as well as the books. Yes there is a book to this movie, and if you're the type of person that likes to read books based off a film or just likes fantasy, I'd suggest it. I understand the movie better now that I see some of the thoughts and reasoning behind the characters actions. Also, there are scenes from the book that are cut or shortened in the movie that should not have been. It would have helped the viewers understand it better. Anyways... I just recently got my 10 year old cousin with autism and my younger sister who is 8 to watch it.... and guess what. THEY BOTH LOVED IT! This show is great for younger kids because for one there is not any gore. The fight scenes are pretty amazing considering the time and budgit. And the villain can make you laugh at how insane he is! Plus, it's your typical good vs. evil story where the good guys win. If you're an adult you won't like the movie (maybe some do, myself included), the dialogue is corny, the movie comes across as rushed, the plot is predictable, and there will be parts in the movie where you will be like \"What the heck?!\" But the point is that this is a good movie for children and not a movie that adults should expect to be blow away by. I give this movie a solid 8."
      ],
      "genres": [
         "Action",
         "Fantasy",
         "Adventure"
      ],
      "productionCompanies": [
         "China Film Co-Production Corporation",
         "IJL Creations",
         "Law Brothers Entertainment"
      ],
      "summaries": [
         "A young man, Ryan, suffering from a disability, wishes to join the other kids from his schools football team. During an initiation rite, Ryan is swept away through a whirlpool to the land of Tao. There he is hunted by the evil Lord Komodo, who desires the boy as a key to enter the real world. Ryan is rescued by the protectors of Tao, five humanoid kangaroos, each embued with the five elements and virtues. Ryan learns his valuable lesson while saving the land of Tao.",
         "A young boy is whisked away to the mythical land of Tao where he becomes the center of a conflict between an evil lord and a group of animal warriors."
      ],
      "budget": 35000000
   },
   "movielensId": 1525,
   "movielens": {
      "languages": [
         "English",
         "普通话"
      ],
      "releaseDate": "1997-05-02",
      "dvdReleaseDate": "1999-01-19",
      "directors": ["Ronny Yu"],
      "runtime": 103,
      "movieId": 1525,
      "title": "Warriors of Virtue",
      "mpaa": "",
      "actors": [
         "Angus Macfadyen",
         "Mario Yedidia",
         "Marley Shelton",
         "Chao Li Chi"
      ],
      "imdbMovieId": "0120479",
      "originalTitle": "Warriors of Virtue",
      "genres": [
         "Fantasy",
         "Family",
         "Action"
      ],
      "youtubeTrailerIds": ["-4STNypFBh0"],
      "plotSummary": "A young man, Ryan, suffering from a disability, wishes to join the other kids from his schools football team. During an initiation rite, Ryan is swept away through a whirlpool to the land of Tao. There he is hunted by the evil Lord Komodo, who desires the boy as a key to enter the real world. Ryan is rescued by the protectors of Tao, five humanoid kangaroos, each embued with the five elements and virtues. Ryan learns his valuable lesson while saving the land of Tao.",
      "tmdbMovieId": 49478,
      "avgRating": 2.45125,
      "releaseYear": "1997",
      "numRatings": 359,
      "posterPath": "/8fT8cttGyXx36P24W0tum2QxsLf.jpg"
   }
}