{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0058985",
      "video": false,
      "title": "Le Bonheur",
      "recommendations": [
         47903,
         170368,
         61703,
         131349,
         46982,
         5562,
         127835,
         82088,
         290482,
         95269,
         112882,
         53408,
         130052,
         84782,
         79240,
         148168,
         115596,
         122524,
         47717,
         114626
      ],
      "backdrop_path": "/2dcJkjGLkahYa4q57RUdVnOaFx4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "François Chevalier",
               "gender": 2,
               "credit_id": "52fe484ec3a36847f8160d8f",
               "name": "Jean-Claude Drouot",
               "profile_path": "/uJwzqL4yiJin8ZxUoWekicPecca.jpg",
               "id": 28150,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Thérèse Chevalier",
               "gender": 0,
               "credit_id": "52fe484ec3a36847f8160d93",
               "name": "Claire Drouot",
               "profile_path": null,
               "id": 147065,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Pierrot Chevalier",
               "gender": 0,
               "credit_id": "52fe484ec3a36847f8160d97",
               "name": "Olivier Drouot",
               "profile_path": null,
               "id": 147066,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Gisou Chevalier",
               "gender": 0,
               "credit_id": "52fe484fc3a36847f8160d9b",
               "name": "Sandrine Drouot",
               "profile_path": null,
               "id": 147067,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Émilie Savignard",
               "gender": 1,
               "credit_id": "52fe484fc3a36847f8160d9f",
               "name": "Marie-France Boyer",
               "profile_path": "/otZvndW4StOGRRR3dfdSr29LJBy.jpg",
               "id": 147068,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "56916b86c3a36802e80007aa",
               "name": "Marcelle Faure-Bertin",
               "profile_path": null,
               "id": 1560808,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "56916b8b92514179ac000791",
               "name": "Manon Lanclos",
               "profile_path": null,
               "id": 1560809,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "56916b9292514179b30007b7",
               "name": "Sylvia Saurel",
               "profile_path": "/77yk9X2SPKrNZFhzKnSXlAldpkY.jpg",
               "id": 28187,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Le frère de François",
               "gender": 2,
               "credit_id": "56916b9bc3a36802f60007f1",
               "name": "Marc Eyraud",
               "profile_path": "/k2YgUKecKmtofsfr5qkeuUaCFCP.jpg",
               "id": 37140,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "56916ba192514179a0000982",
               "name": "Christian Riehl",
               "profile_path": null,
               "id": 1560810,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Paul",
               "gender": 0,
               "credit_id": "56916bab92514179a600080a",
               "name": "Paul Vecchiali",
               "profile_path": "/iLhbAGMBFzNGGRqEdwns2rlUi3V.jpg",
               "id": 236535,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe484ec3a36847f8160d85",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe484ec3a36847f8160d8b",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56916acac3a36802e800078d",
               "name": "Mag Bodard",
               "profile_path": "/bvmRx2TJbwXOLvFma1ywT7LCwZS.jpg",
               "id": 26013,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56916ad4c3a36802e20006f1",
               "name": "Jean-Michel Defaye",
               "profile_path": null,
               "id": 24664,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "56916addc3a36802f60007dc",
               "name": "Claude Beausoleil",
               "profile_path": null,
               "id": 1435919,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56916ae592514179b00007f3",
               "name": "Jean Rabier",
               "profile_path": "/29EbAiWCdqcvhjpcaNZZ93fF2mO.jpg",
               "id": 19086,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56916aed925141799e000742",
               "name": "Janine Verneau",
               "profile_path": null,
               "id": 1334440,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56916af9c3a36802e20006f9",
               "name": "Hubert Monloup",
               "profile_path": null,
               "id": 1560804,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "56916b0cc3a36802f60007e4",
               "name": "Claude François",
               "profile_path": null,
               "id": 1560805,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56916b14c3a36802f90007ac",
               "name": "Serge Groffe",
               "profile_path": null,
               "id": 1362254,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "56916b20c3a36802e800079e",
               "name": "Philippe Dussart",
               "profile_path": "/7N3xoLRfaBpG14REQ4ZEqyBC19l.jpg",
               "id": 1052402,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56916b30c3a36802e4000737",
               "name": "Michel Choquet",
               "profile_path": null,
               "id": 10353,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56916b3a92514179ac00077c",
               "name": "Jean-Paul Savignac",
               "profile_path": null,
               "id": 1052527,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56916b4492514179ac000781",
               "name": "Joseph Gerhard",
               "profile_path": null,
               "id": 1560807,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "56916b4e92514179b0000800",
               "name": "Charles Merangel",
               "profile_path": null,
               "id": 26184,
               "department": "Art",
               "job": "Set Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.553787,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 53023,
      "vote_count": 23,
      "budget": 0,
      "overview": "Though married to the good-natured, beautiful Thérèse, young husband and father François finds himself falling unquestioningly into an affair with an attractive postal worker.",
      "similar": [
         11421,
         376660,
         112160,
         376867,
         244772,
         258480,
         36040,
         43923,
         12793,
         45153,
         27586,
         8272,
         8967,
         598,
         773,
         858,
         14,
         11216,
         141,
         634
      ],
      "original_title": "Le Bonheur",
      "runtime": 79,
      "poster_path": "/6yyyGlWRol5ashRUpfNqXuS4BX8.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Parc Film",
         "id": 14680,
         "origin_country": ""
      }],
      "release_date": "1965-02-10",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Only a woman could dare to make this film",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Agnès Varda"],
      "runtime": 79,
      "synopsis": null,
      "writers": ["Agnès Varda"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0058985/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNDEyMDI4OV5BMl5BanBnXkFtZTYwMzY5MTc5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jean-Claude Drouot, Claire Drouot, Olivier Drouot | See full cast and crew »"],
      "reviews": [
         "At first sight, Le Bonheur seems just a conventional film, with everything being too perfect. Each single frame is a beautiful picture in composition and color. We see a happily married couple, with charming and beautiful children, nice family picnics in the country, the sublime music of Wolfgang Amadeus Mozart in two of his most beautiful pieces (Adagio and Fugue in C minor and the Clarinet Quintet). Happiness (Bonheur) and harmony is everywhere. But then the husband meets another woman, very different from his wife, falls in love with her, and proposes a thesis: for him, happiness is not a subtractive affair - it all adds up. After being in love with his new lover, he manages to love his wife and children even more. Love, happiness, harmony should never be too much, Agnès Varda seems to say. But is it possible? Or, better: do people make it possible? Shouldn't it be possible? That's why this apparently bourgeois film is, in fact, revolutionary. It proposes a new vision on certain matters that is, ultimately, extremely subversive. And it does so in a most contrasting environment. That said, it has some of the most gorgeous images in film to look at. The use of colour is amazing. And, exactly for being so beautiful, the conclusion is so shocking. In short: one of the most important films in History, one of the most subversive, and certainly one of the most beautiful. We can only say: thank you, Agnès Varda, for making it. Hope people will understand it better, in the future, and grasp the challenge you have cast.",
         "\"It all adds up\", says Francois to his mistress Emilie, explaining why he can love her and his wife Therese and his children equally. In her brilliant and provocative 1965 film, Le Bonheur, Agnes Varda (The Gleaners and I, Vagabond, Cleo From 5 to 7), raises the question of whether \"open marriage\" can work and answers it with a definite \"maybe\". As the film opens, a carpenter, Francois (Jean-Claude Drouot), and his young (real-life) family are experiencing a Sunday afternoon picnic in the park. Shot in pastels and making use of exquisite color fades, Ms. Varda immerses us in the flowers, trees, and lakes of the French countryside. We are lulled by Mozart's languid Clarinet Quintet, yet soon sense that something is amiss. Communication appears superficial and few feelings are expressed. This mood carries over to the scene in their apartment complex where, in a family gathering that includes aunts and uncles, not much happens in the way of conversation. When Francois is away on business, he meets an attractive telephone operator named Emilie. Soon he declares his love for her and claims that he has enough love within him to include her in his life, \"I love you both and if I met you first, you would be my wife\". Being honest and open, Francois tells Therese that he has loved another woman for over a month, but says that his love for her and his family remains stronger than ever. The love that Francois experiences is - the film states again and again - a natural occurrence, an addition, not a subtraction. However, Therese cannot separate herself from what has become her identity as wife and mother, leading to tragic consequences. She was, in the words of the lovely song, \"Tree of Life\", \"only known as someone's mother, someone's daughter, or someone's wife.\" At the end of the film, Mozart's Clarinet Quintet is replaced by the darker Adagio and Fugue in C Minor. Francois replaces one woman with another and continues his life without reflection, guilt, or self-doubt. In Le Bonheur, the characters are painfully pure and do not question their actions. Perhaps Ms.Varda is saying that, for Francois, happiness is seamless, that it will continue regardless, and that, in his world, people are simply viewed as interchangeable parts. In Varda's words, happiness is \"a beautiful fruit that tastes of cruelty\". Agnès Varda's has said, \"In my films, I always wanted to make people see deeply. I don't want to show things, but to give people the desire to see\". One of the seminal works of the French New Wave, Le Bonheur was audacious in its day and still leaves us unsettled, 37 years later, yet able to see more deeply.",
         "François leads an idyllic life full of happiness. He loves his wife and their young children; he enjoys his work as a carpenter; and the country town where he lives is awash with sunshine and smiling faces. So when he meets a pretty girl working at the post office, what could be more natural and right than to take a further sip from the bowl of happiness? Le Bonheur is a delicious sugar-coated bonbon with a bitter centre. What disturbs the viewer most is the cool unjudging gaze of Varda's camera: the characters are naive but not cruel, and when tragedy strikes it comes about from a childlike pursuit of happiness. Then the seasons change, and life continues with no-one wiser than before... The emphatic pastel colour palette of the film, and the music of Mozart that plays insistently throughout, are beautiful and cloyingly seductive. They entice us into the innocent fantasy world of François, where all it takes to do the right thing is to follow your desires. What could possibly go wrong? Le Bonheur is an exquisite, delicate, ambiguous masterpiece of the type that Hollywood was, is and always will be incapable of producing.",
         "After the shimmering brilliance of her last film, CLEO DE 5 A 7, Agnes Varda's LE BONHEUR is a big disappointment. This time she abandons rich sympathy with her characters in favour of an almost Bressonian detachment and schematism, and a fable-like drive. True, her previous films have had these qualities, but they were infused with the emotional warmth of her protagonists. Fluid camerawork which freed space is replaced by a rigid framing and colour coordination that fixes characters. Still, the film has a rare, if sickly, beauty, and a deeply troubling climax which leaves you not wanting to believe what you've just seen. The story concerns a carpenter, the provocatively named Francois (the film's fades to red are at one point disrupted by a fade to blue, white and red) with a beautiful wife, Therese, and two children, who go on weekend outings to the country. They seem obsessively happy and content, but one day he meets a telephonist, Emilie, who is about to move into his neighbourhood. They begin an affair, although he insists that he is still passionate about his wife, and that the affair is a conduit for his overflowing happiness. So taken is he with this theory, that he decides to share it with his wife, expecting her approval. He does not get the response he expected. The ending is so shocking, I think, because of the idyllic happiness (the film's translation) that has preceded it. In fact, its monotony and repetitiveness made the joy oppressive, and Varda takes care from the beginning to undermine it with artifice, not least by overlaying it with one of Mozart's most melancholy late works. The opening sequence suggests an Eden, as the family loll in perfect happiness in the woods. But in her filming of it, there is none of the Romantic empathy with nature of the Archers (see A CANTERBURY TALE) or King Vidor. One remarkable pan, which blurs the background like a Rorschach test (itself a foretelling of mental collapse), and foregrounds two ominous branches a la Franju (LES YEUX SANS VISAGE), disturbs the paradise for the viewer, as does the lack of communication in the family, the fact that Francois is asleep (is the film his dream?). A relationship based on mere feeling, without communication, can only lead to rupture and misunderstanding. This opening sequence is cut off from any kind of social or economic reality, such is its dreamlike beauty, so it's a jolt when the family leave for the suburban tower blocks (with an artifice and curious symmetrical beauty of their own). Here the artifice of the earlier scene is compounded by the garden Francois's brother tends, a mini-forest in itself. However, there is no communication here either, as the only personality in the room belongs to the television, offering more constructed ideals about happiness and nature. The relatives seem to have little to say to each other, and leave as soon as they arrive. This tension permeates the film, even when it professes to merely depict happiness. Therese, even before the affair starts, seems to be the loser, as Francois has a separate space for his work, while she must toil at home as a dressmaker, no division between public and private realms; forced to watch optimistic brides-to-be pass under her roof, while she remains stuck in her unperceived hell. The difference between the two workplaces (rigidly gender specific) offers the first separation, and makes Francois's affair seem inevitable. Although he claims to still love his wife, the affair offers Francois everything he lacks - a site where he can talk about his feelings, and where he can get uninhibited sexual satisfaction (he compares Emilie to a wild animal, his wife to a meadow, which makes the pastoral idyll all the more violently ironic). Varda mocks the French tendency towards compartmentalisation for convenience here, and comically undercuts the relationship: first with some hilariously rapid shot/reverse shot editing when Francois arrives at Emilie's flat the first time; secondly, in a remarkably extended post-coital scene, after a distanced and fragmentary love scene, which reveals alienation, even when the couple most profess their love. The ending is terrifying, but also satiric, as it reveals that the family unit as celebrated by de Gaulle is an abstract end in itself, with an icy indifference to the feelings of individuals, shown in the film's repulsive final image of colour-coded conformity. The speed with which conservative ideology co-opts difference and subversion is chilling - the wayward mistress becomes a wife and mother with disturbing ease; we see the process of socialisation and feminisation with lucidity and barely suppressed anger. Modern France has as much emphasis on medieval rites as the fishing village in Varda's debut, LE POINTE COURTE, with its dances and work environments. Sometimes Varda does allow us access to her characters, as when Francois and Emilie have coffee at the beginning of their affair, but mostly, coldly, shows them as trapped pawns in an amoral, repressive system, in which only witless men thrive. The pastels are ravishing to look at, but unemotional; their poverty of feeling reflects the subject matter. The knowledge that Varda cast a real family in the lead roles only adds to the film's eerie power.",
         "The film divides fairly neatly into 4 20-minute sections, as we follow first the apparently very happy marriage of François and his wife Therese with their two small children; the beginnings of François' affair with Émilie; the growing intensity of that affair and his disclosure of it to Therese; and the aftermath. There's no way to properly discuss this without serious spoilers, so I hope anyone reading this has seen the film. Throughout the film the music of Mozart is used, specifically the Clarinet Quintet, much of it enormously cheerful and beautiful but with a melancholy undertone always struggling to break to the surface - and this describes the film as well. Each segment of the film is broken up by a day in the country as the family leaves the confines of their medium-sized provincial city - each segment (save the last) begins in a carefree, naive and innocent happiness and the exquisite photography romances both the beautiful couple with their children and the countryside. Nothing could be more gorgeous... But in fact François seems to suffer from an excess of happiness - he actually says as much at one point - or rather, he is incapable of feeling anything deep at all and experiences only a shallow surface thrill at the beauty of both his wife and his new love. He can't ever really decide between them and seems unable to grasp that he should even be thinking in that way, and that there might be problems developing as a result. I don't think it's any coincidence that Émilie bears a strong resemblance to Therese - blonde, roughly the same height and build, affecting fairly similar clothing and in the end, doubling in every way for her predecessor. François doesn't really want something different - he wants more of the same - or rather, he just wants to adore and be adored in a simple and childish way without thought of consequences. Perhaps it wouldn't matter if Émilie was strikingly different from Therese - but then perhaps it wouldn't be as obvious to us that all the man sees is the surface, and one surface seems as good as another... At the climax of the film, the end of the third part, François confesses his affair, and it's obvious that he has no comprehension that it could be a problem - he has enough love for both of them, you see. But Therese, perhaps as incapable as he is of truly adult comprehension or communication, nevertheless is capable of rejection, and she does so in dramatic and final fashion, forcing him to choose by removing herself from the equation. At the end, Émilie has replaced her in every way and the only person who has apparently learned anything is the one who ended her life. Varda deliberately creates a film that is all bold surfaces and colors - bright reds, pastel blues and greens, sunny yellows - and it is her use of color and editing that define the melancholy that underlies the happiness. When Émilie shows François her apartment for the first time there is a series of very quick cuts that show her possessions as François looks around, as if to show that in a few seconds he has taken in all he needs to, that he has found what he's looking for and doesn't need to think about it. And he never does. All three characters are fairly shallow, at least the film doesn't explicitly show us anything much to contradict that, and this leads to an extraordinarily cynical feeling, particularly on a second viewing for me - really, she seems to be saying, if we don't think and don't communicate with each other, if all we want is happiness, then what difference does it make if one person drowns herself - if that was her choice? One woman is as good as another, a new mother can do the same job as the original, let's just go on with our daily lives and forget about the darkness. The sole person who may have actually thought matters through with any understanding, Therese, is ultimately the one who can't exist in this world. It's also helpful in watching this I think - or at least, it gives the film even greater resonance - if one has seen \"The Umbrellas of Cherbourg\", made the previous year by Varda's husband Jacques Demy, which makes a fascinating counterpoint. Where \"Le Bonheur\" has the rhythmic feel and glossy surface of a musical, the Demy film actually is one; and where Varda's film actually ends up a tragedy - but wrapped up in cozy beauty - Demy's film is only a Hollywood tragedy. Did the wife make her savage piece of cynicism in response to her husband's bittersweet romance? I don't know, but it's fascinating to think about the many parallels... On the whole, I think \"Le Bonheur\" is one of the key French films of the 60s, it stands for me with the much-better known works of Godard, Truffaut and Chabrol from the decade and it is certainly a powerful philosophical statement about the nature of relationships, fidelity, \"happiness.\"",
         "A man in a happy marriage with two kids begins an affair, sincerely feeling he has enough love for both women and that neither one will be loved less. To start with, it's absolutely beautiful to look at. Varda always seems to know exactly what to do with the image, where to put the camera, which direction to move, when to cut, what color to fade to; everything is absolutely perfect. Moreover, the film is completely fascinating first because Varda deals with her subject with a rare honesty and forgiveness. Not a single character is unlikeable. Even if you see error in the husband's thinking, it is clear he believes with all of his heart that he truly can love both of these women at once and you sympathize with his sincerity. The wife is easy to care for, a good mother and very devoted, and the mistress is not someone you feel compelled to hate, either. She's not out to break up this marriage and she seems to really need this love. And what makes the film endlessly interesting is in how ambiguous Varda is about her own feelings. She never leads you to pick a side, never encourages you to see one specific viewpoint or leave the film feeling a particular way about what happened. While the music (Mozart is used throughout most of the film) in the last 15 minutes would seem to suggest anger at the way things have turned out, you can also look at the early stages of the film and see the image of the idyllic family with pastoral music as too perfect a presentation, one that is not entirely believable. Varda even hints at this herself; after we've watched about five minutes of this family picnicking in the woods, she cuts almost immediately to nearly the same image in a TV advertisement, suggesting that a marriage that happy only exists in commercials to begin with.",
         "Similar in many ways to the fantastic \"Cléo de 5 à 7\", a charming, mature and playful look at temptation and marriage.Not only great for it's chromatic & musical scales (color-fades, very colorful scenes are organized like moments withing a musical composition), the dialogues are right on as well - at first, it might seem a little 'sappy', but with 15minutes, you're enraptured!",
         "This is the first of Agnes Varda's works that I have seen and I have to first say that I was taken by the beauty that she puts into the picture. The use of color and the images she uses, how she frames them and the positioning of the camera in just the right spot...all of that create a beautiful picture that is just breathtaking. And the music (Mozart, I believe, though I am relatively unschooled in classical music) is wonderful and fits in to the picture perfectly. The story centers around Francois, a carpenter, his wife Claire, his children and his mistress, Emilie. The film begins with a beautiful buildup of an idyllic family life and a perfect marriage-too perfect in fact, and this probably reflects Francois' perception of reality and his delusions which continue throughout the film. They are a happy family with a great home life and frequent family trips to the country. Then Francois meets Emilie, a telegraph worker, with whom he also falls in love. He begins an affair with her, finding her to complement the relationship he has with his wife. And he believes that, because he is so happy with her and his love for his wife also seems to have grown with this affair, his wife will be happy with this state of affairs. And so he tells her, but the tragic results of that are not what he expects.. The story in part shows the naivety of people in love-even love where the participants shouldn't expect approval based on social norms. Lovers seem reluctant to believe that their love can hurt anyone or that anyone would wish their love to be otherwise. There is a selfishness about infatuation that throws up blinders around reality. Francois expects his wife to approve of the affair as he's totally wrapped up in his own feelings, a selfishness that is unconscious and unrecognized, so that he doesn't see the effect his betrayal might have on his partner. In fact, he doesn't even see it as betrayal. There is a fundamental inequality in his marriage, and Francois has mistaken his own feelings and desires for the communal feelings and desires that should be part of a truly idyllic marriage. Is such a relationship really possible? I don't know and Varda doesn't give us much hope, but it is clear that it is not possible if there is a fundamental selfishness and lack of respect in the partnership. This film developed a sense of unease within me, even in the early part and that just intensified throughout the movie as the plot and the affair deepened and Francois' apparent delusions of emotional reality became more evident. Though I didn't foresee the climax specifically, it was clear that things couldn't continue as blissfully as they appeared. The ending disturbed me most of all. This is a beautiful film and one that has many messages about relationships, marriage and society.",
         "Watching this film the last time, some 45 years ago, upon it's original UK release, I was blown away. I felt I had never seen such beautiful sunny summer images, I was astonished at the use of posters and advertising hoardings for composition. I notice now that some of these aspects have coloured my own photographic sensitivities. I remember the film as one long celebration of happiness and the suggestion that with the right attitude life would be like this. Seeing it again, it is still undoubtedly beautiful and I possibly appreciate even more the wonderful cinematography, however, now I notice how subversive this movie is. I have a feeling that this is very much a personal film seen through Varda's eyes and she is suggesting that a woman might easily do as the second woman does in this without causing so much as a head to turn. I think not, this is fantasy. The guy is unreal, men don't lie around saying how happy they are all the time, never mind the way he fails to be affected by the incident. I imagine at the time I saw this as a depiction of a real possibility. I seem to remember thinking lots of things were possible in the 60s that have turned out not to be. Nevertheless, this is still a beautiful movie,",
         "This movie is rich! One of the richest out of the thousands I've seen. I had to pause it after every scene just to catch my breath and to digest the images and emotions that came from the screen. It is less like watching a movie and more like going to a painting exhibit of newly discovered Renoirs and Monets. The beauty and the music simply got my heart thumping, and then, all I can say is that the plot seems to emerge out of the art direction. Genius! It is impossible for me to free my mind now from the images, which are startlingly fresh, in the way that \"Letyat zhuravli\" (The Cranes are Flying) was in 1957, or the opening shot of \"Cleo de 5 a 7\" was in 1962. The composition of every shot is immaculately precise in the manner of Jacques Tati's \"Monsieur Hulot\" movies, or Godard's \"Une femme mariee\" (1964) or the magazine industry, but Agnes Varda's movie is greater than all of these, because whereas those are static, motionless, almost feeling-less projects, hers has somehow managed to come across fluidly, effortlessly, vividly as anything before or after until the works of Kieslowski. It felt like I was watching a scene out of some family's life in heaven, and then, one of the children looks at the camera and offers some fruit, as if Varda is winking at us and saying, \"Enjoy, come in. Be a part of our wonderful time.\" Can life really be so wonderful as it is in this movie? The movie goes on to probe that very question. And I am better for it."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Parc Film"],
      "summaries": [
         "Francois is a young carpenter married with Therese. They have two little children. All goes well, life is beautiful, the sun shines and the birds sing. One day, Francois meets Emilie, they fall in love and become lovers. He still loves his wife and wants to share his new greater happiness with her.",
         "A happily-married carpenter inadvertently falls in love with a young telephone company employee. As he explores his feelings in the joy of that relationship, he discovers that far from feeling alienated from his wife and child, the joy of his new relationship actually intensifies his attachment to them as well. He is at a loss how to explain this to his wife. When Thomas shares the truth about his relationships with his wife she appears to accept his statement that he has enough love for both her and his mistress, but then she commits suicide. Thomas' relationship with his mistress survives."
      ],
      "budget": 0
   },
   "movielensId": 1534,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1965-02-10",
      "dvdReleaseDate": "2008-01-22",
      "directors": ["Agnès Varda"],
      "runtime": 79,
      "movieId": 1534,
      "title": "Le Bonheur",
      "mpaa": null,
      "actors": [
         "Jean-Claude Drouot",
         "Claire Drouot",
         "Olivier Drouot",
         "Sandrine Drouot",
         "Marie-France Boyer",
         "Marcelle Faure-Bertin",
         "Manon Lanclos",
         "Sylvia Saurel",
         "Marc Eyraud",
         "Christian Riehl",
         "Paul Vecchiali"
      ],
      "imdbMovieId": "0058985",
      "originalTitle": "Le Bonheur",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["H_apt9n4y88"],
      "plotSummary": "François, a young carpenter, lives a happy, uncomplicated life with his wife Thérèse and their two small children. One day he meets Emilie, a clerk in the local post office.",
      "tmdbMovieId": 53023,
      "avgRating": 3.55556,
      "releaseYear": "1965",
      "numRatings": 108,
      "posterPath": "/6yyyGlWRol5ashRUpfNqXuS4BX8.jpg"
   }
}