{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "hiv",
            "id": 9766
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "lgbt history",
            "id": 173504
         }
      ],
      "imdb_id": "tt0119578",
      "video": false,
      "title": "Love! Valour! Compassion!",
      "recommendations": [
         113460,
         32633,
         172854,
         96551,
         17651,
         17024,
         32700,
         27215,
         105789,
         26731,
         103516,
         44352,
         51935,
         19555,
         107592,
         168366,
         26423,
         46755,
         40947,
         239552
      ],
      "backdrop_path": "/6pxxhfYa4S9o6sPQWe2TWqABT7L.jpg",
      "revenue": 2900000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Buzz Hauser",
               "gender": 2,
               "credit_id": "52fe46eac3a368484e0ab085",
               "name": "Jason Alexander",
               "profile_path": "/ernpSXp2RnkzeV14OEEKXRq1yND.jpg",
               "id": 1206,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John Jeckyll, James Jeckyll",
               "gender": 2,
               "credit_id": "52fe46eac3a368484e0ab089",
               "name": "John Glover",
               "profile_path": "/aPmq20MXqFALrUxaaJoC2Xonumo.jpg",
               "id": 5589,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bobby Brahms",
               "gender": 2,
               "credit_id": "52fe46eac3a368484e0ab08d",
               "name": "Justin Kirk",
               "profile_path": "/hwPliH9zK3keAYt3uo1ksAlIsNV.jpg",
               "id": 20301,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Arthur Page",
               "gender": 2,
               "credit_id": "52fe46eac3a368484e0ab091",
               "name": "John Benjamin Hickey",
               "profile_path": "/4srJbpblPshcmQPI5auoAR8c1bi.jpg",
               "id": 21179,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46eac3a368484e0ab081",
               "name": "Joe Mantello",
               "profile_path": null,
               "id": 171000,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "595daef1c3a3680dec0517a5",
               "name": "Terrence McNally",
               "profile_path": null,
               "id": 33829,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.537469,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 64802,
      "vote_count": 11,
      "budget": 2000000,
      "overview": "Gregory invites seven friends to spend the summer at his large, secluded 19th-century home in upstate New York. The seven are: Bobby, Gregory's \"significant other,\" who is blind but who loves to explore the home's garden using his sense of touch; Art and Perry, two \"yuppies\" who drive a Volvo and who celebrate their 14th anniversary together that summer; John, a dour expatriate Briton who loathes his twin brother James; Ramon, John's \"companion,\" who is physically attracted to Bobby and immediately tries to seduce the blind man; James, a cheerful soul who is in the advanced stages of AIDS; and Buzz, a fan of traditional Broadway musicals who is dealing with his own HIV-positive status.",
      "similar": [
         449176,
         184352,
         26280,
         338189,
         413666,
         380874,
         47643,
         10938,
         26933,
         383526,
         258034,
         26371,
         9800,
         376867,
         425193,
         428493,
         152532,
         383559,
         52799,
         39934
      ],
      "original_title": "Love! Valour! Compassion!",
      "runtime": 108,
      "poster_path": "/6DP3bBYhA8eVjPNGKWWTbRlZJdI.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
         "name": "Fine Line Features",
         "id": 8,
         "origin_country": ""
      }],
      "release_date": "1997-05-16",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Eight men. One summer. Figure it out.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joe Mantello"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Terrence McNally",
         "Terrence McNally"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119578/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzIwNDU1NDY3N15BMl5BanBnXkFtZTcwOTcxNzUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jason Alexander, Stephen Spinella, Stephen Bogardus | See full cast and crew »"],
      "reviews": [
         "A very powerful and moving story, particular the relationship between Buzz and James; both dying of AIDS and both in love. Very well acted and incredibly moving, especially when happy-go-lucky musical loving Buzz begins to break and confesses how he really sees things. It may not be real life, but you could believe that these characters exist. The script is good, as are most scripts based on plays AND adapted by the original writer. I would be very inspired to actually see this performed. \"I am sick and tired of straight people, there are just too many of them. I was in a bank the other day, they were everywhere writing cheques, two of them were applying for a morgage, it was disgusting.\"",
         "Adapted from a hit play by Terence McNally and utilizing most of the original stage cast, this film cannot hide its theatrical roots... nor should it. This is a sweet and sad story set against a perfect summer at a perfect country estate in upstate New York (?) that shows the lives of 8 gay men as they come to terms with AIDS, death, love, compassion, and the thin bonds of friendship that hold them together. Their summer idyll is a microcosm that, apart from the real world we never see, touches us all because it is their humanity that dominates this story. That one is a dancer, a lawyer, a choreographer, etc. is unimportant. They are 8 gay men whose lives are intertwined in love, valour, and compassion. Jason Alexander is very good in the Nathan Lane role, the portly man dying of AIDS who, late in life finds love. John Glover is brilliant (repeating his Tony-winning role) as twins: one a nasty hateful man; the other a sweet man whose death from AIDS is imminent. Stephen Spinella and John Benjamin Hickey are solid as the yuppie long-term couple. Stephen Bogardus is warm as the stuttering host, Justin Kirk is surprisingly good as the blind man, and Randy Becker is good as the Latino hunk whose causes so much trouble. The film is full of stereotypes and warm humor and terrific moments of truth. This is not a revolutionary film that tries to change the world, but it is a wise and bittersweet look at the lives of gay men in the time of AIDS, men whose lives are shattered (and ended) by a cruel and heartless disease. There's nothing earth-shattering here, no insights that make the lives of gay men clear and understandable to non-gays. But it is a work of great honesty and simplicity in showing 8 gay men as.... human beings. The scene, when the men go skinnydipping under a summer moon is beautiful in its complete innocence. No viewer can fail to understand their childlike glee in such a simple pleasure. This film is a must see just because it is not a strident, political rant against the horrors of AIDS. The characters, especially those played by Glover and Alexander, accept their fates with great dignity, humor, and valour. This film is a great tribute to all our victims of AIDS, and a silent condemnation to the society and politics that let it happen.",
         "Eight gay men spend Memorial Day, Fourth of July and Labor Day in a remote house near NYC. Film follows their friendships and relationships. Previous posters have complained about the lack of character development but remember...the original play ran 3 1/2 hours! They had to cut out over an hour's worth of material to get a two hour film and the cutting does hurt. Still I like the film. The entire cast is good...even Jason Alexander. The setting is beautiful and the script is very good...but I saw the play so I was constantly remembering things they cut out. Ramon's (Randy Becker) part especially was chopped down. Still, the film shows a bunch of gay men dealing with AIDS, sex, love etc truthfully and with great humor. The best performances come from Alexander, Justin Kirk, John Glover and Randy Becker. Also the film has plenty of casual male nudity (especially Becker who is handsome and has a very nice body). Worth seeing...especially if you never saw the play.",
         "It's amazing the fate the great play by Terrence McNally suffered on its way to the movies. The fact that it's basically the same team that produced this moving theater piece at New York's Manhattan Theater Club and later transferred to Broadway with basically the same cast, and with the same director, Joe Mantello, doesn't give the film viewer any idea of what \"Love, Valor, Compassion\" was so effective on the theater in comparison what one watches this version on the screen. First, and foremost, the replacement of Nathan Lane, the originator of the role of Buzz was the first mistake. In fact, Jason Alexander, a good actor otherwise, throws away the balance of the film as he portrays Buzz. Mr. Alexander is out of his element in the movie. He seems to be acting in a different film, rather on this one. The rest of the brilliant cast is repeating the roles they originated on the play. \"Love, Valor, Compassion\" deals with a lot of serious topics in a matter of fact way. AIDS is at the center of the story as this group is affected deeply in one way, or another, by the plague that is killing most of these men gathered at a summer house. There is also a subtext in the movie about relationships, friendship, and loyalty. John Glover playing the twin brothers, John, and James, gives one of his best performances in this picture. Mr. Glover is an actor who has a long background in both theater and films and he is a welcome addition to anything he decides to grace with his presence. Stephen Spinella and John Benjamin Hickey, are Perry and Arthur, a gay couple that has managed to stay together fourteen years, a record for this type of life where relationships tend not to last at all. Stephen Bogardus and Justin Kirk, are Gregory and Bobby, the host of the house and his sweet blind lover. Randy Becker plays Ramon, who appears to be a hustler and has been brought as a guest and ends up betraying his companion and the host. Finally, the fact the film doesn't work rests with the direction of Joe Mantello, an excellent theater director for casting the wrong man in a key part in the movie and perhaps his unfamiliarity working in films.",
         "I have to wholehearted disagree that this film is disappointing. I found the characters interesting and deep. Yes - the gay men approach stereotypical roles in some instances, but they are developed over the course of the summer in a manner that mimics the boys in \"Stand by Me\". We see the changes in the relationships between nearly every pairing of the eight men. Some are in relationships; some were. Some hate each other; but they nearly all care about one another. This is the kind of movie that makes you reflect on your own human interactions. You don't have to be HIV+, a choreographer, a yuppie, a broadway queen, or even gay to see yourself in these characters. This is a fine exhibition of love, lust, friendship, and life.",
         "This is perhaps the most inappropriately named movie ever! There is no \"Love\", there is no \"Valor\", and there is no \"Compasion\". Let's try this instead: \"Self Centered!, Shallow!, Headonistic!\" I saw this film when it \"came out\" in 1997 and as the credits rolled in the theater I wanted to crawl into a hole and pull the hole in after me. Last night I caught parts of it again on cable and immediately started having PTSD symptoms. What a giant pant load. As a gay male, and ballet dancer myself, I cringe to think that people out there might see this vapid movie and think that my life in any way resembles it or any of it's pathetic inhabitants. Sorry to take this personally... This is not a movie about people, gay or otherwise, and their struggles or triumphs. It's about gay cartoon characters. And not very nice ones. Every distasteful stereotype is there. And most of the characters are several all at once. What do they have in common? They are all shallow, self centered, bitchy, immature, and totally lacking in impulse control, which explains the last thing they all have in common, they are all dying of AIDS. And so we have one of two problems here. Either gays are now making movies that perpetuate commonly held negative stereotypes about themselves, in which we have a movie and gay problem. Or, these aren't stereotypes and we gays are really like the way this movie portrays us, in which we have only a gay problem. Either way this movie is just one big problem from start to finish because it's loaded with bad movie making and bad gay characters. When \"The Boys in the Band\" opened in the 1960's the gay community, of which Terrence McNally had to have been a part of at the time, was outraged at it's negative portrayal of gay men as stereotypically sad, self loathing, and bitchy. Whatever Mr. McNally's perspective was back then he clearly thinks that stereotypically sad, self loathing, and bitchy was the way to go thirty years later in 1997, and that AIDS would somehow ameliorate the subjects' distastefulness. Not even close. More importantly, all the personal and sociological offenses aside, this is just a really bad, unenjoyable, movie. The house and landscape are beautiful but there is no one to like or care for anywhere to be found. Like too many \"gay films\" it trades on shallowness, bitchiness, nudity,and the promise of easy sex. Those can be elements of a film, but they can't BE the film. Follow this if you will. One of the many \"subplotlines\" threaded throughout this movie: the cute blind guy screws around on his partner, in their own home, with one of their guests, then gets a phone call that his sister had died and launches into an overacted banshee like scream that makes you think he might also be mentally disabled. Then while his lover is comforting him due to the loss of his sister, the cute blind guy thinks it's the perfect time to \"be honest\" and tell his lover that he has been schtupping the house guest. And this is fairly routine for this script and this group of characters. And this is not treated like a plot development. It's just one of many random moments, clichés, and stereotypes thrown into this shepherds pie of undeveloped stories and characters. Uhgg... And as for the brain trust behind all this, if this is what passes for talented playwriting and movie making by the gay establishment, God help us all.",
         "Often it is very tricky to adapt a play, especially one of a rather long length, to the screen and keep the story and characters intact. Though I have not had the pleasure of seeing a theatrical production of this film, I do own the play and have read it numerous times. Although the film did suffer a tiny bit from some things being edited out, characters speaking directly to the audience, further character insight etc., it is still a wonderful film, full of superb acting and characters that you fall in love with. The characters are brought to life with superb accuracy, due to the fact that all the actors, except Nathan Lane, reprise their roles that they held on the stage for about all of two years. And it shows that they have bonded as artists with both each other and their characters. As with almost all films there were performances that personally stood out to me. John Glover shows the audience why he won the Tony Award for his performance. Playing twin brothers, 'John the Foul and James the Fair' showing the defination of range. The other actor that really stood out was the always brilliant Justin Kirk, playing the young, blind Bobby Brahms, showing why he won the OBIE Award for his spectacular performance. The cast also includes Stephen Spinella, two time Tony award winner for Tony Kushner's masterpiece \"Angels in America\", Jason Alexander, and many other actors that deserve much more recognition and fame than they currently have. This is a beautiful film with precious characters that you will love.",
         "Let's see, does this film miss any gay cliché? Hmmm ... The singing of show tunes? Check. And the references to Judy or Barbra or Liza or Madonna or Ethel Merman? Of course, check. The promiscuity? Check. The gratuitous nude scenes? Check...and check... and -- oooh!, full frontal nudity! -- that'd be a big check again. The use of the term \"girlfriend\" when referring to a gay man? Ditto for the phrase \"bitch?\" Check and double check. Plenty of mincing and prancing around? Yeah, right there. Did we overlook that a least one guy should be a for-hire boyfriend? Nope, gay equals prostitute, ya know. Excellent, it's all here. Plus, a bit of S&M role-playing, just to spice things up. Oops! Almost forgot the totally unnecessary display of crossdressing. Oh good, here it is -- and in ballet tutus, to boot. Gotta make it clear that to be gay is to be nelly. Oh, they were out of politically correct minorities, but will a Hispanic do? If not, they've got a blind homosexual and can toss in a couple of brave and only slightly self-pitying AIDS victims. LOVE! VALOUR! COMPASSION! is one of those films where you may be at a loss to figure just why it exists. Eight gay men gather during three summer holiday weekends (Memorial Day, July 4th and Labor Day) at the New England country home of one of them, a successful choreographer. They bicker and banter, and fight and flirt; they bare the bodies while skinny dipping and bare their souls while trading cleverly rehearsed quips -- but, so what? As sort of a gay BIG CHILL or a homosexual FOUR SEASONS, the film really doesn't give any of them a chance to reveal themselves either politically or personally. There are a few pious monologues about love and life that are so generic as to be meaningless. If the point is to show that gays are \"just like everybody else,\" then why do all the characters seem so generically superficial and tiresomely stereotypical. If there is meant to be a message to the story, then why doesn't the film get to it? There are some nice moments here and there as two characters share an honest or intimate moment, but too often the dialogue is arch and too theatrical to be real. Other times, the material shows its theatrical roots with an out-of-nowhere dramatic moment where you can just see a character moving to center stage to deliver his big, important monologue in the spotlight. By the time you get to the end, where each character, in voice-over, reveals the circumstances of their way-in-the-distance death -- while dancing around in tutus, no less -- you just want to scream at the filmmakers. Here's a scene that totally trivialized these characters, showing them to truly be nothing but prancing fairies, yet begs you to see into the depths of their souls and weep for the fragility of their lives. The result is totally annoying, if not absolutely insulting. If it were not for the fact that many involved in the film are openly gay, you could just swear the film was trying purposely to be smugly homophobic. And you can't help but to groan at how needlessly self-important the material takes itself, even as it wallows in self-mockery. Too much of this is just pretentious, not the least of which is the three exclamation points in the title that just scream of announcing something of epic proportions; a false promise for a film with really very little to say. Three words: Lousy! Vacuous! Condescending!",
         "This film engages its audience not only through its loaded theatrical dialogue, where every line delivered is a subtle new insight into the character speaking it, but also because of the poignantly-treated themes designated by the title: Love! Valour! Compassion! The intertwining relationships of eight gay men who retreat together to a summer house three times during the season illustrate their individual character quirks as well as their collective trials, such as the HIV virus that infects two of them. Love between various pairs in the film emerges as both an animal, lustful act that may transpire in a dark and frenzied moment, and as a more tender and fundamentally human interaction that takes years to cultivate. Valour rears its intrepid head in the characters who deal most intimately with the virus, struggling to live gracefully even in the face of a painful and prolonged death. Compassion repairs each man's petty differences with another, and binds these eight weary travelers together as they quietly help each other through difficult times until the end of the film. Performances in Love! Valour! Compassion! are generally well done, from John Glover's dual turn as the stiff, spiteful John and his dying and unconditionally loved twin brother James, to Jason Alexander's nuanced role as a flamboyant HIV sufferer doing his best to cope with the disease. The often heartbreaking script is tempered by the alternately caustic and self-effacing humor inherent in a meeting of several strong gay personalities for extended periods of time. Visually, some scenes appear stagey, especially within the darkened summer house, but otherwise the play seems to have made a thematically successful and emotionally effective translation to the screen.",
         "LOVE! VALOUR! COMPASSION! Aspect ratio: 1.85:1 Sound format: Dolby Digital This perceptive drama - written by Terrence McNally, adapted from his award-winning Broadway play - starts out as a warm-hearted examination of the lives and loves of eight middle-class gay men during three eventful weekends at the isolated country home of ageing dancer Stephen Bogardus and his blind, youthful boyfriend Justin Kirk (ANGELS IN America). As it progresses, however, McNally's snappy screenplay begins to expose the faults in his principal characters, as well as their virtues, leading inevitably to fireworks and revelations. Set in a beautiful lakeside house somewhere in upstate New York (filmed in Quebec, though you wouldn't know it), director Joe Mantello - also responsible for the original Broadway production - and cinematographer Alik Sakharov take full advantage of the area's natural beauty, moulding a defiantly cinematic template from the material's inherent staginess. All but one of the fine ensemble cast was culled from the stage version, including Stephen Spinella and John Benjamin Hickey as a staid yuppie couple, and Randy Becker (LIE DOWN WITH DOGS) as the handsome young stud whose overt sex appeal creates emotional tension in a household dominated by middle-aged men. However, the film is virtually stolen by \"Seinfeld\"s Jason Alexander (in a role essayed by Nathan Lane on-stage) as the archetypal Broadway-loving queen who lives in fear of his HIV status and masks his anxiety with outrageous humor, and John Glover in dual roles as English twins, one of them noble and humane (and dying of an AIDS-related illness), the other a mean-tempered bitch of the highest order. McNally's script finds something deeper than mere stereotype in these disparate characters, and he examines the many ways in which they love each other, despite their differences. The full-frontal nudity which characterized the original stageplay (causing a minor stir at the time) has been toned down for the film, but not completely erased, and Becker in particular seems entirely at ease during his frequent nude scenes."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Krost/Chapin Productions"],
      "summaries": ["Gregory invites seven friends to spend the summer at his large, secluded 19th-century home in upstate New York. The seven are: Bobby, Gregory's \"significant other,\" who is blind but who loves to explore the home's garden using his sense of touch; Art and Perry, two \"yuppies\" who drive a Volvo and who celebrate their 14th anniversary together that summer; John, a dour expatriate Briton who loathes his twin brother James; Ramon, John's \"companion,\" who is physically attracted to Bobby and immediately tries to seduce the blind man; James, a cheerful soul who is in the advanced stages of AIDS; and Buzz, a fan of traditional Broadway musicals who is dealing with his own HIV-positive status."],
      "budget": 0
   },
   "movielensId": 1535,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "1997-05-16",
      "dvdReleaseDate": "2004-05-04",
      "directors": ["Joe Mantello"],
      "runtime": 108,
      "movieId": 1535,
      "title": "Love! Valour! Compassion!",
      "mpaa": "",
      "actors": [
         "Jason Alexander",
         "John Glover",
         "Justin Kirk",
         "John Benjamin Hickey"
      ],
      "imdbMovieId": "0119578",
      "originalTitle": "Love! Valour! Compassion!",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Gregory invites seven friends to spend the summer at his large, secluded 19th-century home in upstate New York. The seven are: Bobby, Gregory's \"significant other,\" who is blind but who loves to explore the home's garden using his sense of touch; Art and Perry, two \"yuppies\" who drive a Volvo and who celebrate their 14th anniversary together that summer; John, a dour expatriate Briton who loathes his twin brother James; Ramon, John's \"companion,\" who is physically attracted to Bobby and immediately tries to seduce the blind man; James, a cheerful soul who is in the advanced stages of AIDS; and Buzz, a fan of traditional Broadway musicals who is dealing with his own HIV-positive status.",
      "tmdbMovieId": 64802,
      "avgRating": 3.52689,
      "releaseYear": "1997",
      "numRatings": 781,
      "posterPath": "/wX8itpfkHiWUA9LfJbqxUyWYqod.jpg"
   }
}