{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "dance lesson",
         "id": 40897
      }],
      "imdb_id": "tt0117615",
      "video": false,
      "title": "Shall We Dance?",
      "recommendations": [
         51297,
         110396,
         15318,
         37185,
         29268,
         72933,
         78450,
         19011,
         49556,
         67089,
         86320,
         287503,
         112903,
         123997,
         31978,
         132561,
         77616,
         112929,
         16606,
         19635
      ],
      "backdrop_path": "/9dXnWYC7vM5EvmaaOq2EvYqLYl7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Shohei Sugiyama",
               "gender": 2,
               "credit_id": "52fe44189251416c750289fb",
               "name": "Koji Yakusho",
               "profile_path": "/mG4niNLZbyKHEfCA7EJP8vsi7rV.jpg",
               "id": 18056,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mai Kishikawa",
               "gender": 0,
               "credit_id": "52fe44189251416c750289ff",
               "name": "Tamiyo Kusakari",
               "profile_path": "/d2SmnBdyzNnmZQZahDfYAS4ZTuo.jpg",
               "id": 68703,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tomio Aoki",
               "gender": 2,
               "credit_id": "52fe44189251416c75028a03",
               "name": "Naoto Takenaka",
               "profile_path": "/9mAwzOZCWvaqDNOT3a0cIZVByRw.jpg",
               "id": 68704,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tokichi Hattori",
               "gender": 2,
               "credit_id": "52fe44189251416c75028a07",
               "name": "Yu Tokui",
               "profile_path": "/ylziwyPG4ao6nYWfkqHYaKHtvIx.jpg",
               "id": 68706,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Masahiro Tanaka",
               "gender": 2,
               "credit_id": "52fe44189251416c75028a4d",
               "name": "Hiromasa Taguchi",
               "profile_path": "/w52wqgazsVfDCpEFWWAai9tWCXY.jpg",
               "id": 990589,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Tamako Tamura",
               "gender": 0,
               "credit_id": "52fe44189251416c75028a51",
               "name": "Reiko Kusamura",
               "profile_path": "/opv7P6uzMidPL8SDHhtSSdnhRaN.jpg",
               "id": 1052343,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Masako Sugiyama",
               "gender": 1,
               "credit_id": "52fe44189251416c75028a55",
               "name": "Hideko Hara",
               "profile_path": null,
               "id": 109662,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Macho",
               "gender": 0,
               "credit_id": "52fe44189251416c75028a59",
               "name": "Hiroshi Miyasaka",
               "profile_path": null,
               "id": 235921,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Teiji Kaneko",
               "gender": 2,
               "credit_id": "52fe44189251416c75028a5d",
               "name": "Kunihiko Ida",
               "profile_path": null,
               "id": 1060573,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Hisako Honda",
               "gender": 0,
               "credit_id": "52fe44189251416c75028a61",
               "name": "Amie Toujou",
               "profile_path": null,
               "id": 1060574,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Chikage Sugiyama",
               "gender": 0,
               "credit_id": "52fe44189251416c75028a65",
               "name": "Ayano Nakamura",
               "profile_path": null,
               "id": 1060575,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Keiri-kachô",
               "gender": 0,
               "credit_id": "52fe44189251416c75028a69",
               "name": "Katsunari Mineno",
               "profile_path": null,
               "id": 1060576,
               "order": 12
            },
            {
               "cast_id": 33,
               "character": "Toyoko Takahashi",
               "gender": 1,
               "credit_id": "569f4fd992514137d600180a",
               "name": "Eri Watanabe",
               "profile_path": "/jRtepCAe5dCvkMY51kiq0LC4xrB.jpg",
               "id": 68705,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "",
               "gender": 2,
               "credit_id": "54995e8f9251411f43000c99",
               "name": "Masahiro Motoki",
               "profile_path": "/bCgObIfE8s3ZAG8GULioHjjRt6B.jpg",
               "id": 80863,
               "order": 14
            },
            {
               "cast_id": 31,
               "character": "",
               "gender": 0,
               "credit_id": "54bf2f249251411d7700e87c",
               "name": "Kôichi Ueda",
               "profile_path": "/qOWfODlgb2J8zcVnTXA90zvRMDT.jpg",
               "id": 50659,
               "order": 15
            },
            {
               "cast_id": 34,
               "character": "",
               "gender": 2,
               "credit_id": "5872527f925141356101748d",
               "name": "Ren Osugi",
               "profile_path": "/AtITnpwCJXRxaO0K2kKcDYeef7o.jpg",
               "id": 137029,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a0d",
               "name": "Masayuki Suo",
               "profile_path": null,
               "id": 68707,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a13",
               "name": "Kazuhiro Igarashi",
               "profile_path": null,
               "id": 68709,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44189251416c75028a19",
               "name": "Hiroyuki Kato",
               "profile_path": null,
               "id": 68710,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a1f",
               "name": "Shôji Masui",
               "profile_path": null,
               "id": 68711,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a25",
               "name": "Yuji Ogata",
               "profile_path": null,
               "id": 68712,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a2b",
               "name": "Shigeru Ohno",
               "profile_path": null,
               "id": 68713,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a31",
               "name": "Yasuharu Urushido",
               "profile_path": null,
               "id": 68715,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44189251416c75028a37",
               "name": "Yasuyoshi Tokuma",
               "profile_path": null,
               "id": 19595,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a3d",
               "name": "Yoshikazu Suo",
               "profile_path": null,
               "id": 68716,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a43",
               "name": "Naoki Kayano",
               "profile_path": null,
               "id": 68717,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44189251416c75028a49",
               "name": "Masayuki Suo",
               "profile_path": null,
               "id": 68707,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44189251416c75028a6f",
               "name": "Jun'ichi Kikuchi",
               "profile_path": null,
               "id": 132936,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.330804,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 11239,
      "vote_count": 47,
      "budget": 0,
      "overview": "A bored Japanese accountant sees a beautiful woman in the window of a ballroom dance studio. He secretly starts taking dancing lessons to be near her, and then over time discovers how much he loves ballroom dancing. His wife, meanwhile, has hired a private detective to find out why he has started coming home late smelling of perfume.",
      "similar": [
         10409,
         33283,
         71754,
         371368
      ],
      "original_title": "Shall we ダンス?",
      "runtime": 136,
      "poster_path": "/y5JpbVaZLNyHobodZNJsNQlRs1N.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Altamira Pictures Inc.",
         "id": 5099,
         "origin_country": ""
      }],
      "release_date": "1996-01-27",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Masayuki Suo"],
      "runtime": 136,
      "synopsis": null,
      "writers": ["Masayuki Suo"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0117615/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2Nzk4MTcyMF5BMl5BanBnXkFtZTcwMDI0NDMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kôji Yakusho, Tamiyo Kusakari, Naoto Takenaka | See full cast and crew »"],
      "reviews": [
         "Watched this last night and was bowled over by the heartfelt story line, the excellent character development, and the good karmic vibe emanating from the acting and movie as a whole. Without giving away too much of the plot, it begins with an ordinary joe who commutes to his office job every day who becomes inspired to take dance lessons. Along the way the protagonist and the assorted characters he meets in his quest to be smooth on the dance floor learn lessons about others and about themselves. The story has a prologue about what dancing in Japan symbolizes sociologically, so it isn't exactly as simple to learn to dance in Japan as it is here in the U.S. The film is lighthearted; you'll laugh out loud at some of the sight gags. Yet it is also dignified in a way hard to describe. All of the film's characters are taken seriously, as they are, and none are diminished because of their \"imperfections.\" I've been thinking about taking social dance classes with some friends. It just so happened a friend lent me the video on learning to dance. Is this synchronous or what? I think so because now I'm really geeked to give it a try. Watch this wonderful family film (small children might not get it, but teens certainly would) and smile at the genuine caring you see shown in it time and again. Why they would make a remake of Shall We Dance is a mystery, as it is perfect as-is.",
         "I simply love this movie. It is a perfect example of the well-rounded surprising stories that come out of Asian cinema. There was a recent Hollywood remake of this movie, with Richard Gere and the simply awful Jennifer Lopez. Please do not confuse the two movies. The original Japanese film is touching, subtle and wonderfully acted. The Hollywood version is the exact opposite. I was aghast when I first saw the trailer for the remade US Version and who was starring in it. It's typical Hollywood unoriginal crass commercialism at it's worst. The remake cements the argument that some foreign films can never be improved upon. The ONLY reason the original film did not become more widely viewed is the US audience's aversion to subtitles. One of the main reasons this movie would never work in an American telling is that the reserved, ultra socially conservative character of the public Japanese persona is at issue in this movie. Certainly the main character awakens to a more full understanding of living a vivacious life through dance, but half of the movie's tension comes from the stereotypes and ridicule ballroom dancers face in Japan. Please try to see this movie in it's original form, not the terrible full screen. And please DO skip the US remake....it's a shallow travesty in comparison to the original Japanese movie. Yes, I know the \"original\" movie is much older, and this is simply a Japanese take on the story, but the only two people are likely to see any time soon are this one and the new US remake. Speaking of foreign films, I'll make a few quick recommendations: 1.Monsoon Wedding-I list this first for a reason, outstanding film! 2.Johnny Stechino-Very funny Italian mistaken identity flic! 3.Shiri-A Korean action pic that mixes both Asian flare & US style plot 4.Run Lola Run-A German film that integrates it's techno score ingeniously. Well, just a quick list anyway :-)",
         "I was so surprised when I saw this film so much underrated... I understand why some of you dislike this movie. Its pace is slow, a characteristic of Japanese films. Nevertheless, if you are absorbed in the film like me, you will find this not a problem at all. I must say this is the best comedy I have ever seen. \"Shall We Dansu?\" is often considered a masterpiece of Japanese comedies. It is very different from Hollywood ones, e.g. Austin Powers or Scary Movies, in which a gag is guaranteed in every couple of minutes. Rather, it is light-hearted, a movie that makes you feel good. I love the movie because it makes me feel \"real\". The plot is straightforward yet pleasing. I was so delighted seeing that Sugiyama (the main role) has found the meaning of life in dancing. Before I watched the film I was slightly depressed due to heavy schoolwork. I felt lost. However, this film made me think of the bright side of life. I believed I was in the same boat of Sugiyama; if he could find himself in his hobby, why couldn't I? It reminded me of \"exploring my own future\" and discovering the happiness in my daily life. It is important to note that the actors are not professional dancers. While some of you may find the dancing scenes not as perfect as you expect, I kinda like it as it makes me feel that the characters are really \"alive\", learning to dance as the film goes on. Over all, this film is encouraging and heart-warming. As a comedy, it does its job perfectly. It definitely deserves 10 stars. And yes Aoki is funny :-D",
         "How many of us wish that we could throw away social and cultural obligations and be free? Most of us, I suspect. Shall we dance? is not a movie about dancing. It is about learning about ourselves, recognising what we are looking for in life and having the courage to go in search of it. Mr Sugiyama is a middle-aged member of a Japanese society where ballroom dancing is viewed as unsuitable behaviour. One day Mr Sugiyama sees a beautiful girl leaning out of the window of a dancing acadamy. he is fascinated by her and eventually signs up for dancing lessons. He is ashamed of his dancing and afraid of ridicule. He hides the fact that he is attending dancing classes from his colleagues and family. There is a hilarious scene in the mensroom at the office when Sugiyama and Watanabe, a workmate who also dances, are interrupted practising some dance steps. There are many other funny and warm-hearted scenes. The ending is not a fairytale, but it leaves the viewer feeling good. This movie helped me to understand the Japanese people a little better. It is a warm and very worthwhile film to see.",
         "This film is about a man who has been too caught up with the accepted convention of success, trying to be ever upwardly mobile, working hard so that he could be proud of owning his own home. He assumes this is all there is to life until he accidentally takes up dancing, all because he wanted to get a closer look of a beautiful girl that he sees by the dance studio everyday while riding the subway on his way home. His was infatuated with her at first, going to the dance class just to idolize her, but he eventually lets himself go and gets himself into the dancing. It eventually becomes apparent to him that there is more to life than working yourself to death. There is a set of oddball characters also learning in the studio, giving the film a lot of laughs and some sense of bonding between the dejected. There is also revelations of various characters, including the girl he initially admired, giving some depth to them by showing their blemished past and their struggle to overcome it. The dancing was also engaging, with the big competition at the end, but it is not the usual story where our underdog come out at the top by winning it. Instead, there are downfalls, revelations and redemption. All these makes it a moving and fun film to watch.",
         "I don't like \"grade inflation\" but I just had to give this a 10. I can't think of anything I didn't like about it. I saw it last night and woke up today thinking about it. I'm sure that the Hollywood remake that someone told me about, with J Lo and Richard Gear, will be excellent, but this original Japanese version from 1996 was so emotional and thought-provoking for me that I am hard-pressed to think of any way that it could be improved, or its setting changed to a different culture. A story I found worth watching, and with o fist-fight scenes or guns going off or anything of the sort! Imagine that! All the characters seemed well-developed, ... even non-primary characters had good character-development and enjoyable acting, and the casting seemed very appropriate. It's always hard to find a good movie-musical in our day and age, and perhaps this doesn't quite qualify (there is plenty of learning how to dance, but no singing) but I really think that Gene Kelly and others who championed a place for dance in our lives would have thought so very highly of this film and the role of dance in helping to tell a story about a middle aged man, successful with a family in Japan, looking for something... he knows not precisely what. To the team of people in Japan who contributed to this film, thank you for creating and doing it.",
         "First, there is NO way the remake can be as good, because Japanese society is quite different from ours and plays such a major part in this film, as explained in the opening narration. It adds to the humor as well as warmth of this movie. There is slew of different supporting characters/personalities. Each does there part in making this movie wonderful. This movie is full of comedy that isn't vulgar in anyway like most of today's \"gross-out comedies.\" Yet it can still have you laughing out loud. The reality is, in real life, you don't have a choice of who you work with or go to school with...etc. This movie truly emphasizes that and shows that the natural good in people can overcome petty differences. Not to mention, it makes for a great sub-plot and much of the humor. This is a story about dance that actually has a story, and a good one at that. There are a few back stories that are not out of place, but actually support the main storyline. Truly a well written film. The dancing is great, too. I happen to be a fan of any movie with dancing of any sort, for that aspect. However, this movie goes beyond any other with dance, in the fact that, it is a story First and just happens to be written about dancing in Japanse society. Highly recommended. 10 out of 10.",
         "A good movie with an outstanding story. Many assume that the movie is a love story from the typical Hollywood style: boy meets girl love affair. This is not. It is a story of a man who forgot to love life. His everyday life has become routine and he has no idea where his life is taking him. He has a house and car payment and a family of 3 that he has to provide for. From home, he takes his bicycle to the train and then he takes the train to work. Everyday, same old, same old. Then, one day he sees something that turns his world up-side-down. Dancing? A new way to express himself, a way to communicate with others and show his true colors. The passion he finds is not in a woman or mere lust, but in living life to the fullest. He begins to stop and look around him as he uses dancing to live. A terrific cast of funny and heart filled characters. This is not a movie about Japan or the Japanese, although it does take place in Japan and the cast is made up of Japanese. The setting and the plot of this movie is timeless.",
         "Okay. As you can see this is one of my favorite if not favorite films. This is a character drama which is absolutely hilarious. The main character is a business man who is stuck in a \"same thing, different day\" mentality. He sees a woman looking melancholy out a window of a dance studio from his train everyday and wonders about her and decides to find out more about her. He decides to join the dance class only to find out she is not the instructor. From there he bonds with four other dancers and learns to enjoy dancing as well as finding out about the mysterious woman. There is no gratuitous (or any) sex involved, just how a small group of people learn how friendships are formed and developed. This film was remade with Richard Gere and Jennifer Lopez and the new one while appealing is nowhere as enjoyable as the original. The movie never made it big in America because it was not eligible for the Oscars since it was broadcast on television in Japan (movies cannot be released on TV or they are disqualified for Oscar nominations). It did win numerous awards in Japan for best film, cast, director etc for their \"Oscar\" awards.",
         "This movie is among my favorite foreign films, some of the others are Amilee and My Life As a Dog. The similarities with those movies as with so many great foreign films, is that it takes a mundane slice of life and transforms it into a profound heartfelt lesson. In Japan, a man who is bored with his mundane life and the rut of his married life, sees a beautiful Japanese woman staring out the window of a dance studio. In the instant that it takes his train to pass, he is enthralled by her. But is it only by her beauty, by her faraway glance, or a connection that they will both discover that they share? Shall We Dance has memorable wonderful characters who have to deal with painful realities by transcending them through the world of dance. Breaking traditional moulds and stereo types of Japanese society, they risk all for happiness and find that joy is not too far away. It is one of those movies that is so magical and meaningful and, in itself, transcends the mundane by showing the true magic and miracle that life can be."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Altamira Pictures Inc.",
         "Daiei Studios",
         "Nippon Television Network (NTV)"
      ],
      "summaries": [
         "Shohei Sugiyama has attained all that he has wanted in life. But he is still depressed and unhappy. One day, he gathers up the courage to sign up for dancing lessons. He hopes they will rid his depression and help him get his life back together.",
         "The accountant Shohei Sugiyama (Kôji Yakusho) is feeling bored with his routine life, limited to hard work and stay at home with his wife Masako Sugiyama (Hideko Hara) and his teenager's daughter. One night, while traveling home by train, he sees the beautiful face of Mai Kishikawa (Tamiyo Kusakari) in the balcony of a dance school, and a couple of days later, he decides to visit the school and secretly take ballroom dance lessons every Wednesdays night. However, he becomes ashamed to tell his family his secret. Meanwhile, Masako feels the changes in the behavior of her happier husband, and hires a private eye to investigate whether Shohei is having an affair.",
         "Shohei Sugiyama is an accountant who spots a beautiful Japanese woman in a dance studio window. Hoping to get closer to her, even though he's married and has a child, he signs up for dance lessons in secret, and slowly begins to fall in love with the art form itself.",
         "A successful but unhappy Japanese accountant finds the missing passion in his life when he begins to secretly take ballroom dance lessons."
      ],
      "budget": 0
   },
   "movielensId": 1537,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1996-01-27",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Masayuki Suo"],
      "runtime": 136,
      "movieId": 1537,
      "title": "Shall We Dance?",
      "mpaa": "PG",
      "actors": [
         "Koji Yakusho",
         "Tamiyo Kusakari",
         "Naoto Takenaka",
         "Yu Tokui",
         "Hiromasa Taguchi",
         "Reiko Kusamura",
         "Hideko Hara",
         "Hiroshi Miyasaka",
         "Kunihiko Ida",
         "Amie Toujou",
         "Ayano Nakamura",
         "Katsunari Mineno",
         "Eri Watanabe",
         "Masahiro Motoki",
         "Kôichi Ueda",
         "Ren Osugi"
      ],
      "imdbMovieId": "0117615",
      "originalTitle": "Shall we ダンス?",
      "genres": [
         "Music",
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["9rcecBuySJ4"],
      "plotSummary": "A bored Japanese accountant sees a beautiful woman in the window of a ballroom dance studio. He secretly starts taking dancing lessons to be near her, and then over time discovers how much he loves ballroom dancing. His wife, meanwhile, has hired a private detective to find out why he has started coming home late smelling of perfume.",
      "tmdbMovieId": 11239,
      "avgRating": 3.8729,
      "releaseYear": "1996",
      "numRatings": 4638,
      "posterPath": "/y5JpbVaZLNyHobodZNJsNQlRs1N.jpg"
   }
}