{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "circus",
            "id": 291
         },
         {
            "name": "boy",
            "id": 5202
         },
         {
            "name": "bear",
            "id": 10468
         },
         {
            "name": "jungle",
            "id": 10787
         },
         {
            "name": "monkey",
            "id": 15149
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0120087",
      "video": false,
      "title": "The Second Jungle Book: Mowgli & Baloo",
      "recommendations": [],
      "backdrop_path": "/mehPuaqtBTAmVCWNtXnpSiTPcNU.jpg",
      "revenue": 479099,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Baldev",
               "gender": 2,
               "credit_id": "52fe47d9c3a36847f814b9cf",
               "name": "Gulshan Grover",
               "profile_path": "/bGcwuGr8TXRbxoXX4Uzhx0E8G8D.jpg",
               "id": 42208,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mowgli",
               "gender": 2,
               "credit_id": "52fe47d9c3a36847f814b9d3",
               "name": "Jamie Williams",
               "profile_path": "/zIrvjIi5wj76mFTmJ2qpvp3oeSA.jpg",
               "id": 166534,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Harrison",
               "gender": 2,
               "credit_id": "52fe47d9c3a36847f814b9d7",
               "name": "Billy Campbell",
               "profile_path": "/fbqKllMad5nW7Wnh6uQrRkeQUZl.jpg",
               "id": 20215,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "King Murphy",
               "gender": 2,
               "credit_id": "52fe47d9c3a36847f814b9db",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Chuchundra",
               "gender": 2,
               "credit_id": "52fe47d9c3a36847f814b9df",
               "name": "David Paul Francis",
               "profile_path": null,
               "id": 183923,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Karait",
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814b9e3",
               "name": "Dyrk Ashton",
               "profile_path": null,
               "id": 228284,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Emily Reece",
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814b9e7",
               "name": "Cornelia Hayes O'Herlihy",
               "profile_path": "/FspbJducPt4dGGjAQRSHUIxAEK.jpg",
               "id": 134693,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Col. Reece",
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814b9eb",
               "name": "B.J. Hogg",
               "profile_path": "/fBx6rB5IcS8O297qcPmvodph7O5.jpg",
               "id": 82142,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Molly Ward",
               "gender": 1,
               "credit_id": "52fe47d9c3a36847f814b9ef",
               "name": "Amy Robbins",
               "profile_path": "/v6cYKqOSVhTBpLG7dyHUc0oAF8e.jpg",
               "id": 140527,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Capt. Ward",
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814b9f3",
               "name": "Hal Fowler",
               "profile_path": null,
               "id": 228285,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47d9c3a36847f814b9f9",
               "name": "Duncan McLachlan",
               "profile_path": null,
               "id": 228286,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814b9ff",
               "name": "Dee McLachlan",
               "profile_path": null,
               "id": 83284,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814ba05",
               "name": "Matthew Horton",
               "profile_path": null,
               "id": 1094952,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814ba0b",
               "name": "Bayard Johnson",
               "profile_path": null,
               "id": 554582,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814ba17",
               "name": "Raju Patel",
               "profile_path": null,
               "id": 66907,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d9c3a36847f814ba2f",
               "name": "Jo Gilbert",
               "profile_path": null,
               "id": 1094960,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "542ed2c20e0a26259c000330",
               "name": "Rudyard Kipling",
               "profile_path": "/jdUjE86nlIm7BcN73vO7DZbhrPU.jpg",
               "id": 14744,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "547b2927925141379f00069a",
               "name": "Dean E. Fronk",
               "profile_path": null,
               "id": 30876,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "568ae1c2c3a36860e902c0da",
               "name": "John Scott",
               "profile_path": null,
               "id": 29056,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "547b4d60c3a3685af0000160",
               "name": "Adolfo Bartoli",
               "profile_path": "/weoIgV80gRk7LxzUtdYFwI0hdMG.jpg",
               "id": 19710,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "547b4d7b9251412d82000156",
               "name": "Marcus Manton",
               "profile_path": null,
               "id": 72547,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "547b4d8fc3a3685af6000146",
               "name": "Errol Kelly",
               "profile_path": null,
               "id": 19681,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "547b4d9f9251412d70000156",
               "name": "Ann Hollowood",
               "profile_path": null,
               "id": 959992,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.028658,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50850,
      "vote_count": 6,
      "budget": 0,
      "overview": "In this exciting live-action adventure, young Mowgli, an orphan raised by wolves, is spotted by a scout for a giant circus. Accompanied by a cruel hunter and a snake charmer, the scout sets out to trap Mowgli. But with the help of Baloo the bear and Bagheera the panther, little Mowgli leads the adults into his biggest and wildest adventure yet! A fun-filled movie every member of the family will enjoy.",
      "similar": [
         278927,
         62177,
         281957,
         587,
         297762,
         97630,
         112160,
         858,
         141,
         634,
         437557,
         242224,
         43923,
         11236,
         82703,
         27586,
         2771,
         326359,
         9587,
         3134
      ],
      "original_title": "The Second Jungle Book: Mowgli & Baloo",
      "runtime": 88,
      "poster_path": "/oZ8Zg2kb6IIsXazAJrAM745ObHP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1997-05-16",
      "vote_average": 3.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dee McLachlan"],
      "runtime": 88,
      "synopsis": "there are some Chimps Capture Mowgli sent by King Murphy (Roddy McDowall) to tell Mowgli about \"Cobra in the Pit\" chasing Mowgli. Then some chimps are seen jumping off a tree branch. Later a chimp is seen grabbing Mowgli's ankle on a tree stump above ground. The chimp climbs down and smacks Mowgli. This scene was shot in cuts. The trainer placed the chimps on their mark with one chimp holding the boy's ankle. The trainer cued them with verbal and hand signals. When traveling from one tree to another, the chimps were merely going from one trainer to another trainer. As the chimp holds Mowgli's ankle, his jungle friends come to his rescue. Baloo, a jungle bear, rises up behind Mowgli and snarls at the chimps and they run up into the trees. Grey Wolf and Bagheera, a black panther, approach and Mowgli hugs his friend Grey wolf. This scene was shot in cuts. The chimps were placed on their mark while trainers surrounded the bear. When cued, the chimps ran up into the tree as the bear was cued to stand and snarl. There is a scene where Mowgli is in a cave with his wolf friends and a roach crawls across the floor. Mowgli picks up the roach and puts it in his mouth. This scene was shot in cuts. A real and a fake roach were used. The real roach is placed on his mark for the establishing shot from A to B and then is replaced with the fake. When the boy is seen picking up the roach and putting it into his mouth, that, too, is fake. The wolves were placed on their mark and were cued with verbal and hand commands. A tiger is seen traveling A to B to a cliff over looking a river. Mowgli appproaches and jumps in the water. Baloo, Grey Wolf, and Bagheera, all run over to the cliff looking down at the water. A deer is seen walking by when Mowgli jumps up from under the water with a frog on top of his head. This scene was shot in cuts. A fake frog was used for this scene. The deer was placed on his mark and cued with verbal and hand commands. The rest of the animals were placed on their marks and cued with verbal and hand signals. As a safety precaution, additional trainers were strategically placed around the animals. There is a scene where the people are revealed inside the passing train. Chuchundra, a small fat man is seen with Timo, a trained monkey, sitting on his shoulder. The monkey is wearing a collar with a long chain attached and is trained to steal pretty baubles. Timo dances on a table and then leaps onto a female passenger. The men at the table are playing cards and in all the excitement, Timo picks an officer's pocket. Chuchundra leads Timo back to the table, where the monkey salutes the officers and Chuchundra gives the man his wallet. The monkey proceeds to jump around and play pick-pocket. This scene was shot in cuts. The behavior in this scene was pre-trained and cued with verbal and hand signals with food as a reward. When Mowgli sees the train tracks, he and his friends, Baloo, Bagheera and Grey Wolf walk closer to inspect their new find. As the train is heard approaching, the animals move back from the track. Mowgli's friends approach the tracks after the train stops. They growl at the train and its occupants. This scene was shot in cuts. Each animal was placed on their mark by their trainers and released from point A to point B where a second trainer waited. Timo and Mowgli escape through a window on the train and crawl across the top, jumping from car to car. Timo gets on Mowgli's shoulder and the boy jumps from the train into the jungle. Timo is seen going from A to B in the trees. This scene was shot in several cuts. The train was only moving approximately 10mph. The actual jumping of the boy with the monkey is not seen. When the monkey is seen running across the roofs of the train cars, a safety cable is attached to the roof and the monkey is on a waist tie attached to the cable. Trainer #1 placed the monkey on his mark at point A and trainer #2 called the monkey to point B. When the monkey jumps from one car to the other he is actually jumping from trainer #1 to trainer #2 who are on opposite rail cars. Mowgli and Timo find an old abandoned camp site and some chimps are in the tent. Timo pulls out the pin holding up the tent and it falls onto the chimps. The chimps jump into an old cart and Mowgli Pushed the cart into rolling down the hill and Mowgli Growl and Roar at chimps. The cart falls over a cliff and the chimps are seen hanging onto some branches. This scene was shot in cuts. The chimps were placed in the cart with waist ties and the trainers were also present in the cart during filming. A process car was hooked to the cart with a safety cable and driven at a speed of 10mph. The chimps were cued to jump up and down making faces while the cart was moving. The segment of the chimps hanging from the tree branches, was shot before a blue screen and inserted during post production. When Mowgli takes his new friend to see Grey Wolf he is crushed that his friends rejects him. Mowgli is wearing a hat he found at the camp site and Grey Wolf can smell the scent of man on it. Grey Wolf and Mowgli play a game of tug of war for the hat. Baloo and Bagherra growl at their old friend. This scene was shot in cuts. The trainers placed the animals on their mark and cued them with a buzzer and verbal, and hand commands, from one mark to another. The wolf was actually a hybrid and merely played a game with the boy for the hat. In several scenes a man is seen walking with a python around his neck and arms. In one scene the man lets the snake go and it crawls up and around a tree approaching Mowgli, wrapping himself around the boy. For all of theses scenes a real snake was used. The trainer placed the snake on the actor or stuntdouble and retrieved him at completion of the shot. The wild chimps capture Baloo and put him in some type of a dungeon. Baloo starts growling as a chimp, above on a grate, antagonizes him. He finally digs his way out and runs off. This scene was shot in cuts. Trainer #1 released the bear and trainer #2 called him to his next mark. When the bear is seen digging his way out of the dungeon, he was cued with verbal commands. The chimp was placed on his mark and cued with verbal and hand signals. Later, Baloo is captured by the white men and put in another cage. One night in the camp, a tiger approaches and Mowgli scares the animal off with a flaming stick. Baloo is grateful and licks Mowgli's face through the bars on his cage. This scene was shot in several cuts. Trainer #1 released the tiger and he ran to trainer #2 where he is seen scratching and sniffing looking for treats. Several wolves show up at the ruins to help rescue Mowgli after the chimps have captured him. The wolves run from A to B in several scenes at the ruins. These scenes were shot in cuts. The trainer placed them on their mark and cued them with verbal and hand signals. While at the ruins, several wild chimps are seen walking, climbing, running, sitting, or bringing food or clothing to the crazy captain. In one scene at the ruins, the captain is shooting a gun in the direction of the chimps. The chimps were placed on their mark and cued with verbal and hand commands, using food as a reward. The segment with the shooting of the gun was done in cuts. When Mowgli is in the pit, numerous snakes are seen crawling all around him. Mowgli and Timo attempt to climb up a rope to safety, however, just as Timo reaches safety, Buldeo cuts the rope plunging Mowgli back into the pit. Then a python is sent down through a hole in the roof to act as a leverage and pull the boy up. The snake wraps itself around the boy and the snake's owner, helps to pull the two to safety. This scene was shot in several cuts. A real snake was used for this scene. The boy was never at any time actually lifted from the floor by the snake. There are several shots were only portions of the boys body is seen, at that time, a trainer is pulling the boy up, simulating the snake action. Several shots were filmed before a blue screen and inserted during post production. The trainer placed the snake around the boy and retrieved it at completion of the shot. When Timo and Mowgli are seen climbing the rope, trainer #1 placed the monkey on the boys shoulder and the monkey, responding to the commands of trainer #2, jumps from the boy to the rope and on to his trainer. Later, Mowgli's uncle is seen hanging from a tree and a tiger is seen jumping up to grab him. This scene was shot in cuts. The trainer released the tiger and the stuntman used a buzzer to cue the tiger to his next mark. When the tiger is seen leaping at the stuntman, he is actually jumping up to get a treat. When the animals are seen walking or running from A to B or climbing trees, trainer #1 released the animal at point A while trainer #2 retrieved him at point B. There are many scenes where Timo is seen jumping on the actor's shoulder or various objects. For these scenes the monkey was placed on his mark and cued with verbal commands and retrieved by his trainer. Other animal action consists of several scenes where the chimps and monkey are seen traveling from A to B or performing behavioral tricks such as, making faces, giving kisses, throwing food, jumping and squealing, eating with a spoon etc. All of these behaviors were accomplished with hand and verbal commands or a buzzer. In several scenes a tiger, a leopard, a bear, wolves, birds, snakes, etc., are seen performing various behavioral tricks such as, snarling, standing, leaping, swatting, slithering, etc. Again, all of this action was accomplished with the trainers placing the animals on their mark and cueing them with verbal and hand commands or a buzzer with treats as a reward.",
      "writers": [
         "Matthew Horton",
         "Bayard Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120087/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MDM1MzkzMV5BMl5BanBnXkFtZTcwMzQ4NDYxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jamie Williams, Billy Campbell, Gulshan Grover | See full cast and crew »"],
      "reviews": [
         "Jamie Williams, then 12 years old, stars as the man-cub Mowgli in this movie adaptation of the classic Rudyard Kipling story. He is supported by an outstanding cast of animals, such as Baloo the bear, Baghera the panther, and Shere Khan the tiger. The story is too well know to bear repeating. But playing against Williams are characters representing the Yankee \"collector\" for P. T, Barnum's circus (Bill Campbell), a couple of eccentric British army officers and their wives, an Indian hurdy-gurdy player complete with trained monkey, an Indian prince who is really Mowgli's uncle, and a positively weird tracker with his trained python. There is also an appearance by Roddy McDowall, who was himself a very famous child star (How Green Was My Valley, Kidnapped (1948)) with over 158 movie appearances in his career. The boy-cub, his wolf brothers, and all the animals out shine and out star the adults in this movie. The animal trainers are the invisible stars, directing the animals in major roles, not just quick appearances. Williams is exceptional in his role as Mowgli. I wonder at his stunt abilities. It must be hard to use a body double for a 12 year old boy. See him climb and leap about in trees, run with the animals, dive into rivers, and clamber around on the roof of a moving train. And he's cute, to boot! Tanned, smooth skinned, and lithe. With a grin to light up a city. It's a joy to watch him run though the jungle swinging from tree to tree. A young Tarzan comes to mind. Maybe in a few more years when his body has filled out, Williams could replace Johnny Weismuller? Watch this movie as an antidote to the dreadful cartoon version of the novel, with the singing bear. It is an extremely realistic portrayal of a feral boy, his jungle friends, the jungle itself, and those adults who would wish him ill. It belongs in that category of serious movies that star children, but are not just children's stories. This story was not one of Kipling's best, in my opinion. It is rather fantastic. For his best story made into a movie, I refer you to \"Captains Courageous\" which was filmed in three versions.",
         "We picked this for family movie night this past Friday. Afterwards, I turned to my husband and said, \"I'm sure this could have been worse, but I can't imagine how.\" Our sons, five and nine, didn't seem to mind, but we didn't like the idea of them being exposed to such rot. This may go down in movie history as Roddy McDowell's \"Trog\" ; the unlamented last film that Joan Crawford made. Bad story, badly written, poorly acted, chimpanzees _in India_, rewriting Kipling - it never stopped. I can't think of much more to say, but the system requires additional lines. Pass it up.",
         "Jamie Williams, only 10 years old when the movie was made, stars as the man-cub Mowgli in this movie adaptation of the classic story by Rudyard Kipling. He is supported by an outstanding cast of animals, such as Baloo the bear, Bagheera the panther, and Sher Khan the tiger. The story is too well know to bear repeating. But playing against Williams are characters representing the Yankee \"collector\" for P. T, Barnum's circus (Bill Campbell), a couple of eccentric British army officers and their wives, an Indian hurdy-gurdy player complete with trained monkey, an Indian prince who is really Mowgli's uncle, and a positively weird tracker with his trained python. There is also an appearance by Roddy McDowall, who was himself a very famous child star (How Green Was My Valley, Kidnapped (1948)) with over 158 movie appearances in his career. The boy-cub, his wolf brothers, and all the animals out shine and out star the adults in this movie. The animal trainers are the invisible stars, directing the animals in major roles, not just quick appearances. Williams is exceptional in his role as Mowgli, even more exceptional considering that no stunt doubles were used in the filming. All Mowgli's stunt scenes were made by Jamie himself at age 10 and half! Including the chase at running train's roof, climbing the walls in the ruined city and few scenes, where he was 4-6 feets from the adult tiger, who was on thin lead only. And he's cute, to boot! Tanned, smooth skinned, and lithe. With a grin to light up a city. It's a joy to watch him run though the jungle swinging from tree to tree. A young Tarzan comes to mind. Maybe in a few more years when his body has filled out, Williams could replace Johnny Weismuller? Watch this movie as an antidote to the dreadful cartoon version of the novel, with the singing bear. It is an extremely realistic portrayal of a feral boy, his jungle friends, the jungle itself, and those adults who would wish him ill. It belongs in that category of serious movies that star children, but are not just children's stories.",
         "12yo Jamie Williams was the perfect actor choice for 9yo Mowgli, the Jungle Boy. Besides being a talented actor he is lovely appearing and looked the part of someone who may have been raised by wolves. All supporting adult actors performed their associative roles well, without stealing the scenes and without resorting to ghetto-speak or being vulgar in any way. So I say this movie is a family-safe event that will allow a 'time-out' from day-to-day rituals for all ages of children and accompanying adults. Each exotic animal had its own breathtaking scene where their individual grace and beauty could be observed. Close-ups of sweet Mowgli's face when he calls birds, monkeys, cats, wolves or bears were very clear and added some gentle depth to a little boy who was the product of animal care taking. My family enjoyed this movie. Clearly a story this simple is not meant for those persons who have left the bigger part of their childhood essence behind; however, it is highly recommended to anyone who still enjoys tender child fare: clean, wholesome, gentle and enjoyable.",
         "The answer to the question above is of course this outstanding movie. I could be boasting about the great animals, trained to ... well, whatever they do in this movie. I would be bragging about how great mr Williams is in the role as Mowgli. I should proudly present to you the wonderful nature and magnificant surrounding. But I don't have to. All I have to do is to tell you to watch the movie. Also, it's much better than it's forerunner. And that's all I had to say about that.",
         "I bought this movie in the $5 bin at Wal-Mart & did not know what to expect. Well, I found it charming! I have read Kipling within the last few years and cite the Jungle Books as an example of children's books that are of absorbing interest to adults, as well. I do not find that true of, say, the Harry Potter series. Kipling is a surpassing genius; he did not pander to the reader or to children. He tells a heartfelt naturally symbolic tale that is pure and powerful. As to this movie: it is a hodge-podge of Kipling's plots. But, man, is it beautiful and that little kid is so good and believable as Mowgli. Without being true to any one of the books, it seems to me perfectly true to the spirit of Kipling. The cinematography and the beautiful animals are, in themselves, worth the price of admission. I loved it!",
         "EPIC FAIL. On every level, this god-awful piece of crap is just muddled, stupid, and unnecessary trash. The plot was incredibly cliché-ridden, boring and uncreative, the acting was as lame as possible, the direction and set direction were dreadful, and the movie was also extremely racist. The movie borrowed from various other films, and they were so noticeable it was pathetic. Once again, the storyline was unbearably painful and annoying, I felt like throwing up at the end. I could really go on for hours about just how stupid and atrocious this crap is. Also, what's with the chimpanzees? Not only were they unbearably unnecessary and aggravating, but chimps don't even live in Asia! The film weakly tried to be funny in parts - but in instead of even feeling at all motivated to laugh, I just rolled my eyes, gritted my teeth and tried not to vomit. This hopeless, abominable and insulting film is definitely one of the worst movies ever made, and please spare yourself having to sit through it. 0%"
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "MDP Worldwide",
         "TriStar Pictures"
      ],
      "summaries": [
         "Pre-teen jungle boy Mowgli gets to human world and is pursued by P.T.Barnum circus scout Harrison who wants to take him to circus as curiosity. Harrison hires local grandee Buldeo for help in tracking Mowgli down. It turns out to be that Mowgli is Buldeo's nephew, and the only obstacle for him to take his late brother's rich estate.",
         "Circa India in 1880, Young Mowgli's father is devoured by Sher Khan, the tiger, while the youngster takes shelter with a pack of wolves. He grows up in the jungles, and is befriended by Bagheera, a black panther; Baloo, a black bear, as well as his brother Greywolf. At the age of 10, Mowgli ventures out to the human world, and returns home with a trained monkey, the wolves refuse to take him back, and he is treated as an outcast. Alone, without his jungle friends to assist him, he becomes the target of two large apes; a jungle tracker with a huge python; Harrison, who wants to abduct Mowgli, take him to America and make him perform in the P.T. Barnum Circus; Sher Khan, who wants to kill and feast on this man-cub; and his vengeful paternal uncle, Baldev, who wants him dead at any and all costs so that he could keep the inheritance for himself,"
      ],
      "budget": 0
   },
   "movielensId": 1538,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-05-16",
      "dvdReleaseDate": "2001-02-06",
      "directors": [
         "Duncan McLachlan",
         "Dee McLachlan"
      ],
      "runtime": 88,
      "movieId": 1538,
      "title": "The Second Jungle Book: Mowgli & Baloo",
      "mpaa": "PG",
      "actors": [
         "Gulshan Grover",
         "Jamie Williams",
         "Billy Campbell",
         "Roddy McDowall",
         "David Paul Francis",
         "Dyrk Ashton",
         "Cornelia Hayes O'Herlihy",
         "B.J. Hogg",
         "Amy Robbins",
         "Hal Fowler"
      ],
      "imdbMovieId": "0120087",
      "originalTitle": "The Second Jungle Book: Mowgli & Baloo",
      "genres": [
         "Adventure",
         "Family"
      ],
      "youtubeTrailerIds": ["1VsOzczrWFY"],
      "plotSummary": "In this exciting live-action adventure, young Mowgli, an orphan raised by wolves, is spotted by a scout for a giant circus. Accompanied by a cruel hunter and a snake charmer, the scout sets out to trap Mowgli. But with the help of Baloo the bear and Bagheera the panther, little Mowgli leads the adults into his biggest and wildest adventure yet! A fun-filled movie every member of the family will enjoy.",
      "tmdbMovieId": 50850,
      "avgRating": 2.47931,
      "releaseYear": "1997",
      "numRatings": 145,
      "posterPath": "/oZ8Zg2kb6IIsXazAJrAM745ObHP.jpg"
   }
}