{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120394",
      "video": false,
      "title": "Twin Town",
      "recommendations": [
         87789,
         19723,
         18373,
         26143,
         10078,
         86763,
         8435,
         56837,
         74186,
         134476,
         32742,
         27626,
         83356,
         33718,
         35395
      ],
      "backdrop_path": "/vMKIEyPUzmIP4Hy397PSLesr0yg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeremy Lewis",
               "gender": 2,
               "credit_id": "52fe464d9251416c75074073",
               "name": "Rhys Ifans",
               "profile_path": "/p0rbwzc4Yj2oHW0iiln0X0Wx9EK.jpg",
               "id": 7026,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Julian Lewis",
               "gender": 2,
               "credit_id": "52fe464d9251416c75074087",
               "name": "Llŷr Ifans",
               "profile_path": "/tCraL9aJP6tsSJsDjXySADT0wmE.jpg",
               "id": 147877,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Terry Walsh",
               "gender": 2,
               "credit_id": "52fe464d9251416c75074077",
               "name": "Dougray Scott",
               "profile_path": "/zeZmtK4EKK9R2r6bp2nTxMs3ByS.jpg",
               "id": 15336,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Greyo",
               "gender": 0,
               "credit_id": "52fe464d9251416c7507408b",
               "name": "Dorien Thomas",
               "profile_path": null,
               "id": 585957,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Mr. Mort",
               "gender": 0,
               "credit_id": "52fe464d9251416c7507408f",
               "name": "Ronnie Williams",
               "profile_path": null,
               "id": 585958,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Taxi Driver",
               "gender": 0,
               "credit_id": "52fe464d9251416c75074093",
               "name": "Paul Durden",
               "profile_path": null,
               "id": 585959,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Television Presenter",
               "gender": 2,
               "credit_id": "52fe464d9251416c75074097",
               "name": "Kevin Allen",
               "profile_path": "/be76iefw66VcgYUkWmHUCypM0PM.jpg",
               "id": 36083,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Dai Rees",
               "gender": 2,
               "credit_id": "533574f09251414463004345",
               "name": "Brian Hibbard",
               "profile_path": "/ktjhdIq5b6P8HveT6kof3HoLnsA.jpg",
               "id": 67215,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Lucy Cartwright",
               "gender": 1,
               "credit_id": "58af001e9251410b33007c13",
               "name": "Sue Roderick",
               "profile_path": "/xwh9JbMh36ZymCusvnqYvHey9CQ.jpg",
               "id": 1120606,
               "order": 8
            },
            {
               "cast_id": 26,
               "character": "Hunky",
               "gender": 2,
               "credit_id": "593bb6c3c3a3680f4200acf1",
               "name": "Steffan Rhodri",
               "profile_path": "/4bptQdwRKCMveddkpZdCvDwcsHQ.jpg",
               "id": 143892,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe464d9251416c7507407d",
               "name": "Kevin Allen",
               "profile_path": "/be76iefw66VcgYUkWmHUCypM0PM.jpg",
               "id": 36083,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe464d9251416c75074083",
               "name": "Kevin Allen",
               "profile_path": "/be76iefw66VcgYUkWmHUCypM0PM.jpg",
               "id": 36083,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55449b949251414c920015e8",
               "name": "Peter McAleese",
               "profile_path": null,
               "id": 9149,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55449bbac3a368573b0010ee",
               "name": "Mark Thomas",
               "profile_path": "/1QI1g9bPABLyFg6RtxaY0YGf988.jpg",
               "id": 62086,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "55449bcdc3a3680cd9003de5",
               "name": "John Mathieson",
               "profile_path": null,
               "id": 943,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55449beac3a3680cd5003f64",
               "name": "Oral Norrie Ottey",
               "profile_path": null,
               "id": 18077,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "55449bfbc3a3680ce6003fdd",
               "name": "Nina Gold",
               "profile_path": "/kljYhRvTAqQfX198mjz0ITP0hFM.jpg",
               "id": 16363,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55449c2a925141499f000270",
               "name": "Pat Campbell",
               "profile_path": null,
               "id": 1462070,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "55449ed5c3a368573b001137",
               "name": "Dave Arrowsmith",
               "profile_path": null,
               "id": 1462071,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55449f129251414c9200163b",
               "name": "Jean Kerr",
               "profile_path": null,
               "id": 1462072,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "55449f2cc3a36856e50011db",
               "name": "Rachael Fleming",
               "profile_path": null,
               "id": 9006,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "55449f5ac3a36856e50011e3",
               "name": "Graham Johnston",
               "profile_path": null,
               "id": 1427823,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "55449f6d92514119e0001346",
               "name": "Sarah Cherry",
               "profile_path": null,
               "id": 1462074,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.341294,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 15321,
      "vote_count": 32,
      "budget": 0,
      "overview": "Jeremy and Julian Lewis, the \"Lewis Twins\", are two unruly brothers who terrorise the city of Swansea from the caravan park where they live with their family. When their father, Fatty, is injured while working on a roof for local kingpin Bryn Cartwright, they try in vain to claim compensation. Thus begins a campaign of terror, which local policemen Terry and Grayo are ill-equipped to prevent, involved as they are in a drugs deal with Cartwright.",
      "similar": [],
      "original_title": "Twin Town",
      "runtime": 99,
      "poster_path": "/kzvxxJ8qeL1xOJBWtMr7Lx1JxWv.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Cymraeg",
            "iso_639_1": "cy"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Polygram Filmed Entertainment",
            "id": 31080,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Agenda",
            "id": 52518,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aimimage Productions",
            "id": 21629,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Figment Films",
            "id": 359,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-11",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kevin Allen"],
      "runtime": 99,
      "synopsis": "all I want to do is add is the sentence.. said by the Father,to his sons while the watch him make a model boat.. it says it all about this crazy film.. he says \"get yer own f*%%%ing glue!\" love it! You just have to watch this film, once in your life! Close your eyes on the poodle bit! You just have to watch this film, once in your life! its the best, you will laugh cry and just love it.. You just have to watch this film, once in your life! Awesome film, well acted and hilarious You just have to watch this film, once in your life!",
      "writers": [
         "Kevin Allen",
         "Paul Durden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120394/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNTQxNTQwNV5BMl5BanBnXkFtZTcwMTk0NDkyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Llyr Ifans, Rhys Ifans, Dorien Thomas | See full cast and crew »"],
      "reviews": [
         "It's quite nice to see how good this film is when you think about it. A lot of people don't really know much about Welsh films and to be honest it's because there isn't that many unless there are in welsh language. Before Dougrary Scott starred in Mission Impossible 2 and Ripley's game there was Twin Town and the same goes for Rhys Ifans who stole most of the limelight on Notting Hill as the mad masturbating Welshman Spike but it all started here with Kevin Allen's Twin Town. A hard look at Swansea life through so many different characters who you forget who is who after the first half hour but what a bunch of characters they are. Most of them actually put Wales to shame but with a funny twist of humour and violence. This came hot on the heels of Trainspotting and had a lot to look up to but I think this just as good as Trainspotting. It starts off well enough and keeps going throughout without it letting up for a second till the end credits. Even though there are some ruthless people in this you can't help but fall in love with them especially Terry played by Dougrary Scoot who is just so comic as a hard cop bully who thinks he is the man but is actually very accident prone at most times and that's what makes him great amongst other roles. This is a so much happening here and we should look at this for what it is which is a feel good film that starts you off straight away and doesn't let you stop till the end credits.",
         "Twin Town cannot be mentioned in the same breath as Trainspotting, simply because it is a completely different film, the fact that they are both set in squalid urban surroundings and involve drugs is incidental. Twin Town is basically a sequence of revenge acts between two groups of people linked in all sorts of ways. The Twins to whom the title refers might as well be cardboard cutouts, for the lack of personalities, but you find yourself sympathetic with them despite their debauchery. Likewise the death of the Lewis family (minus the sons) is a very sad moment, despite the fact that they have been portrayed so shallowly. This is the success of the film, the way it manipulates your emotions to leave you genuinely shaken by the violence in the events leading up to the climax, whereas the opening of the film leads you to expect a light-hearted farce. Watching it again it is easy to divide the film into two sections, but very difficult to pin down where the change of pace and mood begins. The humour and irony is superb, particularly the razor sharp sarcasm of Adie. Although a very seedy picture of Wales is presented, this presents a very positive view of the people of Swansea and manages not to be anti-English in the slightest despite the obvious nationalistic feel. The acting is great, and as long as you aren`t expecting anything like Trainspotting and you let the humour wash over you you`ll enjoy this.",
         "Being a Swansea girl originally, I had no trouble in deciphering the accents... Swansea is indeed an Ugly, Lovely City, and the stark and honest portrayal of life in the dull valleys of south Wales, where unemployment is high, was a piece of script writing and directing genius. The Lewis \"twins\" were played brilliantly by the Evans brothers, and their honest and forthright portrayal of two youngsters bored with the humdrum life was refreshing and gritty. The human touch in this film was evident from the start, and in many areas it seemed to have an almost Docu Drama type genre, which added to the realism. It is unfair to compare Twin town to Trainspotting, as there are no comparisons to be made, both should be viewed as independant films, and to link them together does the would be viewer no justice. Twin Town has all the elements of a great movie, Comedy, Drama, and in combining these,the viewer cannot help but become attached to the characters. This film made me laugh, gasp and cry.A stroke of Pure Genius.",
         "Very very funny. A sleeper hiding in the dusty back shelves of the video store, that I took out one night with curiosity and no expectations. I'm three-quarters English, a quarter Welsh and have spent a long time in Australia, but I don't think it was just the Welsh part of me that enjoyed this movie. I loved its roughness, its quirkiness, its lack of perfection and its reality and sure! some of the characters were grubby, superficial and less than enervating. This is a loosely woven picture of reality in an under-privileged urban environment with all the mundanity, idiocy, drama, violence, beauty and humour of everyday life that eddies around us, and in this instance, the Lewis twins. There are a couple of truly hilarious scenes that very few actors could emulate, but the twins in the movie are twins in real life and it flows naturally. Revenge escalates inevitably beyond the frivolous into the 'deadly' serious with a speed and abandonment that has you gasping. But unlike some movies that lose it at the end, this one magically gathers in all the loose threads and delivers a finale of epic proportions that elegantly spans the coldly ruthless and the vauntingly sublime and leaves you with a sense of deep justice. GREAT. This is the sort of stuff the Americans don't do very often or very well, and mostly misunderstand when someone else does it properly. This was done properly. Reviewers disappointed by an inevitable comparison with Trainspotting obviously missed a lot of the subtle stuff in both movies that is exclusive to the towns, times and cultures they portray. They got sidetracked by the 'big' issues .... Shelve your preconceptions, grab the remote and replay all those bits that are hard to catch if your ear isn't tuned to the accent. Sure it helps if bad language doesn't get in the way of enjoyment, but let's face it, you should be used to those Anglo-Saxon and Gaelic words by now - so if you can handle it, this one's a delight - but it'll never be mainstream.",
         "What a film! It was hyped up during it's release, so when I saw it, I understood why! It's set in Swansea, (Only 8 miles from where I live!), so I could really connect with the surroundings and the larger than life characters. Mind you, the storyline was something I wouldn't have associated with the city...yeah right! Rhys Ifans' and Dougray Scott's break out roles, this one oozes great performance's. Some people knock the acting 'cos it seems 'hammed up', but the Welsh are like that. We do tend to go OTT sometimes, we are larger than life people! And as the script shows, we are very nationalistic. Great direction, and with nearly every recognisable Welsh actor in it, this is a dark, funny, and entertaining film. The script is fresh, and the plot is good. And as the caption on the sleeve states, the film DOES \"raise an index finger to Hollywood\". Rating? nothing short of perfect 10! Go and see it NOW! I promise you, you will not be dissapointed!",
         "Twin Town has to be seen to be believed! It can make you laugh harder than you could ever imagine, mainly because the characters are like people that you know and love. It is a story of life in Swansea, South Wales... a new and different culture for some of us. The scenery is gorgeous, the accents are char- ming, and the script is clever and incredibly funny!!! Rhys Ifans and Llyr Evans (brothers in reality) are Jeremy and Julian Lewis, two boys who are out for revenge after their dad is injured at work and his boss refuses to compensate him. What follows is some of the crudest, most off-the-wall humor in the history of film. (Look for Fergie the poodle and the wiener-wagon scene --- I laughed out loud!) Suprisingly, there are some serious moments as well, and you may find yourself wiping away a tear. This is when you find your identification with the Boys, and the movie becomes yet even more wonderful. All in all, this is my favorite movie because of the wonderfully warm and funny cast and the never-say-die attitude of the Lewis brothers. Don't miss it!",
         "Danny Boyle is in many ways the British answer to Quentin Tarantino. Despite Boyle not having complete authority over TWIN TOWN, his trademarks are definitely present, and many parts of this film are truly excellent. However, the film as a whole seems to lack true continuity, as it seems to be a loose, simple plot formed by sporadic situations that the writers feel are funny (in many ways they are). Which brings me on to the Tarantino connection - one has to only watch 20 minutes of his films to realise the man is in love with situations - whether they be from circumstance or dialogue. However Quentin is the true master of this kind of film-making. A lesser creator will provide interesting and funny scenes, but with a taste of incompletion left in the mouth. That said, TWIN TOWN is acted wonderfully, and the Swansea setting makes for some interesting and novel humour. Whereas some of the violence seems a little contrived, it is refreshing to see new kinds of film-making, and moreso to see it grow from the mind of Brits!",
         "It suddenly occurred to me while watching this film that, whether by accident or design, I've seen a whole lot of films that star Rhys Ifans. His brother Llyr appears with him here, the lesser-experienced brother that had previously only appeared in Ymadawiad Arthur and has made no further films to date. He does adequately, yet watching this - Rhys' second cinema film - it becomes clear he's the star. Off-puttingly touted as the \"Welsh Trainspotting\" - because who wants imitations? - this is really nothing of the sort, and is far more impressive than you would expect. Already three years old, it has yet to be shown on British terrestrial television and nor do I expect it ever will be. It's content is morally vacuous, including police corruption, joyriding, drug taking, animal killings and murder. Peppering the script are a man who breaks his wife's nose, massage parlour brothels, female masturbation and almost continuous usage of the f-word. If that hasn't already put you off, this is a tale that features two bath-sharing brothers, who, after being refused compensation for their father's broken leg, take revenge by urinating on their enemy's daughter. However, Twin Town, bizarrely, never really offends, as it is done in, despite the subject matter, a good-natured tone. And I did have to smile at the real-life names of the dogs that feature in this tale of cocaine dealers - Charlie and Snowy. I wonder if that was intentional? What really grips about Twin Town is that, in the age of the depleted UK film industry, it lacks the desperate mugging and dead laugh areas that characterise the 1990s British \"comedy\". A desperate, \"please love us America, please give us your box office, we're begging\", which is normally prevalent in the genre, is almost wholly absent here. (For further information on such a desperate breed, see Rhys' first major film: \"Notting Hill\") Okay, there is the overstatement that sees a male voice choir singing Mungo Jerry's \"In The Summertime\", or the twins joyriding their own father's hearse, but generally this film, despite the extremities of it's plot, does keep an eye towards realism and naturalistic dialogue. And the overlong, feeble \"comic pauses\" that normally kill off the rotting carcasses of British Film are nowhere to be found, due to a constantly moving, frenetic pace. The only down side to all this is that, apart from Rhys who has appeared in, to date, ten movies after this, the rest of the crew involved haven't achieved success. In fact, this was the first feature of the two writers involved and they haven't written another film since, presumably due to its lacklustre showing at the box office. A great shame, as Twin Town is well worth watching.",
         "The film has everything you'd want it to have. Especially if you're British. Probably more of a bloke's film, but still fun for everyone. The story is brilliant, and so accurately welsh. Every minor detail adds to the whole experience. The film progresses like a serious drama and seems to come out with brilliant comedy without even trying. As well as the actual storyline being funny, little quirks about each character and even the attention to welsh detail makes you laugh. Not only is it well written, it's also beautifully filmed, and makes great use of the camera. The film encompasses a huge range of interesting shots. Enhancing the film further was it's great choice of cast. All the characters were perfectly conveyed, and film avoided any bad performances. The music is also something to listen out for, as it stands out as a good piece of work on it's own. I highly recommend Twin Town (especially if you're British), as it's an exciting film experience with a great story, interesting shots, decent actors, and appropriate use of excessive swearing and violence.",
         "I enjoyed the film, but can easily see how others might not feel as I did. When I saw the preview, I was immediately interested in the movie -- despite the fact that the preview I saw revealed nothing about the film itself. The most I ever get to learn or hear about Wales is through reading Hollinshed's histories of the middle ages. It was interesting to see a film actually set in a modern Welsh town. Besides, it was f'ing hilarious."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Agenda",
         "Aimimage Productions",
         "Figment Films"
      ],
      "summaries": [
         "Twin Town opens with wide sweeping shots of seaside Swansea; to be the place of action for the next one and a half hours. The serene setting with miles upon miles of old semi-detached housing is suddenly cleaved apart by two young lads tearing through the neighbourhood in a two tone BMW 525. Julian and Jeremy are in deep trouble. Their dysfunctional family scrapes together a living from their dole money and odd-jobs offered to their father. The boys have long since turned to drug abuse and car theft leading a happy-go-lucky life in downtown no-hoper city. In due course the plot thickens as the boys are out for revenge against wealthy club owner Bryn who is not particularly helpful in providing compensation when their father is hit by an accident when working on his premises. The boys are fairly imaginative when it comes to planning their strike, culminating in scenes which all dog-haters and karaoke loathers will love.",
         "Julian and Jeremy, two brothers known as the \"Lewis Twins\", prefer to spend their time on drugs and joyriding. When their father, Fatty Lewis, breaks his leg working for local bigwig Bryn Cartwright, they show up demanding compensation. Underestimating the vicious humour of the twins Bryn brusquely refuses to pay for the un-insured Fatty and unleashes a ferocious feud.",
         "In the small welsh town of Swansea boredom is high and the only relief's are getting a \"massage\" at the Gentlemen's Executive Health Spa, karaoke, as well as dealing and using skag (cocaine for those who don't know what skag means.) The top family is the Cartwright's. Bryn Cartwright is the skeezy Rugby club own with a rod up his a*s, and is secretly a drug king pin; Bryn's wife, Lucy, is the victim of this story from both ends of the spectrum, Bonnie; their daughter, is a self involved karaoke singer who is quite snobbish, as well as banging Dai Reese, the self proclaimed karaoke king."
      ],
      "budget": 3300000
   },
   "movielensId": 1539,
   "movielens": {
      "languages": [
         "English",
         "Cymraeg"
      ],
      "releaseDate": "1997-04-11",
      "dvdReleaseDate": null,
      "directors": ["Kevin Allen"],
      "runtime": 99,
      "movieId": 1539,
      "title": "Twin Town",
      "mpaa": "",
      "actors": [
         "Rhys Ifans",
         "Llŷr Ifans",
         "Dougray Scott",
         "Dorien Thomas",
         "Ronnie Williams",
         "Paul Durden",
         "Kevin Allen",
         "Brian Hibbard",
         "Sue Roderick",
         "Steffan Rhodri"
      ],
      "imdbMovieId": "0120394",
      "originalTitle": "Twin Town",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Jeremy and Julian Lewis, the \"Lewis Twins\", are two unruly brothers who terrorise the city of Swansea from the caravan park where they live with their family. When their father, Fatty, is injured while working on a roof for local kingpin Bryn Cartwright, they try in vain to claim compensation. Thus begins a campaign of terror, which local policemen Terry and Grayo are ill-equipped to prevent, involved as they are in a drugs deal with Cartwright.",
      "tmdbMovieId": 15321,
      "avgRating": 3.12292,
      "releaseYear": "1997",
      "numRatings": 301,
      "posterPath": "/kzvxxJ8qeL1xOJBWtMr7Lx1JxWv.jpg"
   }
}