{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "break-up",
            "id": 14602
         }
      ],
      "imdb_id": "tt0118556",
      "video": false,
      "title": "Addicted to Love",
      "recommendations": [
         11777,
         397,
         10154,
         10783,
         11630,
         10859,
         11467,
         12658,
         2020,
         7300,
         10563,
         9409,
         11285,
         4967,
         11310,
         11983,
         10660,
         10411,
         12518,
         12661
      ],
      "backdrop_path": "/l9f45NsRyCoD44Kc9wh5sFWuTvX.jpg",
      "revenue": 34673095,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe4330c3a36847f804139b",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe4330c3a36847f804139f",
               "name": "Matthew Broderick",
               "profile_path": "/j9ETatVKFxYR5Ijk8l5tzKO4HPn.jpg",
               "id": 4756,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Linda Green",
               "gender": 1,
               "credit_id": "52fe4330c3a36847f80413a3",
               "name": "Kelly Preston",
               "profile_path": "/kxTQVsfZkI3DdzBqutw4zZapRB.jpg",
               "id": 11164,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Anton Depeux",
               "gender": 2,
               "credit_id": "52fe4330c3a36847f80413a7",
               "name": "Tchéky Karyo",
               "profile_path": "/9rMF25F5r3Giix9jkwfuUz2utHv.jpg",
               "id": 10698,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Nana",
               "gender": 1,
               "credit_id": "52fe4330c3a36847f80413ab",
               "name": "Maureen Stapleton",
               "profile_path": "/7zazX6qycXK1CBXkNT1t9FCEEkk.jpg",
               "id": 21151,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Ed Green",
               "gender": 2,
               "credit_id": "52fe4330c3a36847f80413af",
               "name": "Nesbitt Blaisdell",
               "profile_path": null,
               "id": 21152,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Prof. Wells",
               "gender": 2,
               "credit_id": "52fe4330c3a36847f80413b3",
               "name": "Remak Ramsay",
               "profile_path": null,
               "id": 21153,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Carl",
               "gender": 2,
               "credit_id": "52fe4330c3a36847f80413b7",
               "name": "Lee Wilkof",
               "profile_path": "/hLMn7bvQy1kKuqMxhzOJQxQTjxt.jpg",
               "id": 21154,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "56e78dc092514109260012f3",
               "name": "Susan Forristal",
               "profile_path": "/A8Dh5EKIjaRUqGmpY8GdIAW9pJY.jpg",
               "id": 21620,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4330c3a36847f8041367",
               "name": "Griffin Dunne",
               "profile_path": "/4oCLupH3Uo2otzF77LrYE4s1iqw.jpg",
               "id": 2171,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4330c3a36847f804136d",
               "name": "Robert F. Newmyer",
               "profile_path": null,
               "id": 21146,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4330c3a36847f8041373",
               "name": "Jeffrey Silver",
               "profile_path": null,
               "id": 20908,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4330c3a36847f8041379",
               "name": "Rachel Portman",
               "profile_path": "/AkMflxC3EkbWuyPoltQ406EJvue.jpg",
               "id": 3562,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4330c3a36847f804137f",
               "name": "Andrew Dunn",
               "profile_path": "/vguhffdvBgtxb5Hl08PKZl160en.jpg",
               "id": 8846,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4330c3a36847f8041385",
               "name": "Elizabeth Kling",
               "profile_path": null,
               "id": 21147,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4330c3a36847f804138b",
               "name": "Stephen Alesch",
               "profile_path": null,
               "id": 21148,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4330c3a36847f8041391",
               "name": "Dan Lieberstein",
               "profile_path": null,
               "id": 21149,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4330c3a36847f8041397",
               "name": "Mike Maggi",
               "profile_path": null,
               "id": 21150,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe4330c3a36847f80413bd",
               "name": "Robert Gordon",
               "profile_path": null,
               "id": 41386,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a884cea0e0a2653db056fe2",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.403229,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2058,
      "vote_count": 136,
      "budget": 0,
      "overview": "Good-natured astronomer Sam is devastated when the love of his life, Linda, leaves him for a suave Frenchman named Anton. He therefore does what every other normal dumpee would do; go to New York and set up home in the abandoned building opposite his ex-girlfriend's apartment, intent on winning her back and waiting until she decides to leave her current lover.",
      "similar": [
         3134,
         979,
         9093,
         38,
         1903,
         11121,
         281957,
         1643,
         10575,
         8067,
         316021,
         24420,
         226,
         9769,
         1024,
         281,
         156022,
         238636,
         395834,
         357096
      ],
      "original_title": "Addicted to Love",
      "runtime": 100,
      "poster_path": "/ed6nD7h9sbojSWY2qrnDcSvDFko.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Miramax",
            "id": 53009,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Outlaw Productions (I)",
            "id": 19507,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-05-23",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "A Comedy About Lost Loves And Last Laughs",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Griffin Dunne"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Robert Gordon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118556/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5MjA3ODA3MV5BMl5BanBnXkFtZTcwNTgyNTUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Meg Ryan, Matthew Broderick, Kelly Preston | See full cast and crew »"],
      "reviews": [
         "How did they manage to create such a beautiful film, a pretty love story, when the story is about two nutters spying on their former partners. When you think about what the story is about, and how far Sam (Matthew Broderick) and Maggie (Meg Ryan) are willing to go in order to get back to (and at) their former partners you would think that both should be either jailed or institutionalized. However, Addicted to Love, manages to create a fairly romantic love story out of it, without us ever doubting the sanity behind their actions. Both Matthew and Meg are here in roles they have portrait many times before in other films, while the star of the film is Tchéky Karyo. You end up hating him and loving him at the same time, feeling sorry for him one minute, wishing him all the worst the next. This is crucial to the story, bringing me to the conclusion that it is Tchéky that really makes the whole film work. One could criticize that even though the idea is original, the story isn't, with no unexpected turns or twists along the way. Simple, but pleasant film. 6/10",
         "When you hear the words `romantic comedy', the first thing that springs to mind is some sugary, smiley, big-haired, feather-light Julia Roberts escapade. `Addicted to Love' presents us with the polar opposite to this, even if the premise is pretty the same as you'd find in the usual rom-com. The result is a deft, reckless, amusing and entertaining heavy-handed movie. There isn't much to bicker about here. Meg Ryan and Matthew Broderick show tremendous colour and prove to be likeable characters as the vengeful stalkers. Tcheky Karyo is funny as the clumsy French fool. Kelly Preston is the least convicted of the four main characters, but is still relatively good. The film has its own generally funny slapstick moments that compensate for the lack of verbal wit. The narrative that follows is good enough to keep you wanting more, and the jokes are all very well timed. The title Robert Palmer song adds to the reckless, but endearing epitome of the film. The directing styles aren't amazing, but they're hip and stylish for the most part. Overall, it isn't film of the century and is far from outstanding, but `Addicted to Love' is original, entertaining and very funny for the most part. I give it 6.8 out of 10.",
         "I thought this movie was pretty average as romantic comedies go, and frighteningly similar to Meg Ryan's previous vehicle \"French Kiss\", which saw Kevin Kline playing a Frenchman she falls for, enroute to getting her cheating fiancé back. \"Addicted To Love\" could have easily been the sequel! That aside, my one objection is not only the lack of chemistry between the two leads, but also the fact that we are launched into the action far too quickly. One imagines the writer/director desperate to start the story and not being bothered to establish the relationship between Sam and Linda, before BOOM! She leaves him and Sam is in New York, all within a few minutes and seconds. The credits had barely finished!! I found the character of Maggie difficult to get a grip on. Independent and wilful, one finds it hard to imagine what she sees in the dappy, love-sick puppy, Sam. They are in such completely different leagues. Sam quips that they got together via \"Common interests\", but this is not enough somehow, since the characters really do not have anything in common, despite trying to separate their ex-lovers. **SPOILER WARNING**: In another scene, Sam and Maggie sleep together whilst fantasising that she is Linda and he is Anton. Yet Maggie's justification for sleeping with Sam is not made clear - she hates Anton and frequently says so. If she slept with Sam because she was falling for him this should have been made clearer, since he sleeps with her whilst pretending she is Linda whom he still loves. Although good, perhaps this scene could have been cut as it is confusing and largely irrelevant. The rest of the film was OK, the pranks were cruel but effective. More focus should have been made on the relationship between the two leads.",
         "This generally enjoyable comedy should have been much better than it was, considering all the talent that worked on this film. The problem is, it isn't dark enough to be a dark comedy, but it is too dark to be a romantic comedy. Therefore, some of the revenge seemed too mean-spirited, and some of the sweet moments seemed out-of-place. BUT, even with that big of a problem, I still enjoyed the film. It was consistently funny and entertaining, and Broderick and Ryan both gave good performances. The best performance, however, was by Karyo, and he was probably my favorite thing about this movie.",
         "This is a wretched, wrong-headed little waste of celluloid. Do not be deceived by the film's strange sleight of hand, mis-focusing the audience on Broderick and Ryan. This is actually a story about a young woman (Kelly Preston) from America and an immigrant from France (Tcheky Karyo) who meet in New York and fall in love. Preston, raised in a small town, finally spreads her wings and flies away to the big city in pursuit of her dreams. There she meets Karyo, the man of her dreams, who loves America where he has come to achieve his dreams. Sadly the two of them are dogged by their sicko, stalking ex-lovers who conspire to wreak mayhem upon them and turn their dreams into a nightmare. Broderick and Ryan commit heinous crimes, including invasion of privacy (on multiple levels), stalking, and breaking and entering. They are seriously disturbed voyeurs who generate no chemistry and no sympathy. I was touched only by the steady, true love of Preston and Karyo which even overcomes the sinister machinations of Broderick and Ryan. The film attempts to get the audience to identify with the sickos, instead of the true protagonists of this film. Unfortunately, their characters provide no chemistry and nothing with which I could identify. I just felt compassion for the two objects of their demented malevolence. In a comment thread on this film, someone suggested the film's ending was too pat - that there was too much neat \"resolution.\" To the contrary, this film provides too LITTLE resolution. After the twin menaces of Broderick and Ryan finally depart, were Preston and Karyo able to reconstruct their lives of love and security and promise? Or were they forever reduced to penury as a result of Broderick's and Ryan's conspiracy? The acting in this film is pedestrian except for Karyo, who is quite good. Meg Ryan and Matthew Broderick never come close to portraying 3-dimensional characters - much less, likable ones - or achieving any on-screen chemistry. This is a pitiful excuse for a romance or a comedy or a romantic comedy. Tragically, this film is about two people from disparate backgrounds who, against all odds meet, fall in love and build a dream life only to have it devastated by two contemptuous criminals from their past. There was nothing funny about two deranged, deluded people utterly destroying the lives of two other people who have found love, happiness and success together in the big city. For me, causing misery in the lives of others is a poor basis for comedy.",
         "This is a romantic comedy with a rather hard edge, or, to put it differently, a European-style farce with a too cushy ending. Apparently, this film was conceived as a Meg Ryan vehicle, i.e. as a product suitable for her established screen persona. This was a mistake. The cast choice (and the marketing) make the outcome of the film blatantly obvious and that takes away too much suspense from the viewing experience. Also, the film makers did not have the courage to bring the misfortunes heaped upon Anton Depeaux (played very well by Tcheky Karyo) to their logical conclusion. It's designed as a chick-flick and thus everyone's gotta be happy at the end. A more emotionally ambiguous ending could have turned this into something special.",
         "Better than average plot but not enough to raise it above B-level. I think Meg Ryan's star status worked against her because her cute reputation undercut her tough character. However, she proves that she can do something besides \"bubbly\" and is pretty good in a more edgy role. Tchéky Karyo was excellent as a semi-likable French guy. One common weakness in romantic comedies is that the viewer can't understand why the \"nice girl\" would fall in love with the \"bad guy.\" In this movie, we can she why she loves him and, by the end, we even like him a little too. Good writing and acting. Not Matthew Broaderick's best performance... fairly uneven. He doesn't do \"hopelessly in love\" very well. Broaderick looked great, even when disheveled. For that matter, all the characters look great. Kelly Preston is pure cardboard but it sort of works because three developed characters are probably enough in a Romantic Comedy. The set (the hideout, especially) stole the show. The sound was unusually good for a fluff movie.",
         "This is a great romantic comedy. Meg Ryan is on of the sweetest women in the world and you can't not love her. The story is very clever and funny. Meg Ryan and Matthew Broderick are great and delivers one of the best romantic comedies ever. This movie is really funny at times,but has that serious underline which builds up until the end of the movie. Maybe Meg Ryans best movie yet,beside \"When Harry met Sally\".",
         "\"Addicted to Love\" is one of those films which probably owe their existence to someone in the movie industry noticing a catchy title, thinking it too good to waste on a mere song and then concocting a plot to fit it. \"Pretty Woman\" and \"Sweet Home Alabama\" are other examples which come to mind. Sam, a young astronomer, is devastated when his girlfriend Linda leaves him for another man. This is not an unusual situation, but Sam's reaction is perhaps an unusual one. He gives up his job and moves to New York where he sets up house in an abandoned building opposite the flat where Linda is now living with her new lover, a French chef named Anton. His plan is to keep them under constant observation and wait until they split up. Shortly afterwards, however, another person moves into the old building with a rather similar purpose in mind. She is Maggie, Anton's former fiancée until he dumped her for Linda. The difference between them is that Maggie has no intention of winning Anton back; she merely wants to get revenge on him and will do anything to ruin his life. (Or, as Robert Palmer might have put it,\"Might as well face it, you're addicted to hate\".) The two of them join forces to try and separate the couple but (as anyone familiar with the conventions of romantic comedy will have anticipated) start falling for each other. The film has some similarities with another from the late nineties about a man and a woman who join forces to seek revenge on their respective enemies, the British-made \"The Revengers' Comedies\", based on a stage play by Alan Ayckbourne. The difference is that \"The Revengers' Comedies\" was made as a full-on black comedy whereas \"Addicted to Love\" isn't sure what it wants to be. The basic idea is too screwed-up and creepy to work as a standard rom-com, but the overall tone is too light- hearted and insufficiently cynical for a black comedy. Part of the problem is the casting of Meg Ryan as Maggie. In 1997 Ryan was America's reigning official Girl Next Door, the sweet and wholesome heroine of several romantic comedies such as \"Sleepless in Seattle\" and \"IQ\". Even pretending to have an orgasm in a crowded restaurant, as she did in \"When Harry Met Sally\", did not shake her reputation, at least as far as her screen persona was concerned, of being something of a goody two shoes. Maggie really needed to be portrayed as a, vindictive, half- crazed avenger, the way Helena Bonham-Carter played Karen Knightly in \"The Revengers' Comedies\", but Meg's innocent niceness kept on breaking through at the most inappropriate moments. Matthew Broderick, too, seemed just a bit too much \"Mr. Nice Guy\" for a film like this. Kevin Thomas, the film critic of the Los Angeles Times, said that \"It is exceedingly difficult to find what's funny in the calculated, obsessive, relentless destruction of Anton, especially when he proves to be the most likable and mature of all four of these people\". I wouldn't agree that Anton is likable; in Tchéky Karyo's performance he comes across as arrogant, self-centred and narcissistic. (In other words, your typical average Frenchman as seen by Hollywood. Isn't there a French Anti- Defamation League to counter this sort of stereotyping?) I would, however, agree with Thomas that the revenge exacted upon Anton seems disproportionate to his offences. His main offence, after all, was to dump Maggie, and by the end of the film I was starting to think that he had done so not because he is a selfish bastard but because he had realised just how difficult she would be to live with. The ending seemed wrong as well. A final reunion between Sam and a repentant, chastened Linda might have seemed a bit sentimental, but at least there would have been some psychological and emotional logic to it. The ending we actually have, in which Sam (essentially a gentle soul, if a bit obsessive) ends up with Maggie (borderline fruitcake) makes no sense at all. Linda also seems to be punished beyond her deserts in that after she splits up with Anton she appears to be reunited with Sam only for him to leave her just as cruelly as she once left him. Kelly Preston, however, fades out of the film towards the end, so we never see what emotional effect this has on Linda. (I realised while watching this film that this was the first time I had ever seen Preston act, apart from her brief appearance in \"Amazon Women on the Moon\". Although she appears to have a fairly long filmography, I had previously only thought of her as Mrs. John Travolta). There are occasional amusing scenes, such as the one where Sam and Maggie release a horde of cockroaches in Anton's restaurant, or the one where Maggie's unworldly old grandmother relates what she believes is the plot of a soap opera she has heard on the radio, whereas what in fact she has been listening to is a massive argument between Linda and Anton, whose apartment has been bugged by her granddaughter. Overall, however, \"Addicted to Love\" just doesn't work, largely because the actors and director Griffin Dunne cannot decide whether to play it as a romantic comedy or as a black comedy. Might as well face it, I'm not addicted to this film. 4/10",
         "Addicted to love is a very good movie that speaks about the fact that not all lovers are very sure that they really want each other (You might be thinking of someone else !!!). Starring the very very lovely and beautiful actresses : Meg Ryan & Kelly Preston, The are really good in this movie and I actually loved them a lot. (I think everybody does). Also starring the cutest guy in town : Matthew Broderick. This is an adorable movie that will be remembered."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Outlaw Productions (I)",
         "Miramax"
      ],
      "summaries": [
         "Good-natured astronomer Sam is devastated when the love of his life, Linda, leaves him for a suave Frenchman named Anton. He therefore does what every other normal dumpee would do; go to New York and set up home in the abandoned building opposite his ex-girlfriend's apartment, intent on winning her back and waiting until she decides to leave her current lover. What Sam does not count on is being joined several weeks later by ultra hip tomboy Maggie, a photographer and motor-cyclist who is determined to get revenge on Anton, her ex-fiance. Hostile at first, the two of them eventually join forces in an attempt to separate the couple, and ruin Anton's life. However, complications ensue when Sam and Maggie start falling for each other.",
         "Maggie's and Sam's former partners are in love; she wants revenge and he wants his lost love back, so they work together to break up the happy couple."
      ],
      "budget": 0
   },
   "movielensId": 1541,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-05-23",
      "dvdReleaseDate": "1997-10-23",
      "directors": ["Griffin Dunne"],
      "runtime": 100,
      "movieId": 1541,
      "title": "Addicted to love",
      "mpaa": "R",
      "actors": [
         "Meg Ryan",
         "Matthew Broderick",
         "Kelly Preston",
         "Tchéky Karyo",
         "Maureen Stapleton",
         "Nesbitt Blaisdell",
         "Remak Ramsay",
         "Lee Wilkof",
         "Susan Forristal"
      ],
      "imdbMovieId": "0118556",
      "originalTitle": "Addicted to love",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["cGqJY4hyRfo"],
      "plotSummary": "Good-natured astronomer Sam is devastated when the love of his life, Linda, leaves him for a suave Frenchman named Anton. He therefore does what every other normal dumpee would do; go to New York and set up home in the abandoned building opposite his ex-girlfriend's apartment, intent on winning her back and waiting until she decides to leave her current lover.",
      "tmdbMovieId": 2058,
      "avgRating": 3.11201,
      "releaseYear": "1997",
      "numRatings": 2281,
      "posterPath": "/ed6nD7h9sbojSWY2qrnDcSvDFko.jpg"
   }
}