{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "brass band",
            "id": 1673
         },
         {
            "name": "province",
            "id": 2065
         },
         {
            "name": "music competition",
            "id": 6383
         },
         {
            "name": "yorkshire",
            "id": 9180
         },
         {
            "name": "music band",
            "id": 41591
         }
      ],
      "imdb_id": "tt0115744",
      "video": false,
      "title": "Brassed Off",
      "recommendations": [
         8545,
         37345,
         142946,
         37315,
         16902,
         46435,
         24782,
         11663,
         8435,
         88768,
         17450,
         106038,
         147050,
         62839,
         104697,
         87197,
         78146,
         111469,
         37146,
         106808
      ],
      "backdrop_path": "/85tRmUvCpVpbucZzblt1jwSn391.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "53aeacf20e0a265983004454",
         "content": "Land of bloody hope and glory eh!\r\n\r\nGrimley Colliery Brass Band has been going for nigh on a century, but as the town's colliery itself comes under threat of closure due to the drawn out miners strikes, so does the bands very own survival. Giving much relief to a very depressed area, the band are hoping to make the grand finals day at the Royal Albert Hall, could the arrival of Flugelhorn player, Gloria, be just what the band needs? Or is she merely the catalyst to something far more critical?\r\n\r\nBrassed Off is the first of what I personally call the Magical British Trio, three films that perfectly portray the British sense of humour during dark depressing times of unemployment. The other two of course are The Full Monty (1997) and Billy Elliot (2000), of which Brassed Off is essentially an appetiser of sorts, the warm up act for the big hitters so to speak. Not to say that Brassed Off is not worthy to sit alongside those well received pictures (home and abroad as they say), it most certainly is, it's just that its blend of humour and strife doesn't find any easy ground, thus making it hard for the undiscerning viewer to be at ease at the right moments. It is in short, unsure of what it primarily wants to be. The humour does work well tho, but it's in the dramatic core of the miners strikes, and the affects they have on the denizens of this quaint colliery town, that Brassed Off truly works, with some scenes literally tugging away at the old heart strings. Then there be the music itself, The Grimethorpe Colliery Band {on whose real life story this film is based} provide the music for the soundtrack, and its most enjoyable, often stirring, and definitely poignant at crucial moments.\r\n\r\nThe cast are tremendous, Ewan McGregor and Tara Fitzgerald offer up splendid youthful heart, but they are playing second fiddle (or should that be third brass section?) to Pete Postlethwaite and Stephen Tompkinson. As father and son, Postlethwaite and Tompkinson give the film its deep emotional being, each driven by differing needs, Brassed Off's success rests with both men being able to hold the viewers attention from the get go. Tompkinson has made a very profitable and thriving career in British Television, and rightly so, but it remains criminal that he didn't go on and make more well known and profitable full length feature films after his fabulous turn here. Filmed in the ideal Northern English town of Barnsley, South Yorkshire, Brassed Off is a film that has evident problems, but to someone like me, a Brit who lived thru those depressing days under Margaret Thatcher's government, it's a film that I love for a myriad of reasons, one can only hope that one of those reasons strikes a chord with yourselves.\r\n\r\nA completely biased 9/10 from me!",
         "url": "https://www.themoviedb.org/review/53aeacf20e0a265983004454"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b517b",
               "name": "Pete Postlethwaite",
               "profile_path": "/5nbSzrwyDcLhC15buncGdrQqJ8e.jpg",
               "id": 4935,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe44f9c3a36847f80b517f",
               "name": "Tara Fitzgerald",
               "profile_path": "/qpS1nff6LgwbWXzS14qsmW6YIOi.jpg",
               "id": 47615,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Andy Barrow",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b5183",
               "name": "Ewan McGregor",
               "profile_path": "/aEmyadfRXTmmR7UW7OXsm5a6smS.jpg",
               "id": 3061,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Phil",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b5187",
               "name": "Stephen Tompkinson",
               "profile_path": "/bLipr0PK3R3KjbakBcGVSF4N4xb.jpg",
               "id": 47629,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b518b",
               "name": "Jim Carter",
               "profile_path": "/ycS14B6YHA2k4IlEPNgh0eQOv7u.jpg",
               "id": 20070,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Jim",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b518f",
               "name": "Philip Jackson",
               "profile_path": "/7SWbGBb0FUWvsS0j95kuNsfRWCg.jpg",
               "id": 25532,
               "order": 5
            },
            {
               "cast_id": 28,
               "character": "Ernie",
               "gender": 0,
               "credit_id": "599a184fc3a3683964006750",
               "name": "Peter Martin",
               "profile_path": null,
               "id": 1231840,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Vera",
               "gender": 1,
               "credit_id": "52fe44f9c3a36847f80b5197",
               "name": "Sue Johnston",
               "profile_path": "/szj85zAr85La2DQeloIqLovMyq9.jpg",
               "id": 21553,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Sandra",
               "gender": 1,
               "credit_id": "52fe44f9c3a36847f80b519f",
               "name": "Melanie Hill",
               "profile_path": "/tE0vWMofdPASlzE3yminUQxhhQg.jpg",
               "id": 207295,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe44f9c3a36847f80b51a3",
               "name": "Lill Roughley",
               "profile_path": null,
               "id": 178022,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Simmo",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b51a7",
               "name": "Peter Gunn",
               "profile_path": null,
               "id": 83548,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Greasley",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b51af",
               "name": "Kenneth Colley",
               "profile_path": "/yNZF27tBauzUcg6Fw7M2xsRD8IC.jpg",
               "id": 10734,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Mrs. Foggan",
               "gender": 0,
               "credit_id": "52fe44f9c3a36847f80b51b3",
               "name": "Olga Grahame",
               "profile_path": null,
               "id": 1000768,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Chapman",
               "gender": 0,
               "credit_id": "562ebf42925141284500b0ce",
               "name": "Bernard Wrigley",
               "profile_path": "/ymAtIv3TR2uDoHBsp8f9USbJj3Y.jpg",
               "id": 1121491,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Heavy 1",
               "gender": 0,
               "credit_id": "562ebf49c3a3681b5900b9dd",
               "name": "Ken Kitson",
               "profile_path": null,
               "id": 1236129,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Heavy 2",
               "gender": 0,
               "credit_id": "58498f7392514119af013e38",
               "name": "Adrian Hood",
               "profile_path": "/nPsBeOVSbpcx3OjKx23R5t01rbv.jpg",
               "id": 1355642,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Ida",
               "gender": 1,
               "credit_id": "57dcef1a92514179a2003398",
               "name": "Mary Healey",
               "profile_path": null,
               "id": 133668,
               "order": 16
            },
            {
               "cast_id": 27,
               "character": "Ward Sister (as Sally Adams)",
               "gender": 0,
               "credit_id": "58498f8892514119b601409d",
               "name": "Sally Sheridan",
               "profile_path": "/zOvhZ8mWroMnxFEKJ2RyamV4Rn3.jpg",
               "id": 214463,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44f9c3a36847f80b5153",
               "name": "Mark Herman",
               "profile_path": "/osC1Og8IZukau6QnPfXJN0EHsNC.jpg",
               "id": 55299,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f9c3a36847f80b5159",
               "name": "Mark Herman",
               "profile_path": "/osC1Og8IZukau6QnPfXJN0EHsNC.jpg",
               "id": 55299,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b515f",
               "name": "Steve Abbott",
               "profile_path": null,
               "id": 8931,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f9c3a36847f80b5165",
               "name": "Olivia Stewart",
               "profile_path": null,
               "id": 58033,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f9c3a36847f80b516b",
               "name": "Trevor Jones",
               "profile_path": "/86HjonjMXwcDyOlpaQW1SVR9CXh.jpg",
               "id": 7020,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f9c3a36847f80b5171",
               "name": "Andy Collins",
               "profile_path": null,
               "id": 45437,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b5177",
               "name": "Michael Ellis",
               "profile_path": null,
               "id": 28841,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.173439,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9450,
      "vote_count": 75,
      "budget": 0,
      "overview": "A small Yorkshire mining town is threatened with being shut down and the only hope is for the men to enter their Grimley Colliery Brass Band into a national competition. They believe they have no hope until Gloria appears carrying her Flugelhorn. At first mocked for being a woman, she soon becomes the only chance for the band to win.",
      "similar": [
         525,
         369557,
         5723,
         9591,
         1584,
         824,
         7443,
         10112,
         114150,
         254470,
         15121,
         354912,
         630,
         339403,
         5123,
         6477,
         11031,
         533,
         5708,
         27586
      ],
      "original_title": "Brassed Off",
      "runtime": 107,
      "poster_path": "/kyPCqLAexOhPr0LV4yXvKlJ68cC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Prominent Features",
            "id": 11352,
            "origin_country": ""
         }
      ],
      "release_date": "1996-11-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Herman"],
      "runtime": 107,
      "synopsis": "During the opening credits a brass band plays Death or Glory as the grimy coal miners return from the depths of the earth at the conclusion of their shift and head for their locker room to shower the coal dust from their bodies (but not from their lungs). As they leave the colliery, they wave at their neighbors who are keeping vigil outside the mines property protesting the anticipated closure of the pits. As the music ends Gloria Mullins (Tara Fitzgerald) enters a boarding house, The Lantern, with her luggage. The house-lady notices Gloria is carrying a horn case a flugelhorn which she calls a flugel. She had hoped to do some practicing. Not wanting her to disturb her other boarders, the house-lady suggests Gloria find the Grimley Colliery Bands rehearsal hall. She is certain the band would welcome a lovely young lady. Gloria has been sent to her old hometown by the British Coal Board to prepare a report on the Grimley mine. In the next scene, Vera (Sue Johnston) and Ida (Mary Healey) talk about their husbands, Jim (Philip Jackson) and Ernie (Peter Martin), playing in the band again. One laments if the pit closes the band will also fold. Jim and Ernie, a couple of tuba players, head for band rehearsal, but agree to tell Danny (Pete Postlethwaite), the groups director, that under the current economic conditions they cant afford the bands dues, so they will resign. Dannys son, Phil (Stephen Tompkinson), a trombonist in the band, is badly in debt and his wife, Sandra (Melanie Hill), hounds him to take the redundancy money that is being offered like others have done in other coal mining communities. Phil makes a little extra money as Mr. Chuckles, the clown, at birthday parties. His father picks Phil up on his bicycle on the way to band rehearsal. On the way, Danny sings his part to The Floral Dance and when they arrive, the band rehearses the piece. When the number concludes, Danny berates the groups playing as a load of bloody crap. The players contend their minds are distracted by the threat of the pit closing you cant have a colliery band without a colliery. Just as Danny is passing the hat for the weekly dues, Gloria walks through the door of the rehearsal hall. She tells them the lady at the boarding house had suggested they might let her practice with them. Danny politely tells her they dont allow outsiders, but Gloria responds that she is originally from Grimley and her grandfather was a former conductor of the band. Under those circumstances, she is welcome to rehearse with the group. She sits next to Andy (Ewan McGregor), but apparently doesnt immediately recognize him as one of her former romances. The flugel she plays is inherited from her grandfather. Danny cant wait to hear it played again and asks what she knows. She has been practicing Rodrigos Concerto Aranjuez (Concierto de Aranjuez), so they immediately rehearse the number with Gloria as soloist (dubbed by Paul Hughes). At the end of the piece everyone is suitably impressed. Jim and Ernie give in and contribute their dues. Later, their wives are convinced their husbands change of heart is due to a beautiful young woman joining the band. Gloria is invited to join the band for fourteen contests in fourteen villages the following day. It is a chance for the band to make some money towards their expenses. The next day as Danny is preparing to leave, he has a coughing attack and spits up blood the first sign of pneumoconiosis or what is more commonly known as black lung, an affliction caused by inhaling coal dust for many years. At a union meeting, Phil complains that he was one of the strikers back in 1984, and as a result, he was suspended. It took a year and a half to get reinstated. He hasnt been able to get out of debt in the decade since. The workers must vote the following week on whether to accept the redundancy offer or for a review procedure, which is the option their union representatives are pushing. They feel thats the only chance to keep the pit open. When the band arrives at the first village, all the bands march through the town playing March of the Cobblers. The winner of the competition at Dobcross is the Yorkshire Building Society Band, so the Grimley group moves on to Uppermill Village; the winner there is Delph Band. At Diggle the winner is Fairleys Band; at Lees it is Brighouse & Rastrick Band, and things get worse for Grimley. Ernie, who like the others has downed several beers, plays behind the beat and Phils ancient trombone comes apart. (The same music continues throughout this entire sequence.) Back in Grimley, Danny reprimands the players for their lackadaisical attitude towards the band and its history of excellence. He is certain if they play up to their potential they can win the regional competition and advance to Royal Albert Hall in London for the finals. During this meeting, Harry (Jim Carter), one of the euphonium players, speaks for the other members: they will agree to continue with the band until the pit closes, but when that happens they will pack it in. After everyone else has left the practice hall, Phil returns to give his father some reassurance. Danny encourages him to purchase a new trombone to replace his instrument that keeps falling apart, but Phil cant afford a better instrument. During their conversation, Phil notices his fathers bloody handkerchief and recognizes the sign. When Andy and Gloria go to dinner together at In Cod We Trust Andy confronts Gloria that she works for management. She claims she wants the pit to remain open and can help the situation with her report. He is skeptical that her report will do any good: Its just a bloody PR exercise. Theyve already made their decision while you were at bloody college. However, the two of them reconcile their differences. Later as he is walking her home, she admits is remembered him but didnt want him to think he was etched forever on her brain. Then, she invites him up for some coffee he doesnt drink coffee and she doesnt really have any coffee to offer. The following sequence shows Andy and some other lads going to work, Gloria working on her report, the miners voting, scenes down in the dingy depths of the mine, and some workers returning from the mine and bathing to rid themselves of layers of coal dust. Gloria asks her boss if her report is immaterial, but he assures her that it is vital, especially if the workers vote for review. Soon, some of the other band members notice managements logo on Glorias key ring and accuse Andy of screwing management its about time, they say, management has been screwing them for years. Next, we see Phil as Mr. Chuckles at a childrens birthday party. He isnt a very good clown and most of his tricks go awry. He uses the money he makes to purchase a used trombone at a pawn shop, but when he arrives at home, some men are repossessing their TV set. If he doesnt pay what he owes, they threaten to return with a truck and repossess the entire contents of his house. Phil fights one of the men and ends up with several scrapes and cuts. When Sandra realizes Phil has purchased a trombone when they dont have enough money for food, she is speechless. As the band loads onto the bus for the next competition, Andy wont speak to Gloria. The next competition is the Yorkshire Area Qualifying Contest for the National Brass Band Championship. The band plays Florentiner March and they win! During their performance the film shows Sandra finding the ticket where Phil had paid $50 towards the trombone, but still owes $250. We also see the announcement of the vote results at the mine, which were overwhelmingly for redundancy and Glorias boss smiling when he receives a phone call about the vote. True to their word, the men return with a truck to repossess the contents of Phils and Sandras house. When the band returns to Grimley, they see funeral wreaths and crudely painted signs like We Fought and Lost. To make matters worse, Danny collapses as he is walking home and is taken to the hospital. Ernie makes it plain to Gloria that the band members, including Andy, dont want her around. Then matters get even worse for Phil; he arrives home just in time to see Sandra leaving with their four children. As Danny lies semi-conscious in his hospital bed, the band gathers on the hospital lawn to serenade their colleague with a beautiful arrangement of Danny Boy. Andy, who had lost his horn playing pool, whistles his part. When the serenade ends, a nurse tells them Danny is conscious, so several of his best buddies visit and present him with a new conducting baton. The next day Gloria confronts her boss again. She questions if her reports that will never be read or considered. She also claims the Grimley pit has been profitable. And, she wonders if the decision to close the mine had been made weeks earlier. When her boss admits the decision was made two years ago, she throws her report at him and stalks out of his office. When she tells Andy that she told management to stuff it and is as unemployed as he is, he admits her heart was in the right place, but still cant get past her working for management. He also tells her the band isnt going to the National Finals because it costs too much. Later Phil goes to the hospital, but when his father gives him the manuscript of a new arrangement he had stayed up all night writing, he doesnt have the heart to tell him the band had broken up. To make a little money, Phil appears as Mr. Chuckles at a Harvest Festival party for children at a church, but, in one of the films darkest scenes, he scares the children by ranting about the Tories and Margaret Thatcher. He says, So God was creating man. And his little assistant came up to him and he said: Hey, weve got all these bodies left, but were right out of brains, were right out of hearts and were right out of vocal cords. And God said Smack smiles on the faces and make them talk out of their arses. And lo, God created the Tory Party. Later, Phil, still dressed in his clown outfit, attempts suicide by hanging himself from the mines riggings. Even though Danny was half asleep, he recognizes Mr. Chuckles huge clown feet as Phil is rolled past his room. Danny immediately gets out of bed to see what had happened. When he asks Phil why he attempted to kill himself, he explains he has lost everything: his wife, kids, job, and self-respect. During this conversation, he finally finds the guts to tell his father that the band members have packed it in. The next day while several of the band members are drinking beer and talking about breaking Dannys heart, Gloria enters the pub and presents them with a $3,000 bank account to pay for the trip to the National Finals. Andy quickly wins back his horn in a pool match and Phil leaves a note for his father at the hospital: Were Going. The entire village turns out to see the band off to London. During the bus trip into London and their arrival at Albert Hall, we hear Clog Dance. Just as the band is preparing to play at Finals, the nurse discovers that Danny has left the hospital. Harry conducts the band in the competition as they play a stirring rendition of the William Tell Overture. About half way through the number, Danny appears behind the band and Harry calls Phils attention to his father (Phil also notices his wife and children in the audience). Grimley is announced as the winner. Danny steps forward and tells the audience they are refusing the trophy. As much as he thought winning the trophy and music were the most important things, hes discovered that its human beings that matter. He berates the government that over the last ten years has systematically destroyed an entire industry. Our industry! And not just our industry our communities, our homes, our lives. All in the name of progress. And for a few lousy bob. As they leave the stage, even though Danny had said they were refusing it, Harry retrieves the trophy. During a celebratory double-deck bus ride through the streets of London, Gloria accuses Yorkshire men of hiding their feelings, so Andy takes the challenge and kisses her. As they pass the parliament building, Danny says, Lets make them listen for a change. Land of Hope and bloody Glory, eh? (Sir Edward Elgars Pomp and Circumstance). From the top of the bus the band plays an emotion packed rendition of Pomp and Circumstance, which continues during the closing credits.",
      "writers": ["Mark Herman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115744/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMzg2NTk1OV5BMl5BanBnXkFtZTcwMzYxMDMyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Pete Postlethwaite, Tara Fitzgerald, Ewan McGregor | See full cast and crew »"],
      "reviews": [
         "You don't have to be a fan of brass bands to enjoy \"Brassed Off\", but it couldn't hurt. The music is a central focus of the film, but not as a compromise to the story of a town in turmoil. Coal mines being shut down in the name of progress puts many men out of work which naturally also jeopardizes the existence of the colliery band. The music combined with brilliant storytelling (and editing) is merely a platform for some superb acting, particularly from Pete Postlethwaite. Having lived all my life in a large metropolitan city, I cannot relate first hand to the plight of a small town community. Despite that, I found the story intriguing even though it may seem the outcome is somewhat predictable. Having just purchased the DVD, I found the brief write-up on the box to be way off the mark. It touts this film as some kind of romantic and hilarious comedy, never once even grazing past the real subject matter of the film. This is another perfect example of the continued miscalculated promotion of a truly well crafted film that \"Muriel's Wedding\" also fell victim to. I'm not sure what the promoters were thinking, but if you set someone up for a hilarious romantic comedy and what they receive is a thoughtful serious and sometimes depressing film, are they going to be happy just the same? There are graciously some light moments and humourous turns in this otherwise sombre subject matter, but this film doesn't have a happy ending. But it sure does have a moving one. Postlethwaite's performance hits you in an unexpected way and you'd have to have a heart of stone to not be moved by it. Any success that the film enjoys now that's it's strictly on video, is likely to come from very strong word of mouth. I had been told how good it was and enjoyed it immensely. Now that I've seen it twice, and thus been twice moved, I wait for a reasonable time to pass so that I may watch and enjoy it again as I am bound to do.",
         "I was lucky enough to catch this movie in the theater and still luckier to come across it again on video. How anyone can call it a comedy is beyond me. Yes there are some laughs, but there are far more tears; some of pain, some of joy. This is a drama with a sense of humor. You have to keep a sense of humor to survive when life kicks you in the gut. I've read some reviews condemning the politics of this film. Well, I applaud the political message. I grew up near an industrial town; one centered on the auto industry, heavy machinery, and agri-business. As I got older, I watched it disintegrate, through the 70's and 80's, as the grain embargo, auto industry woes and recession bled the life out of the town. It has never recovered. Many of us felt that Reagan and Thatcher, and their descendants, were monsters who sold their people out for a quick buck; while the parties that were supposed to represent the workers and middle class joined in the takings. To us, this isn't an anti-Thatcher film; it's the truth. The performances of this film, particularly Pete Postlethwaite and Stephen Tompkinson, as well as Ewan McGregor and Tara Fitzgerald are top notch. There is a sweet and painful romance here; but it is the community of the miners, through the life of the band, that is the center here. The music is beautiful and will move you. The piece played as the pit closure is finalized stirs so many emotions. The rendition of \"Danny Boy\" brings tears to your eyes. The review in our local alternative paper said the surprise near the end would reduce even the hardest heart to tears, and they were right. There is so much to see and love about this film, regardless of your political beliefs. Music does matter, but the people who create it matter, too. Communities matter, love matters. This is what good filmmaking is all about. See this film. You'll laugh a bit, cry a lot, get angry, become sad; but, you'll never be bored.",
         "This is British Cinema at its very best and has been my favourite film of all time since I first saw it on the big screen. I cannot think of two more powerful performances committed to celluloid than those of Peter Postlethwaite and Stephen Tompkinson. There is so much emotion in \"Brassed Off\" that anyone who fails to be moved must have a heart of stone...if indeed they have a heart at all. People I know (or reviews I have read) that didn't like the film have criticised the intense political messages within it, but in my opinion these folk are missing the point entirely. It's true that there is a fierce undercurrent of anti right wing leaning running through the movie, but to portray the characters any other way would be factually inaccurate. Some may view Thatcher as a Saint, but characters like those in Brassed Off can only ever view her as an evil tyrant. Anyway I'm going off on a tangent now. My point is this: Brassed Off is a very humane picture that paints a picture of early eighties folk who have been robbed of their livelihood, yet still manages to be funny, charming, heartwarming, heartbreaking and uplifting at the same time. A truly wonderful film.",
         "A superb film. A film which did not seek to glamourise the effect of long term unemployment and the break up of communities. And a film which WAS based very closely on a true story. The band members you see actually playing the music? That's the Grimethorpe Colliery Band, winners of the national Battle of the Bands competition in the year that the colliery closed down. And they did turn professional too! Films like Brassed Off, which seek to present a view of a sensitive issue, are often derided for not offering a solution which can be written on the back of a cereal box. Personally, I take that as a recommendation! The point of the film is this: put people in situations that most of us will happily never face, and they react in extreme fashions. There was little or no 'political' argument, other than the fact that the Conservative Government of the time did destroy an entire industry. That same government them spent millions of pounds a year buying coal from Europe and South America. Angry? I would be. I saw characters portrayed in their entirety, which meant 'scabs' and 'sellouts' rubbed shoulders with the committed and poor. I saw unflattering portraits of basically decent people, prepared to risk friendships and relationships to keep alive an industry which was killing them but without which they could not live. It was a desperate time, and the fact that families have been split since the 1984 strike shows just how deep feelings can run on this issue. And I saw no skipping over the holes in the logic either. No mention of the 4-1 vote in favour of closing the mine? Half of the chuffing film was about that! What about the fate of Gloria's report? What about Phil, a striker from 1984, voting for closure? Did no-one notice that he was one of the major characters? I do think that there were some problems with the structure of the film (although it was dramatically more satisfying than the Full Monty). Gloria was unconvincing; the wives were underused, and the speech at the end, yes, I found it embarrassing too! But please, before you attack the veracity of such a rounded and honest film as Brassed Off, take the time and trouble to watch it properly first!",
         "Why did I say that? Because most of the negative comments come from right wing liberal haters who have entirely missed the meaning behind the film. I even read one which announced \"keep politics out of my entertainment\"!!! Sorry, but the story is based around real events & the politics of the miners & the times are an integral part of that story. One poster (from Scotland who should have known better) stated : \"I think the problem I have is this film really plays up to the clichéd northern stereotypes it's almost offensive , the male characters all work down the pit , play in a brass band etc that it's impossible to believe in them as real human beings.\" It was a colliery band - of course all the male band members worked down the pit - that was the crux of the story. And why does working down a pit & playing in a brass band diminish you as a real human being? According to a poster from Yorkshire, who lived through the pit closures, it was VERY true to the times. Mr Scotland is being a bit elitist I think. I'm an Australian who cringes (&, if comedy, laughs) at the depiction of the stereotypical Aussie (think \"Kath & Kim\" if you get it over there) but that's only because I'm not one. However, the country's filled with them!! It was a magnificent & moving film which captured the essence of the Thatcher years of destruction. If your not familiar with the period then do yourself a favour & read a bit about the history behind the pit closures etc before you watch this film - you'll enjoy it a whole lot more. For you fellow Greenies out there, yes, I agree coal mining must cease but you don't go and pull the safety net away from a community without having something else to take its place. BTW. the closures didn't lower the use of fossil fuels anyway - the UK just started to import coal instead.",
         "'Brassed Off' came at just the right time for British politics, just as the death knell for the Conservative Party as the main political force sounded; the story fictionalises the troubles of the real-life Grimethorpe Colliery Band (who you hear playing the great brass band tunes throughout). There are pit closures all over Yorkshire, and 'Grimley' Band has one last chance to triumph in the various band contests to end up playing at the Royal Albert Hall. This being drama of course the path to victory isn't a smooth one - there is bankruptcy, illness, broken marriages, and a clash with the new executive power (represented by Tara Fitzgerald, also taking a place in the band for her father). Romantic interest for Tara is present in cute Ewan McGregor - an unusually quiet role for him. Say what you like about the way this film portrays the North of England, there is no denying the power of the final sequences as the triumph of 'William Tell' turns into Postlethwaite's power rant against the Government and into the trip home's 'Land of Hope and Bloody Glory'. It really couldn't have been done better.",
         "This film has everything: Humour. Poignancy. A message. Human characters. Warmth. A great cast and good story. Interesting locales. Creative techniques. (Watch for the clown scenes and especially the one in the playground.) \"Brassed Off\" was (and is) a powerful editorial indictment of the Thatcher government of the time. Yet it does not preach other than in the opening and closing credits which are pithy and innovative. Anytime you see something with the Channel Four label on it, you know it will be interesting, provocative and a little different. They outdid themselves on this.",
         "I have seen Brassed Off many times, I do in fact own it, and every time I watch it it never fails to move me. There are certain moments that stick out to me as either breath taking or harrowing. 1) That famous 'Concierto d'Aranguez' scene. The first time I saw this scene it took my breath away, literally. When used well music can move you in a way words can't. The juxtaposing of this piece of music against the union's meeting is one of them. I haven't been this moved by a piece of music with actions since then apart from the Roxan sequence in Moulin Rouge. 2) The scene where Phil loses it when playing Mr Chuckles I actually can't sit through. I have to fast forward because the emotion the Stephen Tompkinson manages to portray is so strong it's painful to watch. Through all of this though I think my favorite scene, the aforementioned 1) excluded, is when they compete in all 14 tournaments and get completely rat arsed. The sight of these brilliant musicians trying to continue playing when they can't see straight, stop laughing, or keep their instruments in one piece is one of the most honest, amusing and humble moments in a film in recent years. there is no flashy camera work, no deeper meaning, just something that says exactly who these people are. Ordinary human beings, not super-heros, and just trying to live life whilst having fun in difficult circumstances. And you really can't play wind instruments drunk, I've tried. The film is not perfect. It is a bit preachy, especially the end. And McGregor's accent, although he plays the part beautifully, does slip at time, especially in his longer speeches. But the humanity of the film and it's charm out way all of it's faults.",
         "Director is Mark Herman but the movie themes remind Ken Loach and its stories about people losing jobs but keeping their dignity... Basically everything is inspired by events that really took place over Margaret Thatcher Government (when the film is set). Miners living in a Yorkshire small town (Grimley), when laid off, try to continue the activity of their band, though sadness due to economic repression is a real threat to it. But Ewan McGregor and Pete Postlewait (who on earth might forget him after \"In the name of the father\"?) are really powerful, two thumbs up. Altogether I really appreciated the way this film tells of fight for self-respect and courage.",
         "Grimley Colliery Brass Band has been going for nigh on a century, but as the town's colliery itself comes under threat of closure due to the drawn out miners strikes, so does the bands very own survival. Giving much relief to a very depressed area, the band are hoping to make the grand finals day at the Royal Albert Hall, could the arrival of Flugelhorn player, Gloria, be just what the band needs? Or is she merely the catalyst to something far more critical? Brassed Off is the first of what I personally call the Magical British Trio, three films that perfectly portray the British sense of humour during dark depressing times of unemployment. The other two of course are The Full Monty (1997) and Billy Elliot (2000), of which Brassed Off is essentially an appetiser of sorts, the warm up act for the big hitters so to speak. Not to say that Brassed Off is not worthy to sit alongside those well received pictures (home and abroad as they say), it most certainly is, it's just that its blend of humour and strife doesn't find any easy ground, thus making it hard for the undiscerning viewer to be at ease at the right moments. It is in short, unsure of what it primarily wants to be. The humour does work well tho, but it's in the dramatic core of the miners strikes, and the affects they have on the denizens of this quaint colliery town, that Brassed Off truly works, with some scenes literally tugging away at the old heart strings. Then there be the music itself, The Grimethorpe Colliery Band {on whose real life story this film is based} provide the music for the soundtrack, and its most enjoyable, often stirring, and definitely poignant at crucial moments. The cast are tremendous, Ewan McGregor and Tara Fitzgerald offer up splendid youthful heart, but they are playing second fiddle (or should that be third brass section?) to Pete Postlethwaite and Stephen Tompkinson. As father and son, Postlethwaite and Tompkinson give the film its deep emotional being, each driven by differing needs, Brassed Off's success rests with both men being able to hold the viewers attention from the get go. Tompkinson has made a very profitable and thriving career in British Television, and rightly so, but it remains criminal that he didn't go on and make more well known and profitable full length feature films after his fabulous turn here. Filmed in the ideal Northern English town of Barnsley, South Yorkshire, Brassed Off is a film that has evident problems, but to someone like me, a Brit who lived thru those depressing days under Margaret Thatcher's government, it's a film that I love for a myriad of reasons, one can only hope that one of those reasons strikes a chord with yourselves. A completely biased 9/10 from me!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Miramax",
         "Prominent Features"
      ],
      "summaries": [
         "In existence for a hundred years, Grimley Colliery Brass band is as old as the mine. But the miners are now deciding whether to fight to keep the pit open, and the future for town and band looks bleak. Although the arrival of flugelhorn player Gloria injects some life into the players, and bandleader Danny continues to exhort them to continue in the national competition, frictions and pressures are all too evident. And who's side is Gloria actually on?",
         "A small Yorkshire mining town is threatened with being shut down and the only hope for the town's men is to enter their Grimley Colliery Brass Band into a national competition. They believe they have no hope until Gloria appears carrying her Flugelhorn. At first mocked for being a woman, she soon becomes the only chance for the band to win. In joining the band she puts her relationship with her childhood sweetheart Andy on the line.",
         "The coal mine in a northern English village may be closing, which would also mean the end of the miners' brass band."
      ],
      "budget": 0
   },
   "movielensId": 1542,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-01",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["Mark Herman"],
      "runtime": 107,
      "movieId": 1542,
      "title": "Brassed Off",
      "mpaa": "R",
      "actors": [
         "Pete Postlethwaite",
         "Tara Fitzgerald",
         "Ewan McGregor",
         "Stephen Tompkinson",
         "Jim Carter",
         "Philip Jackson",
         "Peter Martin",
         "Sue Johnston",
         "Melanie Hill",
         "Lill Roughley",
         "Peter Gunn",
         "Kenneth Colley",
         "Olga Grahame",
         "Bernard Wrigley",
         "Ken Kitson",
         "Adrian Hood",
         "Mary Healey",
         "Sally Sheridan"
      ],
      "imdbMovieId": "0115744",
      "originalTitle": "Brassed Off",
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["_b4zPoleN28"],
      "plotSummary": "A small Yorkshire mining town is threatened with being shut down and the only hope is for the men to enter their Grimley Colliery Brass Band into a national competition. They believe they have no hope until Gloria appears carrying her Flugelhorn. At first mocked for being a woman, she soon becomes the only chance for the band to win.",
      "tmdbMovieId": 9450,
      "avgRating": 3.57077,
      "releaseYear": "1996",
      "numRatings": 2275,
      "posterPath": "/kyPCqLAexOhPr0LV4yXvKlJ68cC.jpg"
   }
}