{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0118964",
      "video": false,
      "title": "The Designated Mourner",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe4abac3a368484e163ad9",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Judy",
               "gender": 1,
               "credit_id": "52fe4abac3a368484e163add",
               "name": "Miranda Richardson",
               "profile_path": "/kTs3t6pnO3zR7WYSVYzQfJ9yKMW.jpg",
               "id": 8436,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4abac3a368484e163ad5",
               "name": "David Hare",
               "profile_path": null,
               "id": 8403,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "595d0c8b9251410c5606ebae",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.387801,
      "production_countries": [],
      "id": 125021,
      "vote_count": 2,
      "budget": 0,
      "overview": "Jack and Judy are husband and wife, and Howard is Judys father. They live in some fictional undemocratic and repressive country, and tell us a story about their lives, mostly from Jack's point of view.",
      "similar": [],
      "original_title": "The Designated Mourner",
      "runtime": 94,
      "poster_path": "/ygEvgamjD6ghRPjSqy8WgJFCvbc.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1997-05-23",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Hare"],
      "runtime": 94,
      "synopsis": "The story is told in a series of monologues, shifting from one character to the next. The tone of the piece is conversational and direct, giving the audience the feel that they are listening to these characters at a dinner party. The subject matter is at times somber and melancholy; but in the hands of Nichols, who is charming and engaging, an endearing, world-weary humor finds its way into the material which becomes both entertaining and poignant as we slowly realize the fate of their small social group of intellectuals, who are first watched by the the government; and then later imprisoned (presumably for their political views). By observation the audience realizes that the complacency and comfort this group of educated prominent citizens feel about their place in society has been an illusion, as their political freedom slowly slips from their grasp, as the government becomes more onerous and suspicious. Finally, we learn the significance of the title; and the theme of the play resonates with the audience as we find ourselves considering our own social group within the mass of all human society; ultimately we realize the transient nature of all cultural, religious, and ethnic identity over extended periods of time; and with the passing of each generation the last surviving individual of a group bears the responsibility to grieve and mark the passing into oblivion of his tribe, whether it be religious, ethnic, intellectual, artistic or political. At the conclusion of this thought -provoking play I found myself thinking of the Soviets in Russia, or Castro's Cuba, or the European Socialists or Marxists, the Mayan civilization, or the great Apache warriors of the American west, all of whom recede quietly into the great oblivion of human history.",
      "writers": [
         "Wallace Shawn",
         "Wallace Shawn"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118964/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2NDE5NjY4MV5BMl5BanBnXkFtZTcwNzkzNDIyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Mike Nichols, Miranda Richardson, David de Keyser | See full cast and crew »"],
      "reviews": [
         "This is a tough one. I couldn't decide if I should continue to patiently listen to the rest of this film or shoot myself in the head. Listening to this sea of blathering words, sometimes flowing other times ejaculating out of the actors mouths is a very trying experience. This film features the mental masturbation of of 3 actors, but mainly Mike Nichols. It seems to intend to reveal and exercise the motives and experience of human existence. However it had me rolling my eyes with annoyance at the implied self-importance, grandiose style imagery, pompous \"dry\" humor had me spinning on the floor with boredom. And on a very personal note, Mike Nichols verbalization of his 'erotic' impressions were downright creepy to me as a woman. He's that prototypical rich, successful old man who has always been deferred to and given positive attention from woman for their own practical reasons. But in his egotism he deludes himself into believing HE is what they admire rather than the money and power. So the Lothario, yet in reality, couldn't please a woman with a 10\" vibrator and a million dollars in cash. Yet we have to listen endlessly to his sexual imagery that would turn-off a cat in heat. I am going to go load my gun now.",
         "I remember seeing this film at the theatre and hoping to God that it would end soon, really soon. The film has no action or interaction what-so-ever. The characters are only speaking into the camera, telling you the story of the film. I would say this is along the lines of the theatre of the absurd, like Ianesco, but unlike Ianesco, I was not able to visualize what the characters were relating. I think it was because they were staring me straight in the face. That, and Mike Nichols has that face you can't take seriously. Especially when he is talking about masturbation and crapping on people's writings. He should stick to directing. In all fairness, the last scene in the movie was really moving and gave me goose bumps. Unfortunately, I waited for what seemed like years for this to happen. Honestly, I think this was a great story, but it should never have been made into a film, and surely not as it was made. I would have much preferred to have read the play (or script) and had my own vision of what was happening instead of being stared at in the face by the characters. As a book, or play it would have been brilliant. As a movie it sucked. I give it a 3 because it was a good story but was a disaster as a film. Don't waste your time unless you like books on tape and don't plan on sitting down to actually watch Mike Nichols talk about his penis and fecal fantasies.",
         "I would have enjoyed seeing Wallace Shawn act out his main character thought Nichols was unforgettable. The vexing detail about this play of course is that one has to listen to get it; a bother I know. It is not, it seems to me,about literature or pompousness or affectation. It is just about character and circumstance, like all great stories, particularly potent in an environment where political fundamentalists get closer to power. It is like any Hollywood story; develop characters, setting and intro duce the plot. When events start to unfold in this story it is unbelievably chilling and you can realize, with a start, that some place in the world this kind of terror is happening to people very much like us, right now. While Texan's are rewriting their history text books to accommodate a brand of right wing thought experiment, people with contempt for free thought scheme for power - Tom Delay wanted to do away with much you enjoy in this country and he got close; we should pay better attention to our own literature.",
         "'The Designated Mourner', a play by Wallace Shawn, is above all else an exercise in writing. Three people (in this adaptation by David Hare, sat statically throughout in one of two locations, one of which appears to be a television news desk, the other a table in a small café), discuss their relationship. But although they respond to each other in tone, they rarely directly address the subject material that the others refer to; and the wider backdrop to their personal story, a crypto-fascist coup, is mentioned only elliptically by all three participants, just as it might be in real conversation where certain things would be taken as known. But there's little that's naturalistic or conventionally conversational about these carefully constructed interlaced monologues; they better represent the inner voices of self-justification (or alternatively, the voices of published autobiography). In spite of the artifice, one does develop a sophisticated sense for the nuances of the trio's characters; everyone has an agenda, and deciphering the three unreliable narrators is exactly the point. Thi particular film of the play is well acted, and it's probably sensible that Hare has chosen to add very little to the basic script (having made this decision, almost his only work as director is to choose when to cut between alternative close-ups). But while theatre has to work within certain intrinsic limitations (and offers you the benefits of live performance as a compensation), cinema does not and in this sense, this seems a strange work to put on screen. Nonetheless, it's still an interesting experiment, and worth watching if you like your drama wordy and cerebral.",
         "A drama of evolving inconsequence may evoke a certain appeal, as we hear the meandering rambling from one to another, the authors describe each other and themselves, analyze and criticize without arriving at any apparent conclusion or plateau of resolution. A seemingly unapparent effort in arousing suspicion amongst it's audience-in an effort to suggest a deeper meaning, a plot or subtext (this quite obviously is non existent) And yet, they continue to groan and meet with more intimate resolution as the 'play' takes a more detailed step forward, only to be rudely interrupted by their chief protagonist 'Jack' The whole affair reminds me of production meeting of a fictitious film company, with fictitious goals, offering pointless objectives based upon circumstances manipulated at their leisure as a means to perpetuate their overtly pointless existences. Still, it inspires writing in others, and indicates a challenge to conventional wisdom of broadcasting commissioners. Overwhelmingly describes the tedious equation of life over time, as seen through the eyes of the oppressed middle classes, with no drive or enthusiasm remaining-or perhaps they are simply too boring to inject the juice into their lives once more. Did somebody die?-I forget If you manage to read this review and find your brain elsewhere by the second paragraph, do yourself a favor- rent Bill and Ted's Bogus Journey!",
         "Three characters sit at table, taking turns speaking directly to the camera, talking of courage and cowardice in a time of repression, in an unspecified yet intuitively recognizable place and time not far from our own. Shawn's virtuoso writing (far more nuanced than a short summary can convey) meditates on the hairsplitting liberal in us all, as 'the last people who really understand John Donne' are casually wiped out in the interest of 'fighting terrorism'. As for the lack of action: yes, maybe it's really a radio play, but every actor or actress should *see* Mike Nichols, who gives an extraordinary, one-of-a-kind performance. Particularly, he breaks all the rules of \"actor's diction,\" so he sounds just like a *real* person (say, being interviewed for a documentary). Not an effect you can use just anywhere, but brilliant here.",
         "I was unable to sit through The Designated Mourner. There are three characters sitting or standing behind a table and talking directly into the camera. There's no dialog because they don't talk to each other or even acknowledge each other's presence. It's like three interspersed monologues or rambling answers to a talk show host without the questions because there is no clear thought development. They don't even address what each other is saying. My only clear recollection is of the husband describing his wife's unusual dressing habits. It was so boring it was hard to pay attention. I like good dialog but I've never seen anything like this. At first I thought it was some odd ball lead in and soon the real movie would start. Soon my jaw literally started to drop open as I realized this was it. 12 minutes was all I could stomach. Afterwards, I sat there dumbfounded that anyone has the audacity to make this and call it a movie or that anyone could actually sit through this let alone enjoy it.",
         "Spoilers herein. Shawn is in the tradition of playwrights who concern themselves with what it means to be a playwright and gives the audience reflection on what it means to be an audience. Often touched by Mamet and Stoppard, this notion has entered the mainstream popular film suitably watered down. All three of those writers wrap their self-referential, layered works in unusual language. In Mamet's case, it is a studied cadence of vernacular; in Stoppard's a rhythm of tossing the narrative among characters. Shawn's use of language is at once more poetic -- there are lots of memorable one-liners here -- and at the same time constantly meandering among levels. At one point, the narrative concerns some `real world' act like a shooting, but then it slips into observation of the act of observing, and then to wondering about what that metaobserving means. And what the benefits are, and whether we find value in it, and whether it destroys us, even makes us brutal. Does the existence of Howard create the thugs of the world? Does `lowbrow' exist only because someone has extracted `highbrow.' Do regrets form a sort of appreciation? Can anyone love and be aware? I personally love this stuff, especially when it goes through a Woody Allen filter as in `Sweet Hereafter.' But this film/play is not of the caliber of `Dinner with Andre' which truly sang, and `Vanya on 42nd St' which with much practice and refinement mastered the shifting of metalevels more deftly. There is, however, a delicious metatext in Nichols' performance. Here is an intelligent man himself: a master of dramatic humor, a precise director, a writer. Watch what he does, He is not acting the character -- he is acting as Wallace Shawn acting the character.",
         "I worked at the national film theatre & had to usher this film, unfortunately I drew the short straw & was the only one who had to watch it twice. About 75% of the audience walked out per screening. Three people talking to camera. set = table. Genuinely had people snoring. I had to stand up to stop from sleeping. Worst film ever made. don't accidentally watch it, hire it etc. It really is not worth the effort. If however you're planning to rob a bank, show the workers this film & watch them nod off. This really is a film to kill yourself to. Dull Dull Dull. PS. no this is not highbrow - it's tosh.",
         "Sadly, I bought this tape based on the description and came to the same conclusion as a previous poster -- the worst film I ever tried to watch! I can usually make it to the end of almost any movie, but 10 minutes into this one has tried all my patience. This is a style you either appreciate or you don't -- no middle ground. There are three people sitting at a table speaking about mundane nothingness into the camera. No plot or action or change of scenery. Sorry, had to give this a 1 out of 10."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Greenpoint Films"
      ],
      "summaries": ["Jack and Judy are husband and wife, and Howard is Judys father. They live in some fictional undemocratic and repressive country, and tell us a story about their lives, mostly from Jack's point of view."],
      "budget": 0
   },
   "movielensId": 1543,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-05-23",
      "dvdReleaseDate": "2000-02-08",
      "directors": ["David Hare"],
      "runtime": 94,
      "movieId": 1543,
      "title": "The Designated Mourner",
      "mpaa": "",
      "actors": [
         "Mike Nichols",
         "Miranda Richardson"
      ],
      "imdbMovieId": "0118964",
      "originalTitle": "The Designated Mourner",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Jack and Judy are husband and wife, and Howard is Judys father. They live in some fictional undemocratic and repressive country, and tell us a story about their lives, mostly from Jack's point of view.",
      "tmdbMovieId": 125021,
      "avgRating": 3.07692,
      "releaseYear": "1997",
      "numRatings": 78,
      "posterPath": "/ygEvgamjD6ghRPjSqy8WgJFCvbc.jpg"
   }
}