{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "boarding school",
            "id": 6271
         },
         {
            "name": "bereavement",
            "id": 9928
         },
         {
            "name": "child",
            "id": 208349
         }
      ],
      "imdb_id": "tt0117359",
      "video": false,
      "title": "Ponette",
      "recommendations": [
         263112,
         50950,
         64074,
         110761,
         86431,
         37621,
         91901,
         122492,
         15377,
         42715,
         42634,
         131586,
         126219,
         280571,
         43759,
         73306,
         142540,
         28968,
         48139,
         206126
      ],
      "backdrop_path": "/5xAPUvAqK1jyODl0pP1k1EV2BNJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Delphine",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105eca7",
               "name": "Delphine Schiltz",
               "profile_path": null,
               "id": 120627,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ponette",
               "gender": 1,
               "credit_id": "52fe46c29251416c9105ecab",
               "name": "Victoire Thivisol",
               "profile_path": "/wZSu4kbEVNp31L9Onbjf09tfe9S.jpg",
               "id": 5315,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Matiaz",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ecaf",
               "name": "Matiaz Bureau Caton",
               "profile_path": null,
               "id": 1158431,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Ada",
               "gender": 1,
               "credit_id": "52fe46c29251416c9105ecb3",
               "name": "Léopoldine Serre",
               "profile_path": "/A3cYx44kfCk1LNMRR7NEkyH6sBy.jpg",
               "id": 37189,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "La mère",
               "gender": 1,
               "credit_id": "52fe46c29251416c9105ecb7",
               "name": "Marie Trintignant",
               "profile_path": "/27apFXn2nZMl5FpDNXAOdpePDiR.jpg",
               "id": 39689,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Le père",
               "gender": 2,
               "credit_id": "52fe46c29251416c9105ecbb",
               "name": "Xavier Beauvois",
               "profile_path": "/dce2PuZxeDr9rkoVqZxfNeskxpi.jpg",
               "id": 72320,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "La tante",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ecbf",
               "name": "Claire Nebout",
               "profile_path": "/vHvQXIRJ6RXIVlCxVuTgxjqETUr.jpg",
               "id": 96930,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Luce",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ecc3",
               "name": "Luckie Royer",
               "profile_path": null,
               "id": 1158453,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Carla",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ecc7",
               "name": "Carla Ibled",
               "profile_path": null,
               "id": 1158454,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Aurélie",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105eccb",
               "name": "Aurélie Vérillon",
               "profile_path": null,
               "id": 133752,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "L'Instituteur",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105eccf",
               "name": "Henri Berthon",
               "profile_path": null,
               "id": 1158455,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Antoine",
               "gender": 2,
               "credit_id": "52fe46c29251416c9105ecd3",
               "name": "Antoine du Merle",
               "profile_path": "/6b5qfqARqqcuwqN4bAZfaoxED8Y.jpg",
               "id": 583401,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Marianne",
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ecd7",
               "name": "Marianne Favre",
               "profile_path": null,
               "id": 1158456,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c29251416c9105ec9d",
               "name": "Jacques Doillon",
               "profile_path": "/ghoI2Ki1nZDjqvZAMea9G4uPygt.jpg",
               "id": 118020,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c29251416c9105eca3",
               "name": "Jacques Doillon",
               "profile_path": "/ghoI2Ki1nZDjqvZAMea9G4uPygt.jpg",
               "id": 118020,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ecdd",
               "name": "Christine Gozlan",
               "profile_path": null,
               "id": 62529,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c29251416c9105ece3",
               "name": "Alain Sarde",
               "profile_path": "/95fgX9tAqahF98DG4FutHpLjbEi.jpg",
               "id": 3560,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ece9",
               "name": "Caroline Champetier",
               "profile_path": "/tkHJncN5hO0RXkWGKDSoek67fng.jpg",
               "id": 50539,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c29251416c9105ecef",
               "name": "Philippe Sarde",
               "profile_path": null,
               "id": 20075,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c29251416c9105ecf5",
               "name": "Henri Berthon",
               "profile_path": null,
               "id": 1158455,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.291633,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 38523,
      "vote_count": 13,
      "budget": 0,
      "overview": "A four-year-old girl must come to terms with the loss of her mother and the reality of death in this award-winning French drama. Little Ponette (Victoire Thivisol) is riding in a car with her mother when they're involved in a serious accident; Ponette survives, but her mother does not. Her father (Xavier Beauvois) initially reacts with anger over his late wife's careless driving, while her Aunt Claire (Claire Nebout) tries to comfort the child by telling her about Jesus and the resurrection. However, none of this does much to reassure Ponette or clarify her confusion about the practical realities and spiritual dilemma posed by death. In time, Ponette and her cousins Matiaz (Matiaz Caton) and Delphine (Delphine Schiltz) are sent off to boarding school, where they have to resolve their confusion and loss on their own. ~Mark Deming, Rovi",
      "similar": [
         5528,
         819,
         9655,
         15,
         745,
         235,
         595,
         9475,
         394117,
         346364,
         1247,
         810,
         674,
         354912,
         509885,
         7549,
         257,
         11906,
         42188,
         334536
      ],
      "original_title": "Ponette",
      "runtime": 97,
      "poster_path": "/32289bKHzGO4lyD8lUUIFYA5e5R.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Les Films Alain Sarde",
         "id": 635,
         "origin_country": ""
      }],
      "release_date": "1996-09-10",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jacques Doillon"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Jacques Doillon",
         "Brune Compagnon"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0117359/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4NDgzOTI4N15BMl5BanBnXkFtZTcwMDU4NDAyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Victoire Thivisol, Delphine Schiltz, Matiaz Bureau Caton | See full cast and crew »"],
      "reviews": [
         "My wife and I viewed this film without any prior knowledge of its quality (or even of its existence!) To say the least, we were extremely impressed. We find it difficult to understand how the director managed to create situations where these wonderful children could perform so magnificently. The storyline is certainly simplistic, but the film's greatness comes from the marvelous interactions between the young children which go well beyond acting as we normally understand it. These interactions are so authentic that the storyline as such becomes a secondary consideration. One reviewer critized the 'fantasy' ending of the film saying that it somehow broke the flow of the story... But, I for one appreciate the fact that the creators of this film allowed us to regain our composure before the lights went back on !",
         "\"Ponette\" (French, 1996): We learn that a child lost her mother in a car accident. Ponette (the child), like all children, tries to blend the various truths given her by adults, other children, teachers, books, rumors, churches...eventually arriving at her own version of Truth...a Truth that allows her to move on, with some peace. No one seems to know what to DO for her, and so, her search is solo. What most ASTOUNDS me about \"Ponette\" is: 1) It's written NOT by grown ups who see children as small adults, but as true children - with all the confusion, magic, and hope we seem to lose as we age, and, 2) the ACTING of Victoire Thivisol (\"Ponette\") is ABSOLUTELY AMAZING. She received numerous awards for this role, which upset some people - because she was only FOUR YEARS OLD at the time. \"HOW CAN ANYONE HAVE TALENT AT FOUR?\" Watch it for yourself. No one is beating her, no one is spraying lemon juice in her eyes, no one is tickling her feet...SHE is doing her own work. It's like she is channeling the next incarnation of Meryl Streep or someone. Since \"Ponette\", she has done two more films, including \"Chocolat\" (1999) with Juliette Binoche. She is now only TWELVE. I should live so long as to follow her entire career.",
         "Nobody watching this film can failed to be touched, moved, transported and transformed by it. Others here have already expressed the enormous power of the movie, and particularly of its star, Victoire Thivisol. If you're reading this to see if you should watch it, I'd say, drop everything and go buy it so you can watch it over and over. But buy a case of Kleenex (TM) too, you're going to need them! As I watched the movie, I had the impression that director Jacques Doillon had simply found a real-life tragedy and somehow followed the participants through it with his camera. Nothing in this film gives you the impression of having been written, scripted, staged, produced. It is all so completely natural that you experience first hand the pain, the emotional agony of Ponette, as if she were your own daughter, your own sister, even your own self.",
         "A 4-year-old French girl, Ponette (Victoire Thivisol) waits for the return of her mother, who has just died at an auto accident. This beautiful and sensitive drama surprised a lot of people when won the Volpi Cup for Best Actress at the Venice Film Festival 1996, given to a 5-year-old novice, Victoire Thivisol. She is really magnificent and, controversy aside, the important award recognized the biggest achievement in the film: Victoire reacts with amazing naturalness and outstanding facial expressions to the most intricate scenes. \"Ponette\" is a film that certainly will be in your memory, mostly because of a too young girl who shows the difference between a little great actress and a gracious child who wrinkles the eyebrows eloquently.",
         "is given by 4 year-old Victoire Thivisol. Differences in how people deal with death and the role religion plays are brought into focus in this outstanding, thought provoking and unrelenting heartbreaking film. Death and religion are difficult enough concepts for adults but to thrust them upon a 4 year old child and watch her battle to understand why her mother is dead is captured beautifully and thoughtfully in Ponette. This is a must see.",
         "I have wanted to see this movie for a very long time. At the time it was released, my own Mother had suddenly died and I knew that it would have been too intense for me to watch. Now, it is almost 11 years later and I have finally watched it and this is quite simply one of the most true to life portrayals of grief and the journey it becomes for really anyone. I was Ponettes age when my father died and I can completely relate to her reactions, her agony and the confusion she portrayed. I can remember asking constantly when Daddy was coming back and not really accepting the answers that people were telling me. I also recall praying and talking to my father when I was alone in my room, begging him to come back and see me when no one else was around. I even had a dream about my father that was amazingly close to Ponettes interaction with her mother. This rang so true for me that I couldn't believe the writer of this story connected things in such a realistic way. Victoire Thivisol is shockingly real in this role. I cannot believe she was only 4 years old when this was filmed! It's a fascinating study of a shields emotional response to such a tragic event and quite honestly, I am at a total loss of words as to how to describe the power of this movie. I can only tell you that if you are looking for something intense and engrossing, this would be your movie. I really appreciated the feeling it left me with at the end too.....that life is not always easy and predictable but that humans are remarkably resilient beings who can actually grow in wonderful ways from the events that challenge us the most.",
         "I love everything about this film. The cast portrayed their characters well; the script presented a variety of philosophical viewpoints; and many of the interactions between the children were symbolic of religion in the adult world. Those who would be thrown off by this sort of a thing should not worry, because there are plenty of sweet moments and a very satisfying ending. And I must say that that little girl's performance was utterly stunning. Amazingly enough, she was four years old during filming. I would recommend it to anyone with a brain or a heart.",
         "Even on home video, PONETTE retains its remarkable power. It remains one of the most haunting and affecting studies of childhood on film. Victoire Thivisol's performance in the title role continues to be moving and totally disarming. It's a rare talent that can carry an emotionally demanding role in a film in which the lead appears in nearly every scene. The fact that it is a four year old child is simply staggering. If there is any ground for complaint about the DVD release, it's the fact that the film appears in \"Standard Format\" instead of a full ratio Widescreen edition. In any event, PONETTE is a welcome addition to my DVD collection. In fact, it is a title that I wouldn't want to be without.",
         "Although I found this to be one of the most affecting films that I have seen, I was, nevertheless, astounded at the real depth of feeling shown by the young children in this film. Victoire Thivisol carries absolute sincerity in her portrayal of the recently bereaved young girl, with a realism beyond belief when one considers her tender age. The other children also played their parts with a conviction that would be considered commendable in mature actors with many more years of experience to draw on. As has been noted elsewhere, the graveside apparition of Marie Trintignant as Ponette's mother does seem a fanciful afterthought to give the story a kind of closure, but it is hard to see how the film could have been brought to a conclusion without a similar contrivance. Not a film for the overly sentimental, and I include myself. After watching the film, I bought the DVD, but I,m still waiting the right time to rewatch it.",
         "I do not believe I have ever seen a film that comes anywhere close to \"Ponette\" before. While I would not consider it my favorite film that I could watch over and over and over, it is easily one of the stronger movies I have seen. Rarely do I view a film that is so precise and cohesive even though it simultaneously plays off so many different themes, like sentimentallity, nostalgia (we all remember the strange social world of the playground though maybe some of us don't want to go back), the pain of loss, and (gasp) humor. Most directors and actors would get lost at one point or another, not knowing how to segue or shift from one tone to another, but here there is nary a problem with doing so, which is especially amazing considering the leading lady has been walking and talking for about as long as it takes to make a bowl of oatmeal. The best scenes for me were the trials that the older girl put Ponette through. The dumpster one was especially great. Considering that early on in the film I sympathized with Ponette when she cried during some scenes, I felt bad laughing at her suffering through the tests, especially when her hand got caught when the dumpster lid came down. I believe some of this movie was improv, so for all I know, the poor girl really got her hand hurt, but I remember those type of moments as a child; those tests of stamina, durability, agility, etc. I put my younger brother through some horrific ones. One time he broke his arm. How could I have been so cruel? A performance artist/singer named Suran Song recommended I watch this film. In Suran's performance, she actually uses slides of the scene where the mean little punk Antoine is playing with Ponette on the playground and begins to verbally abuse her about her mothers death. The context Suran used the scene in her act seemed to be making a statement about how people treat others in society, even when very young. Interesting how she sort of sampled an individual scene and made it into a story of her own, because it plays much differently in the film as a whole (obviously) since we know the characters. Probably not for everyone, but certainly for those who want to a see a piece of work very left-of-center yet not oddball in any way; simply a viewpoint that wouldn't normally seem worth making an entire feature film out of because it would be hard to pull off. Ponette is not only pulled off... it goes flying to the moon."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Les Films Alain Sarde",
         "Rhône-Alpes Cinéma",
         "Centre Européen Cinématographique Rhône-Alpes"
      ],
      "summaries": ["An extremely captivating movie on how a little girl copes with her mother's death. She withdraws from all the people around her, waiting for her mother to come back. She tries waiting, and when her mother still doesn't appear, tries magic chants, praying to God, and then becoming a child of God, to have some power over Him. All to no avail. But then, when she is in despair, her mother does come back ..."],
      "budget": 0
   },
   "movielensId": 1545,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-09-10",
      "dvdReleaseDate": "1998-05-26",
      "directors": ["Jacques Doillon"],
      "runtime": 97,
      "movieId": 1545,
      "title": "Ponette",
      "mpaa": null,
      "actors": [
         "Delphine Schiltz",
         "Victoire Thivisol",
         "Matiaz Bureau Caton",
         "Léopoldine Serre",
         "Marie Trintignant",
         "Xavier Beauvois",
         "Claire Nebout",
         "Luckie Royer",
         "Carla Ibled",
         "Aurélie Vérillon",
         "Henri Berthon",
         "Antoine du Merle",
         "Marianne Favre"
      ],
      "imdbMovieId": "0117359",
      "originalTitle": "Ponette",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["w16La-7gliQ"],
      "plotSummary": "A four-year-old girl must come to terms with the loss of her mother and the reality of death in this award-winning French drama. Little Ponette (Victoire Thivisol) is riding in a car with her mother when they're involved in a serious accident; Ponette survives, but her mother does not. Her father (Xavier Beauvois) initially reacts with anger over his late wife's careless driving, while her Aunt Claire (Claire Nebout) tries to comfort the child by telling her about Jesus and the resurrection. However, none of this does much to reassure Ponette or clarify her confusion about the practical realities and spiritual dilemma posed by death. In time, Ponette and her cousins Matiaz (Matiaz Caton) and Delphine (Delphine Schiltz) are sent off to boarding school, where they have to resolve their confusion and loss on their own. ~Mark Deming, Rovi",
      "tmdbMovieId": 38523,
      "avgRating": 3.83988,
      "releaseYear": "1996",
      "numRatings": 662,
      "posterPath": "/32289bKHzGO4lyD8lUUIFYA5e5R.jpg"
   }
}