{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "assassination",
            "id": 441
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "dentist",
            "id": 33780
         },
         {
            "name": "exterminator",
            "id": 158120
         }
      ],
      "imdb_id": "tt0117561",
      "video": false,
      "title": "Schizopolis",
      "recommendations": [
         124630,
         196490,
         147746,
         190694,
         195133,
         86823,
         189578,
         194583,
         231040,
         212185,
         231423,
         148791,
         231044,
         190563,
         195960,
         231375,
         162853,
         195092,
         196534,
         94732
      ],
      "backdrop_path": "/1YA72pdcCeCQsc4ayQViu6qI2vT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Right Hand Man",
               "gender": 0,
               "credit_id": "52fe46cd9251416c7508401b",
               "name": "Scott Allen",
               "profile_path": null,
               "id": 80481,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Fletcher Munson",
               "gender": 2,
               "credit_id": "52fe46cd9251416c75084025",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Mrs. Munson",
               "gender": 1,
               "credit_id": "52fe46cd9251416c7508402d",
               "name": "Betsy Brantley",
               "profile_path": "/sAJuozmEy1eoD84yeHPdCu50c3p.jpg",
               "id": 12831,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Nameless Numberhead Man",
               "gender": 2,
               "credit_id": "52fe46cd9251416c75084035",
               "name": "Eddie Jemison",
               "profile_path": "/zRrs9hAJcKNdWkCPWJ3XRkoFGAm.jpg",
               "id": 1898,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Elmo Oxygen",
               "gender": 2,
               "credit_id": "52fe46cd9251416c75084039",
               "name": "David Jensen",
               "profile_path": "/2ZcpeU1Iu1wpQfxltdsjO5da8cB.jpg",
               "id": 60875,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "T. Azimuth Schwitters",
               "gender": 0,
               "credit_id": "52fe46cd9251416c7508403d",
               "name": "Mike Malone",
               "profile_path": null,
               "id": 1199564,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cd9251416c75083ff9",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cd9251416c75083fff",
               "name": "John Hardy",
               "profile_path": null,
               "id": 6341,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cd9251416c75084005",
               "name": "John Re",
               "profile_path": null,
               "id": 67739,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cd9251416c7508400b",
               "name": "Cliff Martinez",
               "profile_path": "/hDYGsWAe7Lacfkx62AyqpllXsqg.jpg",
               "id": 8377,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cd9251416c75084011",
               "name": "Jeff Rona",
               "profile_path": null,
               "id": 59472,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cd9251416c75084017",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cd9251416c75084021",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe46cd9251416c75084043",
               "name": "Sarah Flack",
               "profile_path": null,
               "id": 1782,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cd9251416c75084049",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.870837,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16375,
      "vote_count": 32,
      "budget": 0,
      "overview": "A man works for the unpleasant guru of a Scientology-like movement.",
      "similar": [
         948,
         8810,
         298312,
         4638,
         11564,
         2142,
         2253,
         141,
         185,
         186,
         10285,
         431,
         101,
         205,
         681,
         949,
         23483,
         769,
         793,
         4771
      ],
      "original_title": "Schizopolis",
      "runtime": 99,
      "poster_path": "/9ASmg9EvWkt90dwW9YKO3NXQk8d.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": ".406 Production",
         "id": 3187,
         "origin_country": ""
      }],
      "release_date": "1996-09-13",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Come early! Come often!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steven Soderbergh"],
      "runtime": 96,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117561/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4NDQ5NjQ2MF5BMl5BanBnXkFtZTcwNzU3NDAwMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Steven Soderbergh, Scott Allen, Betsy Brantley | See full cast and crew »"],
      "reviews": [
         "The reason is it is absolutely brilliant. In need of artistic renewal, Steven Soderbergh threw everything he could think of into this self-financed feature and the results are scattershot, inscrutable, unfathomable and -- above all else -- hilarious. Veering from biting social commentary to clever wordplay to a withering parody of Scientology, this film isn't the sort of thing one should rent unless you want to give your brain a workout. Soderbergh has said that this was his attempt to pay homage to the \"freewheeling\" style of Richard Lester. Whether he achieves that or not is open to debate, but he certainly managed to create a one-of-a-kind film experience. Too bad few people ever got the chance to see it on the big screen. In the immortal words of Elmo Oxygen: \"I believe -- so strongly -- in mayonnaise.\" Words to live by. I know I do.",
         "Steven Soderbergh's 'Schizopolis' is a masterpiece. It's a satire on the formulas and cycles of ordinary people's every day lives. It very brilliantly satirizes relationships, marriage, sex, stress, work, the media, and communication, and many more elements of life. Soderbergh's wife in the movie (played by his real-life ex) is an example of a middle-age woman trying to find a good solid relationship, as she flees from her husband to his 'alter-ego' and can't decide which one she is more attracted to. The way the two talk is in Soderbergh's own made-up language, indicating the relationship they have. Which is a very common one, where everyday they have the same pointless, shallow discussions about their semi-awareness of plans for the evening, and at one point their relationship in bed. The marriage is fuelled by lies (a nod to his earlier 'sex, lies, and videotape'). At one point in the film, everyone speaks out what their subconscious tells them, in a very disturbing level of honesty, indicating what they're really feeling and really thinking, and how they express it, whether truthfully or dishonestly. Among things, the film is hilarious, frustrating, shocking, spontaneous, and even touching. It's like nothing ever put up on the screen before, it's a fresh antidote to anything formulaic, and for once, something new.",
         "From the prologue I instantly thought I understood the tone that Steven Soderbergh- writer, director, cinematographer, possible pornographer, and double-actor on Schizopolis- was going for: pure absurdism, not just with how the prologue is worded (as the most important film experience of all time, the \"full completed version\"), but how he goes between all the different lenses like a young film student checking out the gears on a Bolex. But it's always a tricky thing going into a Soderbergh \"experiment\", and that it could be a mish-mash like Full Frontal (I've yet to see Bubble). And, in all truth, it is a mish-mash. It tells a coherent story only in that there's maybe two (or three) stories that seem to make any sense, but is scattered around scenes and freewheeling camera moves and editing tricks and music that come closest to that oft-mentioned critic term \"off-beat\". And a lot of the time it seems to be so personal to Soderbergh (real life ex-wife playing ex-wife, plus what may be his real kid playing Brantley's daughter), and so unconscionably irreverent, that it dares to run off the tracks any minute. But it's this fully realized move to just be silly and strange, to make just random moments of wild satire (Rhode Island sold as a shopping mall, \"Well, at least we didn't sell it to the f***ing Japanese\", and a man randomly getting caught up in a straight jacket by fellows from a mental hospital), more well-rounded jabs at the drudgery and pointless meandering of everyday white-collar work life (is there a spy, or a mole, who cares if there's masturbation?), and statements just abstracted as if done sort of by a spontaneous idea in the editing room (title cards quoting a page in the script?), that makes it such a daring work of ludicrous intentions. This isn't a filmmaker trying to make an innovative and possibly important film like Traffic, or even a fun mainstream romp like Ocean's Eleven. In fact, it's seeing the opening prologue, and seeing how the style takes off right away (the title for the film on the shirt of a naked guy running away!) it sets off wonderful irony at every turn. Not that Soderbergh isn't being self-indulgent. In fact, I'm sure that's why there's something of an honesty to his going head-long into his own personal crises of dealing with a relationship or marriage, and throwing caution to the wind by making the emotional problems actually quite real while obfuscating them with some truly goofy vignettes. It's almost like directorial therapy: let the actors improvise, let it all be loose, and even have a truly warped storyline involving an exterminator, really an actor looking for motivation and a written scene (ha), yet having in many instances moments of confession. Even if one might not know some of the circumstances surrounding Soderbergh's first marriage (it's detailed in the book Rebels on the Backlot), it feels like it's coming from the heart a good lot of the time, which uplifts the comedy. A running gag late in the film, as certain scenes from earlier with the perfectly dead-pan Soderbergh and Brantley are repeated, has Soderbergh being dubbed over in Japanese, French, and Italian, though in scenes that involve break-ups, awkward sexual tension, and a reconciliation. This is not to say that Soderbergh isn't also more devilish than he's ever since been with his innuendo- make that outright hilariously immature sexual comedy- and it's amazing to see Soderbergh read a 'love letter' he's written to his \"Attractive Woman #2\", describing his profession of emotions in very graphic ways. And if Soderbergh does some strange things to surprise as the only time he's starred, let alone acted, in one of his films (the scene where he's in the bathroom making faces at the mirror is one of those pure moments in absurd cinema that speaks to the success of paying homage to Richard Lester movies), his going for broke stylistically pays off too. Or doesn't, depending on how one can take the mix and match of film stocks used from grainy 16mm to the usual 35mm, jagged hand-held racing after the exterminator man beating up on a man and woman, extreme fast-motion film-speed, perfectly composed images like a boy in right field missing a baseball, and even documentary style in the scenes with T. Azimuth Schwitters. On top of the dialog being continuously crazy and self-conscious (what's that film crew following along?), it's possibly the best, or at least most fun, that Soderbergh has to offer as an independent filmmaker. So see it at your own risk, definitely check out the trailer beforehand to get an idea of what's at hand (if the poster wasn't sign enough what a tailspin one can expect to get into), and if one is already a fan, if only in the guilty pleasure sort of way as I know I am, do check out the Criteron DVD for Soderbergh \"interviewing\" Soderbergh commentary, including the story how the deal for David Lean to direct two years after his death fell through (damn Showtime channel)!",
         "Well, it's different, that's for sure. I took this movie out on video because I was in the mood for something different, and on that front it certainly fulfilled my expectations. On the other hand, I was also after something entertaining, and on that front it - unfortunately - didn't, except in fragments. The film starts with Steven Soderbergh blowing a metaphorical rasberry at the audience, standing in front of the movie screen advising (not an exact quote, just a paraphrase) - \"This is the most important movie you will ever see. If you do not understand it, the fault is yours, not ours, and you should see it again and again until you do understand it, and at full price too.\" It then follows a small cast of characters (some of whom can't act... or maybe that's the point?) in a series of intersecting stories... though if you can articulate the plotlines you're a better person that I! There's some sort of satire on Scientology, though as I know almost nothing about that particular cult/religion the allusions unfortunately pass me by. I guess, though, that John Travolta is unlikely to make a movie with Soderbergh anytime soon. I did enjoy a few bits, particularly when Soderbergh is playing with the conventions of film making (like deliberately having the boom mike \"accidentally\" drop into shot). Favourite among these is when he has his characters talking in a kind of meta dialogue, a cinematic shorthand which comes across like the actors are reading off the film's treatment rather than script. Ie, instead of saying things like \"Hi Honey, I'm home. How are the kids?\" they say something along the lines of \"Banal greeting to wife. Obligatory inquiry after offspring.\" Unfortunately these moments are too few. This would have made an interesting short subject, but at over an hour and a half it really didn't sustain my interest. Guess I'm a traditionalist at heart.",
         "Stream-of-consciousness conception, sharp writing and creative technique. There's plenty here to amuse any smart audience, but the parts add up to an (intentionally) oblique whole. The film is so playful and irrespective of convention, it's as if Soderbergh threw up his hands and said 'Screw it, I can't make the movies they want me to.\" Take it with his work since and you've got the most supple, witty and consistent filmmaker working in the U.S. today. There's lots to analyze, and myriad connections to be made. But don't try to make too much sense of it... let it take you, and enjoy.",
         "I will echo a comment that someone made about -The Big Lebowski- (my #1 favorite comedy followed by this delightful mess). \"Warning: this film transmits on a strictly limited wavelength.\" If you don't catch this curveball, you're likely to be bored. I won't say that if you don't like it on first viewing, then you're never going to like it. In my case, certain movies get more enjoyable on repeat viewings even after receiving a ho-hum response the first time around. This is one of those movies. With a narrative more fractured than your average David Lynch film, there are connections between one scene and another that jump out and take notice only on repeat viewings, sort of like \"portals\" from one part of the movie to another. Music that plays, pictures shown on the wall, one-sided phone conversations, that sort of thing. Aside from the already-limited-wavelength humor, these amplify the laugh factor. This is a movie destined for some kind of limited cult-following someday, but keeping to a murmur level when you're standing next to an air conditioner. The Criterion DVD has some good features and outtakes, like the \"Maximum Busy Muscle\" segment extolling the virtues of all products vinyl. Update Nov. '06. Re-watching this almost on a whim, and it all comes together (such as it is) even more. This is truly hilarious, a comedy masterpiece reveling in all its many absurdities, which come one after the other at a highly accelerated rate. I'm upping my vote from 9 to 10. \"You will learn something from me here today.\" --Elmo Oxygen (Noooo!!! Oooogghghgh!!)",
         "If big star Hollywood movies are your favorites, this might not be for you. You should give it a chance, though. It's very fun. Schizopolis is an incredible treatise on communication and perception in a cinematic form. Supposedly, Soderberg made this movie as a way of cleansing his pallet. (As pallet cleansing or writer's block bypassing projects go, it ranks up with the Coen brothers hitting a writer's block around the third act of Miller's Crossing, putting the project on hold and writing the screenplay for Barton Fink, a movie about an author with writer's block.) Our concepts and perception of reality, especially about communication, seems to be the main playing ground for this movie. Schizopolis is an experimental project, yet flaunts its three act structure. The movie can give you new ways to think about daily life and reality, without resorting to sci-fi religious hogwash, which the movie also lampoons perfectly. The movie has no credits, if that says anything. The movie's title is shown on a T-shirt worn by an otherwise naked man being chased. And that's just the start.",
         "Soderbergh apparently worked on this movie with a video camera and several friends. The movie was an effort on Soderbergh's part to return to the most basic elements of film making, without the big budget, big lights, and big names. He succeeded ten times over. I've seen the movie many, many times and it only gets better. Its humor is at times subtle and at others out-right raucous. Each time through you'll be certain to notice something new and amusing that you'd missed before. Fantastic!",
         "The first time I saw this film I was entertained and mildly confused by what I had just witnessed, it primarily represents a satiric look at modern life Pre Office Space, but saying just that does not do the picture justice. The combination of surrealism, satire and general creativity make this film worth while and most importantly worthy of multiple viewings. At times it feels as though it is being weird for the sake of weird but remains to peak curiosity. Some very funny situations and lines. Not for everyone, but for those looking for something different and willing to keep an open mind this is an excellent, original film. If you want loud bangs and shiny things, watch Soderberghs other films like Ocean 11, 12, 13, 14, 15, 16 etc.",
         "I have to agree with some main themes already given here - it's brilliant, it's unconventional, it's not linear, it's hard to follow, its production values and casting are not the highest quality, and it's incredibly funny. This is one of the best movies for catch-phrases I've ever seen - it's got witty dialog, great character names, and it doesn't really matter that the plot doesn't go anywhere important - it's just funny as hell. Anyone who liked Waking Life will like this film, but if you have to have movies develop in meaningful ways, just pass it up and don't feel guilty. If you do rent it, be prepared for oddly named characters, spoofs on Dianetics, conversations in gibberish, and random odd scenes that all conspire to show how meaningless life can become if you let it. I'd really like to know more about how and why Soderbergh made this - it doesn't have any credits or production info on the VHS version, and it is so radically different from anything else he's done. It's hard to believe the same person who did Erin Brokovich and Traffic did this, but I'm eternally grateful - I kind of wish he'd do another one sort of along these lines, just to add more irreverence into filmmaking."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": [
         ".406 Production",
         "Universal Pictures"
      ],
      "summaries": [
         "Fletcher Munson is a lethargic, passive worker for a Scientology-like self-help corporation called Eventualism. After the death of a colleague, he is promoted to the job of writing speeches for T. Azimuth Schwitters, the founder and head of the group. He uses this as an excuse to be emotionally and romantically distant from his wife, who, he discovers, is having an affair with his doppelganger, a dentist named Dr. Jeffrey Korchek. As Munson fumbles with the speech and Korchek becomes obsessed with a new patient, a psychotic exterminator named Elmo Oxygen goes around the town seducing lonely wives and taking photographs of his genitals.",
         "Fletcher Munson, the lethargic employee of a pseudo-religious self help company, and his doppelganger, the friendly but dull dentist Dr. Jeffrey Korchek."
      ],
      "budget": 250000
   },
   "movielensId": 1546,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Italiano",
         "日本語"
      ],
      "releaseDate": "1996-09-13",
      "dvdReleaseDate": "2003-10-28",
      "directors": ["Steven Soderbergh"],
      "runtime": 99,
      "movieId": 1546,
      "title": "Schizopolis",
      "mpaa": "",
      "actors": [
         "Scott Allen",
         "Steven Soderbergh",
         "Betsy Brantley",
         "Eddie Jemison",
         "David Jensen",
         "Mike Malone"
      ],
      "imdbMovieId": "0117561",
      "originalTitle": "Schizopolis",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["f2E7ArARdaE"],
      "plotSummary": "A man works for the unpleasant guru of a Scientology-like movement.",
      "tmdbMovieId": 16375,
      "avgRating": 3.61062,
      "releaseYear": "1996",
      "numRatings": 452,
      "posterPath": "/9ASmg9EvWkt90dwW9YKO3NXQk8d.jpg"
   }
}