{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0118117",
      "video": false,
      "title": "The War at Home",
      "recommendations": [
         23274,
         25576,
         61418,
         46924,
         19033,
         53151,
         63437,
         51321,
         20863,
         20860,
         38980,
         38981,
         18856,
         33135,
         17133,
         250622,
         46989,
         14883,
         35113,
         14425
      ],
      "backdrop_path": "/34SVWEX4LogftDzb73QwbxGNOcp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeremy Collier",
               "gender": 2,
               "credit_id": "52fe4986c3a36847f819ee85",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maurine Collier",
               "gender": 1,
               "credit_id": "52fe4986c3a36847f819ee89",
               "name": "Kathy Bates",
               "profile_path": "/pwHCkfIBeDdz93RlcmDWqXefozi.jpg",
               "id": 8534,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bob Collier",
               "gender": 2,
               "credit_id": "52fe4986c3a36847f819ee8d",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Karen Collier",
               "gender": 1,
               "credit_id": "52fe4986c3a36847f819ee91",
               "name": "Kimberly Williams-Paisley",
               "profile_path": "/nVp4F4VFqVvjh6huOULUQoiAguY.jpg",
               "id": 70696,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Melissa",
               "gender": 1,
               "credit_id": "5a809340c3a36818950226bd",
               "name": "Carla Gugino",
               "profile_path": "/xddYLCp8zWLgYcQRck7REEgCUWl.jpg",
               "id": 17832,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4986c3a36847f819ee97",
            "name": "Emilio Estevez",
            "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
            "id": 2880,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.702384,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 59232,
      "vote_count": 8,
      "budget": 0,
      "overview": "Jeremy Collier is a Vietnam veteran who has returned home and is struggling to cope with the war experiences that haunt him. He is also at odds with his family, who cannot begin to understand what he has been through. Jeremy's battles with his family finally spiral out of control on Thanksgiving Day, when a bitter secret is revealed",
      "similar": [],
      "original_title": "The War at Home",
      "runtime": 119,
      "poster_path": "/la11ac7YYCDBsizOkKxqwn71VKQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1996-11-20",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "There Is A Secret About To Explode.",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Emilio Estevez"],
      "runtime": 123,
      "synopsis": null,
      "writers": [
         "James Duff",
         "James Duff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118117/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2NjIyNzg4M15BMl5BanBnXkFtZTcwODA4MDEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Emilio Estevez, Kathy Bates, Martin Sheen | See full cast and crew »"],
      "reviews": [
         "The most intense and powerful film I have seen in years. There have been other films before that delved into the Vietnam Vet but nothing compared to this emotionally heartwrenching film, as a typical American suburban family, circa 1972, comes apart at the seams, revealing the scars that Vietnam has left on our all of our collective souls. The cast is A++++ fantastic with all four actors(with Kathy Bates a stand-out) giving riveting performances. What is wonderful about this film is that you take no sides, but understand all four characters and empathize with them, even though all four have divergent viewpoints and needs. There are scenes in here that are so powerful as family secrets and feelings are revealed(such as the confrontation between son and mother) that will have you emotionally drained and in tears of anguish. I actually cried in this film, something I rarely do. The shocking end is a stunner! A much overlooked film that should be seen. I rate this 1996 film a 10/10 a superlative piece. Highly recommended especially in this day and age with again, our country embroiled in a hideous war, our headlines shouting of atrocities and again, our young men and women returning with deep psychological scars, with their deep pain of deeds done in the line of honor. A must see film.",
         "I caught this movie on TV yesterday. I had a certain curiosity about it, being that it was directed by Emilio Estevez and starring him and his real-life Dad, Martin Sheen. I love to see a movie about a father-son relationship that involves a real-life father and son. Naturally, there's an instant chemistry between Sheen and Estevez, and their scenes of conflict are even more intense, knowing that they're actually related. Of course, it helps that the two of them are both terrific actors. I've seen Martin Sheen in intense roles before, but I think this is Emilio's most intense role--being that I mostly recall him from the \"Mighty Ducks\" series--and I was very impressed. Talent REALLY does run in that family. And Kathy Bates steals the movie in an Oscar-worthy performance. She tugged at my heartstrings with every word of dialogue. Kimberly Williams--the beautiful actress from the \"Father of the Bride\" movies--is also very good, holding her own among a group of talented veteran actors. The movie is a bit stagey, with dialogue that's obviously geared for the stage, but that didn't bother me. This is not meant to be an action movie; this is a character study. And for a film that's based on a play, it never gets too claustrophobic. When Emilio's character, Jeremy, reminisces to his days in Vietnam, we actually see his harrowing memories brought to life. The film is extremely powerful and realistic, without being sentimental. At the end, I expected all the conflicts to be resolved and the family would become hunky-dory, but that's not how it turned out. The ending made me cry, without resorting to standard Hollywood melodrama. That proves reality is much more gripping than anything Hollywood can conjure up. If you're in the mood for a beautiful, powerful drama with extremely wonderful performances that will knock your socks off...please check out this underrated gem. Hopefully, one day Martin and Emilio will unite with Charlie, and they will all make a great film together. My score: 9 (out of 10)",
         "I was just lucky I found this movie. I've been taking advantage of Walmart's $5.50 DVDs, because I watch a lot of movies (and very seldom watch television). I graduated from high school in 1968 - so I have family and many friends who served in Vietnam. This movie really illustrates the pain I've seen in my friends in dealing with what happened to them over there. I wish more people would see this movie - I think maybe more people could understand what happened to our Vietnam vets by watching these excellent actors in the portrayal of one family damaged by that war. The story felt realistic - it isn't mushy, but made me feel what they were going through. I think it helped that Martin Sheen and Emilio Estevez were playing father and son - it made their relationship more believable,",
         "Not being a movie aficionado, I am not familiar with the names of leading Directors, Scriptwriters, Producers and the like, but I can tell an outstanding movie when I see one. The makers of this fine movie could well be now at the top of their fields, or may well get there pretty soon. I know that the actors are already there. It takes talent closer to genius to show with such realism how a national tragedy like Vietnam has impacted the everyday life of a typically average American family, and make us see at close range why there are so many homeless Vietnam veterans. Without getting into gratuitous scenes of gore and bloodshed, it makes us understand why so many youg men had flashbacks of what they had been thru. The dialog is particularly gripping, and gives us an idea of what went on in so many families in the aftermath of Vietnam. I wish there were more good movies like this one, not just about Vietnam, but about other social conditions as well.",
         "\"The War at Home\" was a labor of love for director/star Emilio Estevez, and the care he took with this story is evident on screen. Adapted for the screen by original playwright James Duff, the film focuses on Jeremy Collier (Emilio Estevez), a veteran of the Vietnam War who is deeply scarred by his experiences. Jeremy's family can't understand his pain or deal with his erratic behavior. On Thanksgiving Day, each family member reaches their breaking point. The cast is just about perfect. They look, sound, and act, like a family; albeit one that is struggling mightily. Real-life father and son Estevez and Martin Sheen are great opposite one another (look for Estevez's sister Renee and daughter Paloma in small roles). Kimberly Williams also does quite well as Jeremy's sister Karen, and the amazing Kathy Bates virtually inhabits Jeremy's mother Maurine. One of the most striking things about \"The War at Home\" is the domesticity of it all - a real sense of a family trying to keep up appearances - which is so well-established that the film's explosive finale is all the more shocking. This is a different and very effective presentation of a Vietnam veteran's experiences. Don't hesitate to check out this movie, which should have received more attention back when it was released.",
         "The one thing that struck me most about this simple movie was how the characters could not relate to the feelings that the principal character Jeremy felt. An isolation, a feeling of despair, a sudden irrational fear of circumstances, a guilt feeling of \"Why me?\" This movie was not a financial success and could not be. It gives an all too true expression of the mixed psychological emotions felt by those who know the Nam experience. My one thought for you is to watch this movie and try to understand these feelings that too many of us experience in life and our dreams continually. Perhaps this can help heal us all. The cast is beautiful and I was quite shocked to learn that Martin Sheen's son had directed it. The biggest shock to watching this movie is to learn that it is not entertaining. That is not a condemnation but rather a description. The only unreal part were the scenes of war.",
         "I have seen only a few films which I thought were powerful. The War at Home is at the top of the list. Emilio Estevez (The Breakfast Club, Young Guns) stars as a Vietnam vet who just recently returned home. He is haunted by his memories. Added to this is a family that can't understand why he doesn't just forget about it and continue living. Besides this they each have their own problems which they sort of take out on him to add to his grief. His mom played by Kathy Bates (Misery, Dolores Claiborne) is always trying to be extra cheerful, but she doesn't understand why he doesn't want to talk to her or play the piano. His dad played by Estevez's real life dad Martin Sheen (The American President, Wall Street) is very dominant demanding that everyone stay by his rules in his house. Finally his younger sister played by Kimberly Williams (Father of the Bride 1 & 2) doesn't see what the big deal about Vietnam was and doesn't like spending time with the family. All of this pushes Estevez farther and farther towards losing it. Kimberly Williams is good as the sister. Kathy Bates and Martin Sheen are both excellent as the parents. Finally Emilio Estevez gives an extremely powerful performance that should have received a lot more attention and praise. This film was great. It was one of the best movies I've seen in a while, which makes me wonder why it didn't get much of a release. I highly recommend it.",
         "The connection with James Dean?In a short plan ,we see Emilio Estevez toying with a teddy bear(remember the first scene of Ray's \"rebel without a cause\").Moreover,the main conflict is Estevez versus Sheen,father against son,as in \"East of Eden\".The soldier has come home,and nobody has been able to communicate with him, even his sister (a psychology student,what a derision).The mother,a crude matron (a superb Kathy Bates),gets bogged down in nougatine ,she 's not able to understand that her values (religion,family) have become a thing of the past,specially for someone like his son whose innocence was betrayed. The father ,an irresolute man ,under his wife's thumb,although he tries hard to play the macho,wanted to make up for the mediocrity of his life .So he saved his \"honor\" by forcing his son to do his duty.The scene in which Estevez's hatred for his father explodes is very intense.The actor-director gives a restrained performance,interiorized,as Lee Strasberg's students used to do,and his final burst of anger is increased tenfold so.",
         "Emilio Estevez actually directed a good movie--who woulda thought? I sat through two previous films Estevez directed--\"Wisdom\" (with then girlfriend Demi Moore) and \"Men at Work\" (with brother Charlie Sheen). They are lousy films---badly acted, directed, stupid and offensive. Estevez is a good actor but lousy as a director. I turned this on in pure curiousity--it has a great cast and I had nothing else to do. Damned if it didn't pull me in. It concerns Estevez coming home from Vietnam permanently scarred by what happened over there. His parents (Kathy Bates, Martin Sheen) and sister (Kimberly Williams) try to reach him but can't. Something in Vietnam has affected him deeply...and he's about to explode... A bit overlong but still very good. A lot of the material is familar but the cast is so good that they make it seem new. Estevez is good, Sheen is terrific (and Estevezs' real life father), Williams is touching and Bates is just extraordinary--trying to hold the family together. It all leads up to a powerful ending which REALLY surprised me. Well worth catching.",
         "This movie is on cable sporadically, and I never really watched it, thinking it would be similar to the Bruce Willis film \"Ïn America\", with the usual trite story about American freedom, etc. But it was not; it was so much more!. Of course, Martin Sheen is excellent; (I have never seen him in a movie I haven't loved, even if the script is bad, because he is so talented). Kathy Bates is the overbearing mom, and does a great job. The real surprise is Emilio Estevez, who has not always been in the greatest films, but also directed this movie. Please don't stereotype him from the \"Breakfast Club\" movie; he is so much better in this, and I wish he would do more non-commercial, atypical Hollywood movies. The film is realistic, as we see Emilio home from Vietnam, during Thanksgiving. Kimberly Williams is passable as the sister, who feels she is \"disgraced and embarrassed\" by the returning soldier, her brother; he is quite alienated from the family, and, especially at this time in US history, this story is VERY relevant. I learned a great deal about post-traumatic stress, and you will genuinely empathize with this character; This is not a violent, journalistic portrayal, like \"Platoon\" for example, it is more of a character study, which leaves us even more intrigued and concerned about the effects of war, especially when one considers the young age of the soldiers who are victims. With today's violence, it is rare that a movie causes one to genuinely feel sad, and shed a tear; this does it, and deserves recognition."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Motion Picture Corporation of America (MPCA)",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Jeremy Collier is a Vietnam veteran who has returned home and is struggling to cope with the war experiences that haunt him. He is also at odds with his family, who cannot begin to understand what he has been through. Jeremy's battles with his family finally spiral out of control on Thanksgiving Day, when a bitter secret is revealed.",
         "Haunted by his experiences in the Vietnam War, a young man returns home and has trouble adjusting back to civilian life, his family and his stern father."
      ],
      "budget": 0
   },
   "movielensId": 1548,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-20",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Emilio Estevez"],
      "runtime": 119,
      "movieId": 1548,
      "title": "The War at Home",
      "mpaa": "R",
      "actors": [
         "Emilio Estevez",
         "Kathy Bates",
         "Martin Sheen",
         "Kimberly Williams-Paisley",
         "Carla Gugino"
      ],
      "imdbMovieId": "0118117",
      "originalTitle": "The War at Home",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["x2sjkcs6F_w"],
      "plotSummary": "Jeremy Collier is a Vietnam veteran who has returned home and is struggling to cope with the war experiences that haunt him. He is also at odds with his family, who cannot begin to understand what he has been through. Jeremy's battles with his family finally spiral out of control on Thanksgiving Day, when a bitter secret is revealed",
      "tmdbMovieId": 59232,
      "avgRating": 3.12195,
      "releaseYear": "1996",
      "numRatings": 41,
      "posterPath": "/la11ac7YYCDBsizOkKxqwn71VKQ.jpg"
   }
}