{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mexico",
            "id": 534
         },
         {
            "name": "shaman",
            "id": 11326
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0114303",
      "video": false,
      "title": "Rough Magic",
      "recommendations": [54699],
      "backdrop_path": "/mIhFZ6wHuP0eIzjihNlfPVAFixh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Myra Shumway",
               "gender": 1,
               "credit_id": "52fe46cec3a36847f81131cb",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Alex Ross",
               "gender": 2,
               "credit_id": "52fe46cec3a36847f81131cf",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Doc Ansell",
               "gender": 2,
               "credit_id": "52fe46cec3a36847f81131d3",
               "name": "Jim Broadbent",
               "profile_path": "/50TV6UKJKjmqdn1GQNuuCIYHLzP.jpg",
               "id": 388,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Cliff Wyatt",
               "gender": 2,
               "credit_id": "52fe46cec3a36847f81131d7",
               "name": "D.W. Moffett",
               "profile_path": "/l2IZeyX8WrG2SINrXaA1ibQfLLn.jpg",
               "id": 87956,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Magician",
               "gender": 2,
               "credit_id": "52fe46cec3a36847f81131db",
               "name": "Kenneth Mars",
               "profile_path": "/xS8r7UXRtBLLCa5MPo0zYP66VlZ.jpg",
               "id": 9601,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Diego",
               "gender": 2,
               "credit_id": "52fe46cec3a36847f81131df",
               "name": "Paul Rodríguez",
               "profile_path": "/lbI7Ot0rg6jhqhDwYpGFGQIA9BC.jpg",
               "id": 55259,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Powerbroker",
               "gender": 0,
               "credit_id": "52fe46cec3a36847f81131e3",
               "name": "Michael Ensign",
               "profile_path": "/nyTn32fU0E1pQpIUeuiTAehaAee.jpg",
               "id": 1080265,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46cdc3a36847f81131bb",
               "name": "Clare Peploe",
               "profile_path": "/fKMr5Lo28D6rOsUeNVEEL5E5ucg.jpg",
               "id": 133420,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cec3a36847f81131c7",
               "name": "Robert Mundi",
               "profile_path": null,
               "id": 133421,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58b55e819251410a80009669",
               "name": "James Hadley Chase",
               "profile_path": "/4oDEz1kPTzYaMwzzAovmhkqB5cz.jpg",
               "id": 115054,
               "department": "Writing",
               "job": "Book"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 2.146655,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 45671,
      "vote_count": 10,
      "budget": 0,
      "overview": "A sleazy politician sends an agent (Russell Crowe) after his ex-fiancee (Bridget Fonda), who fled to Mexico with incriminating film of him.",
      "similar": [
         258480,
         370663,
         401898,
         12793,
         244772,
         858,
         112160,
         141,
         634,
         43923,
         513,
         12165,
         11634,
         297762,
         376867,
         437557,
         242224,
         1391,
         300667,
         455661
      ],
      "original_title": "Rough Magic",
      "runtime": 100,
      "poster_path": "/wXoV64GylOK8xKNgwe3msc4ZeGi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Recorded Picture Company (RPC)",
            "id": 11561,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Goldwyn Films",
            "id": 720,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-07",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "In the world of magic, the hand is quicker than the eye and love is the wild card.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Clare Peploe"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "James Hadley Chase",
         "Robert Mundi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114303/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMTgzNDQxN15BMl5BanBnXkFtZTcwMTQzMjIyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Bridget Fonda, Russell Crowe, Jim Broadbent | See full cast and crew »"],
      "reviews": [
         "Give this little movie a break. It can actually be funny at times. Don't expect something deep and meaningful, but there are worse ways you could spend an hour and 45 minutes out of your life. Besides, it's got Russell Crowe in it.",
         "When I first saw this movie I knew I liked it immensely, but I didn't really know why. I had to see it several times before I really \"got\" it. It's a very very different movie. The symbolism was a treat! Things which were shown in a fantasy-type way are things which happen in real life--e.g. bitterness being shown as an egg being laid that when hatched, is a venomous spider. In this movie, just about anything can happen! Love is magic but love can't happen with bitterness in the way; likewise, magic can't happen without love. The actors exuded the '40's style with finesse with the witty lines, and Bridget Fonda's costumes were exciting. I will surely watch this movie again and share it with others.",
         "\"Rough Magic\" is a funny, sophisticated piece of fluff about losing and finding one's heart. Russell Crowe looks young and sweet. The Mexican Spanish spoken is entertaining, and Peploe's use of Mayan Indians and a kind of eclectic shamanism mixed with magic rings emotionally true. I loved this film and you will, too, if you are not too hung up on logic.",
         "Rough Magic is one of those movies that doesn't seem to be what it is, and at times doesn't seem sure itself what type of movie it is. It begins with a heroine on the run, and quickly becomes very surreal. I liked the characters, but the story wasn't quite strong enough to hold it all together, and it dissolutes almost completely at the ends, as if they ran out of ideas and decided to end it. Still, it's worth watching for the bizarre spins of events and some very funny moments.",
         "I recently had to watch this movie for a study at UCSB, and, really, with the opening few scenes, I was not exactly thrilled. However, I did find myself feeling like I was actually in the movie at quite a few points, definitely immersed, experiencing a sort of flow, and had elicited in me quite a noticeable emotional response. Truly, I have found that anything with R. Crowe in it is usually frigging awesome, and I had never before experienced a movie with B. Fonda, who in this movie is irresistibly cute! I found out after the study that I was in the \"female/romance\" category, and was subjected to two more movies which were no more than mere trash. This movie, albeit old, was for me enthralling in the category of Romancing the Stone, though more realistic in some ways, and far more fake in others. I definitely recommend this movie if you've got netflix or the like, it's a good movie to zone out to, but I'll tell you what, I had the urge more than once to have a smoke. I guess that's what one would expect from a movie set in the 50's. Enjoy!",
         "This is definitely the best thing Bridgit Fonda has ever done. Claire Peploe's little masterpiece was not appreciated by most critics, but I absolutely loved it. It's a film about magic. All the different levels and layers of magic - from stage illusion to multiple levels of reality and spiritual experience, to the magic of love. All the different levels and layers of magic are intertwined - woven together so that magic is a part of daily life. The film is witty, surprising, challenging and, above all, lots of fun. Now that it's out on video, don't miss it!",
         "I happen to think it is a pretty good movie. It's got magic and love and Russell Crowe and it's nice. It's an entertaining love story, with a touch of magic. How can you not enjoy that? Also, did I mention it has magic in it? ;)",
         "I saw this in the theatre and on video, and recommend it in the theatre, a better effect... as far as the movie, I loved it, really, thought it was great and would definitely see it again...acting was good, production design was good and the story kept me interested and wondering what was going to happen next... Q",
         "\"Rough Magic\" is a little undiscovered gem. I came across it going through Russell Crowe's output and fell in love with it immediately. It was lighthearted, magical, elegant, whimsical, humorous, gently satirical, self mocking, yet meaningful all at once. But most of all it seemed to speak of something important in such an elusive way as to be completely incomprehensible. This is a hallmark of all mystical teachings; they seem to relate most mundane stories yet they keep calling you back for another look. It happens because the nagging feeling that you are missing something essential and of great importance doesn't leave you alone. Over the years I have watched \"Rough Magic\" enough times for it to loose its freshness, but that has not happened somehow. Each time i see it i am delighted anew by the vivid locale, its true to the period costumes and sets, its music that is just right at every turn, its good looking international cast that carries the movie's invisible agenda perfectly.",
         "Russell Crowe can pull off the 1950's type of style without hesitation. This movie shows that nice, sweet, and caring side we didn't get to see much of in L.A. Confidential. Bridget Fonda's innocent way of looking at things is refreshing, though tainted at times. Though not a full on drama, this movie plays with love on much of the lighter scale, but still emphasizes the dangers in losing one's heart in a relationship."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Fantasy"
      ],
      "productionCompanies": [
         "Union Générale Cinématographique (UGC)",
         "Recorded Picture Company (RPC)"
      ],
      "summaries": ["Set in the 1950s, Rough Magic tells the story of what happens when a pretty apprentice magician goes to Mexico to escape her fiancé, a wealthy politician, and to find a Mayan shaman who will teach her ancient principles of magic. She is being trailed by a detective hired by her fiancé. He's a former photojournalist traumatized by what he saw in Hiroshima. The photojournalist joins her in the search for the Mayan shaman, and falls in love with her; the feeling is not reciprocated. When she finds the shaman, she drinks a potion which empowers her to do magic. The potion has life-changing effects on her and her relationship with her companion. They have strange experiences which are brought about by magic."],
      "budget": 0
   },
   "movielensId": 1549,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-07",
      "dvdReleaseDate": "2002-08-06",
      "directors": ["Clare Peploe"],
      "runtime": 100,
      "movieId": 1549,
      "title": "Rough Magic",
      "mpaa": "",
      "actors": [
         "Bridget Fonda",
         "Russell Crowe",
         "Jim Broadbent",
         "D.W. Moffett",
         "Kenneth Mars",
         "Paul Rodríguez",
         "Michael Ensign"
      ],
      "imdbMovieId": "0114303",
      "originalTitle": "Rough Magic",
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["owEh5L1DzwM"],
      "plotSummary": "A sleazy politician sends an agent (Russell Crowe) after his ex-fiancee (Bridget Fonda), who fled to Mexico with incriminating film of him.",
      "tmdbMovieId": 45671,
      "avgRating": 2.99259,
      "releaseYear": "1995",
      "numRatings": 135,
      "posterPath": "/wXoV64GylOK8xKNgwe3msc4ZeGi.jpg"
   }
}