{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "burma",
            "id": 5499
         },
         {
            "name": "rangoon",
            "id": 5855
         },
         {
            "name": "doctor",
            "id": 13005
         }
      ],
      "imdb_id": "tt0112495",
      "video": false,
      "title": "Beyond Rangoon",
      "recommendations": [
         118991,
         11907,
         46335,
         78146,
         142374,
         142373,
         40522,
         43000,
         17376,
         134184,
         46074,
         73455,
         94623,
         27984,
         49559,
         116008,
         64559,
         15719,
         24073,
         27444
      ],
      "backdrop_path": "/gi8eGsDUkLVB2OZlS8AG3YRTSKa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Laura Bowman",
               "gender": 1,
               "credit_id": "52fe431cc3a36847f803b1c5",
               "name": "Patricia Arquette",
               "profile_path": "/9Sz0M91CHHkJ5tlPteiXv34gpgK.jpg",
               "id": 4687,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Andy Bowman",
               "gender": 1,
               "credit_id": "52fe431cc3a36847f803b1c9",
               "name": "Frances McDormand",
               "profile_path": "/jodV4NuQAvxQWIHxqnop1jUX77N.jpg",
               "id": 3910,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "U Aung Ko",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1cd",
               "name": "U Aung Ko",
               "profile_path": null,
               "id": 19668,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jeremy Watt",
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b1d1",
               "name": "Spalding Gray",
               "profile_path": "/xXUGK1bQRi6vBT8Xu0NsShIEKRe.jpg",
               "id": 8978,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "San San, Hotel Desk Clerk",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1d5",
               "name": "Tiara Jacquelina",
               "profile_path": "/ywcVULYmLFqJGmIgxriUlwbRSPN.jpg",
               "id": 19669,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Australian Doctor",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1d9",
               "name": "Ann Howard",
               "profile_path": null,
               "id": 19670,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Scott",
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b1dd",
               "name": "Victor Slezak",
               "profile_path": "/nLFIO3GsnHgy1DAXMVSmqlooLQu.jpg",
               "id": 10379,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Zaw Win",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1e1",
               "name": "Ye Myint",
               "profile_path": null,
               "id": 19671,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Zabai",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1e5",
               "name": "Cho Cho Myint",
               "profile_path": null,
               "id": 19672,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Nick Bowman",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1e9",
               "name": "Michael Pickells",
               "profile_path": null,
               "id": 19674,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Danny Bowman",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1ed",
               "name": "Enzo Rossi",
               "profile_path": null,
               "id": 19675,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "Colonel",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b233",
               "name": "Kuswadinath Bujang",
               "profile_path": null,
               "id": 19682,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Min Han",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b237",
               "name": "Johnny Cheah",
               "profile_path": null,
               "id": 19683,
               "order": 12
            },
            {
               "cast_id": 30,
               "character": "Karen Father",
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b241",
               "name": "M.Rajoli",
               "profile_path": "/saO8BGdE62DJlvEdGcZ3jmoLn4J.jpg",
               "id": 1279442,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b1b5",
               "name": "John Boorman",
               "profile_path": "/zPZkbiZms6DUZz74xLLFFGUJY0n.jpg",
               "id": 19665,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b1bb",
               "name": "Alex Lasker",
               "profile_path": null,
               "id": 19666,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b1c1",
               "name": "Bill Rubenstein",
               "profile_path": null,
               "id": 19667,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b1f3",
               "name": "John Boorman",
               "profile_path": "/zPZkbiZms6DUZz74xLLFFGUJY0n.jpg",
               "id": 19665,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b1f9",
               "name": "Eric Pleskow",
               "profile_path": null,
               "id": 19676,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b1ff",
               "name": "Sean Ryerson",
               "profile_path": null,
               "id": 19677,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b205",
               "name": "Barry Spikings",
               "profile_path": null,
               "id": 14895,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b20b",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b211",
               "name": "John Seale",
               "profile_path": "/w4wp04pRMqJI2vt3gFTdIWLDDzp.jpg",
               "id": 2702,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b217",
               "name": "Ron Davis",
               "profile_path": null,
               "id": 19678,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b21d",
               "name": "Anthony Pratt",
               "profile_path": null,
               "id": 18986,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe431cc3a36847f803b223",
               "name": "Mary Gail Artz",
               "profile_path": null,
               "id": 19679,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe431cc3a36847f803b229",
               "name": "Barbara Cohen",
               "profile_path": null,
               "id": 19680,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe431cc3a36847f803b22f",
               "name": "Eddie Fowlie",
               "profile_path": null,
               "id": 14009,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe431cc3a36847f803b23d",
               "name": "Errol Kelly",
               "profile_path": null,
               "id": 19681,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.388661,
      "production_countries": [],
      "id": 1873,
      "vote_count": 26,
      "budget": 0,
      "overview": "Patricia Arquette stars as American widow Laura Bowman, a young doctor who's unwittingly drawn into political turmoil while vacationing in Burma in the late 1980s, in this fictionalized drama based on actual events. Bowman initially left San Francisco with her sister (Frances McDormand) in an attempt to escape painful memories of her husband and son's violent deaths. But her fight to escape to Thailand could prove just as harrowing.",
      "similar": [
         40807,
         25269,
         510,
         1903,
         340837,
         336843,
         10312,
         26976,
         4922,
         8836,
         1700,
         1523,
         7555,
         11005,
         5503,
         1927,
         1955,
         88,
         297,
         956
      ],
      "original_title": "Beyond Rangoon",
      "runtime": 100,
      "poster_path": "/5CQgpLITPo33AEN1jULsyiHxSDJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-05-24",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Truth has a witness",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Boorman"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Alex Lasker",
         "Bill Rubenstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112495/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwODgxMTA1NV5BMl5BanBnXkFtZTcwNzg0MTgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Patricia Arquette, U Aung Ko, Frances McDormand | See full cast and crew »"],
      "reviews": [
         "This is one of the most underrated movies of the 1990s. If you allow yourself to identify with the Patricia Arquette character, you will find it to be a very moving story of a woman regaining a sense of purpose to her life, and finding a new will to live. Arquette's performance is brave because it is purposefully \"wooden\" -- it's a way of defining her character's spiritual death, her complete lack of a desire to be alive. She moves through life like a zombie because her family has been murdered and she can't see the point of living. What is moving is how in the course of the story, she is reawakened -- by the Burmese landscape, by the beautiful quality of its people and landscapes, and by the primal choices she is forced to confront. Boorman supports this visually (and Hans Zimmer supports it with one of his most gorgeous, haunting scores) with an often static camera and with a propensity to shoot through glass, windows, windshields, etc. We are on the outside looking in, just like Arquette.... until she finds herself deep in the jungle and is forced to choose whether or not to fight for her life. I recommend the 1954 movie THE PURPLE PLAIN as well. It's a similar story in a similar setting, and makes for a fascinating comparison.",
         "I first saw Beyond Rangoon years ago, and my interest in South East Asia has kept growing ever since. Laura's husband and son have just been murdered. Seeing her sink into depression, her sister takes her on a tour of Burma hoping the change will somehow get her back on track. Due to a thoughtless mistake Laura finds herself trapped in the country on her own, finding herself face to face with the exactions of the military dictatorship. She meets an old professor who becomes her only way out of the country. During their escape through the Burmese jungle, tracked by the military, Laura finds herself forced to fight her way back into life. She gradually lets go of her own pain to focus on the country's wounds. And I just love the ending, it's a wise one. I'd like to answer some other reviewers' comments: Laura is MEANT to be in that comatose don't-give-a-damn state. Arquette's interpretation is spot on. That's the sort of state I'd be in if I had seen the people I cherish the most lying in a pool of blood on my living room floor. This is what makes her wander out of the safety of the US Embassy even though as an intelligent woman she's bound to sense the danger of doing this. What's happened to her has made her almost suicidal, \"I was stone myself\". The film is well paced, the acting is good, and the scenery is beautiful. Intense and food for thought, this film will be haunting you for days. That's an 8/10. So what is Columbia waiting for to release it on DVD ??",
         "Never had I seen such a powerful true story movie. I discovered a city, a country, a lost revolution and even a Nobel prize winner thanks to this masterpiece of cinema. If you haven't seen this movie, you can't say you've seen anything . A great lesson of courage, humility and life. I haven't seen anything as good since. T.E. Saturday, January 9th, 1999",
         "Patricia Arquette plays American doctor Laura Bowman, who takes a holiday to Burma in an attempt to heal her spirit after the murders of her husband and young son. She is left behind in Rangoon during a military crackdown and leaves the city with an aging man who works as a \"tour guide.\" But he is no simple tour guide; he is a professor who introduces her to the life outside of the tourist traps ... the two of them get caught up in the political upheaval and Laura sees with her own eyes how the government betrays and oppresses its own people. This movie is one of my favorites because of its themes. First, it's informational (describing some of the injustices that are occurring in Burma). Secondly, it's about a woman's struggle to find meaning in life after an incredible loss. Thirdly, it's about compassion and sacrifice, and people coming together - without even knowing each other - to endure pain and fear. Just about every beautiful scene in this movie is important; nothing is wasted here. It's an earnest and moving film. There is also a very emotional score composed by Hans Zimmer which complements scenes nicely. A definite recommend, especially to people concerned with human rights ... and people who want to know, \"What purpose can I serve?\"",
         "This movie was working toward two goals: to make a political point and to tell a scary adventure story. It's often difficult to do make a political point and still tell a good story (consider the highly political but rarely-entertaining final season of Ellen). Beyond Rangoon finds a good balance between politics and storytelling. I already knew that Aung San Suu Kyi had won the 1991 Nobel Peace Prize, and knew something about the oppressive political situation in Burma, so the political message of the movie was mostly a dramatization of what I already knew. But I thought the movie did a good job of telling about Aung San Suu Kyi and the mostly-faceless dictators who have for years tried to silence her. The device of presenting an unfamiliar setting through the eyes of a character that viewers can identify with is fairly common, but it's quite well done in this movie. Of course, the real measure of the movie was its entertainment value. Arquette was excellent as a young woman whose sister took her to a distant, unfamiliar place to shake her out of her depression over the violent deaths of her husband and son. She is convincingly detached and depressed. Her grieving condition gives her a clear reason for her distracted wanderings into the thick of a dangerous situation she does not understand, something she'd otherwise be much too intelligent to stumble into. Once the dangers become so obvious that she can see through them even through the cloud of grief, she's trapped, with no easy escape. That sets her on a path of adventure where she needs her intelligence to survive. The writers deserve much credit for making her intelligent and resourceful enough to deal with numerous dangerous situations, while still finding a plausible reason for her to be foolish enough to get into trouble in the first place. The directing is strong also, keeping up the tension throughout the race to escape the forces of the dictatorship. This movie had additional impact on me and my wife because of other events of the same time period. We were preparing for a trip to India, and heard news reports of Western tourists who had been taken hostage by a terrorist group in India. Avoiding isolated terrorists in a peaceful democratic country is quite a different matter from escaping an oppressive dictatorship. But the movie and the news shared the element of avoiding danger in an unfamiliar country. That common characteristic gave the movie meaning beyond the strength of its own skillful storytelling. The movie illustrates the international tourist's worst nightmare.",
         "While the movie has its flaws, it brings to light some of the problems that come with living in a country that has no democracy. It makes you empathize with the people under such a government and makes you want to learn more about their lives, their struggles and a potential leader Aung San Suu Kyi. It makes one wonder why our government will interfere places we are not wanted yet ignore those who ask our help.",
         "This film should be seen by as many people as possible as it concentrates on the human rights problems in Burma. When I first watched this film in the mid 1990's it totally changed my life. I knew very little about Aung San Suu Kyi or her democracy movement. It effected me so I wanted to understand more about the situation. Any film that has the power to make you want to learn more has done its job properly. Patricia Arquette is superb as the American lady who due to personal tragedy has become reckless with her own life decisions and gets caught up in the ensuing conflict. It is a powerful film about a subject matter which deserves more publicity. As the film itself says the 1988 massacre of Pro democracy activists was not televised and therefore largely went unnoticed to the world. I implore everyone reading these comments to take the time to find out more about the current plight of the Burmese people. It is about time this film was released on DVD. Can anything be done?",
         "In the 90's, the American doctor Laura Bowman (Patricia Arquette) travels to Burma (presently Myanmar) with her sister and also doctor Andy Bowman (Frances McDormand) to recover from the loss of her beloved husband and son that were murdered in a theft at home. Laura sees a political pro-democracy manifestation to support the leader Aung San Suu Kyi and she decides to participate; however she loses her passport and she is not allowed to leave Rangoon. While waiting to have another flight, Laura meets the unofficial tourist guide U Aung Ko, who is also a leader of an underground movement, and she decides to visit the countryside of Burma. However, the military dictatorship represses the movement and Laura, U Aung Ko and several civilians try to escape to Thailand in a dangerous journey. \"Beyond Rangoon\" is an underrated film that has not aged, with top-notch performance of the gorgeous Patricia Arquette, I saw this film twice on VHS in the 90's and it is amazing that the military dictatorship still does exist in this country. In accordance with the statement of John Boorman in the Extras of the DVD, the dramatic scene when the commander orders to shoot the politician Aung San Suu Kyi did really happen. Aung San Suu Kyi won the 1991 Nobel Peace Prize and shamefully was only released from house arrest on 13 November 2010. My vote is eight. Title (Brazil): \"Muito Além de Rangum\" (\"Far Beyond Rangoon\")",
         "\"The trip was Andy's idea. It was easier to say 'Yes' than argue. Always that way with my sister. She meant well. A touch of the exotic east would take me away from everything that reminded me of what had happened...\" So begins the film \"Beyond Rangoon\", about an emotionally troubled American who is urged by her sister to take a vacation in Rangoon, Burma to try and get over the devastating loss of her husband and child. While there, she becomes entertwined in very real political upheavel. The film depicts the marches and rallies and protests realistically, and shows massacres that are hard to watch, but need to be heard. The political upheavals that really happened in Burma in 1988 were never heard or talked about in the US, and needed to be. Aung San Su Kyi was a woman who was trying to bring Burma (Now Myanmar) to democracy, but was denied by the government. She still tried to lead her people to freedom, and the struggle still exists today. The film has powerful writing, directing, cinematography and acting. The absolutely chilling and powerful score by Hans Zimmer lends riveting power to each scene, and fills triumphant moments with triumph. Patricia Arquette portrays the American, Laura Bowman, with depth, very frozen by the horrors of her loss, \"I tried finding something in those stone statues, but nothing stirred in me. I was stone myself\", but slowly she sees the meaning of her life and others in her journeys throughout Rangoon and beyond. A terrific film. And it needs to be watched. At home, and in history or government classes. **** stars.",
         "Beyond Rangoon is one of the most emotional and intense films ever made. Superbly directed by John Boorman, and intensly acted by Patricia Arquette, this film can easily be called one of the best films of the 90's. The story and vivid characters just grab the audience from the very opening, and never lets go. After seeing the film, the viewer will never be able to forget \"Beyond Rangoon\". The film made little money at the box office, and is little known, but should be high profile. Watching it, you can tell that it was meant to be seen by a large audience. It is a very important and moving film, and should be seen by everyone."
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Columbia Pictures Corporation"
      ],
      "summaries": [
         "Laura is trying to pick up the pieces of her life after the murder of her husband and son, and goes on vacation with her sister to Burma. After losing her passport at a political rally, she is left on her own for a few days, during which time she falls in with students fighting for democracy. She and their leader, U Aung Ko, travel through Burma, whilst witnessing many bloody acts of repression by the dictatorship, in an attempt to escape to Thailand. Based on a true story.",
         "In the 90's, the American doctor Laura Bowman travels to Burma (presently Myanmar) with her sister and also doctor Andy Bowman to recover from the loss of her beloved husband and son that were murdered in a theft at home. Laura sees a political pro-democracy manifestation to support the leader Aung San Suu Kyi and she decides to participate; however she loses her passport and she is not allowed to leave Rangoon. While waiting to have another flight, Laura meets the unofficial tourist guide U Aung Ko, who is also a leader of an underground movement, and she decides to visit the countryside of Burma. However, the military dictatorship represses the movement and Laura, U Aung Ko and several civilians try to escape to Thailand in a dangerous journey."
      ],
      "budget": 23000000
   },
   "movielensId": 155,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-05-24",
      "dvdReleaseDate": null,
      "directors": ["John Boorman"],
      "runtime": 100,
      "movieId": 155,
      "title": "Beyond Rangoon",
      "mpaa": "R",
      "actors": [
         "Patricia Arquette",
         "Frances McDormand",
         "U Aung Ko",
         "Spalding Gray",
         "Tiara Jacquelina",
         "Ann Howard",
         "Victor Slezak",
         "Ye Myint",
         "Cho Cho Myint",
         "Michael Pickells",
         "Enzo Rossi",
         "Kuswadinath Bujang",
         "Johnny Cheah",
         "M.Rajoli"
      ],
      "imdbMovieId": "0112495",
      "originalTitle": "Beyond Rangoon",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["0WhJt46AhFk"],
      "plotSummary": "Patricia Arquette stars as American widow Laura Bowman, a young doctor who's unwittingly drawn into political turmoil while vacationing in Burma in the late 1980s, in this fictionalized drama based on actual events. Bowman initially left San Francisco with her sister (Frances McDormand) in an attempt to escape painful memories of her husband and son's violent deaths. But her fight to escape to Thailand could prove just as harrowing.",
      "tmdbMovieId": 1873,
      "avgRating": 3.39553,
      "releaseYear": "1995",
      "numRatings": 1321,
      "posterPath": "/5CQgpLITPo33AEN1jULsyiHxSDJ.jpg"
   }
}