{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "actor",
            "id": 207716
         }
      ],
      "imdb_id": "tt0120373",
      "video": false,
      "title": "Trial and Error",
      "recommendations": [
         46924,
         76297,
         17207,
         61418,
         2703,
         110624,
         22792,
         13064,
         25010,
         47359,
         16297,
         19809,
         157036,
         25576,
         273610,
         24081,
         27307,
         19033,
         30653,
         24618
      ],
      "backdrop_path": "/rl0nQ6RVuxT9XAJcAAo00zhCRVn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Charles 'Charlie' Tuttle",
               "gender": 2,
               "credit_id": "52fe47469251416c75093879",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Billie Tyler",
               "gender": 1,
               "credit_id": "52fe47469251416c7509387d",
               "name": "Charlize Theron",
               "profile_path": "/k5Xt2mNlraX7yHYaPy9gvayCaKV.jpg",
               "id": 6885,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Richard 'Ricky' Rietti",
               "gender": 2,
               "credit_id": "52fe47469251416c75093881",
               "name": "Michael Richards",
               "profile_path": "/fhUgS8p7YBSwDNEFb7WO0jdItBx.jpg",
               "id": 50807,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Elizabeth Gardner",
               "gender": 1,
               "credit_id": "52fe47469251416c7509388b",
               "name": "Jessica Steen",
               "profile_path": "/lZMvl7tJZPThfF7Lnui4wgEoOIf.jpg",
               "id": 42707,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Richter Paul Z. Graff",
               "gender": 2,
               "credit_id": "52fe47469251416c7509388f",
               "name": "Austin Pendleton",
               "profile_path": "/pxcdhd4oAsnhvUg0BalmiiKJyXg.jpg",
               "id": 6168,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Benny",
               "gender": 2,
               "credit_id": "52fe47469251416c75093893",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tiffany Whitfield",
               "gender": 0,
               "credit_id": "52fe47469251416c75093897",
               "name": "Alexandra Wentworth",
               "profile_path": "/qZ8amXt6E7CIIXi4RAkA8reHY7k.jpg",
               "id": 104998,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jackie",
               "gender": 1,
               "credit_id": "52fe47469251416c7509389b",
               "name": "Jennifer Coolidge",
               "profile_path": "/jOVVWdfxLQ9MOumqM3VxiwAlT9a.jpg",
               "id": 38334,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dr. Brown",
               "gender": 2,
               "credit_id": "52fe47469251416c7509389f",
               "name": "Max Casella",
               "profile_path": "/5CNTDSCBhWPclTLTyTBy8oHUkzb.jpg",
               "id": 7133,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Dr. German Stone",
               "gender": 2,
               "credit_id": "52fe47469251416c750938a3",
               "name": "Dale Dye",
               "profile_path": "/vQfhfRjwOHYN3Egx1SB21ResBI2.jpg",
               "id": 3211,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Whitfield",
               "gender": 2,
               "credit_id": "52fe47469251416c750938a7",
               "name": "Lawrence Pressman",
               "profile_path": "/mot6LcTgUnZKd1U60iZNxytNpdQ.jpg",
               "id": 6564,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47469251416c75093887",
               "name": "Jonathan Lynn",
               "profile_path": "/nvMGnGbGdXrRvGAjulNqhJWUB9c.jpg",
               "id": 21217,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47469251416c750938b3",
               "name": "Gregory Bernstein",
               "profile_path": null,
               "id": 148118,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47469251416c750938b9",
               "name": "Gary Ross",
               "profile_path": "/dMoUDOJHsGrQcxKpFgbuMWRwiyI.jpg",
               "id": 23964,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56aa4d29c3a36872cf0071fa",
               "name": "Sara Bernstein",
               "profile_path": null,
               "id": 1569460,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56aa4d6cc3a36872d300711d",
               "name": "Gabriel Beristain",
               "profile_path": "/zpy2AF6fmOFgZTKcLV1Wa3raQ9N.jpg",
               "id": 10832,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56aa4d4192514159a5001bab",
               "name": "Cliff Gardner",
               "profile_path": null,
               "id": 1569464,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "56aa4d519251417db9006a21",
               "name": "Sara Bernstein",
               "profile_path": null,
               "id": 1569460,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56aa4d57c3a36872d8006c8d",
               "name": "Gregory Bernstein",
               "profile_path": null,
               "id": 148118,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "56aa4d82c3a36872d8006c91",
               "name": "Terry Liebling",
               "profile_path": null,
               "id": 8337,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56aa4d8f9251416fd8000db2",
               "name": "Tony Lombardo",
               "profile_path": null,
               "id": 56972,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "56aa4d9ec3a36872d3007125",
               "name": "Victoria Paul",
               "profile_path": null,
               "id": 22008,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "56aa4dbe9251417dcb006c6c",
               "name": "Shay Cunliffe",
               "profile_path": null,
               "id": 19971,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "56aa4dcac3a36872cd0076a2",
               "name": "Paula Barrett-Barbier",
               "profile_path": null,
               "id": 1424319,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "56aa4debc3a36872d8006cac",
               "name": "Mary Parent",
               "profile_path": null,
               "id": 114408,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56aa4dfb92514159a5001bc1",
               "name": "Allen Alsobrook",
               "profile_path": null,
               "id": 1569468,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56aa4e0ac3a36872cf007221",
               "name": "Jonathan Lynn",
               "profile_path": "/nvMGnGbGdXrRvGAjulNqhJWUB9c.jpg",
               "id": 21217,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.182584,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17770,
      "vote_count": 23,
      "budget": 0,
      "overview": "An actor poses as a lawyer to help his sick friend, and problems develop.",
      "similar": [
         3134,
         8810,
         281,
         948,
         298312,
         4638,
         634,
         10212,
         11564,
         445954,
         43923,
         133805,
         2142,
         4771,
         12162,
         769,
         59,
         185,
         949,
         10285
      ],
      "original_title": "Trial and Error",
      "runtime": 98,
      "poster_path": "/e9QDfK4ChiUa8gekyg54cMqA3Uo.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1997-05-30",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Lynn"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Sara Bernstein",
         "Gregory Bernstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120373/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2NDA5NzA1M15BMl5BanBnXkFtZTcwNjI2ODEyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Richards, Jeff Daniels, Charlize Theron | See full cast and crew »"],
      "reviews": [
         "I found this movie to be most entertaining, with all the cast giving excellent performances. I'm not one to criticise or analyse, but tend to view a film as a whole. The courtroom scenes were infomative(as to procedure)as well as amusing, and the romantic interest was endearing. Especially enchanting was Charlize Theron, as waitress Billie Tyler, as she was cheerful, kindly, and even brave (when she thought she had lost her boyfriend to a rival). Yet it was she who innocently caused the whole problem - by serving her own alcoholic cocktail! I'm putting this movie among my favourites.",
         "We spend so much time as movie enthusiasts that we often only look for films people would consider revolutionary (e.g. Donnie Darko, Fight Club, etc.) but every once in awhile a noraml run of the mill comedy is nice. Trial and Error, however, had some of the most ridiculously funny scenes I have ever seen Micheal Richards in - his audtion near the beginning, his cross examination of 'Buck.' These scenes a lone are enough reason to see the movie. All said and done, Micheal Richards kills it in this movie... Some people have said that he still is trying to play off his role of Kramer but what we must understand is that regardless the role Micheal Richards constantly brings his own personality to the characters he plays and I wouldn't have it any other way. See it. Twice.",
         "Lots of A-list actors, simple story to follow with light hearted humor. Another movie showing how beautiful Charlize Theron is, fans of her will appreciate that. Michael Richards is funny as always. Jeff Daniels is very good, none of that stupid humor like in Dumb and Dumber. Austin Pendleton plays his typical character, goofy yet professional. The whole movie is very predictable but the actors that are cast keep it interesting. Recommend watching it without great expectations. So for a relaxing afternoon stick a bag of popcorn in the microwave and rent this movie for an hour and a half of a good story with entertaining acting.",
         "Richard Rietti!!! Best character name in movie history. Worth the price of admission just to watch Rietti fall and bumble...and fall...and bumble. Let us also not forget another vintage performance by the one and only Rip Torn. I would pay money to watch a Ron Popeil Infomercial if Rip Torn was prominently involved. Jeff Daniels gets it done as the schlub lawyer who likes his chicken salad with mustard, not mayonnaise. Finally, we have Charlize Theron at her absolute apex (lookswise, not as an actress...clearly). You just knew it would lead to bigger & better things for her, and it did. Worth checking out. RIETTI!!!!!",
         "This one had all ingredients for a great comedic recipe. It surprises me that it didn't recieve more attention. A great view of how something seemingly simple can quickly become absurd. All through this movie were characters of stark contrasts. What ensues is a complete loss of control of a simple thing and the way in which the different characters handle it. The irony of the whole thing is that the harder the serious ones tried to control the situation, the more out of control the thing got. The real brilliance though, lies in Richards' character, Richard Rietti. Playing as an actor, he approaches life as one big play, and the lawyer as yet another role. All the world's a stage. I think this movie points this out for us. In the end, we can only laugh at man's attempt to establish order, whether in the courtroom, or in life, in the face of chaos.",
         "This film illustrates that appearances can be deceiving. Each of the main characters is playing a role that is somehow contrary to that person's real identity. In the case of the Rip Torn character, who is on trial for fraud, the deception is obvious, despite his ludicrous attempt to justify his fraudulent actions. And it is equally obvious in the case of the Michael Richards character, who is pretending to be a lawyer to help out his friend. But the other characters also are revealed to be different than who they appear to be. This is a wonderful movie, which raises important questions about the veneer most of us use to hide our real selves. Like most good comedians (e.g., Robin Williams, Steve Martin), Michael Richards is also a fine actor, and his closing argument in the case is an especially masterful piece of acting.",
         "I've always been a fan of Michael Richards, Jeff Daniels and who doesn't love Charlize Theron? I couldn't dare say this movie anywhere near the top 10 funniest movies I've ever seen, but it's got some really good stuff in it. If you're a fan of Charlize Theron like I am, than you really don't need to know anything else other than the fact that she is in the film. The only real complaint I have about the movie is the way that Jeff Daniels gets detained from court in the first place. I thought they could have come up with a better way of getting Michael Richards in the court room than having Jeff Daniels get in a bar fight and then taking too much medicine to go to court the next day. Anyhow, if you have the time and like the actors in the film, then go ahead and see it, but I wouldn't recommend going out of your way to see it. Thanks for reading. -Chris",
         "I think it was about five years ago when I first discovered that this 1997 lawyer comedy existed. It took me this long to finally get around to seeing it, even though I've been familiar with the two stars for quite some time now. I've seen Jeff Daniels as Jim Carrey's co-star in \"Dumb & Dumber\", and knew the now infamous Michael Richards obviously for his role as Kramer in the popular sitcom, \"Seinfeld\", plus his roles in comedy films such as \"UHF\" and \"So I Married an Axe Murderer\". Since I had seen both of these actors in funny movies/TV shows, I figured I might find \"Trial and Error\" mildly amusing, nothing more, judging by its general reception. Expecting a mixed blessing, I didn't get any big surprises, pleasant or unpleasant. Charles Tuttle (Daniels) is a lawyer who will soon be married. His best friend, and best man for the wedding, is an out-of-work actor named Richard Rietti (Richards). Tuttle has been called over to Paradise Bluff, Nevada to defend his fiancée's relative, Benny Gibbs, in a class action fraud suit. When he arrives in the town, Richard (or \"Ricky\") is there, and is ready to throw a bachelor party for his friend. After drinking and getting attacked in the bar, Charlie is not well enough to work the next day, so Ricky decides to go to the courtroom and claim to be a lawyer named Charles Tuttle! Charlie is not happy when he hears what Ricky has done, and soon finds that he now has to pose as an actor named Richard Rietti! Since the real Rietti is not trained to be a lawyer, the real Charlie pretends to be his assistant, using cue cards to tell him what to do on the job while he defends Benny. Obviously, this leads to a horrible mess! There weren't too many times when I laughed really hard while watching this 1997 comedy, but there were many parts I found at least mildly amusing. I can't forget Ricky discovering that his sick friend in bed has emptied out his pill bottle, Ricky trying to prepare Charlie for the trial while he is ill, Charlie's reaction when he learns what Ricky has done, and many things the main characters go through while they pose as each other. Michael Richards and Jeff Daniels are a good pair in the lead roles, which might be the main reason why this film is funny. Richards, with his over-the-top antics, playing a character with good intentions who keeps lousing up, and Daniels, with some of the faces he makes and his character's reactions to Ricky's doings. Unfortunately, the plot isn't too interesting, and if the film were hilarious, that wouldn't matter, but it's not funny enough to prevent the movie from being a little dull. Also, the romance wasn't done so well, eventually getting a little sappy, and the ending leaves much to be desired. This movie came out the same year as \"Liar Liar\", another lawyer comedy. That film is definitely the more popular of the two, but I have to be honest, I prefer this one, as crazy as many people might think I am for that. While Jim Carrey has made me laugh in other films, I found that his antics went too far in that one. Richards and Daniels, while not usually hilarious in the film, are still pretty funny. I'm sure we all know about Richards' racist tirade in November 2006, which obviously permanently damaged his reputation and started a never ending debate over whether he really meant what he said and whether his apology was honest or not. It clearly had more impact than Mel Gibson's tirade earlier that year, and the main reason for that was probably because Richards was caught on video. I remember feeling like I could never watch anything with Richards in it again after I first heard about the incident and saw the footage, but now, regardless of his reputation and what may go on in his head, I have to admit, he can still make me laugh in the comedies I see him in. If you like the two co-stars in \"Trial and Error\" as comedians, then this flick could easily make you laugh, or at least some parts could.",
         "This is an interesting and hilariously funny movie! A lawyer about to get married is incapacitated after a bachelor party just prior to a court appearance on a routine case where he represents the defendant. His buddy, an unemployed actor, takes his place at the trial for what is supposed to be a 5 minute appearance. The attractive female prosecutor wants to move on with the case, and the substitute lawyer is committed to participate in the trial. The recovering real lawyer meets a cute waitress and enjoys her company on his day off, only later to find that his friend's errors in court force a continued role as his doppelganger. The courtroom scenes are are absolutely hilarious, as are the off-courtroom romantic entanglements of both friends. Don't miss this movie! It's the kind you will enjoy seeing over and over again.",
         "This movie never got the fair chance it deserved back in the day because it came out at the same time as Liar Liar, a similar vehicle with Jim Carrey at the helm. This one pairs Carrey's \"Dumb & Dumber\" buddy Jeff Daniels with \"Seinfeld\"'s Michael Richards, and I must say - they are a fantastic comic duo! From beginning to end, this movie will make you laugh! And the addition of Charlize Theron doesn't hurt, either. Trial and Error earned a very low box office income, and despite this, film critics Roger Ebert and Leonard Maltin gave positive reviews to the film both rewarding it 3 stars out of a possible four. Watch this on Netflix, or rent it. If you enjoyed Liar Liar and My Cousin Vinny, you will LOVE this! It's a superb movie with so many comedic points!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Larger Than Life Productions",
         "New Line Cinema"
      ],
      "summaries": [
         "Lawyer Charlie Tuttle is defending his wife's relative Benny Gibbs in a class action fraud suit, but when he gets to the city where court takes place, he gets drunk and the following day, when the hearings begin, his friend, actor Richard Rjetti takes his place posing as Charlie. The bad thing is that Richard doesn't know anything about being a lawyer, and Charlie has to teach him as the court goes on.",
         "An actor poses as a lawyer to help his sick friend, and problems develop."
      ],
      "budget": 0
   },
   "movielensId": 1550,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1997-05-30",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Jonathan Lynn"],
      "runtime": 98,
      "movieId": 1550,
      "title": "Trial and Error",
      "mpaa": "PG-13",
      "actors": [
         "Jeff Daniels",
         "Charlize Theron",
         "Michael Richards",
         "Jessica Steen",
         "Austin Pendleton",
         "Rip Torn",
         "Alexandra Wentworth",
         "Jennifer Coolidge",
         "Max Casella",
         "Dale Dye",
         "Lawrence Pressman"
      ],
      "imdbMovieId": "0120373",
      "originalTitle": "Trial and Error",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["4DMkNYxCyKA"],
      "plotSummary": "An actor poses as a lawyer to help his sick friend, and problems develop.",
      "tmdbMovieId": 17770,
      "avgRating": 2.7643,
      "releaseYear": "1997",
      "numRatings": 717,
      "posterPath": "/e9QDfK4ChiUa8gekyg54cMqA3Uo.jpg"
   }
}