{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gorilla",
            "id": 690
         },
         {
            "name": "zoo",
            "id": 2172
         },
         {
            "name": "eccentric",
            "id": 10483
         },
         {
            "name": "socialite",
            "id": 156037
         },
         {
            "name": "chimpanzee",
            "id": 157972
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0118787",
      "video": false,
      "title": "Buddy",
      "recommendations": [
         41779,
         79500,
         34053,
         40480,
         41590,
         80660,
         45928,
         110109,
         42424,
         36344,
         64523,
         83714,
         25697,
         19760,
         65137,
         31633,
         48781,
         32330,
         39128,
         80346
      ],
      "backdrop_path": "/44AUg78Bh1riStNYaaa370CTYfq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mrs. Gertrude 'Trudy' Lintz",
               "gender": 1,
               "credit_id": "52fe46409251416c750724b5",
               "name": "Rene Russo",
               "profile_path": "/aaPzuXRHdyxamPMXqu70okPaqvB.jpg",
               "id": 14343,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Bill Lintz",
               "gender": 2,
               "credit_id": "52fe46409251416c750724b9",
               "name": "Robbie Coltrane",
               "profile_path": "/u07QKPs7wvXxzjXi1UUBSGjjmQm.jpg",
               "id": 1923,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dick Croner, Trudy's Assistant",
               "gender": 2,
               "credit_id": "52fe46409251416c750724bd",
               "name": "Alan Cumming",
               "profile_path": "/5U7rmz20snvKB099P30IJu2nmRb.jpg",
               "id": 10697,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Emma, Lintz's Maid",
               "gender": 1,
               "credit_id": "52fe46409251416c750724c1",
               "name": "Irma P. Hall",
               "profile_path": "/jotUUXdkfC7kdreWHSEVamz2mUy.jpg",
               "id": 43853,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Professor Spatz",
               "gender": 2,
               "credit_id": "52fe46409251416c750724c5",
               "name": "Paul Reubens",
               "profile_path": "/qiY2maQ1iFnoaUiGNGLTKnaj3Xu.jpg",
               "id": 5129,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mr. Joe Bowman",
               "gender": 2,
               "credit_id": "52fe46409251416c750724c9",
               "name": "John Aylward",
               "profile_path": "/jdU2dcdjBM3IbsQv6pEdZT64ajb.jpg",
               "id": 103833,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46409251416c750724cf",
               "name": "Caroline Thompson",
               "profile_path": null,
               "id": 1901,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46409251416c750724d5",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "546cb0bfc3a368096b001756",
               "name": "Caroline Thompson",
               "profile_path": null,
               "id": 1901,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "57edfbb39251416cd60032b4",
               "name": "Gertrude Davies Lintz",
               "profile_path": null,
               "id": 1686778,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "57edfbc59251415e39000b15",
               "name": "William Joyce",
               "profile_path": null,
               "id": 60678,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57edfbcc9251415dee000b1a",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57edfbdb9251415dee000b20",
               "name": "Steve Mason",
               "profile_path": null,
               "id": 51981,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57edfbe2c3a3682ab7000b73",
               "name": "Jonathan P. Shaw",
               "profile_path": null,
               "id": 15806,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.836914,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15170,
      "vote_count": 19,
      "budget": 0,
      "overview": "An eccentric socialite raises a gorilla as her son.",
      "similar": [
         858,
         112160,
         634,
         297762,
         437557,
         43923,
         141,
         242224,
         2771,
         11236,
         10735,
         5781,
         157360,
         27586,
         248774,
         326359,
         9587,
         3134,
         244264,
         80271
      ],
      "original_title": "Buddy",
      "runtime": 84,
      "poster_path": "/kbf9TnR3j81cRtafGDiGaMdTOz8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Jim Henson Company, The",
            "id": 6254,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jim Henson Pictures",
            "id": 6255,
            "origin_country": ""
         }
      ],
      "release_date": "1997-06-06",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "Welcome to a family that will make yours seem tame",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Caroline Thompson"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Gertrude Davies Lintz",
         "William Joyce"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118787/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3NzE5NzAwN15BMl5BanBnXkFtZTcwNTE1NjAyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Rene Russo, Robbie Coltrane, Alan Cumming | See full cast and crew »"],
      "reviews": [
         "My Aunt Gertrude did own a gorilla named Buddy, but she also owned another named Massa, and they combined the lives of the 2 together. First let me give you the true ending, Buddy was sold to the Ringling Bros circus, his name was changed to Gargantua, Massa was sold to the Philedelphia Zoo, and lived to be the oldest living Gorilla in captivity. The story was hollywoodized to the extreme. If they had stuck to the facts, maybe it would have been better. Gertrude also raised prize winning Saint Bernards, having over 100 on her estate in Brooklyn. She won the Westminster Dog show blue ribbon 5 times in a row. She helped to develop the \"modern\" pet foods. Since before then people just fed their pets scraps. Also just one more minor note, my family is Jewish, yet in the movie, she wore a cross, and as far as I know, no-body in my family was paid or had given permission for the movie to come out.",
         "My Take: More proof that decent special effects and pretty sets can't tell the story. BUDDY is the film that BABE could have easily been, but while that harmless, little achievement took to a different direction (and succeeded as a great, little film), BUDDY takes off on the wrong track. The story elements are easily predictable, but that's rarely the worst part since the film, despite some imagination and style which went into the production design, the story drags on. It's dully paced and slow-moving, it's pretty hard to care for a somewhat interesting character (a domesticated ape, no less). Rene Russo plays, and is actually fine as, eccentric wealthy animal lover Gertrude Lintz, who adopts all sorts of animals, chimpanzees mostly, and grooms them into civilized beings, dressing them up and teaches them to walk upright and eat on a table (with a spoon and fork, no less). Alongside her and her menagerie of trained (and well-dressed) apes is her husband (Robbie Coltrane), a helpful maid (Irma P. Hall) and her assistant (Alan Cumming). But when she decides to adopt a harmless orphaned gorilla, her confidence is slowly loosing as Buddy, as groomed and as attentive an animal he is, he's still an animal. Russo and co., thankfully given some decent roles, are actually good, and the ape (cheesy as ape suits are today) is pretty endearing. But unlike BABE, the focus pitched on the animals are pretty tedious. This time, I think, giving the animals the gift of speech is a welcome asset. Director Caroline Thompson seemed to be distracted by the overall look of the film (the production design, from costumes to sets, are spontaneously elaborate) to strongly develop the script. The story lags a long in a drowsy, monotonous pace that could even put a few children to sleep. What could have been an eagerly acceptable fantasy with touches of engaging tragedy is an elaborate and fancy bore. BUDDY isn't a failure, but it fails more than it succeeds. At best, it's a promise that never really got off the ground. Rating: **1/2 out of 5.",
         "As a big fan of gorilla movies in general, I anticipated that this one would be great - and as for the gorilla effects, They were quite good, however - that is the only thing I can write about this flop. The film claims to be based on a true story but in effect, it does not even come close to what actually happened to \"Buddy\" - who in real life, was the famous Gargantua, sold to Ringling Bros. by our supposed \"heroic\" Gertrude Lintz, known by many animal enthusiasts as a woman who hardly had her animals' welfare in the best interest. As far as Buddy being portrayed as becoming aggressive, this was total fiction and at no time did the gorilla, in real life, resort to such behavior. buddy did, in fact, escape his wooden crate (not a plush cage room as depicted in movie) during a storm, to seek shelter and comfort in the house, which frightened Gertrude Lintz into selling him. No, Buddy was not released into a gorilla family surrounded by lush trees in a zoological paradise - he was abandoned in a wooden crate, deep in the back of a garage for some time with only a single light bulb for comfort and then sold to the circus - where he actually lived a better life having peanuts thrown at him until he died (historically the oldest living gorilla on record, by the way) before a show in Miami. Notice also, in the film, how Buddy grows older but the chimpanzees never age. (The chimps, by the way, were not raised simultaneously with other animals, including Buddy, as portrayed in the film)",
         "After growing dogs and chimpanzees, the eccentric millionaire Gertrude 'Trudy' Lintz (Rene Russo) raises a sick baby gorilla in her mansion as if it were a child, calling him \"Buddy\". When the animal grows, her husband, Dr. Bill Lintz (Robbie Coltrane), advises her to send it to its habitat or to a zoo. However, Trudy loves Buddy and believes she can keep it at home. After an exposition in the Chicago World's Fair, Buddy has a bad experience with the public and becomes violent, not obeying Trudy's orders anymore. \"Buddy\" is a reasonable family entertainment, more indicated for children. The story is not bad and focuses mainly in the relationship between Trudy and Buddy, but does not develop the characters, the place, the time. When and where the story happens? Why Trudy does not have a baby and has such abnormal behavior, preferring animals to children? How far this movie is based on a true story? With regard to the film itself, the production is not bad, but there is not \"heart\" in the direction and interpretation. This type of story is usually very well developed by Disney studios. My vote is six. Title (Brazil): \"Buddy\"",
         "Based on an apparently true story, Rene Russo plays a woman who has very unconventional ideas about wild animals and how they should be treated. She ends up with a bunch of Chimps and assorted other animals living as children in her home, along with her physician husband. Set around the time of the Chicago World's Fair. This film focuses on the part of her story where she rescues a sick baby gorilla and raises it to be a part of the family, including dressing him as a person. some SPOILERS follow - As the gorilla grows up it behaves for the most part as planned. It is shown carrying a tray to serve h'orderves to visitors, or helping the maid scrub floors in the kitchen. He develops a fondness for things red, a scarf, a rose, a velvet chair. Still, he sleeps in a sort of cage, a bedroom with locked iron bars. He is strong, be breaks out, wrecks the house, wreaks havoc at the World's Fair. Finally they are forced to find a more appropriate home for him, a protected natural habitat with other gorillas. The gorilla was an actor in a gorilla suit. While the movie was entertaining in parts, especially the Chimps, and it has a moderately interesting message, overall it is not a particularly good movie. Free DVD loan from my local library.",
         "I enjoyed the innocence of this film and how the characters had to deal with the reality of having a powerful animal in their midst. The gorilla looks just terrific, and the eyes were especially lifelike. It's even a little scary at times and should have children slightly frightened without going over the top. Rene Russo plays her role wonderfully feminine. Usually these type of Hollywood films that take place in the past feel the need to create a straw-man villain but the only adversary is the gorilla. It's an interesting look at how close some animals are to humans, how they feel the same emotions we do, and yet how we really can't treat them just like people because they aren't. Not many films venture into this territory and it's worth seeing if you want to contemplate the human-animal similarity.",
         "One of the worst films I have seen in some time, this movie was all the more disappointing because it missed the opportunity to say something very important about man's relationship with animals. There is almost no value to this film as it stands. It's never explained why Rene Russo's character wants to keep so many animals and turn them into humans, or why her husband, by all appearances completely sane, puts up with it. One meaningless scene follows another, none of them with enough humor or pathos to merit watching.",
         "My 5 year old picked this movie as our Friday night family movie. It seemed fun and cute! Boy was I wrong! The only thing funny and cute about this movie is the Chimps. About 5 minutes in you think this lady is Deranged!!!! And then there is a whole lip stick scene that just seems uncomfortable! I was afraid I was going to have to make a fast jump on the remote! And then when you finally think she may have gotten her stuff together you make the mistake of looking up the true story of this lady and realize she is the complete opposite of an activist for animals!!!! Don't watch this movie!!!",
         "Trudy Lintz (Rene Russo) was one very fortunate lady many years ago. She was the wife of a wealthy doctor and had lots of extracurricular money. Her passion was animals and she devoted herself to providing a sanctuary for the furry ones on her property grounds. Trudy also raised two chimps in her home to be more like children. They dressed in clothes and had many amenities. One day, she learns of an abandoned baby gorilla. Knowing nothing about the large apes, she relies on her husband's medical abilities and expert advice to save the gorilla's life. Once out of danger, Trudy decides she will raise the gorilla, also, as one of her children. This works well for years and Buddy, the gorilla, is truly a remarkably intelligent addition to her home. But, Buddy is also a gorilla and his strength and curiosity become quite enormous. Will Trudy be able to keep Buddy under control? For those who love animals, Buddy is a must-see movie. Based on a true story, Trudy and her ape develop a relationship that is unique in the annals of animal history and lore. Of course, Buddy is not a real gorilla but a mechanical one, in the film, but he is very close to seeming totally real. Russo gives a nice performance as a lady ahead of her time and the supporting players are also quite nice. The costumes are exemplary, as befitting the earlier era of the story, and the settings and production values outstanding. But, most importantly, animals are here in abundance, not only Buddy, but the adorable chimps, the ducks, the rabbits, and so forth. For those who want to watch a film and be transported to animal heaven, here on earth, this is a great movie choice. All animal lovers, and even those who just want to watch a great family film, will go \"ape\" over Buddy.",
         "Buddy is an entertaining family film set in a time when \"humanizing\" animals, and making them cute was an accepted way to get people to be interested in them. Based on a true story, Buddy shows the great love that the main characters have for animals and for each other, and that they will do anything for each other. While not a perfect movie, the animated gorilla is quite lifelike most of the time and the mayhem that occurs within the home is usually amusing for children. This film misses an opportunity to address the mistake of bringing wild animals into the home as pets, but does show the difficulties. A recommended film which was the first for Jim Henson Productions."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "American Zoetrope",
         "Columbia Pictures Corporation",
         "Jim Henson Company, The"
      ],
      "summaries": [
         "This is a fact based story about a socialite and her husband who live in a mansion with a brood of animals including chimpanzees who are raised as her children. When she discovers an ailing baby gorilla, she decides to care for it as well. Years later, the gorilla is fully grown and its strength is sometimes out of control. However, the gorilla shows love for his mistress and obeys her commands. That all changes when she is invited to display the gorilla and chimps at the Chicago World's Fair. Accidentally freed by one of the chimps, the gorilla terrorizes the Fair. From that point on, he becomes moody and more uncontrollable until he attacks his mistress in a bestial rage.",
         "An eccentric socialite raises a gorilla as her son."
      ],
      "budget": 0
   },
   "movielensId": 1551,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-06",
      "dvdReleaseDate": "2001-02-06",
      "directors": ["Caroline Thompson"],
      "runtime": 84,
      "movieId": 1551,
      "title": "Buddy",
      "mpaa": "PG",
      "actors": [
         "Rene Russo",
         "Robbie Coltrane",
         "Alan Cumming",
         "Irma P. Hall",
         "Paul Reubens",
         "John Aylward"
      ],
      "imdbMovieId": "0118787",
      "originalTitle": "Buddy",
      "genres": [
         "Adventure",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["WMvW_-N9FUM"],
      "plotSummary": "An eccentric socialite raises a gorilla as her son.",
      "tmdbMovieId": 15170,
      "avgRating": 2.56994,
      "releaseYear": "1997",
      "numRatings": 336,
      "posterPath": "/kbf9TnR3j81cRtafGDiGaMdTOz8.jpg"
   }
}