{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0116834",
      "video": false,
      "title": "Late Bloomers",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dinah Groshardt",
               "gender": 1,
               "credit_id": "52fe4ca9c3a368484e1c1447",
               "name": "Connie Nelson",
               "profile_path": null,
               "id": 1183536,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Carly Lumpkin",
               "gender": 0,
               "credit_id": "52fe4ca9c3a368484e1c144b",
               "name": "Dee Hennigan",
               "profile_path": "/pV431e8Uos5jJcW2ddyFXavrmK3.jpg",
               "id": 1075130,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ca9c3a368484e1c143d",
               "name": "Julia Dyer",
               "profile_path": null,
               "id": 1143633,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ca9c3a368484e1c1443",
               "name": "Gretchen Dyer",
               "profile_path": null,
               "id": 1164106,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.052087,
      "production_countries": [],
      "id": 201445,
      "vote_count": 1,
      "budget": 0,
      "overview": "High School basketball coach, Dinah Groshardt, falls for the school secretary, Carly Lumpkin, and upsets the entire school in the process.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         242224,
         376867,
         394117,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Late Bloomers",
      "runtime": 107,
      "poster_path": "/9MlfJwh6CNXJHsAsl6TeVeCMj1e.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-01-01",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julia Dyer"],
      "runtime": 107,
      "synopsis": "A high-school math teacher and the school receptionist create an uproar within the community when they reveal their closeted relationship.",
      "writers": ["Gretchen Dyer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116834/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2MDE2NzY0Ml5BMl5BanBnXkFtZTcwMTY4MTkzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Connie Nelson, Dee Hennigan, Gary Carter | See full cast and crew »"],
      "reviews": [
         "Connie Nelson (not to be confused with Connie Nielsen; in fact she looks like David Warner) is a female basketball coach who falls in love with a female school secretary, creating an uproar at the high school. Hennigan is touching as the overweight secretary in a sexless marriage whose life is renewed when she meets Nelson. Carter is good as Hennigan's perplexed husband, who is also a teacher at the school. Although it feels at times like an after-school TV special, it is saved by the interesting characters and pretty good acting by the large cast. It is competently written and directed by the Dyer sisters, who have not done anything since.",
         "While most movies show two model like hot woman in a love relationship, this one shows two ordinary women getting to know themselves and then each other. Connie Nelson plays Dinah Groshardt (an unattached middle aged woman who is made fun off by her students for her lack of love life) , a trigonometry teacher at a high school where Carly Lumpkin (played by Dee Hennigan) works in the principal's office and her husband Ron Lumpkin (played by Gary Carter) teaches algebra. Carly and Ron have two kids, rebel daughter Val (Jonah Marsh) & pleasing son Avery (Graham Skipper). There is no longer any love left in Carly and Ron's relationship and she has issues with her own body. One day in class Dinah confiscates a love note between Val & her boyfriend Jamie Hooper (Esteban Powell), a budding rock star. Later while Dinah comes to the Lumpkins for dinner, Carly goes through Dinah's purse while she is out playing ball with Ron. She mistakes the note for an affair between the two. Later when she realizes her mistake and confesses to Dinah it leads to friendship and much more. The movie is thoroughly enjoyable and gives a realistic look at how a love relationship between two women, its effects on their personal and professional lives and a good anticipated ending. While Connie Nelson looks like Jeremy Irons (ha!ha!, it is Dee Hennigan, who steals the show as Carly who wants to share her love between her new partner and her family. A little obese and petite, she is extremely attractive and looks like a million dollars. Watch out for her basketball scenes with Connie Nelson, one in the buff and one in their wedding dress. Gary Carter plays the unfortunate but understanding husband with great style.",
         "I came upon this movie by accident while channel surfing one morning. At first, I thought it was an \"Afterschool Special,\" being repeated, but the midnight basketball session dispelled that idea. I'm glad to see this film was shown during the day, when people can actually see it, rather than played in the middle of the night, when the world is sleeping. It's hard to play this story out without making some aspect of it melodramatic: but I give the cast an \"A+\" for making me care how it all would end. (Hey: Didn't I see some of the 'Wishbone' players in this one?)",
         "Yeah, its sort of movie of the week, but its sweet and well acted. More importantly, its two middle aged woman falling in love, neither look like super models, and yet its pretty damn sexy at parts (they play nude basketball at night in a really cute scene). I have to recommend this.",
         "The film was good. I liked the plot and as the story developed I enjoyed the love story very much. The Actors ( DEE and Connie) played their parts well and I hope to see more from them in the future. I give this film an A+.",
         "Decently-written and sweetly acted, this is a realistic story of two ordinary women (I thought both of them were beautiful!) who fall in love. Carly Lumpkin, pleasingly plump and ignored by her husband is the high school secretary at Eleanor Roosevelt high school. Dinah Groshardt doubles as the high school's geometry teacher and basketball coach; she keeps turtles, lives alone, and claims to have never been in love. Their love affair eventually causes a stir at the school. There are many funny moments, along with a proper dose of drama. I'm 22 years old, but I would much rather watch this than the current fare which usually centers around teenage or adolescent-acting young people. I'll watch it, but it won't touch my heart nearly as much as Late Bloomers. This story is about real love and shows even people your parent's age can be passionate and affectionate. Especially enjoyed the Lulu song \"Oh me, Oh my\" in this movie. My only real complaint is the way they portrayed teenage Val (she really annoyed me), but then this story does not focus on her completely, so it's easy to ignore. What this movie lacks in perfect writing, it makes up for in heart and a compelling story (and good acting, at least by the two leads). One of my favorite movies.",
         "This film is for the elder audience. Don't get me wrong. I recomend everybody to see it. Finally the cast is not some teenagers but grown woman. The film is set in a small town where everybody knows everybody. The scandal is a fact when two woman is in love with eachother-one married, with two children. The other a respectfull teacher, who also is a basket ball trainer. The film has some good humor and serious dialog and is a film worth waching for everybody. Anita",
         ". . . it was darned good! The logic of the long wait before the scheduled wedding puzzles me, but overall it was a very nice film. (And yes, we did enjoy seeing Esteban Louis Powell in it!)",
         "Dee Hennigan, one of the stars of Late Bloomers, is my cousin. And no matter how much I hate to say this, I must - the movie was horrible. It wasn't the relatively-taboo subject matter or the nudity or anything like that. Rather, I just found the dialogue to be unnatural, and the acting fairly poor. Dee has done much better work than this, as I hope have the other actors and actresses.",
         "This move was slow in parts but I love it because I was in it, in the basketball scene I am the large bald guy in the stands, I had cancer at the time and it gave me something to do."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["One Mind Productions"],
      "summaries": [
         "The story of two ordinary women in their mid years, who live deep in the bible belt, populated by square teachers, libidinous students and home to suburban monotony. Carly is a married woman with two kids, who works as the school secretary; Dinah is the single, lonely math teacher who coaches the girls' basketball team. Long time disinterest between the women perchance evolves in to a series of one-on-one basketball games, during which the two women grow closer physically and emotionally, until one heated game ends spontaneously in a kiss. The outcry from family, friends and the community as the relationship between these two women blooms, creates a timely story in which is woven the notion of family, of gay relationships and which raises the banner of gay marriage.",
         "High School basketball coach, Dinah Groshardt, falls for the school secretary, Carly Lumpkin, and upsets the entire school in the process."
      ],
      "budget": 0
   },
   "movielensId": 1553,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": "2003-10-01",
      "directors": ["Julia Dyer"],
      "runtime": 107,
      "movieId": 1553,
      "title": "Late Bloomers",
      "mpaa": "",
      "actors": [
         "Connie Nelson",
         "Dee Hennigan"
      ],
      "imdbMovieId": "0116834",
      "originalTitle": "Late Bloomers",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "High School basketball coach, Dinah Groshardt, falls for the school secretary, Carly Lumpkin, and upsets the entire school in the process.",
      "tmdbMovieId": 201445,
      "avgRating": 3.18919,
      "releaseYear": "1996",
      "numRatings": 37,
      "posterPath": "/9MlfJwh6CNXJHsAsl6TeVeCMj1e.jpg"
   }
}