{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0119019",
      "video": false,
      "title": "Dream with the Fishes",
      "recommendations": [
         25576,
         51321,
         20328,
         80919,
         26156,
         22792,
         23312,
         61418,
         26941,
         14167,
         44895,
         118075,
         28320,
         17439,
         19094,
         46625,
         19033,
         32013,
         63437,
         52856
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Terry",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b67b",
               "name": "David Arquette",
               "profile_path": "/p5l4pnL9xhbHiKSipcdsCekoD52.jpg",
               "id": 15234,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b67f",
               "name": "Brad Hunt",
               "profile_path": "/5VP0Rn0cKsktqrvo60olV3cpcCe.jpg",
               "id": 65732,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Aunt Elise",
               "gender": 1,
               "credit_id": "52fe4740c3a36847f812b683",
               "name": "Kathryn Erbe",
               "profile_path": "/eB6H3pSImCJLBq83eH3oy8s9yrL.jpg",
               "id": 49824,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Don",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b687",
               "name": "Patrick McGaw",
               "profile_path": "/llU9JbZRO4Nl1LizqlW9yUWVA1S.jpg",
               "id": 186526,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Aunt Elise",
               "gender": 1,
               "credit_id": "52fe4740c3a36847f812b68b",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Joe",
               "gender": 2,
               "credit_id": "5a539b3a0e0a2602720378d7",
               "name": "J.E. Freeman",
               "profile_path": "/lGqZh89pfgSNhIItjvn34jPO6HM.jpg",
               "id": 5169,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Cop",
               "gender": 2,
               "credit_id": "5a62392a0e0a2671e10022ff",
               "name": "Richmond Arquette",
               "profile_path": "/xW4bb2qsPYilO27ex4Xoy2Ik1Ai.jpg",
               "id": 7472,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5a5664b10e0a2607d102a3b3",
               "name": "Finn Taylor",
               "profile_path": "/hqY8XApmegYI32F6pD64A3alK5e.jpg",
               "id": 84692,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a62386c0e0a2671db00233f",
               "name": "Finn Taylor",
               "profile_path": "/hqY8XApmegYI32F6pD64A3alK5e.jpg",
               "id": 84692,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a6238a29251416803002180",
               "name": "Jeffrey D. Brown",
               "profile_path": null,
               "id": 1219790,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a6238edc3a36836c7002089",
               "name": "Barry Stone",
               "profile_path": null,
               "id": 53850,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a62390d92514167fa002143",
               "name": "Tito Larriva",
               "profile_path": "/kfOZ6Z7JtslNMBtiLU3bSxhdfXe.jpg",
               "id": 53763,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.327474,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47686,
      "vote_count": 11,
      "budget": 0,
      "overview": "A suicidal man who can't kill himself agrees to finance his terminally ill neighbor's bucket list of fantasies if, at the end, the neighbor will kill him.",
      "similar": [
         3134,
         948,
         8810,
         281,
         298312,
         4638,
         10212,
         11564,
         43923,
         133805,
         2142,
         1359,
         141,
         185,
         10285,
         431,
         101,
         205,
         681,
         949
      ],
      "original_title": "Dream with the Fishes",
      "runtime": 97,
      "poster_path": "/tlUqk3T9KOSinF4SL0LqXtOyFm4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "Voyeurism, LSD and nude bowling... finally, a buddy flick that keeps you guessing!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Finn Taylor"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Finn Taylor",
         "Jeffrey D. Brown"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119019/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwODgxNDE0Ml5BMl5BanBnXkFtZTcwMzg0MTUxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: David Arquette, Brad Hunt, Cathy Moriarty | See full cast and crew »"],
      "reviews": [
         "Terry (David Arquette) is a very sad, lonely man who spends his days watching other people live their lives rather than trying to make one of his own. Rather than do this, he decides that the best thing to do is to commit suicide by jumping off of the Golden Gate Bridge. In what he thinks are the final few moments of his life along comes a very confident man, Nick (Brad Hunt), who notices that Terry can't seem to find the nerve to actually go through with it, and persuades him that this kind of suicide would actually be quite painfull, and might not even work, and suggests that he overdose on pills. Nick makes an offer of a jar of sleeping pills that he has at his apartment, in exchange for Terry's watch. Once the pills have been downed, Terry suddenly has a drastic change of heart and makes Nick take him to the hospital where it is revealed that they were actually vitamins. Angry, Terry wants to confront Nick to get his watch back and finally tracks him down at the hospital where he finds out that Nick only has a short while to live himself. The next day, Nick leaves the hospital with a proposal for Terry. If he will help Nick to live out all of his life long fantasies in the few weeks before he dies, Nick will pay him back by killing him. Determined to go out with a bang, Nick takes Terry on an adventure and teaches him how to live his life to the fullest, including robbing a bank with an unloaded gun and nude bowling with prostitutes (whatever turns you on Nick!!) It may seem that Nick is doing this all for him, but this film is about not taking life for granted and he is trying to open up a new world for Terry, one where he wouldn't want to die. This is what makes this a fantastic movie with many highs and lows. Mainly, a great story of love, friendship and adventure.",
         "Dream With The Fishes accomplishes what so many small independent films fail to do: it adheres to the reliable simplicity of storyline and character without getting bogged down in gimmickry or its own cleverness. The casting and performances are perfect - it's a shame that David Arquette has disappeared into his wife's shadow - his performance as self-loathing/suicidal Terry is the perfect foil for Brad Hunt's desperate and free-spirited Nick. Both actors are brilliant in this film yet they've both remained relatively obscure in the years since it's release. Perhaps Finn Taylor's direction has a lot to do with it. Aside from the performances he wrangles from his actors, Dream With The Fishes is also beautifully filmed, from the shots and camera angles to the lighting and even film stock he chooses for different moments to highlight shifts in character and story. Add to this a haunting soundtrack (which I can thank for my introduction to Nick Drake) and you have a charming, heart-breaking, inspiring ride that serves both as an entertaining couple of hours viewing and a fine example for aspiring filmmakers.",
         "Off course this movie hasn't got the most original story. It has similarities with films like Harold and Maude, Freeway or Mad love. But despite of the fact that it isn't original, it still remains (in my opinion) a beautiful little gem. The music was great and David Arquette, Brad Hunt and Kathryn Erbe (and the others) showed some nice acting. I'm glad I had the opportunity to see this film!",
         "I was never very fond of David, and just referred to him as Rosanna's goofy brother, but he gives an amazing heart-felt performance, in this, one of the best pictures ever made. This is a wonderful male bonding film, with valuable life lessons, that finds unbridled wildchild Nick(Hunt), who is terminally ill, scams Terry(Arquette) out of committing suicide. Nick lives out his final days with a reckless abandon, dragging the terminally square Terry along for the ride. Along the way, Terry finds the passion to live again. A complete masterpiece! Patrick McGaw, J.E Freeman and Kathryn Erbe were all brilliant in supporting roles, and Brad Hunt was perfectly cast alongside Arquette. Rarely does a film come out that is so compelling, witty, dark and surreal than this gem. Highly recommend to buy rather than rent.",
         "I hope you are all as tired as I am of seeing the same repetition of trite films that we are bombarded with. Your local blockbuster new release wall is a shrine full of such poor excuses for film making. When you have a medium so rich and so full of posibilites it is sad to have to suffer through such recycled garbage or non stop toilet humor. This film does neither. This is a movie that for a change explores something that should be meaningful to all of us, life. It does not do it in a cynical and overly oh I am trying to be clever way like The Last Supper. Rather this film has a philosophy and does not cop out like say City of Angels where Nicholas Cage decides who cares if God doesn't care as long as I can go swimming naked. Sure the actors are not the best but then Top Flight actors do not play peeping Tom perverts or dying hill billies for the most part. What you do get is a good story that is worth your while. It is listed as a comedy but film's like this defy genre because it is a story. It is a story with its own points and messages that is not carefully placed into a three act dramatic structure. Go watch October Sky if you want heart warming.",
         "....Which really isn't saying much, I suppose. But in this film, he actually ACTS, instead of his usual mugging. The premise of this movie intrigued me--a suicidal guy makes a strange pact with a terminally ill guy--and the first half is bizarre and wonderful. In the end, it got to be a bit drawn-out, and the marriage by the bedside was a little too contrived for my taste. But I wondered what happened to Cathy Moriarty and the girl from Rich in Love (the one with the black hair); they must be pretty picky as they don't get many roles. This film was unique enough to hold my attention and those who liked Buffalo 66 will probably eat it up. Another strange performance from character actor J.E. Freeman to boot.",
         "WOW! This was a great movie! The AT&T man really shines in this one, as do all the actors! Finn Taylor and Jeffrey D. Brown easily should have been up there accepting an Oscar. This movie is everything, funny, serious, edgy, philosophical, realistic! Great camera work and lighting capture the edgy moments, and the soundtrack totally kicks. Wow, I can't rave about this movie enough! If you thought Blair Witch was unrealistic and are looking for something thought provoking and different, check this one out. You won't be disappointed.",
         "Terry is a lonely man who spends his days watching his neighbors with monoculars. Then He meets Nick...... \"Dream With Fishes\" by following the \" Live for the Moment,Live For Your Dreams and Experience everything \" ideology Guides us back to the 70's. Fin Taylor says truths that it really hearts to watch them on the screen. How does it feel to live your life through another mans Life,because you don't dare to interfere in your world? How does it feel to live through another man experiences? Taylor creates a strong relationship between two men based on need and guided to true altruism.",
         "It's a strange little movie, continually shifting focus, at the end perhaps not amounting to much more than a whimsical playing with odd offbeat lives, but generally quite appealing: some of the ideas - like that of a general malaise trying to elevate itself by identification with a specific loss - are particularly intriguing. The evocative title sums up the generally lilting approach toward dreams and fantasies and self-definitions, although the movie as a whole is in many ways oriented more towards grunginess and weirdness, almost verging on exploitation at times. A major reservation must attach to the marginality of the women - Erbe has some very striking moments, but her agenda and feelings aren't explored much. On the whole, not distinctive enough to stick around particularly in one's memory.",
         "This odd movie is completely stolen by a brilliant supporting performance by Kathryn Erbe and once she appears on screen, it's simply her picture. It is a really wonderful piece of work and admirers of her television work will find it a true treat. While she has done some very fine motion picture work, especially memorably in Kiss of Death and Rich in Love, it the tragic-comic turn here that completely overwhelms her fellow cast members. Not a great movie but because of Kathryn Erbe's delightful and moving work, it is well worth your time. Since this review has been judged too short, I would just like to comment that her work in Law and Order: Criminal Intent is excellent and it was quite rewarding indeed to see her give a great performance reprising her role as Eames on some Special Victims Unit episodes. It is truly amazing what she does with that character and she deserved an Emmy for her portrayal of NYPD detective, Alex Eames."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "3 Ring Circus Films",
         "Outpost Studios"
      ],
      "summaries": [
         "Terry is a suicidal voyeur who doesn't seem to be able to kill himself. While preparing for jumping off a bridge, he meets Nick who ends up saving his life. Terry discovers that Nick is terminally ill and doesn't have much time left. Scared by the lack of time, Nick offers Terry a deal he can't refuse: Terry will become the beneficiary of Nick's life insurance or, since money doesn't matter to Terry, Nick promises to kill him before he dies. All Nick asks is Terry's help to realize a few fantasies before dying.",
         "Terry is a suicidal voyeur who treats a dying addict to a final binge, but Terry will only do this if he promises to kill him."
      ],
      "budget": 1000000
   },
   "movielensId": 1563,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Finn Taylor"],
      "runtime": 97,
      "movieId": 1563,
      "title": "Dream with the Fishes",
      "mpaa": "",
      "actors": [
         "David Arquette",
         "Brad Hunt",
         "Kathryn Erbe",
         "Patrick McGaw",
         "Cathy Moriarty",
         "J.E. Freeman",
         "Richmond Arquette"
      ],
      "imdbMovieId": "0119019",
      "originalTitle": "Dream with the Fishes",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A suicidal man who can't kill himself agrees to finance his terminally ill neighbor's bucket list of fantasies if, at the end, the neighbor will kill him.",
      "tmdbMovieId": 47686,
      "avgRating": 3.35491,
      "releaseYear": "1997",
      "numRatings": 224,
      "posterPath": "/tlUqk3T9KOSinF4SL0LqXtOyFm4.jpg"
   }
}