{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boat",
            "id": 1422
         },
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "honeymoon",
            "id": 2676
         },
         {
            "name": "vacation",
            "id": 6876
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "husband",
            "id": 162271
         }
      ],
      "imdb_id": "tt0116502",
      "video": false,
      "title": "Head Above Water",
      "recommendations": [
         58631,
         67899,
         40562,
         32911,
         41938,
         149553,
         294261,
         78406,
         36915,
         80346,
         84152,
         32630,
         14569,
         27267,
         30712,
         13163,
         26486,
         41816,
         91580,
         84719
      ],
      "backdrop_path": "/haWj4dzbNiPosCCFjvu3MOYdE7Z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe43f79251416c75024887",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Nathalie",
               "gender": 1,
               "credit_id": "52fe43f79251416c7502488b",
               "name": "Cameron Diaz",
               "profile_path": "/ahFkUN9Sm8oF1txUHE5JcJ95Ere.jpg",
               "id": 6941,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kent",
               "gender": 2,
               "credit_id": "52fe43f79251416c7502488f",
               "name": "Billy Zane",
               "profile_path": "/lkwvmo7vVL8TpMCDLRoHjZIkJQ4.jpg",
               "id": 1954,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lance",
               "gender": 2,
               "credit_id": "52fe43f79251416c75024893",
               "name": "Craig Sheffer",
               "profile_path": "/q2y5cm3RoCsztmuLqJie4cOrLBH.jpg",
               "id": 4138,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Police Officer",
               "gender": 2,
               "credit_id": "52fe43f79251416c75024897",
               "name": "Shay Duffin",
               "profile_path": null,
               "id": 42290,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c7502487d",
               "name": "Jim Wilson",
               "profile_path": null,
               "id": 7847,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f79251416c75024883",
               "name": "Theresa Marie",
               "profile_path": null,
               "id": 69252,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c7502489d",
               "name": "Jim Wilson",
               "profile_path": null,
               "id": 7847,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c750248a3",
               "name": "John M. Jacobsen",
               "profile_path": "/wdvfUwdJhYaYIUrDuuTxYABpG9x.jpg",
               "id": 69253,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c750248a9",
               "name": "Christopher Young",
               "profile_path": "/2laVovSXDVpHRS6HSpKyCspSmze.jpg",
               "id": 19155,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c750248af",
               "name": "Richard Bowen",
               "profile_path": null,
               "id": 67391,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f89251416c750248b5",
               "name": "Michael R. Miller",
               "profile_path": null,
               "id": 5175,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c750248bb",
               "name": "Elisabeth Leustig",
               "profile_path": null,
               "id": 4142,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f89251416c750248c1",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.068092,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11103,
      "vote_count": 47,
      "budget": 0,
      "overview": "Judge George (Harvey Keitel) brings his young wife, Nathalie (Cameron Diaz), to a remote island for a vacation. But while George accompanies their only neighbor -- Nathalie's childhood friend Lance (Craig Sheffer) -- on a fishing trip, Nathalie spends time with her ex, Kent (Billy Zane). When Kent ends up dead the next morning, Nathalie tries to hide the evidence before her husband gets home. After the body is found, the events of the previous night unravel, with unexpected revelations.",
      "similar": [
         1903,
         77,
         346685,
         49524,
         296099,
         72570,
         11284,
         87567,
         150117,
         11547,
         1599,
         10133,
         1049,
         340584,
         12090,
         8461,
         10575,
         20036,
         383538,
         10799
      ],
      "original_title": "Head Above Water",
      "runtime": 92,
      "poster_path": "/974wqQhLjWUNlaHKRXLXyKonMGV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tig Productions",
            "id": 335,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Majestic Films International",
            "id": 2630,
            "origin_country": ""
         },
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         }
      ],
      "release_date": "1996-11-07",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "A comedy about keeping your ex-lover a secret, your husband in the dark and your head above water.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jim Wilson"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Eirik Ildahl",
         "Geir Eriksen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116502/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1NjYzMjMzOF5BMl5BanBnXkFtZTcwMTAzOTUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Harvey Keitel, Cameron Diaz, Craig Sheffer | See full cast and crew »"],
      "reviews": [
         "Get this plot line: married couple Keitel and Diaz are on vacation (honeymoon, maybe, can't remember), on a small island. Their only neighbor is Sheffer, a friend of Diaz. Along comes Zane, as Diaz's ex-lover. He talks Diaz into letting him stay the night. The next morning when Diaz goes to check on him, he's dead. Cause of death is, appearantly, a heart attack. At that same moment Keitel and Sheffer are arriving on shore. She tries to hide the body, but Keitel stumbles onto it (literally). Did I mention that Keitel is a judge? He believes that the only solutions would be to dispose of the body, or possibly be charged with murder. At that point the question arises about his death. Could it have been murder? If so, let's look at the suspects. Diaz obviously didn't kill him, so that leaves the other two. Is it Keitel, the possibly jealous husband, or Sheffer? This plot has \"potential\" written all over it. Head Above Water is a remarkable black comedy with great performances and a great script that keeps you guessing. Just when you think you've found the killer, along comes some new evidence to point you in another direction. It plays great as both a Mystery and a Comedy, although the comedy is quite subtle. Anyone with a taste for mystery and comedy is in for a real surprise. Even if you aren't into those genre's, you'll still enjoy this great film. It would be extremely hard to dislike, because it's just so much fun.",
         "This movie has got to be one of the greatest movies I ever seen. This is a true work of art. All the movies today are all big budget with their big effects and people are forgetting the most important part of a movie is the story which HEAD ABOVE WATER is very strong in. The characters are great. Keitel is awesome. Diaz is hilarious with her facial expressions. The movie keeps you guessing and laughing all the way through and only gets better as the story unfolds. It has a twist that you never see coming. The writing is great. And another thing I find interesting is how a story with only 3 people in it can hold the attention of the audience. That says something great about the writer. HEAD ABOVE WATER is a story and character driven movie that I'd recommend to anyone!",
         "I really enjoyed the performances in this film. Harvey Keitel again proves his tremendous range. Cameron Diaz is a very talented comedic actress and her makeup is very skillfully applied in this film. Billy Zane is again a third wheel (see Dead Calm and Titanic) but this time it's a comedy. The plot twists and turns are great fun to follow. 8/10.",
         "The great thing about this film is that once the usual character-building stuff is out of the way, you will not move an inch and your eyes will only move if you have a widescreen television... Sterling performances from both Harvey Keitell and Cameron Diaz really make this film come alive and as incident after incident fall upon the hapless couple, you feel yourself gripping the chair more and more, your nails getting smaller and smaller, and the enjoyment increasing and increasing. All in all, Head Above Water is a great film, with good (if not at times, erratic) directing, and with superb acting.",
         "If you looking a dark comedy - stop your research you found it. Head Above Water is an awesome surprise and very funny movie. One of most strange couples on the screen that I saw(Cameron Diaz and Harvey Keitel) give a special touch to the Wilson's movie. Reccomended to all",
         "\"Head Above Water\" is underrated. Despite its simplicity, it is a different movie experience. Why? Well, for one thing, there are very few movies with such few number of actors and characters, being Walt Disney's \"Old Yeller\" one of those rarities. But that's not all. The movie is classified as a macabre comedy but contains lots of suspense and is more of a thriller. Its events almost resemble what happens in the later \"What Lies Benneath\". Yes, \"Head Above Water\" has its moments of comedy. Some are light comedy, but most of them are black humor. People should beware of this. And it's not too much to remind that this movie can be shocking at times and also deals with very serious stuff, such as fear, panic, horror, sadism, violence and death. Nevertheless, it is very far from being a movie of extremes like \"A Clockwork Orange\" is and is certainly way more comfortable and pleasant to watch, but it can be a disturbing film. Speaking of the moments of comedy, one of the most hilarious is when George gets in the house, closes the door and has a tantrum attack, cursing what's happening to him. But the funniest moments come, in majority, from Lance and Nathalie. I also like very much the way how Lance makes George and Nathalie have a bad time while trying to get rid of Kent's body (without Lance knowing) and the part when Nathalie throws Lance to the water, followed by Nathalie swimming. That's when one of the movie's hottest scenes happen: she gives Lance a love kiss under the water. Later, when Lance asks «What was that today? Us, under the water?», it's funny how she replies «Old times» and then he replies almost laughing «Old times? I don't remember that part». Where \"Head Above Water\" takes place is unknown. But I've got to tell this: that is a beautiful island which can only be reached by boat. It has a very relaxing and beautiful atmosphere, surrounded only by the infinitive sea and the island's natural beauty. Not to mention that the house of this movie is humble and nice. It really makes one wanna spend holidays in such a wonderful place. As for the characters, Lance is an interesting, humorous and friendly character. But I also admire his pacific spirit and his capacity to hide his emotions and feelings. He's secretly in love with Nathalie, but he knows that she's a married woman, so he wouldn't cross that line. Craig Sheffer portrays very well this character. Nathalie is a loving and beautiful woman. I love her funny facial expressions and her smile. But she's also an extremely depressed and frightened woman. It's impossible not to feel sorry for her. This is by far one of Cameron Diaz's finest performances. This was before she got really famous. Back then she seemed to be a better actress and used to play better movie roles. Anyway, here she is just as good as in \"The Mask\". And boy, she looks equally gorgeous in this film! Those blue eyes, that pretty hair, those long and sexy legs and a smile to die for... wow! George, on the other hand, seems to be a nice guy at first, but as the movie runs he slowly reveals being a psychopath. Despite being a judge, his sadism grows stronger as the movie runs. Nevertheless, Harvey Keitel is great in this film. For me, he has never been this good, before or after. As for Kent, he's a cool character, but also a very depressed one with an alcohol problem and a heart's weakness. Billy Zane's performance as Kent is good, but with a slight problem: sometimes it's difficult to understand what is he saying. Also, he seems to \"chew\" his words sometimes. This movie has one of the strongest plots of all time. The story is strong, thrilling, dramatic, simple yet completely unpredictable, complex and confusing. The mystery of Kent's death is present practically all over the movie. While undeniably confusing, the conclusion I get is that George knew that Kent sent the postcard, knew he was coming and put it on Lance's mailbox to frame him. He also does that to avoid Nathalie from knowing the truth and, knowing he was coming, he plans secretly (and successfully) Kent's death. Both Lance and Nathalie become innocent victims of George's macabre scheme. \"Head Above Water\" is in general carefully made, with lots of attention to detail. While it has lots of solid arguments, its soundtrack is nothing special.",
         "I was pleasantly suprised with this movie, because I didn't expect it to be GREAT. But it was, the film is smart, sexy, funny and thrilling. You'll love Cameron Diaz and the storyline is marvellous. Black comedies don't get much better than this. Diaz plays Natalie, who is happily married to older-crinkly George (Harvey Keitel). Everything is perfect until Natalie's old boyfriend (Billy Zane) shows up while George is out on a fishing trip. As if sleeping with him isn't bad enough, Natalie finds the guy dead and naked on a table. Who knows what happened? Our Nat's doesn't have time to find out, she must hide the body and look ship-shape before George returns! Unfortunately, Keitel is miscast and should play Natalie's father, and the story sometimes gets silly, but overall, thats the fun of it! My rating : 8/10.",
         "I love comedies, especially when they are dark like \"Head Above Water\". I remember seeing this movie for the very first time about five years ago and it had me completely in its power. But in the meantime I've seen so many good movies, that I wondered if this would still be as good as I remembered it to be. The answer is no, not completely. Yes, it is still a very nice movie, but not as great as some other dark comedies that I've seen in the recent past. Nathalie has recently been married to George, a prominent judge who she met when she had to stand trial. They now have taken a holiday in Nathalie's idyllic summerhouse in the middle of nowhere and the only person in the neighborhood is Nathalie's old friend and neighbor Lance, who joins them. When George and Lance go on a fishing trip, Nathalie's former lover turns up. He has a couple of drinks and then falls asleep in Nathalies bed ... naked. When George and Lance suddenly come back home, Nathalie panics. She tries to wake Lance up, but he's dead and the only idea she can come up with is hiding his body under the floor board, where he will soon be discovered... Despite or perhaps thanks to the small cast, you'll see some fine acting. Harvey Keitel is a good actor and he does a nice job playing the judge who goes crazy. Cameron Diaz is also enjoyable as Nathalie, the woman with more troubles around her head than she can cope with. In fact, all actors did a good and convincing job portraying their characters, but it wasn't enough to make this movie a masterpiece. What bothered me most was the fact that it all started to go too far. All the characters had to die in such an unbelievable and over-the-top way, that it spoiled a lot of my fun. Nevertheless I must admit that I enjoyed big parts of the movie and that's why I still give it a 7/10. It's not the best example of a dark comedy, but I've seen worse.",
         "This is the funniest movie I've seen in a long time. Cameron Diaz is perfect in her role as Nathalie, and as the movie progresses, all the tiny threads to the plot weave themselves together flawlessly to create an unforgettable climax. I can't recommend this film strongly enough.",
         "The acting is pretty good, and seeing Harvey Keitel playing in a dark comedy was a pleasant surprise. What was not so pleasant was the plot. It starts out looking like another attempt to get rid of a dead body, like \"Enid is Sleeping\" or Drop Dead Sexy\". What it winds up being is an overly complicated, convoluted black comedy, that is only marginally successful. Some of the plot contrivances are so unrealistic that they weaken the entire movie. Things like the postcard, a vodka bottle, and most of all a runaway chainsaw are nothing but ludicrous distractions. To top things off we get a completely unnecessary boat explosion as part of the astoundingly unbelievable conclusion. Very average at best. - MERK"
      ],
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "productionCompanies": [
         "Majestic Films International",
         "Tig Productions"
      ],
      "summaries": [
         "In this dark comedy, a supreme court judge (George) and his very young wife (Nathalie) are on vacation at her family's summer home on an island. When the caretaker, her childhood pal, Lance, takes George on a fishing trip an old flame (Kent) shows up to surprise Nathalie while she's alone. After a night of drinking Nathalie awakes to find Kent, naked and dead in her bed, just as her husband and Lance are arriving. Panicked, Nathalie hides the body but as everyone finds out it just leads to more trouble as they try to dispose of the body and eventually discover what really happened to her ex.",
         "A prominent judge, his wife, her ex-lover, their neighbor and a dead body that complicates their lives."
      ],
      "budget": 0
   },
   "movielensId": 1565,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-07",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Jim Wilson"],
      "runtime": 92,
      "movieId": 1565,
      "title": "Head Above Water",
      "mpaa": "PG-13",
      "actors": [
         "Harvey Keitel",
         "Cameron Diaz",
         "Billy Zane",
         "Craig Sheffer",
         "Shay Duffin"
      ],
      "imdbMovieId": "0116502",
      "originalTitle": "Head Above Water",
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["eMNKYXlSjeE"],
      "plotSummary": "Judge George (Harvey Keitel) brings his young wife, Nathalie (Cameron Diaz), to a remote island for a vacation. But while George accompanies their only neighbor -- Nathalie's childhood friend Lance (Craig Sheffer) -- on a fishing trip, Nathalie spends time with her ex, Kent (Billy Zane). When Kent ends up dead the next morning, Nathalie tries to hide the evidence before her husband gets home. After the body is found, the events of the previous night unravel, with unexpected revelations.",
      "tmdbMovieId": 11103,
      "avgRating": 2.85632,
      "releaseYear": "1996",
      "numRatings": 261,
      "posterPath": "/974wqQhLjWUNlaHKRXLXyKonMGV.jpg"
   }
}