{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0119502",
      "video": false,
      "title": "The Last Time I Committed Suicide",
      "recommendations": [],
      "backdrop_path": "/cpXlGj8Qro4BGHAjZFSwzM6TmDX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Neal Cassady",
               "gender": 2,
               "credit_id": "52fe45869251416c910355e9",
               "name": "Thomas Jane",
               "profile_path": "/xAES23Ll0JT0lJADA1SIdTAN0bf.jpg",
               "id": 11155,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe45869251416c910355ed",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joan",
               "gender": 1,
               "credit_id": "52fe45869251416c910355f1",
               "name": "Claire Forlani",
               "profile_path": "/oJ0zBF74MjopEJrEWstXuvZWQYL.jpg",
               "id": 4174,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cherry Mary",
               "gender": 1,
               "credit_id": "52fe45869251416c910355f5",
               "name": "Gretchen Mol",
               "profile_path": "/46mBoe7xf3pJgQLEYNw6Msniq3r.jpg",
               "id": 15370,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe45869251416c910355f9",
               "name": "Adrien Brody",
               "profile_path": "/zvMslH1C8xmEBpGgDsdzL797Rv.jpg",
               "id": 3490,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lewis",
               "gender": 2,
               "credit_id": "52fe45869251416c9103560f",
               "name": "John Doe",
               "profile_path": "/EuDIT3BBTqkkLKD8wgp7MwuGCx.jpg",
               "id": 42746,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "52fe45869251416c91035613",
               "name": "Jim Haynie",
               "profile_path": "/xOOfHlwhjY9OKeLeUCJ2oiSz8gn.jpg",
               "id": 10380,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Lizzy",
               "gender": 1,
               "credit_id": "52fe45869251416c91035617",
               "name": "Marg Helgenberger",
               "profile_path": "/9jIgVEJGZkfjQI1bItxFIaNN3b3.jpg",
               "id": 19838,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Rosie Trickle",
               "gender": 1,
               "credit_id": "52fe45869251416c9103561b",
               "name": "Lucinda Jenney",
               "profile_path": "/nhKWN1oWThSgz0AnUDOcQTubh3r.jpg",
               "id": 5148,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Jeananne",
               "gender": 1,
               "credit_id": "52fe45869251416c9103561f",
               "name": "Amy Smart",
               "profile_path": "/yTWkJVYq1wtn2NrnPIwXshTWqby.jpg",
               "id": 20189,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Vicky",
               "gender": 1,
               "credit_id": "52fe45869251416c91035623",
               "name": "Alexandra Holden",
               "profile_path": "/exNLXpKxW1HQBCuqEfC7aGyb7W8.jpg",
               "id": 69399,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Cop #1",
               "gender": 2,
               "credit_id": "52fe45869251416c91035627",
               "name": "Clark Gregg",
               "profile_path": "/t8CLS2Zcy7IjcZkE1vtxl40h9rh.jpg",
               "id": 9048,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45869251416c910355ff",
               "name": "Stephen T. Kay",
               "profile_path": "/wN9Vxi5dvDNSV70kV3P1LQvx5EM.jpg",
               "id": 56435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45869251416c91035605",
               "name": "Stephen T. Kay",
               "profile_path": "/wN9Vxi5dvDNSV70kV3P1LQvx5EM.jpg",
               "id": 56435,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45869251416c9103560b",
               "name": "Peter Abrams",
               "profile_path": null,
               "id": 15306,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.050749,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34941,
      "vote_count": 8,
      "budget": 0,
      "overview": "Neal Cassady is living the beat life during the 1940s, working at The Tire Yard and and philandering around town. However, he has visions of a happy life with kids and a white picket fence. When his girlfried, Joan, tries to kill herself he gets scared and runs away. But when Joan reappears will he take the chance at that happiness, or will he turn his back on it?",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         97630,
         101,
         205,
         141,
         339692,
         281957
      ],
      "original_title": "The Last Time I Committed Suicide",
      "runtime": 92,
      "poster_path": "/kz5PWqGTVg5TmsfOxeFYc6ChFb2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tapestry Films",
            "id": 870,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bates Entertainment",
            "id": 52860,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Kushner-Locke Company",
            "id": 2499,
            "origin_country": ""
         }
      ],
      "release_date": "1997-06-20",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Life is what happens when you're busy making plans",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Kay"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Neal Cassady",
         "Stephen Kay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119502/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MzAyNjMyMl5BMl5BanBnXkFtZTcwOTczOTkyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Thomas Jane, Keanu Reeves, Adrien Brody | See full cast and crew »"],
      "reviews": [
         "This movie was amazing...Thomas Jane was terrific..Claire Forlani, Gretchen Mol..BUT..the one who stole the film...was KEANU REEVES..he should be VERY proud of the job he did in this film. He *was* Harry...was not afraid to put on the extra pounds for the role..he looked like a loser barfly.. a very lovable one..This was a very overlooked film..that many people have not had the privilege to see...If you want to see Keanu Reeves ACT..see this film..Stephen Kay did a wonderful job..he captured the spirit of the time in the language and the cinematography.",
         "Seeing that the whole movie is based on a letter from Neal Cassidy to Jack Kerouac, I reckon Stephen Kay did an excellent job of re-creating the essence that was Cassidy and his neer-do-well existence. You felt for Neal (played very well by Thomas Jane ). He could almost taste the sweetness of a well balanced life - the honey at home the white picket fence the dog running around in the yard, but circumstance (his likings for the female of the species, penchant for stealing cars and his friendship with good 'ol HARRY [played brilliantly by KEANU REEVES]), just got in the way of true happiness. The supporting cast give good all round performances, especially Claire Forlani as the girl of Cassidy's 'dreams'. This movie catches the 'beat' excellently with great visuals and a Class A soundtrack. Highly recommended.",
         "The Last Time is a factual look into the life of the Beat Generation's Neal Cassady. It's based upon a letter (the Joan Anderson letter) from Neal Cassady to Jack Kerouac. The scenes are fragmentary, jittery, jazz-punctuated, syncopated, improvised, and skittery; this is the same style in which the Beat writers penned their poems, prose, and personal letters, and it makes the viewer feel as if he/she is reading Beat poetry while watching the film. When the film opens, Cassady is struggling with the aftermath of his girlfriend's attempted suicide. He begins to examine the battle between his own desire to roam free and write, and her desire to live the American dream (marriage, house). Overwhelmed, he plunges headfirst into his own desires... Along the way, Neal realizes that life choices are permanent, for better or for worse. Keanu Reeves appears briefly as Beat writer Jack Kerouac, silky and smooth, who helps Neal smooth out his rough edges. The soundtrack is excellent, and a must have for anyone who likes Jazz. The brilliant, landmark Jazz featured is the soundtrack of the Beats themselves, lively, progressive, explosive, the compositions infinite in possibilities.",
         "I am writing this because I am in stark disagreement with a certain editor. This little film shows excellent directing, cinematography and acting. It stands as testimony against, and is infinitely better then, most of the talentless \"indie\" wastes of time that you'll see in the country's smaller theaters today. Thomas Jane BECOMES a young Neal Cassady, and displays one of the finer performances you'll ever see on film. In fact, the acting is excellent overall (To which the director should be praised). Admittedly, if you are interested in the legend of Neal Cassady this movie is going to be much more interesting to you. Still, even if you are not, it is a fine story of unrequited love, with humor and the spirit of the enjoyment of life. It is a touching period piece, excellently delivered and exceptionally written. The other Cassady-driven movie (unrelated to this cast and crew) - \"Heart Beat\" (1980) - hits you like a stale yellow lamp on a boring Sunday afternoon by comparison. This film is vivid and beautiful. It is a shame that a film of this caliber is being ignorantly shuffled under the carpet, becoming prematurely harder to fine with each passing day, while the constant deluge of mindlessness produced by the big studios becomes marketed ad nauseam over the course of decades. Stephen T. Kay made the kind of film that inspires filmmakers. The soundtrack - also becoming harder and harder to find - cannot be beat (It remained untouched from my CD player for months). Personally, I had never been a fan of jazz music before owning it.",
         "This film is a perfect evocation of Neal Cassady, Jack Kerouac, Allen Ginsberg and the times that they lived in. It is the way they and other members of the Beat Generation lived. The script by Stephen Kay is based on a letter that Neal Cassady wrote to Allen Ginsberg about an adventure he had with a girl called Cherry Mary. Thomas Jane gives an outstanding performance as Neal, and Gretchen Mol is a scene-stealer as Cherry Mary. The cast is rounded out with strong supporting turns by Claire Forlani, Keanu Reeves (surprise, surprise!), and Adrien Brody. The direction, soundtrack, costumes, and cinematography all conspire to put you back in time. Stephen Kay is an assured director with just the right touch.",
         "This is an excellent film which really captures the feeling and atmosphere of the Beat Generation. The film is based around a letter Neal Cassady (seen as Dean Moriarty in Jack Kerouac's seminal 'On The Road') wrote to Jack Kerouac about his 16 year old girl friend Cherry Mary. I won't go into anymore details as I think the less you know about a film before seeing it the better - but suffice to say that if you have any interest in the beat generation, or enjoyed any of Kerouacs books you'll like this film. Cinematography and music are both also exceptional.",
         "The best thing about this movie is the opening scene, where Neal Cassady is doing more daydreaming and dancing then he is working on his writing. The beginning of the movie screams to Cassady's life, and shows the audience a Marlon Brando type character that had strong ties with folks like, Allen Ginsberg and Jake Kerouac. Cassady, a forgotten literary figure with more passion for creativity then progress in writing, would later become the character to drive the bus in Ken Kesey's, The Electric Kool-Aid Acid Test. It is important to note, that while Cassady had only one decent literary publication, his zealous outlook on life was borrowed by some of the \"great literary beat writers\" in America. The Actor Keanu Reeves, who I have never been a huge fan of, does an excellent job of shedding light on Cassady's constant dissonance about leaving the life of a beat writer, for the life of a 9-5 working man with a stable house, beautiful wife, and loving family. The movie overall, is about this dissonance, is about the passion that Cassady had for both the creative life and the more stable environment of the family life. Sadly, Cassady was unable to find balance between the two. Do not expect, watching this movie that it will touch your life with a \"wow-effect\" forever. It is not some type of magical-beat-generation-movie that you can philosophize about for hours, it is just a pretty good movie. What you can keep with you forever, however, is the soundtrack to this movie, The Last Time I Committed Suicide. With scores of music from folks like, Miles Davis, Dizzy Gillespie, Thelonious Monk, Tyler Bates, Ella Fitzgerald and Charles Mingus, this soundtrack is sure visit any jazz lovers CD player often.",
         "When I first read this letter written by Neal Cassady to Jack Kerouac, I was moved beyond words. I had to read it over a few more times to really absorb the feel of it. There are two amazing things about it: 1.) That this man had such an amazing talent for writing & 2.) That this man actually LIVED like that! I was curious to see what the movie would do to the letter (movies are rarely ever as good as the written form), and what I saw blew me away! While I have noticed that the real Neal Cassady is more \"jittery & wirey\" (the man never sat still!), the actor Thomas Jane gave a remarkable performance as Neal! I felt that every actor was perfectly fitting to their respective part, and that the story was told with atypical accuracy! I'm sure that my copy is going to break soon, seeing as I keep playing it over and over again. Being a beat girl at heart, this has become my absolute favorite movie of all time.",
         "Intelligent character portrayal of figures who profoundly influenced popular culture. Not for everyone, but if you want to be more than spoon-fed, its great. Claire Forlani and Gretchen Mol give terrific performances. Not your typical Reeves flick, but a refreshing performance from his normal brain dead stuff.",
         "To appreciate this film the viewer needs either to be in a jazzy, rebellious sort of mood, or have some interest in Neal Cassady, an American who figured heavily in the development of the \"beat generation\" of the 1950s. Set in the 1940s during one notable period of Cassady's life, the film is mostly a character study of Cassady (Thomas Jane), and his relationship with other people in his life, including his friend Harry (Keanu Reeves) and various romantic interests, the central one being Joan (Claire Forlani). But Cassady was a quirky kind of guy, a rebel, a nonconformist, fun loving, with a restless energy, a person constantly on the move, both physically and philosophically. As presented in the film, he is a cross between James Dean and Jim Morrison. Cassady's offbeat personality is mirrored in the film's offbeat style. It's shot partly in color and partly in B&W. Plot structure seems deliberately chaotic, frenetic, loose. Jump cuts can be jarring for viewers expecting a smoothly flowing, linear plot. And the tone alternates between silly and philosophical. Background music is mostly jazz with some blues thrown in. Accordingly, a lot of viewers will find the film's unorthodox style off-putting. But I liked it, for the most part. The plot would have been stronger if it had focused on Cassady's 1950s relationship with other historical figures, like Jack Kerouac and Allen Ginsberg, instead of his romances with random women. Otherwise, the cinematography, the music, and the performance of Thomas Jane are terrific."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Bates Entertainment",
         "Kushner-Locke Company, The",
         "Tapestry Films"
      ],
      "summaries": ["Neal Cassady is living the beat life during the 1940s, working at The Tire Yard and and philandering around town. However, he has visions of a happy life with kids and a white picket fence. When his girlfriend, Joan, tries to kill herself he gets scared and runs away. But when Joan reappears will he take the chance at that happiness, or will he turn his back on it?"],
      "budget": 4000000
   },
   "movielensId": 1567,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-20",
      "dvdReleaseDate": "2005-09-13",
      "directors": ["Stephen T. Kay"],
      "runtime": 92,
      "movieId": 1567,
      "title": "The Last Time I Committed Suicide",
      "mpaa": "R",
      "actors": [
         "Thomas Jane",
         "Keanu Reeves",
         "Claire Forlani",
         "Gretchen Mol",
         "Adrien Brody",
         "John Doe",
         "Jim Haynie",
         "Marg Helgenberger",
         "Lucinda Jenney",
         "Amy Smart",
         "Alexandra Holden",
         "Clark Gregg"
      ],
      "imdbMovieId": "0119502",
      "originalTitle": "The Last Time I Committed Suicide",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["kPdJxxkY-6U"],
      "plotSummary": "Neal Cassady is living the beat life during the 1940s, working at The Tire Yard and and philandering around town. However, he has visions of a happy life with kids and a white picket fence. When his girlfried, Joan, tries to kill herself he gets scared and runs away. But when Joan reappears will he take the chance at that happiness, or will he turn his back on it?",
      "tmdbMovieId": 34941,
      "avgRating": 2.90964,
      "releaseYear": "1997",
      "numRatings": 83,
      "posterPath": "/kz5PWqGTVg5TmsfOxeFYc6ChFb2.jpg"
   }
}