{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "experimental",
            "id": 14629
         },
         {
            "name": "rooftop",
            "id": 15219
         },
         {
            "name": "telephone conversation",
            "id": 208645
         },
         {
            "name": "japanese cyberpunk",
            "id": 209992
         },
         {
            "name": "part of trilogy",
            "id": 236175
         }
      ],
      "imdb_id": "tt0105569",
      "video": false,
      "title": "Tetsuo II: Body Hammer",
      "recommendations": [
         41577,
         52034,
         33431,
         27276,
         25951,
         41428,
         36702,
         87859,
         38405,
         26040,
         118170,
         134769,
         67430,
         14355,
         23984,
         79860,
         258945,
         25740,
         159185,
         92676
      ],
      "backdrop_path": "/3LsGIsLAPx0QDltVmEXAW4Tc7xa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Taniguchi Tomoo",
               "gender": 2,
               "credit_id": "52fe47589251416c75096177",
               "name": "Tomorowo Taguchi",
               "profile_path": "/3Gf8GXzl2ZsvOQnW5DOi65Nsk16.jpg",
               "id": 67091,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Yatsu - The Guy",
               "gender": 2,
               "credit_id": "52fe47589251416c7509617b",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kana",
               "gender": 0,
               "credit_id": "52fe47589251416c7509617f",
               "name": "Nobu Kanaoka",
               "profile_path": null,
               "id": 126453,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Taniguchi's Father",
               "gender": 0,
               "credit_id": "52fe47589251416c75096183",
               "name": "Kim Sujin",
               "profile_path": null,
               "id": 543812,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Big Skinhead",
               "gender": 2,
               "credit_id": "52fe47589251416c750961b7",
               "name": "Hideaki Tezuka",
               "profile_path": null,
               "id": 224454,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Young Skinhead",
               "gender": 0,
               "credit_id": "52fe47589251416c750961bb",
               "name": "Tomoo Asada",
               "profile_path": null,
               "id": 554880,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Taniguchi's Mother",
               "gender": 0,
               "credit_id": "52fe47589251416c750961bf",
               "name": "Iwata",
               "profile_path": null,
               "id": 554881,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Minori",
               "gender": 0,
               "credit_id": "52fe47589251416c750961c3",
               "name": "Keinosuke Tomioka",
               "profile_path": null,
               "id": 554882,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Mad Scientist",
               "gender": 0,
               "credit_id": "52fe47589251416c750961c7",
               "name": "Torauemon Utazawa",
               "profile_path": null,
               "id": 554883,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47589251416c75096173",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47589251416c75096189",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47589251416c7509618f",
               "name": "Chu Ishikawa",
               "profile_path": null,
               "id": 144931,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47589251416c75096195",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe47589251416c7509619b",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe47589251416c750961a1",
               "name": "Takashi Oda",
               "profile_path": null,
               "id": 80800,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe47589251416c750961a7",
               "name": "Fumikazu Oda",
               "profile_path": null,
               "id": 554878,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47589251416c750961ad",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47589251416c750961b3",
               "name": "Katsunori Yokoyama",
               "profile_path": null,
               "id": 554879,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.931776,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 17991,
      "vote_count": 28,
      "budget": 0,
      "overview": "Tetsuo II: Body Hammer is a 1992 Japanese science fiction/horror film directed by Shinya Tsukamoto. It is a bigger-budget reworking of the same director's 1989 movie Tetsuo: The Iron Man, utilizing similar themes and ideas to the earlier film (a Japanese salaryman, played by cult actor Tomorowo Taguchi, finds his body transforming into a weapon through sheer rage after his son is kidnapped by a gang of violent thugs.) It was not as well received as its predecessor but it did win the Critic's Award at the 3rd Yubari International Fantastic Film Festival in February 1992.",
      "similar": [
         2652,
         49527,
         49040,
         460793,
         82023,
         458663,
         455661,
         251516,
         9833,
         376570,
         36208,
         42684,
         326359,
         293299,
         13932,
         50393,
         11478,
         473072,
         256835,
         13042
      ],
      "original_title": "鉄男II THE BODY HAMMER",
      "runtime": 83,
      "poster_path": "/w8wzvZZj2BYiYRbwJRbmQGJFraU.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "1992-01-01",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/6fCcJEC0orrFkIXd4NUxgVcyPK9.jpg",
         "name": "Tetsuo Collection",
         "id": 182923,
         "poster_path": "/xkV5Xy4nKs6bk7ol4UoBInk2JVW.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shin'ya Tsukamoto"],
      "runtime": 83,
      "synopsis": null,
      "writers": ["Shin'ya Tsukamoto"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0105569/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5OTYwOTkwNV5BMl5BanBnXkFtZTcwMTMwMTEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tomorowo Taguchi, Shin'ya Tsukamoto, Nobu Kanaoka | See full cast and crew »"],
      "reviews": [
         "This movie is highly recommended for the fans of its predecessor, although it's not in black and white, doesn't have as good of a soundtrack or have as much surrealism as the first film, but it remains to be a bit more action-packed and (let's not forget) makes a bit more sense. This time, the salary man (the protagonist from the first film) lives a normal life with his family until one day his son gets kidnapped and the salary man is forced to be experimented on by a large a gang of skinheads which speeds up the mutating process of becoming a part-metal weapon and part-human being. It's not really a sequel but it surely is one of the greatest underrated films of-all-time and is about as good as the first film (TETSUO), if not, better.",
         "What a movie. You don't stumble onto a film like Tetsuo II: Body Hammer every day, and that's probably a good thing. The jerkier-than-Blair Witch cinematography, the wild & crazy stop motion special effects, and the bucketloads of gore are fairly sufficient to ensure that some viewers won't like this movie. Since you're actually reading this, though, you're probably a pretty jaded and open-minded film fan, which is exactly the audience that would end up liking Body Hammer. It's one of the craziest and most extreme movies I've ever seen, particularly in the brutal, nearly unwatchable flashback sequence which occurs in the last twenty minutes. It's one of those scenes that you never, ever, ever forget. But aside from the brutal and bizarre violence, there is great artistry here; the scenes between Taniguchi and his family strike a real chord of tragedy, and the special effects somehow succeed precisely because they DON'T look real at all. And Tsukamoto's vision of Tokyo is terrifying-- he makes the city look like a nearly uninhabited frozen hell of silent glass towers and crumbling steel factories. If any of this sounds appealing, you might just like this movie as much as I do. Tsukamoto's style can be incredibly jarring, but you'll end up running out to find everything else he's directed (to my knowledge, his only other films available in the US are the original Tetsuo and his horrific boxing film Tokyo Fist). Shinya Tsukamoto is one of the most inventive directors alive-- you never know what abomination he's going to create next. And Tetsuo: Body Hammer might just be his best film.",
         "Tetsuo II: Body Hammer is director Shinya Tsukamoto's sequel/re-make/companion piece to his cult, low-budget 1988 art-house shocker Tetsuo: The Iron Man; a striking piece of hyper-kinetic visual film-making, in which an anonymous Japanese business man finds his body inexplicably mutating into a mass of metal, wire and steal. This version of the story cleans up and clarifies some of the more indistinct and visually abstract points established in the original film, but also adds to it a greater psychological subtext and a broader dramatic scale. The film begins in a more recognisable world than Tsukamoto's original, with the use of colour (albeit, heavily tinted to shades of blue, amber and grey) creating a more recognisable Tokyo that will later be juxtaposed against the hellish underworld depicted in the second half of the story. There's also more believable characterisation, a loose plot and some vague explanations for what is actually happening. Some fans of the original film consider this to be Body Hammer's major failing; with the clarification and characterisation detracting from the weird \"wow-factor\" of the original Iron Man film; which, as a work of great science-fiction cinema, really existed in its own world devoid of conservative narrative and cinematic convention. I like to appreciate the film from another perspective, however; with Tsukamoto simply fleshing out the themes of the original film a little further, in the same way that a song-writer might often perform a number of different songs about the same subject, but most often, with a different style and arrangement. Tsukamoto has always been more of an artist than a traditional filmmaker, which is why you can see the same themes resurfacing again and again in a different context throughout his work. Tsukamoto's principal preoccupations as a filmmaker are often with alienation, claustrophobia, technology, and most importantly, the human body. Throughout his work, Tsukamoto has looked at the self-inflicted destruction of the body, via films such as Iron Man, Body Hammer and Tokyo Fist; through to the more traditional notions of natural decay and internal destruction with films like A Snake of June, Bullet Ballet and Vital. All of these characteristics are present here, with the film showing us how easily tragedy can strike (and go un-noticed) in a built up city, and how striving to become the ultimate human often involves a melding of man with machine (the natural with the synthetic). The great thing about Tsukamoto's work is that it can often be enjoyed on a number of levels, so, with Body Hammer, we have something that could be viewed as a straight science-fiction film with elements of cyber-punk derived body horror, or instead we could look at some of the deeper, metaphorical interpretations pertaining to the loss of a child, parenthood, childhood trauma, guilt, and perhaps even notions more unsavoury than that! Without wanting to give away too much, there's an element of the plot here that involves the central character's infant son being kidnapped. What follows is quite shocking and heavily symbolic, but I personally like to think that this moment is actually the real impetuous for Body Hammer's plot. So, we have the idea of a character spiralling into a pit of despair, consumed by guilt and losing his mind and the trust of his wife in light of this tragic chain of events! Now, I'm not pretending I know all the answers here, but I like to theorise. Someone else might view the film and take from it an entirely different interpretation but could still find it enjoyable and entertaining. The fact remains that despite the layers of personal interpretation the one thing that will always stand out - regardless of whether or not you liked the film - is the unbridled imagination and visual flair that Tsukamoto brings to the project as it's writer, director, editor, art director, cinematographer, designer and supporting actor. It certainly won't be to all tastes, as even committed admirers of the first Tetsuo film often write this one off as an interesting failure, but for me, this film offers an entirely new perspective on the territory of Iron Man and the usual preoccupations of Tsukamoto's later films, such as Tokyo Fist, A Snake of June and Vital. As Roger Ebert wrote in his review at the time, \"Tetsuo II' doesn't rise (or stoop) to the level of conventional action or suspense; it's a design concept, a director's attempt to take some of the ideas in Blade Runner and some of the Arnold Schwarzenegger films and the Japanese animated films like Akira and extend them into grotesquery\". It's perhaps not on a par with some of Tsukamoto's other works, chiefly Tetsuo, Tokyo Fist, Gemini and A Snake of June, but regardless, remains a unique viewing experience for those who are genuinely into through-provoking, visually arresting art-house shock cinema. On a final note, I would perhaps suggest starting here and then progressing onto the first Tetsuo film, as this one is a little less challenging and easier to get through and thus acts as a nice little gateway into this particular filmmaker's warped and wonderful world.",
         "When I saw Tetsuo: Ironman this past January, I was amazed. While I had always been intrigued by the video's box, I had never heard anything about it. It blew me away with its visceral imagery and insanity. Now, finally, I've seen Tetsuo II. I gave the first one a 10/10 on imdb, and I give II a 9/10. This one is amazingly directed, filmed, acted, and developed. It has lost a bit of the first one's viscerality, and the plot is a bit more conventional (although it has just a few discernable conventions, like the rivalry between brothers in youth, the fact that one of them was good and one of them was evil, etc. Really, though, when you see it you'll probably not be thinking it conventional at all). Also, the first film's breakneck speed has been slowed down a little. In the first one, the plot was difficult, if not impossible, to understand. Body Hammer takes time to make us understand, and that is not necessarily a good thing. Still, Tetsuo II is a very great film. I just wish Shinya Tsukamoto had more films available in America!",
         "The original Tetsuo: the Iron Man was a pretty unforgettable film. Shot in intense black and white and very pure in its intentions, it was an avant-garde sci-fi horror movie. An immediate cult film. With the follow up, director Shin'ya Tsukamoto has made a film which is more a remake than a true sequel. In this one, he shoots in colour and tries to incorporate a story of sorts. Although, this is a relative statement, as this is still a very weird film and it hardly adheres to cinematic storytelling norms. In essence it is once again about a man turning into a cyborg. Like the first it's visually very striking indeed. It seems to have influenced an awful lot of industrial bands from the 90's, seeing as many of their videos mimic the imagery found in this one. It's soundtrack I guess adds to this seeing as it is full on rock a lot of the time. As a piece of visual art Tetsuo II is a success. However, I do not think it reaches the same level as the original movie, which for my money was such an original piece of work it is hard to outdo. I think the introduction of more story here is also to the film's detriment. The story gets in the way, something you could never accuse the original film of. Still, this remains a pretty intense experience.",
         "Tetsuo II: Body Hammer is the second entry in the Tetsuo series and arguably an improvement over the first film. It has a more coherent plot, better special effects, and a better flow. Of the two, it was the more accessible film. Body Hammer follows the struggle of a seemingly meek man after his son is kidnapped by a ruthless gang / cult. The cult is run by a mad scientist who seeks to combine man and machine. When the father is subjected to one of these experiments, all hell breaks loose. Although surreal, Tetsuo II is a distinctly more conventional film than its predecessor, which came across as a grotesque student film. The sequel has a more typical sci-fi action plot even as it uses the bizarre animation and concepts that made the original a cult classic. This is actually a good thing, as it makes it easier to discern what the director is trying to get across. The film also benefits from improved special effects and costumes. While the original relied on rather clunky stop motion animation, the effects in Body Hammer are far more convincing. There are some issues with the film's plot, not the least of which being why the gang would grant super powers to someone whose son they had just kidnapped. Nevertheless, it is definitely a worthy follow-up to the original.",
         "This is truly a worthy sequel. A brilliant re-imagining with increased budget and, yes, something approaching a story. But don't be surprised if you lose the plot yourself, just sit back and be amazed by this work of live manga brilliance. Be perversely moved too, as I was, by the family story at the heart of the work. The effects are unique and uniquely unreal, as they were in the original. This is one filmaker's nightmares rendered real. These two films, along with Lynch's Eraserhead, are the real deal. The cutting is fast so as to cause many (already extreme) shots to register on the subconscious more than the seeing eye. It will haunt you. Very highly recommended indeed.",
         "First off, TETSUO 2 is far superior to the original. Although I still liked them both, I have to say I was far more impressed with this one than THE IRONMAN. Why? Well the story & plot for one, it seemed to make a lot more sense this time around with a short glimpse into both men's past. All questions asked after viewing the original, I think were answered in this one. The only problem I have with this one is that I think he should of kept it in Black & White. All comparisons aside, basically to explain this movie in any logical sense is absurd. But what the heck; If you took a boiling pot of water, threw in an episode of the INCREDIBLE HULK, added a tablespoon of A CLOCKWORK ORANGE, and mix it with generous portions of THE TERMINATOR, you would have TETSUO 2: BODY HAMMER. A hyper-kinetic, yeah that's the word, stylish sci-fi movie done in the tradition of Japanimation, only its real-life.",
         "After his son is abducted & maybe even killed by some strange men, a frustrated father finds himself morphing into a half man half metal being, full of gears, wires & cables etc. Determined to find his son, his wife is soon abducted & learns a terrifying secret about her husbands connection to the leader of the group. TETSUO 2 is the in colour sequel to the directors really weird, creepy nightmare caught on black & white film TETSUO. This time the director obviously had a bigger budget to play with & just like in the original, the film is filled with stop motion animation, half human half cyborg creatures & people morphing into monsters, it also has somewhat more of a plot which based on the almost no existent plot of the original, is just as wild, however just like the original, the film makes the mistake of overusing it's stop motion & weirdness. The acting is poor & the direction although slightly better than the first, is still pretty bad & the film has nothing to offer those looking for more meat on it's bones regarding a decent plot. The film lacks the weird nightmarish edge of it's predecessor, yet the effects work is just as good. All in all like it's predecessor from which it is connected to in no way other than the same people who made it, the title & the concept of a human slowly mutating into a machine, this is an over-hyped movie that in the end is unforgettable, but fails to satisfy. Hopefully it's in the works sequel TETSUO: THE BULLETMAN is better. **1/2 stars",
         "Like Canadian filmmaker David Cronenberg (early on in his career, anyway) and America's own David Lynch, Shinya Tsukamoto has mined (and defined) his own particular brand of cinematic gold. When he's at his best (as he is here), Tsukamoto is a brilliant blacksmith, hammering out searing, steamy imagery with a pulsating potency. Human beings in his films are often hardened, mentally, physically and- most important of all- emotionally. They move through cold, unforgiving industrial landscapes (where buildings tower like sterile tombstones) that become surreal dreamscapes populated by living, breathing nightmares. THE BODY HAMMER offers some of Tsukamoto's most interesting: bodybuilding skinheads (denizens of the darkest depths of the society that spawns them) who literally harden themselves into (first flesh and blood, then) metal monsters bent on total destruction- their own as well as everyone else's. The idea of the rivet guns that cause them to rust out was a great touch- and the pulsing music is a hammer on an anvil. Check out THE BODY HAMMER- if you've got the wiring (guts)."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Kaijyu Theater",
         "Toshiba EMI"
      ],
      "summaries": ["Sequel to \"Tetsuo\" this time has the Iron Man transforming into cyberkinetic gun when a gang of vicious skinheads kidnap his son. When the skinheads capture him, they begin to experiment on him...speeding up the mutative process!"],
      "budget": 0
   },
   "movielensId": 1570,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1992-01-01",
      "dvdReleaseDate": "1999-06-29",
      "directors": ["Shinya Tsukamoto"],
      "runtime": 83,
      "movieId": 1570,
      "title": "Tetsuo II: Body Hammer",
      "mpaa": "",
      "actors": [
         "Tomorowo Taguchi",
         "Shinya Tsukamoto",
         "Nobu Kanaoka",
         "Kim Sujin",
         "Hideaki Tezuka",
         "Tomoo Asada",
         "Iwata",
         "Keinosuke Tomioka",
         "Torauemon Utazawa"
      ],
      "imdbMovieId": "0105569",
      "originalTitle": "鉄男II THE BODY HAMMER",
      "genres": [
         "Science Fiction",
         "Horror",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Tetsuo II: Body Hammer is a 1992 Japanese science fiction/horror film directed by Shinya Tsukamoto. It is a bigger-budget reworking of the same director's 1989 movie Tetsuo: The Iron Man, utilizing similar themes and ideas to the earlier film (a Japanese salaryman, played by cult actor Tomorowo Taguchi, finds his body transforming into a weapon through sheer rage after his son is kidnapped by a gang of violent thugs.) It was not as well received as its predecessor but it did win the Critic's Award at the 3rd Yubari International Fantastic Film Festival in February 1992.",
      "tmdbMovieId": 17991,
      "avgRating": 3.14371,
      "releaseYear": "1992",
      "numRatings": 334,
      "posterPath": "/xZh9BOhps8LFVe2cigj9D1NNZDF.jpg"
   }
}