{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "cat",
            "id": 977
         }
      ],
      "imdb_id": "tt0115856",
      "video": false,
      "title": "When the Cat's Away",
      "recommendations": [
         100075,
         33095,
         47507,
         52366,
         40089,
         54157,
         63172,
         31329,
         33916,
         14646
      ],
      "backdrop_path": "/e9tzkkgNaZMVyjQ45foliJA9jE8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Chloé",
               "gender": 0,
               "credit_id": "52fe44a99251416c7503c9bf",
               "name": "Garance Clavel",
               "profile_path": "/vfKpG6Tjm7bfh095QJA8kU0tfes.jpg",
               "id": 71776,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Djamel",
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9c3",
               "name": "Zinedine Soualem",
               "profile_path": "/fSXaPheMM4e6BUxPMaXrjIi8k4N.jpg",
               "id": 5445,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Madame Renée",
               "gender": 1,
               "credit_id": "52fe44a99251416c7503c9c7",
               "name": "Renée Le Calm",
               "profile_path": null,
               "id": 64550,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Michel",
               "gender": 0,
               "credit_id": "52fe44a99251416c7503c9cb",
               "name": "Olivier Py",
               "profile_path": "/27irRy4qzeiHvmNJ6IKECLghT8U.jpg",
               "id": 71777,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Carlos",
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9ed",
               "name": "Simon Abkarian",
               "profile_path": "/oR1F42rVMY8QsmjK0R8ST4RBBe0.jpg",
               "id": 10917,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "la femme flic",
               "gender": 0,
               "credit_id": "52fe44a99251416c7503c9f1",
               "name": "Marilyne Canto",
               "profile_path": "/1CaxF9ObGNwaZViRHMxv7tZ5K5U.jpg",
               "id": 73828,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "le mec bourré",
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9f5",
               "name": "Antoine Chappey",
               "profile_path": "/lOUmq6MGnN5tg4sTy15QG4DXVea.jpg",
               "id": 20672,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "le joueur de batterie",
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9f9",
               "name": "Romain Duris",
               "profile_path": "/2pFMVxyKbVkULNWqXbqFb3TV7zK.jpg",
               "id": 17497,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "un mannequin",
               "gender": 1,
               "credit_id": "52fe44a99251416c7503c9fd",
               "name": "Hélène de Fougerolles",
               "profile_path": "/lVRJ72h8lAyiYuqwBWUwMkRyPTc.jpg",
               "id": 76827,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "le militant onze de pique",
               "gender": 2,
               "credit_id": "52fe44a99251416c7503ca01",
               "name": "Eric Savin",
               "profile_path": "/1lOzTHdohh9pHwmd92BvWtKoRUa.jpg",
               "id": 136438,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9b5",
               "name": "Cédric Klapisch",
               "profile_path": "/bUujgUI3PZ9qK54uGzndVp4CNRc.jpg",
               "id": 17520,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9bb",
               "name": "Cédric Klapisch",
               "profile_path": "/bUujgUI3PZ9qK54uGzndVp4CNRc.jpg",
               "id": 17520,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9d1",
               "name": "Benoît Delhomme",
               "profile_path": "/qa2h6tyIG4iIc700VN7acYnhU4v.jpg",
               "id": 21655,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a99251416c7503c9d7",
               "name": "Francine Sandberg",
               "profile_path": null,
               "id": 17532,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a99251416c7503c9dd",
               "name": "Aïssa Djabri",
               "profile_path": null,
               "id": 17625,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a99251416c7503c9e3",
               "name": "Manuel Munz",
               "profile_path": null,
               "id": 71778,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a99251416c7503c9e9",
               "name": "Farid Lahouassa",
               "profile_path": null,
               "id": 63124,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.574062,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 11956,
      "vote_count": 21,
      "budget": 0,
      "overview": "When Chloe (Garance Clavel), a young Parisian, decides to take a long-overdue vacation, she has to find someone to look after Gris-Gris, her beloved cat. Everyone, including her gay male roommate, refuses to help her, but she finally makes an arrangement with the elderly Madame Renée (Renée Le Calm), who often watches over other peoples' cats and dogs. However, when Chloe comes back, Madame Renée tells her that unfortunately the cat has been lost, and the unlucky owner goes on a search for her dear animal friend. While looking for the cat, she meets many colorful characters who populate the neighborhood.",
      "similar": [
         3989,
         10112,
         342473,
         2062,
         16859,
         591,
         95,
         707,
         10137,
         1597,
         817,
         1281,
         10204,
         59436,
         39451,
         49013,
         112160,
         112205,
         140300,
         116149
      ],
      "original_title": "Chacun Cherche Son Chat",
      "runtime": 91,
      "poster_path": "/qr4oDABJRkbEXIfriuvGATR6lmy.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Vertigo Productions",
            "id": 2756,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 15671,
            "origin_country": ""
         }
      ],
      "release_date": "1996-04-03",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "No man. No job. No cat.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Cédric Klapisch"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Cédric Klapisch"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0115856/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0OTEyOTY1M15BMl5BanBnXkFtZTYwNzk0NDg5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Garance Clavel, Zinedine Soualem, Renée Le Calm | See full cast and crew »"],
      "reviews": [
         "This was a thoroughly enjoyable film, with a very interesting use of editing in parts... The film's main character, Chloe, lives with her gay flatmate, Michel, has few friends, and definitely no love life to speak of. She works as a make up artist, a job which she hates. One day, Chloe goes away on holiday, and leaves her cat with the local cat lady, Mme Renoir. Upon returning home, Chloe's cat, Gris-Gris, has disappeared. So starts a search for Gris-Gris that the whole neighbourhood is involved in. We are taken on a journey through a district of Paris quite distinct from any glamorised Hollywood image you'll ever see. This is the real, working, living Paris, with real people living in it, and this particular area is in a phase of 'urban development', with a lot of the traditional, working class aspects of the community being pushed aside to make way for the progress of bourgeois trends. We meet a whole host of this area's inhabitants along the way, each with their own eccentricities and foibles; characters that soon become part of Chloe's life. The disappearance of the cat instigates Chloe's search into her own life, to fill the gaps that are missing. This film centres around the hopes and desires of one character in particular (Chloe), but the backdrop is a vessel for expressing changes that are affecting real people in Paris. An interesting, arty approach to a film about the search to find oneself, and come to terms with an ever changing world that one may feel at odds with.",
         "A wonderful insight into the types of characters we might meet in a rundown part of Paris which has seen better days and which is being demolished to make way for new and modern buildings. In some respects it's like a documentary about the concerns of the local populace for Gris-gris, a missing black cat. I think all the characters are well portrayed as a network of searchers comb the whole area and maintain daily reports over the telephone. I think the old lady Renee is absolutely priceless, not only as the recognized cat-minder but as a person who is able to express an opinion on every conceivable subject about Parisian life and attitudes. The search for Gris-gris takes us across rooftops and down alleyways to no avail and we ourselves become totally involved in the cat's whereabouts and hope he has come to no harm. It's amazing that such a simple theme can maintain our interest for 90 minutes, but undoubtedly it's the authenticity of the characters that makes this film so enjoyable.",
         "Am I glad that European (especially French) cinema is still live and well. Every time I loose hope for the future of cinema, a film like this comes and gets me excited again! This is one of those rare films that not only entertains but also reminds us of our easily overlooked qualities and weaknesses. The main character goes through an experience that we all go through - looking for her \"better half\". And the way she does it as well as the way it happens is so beautifully realistic and lively. (by the way, the original title in French means \"Everyone is searching for a cat\" - which is much better then \"When Cat's Away\"). This film also has some of the finest acting I've seen in the recent years! I am personally tired of Hollywood's stereotypes and larger then life actors, and this film is refreshing in that respect. I know that acting was good when after the film I can't imagine those actors doing anything else in their lives except the very thing they did in the film. For example there is a fashion designer for whom the main character works and that funny, alienated, two-faced woman is just too believable. I could almost swear that she's like that in real life. Or the main character who goes through periods of self doubts, rejections, confusion... The story in this little gem is brilliant, as are all the actors and their characters. Even the city of Paris is a character - different from the one we are used to (and so is the area around Bastille which until a few years ago was not as hip as it is today). This film is not trying to get our attention with violence or sex or with intimidation and gore; it is a simple film about simple people in seemingly simple situations that are so true to life and therefore funny, original and interesting. As a matter of general principal I bought this film on a video tape - one of less then 50 that I own. If you appreciate true emotions, true unpretentious funny people and are looking for a good way to bring your spirits up, then you should see the film. Someone mentioned that the film was depressing and nothing is further from the truth. If on the other hand you are looking for over stimulating, over polished, over scripted and \"smart\" film then this may be a bit of a letdown. I can imagine people who are too used to Hollywood disliking this film. All in all - strong 10/10.",
         "Thank God for Sundance, for I'd otherwise never had seen this hidden gem. Admittedly I am a Francophile, and a Francophone, and these are probable reasons I found myself enchanted by the sound, cinematography (gorgeous), believeable and mature plot line and dialogue. I feel this is one of the finest movies I've ever seen- it was a joy from start to end. I loved the song (English) played as the credits rolled- I wish I could find it. I want to see more from this director, and I am *so* grateful that the Sundance channel brings such hidden gems as these French movies I'd otherwise miss. Wasn't it they who brought me Ridicule? (another ALL TIME favorite)",
         "The superb Al Green moaning one of his greatest songs : I'm so tired of being alone. That about sums it up. Klapish is quickly becoming one of my favourite directors, making great movies with small budgets like l'auberge espanol. I don't fall in love with actresses every time I see a movie but Garance Clavel will certainly haunt my daydreams for a few days... Credits to the other actors, especially Zinedine Soualem and Renée le Calm. This is a warm, sparkling and very true movie about real persons and real emotions, (and therefore) sometimes funny, sometimes tragic. A movie that makes one run out the door and ...",
         "Much preferable to Klapisch's follow-up, the stagebound UN AIR DE FAMILLE, this film still visualises the traumatic labyrinth of its heroine as she tries to escape her diffident personality, her rotten luck with men and the bewildering changes to her beloved Paris. Klapisch isn't above using his cat metaphor scatalogically as well as philosophically, but the detective search for enlightenment gives the plot a badly needed momentum the second film lacks. Rohmeresque, it's been called, and you can see the point in the reliance on dialogue, young protagonists, irony and colour-coding, if not the elder's overarching critical intelligence. CHACUN achieves an empathy with its heroine the Master might envy.",
         "Chloe, a young woman lacking of self confidence, is looking for the love of her life... but, well, in the only company of her cat Gris-Gris and her gay roommate, it seems to be difficult ! One day her cat disappears and Chloe has to get the better of her natural timidity to find him again, questionning the whole neighbourhood with the help of many lovely grans and the ingenuous Djamel. Chloe will learn more about the others and herself, actually searching for the cat could be here interpreted as searching for love - and for herself. So, aren't we all searching for our cat too ? This film is really well performed (by the charming Garance Clavel and many non-professionals), sometimes funny and light, sometimes inducing us to think a bit more about human relationships (Cédric Klapisch tries also to point out the terrible consequences of the destruction of whole districts in Paris). In four words : go and see it !",
         "The last time I saw Paris was in Eric Rohmer's \"Rendez-Vous.\" Now I've revisited in \"While the Cat's Away (Chacun cherche son chat).\" It's \"Seinfeld\"-ian in that nothing really happens (and sometimes its 95 minutes do drag) but it's a wonderful slice of urban life in a gentrifying neighborhood as residents occupy different eco-systems in the same locality. It could easily be re-made on the Upper West Side of NYC, or other city neighborhoods. It is quite a lovely little movie. Many of the actors are non-professionals that really are their neighborhood's local color characters. However, at last night's showing someone brought their kids thinking because it had an animal in the title it was appropriate. I did not think so - there are visuals and discussion of explicit sex (hetero- and homosexual) as well as sexual harassment threats that I do not think are appropriate for children. (originally written 7/24/1997)",
         "1996 was the year during which Cédric Klapisch definitely imposed his talent in the landscape of French cinema thanks to two feature movies: \"un air de famille\" and \"chacun cherche son chat\". The ones who have been enthralled by these two flicks won't contradict me. Written day-to-day on account of the evolution of the story, shot with a shoestring budget, acted by only 2 or 3 professional comedians and virtually non-professional actors, \"chacun cherche son chat\" confirms all the hopes placed in Klapisch. One thing I noticed with him is that he has the gift to entitle his movies with catchy and funny titles (which can only be understood by French-speaking people; here \"chacun cherche son chat\" was translated abroad by :\"when the cat's away\" whereas the original title in French is \"everyone's looking for his/her cat\"). \"Chacun cherche son chat\" clearly obeys to this trend. The main character is a teenage girl, Chloé who's looking for her cat in a popular neighborhood in Paris. We find again in this film, a few themes and features peculiar to Klapisch which he will develop and improve in his future movies like the initiatory voyage \"l'auberge Espagnole\" (2002). About it, for Klapisch the loss of Chloé's cat \"Grisgris\" mainly serves as a pretext to confront her heroin with the exterior world, in the street. She will gradually leave her naive and egocentric world to get interested in the people who surround her and to strike up friendships with several people. In a way, the director tries to communicate us a nearly identical message to the one in \"Groundhog Day\" (1993): you have to open yourselves to others which enables to see the world under another (and better) angle. Then, I previously mentioned Klapisch's features. I won't linger on them. I will just say that two of them shine. The director knows how to associate an ironic and tender look in the portrait of his characters and he seems very close to them. In another hand, he just has to proceed by little touches to make a situation intense (I think of the moment when Chloé meets Michel's latest lover). But if there's a more admirable thing in Klapisch's opus, it's the directing of actors. Each one of them is perfectly used. Garence Clavel is a real revelation whereas some of her partners see their talent evolving (Zinedine Soualem and Romain Duris, two actors from Klapisch's gang). And this dear Mrs Renée! Very far from the commonplaces and stereotypes commonly attributed to old people, she's also the opposite of Etienne Chatiliez's \"tatie Danielle\". The director also grants a great attention to the non-professional actors, even to those who have a minor role. Most of them appear for a few minutes on the screen but their presences remain in the memories. Moreover, the solidarity which strongly links its inhabitants (no matter their age) clashes with the place of the action and the dramatic changes which occur in it: a dying popular neighborhood. We can often see in the film, shots of buildings razed or half razed to the ground. \"Chacun cherche son chat\" is beneficial cinema like we would like to watch it more often and this one, \"Le péril jeune\" (1994), \"un air de famille\" and \"l'auberge Espagnole\" can secure Klapisch's place in the limited circle of the greatest French film-makers of these last years. And by the way, thank you Mr Klapisch for making movies that make me happy.",
         "A peculiar depiction of Paris. The more ambiguous, the more interesting. No Eiffel Tower, No 'Musée Du Louvre', no 'lost in translation' tourists. Just life, life at its fullest. In a controversial neighbourhood of the 20th 'arrondissement' there is more to life than commercial Paris. Life lies here in graffiti, in demolition of buildings, in bars, in the inevitable gossip. Chloé is our vehicle of discovering that exploring life leads to identity. The camera follows her around and illustrates the most banal daily routines. The film doesn't need special effects to captivate you; it replaces them with people dealing with absurdly normal situations. From recurring scenes of amnesic old ladies being brought back by the police to characters running after cats on the roof of a building, Cédric Klapisch transforms the trivial into something exciting. All characters are expected to develop their identity and reach a common ground with the society and with themselves. Just as lost things are frequently lying in front of us, their search is ephemeral."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Vertigo Productions",
         "France 2 Cinéma",
         "Canal+"
      ],
      "summaries": ["Chloe, a young woman, is going on holidays. She entrusts her beloved cat to Madame Renée's care. But one day Madame Renée (an old lady of the neighborhood) can not find the cat. Chloe starts searching the neighborhood... This is the pretext for the exploration of a quarter of Paris and his inhabitants."],
      "budget": 300000
   },
   "movielensId": 1571,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-04-03",
      "dvdReleaseDate": null,
      "directors": ["Cédric Klapisch"],
      "runtime": 91,
      "movieId": 1571,
      "title": "When the Cat's Away",
      "mpaa": null,
      "actors": [
         "Garance Clavel",
         "Zinedine Soualem",
         "Renée Le Calm",
         "Olivier Py",
         "Simon Abkarian",
         "Marilyne Canto",
         "Antoine Chappey",
         "Romain Duris",
         "Hélène de Fougerolles",
         "Eric Savin"
      ],
      "imdbMovieId": "0115856",
      "originalTitle": "Chacun Cherche Son Chat",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["F95VjML_PHI"],
      "plotSummary": "When Chloe (Garance Clavel), a young Parisian, decides to take a long-overdue vacation, she has to find someone to look after Gris-Gris, her beloved cat. Everyone, including her gay male roommate, refuses to help her, but she finally makes an arrangement with the elderly Madame Renée (Renée Le Calm), who often watches over other peoples' cats and dogs. However, when Chloe comes back, Madame Renée tells her that unfortunately the cat has been lost, and the unlucky owner goes on a search for her dear animal friend. While looking for the cat, she meets many colorful characters who populate the neighborhood.",
      "tmdbMovieId": 11956,
      "avgRating": 3.63825,
      "releaseYear": "1996",
      "numRatings": 481,
      "posterPath": "/qr4oDABJRkbEXIfriuvGATR6lmy.jpg"
   }
}