{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "capri",
            "id": 883
         },
         {
            "name": "cinecittà",
            "id": 884
         },
         {
            "name": "villa",
            "id": 885
         },
         {
            "name": "movie business",
            "id": 886
         },
         {
            "name": "screenwriter",
            "id": 888
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "car crash",
            "id": 9844
         },
         {
            "name": "divorce",
            "id": 15160
         }
      ],
      "imdb_id": "tt0057345",
      "video": false,
      "title": "Contempt",
      "recommendations": [
         2786,
         269,
         20108,
         1818,
         4024,
         1628,
         649,
         8073,
         5544,
         15244,
         5165,
         8072,
         1626,
         307,
         2457,
         10227,
         41050,
         777,
         29845,
         776
      ],
      "backdrop_path": "/jC3JTnd8Vb6EkRGtfTxafPleFHM.jpg",
      "revenue": 528428,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Camille Javal",
               "gender": 1,
               "credit_id": "52fe422fc3a36847f800a8c5",
               "name": "Brigitte Bardot",
               "profile_path": "/3zQZJKE1TBXEi1khQlLI321KhHX.jpg",
               "id": 3783,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Paul Javal",
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8c9",
               "name": "Michel Piccoli",
               "profile_path": "/gz91b4tVn6yYsKemek2YkUdjlSH.jpg",
               "id": 3784,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Jeremy Prokosch",
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8cd",
               "name": "Jack Palance",
               "profile_path": "/vVQxDsA4FVDRZm6Pm3ohjmuJFxh.jpg",
               "id": 3785,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Francesca Vanini",
               "gender": 1,
               "credit_id": "52fe422fc3a36847f800a8d1",
               "name": "Giorgia Moll",
               "profile_path": "/qSL8iXqDzquKxEzewhLK207L9yQ.jpg",
               "id": 3786,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Fritz Lang",
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8d5",
               "name": "Fritz Lang",
               "profile_path": "/fQAlhdBDnUYXzkezvyzjLB72pvw.jpg",
               "id": 68,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Cameraman",
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a8d9",
               "name": "Raoul Coutard",
               "profile_path": "/xfAtBAME3A4vb4uXkWAjtsasRBZ.jpg",
               "id": 3540,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Langs Assistant Director",
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8dd",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Sirene",
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a8e1",
               "name": "Linda Veras",
               "profile_path": "/ldCxTFpz5z7LfNOhyjm2pLBS0c5.jpg",
               "id": 3787,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a891",
               "name": "Joseph E. Levine",
               "profile_path": null,
               "id": 3777,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a897",
               "name": "Carlo Ponti",
               "profile_path": "/zgCkHXt5HdXjaiIk8kOcZyQJlZh.jpg",
               "id": 3778,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a89d",
               "name": "Georges de Beauregard",
               "profile_path": null,
               "id": 3779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8a3",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8a9",
               "name": "Alberto Moravia",
               "profile_path": "/eEDRQhp7A6J4AMJUIlJcxLOVg1g.jpg",
               "id": 3780,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a8af",
               "name": "Raoul Coutard",
               "profile_path": "/xfAtBAME3A4vb4uXkWAjtsasRBZ.jpg",
               "id": 3540,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8b5",
               "name": "Georges Delerue",
               "profile_path": "/yAlgcnY7fXUQLrxfknp0Jv4dUTv.jpg",
               "id": 3535,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a8bb",
               "name": "Agnès Guillemot",
               "profile_path": null,
               "id": 3526,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a8c1",
               "name": "Lila Lakshmanan",
               "profile_path": null,
               "id": 3782,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a8e7",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 7.505836,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 266,
      "vote_count": 171,
      "budget": 900000,
      "overview": "A philistine in the art film business, Jeremy Prokosch is a producer unhappy with the work of his director. Prokosch has hired Fritz Lang (as himself) to direct an adaptation of \"The Odyssey,\" but when it seems that the legendary filmmaker is making a picture destined to bomb at the box office, he brings in a screenwriter to energize the script. The professional intersects with the personal when a rift develops between the writer and his wife.",
      "similar": [
         27066,
         283227,
         713,
         638,
         1586,
         116,
         28468,
         599,
         1213,
         14,
         1903,
         38167,
         843,
         422,
         24016,
         294016,
         21484,
         36630,
         1628,
         451
      ],
      "original_title": "Le Mépris",
      "runtime": 103,
      "poster_path": "/7FixOtdobAFBAOFlglLzTMNe1zU.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rome Paris Films",
            "id": 109,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Concordia",
            "id": 1714,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Compagnia Cinematografica Champion",
            "id": 10000,
            "origin_country": ""
         }
      ],
      "release_date": "1963-10-21",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "More Bold! More Brazen! And Much, Much More Bardot!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jean-Luc Godard"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Alberto Moravia"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0057345/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA3MjY5MjQ5ODleQTJeQWpwZ15BbWU4MDU4NjQ5NDIx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Brigitte Bardot, Jack Palance, Michel Piccoli | See full cast and crew »"],
      "reviews": [
         "*Contempt* is a case study in Making The Most Of It. In 1963, Jean-Luc Godard was permitted a big budget financed by an international production, the use of a CinemaScope camera, Technicolor, a pair of icons (Brigitte Bardot and Fritz Lang as himself) to star in the film, and almost total creative autonomy. No auteur -- with the possible exception of Coppola in the Seventies -- was granted this power again. Godard doubtless realized that this would be a one-shot affair, and thus he directs every inch of *Contempt*. He may permit the actors to improvise, but their improvisations are constrained within a tight circle of elaborate choreography. And he denies himself his usual for-the-fun-of-it non-sequiturs: any New Wave mannerisms (and there are few, especially when compared to something like *Band of Outsiders*) are made to serve the various lines of meta-fictive commentary, philosophical inquiry, and more traditional narrative and character development within the film. One wishes that Godard had been forced to do \"commercial\" work like *Contempt* throughout his career. Big money appears to have disciplined him; to have honed his vision. This New Wave epic clocks in at a mere 104 minutes, making that other 1963 film about film-making, *8 1/2*, seem almost sloppy and bloated by comparison. What's it about, anyway? Fritz Lang, as \"Fritz Lang\", is directing an adaptation of \"The Odyssey\" at Cinecitta Studios. Hovering over him is the fascistic American producer Prokosch (played with manic bewilderment by Jack Palance). Prokosch is unhappy, because Lang has deviated from the script that has turned Odysseus into a modern neurotic-type who is no longer loved by his wife Penelope. The famous director insists on the traditional view of the epic, and then irritates the producer even more by filming it in an over-stylized manner. Prokosch, realizing that this sort of thing will not put butts in the seats, hires a modern neurotic-type (Michel Piccoli as \"Paul\") to rewrite the screenplay. Paul, meanwhile, is having problems with his own wife, Camille (Bardot). It's hard to pin down exactly why Camille has taken a contemptuous attitude towards her husband, though the most likely reason is that he has harbored no small measure of contempt for her all along. \"I can't believe I married a typist!\" is one of his typical exclamations. Or perhaps she despises him because he sells out to Prokosch and then whines about it. This bourgeois screenwriter, who says he needs the *Odyssey* money to pay off their flat in Rome, is also a card-carrying member of the Italian Communist Party. (And he's contemptuous of her typist job?!) He's the sort of poseur that would drive any woman batty: the perfect modern anti-hero, in other words. Prokosch's ideal Odysseus. The centerpiece of the movie is the 30-minute scene in the married couple's flat. It's the most sustained, minutely choreographed, rigorously blocked and written stretch in Godard's career. A similar, though much lighter, scene with Belmondo and Seberg in *Breathless* served as a mere warm-up for the display of petty acrimony in *Contempt*. A marriage dissolves before our eyes. Meanwhile, DP Raoul Coutard, doing some of the most brilliant work of his career, pokes unobtrusively around the couple, getting cozy with them in the bathroom while one of them sits on a toilet, shooting them from far across the room, catching Bardot and Piccoli at the extreme edges of the CinemaScope frame, slowly tracking the space between them as they murmur their little hatreds. But never getting too close: if Bardot slams the door on Piccoli, we're left stranded with Piccoli, and from a distance, too. It's intimacy without melodrama. *Contempt* is chock-full of the multiplicity of ideas -- seamlessly reinforced by imagery and dialog -- that make cinephiles love Godard. I've barely scratched the surface and have already run out of space. But I do want to commend Godard on his courage for daring to acknowledge head-on his admiration of Michelangelo Antonioni's *L'Avventura*. Of course, it goes without saying that Godard can't help mocking Antonioni just a bit; but mocking and paying homage are inextricable within the Godard canon. In any case, today's audience may appreciate the economy with which the French director makes his points (*Contempt* is almost an hour shorter than *L'Avventura*), as well as the arguable pictorial superiority of this film to the other one. The scenes on Capri, at the famous Malaparte villa with its wedge-shaped stairs that lead to a barren deck, surrounded by crags that rise like jewels from the calm sea, are some of the most beautiful ever shot. If this was indeed Raoul Coutard's first work with the CinemaScope lens, one can only marvel at his precocious genius. 10 stars out of 10 -- one of the great art-works of the 20th century.",
         "Bardot's magnificent performance as Camille Javal [she was so good that her character's name was later believed to be her real name!], wife of the aspiring screenwriter Paul (nicely played by a young Michel Piccoli) merely confirmed what Clouzot's \"La Verite\" (1960) had already established, viz., that B.B. was a highly talented actress and not merely a lovely sex kitten pimped by ex-husband Vadim to titillate the fantasies of horny international audiences. \"le Mepris\" (\"Contempt\") is a jewel cut by France's leading \"Nouvelle Vague\" director Jean-Luc Godard, and intended (says his outstanding cinematographer Raoul Coutard) as an apologetic testimonial to Godard's estranged wife Anna Karina. This is a film about film-making in the 1960's, and about the stresses on personal relationships provoked by the pursuit of cinema's world of illusion.[the presence of the great Fritz Lang playing himself authenticates the theme]. Paul Javal (his constant wearing of a hat is the clue to his partial representation of Godard) is a man whose artistic sensibility and individuality have yet to be shaped, and who uses Camille as an instrument to achieve self-identity. But Camille is a goddess, a force of nature, and her total love for Paul slowly disintegrates in the course of the creative \"mind games\" he selfishly makes her endure. (One such is the marvelously erotic opening scene with the softly voices enumerations of her physical assets by a nude Camille: that this is a \"game\" is shown by her query to \"director\" Paul whether she should rise on her knees to continue...There are many such indicators throughout the film. See for instance Camille's fleeting smile ar Paul in Prokosch's garden at minute 26:28.)As the story unfolds, pretended reality is remorselessly transformed into \"real\" reality, and Camille's staged contempt into an actual rejection of a husband who is revealed to be a spineless wimp (\"You are not a man\" at minute 1:35:19). The accompanying change of Camille's initial dislike of the energetic and crassly domineering producer Jeremy Prokosch (Jack Palance)into a recognition that this equally potent \"god\" and force of nature is perhaps worthier of her attention than her hapless husband is also delicately presented by Godard (There is a fascinating scene near the very end where Prokosch shows how his personality is being positively changed by his attraction to Camille, and how he yearns to acquire a gentler image to please her.) But the film is a tragedy on more than one level, and a fatal accident in which both Prokosch and Camille lose their lives prevents any resolution or even development. This is a profound film which needs to be viewed many times, with increasing understanding and appreciation of its complexities. The photography is stunning (esp. the Capri shots), and the wonderfully haunting score by Georges Delerue only increases our viewing pleasure.",
         "Strangely enough, director Jean-Luc Godard understood Bardot's capabilities best, and with \"Le Mépris,\" he succeeded where Malle had failed\u0085 Because the movie reflected Bardot's new life, the viewer was shown the woman, the actress, the public image, and the private life\u0085 \"B.B.\" was dead; Brigitte Bardot was alive and well\u0085 Of all the movies about movies \"Le Mépris\" may be the most penetrating, the most alienated and least entertaining... Not many people have seen \"Le Mépris,\" but of those who have many despise it greatly\u0085 \"Le Mépris\" is one of the few films that actually encourages its audiences to walk out\u0085 Aside from the fact that it has something important to say and says it interestingly, \"Le Mépris\" is a nadir of entertainment, and for this reason, and because it is one of the most alienated and alienating films ever made, one can choose to call it great too\u0085 In his film debut, Michel Piccoli (Paul Juval) is a failed playwright who wants to write for the stage, but his sexy wife, Camille (Brigitte Bardot), requests a middle-class style of life... Paul has used his savings to buy her an apartment in a stylish building in Rome and is now financially enslaved... The American film producer and tycoon, Jeremy Prokosch (Jack Palance), has offered him a job as screenwriter of 'The Odyssey,' to be directed by then veteran German-American filmmaker Fritz Lang (played by Fritz Lang!). Paul sells out, signs the contract with Prokosch and earns the never ending contempt of his wife, who drifts into a liaison with Jerry\u0097not so clear anyway... Obviously, Prokosch is the Great Vulgarian Producer\u0085 He wants Lang to direct 'The Odyssey' because \"a German, Schliemann, discovered Troy.\" Prokosch buys and sells mens' souls... He rushes around the film studio in a flashy red sports car, and reads stupid and pretentious maxims from a red book he carries in his breast pocket\u0085 The story of the dissolution of the Javals' marriage and Camille's contempt for Paul is entwined with the legend of Ulysses, and also with a sort of documentary look at what it's like to make a movie: the compromises, the idiocy, the boredom, and the fatigue\u0085 There are references to film and film-making throughout the motion picture: posters on walls for Howard Hawks' \"Hatari\" and Hitchcock's \"Psycho,\" brief looks at the inside of a movie studio, and the goings-on in a screening room\u0085 But perhaps the most interesting and mystical element in this film are its first and final shots\u0085 On Godard's instructions we are compelled to point inwards, to submit, to think, and to contemplate... Godard seems to suggest that the provocative statement of \"Le Mépris\" which is sombre, beautiful and rich, is in reality a short interesting anecdote about us all...",
         "Here are what Contempt, by French director Jean-Luc Godard, made in 1963, is about--an examination on a relationship in jeopardy, which has been one of the most universal themes in cinema, and which is probably inspired by Michelangelo Antonioni's trilogy; a struggle in film-making as a side-theme, which may be Godard's self-reflective expression; the international star cast including Brigitte Bardot, Michel Piccoli, and Jack Palance, along with the cameo appearance of legendary German filmmaker Fritz Lang; well-choreographed long takes, which are sometimes several minutes in length, and which could be also influenced by Antonioni; inclusion of three montage sequences that comprise sliced flashback and flashforward clips, which create a remarkable contrast to the long takes; beautifully photographed sceneries, especially of the sea; and the memorable orchestral score with sentimental arpeggio by Georges Delerue. Being both unique and universal, and being perfectly executed, Contempt is arguably Godard's best film, and undoubtedly one of the best works in cinema.",
         "Paul (Picoli) is hired by vulgarian US producer Jerry Prokosh (Palance) to rewrite a screenplay for his adaptation, which Fritz Lang (himself) insists on shooting in a hyper-stylized, mythological fashion. Paul's relationship with his trophy wife Camille disintegrates as she feels abandoned by him to Prokosh's advances, and sees him subdue himself to these great men. It is about film-making - of course! - it is about the plight of the artist, but where it succeeds most is in the carefully examined slow destruction of Camille and Paul's marriage. Raoul Coutard's cinemascope photography, filled with lush colors, only serves to highlight how little Paul is and how out of his depth he is. He and his wife hide it in different manners: Paul by trying to assert intellectual superiority over his wiser-than-she-appears wife, therefor earning her contempt. She hides by relying on her sensuality. Godard typically references his love for film in a way that many will find pedantic, and the lush score isn't always wisely used, overwhelming and sometimes even obtrusive. But thankfully, Godard's message and cast survive the director's pseudo-intellectual short-comings. Bardot is perfectly cast as the ignorant innocent who strives to appear and be smarter than she is (even sporting a brunette whig at some point, in what is really a sad moment of self-loathing), but fails. Camille never convinces when she speaks, but the pain in those eyes is intensely real. Picoli's Paul is easier to sympathize with, as the \"reasonable\" whose every move to please anyone dooms him further. It is a cruel lesson and warning about relationships. The film also serves a more sarcastic and amusing (and far more conscious) duel between Palance's Prokosh, superbly vulgar and dramatic, and Lang, who becomes a wise and immensely charismatic figure that stands against compromise. It is sad that this was the German master's only performance in front of the camera. Le Mépris is slow, and if you get caught too much in Goddard's referencing and hyper-stylization, it will bore you. But if you really follow these characters, you're in for a unique, edifying and sometimes unnervingly uncomfortable ride. Must be seen several times under different angles to be fully appreciated.",
         "With Le Mepris (1963), French filmmaker Jean Luc Godard strings together at least three different narrative strands, each of which are in some way connected to the central story of a couple falling out of love, and all further set against an additional thematic backdrop of film-making and ancient Greek mythology. With this technique, Godard is clearly attempting to not only present us with a vicious satire on the business of movie-making, but also attempting to deconstruct the very notion of film-making by contrasting the soulless and mechanical approach to studio production, with the trials and tribulations of a torturous love affair. As with the vast majority of Godard's work - particularly of this era - Le Mepris is very much a work in the meta-film tradition; in the sense that it is a film about film-making that is constantly reminding the audience of its own artificiality and manufactured design. This ideology is evident right from the start, as Godard begins the film with a lengthy tracking shot, which finds the camera following in front of a camera actually within the film and also in the middle of a similarly complicated tracking shot. To add further ideas of self-reflexivity to the proceedings, Godard appears himself as the film's assistant director, with his cinematographer Raoul Coutard manning the equipment. As the shot progresses, a cold and emotionless voice-over beings narrating the opening credits - though no text appears on screen - whilst the camera continues tracking towards us, edging closer to us until both camera and audience are starring directly into one other and the endless abyss that they represent. It's pure Brechtian deconstruction, years before Godard would refine the influence of Brecht with the difficult masterpiece Week End (1967), which shares some elements familiar from Le Mepris, in particular the use of the couple as a metaphorical reference point for some kind of greater ideology and a natural continuation of many of the film-making techniques that Godard had been developing since A Woman Is A Woman (1961). This brings us to the story at hand, with Le Mepris focusing on a jaded scriptwriter (Michel Piccoli) setting out to polish the screenplay for Fritz Lang's big budget adaptation of Homer's epic, The Odyssey. From this set up we are introduced to the writer's beautiful and enchanting girlfriend (Brigitte Bardot), the arrogant U.S. film producer (Jack Palance), and the great man himself, Fritz Lang. Each of these four characters will be involved in their own separate strand of the narrative that will run concurrently alongside the other characters, whilst in turn, laying reference points to the likes of Ulysses, The Odyssey, Fellini and The Rite of Spring, to create the overall foundation of the film itself. This is only the first quarter of the film and already Godard is churning out exciting idea after exciting idea to smash apart the worn clichés and generally accepted limitations of film in a way that is as startling, boring, joyous and confusing as anything else he has directed. The visual design is just splendid, with Godard and Coutard moving further away from the Nouvelle Vague/Cinéma-vérité influences of their earliest work and incorporating beautifully vivid primary colours, the use of cinema-scope, complex and seemingly random tracking shots and camera movements and sporadic bursts of music to disarm the viewer during moments of dialog. The centrepiece here is the near-infamous twenty-minute long sequence that takes place between the writer and his girlfriend in their vast, open-plan apartment, in which jealousies, bitterness and petty arguments blow up and cool off amidst a series of seemingly mundane, everyday-like activities. What makes the scene work is Godard's far from invisible directorial intent, as he attempts to excite, bore and eventually move the audience into becoming interested in these complicated and far from conventional characters whilst simultaneously using the set up to offer a skillful deconstruction of his own film's narrative, the narrative of Homer's Odyssey, and the film that Lang is making. This ties into the further film-within-a-film-within-a-film (infinity) abstractions, with Godard continually making allusions to the idea that the film we are watching could easily be a film being made. The film also works in a circular sense, opening with that aforementioned scene in which Godard points the barrel of the lens directly into the audience whilst narrating his own credits, whilst the final shots shows the camera drifting off towards the sunset as Godard yells \"cut\". With Le Mepris, Godard clearly struck the right balance of cinematic invention; beautiful photography, use of colour, costumes and music, a recreation of Cinecittà as a pastoral ghost town (a comment on film-making in itself), etc, whilst achieving a subtle symbiosis between his characters, his narrative and his philosophical subtext. For me, this is perhaps the strongest 'narrative' film the director ever made before abandoning generic storytelling and instead striving for greater artistic substance. I suppose in this day and age it is easy to look back on Godard's once radical use of cinematic experimentation - and his genuine desire to challenge the medium of film far beyond the usual presentation of conventions like character and narrative - and see it as something that is hollow and dated; a pseudo-intellectual exercise in cinematic deconstruction that is there to be endured, as opposed to enjoyed. Though this may still be true for some viewers - particularly those at odds with Godard's personal style and the very 60's idea that art could be entertainment and that anything was possible - there will be other viewers who are far more in tune with the notion of cinema for cinema's sake, and can better appreciate the film for what it truly is.",
         "The whole movie can be captured in one moment. That one fleeting second when the absurd irony and futility of 'everything' will dawn upon you. Either that or you will merely take it for what it is. A masterpiece. So obviously chained by the wrath of Gods, the movie on the whole has too much to offer. Whether it is the parallels between the existing world and the world of homer, the constant struggle with commercialism or the perusal of a writer's integrity... you will keep on jumping between realism and.... romanticism? Throughout the movie, a haunting melancholic theme continues to play magic on nerves. Amongst countless striking scenes lies a splendidly performed sequence made on a shoestring budget in the apartment that captures the unsettling confessions of the pair. Definitely worth seeing/experiencing! As much as you will fall under the spell of Godard and feel for the likes of Lang, you can't help being amused by the almost comical character of Palance. Very comical, Very contemptuous. But at the end its Lang that captures attention on the whole. A lone figure standing amidst harmonious chaos, staring silently at everyone and no one, while life effortlessly moves around him. He makes perfect sense. Contempt. The whole thing takes place within a system that seems to be contemptuous of itself. So much so that it even ends up holding a mocking mirror, capturing an ultimate contempt for the audience.",
         "One of the great masterpieces of the 20th century, a supreme synthesis of form, content and performance. Arguably the most beautiful too, with its found locations, sets, colour, lighting, music, decor and costume. The straightforward elegance of Godard's shooting masks a story of great complexity and formal rupture, but underneath the philosophy, semiotics and allusion is a portrait of marriage and its decline. The tension between icy irony and resigned emotion results in Godard's most perversely moving film. It is also very funny, which is too little remembered.",
         "Most cinephiles, faced with a choice between an original language, subtitled film, and a dubbed version, will choose the former. But what if it is a multilingual film, released in different versions? Would you be tempted to choose the version of your own language? Such a choice with Le Mépris (Contempt) yields a radically different experience, well beyond the mere question of subtitles. The story tells of the making of a movie in Italy with an American producer, an Austrian director, plus a script doctor and his beautiful wife. The French version is multilingual. Whereas the English-American and Italian versions are entirely dubbed. Crucially, in the English-American version, the producer seems to be followed about by a quirky assistant who paraphrases the somewhat vainglorious proclamations of her boss for the benefit of other mere mortals. Only in the French version, is it apparent she is an interpreter. This is important, as one of the themes of Le Mépris is the breakdown of communication. Not only are the producer and director at odds with each other, but the marital breakdown of the script doctor and his wife (played by Michel Piccoli and the glamorous Brigitte Bardot) is placed under the microscope. Three further parallels are neatly woven into our story. One is the tale of Ulysses separated from his wife Penelope, in which he is protected by Minerva but threatened by Neptune (Homer's Odyssey is the subject of the film-within-a-film). Second is an examination of the gap between cinema-for-profit and cinema-as-art, partly mirrored in the Le Mépris' actual production as well as in its subject matter. And third are autobiographical references to Godard's personal life \u0096 both his love life and his life as a filmmaker. Whereas the French version of the movie raises serious questions about the film industry, about the relationship between man and the gods, and even explores some of the more challenging questions about love, life and Homer's work; in the English-American version these things become like added confectionery, arty flourishes for more passive audiences. Or for whom the challenge of discovering cinematic jokes within references to Rio Bravo and works by Fritz Lang (who plays himself as a director) become an intellectual conceit. Brigitte Bardot here finds at once both a self-consciously iconic and a substantial acting role. On the one hand, her acting talents are utilised to greater effect than in many of her films. On the other, long (soft-core) nude scenes are both complicit in, and critical of, her sex-goddess status. The opening scene, where she teasingly asks her husband which part of her body he finds most attractive, was added at the insistence of the film's American co-producers. Yet its mocking style is almost a lampoon of the use of sex to sell big budget U.S. films. The film-within-a-film's American producer, Jeremy Prokosch (played by Jack Palance), is visibly more enthusiastic about scenes involving nakedness than any faithfulness to the spirit of Homer. Director Fritz Lang, in contrast, goes to great length to examine the essence of the Odyssey, using Dante's Inferno and a poem by Friedrich Holderlin. The gods are created by men, not vice versa, and create the challenges Odysseus is forced to face. It is an easy step to observe how the American producer, throwing his weight around in 'godlike' fashion, both misses this point and actually identifies with the lesser 'gods' of sex and wealth. These gods \u0096 in the form of a much-needed cheque for Piccoli's character and the dangling of Bardot's allures before Prokosch, threaten both the marriage and the integrity of the film-within-a-film. Contempt breeds among the characters and begets tragedy. Piccoli also has a great line about exploitation: \"Usually, when you see women, they're dressed. But put them in a movie, and you see their backsides.\" As if to underline the point, Prokosch casually has his assistant bend over so he can use her (clothed) backside as a table to sign a cheque. His imperious and lecherous attitude dovetails the 'Americanised' scenes that show naked women's backsides without explicitness. They contrast strongly against the clothed Bardot who is portrayed as an intelligent woman able to hold her own. This film is one of the most rounded of any of Godard's work and can easily be viewed as 'mainstream' \u0096 the more philosophical riddles being purely optional. And if Godard is displaying contempt for the prostituting of cinematic art to big business \u0096 principally American big studios \u0096 the style is still reverential towards his American heroes: Le Mépris has been accurately described as, \"Hawks and Hitchcock shot in the manner of Antonioni.\" Godard, like Ulysses and Piccoli's character, has both engaged with the enemy - American producer Joseph E Levine (Neptune, Prokosch) and prevailed. He has not 'sold-out' to big finance but, like Ulysses on coming home, merely disguised himself as a beggar to better elicit the truth. 'Minerval' wisdom shines through (especially from the mouth of his hero-in-exile, Fritz Lang, with lines that reflect Godard's philosophy). When Bardot's character Camille wears a black wig, she resembles Godard's wife Anna Karina. Her story, subjected to unwanted attentions while her husband is absent, parallels Penelope. By many sleights of hand, Godard continues to 'explore the uninhabited world' and simultaneously produce a film for many different audiences. Le Mépris is very clever and enjoyable to watch, but does it have anything new to say? Or is it an exquisite exercise in admiring its own limitations? The films strengths are less obvious than the overtly cinematic and revolutionary Breathless, or the philosophically challenging 2 or 3 Things I Know About Her. It has as much depth as you wish to find in it, and is more convincing than his disjointed political diatribes. But, unlike all those films, it can also be overlooked as little more than a pleasant experience. Especially by anyone who thinks it would be simpler if we all spoke the same language. Subtitles or not.",
         "Fritz Lang, playing himself, is set to direct a more commercial adaptation of Homer's \"Odyssey\". Jeremy Prokosch (Jack Palance), the producer, despises art films and hires screenwriter Paul Javal (Michel Piccoli) to help Lang commercialize the movie. Javal 'offers' his young wife, Camille (Brigitte Bardot, sexier than ever, in one of her few serious roles), to Prokosch, thinking he'll get a better payment. But he didn't know that would sparkle Camille's contempt and ruin their marriage. \"Le Mépris\" aka \"Contempt\" is Godard's existentialist, provocative essay of the relationships between artistic and commercial cinema, man and woman/husband and wife (he was married to his then-muse Anna Karina, with whom he made some of his best films; after their divorce in 1967, he married Anne Wiazemsky, with whom he made \"La Chinoise\", \"Week End\" and others). Gorgeously photographed by Raoul Coutard and scored by the master Georges Delerue, and with some \"influences\" of Antonioni's trilogy (L'Avventura, La Notte and L'Eclisse), \"Le Mépris\" is not my favourite Godard, but it's certainly a vigorous film. 9/10."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Les Films Concordia",
         "Rome Paris Films",
         "Compagnia Cinematografica Champion"
      ],
      "summaries": [
         "Paul Javal is a writer who is hired to make a script for a new movie about Ulysses more commercial, which is to be directed by Fritz Lang and produced by Jeremy Prokosch. But because he let his wife Camille drive with Prokosch and he is late, she believes, he uses her as a sort of present for Prokosch to get get a better payment. So the relationship ends.",
         "Not satisfied with the script for his new movie, producer Jeremy Prokosch hires screenwriter Paul Javal to write a new one. Javal seems oblivious to Prokosch's obvious interest in Javal's pretty wife Camille. As Javal becomes ever more engrossed in writing the screenplay, Camille comes to resent him, thinking her husband is pushing her into the producer's arms for his own benefit. When they finally talk about it he flatly denies having done any such thing but for Camille, their relationship is irreparably damaged.",
         "On Capri, an Italian crew makes a German film of Homer's \"Odyssey\"; Fritz Lang directs with American money. Jeremy Prokosch, the producer, with his sneer and his red Alfa Romeo, holds art films in contempt and hires writer Javal to help Lang commercialize the picture. Against this backdrop, we watch the breakup of Javal's marriage to Camille, a young former typist. It opens with the couple talking in bed, she asking for assurance that he finds her attractive. Later that day, he introduces her to Prokosch and, unawares, blunders unforgivably. The rest of the film portrays her, in their apartment and in public, expressing her hurt and change of heart and his slow grasp of the source of her contempt.",
         "In Italy, the writer Paul Javal is hired for US$ 10,000.00 by the arrogant American producer Jeremy Prokosch to rewrite the screenplay of a commercial version of Ulysses and his Odyssey to be directed by Fritz Lang. Paul intends to use the money to quit the payments of the modern apartment where he lives with his wife and former typist Camille Javal. When Jeremy invites Camille and Paul to have a drink with him in his cottage, Paul asks Camille to go alone with Jeremy in his red Alfa Romeo, while he would go by taxi. He arrives later and finds Camille upset; his ambitious act destroys their marriage.",
         "Screenwriter Paul Javal's marriage to his wife Camille disintegrates during movie production as she spends time with the producer. Layered conflicts between art and business ensue."
      ],
      "budget": 900000
   },
   "movielensId": 1572,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch",
         "Italiano"
      ],
      "releaseDate": "1963-10-21",
      "dvdReleaseDate": "2002-12-10",
      "directors": ["Jean-Luc Godard"],
      "runtime": 103,
      "movieId": 1572,
      "title": "Contempt",
      "mpaa": "NR",
      "actors": [
         "Brigitte Bardot",
         "Michel Piccoli",
         "Jack Palance",
         "Giorgia Moll",
         "Fritz Lang",
         "Raoul Coutard",
         "Jean-Luc Godard",
         "Linda Veras"
      ],
      "imdbMovieId": "0057345",
      "originalTitle": "Le Mépris",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "2wjDWnKTROI",
         "rF0Ju0ONwGU"
      ],
      "plotSummary": "A philistine in the art film business, Jeremy Prokosch is a producer unhappy with the work of his director. Prokosch has hired Fritz Lang (as himself) to direct an adaptation of \"The Odyssey,\" but when it seems that the legendary filmmaker is making a picture destined to bomb at the box office, he brings in a screenwriter to energize the script. The professional intersects with the personal when a rift develops between the writer and his wife.",
      "tmdbMovieId": 266,
      "avgRating": 3.83178,
      "releaseYear": "1963",
      "numRatings": 749,
      "posterPath": "/7FixOtdobAFBAOFlglLzTMNe1zU.jpg"
   }
}