{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "poetry",
            "id": 496
         },
         {
            "name": "supermodel",
            "id": 4522
         },
         {
            "name": "cab driver",
            "id": 11290
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0119098",
      "video": false,
      "title": "Fall",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Robin",
               "gender": 1,
               "credit_id": "52fe46579251416c910514c3",
               "name": "Francie Swift",
               "profile_path": "/iEP2BCMely2ulBhxWeIYV1xIgqz.jpg",
               "id": 118043,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Scasse",
               "gender": 2,
               "credit_id": "52fe46579251416c910514c7",
               "name": "Jose Yenque",
               "profile_path": "/8jOcQHXmNFrQ0ZDrTzKG2IVylk0.jpg",
               "id": 118045,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Zsarko",
               "gender": 2,
               "credit_id": "52fe46579251416c910514cb",
               "name": "Josip Kuchan",
               "profile_path": null,
               "id": 118046,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Little Girl",
               "gender": 1,
               "credit_id": "52fe46579251416c910514cf",
               "name": "Scarlett Johansson",
               "profile_path": "/8EueDe6rPF0jQU4LSpsH2Rmrqac.jpg",
               "id": 1245,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sarah Easton",
               "gender": 1,
               "credit_id": "52fe46579251416c910514d3",
               "name": "Amanda de Cadenet",
               "profile_path": "/m6poxt6GFglku6yregZH7NxElET.jpg",
               "id": 3123,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Phillipe",
               "gender": 2,
               "credit_id": "52fe46579251416c910514d7",
               "name": "Rudolf Martin",
               "profile_path": "/bJcSgAxXhoZeCukahZwXF2szG2d.jpg",
               "id": 25848,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Joan Alterman",
               "gender": 1,
               "credit_id": "52fe46579251416c910514db",
               "name": "Roberta Maxwell",
               "profile_path": "/sq4LeTqg7q23RevHzM5bONXQ00h.jpg",
               "id": 10362,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Michael Shiver",
               "gender": 2,
               "credit_id": "52fe46579251416c910514df",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46579251416c910514e5",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46579251416c910514eb",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.905398,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37567,
      "vote_count": 6,
      "budget": 0,
      "overview": "For Michael Shiver, life as an easy-going cab driver in New York suddenly changes when he picks up supermodel Sarah Easton and falls head over heels in love. But Sarah has more than just passion on her mind; she also has a husband and a glamorous lifestyle that she can't seem to leave behind. Torn between her feelings for Michael and the security of her marriage, Sarah is forced to make a realistic decision about the sacrifices that must be made to be truly and totally in love.",
      "similar": [
         2251,
         843,
         27066,
         283227,
         634,
         207,
         284,
         244772,
         28468,
         255,
         1259,
         9716,
         24016,
         21484,
         859,
         37265,
         36630,
         6114,
         858,
         1907
      ],
      "original_title": "Fall",
      "runtime": 93,
      "poster_path": "/22qX6CExu5BfIZCiXYM2DSbSHng.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Terence Michael Productions",
         "id": 32218,
         "origin_country": ""
      }],
      "release_date": "1997-06-20",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "He's a cab driver, she's a supermodel.  What the hell?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Schaeffer"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Eric Schaeffer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119098/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzUwMjg1MjcyM15BMl5BanBnXkFtZTcwMTg5NjcyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Eric Schaeffer, Amanda De Cadenet, Rudolf Martin | See full cast and crew »"],
      "reviews": [
         "I'm really, really surprised this movie's IMDB rating isn't higher, but I guess it's a love-it-or-hate-it sort of thing. Notice how the most common rating for this movie is a 10, but the second-most common is a 1? Fall is absolutely phenomenal in its passion, telling a love story so intense it's a feat to capture on film, between a supermodel and a suspiciously well-cultured cab-driver. Eric Schaeffer is truly a poet, and the poetry of his characters AND of his direction and acting make this movie just as literate and philosophical as it is sexy and risque. This movie also has a bevy of brilliant and memorable lines. As for the film's thematic foundation, watch this movie if you believe in romance, in falling in love, in rushing in headfirst and never looking back, in giving your all to one pursuit or one person or one passion... in not insisting on being so awfully safe. The movie's pretty hardcore at times. You won't find a strap-on scene in too many romantic dramadies, granted. I can see where it would offend people (or, more to the point, scare them). At the same time, I personally count it as probably my favorite romance movie, ever. After you see this movie, DO NOT log onto IMDB and vote for it; not yet. This is a movie that grows, and grows, and grows on you, weeks and months after you see it for the first time. It's sneaky that way, and the more you let that viewing experience settle into your mind, the more it has its way with you. This is one of the few movies that can surprise you AFTER you've already seen it. This is, at least, the experience of the folks *I* know who've seen it.",
         "After reading all the comments on this board, I'm convinced that one's enjoyment (or lack of) is dependent upon their personal experiece with FALLing. If you fell in love as teen and think falling \"in love\" is just kid stuff, then don't waste your time. Your belief system in regard to love has been carved in stone and this movie will appear absolutely ridiculous. If you've ridden the fence most of your life, you may be amused by this trendy flick. And who knows, it may even encourage you to either take that leap or scare you off the fence once and for all! :) If you waited to FALL and did, then you will truly appreciate this well crafted, delightful, sexy, romantic, emotional button pusher. You'll know this movie and appreciate its deeply honest expression. And if you're like me, you'll fall in love with \"Fall\".",
         "I felt \"Fall\" was good enough to tape and see again, every once in a while.To those of you that say they laughed all the way through it, and it would never happen, U're nuts. It happens all the time. Personally, it's been the story of \"my\" life.It's a fact that women know in the first minute of meeting a guy if she would jump in bed with him.Many romances are a whirlwind...of lust and passion...and sometimes weeks of euphoric passion evaporate,before our eyes...until 2 travel a divided path back into their routine lives.. Many have lusty little secrets that go untapped .Even their best friends might not know. .This is not an uncommon union.It \"does\" happen in big city life...I don't know how some of your viewers see it as a laughing stock.It's not.And I pity them if they've never have had such a torrid love affair. It's an old Harry Chapin song...\"Taxi\" .It's very very soft core Andrew Blake...It's poetic,in it's own right. I liked it...and will watch it again.",
         "I've watched this film several times over the past 5 years. And, each time I find subtle nuances that speak to the sensibilities of life and love. Fall, embodies the peaks and valleys of love and expresses love's very definition. The viewer sees through Eric Schaeffer's eyes the choices that we make when participating in love and the consequences of our decisions. Clearly Michael (Eric's character) was aware that Sarah was married and she made it quite clear that she'd never leave her husband Phillipe. However, my goal here is not to summarize the movie, but rather discuss the alleged rape that some commenting on this site perceived. It is true that Sarah said no, on several occasions. And, when Michael obeyed Sarah and stopped, Sarah (while banging her pelvis against the refrigerator) says \"DON'T STOP\" and then \"COME ON!\". Michael effectively got into the mind of his intended lover and took hold. This film is sexy and wildly passionate. Though, I would agree with others, this film is not for everyone.",
         "A taxi cab driver and a supermodel? Sounds like a stupid romantic comedy. But if it's titled \"Fall\", it can't be too funny... so it gets a view, after a recommend. Boy, did I get more than I bargained for. Viewing 'Lolita' for the first time was a tragic experience for me. I never thought I'd see anything take me down harder. 'Fall' broke every bone in my body when it threw me down. A taxi cab driver and a supermodel? Completely unrealistic. Yet, this film came across as VERY convincing. We know this relationship can't and won't work, but that doesn't keep two people from becoming madly in love with each other. This film has THE BEST script of any movie to date. The performances were perfect. I felt like I was just watching two people who were truly in love. If you can handle the steep decline of 'Fall', then you simply can't miss this one. 10/10",
         "I worked on the cutting of this film back in the late 90's. My only awareness of Eric Schaefer up until then was from a failed sitcom on FOX and the film If Lucy Fell, in which his key love interests are Sarah Jessica Parker and ELLE McFRIKKIN-PHIERSON! So it wasn't a surprise to see him writing a scenario in which a seductive, poetry- writing, best-selling novelist of a cab driver picks up a fashion model and enjoys sodomy. What does surprise me is that so many people reviewing this movie seem like they are trying to get their words printed on the sleeve of the DVD release! I have never seen more extreme superlatives attributed to a less deserving filmmaker, with as many vague and obtuse explanations as a 4 year old describing seeing the circus for the first time! Maybe it would help if you Eric Schaefer schuper fans used a technique known as comparison, as in: this was the best movie in the world... since Bio-Dome! Or, Eric Schaefer is the best director in the world...compared to a moldy sock! Let's look over some quotes from some of the more adoringly positive reviews: *\"this film has THE BEST script of any movie to date.\" -here's an example of what I refer to as a slightly over zealous review. No need to use a comparison, because apparently there is none. *\"a powerful, majestic, romantic and ultimately profound work of art. THAT makes FALL my favorite movie of all time.\" -Seriously? How many movies has this person seen? 8? \"After you see this movie, DO NOT log onto IMDb and vote for it; not yet. This is a movie that grows, and grows, and grows on you, weeks and months after you see it for the first time. \" -Ok. This is my favorite. Clearly this person doesn't want you to review this movie on IMDb after you see it because you will more than likely find it laughably nauseating and therefore mock their emphatic devotion to this loose piece of stool. If you read some of the negative reviews, you'll find explanations that indicate a certain degree of insight, with explanations instead of aphorisms and critique of details instead of hyperbolic hype. Sure, you'll find people like me too, who just think the film stinks and wouldn't give up the time of day to tell you why.",
         "\"Fall\" tells the tale of a brief love affair between star-crossed lovers and unlikely bedfellows...a NYC cabbie (Schaeffer) and a super model (de Cadenet). Protagonist, writer, producer, and director, Schaeffer goes where few romantic writers have dared to go before as he spins his tale of impossible love from the initial casual attraction to the intensely sexual backlash of two lonely people to the reluctant search for a deeper and more profound meaning to the ultimate and necessary death of the relationship. \"Fall\" is a wonderful mix of reality and poetry which will maddeningly captivate realists and aggravate hopeless romantics. Kudos to Schaeffer for having the cajones to put this film out there for those few of us who delight in the real but bittersweetness of life. Footnote: Boxing fans will get some rare glimpses of Max Kellerman doing his public access show in New York (circa 1996) before joining ESPN.",
         "I don't really understand why this film hasn't done better--either on this site, with the public, or in the theatres. I've never seen Eric Shaeffer's studio films, but this indie was obviously made by someone with total artistic control over the piece, and it's all the better for it. Shaeffer avoids the usual traps of a writer/director/star--he's got talent in each of these areas, and isn't simply on an ego trip. It's a great film for anyone who likes to see a curiously mismatched, strangely well-matched couple meet each other on-screen. I wouldn't call it a romantic comedy, but I would call it extremely romantic (without being sentimental) and funny (in a nice, dry way). The connection and chemistry between Shaeffer and his co-star is evident from the first. I found the writing crisp, the storyline well planned and not predictable, and the character development deft. Among its many strong points is the perfect pacing of the piece, and the fact that the person in the film who is supposed to be such a good writer actually is. You understand why the writing read in the film (in voiceover) has the effect it does on the characters. If you can find it, rent it.",
         "I cried. And cried and cried. Some films simply remind you of relationships, others evoke emotional experiences (should you have any) for relationships gone south, some tease you with relationships that might have been. \"Fall\" incorporates all of these. First off, my primary recollection from the 3 or 4 times I've enjoyed watching \"Fall\" is the ending. Sarah is in Paris, exiting some chic place with Phillipe. Michael, who has flown to Paris in desperate need to re-connect with her, tracks her down (magically) and sees her exiting. He looks at her, she looks at him, she non-verbally gestures \"no, don't connect with me any more\"--- and he breaks down in sobs. As do I, even as I'm writing this. The longing for true love on his face\u0097the yearning for a love than can never be fully returned\u0097is one of the best, if not THE best, portrayal of unrequited love I have ever seen in any film. Bar none. Heart-breaking sobs. You, who berate this film for Eric Schaeffer's self-indulgence and egoism, must never have felt this type of unrequited love, and for you I feel sorry (or not\u0097I guess it's easier to be ignorant in love but wise in film criticism). For the rest of us, he struck a chord that is rarely approached in film. Forget the strap-on, dismiss the socioeconomic disconnect, don't fret over the boastfulness\u0097this film simply nailed that painful yearning for true love that some romantics still treasure. The dialog touches many of us as personally poignant but that \"film\" critics interpret as trite. I could wax eloquent about the cinematography\u0097especially one scene where Sarah is walking past a piece d'art depicting waves (get the metaphor, duh!) with an equivalently apt soundtrack\u0097but the arrogant, non-romantic film critics would dismiss this as being self-indulgent. You know, sometimes we need self-indulgence\u0097especially when it comes to relationships! Give me those scenes that touch my heart, expand my senses, and evoke my passion. If you want to be really TOUCHED by a film, see Fall. You won't be disappointed (unless you've taken Film Criticism 101, in which case cynicism trumps romanticism).",
         "58 percent of the people rating \"Fall\" gave it a 1 or a 10 -- do you know how few movies actually deserve either rating? Saying Amanda De Cadanet is \"butt-ugly\" is a ridiculous statement by someone trying to look smart through negative hyperbole. Saying this film has \"THE BEST script of any movie to date\" is equally ignorant. OK, so De Cadanet isn't the most beautiful woman in the world, but what are the odds the most beautiful woman in the world can act worth a flip and is available for an indie film? Yes, \"Fall\" overreaches. Yes, it could have used a less myopic editor. Parts of Schaeffer's poetry is stupid, but part of it is also beautiful. This is a flawed film, but one with ambition and a real heart that succeeds on a grander scale than it fails. It also has a world-class soundtrack -- or would, if one had ever been produced. Give the filmmakers and the IMDB community enough respect to make thoughtful comments instead of being an automaton who can only think something is great or terrible. I'll now descend my soap box. Thank you for your consideration. :-)"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Five Minutes Before the Miracle",
         "Terence Michael Productions"
      ],
      "summaries": [
         "Two people from completely different worlds meet by chance, thrown together as if by fate. Their attraction is immediately obvious and overwhelming. He is attracted to her beauty (she is a supermodel) and good humor; she is seduced by his charisma and honesty. With his gifts of poetry and tenderness, he opens her heart to the possibility of true love. But it takes a lot of courage to make a commitment. Is she truly in love with him? And even if she is, will she able to leave the cosmopolitan, superficial lifestyle to be with him?",
         "Cab driver Michael and supermodel Sarah fall in love while her gorgeous husband Phillippe is in Madrid for two months."
      ],
      "budget": 1000000
   },
   "movielensId": 1574,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-20",
      "dvdReleaseDate": "2005-01-25",
      "directors": ["Eric Schaeffer"],
      "runtime": 93,
      "movieId": 1574,
      "title": "Fall",
      "mpaa": "NR",
      "actors": [
         "Francie Swift",
         "Jose Yenque",
         "Josip Kuchan",
         "Scarlett Johansson",
         "Amanda de Cadenet",
         "Rudolf Martin",
         "Roberta Maxwell",
         "Eric Schaeffer"
      ],
      "imdbMovieId": "0119098",
      "originalTitle": "Fall",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["yAzOPTJpsoE"],
      "plotSummary": "Writer/director Eric Schaeffer (If Lucy Fell) and Amanda De Cadenet (Four Rooms) steam up the screen with this humorous, provocative and sexy tale of lust and desire that \"examines the surprisingly tender sides of erotic craving\" (MovieMaker). For Michael Shiver (Schaeffer), life as an easy-going cab driver in New York suddenly changes when he picks up supermodel Sarah Easton (De Cadenet) and falls head over heels in love. But Sarah has more than just passion on her mind ? she also has a husband and a glamorous lifestyle that she can't seem to leave behind. Torn between her feelings for Michael and the security of her marriage, Sarah is forced to make a realistic decision about the sacrifices that must be made to be truly and totally in love.",
      "tmdbMovieId": 37567,
      "avgRating": 3.1145,
      "releaseYear": "1997",
      "numRatings": 131,
      "posterPath": "/22qX6CExu5BfIZCiXYM2DSbSHng.jpg"
   }
}