{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "witness",
            "id": 3581
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "reporter",
            "id": 12193
         },
         {
            "name": "homeless",
            "id": 177927
         }
      ],
      "imdb_id": "tt0113425",
      "video": false,
      "title": "The Innocent Sleep",
      "recommendations": [],
      "backdrop_path": "/bpNiMz7ucDes6Fbh7PGdabSrM8I.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alan Terry",
               "gender": 2,
               "credit_id": "52fe4f42c3a36847f82c913f",
               "name": "Rupert Graves",
               "profile_path": "/erhJMyO6Cuh95TmSTAfQHNfCAi9.jpg",
               "id": 11278,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Billie Hayman",
               "gender": 1,
               "credit_id": "52fe4f42c3a36847f82c9143",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Det. Insp. Matheson",
               "gender": 2,
               "credit_id": "52fe4f42c3a36847f82c9147",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Adolfo Cavani",
               "gender": 2,
               "credit_id": "572d6cf3c3a3680fdb001b40",
               "name": "Franco Nero",
               "profile_path": "/lwXfTQrFqAw4zcVjrhgq3THfWCg.jpg",
               "id": 22383,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lusano",
               "gender": 2,
               "credit_id": "572d6d01c3a3680fdf001e4b",
               "name": "Oliver Cotton",
               "profile_path": "/d193v7k42LUOfWud2R4W0KrenGy.jpg",
               "id": 24627,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Thorn",
               "gender": 0,
               "credit_id": "572d6d0cc3a3680f3f00141f",
               "name": "Tony Bluto",
               "profile_path": null,
               "id": 1218934,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Pelham",
               "gender": 2,
               "credit_id": "572d6d1992514165fd001ab2",
               "name": "Paul Brightwell",
               "profile_path": "/1fPeFfZseGMzmjQA5zdMZwLpxkN.jpg",
               "id": 1256066,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mac",
               "gender": 0,
               "credit_id": "572d6d2692514165fd001ab8",
               "name": "Campbell Morrison",
               "profile_path": null,
               "id": 151794,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "George",
               "gender": 2,
               "credit_id": "572d6d37c3a3680fdb001b4d",
               "name": "Graham Crowden",
               "profile_path": "/wyGg5BXqE1N8oG1Ag82I3yHYQdW.jpg",
               "id": 10654,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "James",
               "gender": 2,
               "credit_id": "572d6d4f92514165ee001e28",
               "name": "John Hannah",
               "profile_path": "/jnHc3tC8mzLbVVJD6xWGUsEzC2r.jpg",
               "id": 10727,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Police Constable",
               "gender": 2,
               "credit_id": "584b6beb92514133bd005498",
               "name": "Sean Gilder",
               "profile_path": "/3k9U78b90A93O5KtbSSb4QDOJ19.jpg",
               "id": 77292,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4f42c3a36847f82c914d",
               "name": "Scott Michell",
               "profile_path": null,
               "id": 1284919,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "572d6cc5c3a3680fe2001cad",
               "name": "Ray Villis",
               "profile_path": null,
               "id": 1616339,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.093503,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 249358,
      "vote_count": 0,
      "budget": 0,
      "overview": "Inspired by the 1982 Roberto Calvi Affair in which an Italian banker was found hanging from a bridge across the River Thames, the story follows Alan, a man from Northern England who is homeless after the loss of his wife and job. One night while sleeping in a deserted building, Alan witnesses the murder of a high-profile businessman. He attempts to leave the scene unnoticed, but the killers realize that someone has seen them commit the crime. He goes to the police only to discover that one of the killers is leading the case. To stay alive, Alan recruits the help of Billie Hayman, an American journalist, to cover his story.",
      "similar": [
         357096,
         10651,
         11423,
         16995,
         1949,
         75780,
         445954,
         984,
         58625,
         9873,
         1266,
         4771,
         7007,
         15069,
         26390,
         8090,
         1586,
         1572,
         261023,
         281
      ],
      "original_title": "The Innocent Sleep",
      "runtime": 110,
      "poster_path": "/kmdu3X5XPdKWpNz7ETUmhEnRSm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Timedial Films",
         "id": 76472,
         "origin_country": ""
      }],
      "release_date": "1996-01-25",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Michell"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Ray Villis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113425/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMTc0Mjc5Ml5BMl5BanBnXkFtZTcwNjIwMjUyMQ@@._V1_SY317_CR16,0,214,317_AL_.jpg",
      "actors": ["Stars: Oliver Cotton, Tony Bluto, Paul Brightwell | See full cast and crew »"],
      "reviews": [
         "This enjoyable little thriller has an old-fashioned feel and is none the worse for that. Rupert Graves is surprisingly good as a Scouse drifter, sleeping rough near Tower Bridge, who witnesses a murder. Attempts to report the crime to the police go awry when he realises that the detective investigating the case is one of the killers. The story is a lightly-fictionalised account of the P2 masonic lodge scandal that led to the fall of the Italian government in May 1981 after revelations of infiltration by members of the illegal masonic lodge. (P2 stands for Propaganda Due). Licio Gelli, the Master of the lodge, was a former fascist and CIA officer working in league with Roberto Calvi, the President of Banco Ambrosiano of Milan, who was already in prison accused of illicit export of capital. One of Gelli's protégés was Michele Sindona, a banker connected with the Mafia, who had previously managed the funds of the Vatican and embezzled several billion lira. Sindona escaped to the US where he was apprehended and sentenced to 25 years imprisonment for fraudulent bankruptcy. (An inspector who had been making inquiries about him was mysteriously killed.) As for Calvi, he was found dangling from a noose beneath Blackfriars Bridge in London, his pockets and waistband stuffed with bricks. Ever since, questions have persisted about how he died. At first, a London coroner concluded it was suicide. However, his son and widow, who live in Montreal, have doggedly tried to prove that Roberto Calvi was killed. As chairman of Banco Ambrosiano, he was an influential financier who was nicknamed \"God's banker\" because of his close ties to the Vatican. In June, 1982, a year after being convicted of massive currency violations in Italy and with his bank teetering on collapse, he vanished. A week later, he was found hanging from scaffolding beneath Blackfriars Bridge, over the Thames. Banco Ambrosiano subsequently collapsed with enormous debts in a $1.3-billion (U.S.) bankruptcy. This suspected murder forms the premise of Scott Michell's film. It is atmospherically photographed, largely at night (watch it with the lights out, or you won't be able to make out a thing) and benefits greatly from an excellent music score by the young British composer Mark Ayres, which recalls the work of John Barry at some points.",
         "Mostly bland crime story in which a homeless man (Rupert Graves) is witness to a hanging from London's Tower Bridge. When he goes to report the crime, he discovers the cop leading the investigation (Michael Gambon) was one of the hangers, so he enlists the help of a journalist (Annabella Sciorra) to expose the story. Unfortunately, aside from a neat twist about three-quarters of the way through, there is little real mystery or suspense: we know Gambon did it, and Graves manages to stay out of any real danger for most of the film. The actors do the best they can, but get little support from the unsubtle script and direction; Sciorra spends most of her time being earnest and Gambon chews a little scenery but not enough to make a lasting impression. Graves is a solid lead but falls victim to the film's biggest failing; this is one of the least convincing depictions of homelessness I've seen. Overall, the film feels like a typical British TV crime show, but with most of the depth carefully removed.",
         "I too caught this about midnight, not aware it was being shown and had missed first 15 minutes but thoroughly enjoyed its Britishness. Being a Londoner I found it captured the essence of a London police drama, albeit very stereotypically but with a charm long forgotten, but the locations were wonderfully captured and made me feel quite homesick (even though i'm a North Londoner by birth), it really did remind me of The Lavender Hill Mob or Dixon of Dock Green. It also reminded me of an episode from The Sweeney or dare I say it The Bill and these programmes still have great following. Rupert Graves gave a splendid performance as did the whole cast and wish I had seen it when first shown.",
         "A movie, based on the Roberto Calvi story - the famous Vatican banker found hanging, quite suspiciously, from London Bridge some time in the eighties. Rupert Grave, Annabella Sciorra and Michael Gambon star. Graham Crowden as George, brings awesome talent to his role. Plot is not as \"holey\" as some but those that are, are unfortunately quite large and clichéd. What I truly liked was that there was no romance in the whole thing. A refreshing change. And no disclosures of past histories of broken marriages or partners now unpartnered. Very adult. Unlike some US films of the same genre where there are always sexual hitters and hittees. What I didn't like was Michael Gambon chewing the scenery along with his cohorts. Down to further chewing of a cigar to let us know how really \"bad guy\" he is in case we missed his savagely moving eyebrows and darting eyes and twisty mouth. John Hannah in a bit piece was lovely, accent in place, wryness on tap. The ending, I mean the very ending, not the warehouse bit, was satisfying. It missed being great by not such a wide mark. Shame. The director should have pulled in the performances and spent a bit more on the lighting and fixed the plot holes. 6 out of 10.",
         "This got shown on BBC 1 just before midnight so I was expecting another American TVM . But as it started I was slightly surprised to find THE INNOCENT SLEEP was a British thriller , unfortunately it`s not a very good one The problem is that it`s not just run of the mill but also treats the characters as stereotypes . All homeless people are either Scottish or scousers except for one old gentleman who is of course very high class , and all of them without exception alkies . Gangsters are of course either cockneys or Italians who of course all smoke cigars . All policemen are either corrupt or stupid while all journalists are of course workaholics who leave no stone unturned as they crusade to cover the truth . As much as the plot tries to twist and turn you still find yourself expecting more from a modern British thriller . Maybe I`d have been better off with an American TVM",
         "The main problem with this film is the main character's accent - he's supposed to be from Liverpool I believe, however Harry Enfield's scousers were more convincing. Of course, if you are from outside the UK, the previous comment will probably seem like gibberish to you, and the accent in question won't grate from minute one and destroy the credibility of the film every time he opens his mouth. So that's OK then. The film is moderately engaging - notwithstanding that all the 'baddies' are played so pantomime villain style it is just comical - until the moment the plot stretches the incredulity gap just a little too far. At the point where homeless 'scouser' murder witness Alan is left alone in his lady journo contact's house, and innocently rifling through her videos he just happens to play a taped TV interview with her defending her decision to name a previous source who subsequently hanged themself. Cue Alan's shocked indignation and off he goes to perform whatever actions are now required to advance the plot. Too late, the film's just gone belly up. The movie's set in London, in the eighties, and it was quite entertaining to see a mid-nineties interpretation of that era. I also enjoyed the reasonably dark and gritty atmosphere that was created. I would not, however, recommend staying up till the small hours on a school night watching the film from start to finish then writing a mildly disappointed review,as you will be left with an achingly empty feeling inside, wondering what on Earth has become of your life.",
         "Wow! A British thriller, based on the Roberto Calvi story, starring Annabella Sciorra and Michael Gambon! Funny, I don't remember this at the cinema! But surely it can't miss! Oh, but it did... What a weird little movie! Featuring, amongst other delights, Ms Sciorra in a Rhona Cameron hairdo, Gambon playing a Detective Chief Inspector who talks like a cockney barrow boy (**SPOILER** Though there's a clue in the way everyone calls him \"Inspector\" rather than \"Chief Inspector\"**END SPOILER**), and a performance from John Hannah that's not so much phoned in as scrawled on a piece of paper in bed, fashioned into a paper airoplane and thrown through the window. What was Annabella thinking? Appearing in this dreck was like Michael Stipe singing with Chas and Dave. It reaches its nadir when Gambon and fellow corrupt cops(straight from central casting) in order to get rid of the pesky tramp who can undo them, visit a homeless encampment and set fire to it, then stand there sneering! If only they'd had moustaches, so they could have twirled them..."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Timedial Films"],
      "summaries": ["The young, bright and decent London tramp Alan Terry accidentally witnesses a mob execution. He gets away, but leaves enough evidence for them to come looking for him among the homeless, and most violently: his older best friend is killed by arson. It turns out that Matheson, the police Detective Inspector in charge of the murder investigation, is in cahoot with the mob boss Adolfo Cavani, and actually on Alan's trace, with the firm intent to eliminate the dangerous witness. The only one who may actually help Alan is a female reporter..."],
      "budget": 0
   },
   "movielensId": 1578,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-25",
      "dvdReleaseDate": null,
      "directors": ["Scott Michell"],
      "runtime": 110,
      "movieId": 1578,
      "title": "The Innocent Sleep",
      "mpaa": null,
      "actors": [
         "Rupert Graves",
         "Annabella Sciorra",
         "Michael Gambon",
         "Franco Nero",
         "Oliver Cotton",
         "Tony Bluto",
         "Paul Brightwell",
         "Campbell Morrison",
         "Graham Crowden",
         "John Hannah",
         "Sean Gilder"
      ],
      "imdbMovieId": "0113425",
      "originalTitle": "The Innocent Sleep",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "Inspired by the 1982 Roberto Calvi Affair in which an Italian banker was found hanging from a bridge across the River Thames, the story follows Alan, a man from Northern England who is homeless after the loss of his wife and job. One night while sleeping in a deserted building, Alan witnesses the murder of a high-profile businessman. He attempts to leave the scene unnoticed, but the killers realize that someone has seen them commit the crime. He goes to the police only to discover that one of the killers is leading the case. To stay alive, Alan recruits the help of Billie Hayman, an American journalist, to cover his story.",
      "tmdbMovieId": 249358,
      "avgRating": 2.82143,
      "releaseYear": "1996",
      "numRatings": 28,
      "posterPath": "/kmdu3X5XPdKWpNz7ETUmhEnRSm.jpg"
   }
}