{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cruise ship",
            "id": 11095
         },
         {
            "name": "widower",
            "id": 33476
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0119848",
      "video": false,
      "title": "Out to Sea",
      "recommendations": [
         24560,
         88258,
         27977,
         2620,
         79008,
         207729,
         38916,
         27472,
         2983,
         152586,
         15602,
         9409,
         22588,
         20983,
         43750,
         30402,
         15910,
         16384,
         23719,
         17795
      ],
      "backdrop_path": "/9wgP29mbpzBSHmn5D0FhATi0ezm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Herb Sullivan",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d49",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Charlie Gordon",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d4d",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Liz LaBreche",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d51",
               "name": "Dyan Cannon",
               "profile_path": "/izkeTrXplwngcqgUhBBvepn7kbT.jpg",
               "id": 40403,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Gil Godwyn",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d87",
               "name": "Brent Spiner",
               "profile_path": "/gYaOWwycKcSEPQzUOITt9DA5AcY.jpg",
               "id": 1213786,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Vivian",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d5b",
               "name": "Gloria DeHaven",
               "profile_path": "/a6zK5paGr1XaORfbySeCeCkp1vr.jpg",
               "id": 120306,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mavis LaBreche",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d5f",
               "name": "Elaine Stritch",
               "profile_path": "/4QGJE8HwbJXdb7MrsINR8zJtDzp.jpg",
               "id": 36802,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mac Valor",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d63",
               "name": "Hal Linden",
               "profile_path": "/3r2imTWRhfSPcrbXqe0cx04TeLX.jpg",
               "id": 133670,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jonathan Devereaux",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d67",
               "name": "Donald O'Connor",
               "profile_path": "/hxVmaQrq8pY1Yq3eaW5WoojxydO.jpg",
               "id": 13295,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Cullen Carswell",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d6b",
               "name": "Edward Mulhare",
               "profile_path": "/bFxVGBwUVVfNLsaxH1xInfleQaR.jpg",
               "id": 30125,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mrs. Ellen Carruthers",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d6f",
               "name": "Rue McClanahan",
               "profile_path": "/gYNGpRNqpnjDIUe7oaCFkPrYyZ2.jpg",
               "id": 41689,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Shelly",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d73",
               "name": "Alexandra Powers",
               "profile_path": "/bcZFHTddjsAR73j0rlRetktvEIE.jpg",
               "id": 131183,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Allan",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d77",
               "name": "Sean O'Bryan",
               "profile_path": "/doVNkZLo1aqfRVfUymkjuTpyUYa.jpg",
               "id": 33836,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d7b",
               "name": "Esther Scott",
               "profile_path": "/emrmGHBFIu3JAk65qIpORv6fFoA.jpg",
               "id": 154224,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Sebastian",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096d7f",
               "name": "Allan Rich",
               "profile_path": "/Asmdc5LrKtjklKyWuEochYe3Rn2.jpg",
               "id": 568531,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Bridget",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d83",
               "name": "Estelle Harris",
               "profile_path": "/equDBtZgBkO7e8QKpNokDz9EbY9.jpg",
               "id": 61964,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe475e9251416c75096d57",
               "name": "Martha Coolidge",
               "profile_path": "/6XDmHbCLMtzvVU8h5ZauG8CkSIl.jpg",
               "id": 63713,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546cb8cf9251413059001671",
               "name": "Robert Nelson Jacobs",
               "profile_path": "/apg1GlFlO4eaelL8fQeCFjB5EMa.jpg",
               "id": 5308,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "57cf7b4492514134a7004879",
               "name": "Anne V. Coates",
               "profile_path": null,
               "id": 6346,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58fd302ec3a3687a2a024b53",
               "name": "David Newman",
               "profile_path": "/vncTIJaBWoYmpdNCPkDnA8hT3PM.jpg",
               "id": 3393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58fd303dc3a36879f40232c4",
               "name": "Lajos Koltai",
               "profile_path": null,
               "id": 47275,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58fd3051c3a36879be0276e8",
               "name": "James H. Spencer",
               "profile_path": null,
               "id": 10064,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "58fd305792514163df027264",
               "name": "Jackie Burch",
               "profile_path": null,
               "id": 1097,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "58fd305e92514163ec02675e",
               "name": "William F. Matthews",
               "profile_path": null,
               "id": 1127497,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "58fd3064c3a3687a15023ce5",
               "name": "Anne D. McCulley",
               "profile_path": null,
               "id": 11375,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "58fd306b92514163ec026765",
               "name": "Jane Robinson",
               "profile_path": null,
               "id": 1144738,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.679274,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18080,
      "vote_count": 26,
      "budget": 0,
      "overview": "Care-free Charlie (Walter Matthau) cons his widower brother-in-law Herb (Jack Lemmon) into an expenses-paid luxury cruise in search of rich, lonely ladies. The catch is that they are required to be dance hosts! With a tyrannical cruise director, and the luscious Liz and lovely Vivian, our heroes have lots of mis-adventures before they finally return to port.",
      "similar": [
         258480,
         858,
         634,
         3981,
         112160,
         401898,
         437557,
         17130,
         370663,
         43923,
         141,
         244772,
         242224,
         394117,
         297762,
         27586,
         2255,
         40807,
         8966,
         1581
      ],
      "original_title": "Out to Sea",
      "runtime": 106,
      "poster_path": "/A9mdtkLl9yM2jWgti5hJ83UZf84.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/oyzh3Ax1DLJ5gbNRgD6JgMz9Uvd.png",
            "name": "Davis Entertainment",
            "id": 1302,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-07-02",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Get ready to Rumba!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martha Coolidge"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Robert Nelson Jacobs"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119848/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MTk0OTU3Ml5BMl5BanBnXkFtZTcwOTYyMjYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Walter Matthau, Dyan Cannon | See full cast and crew »"],
      "reviews": [
         "A competent comedy that delivers the laughs for fans of Jack Lemmon and Walter Matthau. I suppose this film was made for those who enjoyed the two GRUMPY OLD MEN films, as there seemed to be a bunch of these buddy team-ups spotlighting the comical duo in their twilight years. The idea is a sure-fire one: Matthau, a bumbling gambler who's thousands of dollars in debt, connives his unsuspecting friend Lemmon into taking a free cruise with him where they can meet rich old ladies; the catch is, they've been signed on as Dance Hosts and Matthau can't dance. OUT TO SEA is a funny film, and not all of the chuckles are to be found courtesy of Lemmon and Matthau. I found Brent Spiner (best known as Data from STAR TREK: THE NEXT GENERATION) to be very humorous as the snobby ball-busting dance coordinator. As the prissy boss of the two aging actors, he manages to match them in the laughs department. Though the film doesn't really need any, there's also a a love story or two to be found here as well, involving Dyan Cannon (who looks pretty fine for her years). *** out of ****",
         "Walter Matthau and Jack Lemmon, both of whom are sadly missed, proved once again that they were a team dedicated to their craft of bringing hilarious moments to the screen. This film is just another example of this. This time out they play two brothers-in-law who land on a ship as dance instructors on board. Of course, their boss is a perfectionist and miserable person named Gil Godwin who just enjoys harassing these boys. It's hilarious how Lemmon gives a quick lesson in dancing to Matthau and how the latter dances a riotous rumba with the boat's owner Rue McLanahan. Too bad that fellow dance instructors Hal Linden and Donald O'Connor are given so little to do but their parts call for that. Matthau falls for Dyan Cannon, on board with her fellow gold-digging mother, the usual outrageous Elaine Stritch. Unknown to them, Matthau has no money either. The widower Lemmon falls for Gloria De Haven, looking lovelier than ever. The film belongs to Matthau and Lemmon and will serve as a further tribute to their illustrious careers.",
         "Movies aren't always suppose to be about deep, provolking thoughts. Sometimes they're simply meant to be escapes from reality. Out To Sea fits the bill perfectly. A light hearted \"golden years\" romantic comedy, Out To Sea may not be big budget, you might be able to easily tell when they were acting in front of a green screen, but it's still very much a movie worth watching. A sweet movie that needs to be given a break. This is just good, light hearted fun. It's not meant to be a deep movie. It's something worth watching. If for nothing else, you must see it for Brent Spiner's humorously stiff and uptight rendition of Oye Como Va. Gil is a character you love to hate and Mr. Spiner pulls off the perfect evil comic foil to two beloved comedy movie gods.",
         "While this movie is not the most entertaining in the world, I think it is better than most over all. I mean it had it's little laughs and just all around a good feeling. It's not too often we get to see two old geezers just having fun with their age and honestly having a good time with the jokes. Walter and Jack had such a great chemistry together as friends/brother in-laws. Just watching them romancing these women was fun and you rooted for them all the way because wither we have to admit it or not, for their age, they still had game! :D I loved just the whole plot of being able to move on and having fun no matter how old you are. I'd recommend this movie for a nice laugh if you want one. 7/10",
         "Jack Lemmon and Walter Matthau have got to be one of the best buddies ever to work together. They have made lots of movies together, i think they are both fantastic when they do work together in a movie. Out to sea is a fantastic comedy movie i think to watch. I give the movie 10 out of 10. Jack lemmon and Walter Matthau will be remembered when the movies they did together will be on tv. They will be sadly missed. God bless you both.",
         "I found this movie to be quite good. Although some people call this movie the \"Grumpy Old Men And The Sea\" it is hilarious at the right moments and soft at others. Matthau and Lemmon are two great actors and if you like one or both of them, be sure not to miss this film.",
         "Charlie Gordon (Walter Matthau) is the guy who can't seem to let go of horse racing. The debts pile up high on his head. So, he decides that it is time for him and his brother-in-law to take a trip out on the open seas. His brother-in-law, Herb Sullivan (Jack Lemmon) whose wife passed away reluctantly tags along. It is not until they board the Westerdam that it is realized that Charlie signed them up as dance hosts. What follows is some hilarious antics not only on the open seas, but on the dance floor. And a sweet love story also comes along too. People criticize this movie for the pointlessness it brings. It is actually quite funny, but seems to be geared more toward the seniors' group. I think this movie was quite good. Rent it for a weekend and just see.",
         "I got a few laughs out of this one, more than a lot of other so called comedies. The big ship was a knockout and getting to see a lot of it's scenery was fun: as was getting to see some of Dyan Cannon's curves. This wasn't the height of Lemmon's and Mattheau's career, but it wasn't a total dog as some suggest.",
         "Walter Matthau plays Charlie Gordon who cons his widower brother-in-law Herb Sullivan (Jack Lemmon) into a cruise in search of rich and lonely ladies.What he doesn't tell Herb is that they have to be dance hosts. Out to Sea from 1997 is a comedy with excellent actors.There are great performances from Elaine Stritch, Dyan Cannon, Gloria DeHaven, Rue McClanahan, Estelle Harris, Hal Linden and Donald O'Connor.Lemmon and Matthau make a great team in the lead.This movie would be much worse without them.This legendary couple saves the movie.They're both dead now.Matthau died July 1st 2000 and Lemmon June 27th 2001.These two made us laugh in so many movies.The world of comedy lost a lot with them.So thanks for the laughs you two.We will miss you very much.",
         "I was totally surprised just how good this movie actually is because when I first saw it I was only mildly amused! I must say however, that I am still very disappointed that Donald O'Connor wasn't given a bigger and better role! He was an enormous talent. There is a great chemistry among all the main cast members and Matthau has never been funnier. I am tremendously glad that this picture got made because we get to see Lemmon and Matthau team up for the very last time; in a vehicle that puts their talent to great use. Brent Spiner proves that \"Data\" from Star Trek the Next Geeration is not the only good character he can play. The storyline is really quite simple but the comedy and the characters work really well and I laughed heartily throughout this movie and I highly recommend it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Davis Entertainment"
      ],
      "summaries": [
         "Care-free Charlie cons his widower brother-in-law Herb into an expenses-paid luxury cruise in search of rich, lonely ladies. The catch is that they are required to be dance hosts! With a tyrannical cruise director, and the luscious Liz and lovely Vivian, our heroes have lots of mis-adventures before they finally return to port.",
         "A failed gambler, intent on meeting a rich widow, tricks his widowed brother-in-law into boarding a cruise ship as dance hosts."
      ],
      "budget": 0
   },
   "movielensId": 1581,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-07-02",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Martha Coolidge"],
      "runtime": 106,
      "movieId": 1581,
      "title": "Out to Sea",
      "mpaa": "PG-13",
      "actors": [
         "Jack Lemmon",
         "Walter Matthau",
         "Dyan Cannon",
         "Brent Spiner",
         "Gloria DeHaven",
         "Elaine Stritch",
         "Hal Linden",
         "Donald O'Connor",
         "Edward Mulhare",
         "Rue McClanahan",
         "Alexandra Powers",
         "Sean O'Bryan",
         "Esther Scott",
         "Allan Rich",
         "Estelle Harris"
      ],
      "imdbMovieId": "0119848",
      "originalTitle": "Out to Sea",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["pBlgCLV1KzI"],
      "plotSummary": "Care-free Charlie (Walter Matthau) cons his widower brother-in-law Herb (Jack Lemmon) into an expenses-paid luxury cruise in search of rich, lonely ladies. The catch is that they are required to be dance hosts! With a tyrannical cruise director, and the luscious Liz and lovely Vivian, our heroes have lots of mis-adventures before they finally return to port.",
      "tmdbMovieId": 18080,
      "avgRating": 2.77306,
      "releaseYear": "1997",
      "numRatings": 683,
      "posterPath": "/A9mdtkLl9yM2jWgti5hJ83UZf84.jpg"
   }
}