{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "camping",
            "id": 1890
         },
         {
            "name": "colorado",
            "id": 1981
         },
         {
            "name": "wolf",
            "id": 1994
         },
         {
            "name": "alligator",
            "id": 3184
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "brother",
            "id": 5301
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "animal",
            "id": 18165
         },
         {
            "name": "naturalist",
            "id": 182662
         },
         {
            "name": "1960s",
            "id": 208992
         }
      ],
      "imdb_id": "tt0120512",
      "video": false,
      "title": "Wild America",
      "recommendations": [
         49345,
         118430,
         61536,
         95630,
         24826,
         41480,
         35120,
         77073,
         73336,
         144060,
         83105,
         53882,
         46283,
         265037,
         45325,
         17414,
         73079,
         20551,
         25969,
         44488
      ],
      "backdrop_path": "/gXRh6bLfLNNymCTwJ1D9aV8XQ3W.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marshall Stouffer",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a7a3",
               "name": "Jonathan Taylor Thomas",
               "profile_path": "/1S8DpfNv6iiQRuKFPtb5u6sCQ5G.jpg",
               "id": 53283,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Marty Stouffer Jr.",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a7a7",
               "name": "Scott Bairstow",
               "profile_path": "/qgE0fIjyWaWySrGWUvt54OHJout.jpg",
               "id": 82519,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mark Stouffer",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a7ab",
               "name": "Devon Sawa",
               "profile_path": "/jur7ijuplTyNWItmXuFhCcUffd6.jpg",
               "id": 50398,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Agnes Stouffer",
               "gender": 1,
               "credit_id": "52fe46a09251416c9105a7bb",
               "name": "Frances Fisher",
               "profile_path": "/248IbuAi6RQG5l94a4hClUswbA5.jpg",
               "id": 3713,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Bigfoot the Mountain Man",
               "gender": 2,
               "credit_id": "5715b4ed9251417a22002117",
               "name": "Danny Glover",
               "profile_path": "/jSNTEnm0Sxm8FRtoBfJmhmQyozH.jpg",
               "id": 2047,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a7b1",
               "name": "William Dear",
               "profile_path": "/zd7BF2zZTarjru9K4Rwgw6CMFZW.jpg",
               "id": 56506,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a7b7",
               "name": "David Michael Wieger",
               "profile_path": null,
               "id": 1111141,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Family",
         "id": 10751
      }],
      "popularity": 7.267044,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38225,
      "vote_count": 34,
      "budget": 0,
      "overview": "Three brothers - Marshall, Marty and Mark dream of becoming naturalists and portraying animal life of America. One summer their dream comes true, they travel through America, filming alligators, b  ears and moose.",
      "similar": [
         5915,
         278927,
         11202,
         1578,
         83666,
         75174,
         381284,
         323677,
         228970,
         10734,
         75900,
         9530,
         88794,
         309302,
         36950,
         1883,
         376866,
         347123,
         192136,
         192142
      ],
      "original_title": "Wild America",
      "runtime": 106,
      "poster_path": "/fUjf9kC0ji7hQDb0rwLjhDezaLK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Morgan Creek Productions",
         "id": 10210,
         "origin_country": ""
      }],
      "release_date": "1997-07-02",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Take a ride on the wild side.",
      "adult": false,
      "homepage": "http://wildamerica.warnerbros.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Dear"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["David Michael Wieger"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120512/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDkxOTY0NTg0Ml5BMl5BanBnXkFtZTcwMjkwMzEyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Jonathan Taylor Thomas, Devon Sawa, Scott Bairstow | See full cast and crew »"],
      "reviews": [
         "I thought this flick was great fun. I thought the acting was pretty decent and not as bad as other people say. Sure, the three leads are all teen idols, but I am not going to knock their performances because of that. Still, I continue to enjoy this flick, and always will",
         "Despite the three young actors being \"teen idols,\" they pulled off really good chemistry throughout the film. My primary faults with the film are not with the acting at all, but with the screenplay. Because of the writer's desire to put everything possible into one movie, he sabotaged its overall effectiveness. Is this a classic teen idol flick? Is it a nature film? Is it comedy/drama/action? It's really hard to say, as it doesn't succeed as any of the above! There are too many side-plots -- does the owl really need to be there? Or Leon? Or the man in the mountain? There are too many relationships given just a hint of substance, such as that with Mom, the town bully, the local girls, the college girls... In addition, Mark's character has little opportunity to develop, and the other boys leave a great deal to the imagination. And I ask you, is it necessary for Marshall to have three different nicknames? This is, unfortunately, one more movie that could have been really great. As it is, it is a fun film without enough substance. On a side note, is there any particular reason that only one of the Stouffer brothers was involved in producing the show? I find that a little odd, myself.",
         "I recently watched this movie on a Sunny Sunday morning whilst in bed, sounds very ideological, but is true. I must say I do not believe it is all that bad. OK at times the screenplay does stray away from it's original context and the stereotypical WASP family may reinforce unrealistic portrayals of Hollywood, but with this, with a little effort on our behalf, we the audience can allow ourselves to be whisked away into the young boys adventure, out of the harsh realities of life. When analysed, issues of father and son relationships and the transition of boy to manhood become quite clear. Taking into consideration that the film was made nearly ten years ago, I feel it serves importantly as balance between strong realism and fairy tale.",
         "When I heard that Jonathan Taylor Thomas was doing a movie with Devon Sawa at the height of my teenybopper stage, needless to say I was excited. The weird thing is that I still love this movie now. The plot follows the three Stouffer brothers, Marty, Mark, and Marshall, following their dreams to get out of their small town and dead-end future as mechanics and go out and film animals. Not just any animals, though, the \"biggest bad-a**es of the animal kingdom,\" which results in a few thrilling, sometimes comic adventures for the three brothers. The brothers want the piece de resistance of their film to be an infamous cave where a group of bears are reputed to sleep together, the rumor that actually starts their trip and leads to the biggest adventure of all. This movie is full of hope that dreams can come true, as cheesy as that sounds, and is even better as it is a true story based on the naturalists behind Wild America. Great shots of animals, as well (not counting fake bear suits).",
         "This movie is an absolute classic! It's Disney at its best for the wild at heart it is timeless. The relationship between the brothers makes the movie. Each character is beautifully woven and \"real\". Inspired by imperfect but truly loving and good old American idealist parents, the boys leap out of the nest and clamor after their own dreams. It rings true to any wise parent, who knows that someday they will have to let go. Great movie for the whole family! A beautiful story of family ties, courage, perseverance and imperfect but admirable characters who each learn their very own lesson. It truly captures the essence of true American spirit! Watch for - The real Stouffer brothers who have cameos in the film as three \"uncredited\" ruffians (in the scene where the boys are driving to snow country).",
         "Wild America is the story of three brothers, two of whom want to make a film depicting wild life all over America. The story focuses mainly on the youngest brother Marshall who sneaks into his brothers' car in order to go with them on their trip. While on the road with his brothers Marshall learns more about who he really is and what the real world is all about. In my opinion the thing that makes Wild America such an amazing movie is the that not only does it have the action of the animal scenes and the heartwarming tale of a child who is coming of age. But it's a true story that we can all relate to. It shows us that no matter what anyone tells you, you can go out into the world and find what you're looking for. That's where the real inspiration lies.",
         "It's maybe because of the great plot!and i know that these brothers are real-I have seen some of the documentary movies one of them has done. It's not just the plot, it's the actors crew,the music,the nature... But there's a mistake with the toothbrushes- the little brother washes 2 of them in the toilet (which are supposed to be the other brothers') and later washes his teeth with one of the \"toilet\" ones.I'm not quite certain about that so I'll have to check. I really don' like to buy movies for myself but i have this one!Believe me - if you're looking for adventure , this is the movie!!!",
         "I give this movie a 9 out of 10! I can't believe this movie didn't make hardly any money cause it sure was good. Whenever I am in the mood to watch a movie, it is always Wild America. I don't know what it is about this movie but it is just exciting, adventurous, funny, and action packed all rolled up into one. Scott Bairstow, Devon Sawa, and Johnathan Taylor Thomas were great in this movie. I recommend it to anyone all ages. I first saw it when I was about 5 years old and I fell in love with it. Since then it has been one of the family favorites and we watch it all the time. We are a big movie family so we watch movies every single night together. We've seen this one at least 50 times.",
         "I believe in grading movies on a curve. This one is not in the same class as Citizen Kane or Fargo or Some Like It Hot. Instead this is a low-budget and somewhat corny\u0097okay, pretty corny\u0097family film like, oh, Because of Winn-Dixie. And graded on the curve appropriate for that class, this is at least an 8 out of 10. I'll be honest, my wife is the one who ordered this from Netflix and I didn't want to see it. I had Gosford Park in the DVD tray ready to go. But my wife thought our 15-year old would enjoy Wild America more, and our daughter agreed. I was outnumbered. So we watched this film. I didn't know anything about it. We were a good 10 minutes or more into the film before I put the family's last name (Stouffer) together with the first name of the oldest son (Marty) and realized, \"Hey, I know who this kid is: It's Marty Stouffer of...\" D'oh. Anyway, I expect that the real adventures of the real Marty and his brothers weren't quite as colorful as those of the characters in the film. But there were a good combination of excitement (and from some unlikely sources, like F-14 jets dropping bombs) and genuine humor. I laughed hard again and again. Special effects? Well, I'll just say, it ain't Jurassic Park. I think the animal props were rented from a budget prop store in Atlanta. But it didn't matter. I enjoyed the film a lot. Do what I did, get some fresh hot pizza, sit back with your spouse and a kid or two, and enjoy it yourself.",
         "Wild America is a great movie! It is the story of three brothers, Marshall (Johnathan Taylor Thomas), Mark (Devon Sawa), and Marty Stouffer (Scott Bairstow) who go on the road in various locations across America putting their lives in danger as they learn to depend and trust each other while filming endangered wildlife with the dreams of becoming nature filmmakers. All kinds of animals are filmed in this movie from alligators, wolves, deer, wild horses, moose, a cave of raging grizzly bears and more! I saw a little bit of this when it aired on WGN one Saturday afternoon and the parts I saw made me want to watch the whole movie. I first saw the whole movie on Encore Wam about two months ago and I loved it. Since then, it has become one of my favorite movies. I don't have this one yet, but I hope to get it soon. If you're looking for adventure, action, love nature, or you need a movie to watch with the whole family, I highly recommend this. This is not a Disney movie; it is from Warner Bros., so just to warn you, there is some language in this film despite its PG rating. Rating for Wild America: 10/10!"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Morgan Creek Productions",
         "Steve Tisch Company, The"
      ],
      "summaries": [
         "Three brothers - Marshall, Marty and Mark dream of becoming naturalists and portraying animal life of America. One summer their dream comes true, they travel through America, filming alligators, bears and moose.",
         "This is the fact-based story of three brothers who grew up to be some of the foremost animal photographers in the world. The story follows their wild summer when their parents permitted them to roam America with a camera they bought by borrowing money from their father."
      ],
      "budget": 0
   },
   "movielensId": 1582,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-07-02",
      "dvdReleaseDate": "2008-05-06",
      "directors": ["William Dear"],
      "runtime": 106,
      "movieId": 1582,
      "title": "Wild America",
      "mpaa": "PG",
      "actors": [
         "Jonathan Taylor Thomas",
         "Scott Bairstow",
         "Devon Sawa",
         "Frances Fisher",
         "Danny Glover"
      ],
      "imdbMovieId": "0120512",
      "originalTitle": "Wild America",
      "genres": ["Family"],
      "youtubeTrailerIds": ["tC-MNWJ87Cg"],
      "plotSummary": "Three brothers - Marshall, Marty and Mark dream of becoming naturalists and portraying animal life of America. One summer their dream comes true, they travel through America, filming alligators, b  ears and moose.",
      "tmdbMovieId": 38225,
      "avgRating": 3.05513,
      "releaseYear": "1997",
      "numRatings": 517,
      "posterPath": "/fUjf9kC0ji7hQDb0rwLjhDezaLK.jpg"
   }
}