{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "anti hero",
            "id": 2095
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "fistfight",
            "id": 5572
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "burn victim",
            "id": 158567
         }
      ],
      "imdb_id": "tt0120177",
      "video": false,
      "title": "Spawn",
      "recommendations": [
         9312,
         9823,
         9946,
         11667,
         9349,
         5549,
         8831,
         10329,
         9556,
         10016,
         1649,
         1497,
         9482,
         1498,
         8814,
         9607,
         10796,
         169,
         9425,
         11470
      ],
      "backdrop_path": "/9lQKvI6hCqblUn1XgVqZbN7kl6.jpg",
      "revenue": 87840042,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Al Simmons",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d503",
               "name": "Michael Jai White",
               "profile_path": "/zvt4lOlPVVq1MZXmJDWNmBQDnWl.jpg",
               "id": 64856,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Jason Wynn",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d507",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Clown / Violator",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d511",
               "name": "John Leguizamo",
               "profile_path": "/rbq24AzthnwRXUYcVfUnP5bKN50.jpg",
               "id": 5723,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Wanda Blake",
               "gender": 1,
               "credit_id": "52fe435b9251416c7500d515",
               "name": "Theresa Randle",
               "profile_path": "/cbngAGNDoWK9vGoaENUhZQgd4J9.jpg",
               "id": 4604,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Cogliostro",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d519",
               "name": "Nicol Williamson",
               "profile_path": "/kCvjXpYSCYH14mo0gtRmnV7DroV.jpg",
               "id": 51812,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Terry Fitzgerald",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d51d",
               "name": "D. B. Sweeney",
               "profile_path": "/2qkjuNojR8ilj2xDrd48xxkSwiM.jpg",
               "id": 61962,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Jessica Priest",
               "gender": 1,
               "credit_id": "52fe435b9251416c7500d521",
               "name": "Melinda Clarke",
               "profile_path": "/hwhM70KOncsxVoQVzvs5U24m6VF.jpg",
               "id": 89251,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Zack",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d525",
               "name": "Miko Hughes",
               "profile_path": "/hpteoojNUAomlQVbiL4eSjUeJ4K.jpg",
               "id": 8186,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Cyan",
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d529",
               "name": "Sydni Beaudoin",
               "profile_path": "/k1d7v3SSVBbNEGau1pfifY7nEdB.jpg",
               "id": 1072036,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "The Devil Malebolgia",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d52d",
               "name": "Frank Welker",
               "profile_path": "/b3gImArbw13mMKJIe9leFc9YYb7.jpg",
               "id": 15831,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d4d5",
               "name": "Todd McFarlane",
               "profile_path": "/bejL1CON9O8SLxr5iBDlMyumW8n.jpg",
               "id": 64849,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d4db",
               "name": "Alan B. McElroy",
               "profile_path": null,
               "id": 56452,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d4e1",
               "name": "Clint Goldman",
               "profile_path": null,
               "id": 60217,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d4e7",
               "name": "Todd McFarlane",
               "profile_path": "/bejL1CON9O8SLxr5iBDlMyumW8n.jpg",
               "id": 64849,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d4ed",
               "name": "Graeme Revell",
               "profile_path": "/g2Nhv2OCV8ygLYxkeDbhlqnrv7Z.jpg",
               "id": 5912,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d4f3",
               "name": "Guillermo Navarro",
               "profile_path": "/AfZkxrEiLlqqHONhfJyVOLrHR8A.jpg",
               "id": 3113,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d4f9",
               "name": "Todd Busch",
               "profile_path": null,
               "id": 64855,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d4ff",
               "name": "Michael N. Knue",
               "profile_path": null,
               "id": 16651,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d50d",
               "name": "Mark A.Z. Dippé",
               "profile_path": "/aXHVL2NmsCnMgwnacF2YBkOJ73x.jpg",
               "id": 87130,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "537348df0e0a267c590015b2",
               "name": "Bruce H. Newberg",
               "profile_path": null,
               "id": 1319401,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "537348f30e0a267c67001487",
               "name": "Mary Jo Slater",
               "profile_path": null,
               "id": 2121,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "537349090e0a267c5c0014fa",
               "name": "Daniel J. Lester",
               "profile_path": null,
               "id": 33284,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "537349500e0a267c6a00150d",
               "name": "Philip Harrison",
               "profile_path": null,
               "id": 10936,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "537349ef0e0a267c62001507",
               "name": "Dena Roth",
               "profile_path": null,
               "id": 960963,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54b40d7fc3a36809400070d2",
               "name": "Richard Trus",
               "profile_path": null,
               "id": 1410526,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "54d542a5c3a3683b92000171",
               "name": "Eric Orbom",
               "profile_path": null,
               "id": 14492,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.717308,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10336,
      "vote_count": 398,
      "budget": 40000000,
      "overview": "After being murdered by corrupt colleagues in a covert government agency, Al Simmons (Michael Jai White) makes a pact with the devil to be resurrected to see his beloved wife Wanda (Theresa Randle). In exchange for his return to Earth, Simmons agrees to lead Hell's Army in the destruction of mankind.",
      "similar": [
         99861,
         68721,
         49521,
         209112,
         1924,
         141052,
         10138,
         1726,
         155,
         1724,
         1452,
         297762,
         8536,
         76122,
         30061,
         251519,
         14011,
         65291,
         9531,
         299537
      ],
      "original_title": "Spawn",
      "runtime": 96,
      "poster_path": "/tfvH5YKXtMiBgkj0FNozQj4TQyp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Pull Down Your Pants Pictures",
            "id": 3907,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Todd McFarlane Entertainment",
            "id": 23364,
            "origin_country": ""
         }
      ],
      "release_date": "1997-07-31",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Born in darkness. Sworn to justice.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mark A.Z. Dippé"],
      "runtime": 96,
      "synopsis": "Al Simmons (Michael Jai White), a military soldier/assassin, is betrayed by the head of a covert government agency, Jason Wynn (Martin Sheen). Wynn assigns Simmons a mission to take out a Bio-Chem plant in North Korea while ordering his top assassin, Jessica Priest (Melinda Clarke), to assassinate him. After Simmons dies from a gas fire caused by Wynn, he arrives in Hell, where Malebolgia (Frank Welker), the Devil, offers him a Faustian deal. If Simmons becomes his eternal servant and leader of his army in Armageddon, he will be able to return to Earth to see his fiancée, Wanda Blake (Theresa Randle). Simmons accepts the offer and is returned to Earth. When he returns, Simmons learns that five years have passed. Wanda is now married to his best friend, Terry (D. B. Sweeney) and living the life he longed for, including the daughter he never knew, Cyan (Sydni Beaudoin). He encounters a strange clown-like demon called The Violator (John Leguizamo), who acts as a guide, setting \"Spawn\" onto the path to evil. He also meets a mysterious old man named Cogliostro (Nicol Williamson), a fellow Hellspawn who freed his soul and now fights for Heaven. Jason Wynn has become a high-class weapons dealer and developed the ultimate biological weapon, \"Heat 16\". During a reception Simmons attacks Wynn, kills Jessica and escapes, instinctively using Spawn's strange armor. Following Simmons' attack, The Violator convinces Wynn to have a device attached to his heart that will trigger the worldwide release of Heat 16 should his vital signs flatline. The device is supposedly a safeguard against assassination attempts, but Malebolgia actually wants Simmons to kill Wynn and trigger the apocalypse. Spawn confronts The Violator, who turns into his demonic form and beats him down. Cogliostro rescues him and teaches him how to use his necroplasm armor before Spawn learns that Clown and Jason are going to kill Terry. Meanwhile, Terry has just finished texting a fellow newsman who sent him evidence exposing Jason Wynn. After the transmission, Cyan enters the room, with Jason right behind her. Jason destroys Terry's computer and takes the family hostage. When Spawn arrives, he ends up almost killing Jason Wynn, despite his warning that his death will launch the Heat 16 bombs. Only after realizing that Jason's death would ultimately mean the death of Cyan does he relent. Instead, he extracts the device from Wynn's body before destroying it. His plans foiled, Clown draws Spawn and Cogliostro into Hell, where Spawn tells Malebolgia that he will never lead his army. He escapes with Cogliostro just before they are overwhelmed and returns to the real world. The Violator follows and there is a final battle between him and Spawn, ending with Spawn severing the demon's head with his chains. Jason Wynn is arrested and Spawn, realizing there is no place for him in Wanda's world anymore, dedicates himself to justice rather than succumbing to his lust for vengeance.",
      "writers": [
         "Todd McFarlane",
         "Alan B. McElroy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120177/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3MDc1ODE5NV5BMl5BanBnXkFtZTcwNzk2NzAzMQ@@._V1._CR0,23,262,449_SX214_AL_.jpg",
      "actors": ["Stars: John Leguizamo, Michael Jai White, Martin Sheen | See full cast and crew »"],
      "reviews": [
         "This film is just like the comic that inspired it: Great visuals (I still really like McFarlane's superhero art style), but much like the majority of \"Spawn\" stories, it really doesn't go anywhere. The set looks good, the characters look good, the cape looks REALLY good, but the story? Other than telling the origin and the standard \"must stop the bad guy\" motive, it doesn't do as much as it should. And yes, I know it's a Hell-based movie, but the metal soundtrack just got distracting and annoying, instead of enhancing the story like it should have. John Williams or Danny Elfman it wasn't. Need to see the film? It's a great visual ride. Just don't expect much more than that. It did make for some cool toys, though.",
         "Al Simmons (Michael Jai White) is one of the top operatives for Jason Wynn (Martin Sheen), who is the head of an organization called A6. When Simmons becomes aware that A6 might be a little shady, he learns the hard way that he isn't allowed to quit A6. This leads to his transformation into Spawn, a superhero with a background and motivations that are just as morally ambiguous as A6. The film largely concerns Spawn discovering and exploring his new identity, while working to uncover a nefarious plot and attain revenge. If you read my reviews frequently enough over time, you'll notice that my ratings often change on repeated viewings. My rating for Spawn has definitely gone down since my last viewing, but currently, I'm giving it a generous 8 out of 10. There are a lot of things that are brilliant about the film, at least for viewers with particular, odd tastes similar to mine, but there are also too many unfortunate missteps to allow for a higher score. Let's look at the missteps first. The main problem with the film is that screenwriter Alan McElroy and writer/director Mark A.Z. Dippe tried to squeeze far too much plot and too many characters into a 90-minute film. In retrospect, it would have been better to make one film covering everything up to Spawn's transformation (or the beginning of the transformation), and then save the other material (which comprises the bulk of the story here) for later films. Maybe Todd McFarlane, who created the comic books upon which this film was based, was worried that he wouldn't receive funding for sequels, so a multi-film plan wasn't attractive. As it is, there have been no live action sequels to date (there have been animated versions of Spawn), but I think there may have been if the first film would have been handled differently. As the film stands, too much time has to be spent explaining the plot. The A6 plot is complicated enough, but there is a very high-concept idea behind the creation of Spawn that also has to be explained, too. Also, a lot of characters, most critically Cogliostro (Nicol Williamson--one of my favorite character actors), are basically wasted. There just isn't time to get into them. A further problem is that both Sheen and White use odd affectations in their speech. I suppose it's supposed to be over-the-top in a comic book way, but on this last viewing, at least, it was more distracting to me. Also, a lot of the cgi-heavy effects already look very dated, and there's a weird cheesiness to most of the scenes in Hell. On the other hand, I personally like that kind of weird cheesiness, so I didn't subtract any points for that. And speaking of weird cheesiness, I'm sure a lot of people hate John Leguizamo's character in the film (Clown/Violator), but I love it. It's exactly the kind of surreal campiness--part horror, part humor--that I cherish. As Mike Mayo has said, he's like (an evil) Krusty the Klown on acid. That works well for me, but if you're not the kind of person who loves films like Killer Klowns from Outer Space (1988), you probably won't like this Killer Klown either. There is also a great campy quality to the material overall, including some of the dialogue (a scene where a father yells at a son in \"Rat City\" for spitting out a meal they retrieved from the garbage because it's \"wasting good food\" is a treasure). Spawn, the comic, is really a bizarre amalgamation of a number of different influences, from horror to twisted fairy tales, and the film is not afraid to indulge in that. The best part of the film, though, aside from Leguizamo's character, is Spawn as superhero. The costume and devices of the costume are fantastic, the cgi for the costume is excellent (I especially loved the cape), and White (as well as the stunt person(s)) does a great job physically. All of the action sequences involving Spawn were incredible. I wanted to see a lot more of that kind of material. In fact, the visual style of the film overall is admirably creative, all the way down to the opening and ending credits. In the end, the film teeters between being something that's \"so bad, it's good\" and being just a good film with some unfortunate flaws, but in either case, it's still very enjoyable to watch. You just need to approach it not expecting a realist dramatic masterpiece, but rather with a love for the absurd.",
         "I'm not sure if the Spawn comics really can be adapted to a film medium. To sum it up: you have a murdered CIA hit-man who makes a deal with a devil, comes back as deformed creature with strange powers, and has to deal with a psychotic demon in clown form. Umm, yeah. Maybe Sam Raimi or Guillermo Del Toro could'be made such a film, but alas, they didn't, and the result is an inept production. I'll start with the good points; John Leguizamo is perfect as the Clown; both over the top and malevolent. And a few of the visual effects are impressive. And there were a few nods to the comics (Sam and Twitch making a cameo at the end). But that's about it. Here's every other problem: 1. Michael Jai White just sucks as the lead. He's terrible. His interpretation of Spawn is not particularly heroic, or anti-heroic, or likable, or has any character moments, but is just an angry guy yelling: \"I'mma gonna kill Wynn! Arrgg!! These powers rock!\" Gone are any of the philosophical underpinnings of the character. 2. Hell and the devil Malebolia - laughable, laughable. They could've at least animated the devil's mouth to move in sync with his voice. If this is hell, I just laugh at it. And for those who say \"Hey, it was 1997; those were the visual effects of the time,\" I say look at Independence Day, Space Jam, and Titanic, all films made around the same time with superior effects. 3. Martin Sheen, whom we all know is a good actor, adds little to the Wynn character. He concocts an idiotic plot about inserting a bomb in his heart, so that no one will dare kill him. This plot line isn't in the comics, but even if it was it would still've been idiotic. Doctors are really going to insert a bomb in someone's heart and not think: \"Gee, this guy's gonna die someday, so there's no question this bomb will go off and kill people someday?\" 4. Child actor Miko Hughes shows up in a subplot, and has to look for Spawn's dog. WTF? It's like the producers realized \"We should make this more family friendly by giving Spawn a kid sidekick,\" but then realized there really wasn't anything he could do, so they had him go look for a dog instead. 5. And after all this, we have a mess of a climax. Spawn fights off the Clown in Hell by transporting through the fireplace! And then we get the big cliché about ending with a shot of Spawn looking out on the city he will now protect. Please. An unsatisfying ending, due to zero character development or reason to care about any of the \"saving\" that Spawn did throughout the movie. But there is some good in the world: after all, I walked out of this knowing that if any demonic Clown comes after me, I sure can count on Spawn to decapitate him for me. And if my dog ever runs away, I can count on Miko Hughes to find him for me. And if I ever get confused during a movie, I can count on Nicol Williamson's tacked-on voice-over to provide exposition. And finally, if I ever go to hell, I know I can look forward to a place filled with cartoon characters. YEE HEE!",
         "Everyone seems to agree that the original Spawn comic is excellent material for a pointless, violent, stupid and thoroughly amusing movie. This movie, however....It isn't all that violent (if you compare it to the comic book), but it is stupid and utterly pointless. Amusing? It could have been if they had inserted a prolonged torture scene of John Leguizamos Clown character: one of the most un-funny, irritating and tacky \"comic relief\" characters ever to have (dis)graced the screen. Move over Chris Tucker and Pauly Shore - we have a new candidate for overrated quasi-comedian of the decade. The special effects were kind of confusing - half of them were excellent and half of them looked like beautified Sesame Street animations (the demon \"thing\" of hell, for example, which had me crying with laughter). Let's hope for the next Spawn movie they take a few chances and make a grittier downbeat tale with more in common with the original comic and not like the muppet show from hell.",
         "The first time I saw this...well, I wanted to like it. I had rented it probably as soon as it came out on VHS. I hadn't read a Spawn comic but knew one thing, he was a badass and a lot of people liked the comics. I had high hopes. Boy, was I disappointed. Now as the time has passed and I've gotten older, I've tried to like it for different reasons. For the campy aspect of it, for Leguizamo's part, for anything...I still don't. The effects are what they are, and you can't do much with a budget too low for your aspirations when it comes to a work like this. As it is, the suit and cape look pretty good, but it seems like those are the only things that any money were spent on. However, that is the least of my concerns for Spawn. The acting is...in a word...atrocious. No one other than Leguizamo has any fun in this thing. He's like the guy at a crappy party that says, \"Hey, screw it. I'm gonna have a good time whether the rest of you guys are or not!\" Did I like his performance? Not really, but you have to give him credit for trying. That's more than I can say for the rest of the cast, crew, pretty much anyone else associated with this. Jai White is awful. The script doesn't help him at all but he was just the wrong choice. That said, there probably weren't too many African-Americans at the time that folks thought could pull it off, so he was chosen. Wrong choice, but I guess you do what you have to. Sheen was so bad I had to watch Apocalypse Now again just to get the vision of Spawn out of my head. Sweeney and Randle....who? They were in this thing? See what I mean? The movie should NOT have been PG-13 either. We know well enough these days that even when a movie is put out in a director's cut on DVD with an R rating that it doesn't help much. Spawn should have been a \"hard R\" all the way from the get-go. It also could have helped itself being a bit longer, say 2 hrs total. But maybe it's the best thing that Spawn only tortured us for 90 mins. Any more of Spawn the way it is and you wind up thinking too much about Death's sweet release. Like I said, I really wanted to like it. I watch it when it comes on FX or whatever other TV channel just to see if I can find a reason to like it, so maybe I won't feel the disappointment I felt the first time. It never works...and it never will.",
         "I remember seeing this film as a kid, and i remember it being pretty bad-ass. Joining IMDb, and seeing it at a 4.9, I was astonished. But having been over twelve years, I decided to go out and buy the Director's cut. Just to be blunt, it's nowhere near worthy of the rating it's at. But, there is quite a bit of wasted potentiality. I'll start off with the good, which really there is a lot of if you think about it. First off, if you're really into action, look no further because this film sports a nice amount of it. And the basic premise is pretty interesting, but even the director's cut clocks in at under an hour and forty minutes , so it fails to dive any deeper than it certainly could've. The cinematography is by Guillermo Navarro, who many of you probably know from his work with director Guillermo del Toro ( \"Blade 2\", the \"Hellboy\" series, \"Pan's Labyrinth\", etc.), and he does a bang up job. With the right direction this could have been a masterpiece by all means. Mark A.Z. Dippé knew and carried out the bare minimum of film making, and if you look into it is busy now-a-days with animated Garfield productions. What a down grade, huh? About 90% of the visuals are pretty damn good actually, and the acting as it is is all right. For these things alone, I enjoyed this movie, where as I despised \"X-Men Origins: Wolverine\" for its predictable generic storyline and overly done flashy effects. Michael Jai White was far from terrible and John Leguizamo was pretty terrific if not a bit cartoony at times. The bad points really hit this film hard. The pacing, attuned to its short run time, zooms by way too quickly with annoying video game like transitions and a score that didn't fit the film too well. Every time I was expecting more to be developed, I was let down. \"Oh, this is a cool plot line-wait, what, we're moving on already? oh..okay..\". And lastly, amongst 90% of the great CGI and make-up, the battle in hell is painstakingly terrible. They should've gone with an elaborate set and CGI here and there, but it becomes hopeless so you have to sit threw what you would call a lackluster climax. But for what it is, I highly recommended this movie for its dark humor and awesome action.",
         "I saw this movie after I had seen the animated mini-series, and let me say I am sorry to have seen it all. I never really followed the comics, but after witnessing the genius of the animated version, I could never have imagined that it was possible to ruin such a good character and story so thoroughly and completely. It is flashy, campy, and ridiculous. The acting is terrible, and the effects are just terrible. The movie manages to create a completely inappropriate atmosphere and does nothing to reveal the depth and darkness of the title character. Dump this in the garbage and watch the mini-series.",
         "There are moments in Spawn that stand out with exceptional creativity, but what truly stands out about the movie is just how much of a mess it is. The screenplay is a wreck, the acting is stiff and unconvincing, and the whole thing seems to fly by so fast, that we don't get a chance to experience much other than a look at some nifty visuals. In fairness, I suppose it is easy enough to argue that Spawn delivers its share of action sequences for a ninety minute movie, but perhaps it needs to back down a bit. It needs more story. In the end, Spawn feels like nothing more or less than an exercise in CGI and make-up effects. It is pretty difficult to get involved with the story, in part because it makes no sense, but mostly because we simply do not care. The character of Al Simmons is about as cheap and plastic as the armour he suits up in during the second half of the feature. Quite frankly I don't find him all that likable. He is cold and nasty, even as a superhero. I really hate it when the good guys talk like the bad guys; when they cackle or make snarly remarks, like Dr. Westlake in the Darkman series. Some of the special effects work, some don't. Our hero has a blood red cape which can expand to the size of Texas (don't ask me how). I liked that effect. The thing sort of has a computer generated life of its own, and its elegance clashes with the plastic of Spawn's armour. the primary villain is a clown from hell, who can turn into a ten foot armour plated beast which looks a bit like a cousin of the Queen from Aliens. That is another good effect. The climax takes us deep into the fiery pit of hell, which unfortunately does NOT so convincing. My screen saver is a more intimidating computer generated image. I was reminded a bit of the Brinstar level from Super Smash Brothers. Like so many films do, Spawn ends on a note that just cries out for a sequel. Needless to say, there isn't one and there never will be. Spawn is entertaining in parts, but definitely not as a whole. In more competent hands, this could have worked....but it doesn't",
         "\"Spawn\" is a special effects spectacle unlike anything before it. It has some dazzling CGI effects to complement its dark tone and breathe life into the Gothic fantasy, and wondrous cinematography to carry it out. Unfortunately, that's all it has to offer, which is a real shame, because this had the potential to be one hell (pun intended) of a movie. As a reader of \"Spawn\" comics and collector of \"Spawn\" merchandise (and affiliated McFarlane Toys products), I saw at an early age how \"Spawn\" revolutionized the comics industry with its mystical premise, graphic visuals, Heaven vs. Hell battle theme and gratuitous sex and violence, and while such gusto has been embraced by fans, this 1997 film adaptation of Todd McFarlane's popular underground comic, directed by Mark A.Z. Dippe', is rated \"PG-13\" (subsequent home video versions were of the \"R\"-rated director's cut, which contained additional footage), the watered-down violence more cartoonish than graphic. In short, in the comic book world, Spawn is not like anything else out there. The story is that the demon Malebolgia needs fresh souls for his ever-growing army of undead soldiers to lead an eventual conquest of Earth, and then, Heaven, in what will eventually bring about Armageddon. All Malebolgia needs is a general for his army, and, Holy Lazarus, recently deceased CIA operative Al Simmons (newcomer Michael Jai White) has just the extra-crispy corpse for the job. See, Simmons was set up by his insane former employer Jason Wynn (Martin Sheen) after making a bargain with Malebolgia's go-to guy and Earthbound lieutenant, the pudgy, disgusting Clown (John Leguizamo, completely unrecognizable in his get-up), to kill Simmons so that he would be sent to Hell. While in Hell (which looks like a CGI version of a Marilyn Manson concert on steroids), Simmons makes a deal with Malebolgia to lead his army, in exchange for one last chance to see his wife Wanda Blake (Theresa Randle), who is now married to his best friend Terry Fitzgerald (D.B. Sweeney) and together the two now have a young daughter named Cyan (Sydni Beaudoin). Back on Earth and unaware that five years have passed, Simmons has a burnt-to-a-crisp visage that doesn't sit well with people not accustomed to undead soldiers from Hell. He establishes sympathetic links with the homeless denizens of alley Rat City, chiefly young Zack (Miko Hughes), and is watched over by the Godsend Cogliostro (Nicol Williamson). When Simmons's body comes out of its larval stage and transforms him into a \"Hellspawn,\" a being with an endoplasmic and invincible suit of armor, he sees his chance to use these new powers to exact vengeance on Wynn, his lethal vixen Jessica Priest (Melinda Clarke), reunite with Wanda, and seek a way to break out of his agreement with Hell. As stated earlier, \"Spawn\" is one hell of a special effects spectacle, and it looks great, but a lot goes wrong in too many places. I was dazzled to see one of my favorite superheroes on the screen nearly 10 years ago as an impressionable pre-teen. Now at 21, I am sorely disappointed by what I see today. \"Spawn\" still could have been good, even without with the full-on graphic content and Heaven & Hell mysticism of the source material. While a largely accurate reflection of the comics, it still gives more credence to my assertion that this is \"Spawn\"-lite. Presumably, studio bosses weren't keen on marketing a Hellbound superhero to the masses, so measures were probably taken to make the vehicle more accessible. (Take my advice and stick to the animated HBO miniseries.) On the plus side, Michael Jai White makes an efficient hero and this remains the actor's most well-known part. We do feel his pain (even if it seems forced at times), his quips, and overall faithful portrayal of the character. Sheen makes for a coolly sadistic madman but it's Leguizamo who steals the show. His gross-out-humor, maggot-munching portrayal of the Clown is just what takes this movie out of the dregs and into full-blown camp territory. Lastly, the soundtrack, a mix of heavy metal and techno, does have some pretty wicked sounds. It's easy to see that only core fans will want to stick with this picture. It had such a great chance to be something unlike anything else out there. With the comic book craze still in full swing in Hollywood, \"Spawn\" seems forgotten, or at the very least, sitting on the sidelines. But \"Spawn,\" to me, seems to be an example of mis-marketing, a brilliant idea gone haywire. Maybe it should have stayed in Hell, where it belongs. 5/10",
         "Take a great story about someone being damned for his sins and brought back as a demon. Then take out all the spooky dark stuff and add a bunch of sweetness-and-light tenderness that adds absolutely nothing to the story. Tone down the comic-book atmosphere to a more believable level, something around the level of the town of Mayberry. What you're left with is a watered-down, listless waste of time that's guaranteed not to offend anyone, and has all the entertainment value of a cup of oatmeal. I can almost see a bunch of guys sitting around a table, discussing a live action version of \"Spawn\", and then someone says \"But let's make it a lot more like 'Lassie Come Home' so people can take their kids to see it.\" Stick with the animated version, don't waste your time and money on this saccharine yawn-fest."
      ],
      "genres": [
         "Action",
         "Horror"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Pull Down Your Pants Pictures",
         "Todd McFarlane Entertainment"
      ],
      "summaries": [
         "An assassin named Al Simmons is double-crossed and murdered by his evil boss Jason Wynn. Al makes a deal with the devil and returns to earth as Spawn to see his wife. He is ordered by the devil's minion, The Clown, to kill Wynn. Wynn has made a deal with the clown too and is suppose to destroy the world with a deadly virus that will help start Armageddon and allow Hell to attack Heaven. Spawn must choose between Good & Evil.",
         "The movie adaptation of Todd McFarlane's mega-cult comic! Al Simmons is a hitman who works for the government. One day, someone sets him up and he gets killed. Of course, he goes to Hell, where Malebolgia - the Devil himself - offers him a deal. Al will come back to life with a certain amount of \"energy\", but when it runs out, he will return to Hell as a Hellspawn, and help in the war against Heaven. Al accepts the offer, because of the love for his wife Wanda, but when he arrives to Earth he sees that the Devil has cheated him... His face is horribly distorted, his body covered with a living suit, and the worst of all; he finds Wanda married with his best friend. Shattered, the Spawn starts wandering in New York's alleys...",
         "Based off of Todd McFarlane's Comic Book, Lieutenant Colonel Al Simmons who is a secret agent of an organization called A-6, run by Jason Wynn. However, during an operation, Simmons was Double-Crossed by Wynn himself and was killed and sent to the devil's world. The Devil kept Simmons secluded for 5 years, then Simmons came back as \"Spawn\", having very little memory, only remembering his wife, Wanda and Wynn. He is sent to kill Wynn. Meanwhile, Wynn is secretly planning for world domination, and has ordered special doctors to implant a detonator for a deadly virus into his heart if anybody kills him. Then, Spawn finds out that it is a plan by the devil to kill everybody in the world. So that the devil's army is purified and they can destroy heaven. Spawn must stop Wynn and Clown (the devil's assistant) from destroying the world.",
         "Al Simmons, is a military soldier/assassin, who has been betrayed by a covert government agency head named Jason Wynn. Wynn orders his top assassin, Jessica Priest, to assassinate him. After Simmons dies, he is immediately transported to Hell, where Malebolgia, a demonic ruler of the various realms, offers him a Faustian deal. If Simmons becomes his eternal servant and leader of Hell's army in Armageddon, he will be able to return to Earth to see his beloved fiancee, Wanda Blake. And Simmons accepts the offer and is transformed into a Hellspawn, which is a servant of Malebolgia in a necroplasm suit that is not only a living, breathing creature, but is also his only protection in the world. Simmons (soon to be dubbed \"Spawn\" by Malebolgia's crony, The Violator) returns to Earth and attempts to reunite with Wanda, not knowing that five years have passed. He also seeks revenge on his former boss and killer, Jason Wynn, who has made a deal with The Violator to develop a lethal virus to take over the world, where Wynn is promised to be king.",
         "A mercenary is killed, but comes back from Hell as a reluctant soldier of the Devil."
      ],
      "budget": 40000000
   },
   "movielensId": 1591,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-07-31",
      "dvdReleaseDate": "1998-01-06",
      "directors": ["Mark A.Z. Dippé"],
      "runtime": 96,
      "movieId": 1591,
      "title": "Spawn",
      "mpaa": "PG-13",
      "actors": [
         "Michael Jai White",
         "Martin Sheen",
         "John Leguizamo",
         "Theresa Randle",
         "Nicol Williamson",
         "D. B. Sweeney",
         "Melinda Clarke",
         "Miko Hughes",
         "Sydni Beaudoin",
         "Frank Welker"
      ],
      "imdbMovieId": "0120177",
      "originalTitle": "Spawn",
      "genres": [
         "Action",
         "Adventure",
         "Fantasy",
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Rpr7TTnXty8"],
      "plotSummary": "After being murdered by corrupt colleagues in a covert government agency, Al Simmons (Michael Jai White) makes a pact with the devil to be resurrected to see his beloved wife Wanda (Theresa Randle). In exchange for his return to Earth, Simmons agrees to lead Hell's Army in the destruction of mankind.",
      "tmdbMovieId": 10336,
      "avgRating": 2.64541,
      "releaseYear": "1997",
      "numRatings": 6437,
      "posterPath": "/tfvH5YKXtMiBgkj0FNozQj4TQyp.jpg"
   }
}