{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "clown",
            "id": 3199
         },
         {
            "name": "golden retriever",
            "id": 158386
         },
         {
            "name": "dog actor",
            "id": 158387
         }
      ],
      "imdb_id": "tt0118570",
      "video": false,
      "title": "Air Bud",
      "recommendations": [
         21661,
         21518,
         20755,
         24794,
         13962,
         26441,
         9973,
         14444,
         24795,
         9446,
         25059,
         11870,
         11888,
         17709,
         68927,
         17711,
         11497,
         19933,
         13908,
         19042
      ],
      "backdrop_path": "/lBkZWcYhjFImLhLnaMd6RoO3jos.jpg",
      "revenue": 23144499,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Josh Framm",
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084d1",
               "name": "Kevin Zegers",
               "profile_path": "/8IZWHzUElVhAyRqzWiCXzf7MHL4.jpg",
               "id": 7431,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Jackie Framm",
               "gender": 1,
               "credit_id": "52fe43f7c3a368484e0084d5",
               "name": "Wendy Makkena",
               "profile_path": "/9Nx0N6vQP3czBYSiRgAZbETqAiC.jpg",
               "id": 20623,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Norm Snively",
               "gender": 2,
               "credit_id": "586bea799251415d24007c7c",
               "name": "Michael Jeter",
               "profile_path": "/kCFHCa8Uy4rsgbzWxPCu8xSut6A.jpg",
               "id": 2169,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Arthur Chaney",
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084d9",
               "name": "Bill Cobbs",
               "profile_path": "/cP2ETKFdk93z4e1oXZVG0utI3IM.jpg",
               "id": 8854,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Larry Willingham",
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084dd",
               "name": "Brendan Fletcher",
               "profile_path": "/pt6kjBmnhamO1nvc1YqX3AczYpS.jpg",
               "id": 32205,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Buck Willingham",
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084e1",
               "name": "Norman Browning",
               "profile_path": null,
               "id": 86527,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Judge Cranfield",
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084e5",
               "name": "Eric Christmas",
               "profile_path": "/dCs1h8vhRjNNfmJeHuVgcVE6ZwI.jpg",
               "id": 4976,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Principal Pepper",
               "gender": 1,
               "credit_id": "52fe43f7c3a368484e0084e9",
               "name": "Nicola Cavendish",
               "profile_path": null,
               "id": 86528,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084c1",
               "name": "Charles Martin Smith",
               "profile_path": "/fahfWqqrdJwajrfEGmEOXQ1p9bm.jpg",
               "id": 1270,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084c7",
               "name": "Paul Tamasy",
               "profile_path": null,
               "id": 86525,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e0084cd",
               "name": "Aaron Mendelsohn",
               "profile_path": null,
               "id": 86526,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54b40d5692514114a2004332",
               "name": "Richard Trus",
               "profile_path": null,
               "id": 1410526,
               "department": "Visual Effects",
               "job": "Visual Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.033563,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 20737,
      "vote_count": 138,
      "budget": 3000000,
      "overview": "A young boy and a talented stray dog with an amazing basketball playing ability become instant friends. Rebounding from his father's accidental death, 12-year-old Josh Framm moves with his family to the small town of Fernfield, Washington. The new kid in town, Josh has no friends and is too shy to try out for the school basketball team. Instead he prefers to practice alone on an abandoned court, he befriends a runaway golden retriever named Buddy. Josh is amazed when he realizes that Buddy loves basketball...that is playing basketball...and he is GOOD! Josh eventually makes the school team and Buddy is named the Team Mascot. Josh and Buddy become the stars of halftime. Buddy's half-time talent draws media attention. Unfortunately, when Buddy's mean former owner, Norm Snively, comes along with a scheme to cash in on the pup's celebrity, it looks like they are going to be separated.",
      "similar": [
         11360,
         700,
         16296,
         761,
         136,
         24808,
         46302,
         11715,
         277963,
         344528,
         99833,
         515531,
         117820,
         473049,
         356496,
         393208,
         212286,
         417784,
         345791
      ],
      "original_title": "Air Bud",
      "runtime": 98,
      "poster_path": "/ny0lBB66RdnhIkfzsqpLl2suQaY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1997-08-01",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": "/3iROV2GdrAFz6lbrGneQLt8lc7K.jpg",
         "name": "Air Bud Collection",
         "id": 97445,
         "poster_path": "/6uJ2GXA5kBskJx6emTuHyp2S3ww.jpg"
      },
      "tagline": "He Sits. He Stays. He Shoots. He Scores.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Charles Martin Smith"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Kevin DiCicco",
         "Paul Tamasy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118570/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0NzYzNDE4M15BMl5BanBnXkFtZTcwNTg4NzQzMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Jeter, Kevin Zegers, Wendy Makkena | See full cast and crew »"],
      "reviews": [
         "Since most kids' movies are horrible, parents dread having to sit through them alongside their children. But this is harmless, feel-good fun that even a parent can stomach. It's a tad unbelievable, and some stunts are all too convenient, but so what? We can all suspend a certain amount of disbelief and enjoy a movie, right?",
         "This is the kind of movie that will be remembered forever. This movie was done perfectly and I have no negative thoughts about it. They chose the absolute best music for this movie and I don't think anyone could have chose better. It needs to be remembered, they should make it on a special edition DVD. Even though they have come out with tons of Air Bud movies after this, the original one will always be the best. The Sadest part in the whole movie is the part when Josh leaves Buddy stranded on the other side of the river. This will always be my favorite movie, and nothing will ever change that. I give Air Bud a 10 out of 10 for great humor, sadness, and music. Great Job!",
         "'Air Bud' is one of \"doggy\" movies so much in fashion in its time. And it's surprisingly underrated. This is by no means a comedy, although it has its funny moments. It is dramatic, more than anything. In fact, this is often a depressing film but joyful at the same time. Unlike its sequels, this one has a clever plot (a sentimental one, I'd say). It's heartwarming, in the line of others like this such as 'Old Yeller', 'Homeward Bound: The Incredible Journey', 'Napoleon' and 'Fluke'. Despite the title, the story isn't just about our very dear canine friend Buddy (even if he is the main star). The story also focus on Josh Framm, who is a crucial character, together with the dog. After all, they are destined to be best friends. Josh is Buddy's salvation, but Buddy also plays an important role to save Josh's life. Buddy escapes from his alcoholic and aggressive owner and finds a peaceful life with Josh. On the other hand, Josh gets over depression and shyness thanks to Buddy, which gives the him will to live and brings back Josh's lost interest in basketball. That's when the movie's most original thing happens: Buddy can play basketball! That is just amazing! Like everybody else in the movie, to see the dog playing basketball leaves me speechless. That dog has an incredible talent for basketball and even more unbelievable is that he never fails. He's a much better and natural-born player than the humans themselves. He becomes the mascot of Josh's basketball team... which brings them lots of luck. The beauty of this movie isn't just in the dramatic story, but also in the friendship between Josh and man's best friend. Plus, Buddy is a Golden Retriever, my favorite dog breed. Golden Retrievers look so friendly and pacific. They are in fact. They are among the world's sweetest and most beautiful dogs. But the magnificent scenario also gives beauty to the movie: rivers, green places, a nice village. All of this is very well combined with soft, relaxing and beautiful piano music (like in \"Fluke\"). Tom is an eccentric boy who always carries minor pieces of garbage to give him luck. It is, however, a bit disturbing to see that Joe coach throwing him numerous basketballs, causing the boy to shake nervously and feel very tired. Larry, although constantly picking on Josh, isn't really annoying or stupid. He is more of an arrogant and jealous guy than actually mean. Despite having some deeply touching moments, the most heartbreaking moment of the movie is when Buddy crosses the river and tries to follow the river boat which Josh catches. That scene always makes tears come to my eyes. As for the cast, Kevin Zegers (a sports boy in real life, just like Noah Hathaway) is wonderful in the role of Josh Framm and Buddy the Dog is simply fantastic as Buddy. I was so sad when I found out that Buddy died. He was a friendly, adorable, beautiful and very talented dog. The little girl who plays Josh's cute little sister (whoever she is) is alright either. But I don't like some of the characters at all. Norm Snively is a drunk, abusive man and a loser as a clown. Coach Joe is a jerk and unkind. Larry's father is a jerk and a hypocrite. This should definitely be on Top 250.",
         "The first of the 'Air Bud' series is as much wonderful as it is horribly underrated, truly a 90's classic. It has a dignified place in the list of the greatest animal movies as well. In many ways it is a depressing movie but it's also heart-warming, touching, feel-good and tons of fun. There's more to it to like, though. Cinematography is really beautiful and pure. The soundtrack is just perfect for this film. The boy and his devoted four-legged friend make a marvelous team and have a perfect chemistry. Even though the film's title obviously refers to the dog, his name is actually Buddy - that is, once he ends up in the hands of Josh Framm. Even as the movie starts, the little we see is enough to realize how horribly the clown treats his dog (constantly yelling at him, threatening him and hitting him hard with the newspaper). It is heartbreaking to see that. Fortunately, this horrible man accidentally loses him and he finds Josh Framm (a, I assume, 12-year-old who is loving and caring but very shy and silent and currently under depressive mood). They quickly become best friends, as Josh gives him the treatment he deserves. Buddy is a very special dog alone, but he has a special secret that makes him even more special: he can play basketball (even more amazing, better than humans can!). Even though the clown is a horrible person, he doesn't have that much of a role. He is not someone I sympathize with and he certainly isn't funny, although it is hilarious when his truck falls apart and he can't stop it and accidentally drives it into a river. Larry Willingham's father is a jerk. Even though Larry unfairly picks on Josh, at least he isn't too bratty and is funny at times. But Larry's father, that guy is such a jerk, although not overly annoying. Coach Joe isn't especially sympathetic because he is very impatient and temperamental, but he goes too far when he throws basketballs at Josh's peculiar friend Tom with aggressiveness. The movie is focused more on Josh and Buddy, who are the most likable characters of the movie. Kevin Zegers is flawless as Josh Framm. Buddy the Dog is amazing as Buddy (may this wonderful dog rest in peace, wherever he is now). Brendan Fletcher does a good job as Larry. So does Shayn Solberg as Josh's good friend Tom. The late Eric Christmas is hilarious as Judge Cranfield. Title in Portugal: 'Air Bud'.",
         "[CONTAINS SPOILERS] Norman F. Snively and his dog Buddy worked as a clown act, Clown and a Hound. They arrive to do a child's birthday party. Norm isn't really a very good clown and Buddy ended up upstaging him so the two are thrown out. Norm throws a temper tantrum then says he's taking Buddy to the pound but on the way, Buddy's crate falls off the back of the truck and lands in the street. It's nearly run over by a car containing the Framm family who were new to Fernfield. There was mom, Jackie and her children Josh and Andrea. Josh had lost his father a year ago and it looked as though his new life in a new town would be dull. At school, they tried enrolling him in an extra-carricular activity, like band, but that didn't work out very well. On his way home, he found a basketball court in the back of an old, abandoned church so he began shooting hoops. That's when he met Buddy who didn't come very close to him. Josh decides to try out for the basketball team at school and surly Coach Barker makes him a waterboy. When Josh is sent downstairs to wash a load of jerseys, he learns that the school custodeon was in fact Arthur Chaney of the 1956 New York Knicks! When shooting hoops in the court the next day, Josh saw Buddy again and to Josh's surprise, Buddy could play ball so they played around the court for a while then Josh brought him home and tried to give him a bath and hide him from Jackie, but she soon found out and said keeping him was out of the question, but Josh got Buddy an old refrigerator box to sleep in in the backyard. Jackie agreed to let Buddy stay until Christmas which was two weeks away. So soon Christmas morning arrives and Josh runs downstairs to find Buddy under the tree with a big bow on his head. Josh was ecstatic! At school, Josh tried out for the team and to his surprise, he made it! In the mornings when Jackie went out to get the newspaper, it wasn't there. That's because Buddy would snatch it and bury it. Soon Josh learns that not only can Buddy pass the basketball around but he can shoot hoops! Buddy becomes a team mascot. It was that afternoon that Coach Barker was seen throwing basketballs at a teammate and the principal frowned on that so Barker was fired. Josh suggested the replacement coach be Arthur Chaney, who jumped at the chance. He taught the children about teamwork and sportsmanship. Buddy got to play in an actual game. Things were really looking up! Buddy made news stories all over town, which unfortunately Norm got wind of so he stopped by the Framm house and reclaimed Buddy. Josh was devastated but he made a plan to go get Buddy and make it to the big game. Josh sneaked into Norm's backyard, unchained Buddy and the two escape. Norm sees, jumps in his faulty old pick-up truck and gives chase. They run all the way to the shore. That's when the brakes give out and Norm drives right into the river. That evening, Josh and Buddy play in the big game and WIN!! That's when Norm showed up and decided to take this to court. After much deliberation, the judge decided, well actually Chaney convinced him to let Buddy decide who his master should be. The judge allowed it. Buddy bit Norm then chose Josh so they all lived happily ever after. This movie is pretty good. It has it's funny moments. I'm sorry to say that Buddy the dog is no longer with us. He died after the film's release. From surgical complications or something. Other members of the cast include Michael Jeter as Norm. Why does he always get calls to play weirdos and crazies??! Bill Cobb is here too! Air Bud is followed by a seemingly endless line of sequels! Air Bud II: Golden Receiver in 1998 in which Buddy plays football, Air Bud III: World Pup in 1999 where he plays soccer, Air Bud IV: Seven Inning Fetch in 2002 where he plays baseball and coming soon: Air Bud V: Air Bud Spikes Back. Notice anything familiar about that title? Hmm? I assume he plays football again. I saw Golden Receiver. Wasn't that great. I didn't see World Pup or Seven Inning Fetch. I wonder what he'll play next. Hockey? Golf? Foosball? Oh well. Future Air Bud movies will tell, I guess. But anyway, if you like animal comedies and good family movies, then I recommend Air Bud! He sits. He stays. He shoots. He scores! -",
         "I loved this movie when I was a kid, and even back then I had little idea why. I mean, it wasn't like I thought it was particularly funny or touching or anything like that. I guess I just really liked the basic premise, because you have to admit the central idea is pretty weird and nutty. How stoned do you have to get before you come up with a dog that plays basketball? How would that even remotely work? I'm really putting too much thought in this movie I guess, but it's just so bizarre that I've always found it very entertaining. I've learned the sequels actually stretch the premise even further and involve dogs that can play soccer, baseball and volleyball, but this one will always be the one and only original \"dog does weird athletic stuff it can't possibly do\"-flick.",
         "This is a good movie for younger kids despite some brief mild language. The dog playing basketball just doesn't make sense to me though. I could take the ball away from the dog and its not like he has the height advantage. If you have small kids they would enjoy it.",
         "A young boy who's father has passed away moves to a new town with his baby sister and mother, with little hopes of making new friends or getting over his father's death: until he finds a dog who can play basketball! Turning suddenly from being an incompetent water boy, whom only dreams of joining the school basketball team, to an admirable young athlete with his great new dog, Buddy. A mildly entertaining afternoon special for kids. With it's innocence and slitly comicle charm, this movie, like all other afterschool specials has it's moments. I wouldn't say it was funny, it dosn't have what most of the modern day kids or pre-teens are looking for in their entertainment: Bombs going off, blood, martial arts or showy costumes. It's the type of thing for a family with three or four children of mixed ages to watch with their mother before nap time. Isn't obscene like most movies even a nine year old might watch these days, yet isn't Barnie or Elmo either.",
         "I wasn't expecting Air Bud to be all that good, after the disappointment of the other kiddie film, Soccer Dog, but I found this film weirdly impressive, to be quite honest. Josh (Kevin Zegers) is an introverted 12-year-old whose test pilot dad has been killed, necessitating a family move to the leafy Washington suburb of Fernfield. Here, he meets Buddy, a stray retriever, who can score baskets with his nose and is adopted into the family home. Buddy's ball skills soon cheer Josh up and ingratiate him with his peers, and they both make the Timberwolves school team. Conflict arrives in the form of Buddy's previous cruel owner Snively (Michael Jeter), a children's entertainer of the Fred West school. The direction is sloppy, the actors overact and the result is cheese on a stick, but Air Bud still manages to entertain adults and children throughout the perfectly short running time. The story of a basketball-playing dog is magnificent, and Buddy is an irresistible golden retriever, he makes the film as watchable as it ever will be. You'll cry, you'll laugh and you'll be weirdly uplifted, but don't expect to be absolutely spellbound with Air Bud. But I do still recommend it, that's for sure. I rate Air Bud 7 out of 10.",
         "This movie is undemanding fun. while it's refreshing to see a film that does not rely on -or even use- computer-generated effects, the set-up is that the guy, Michael Jeter, is shown to be a baddie because of his treatment of the dog as his co-star in his crummy clown show. As an audience we must share complicity in this, as 'Buddy' performs for our entertainment, and that dog (and his two doubles) really do score those baskets. But, all political correctness aside, the movie is enjoyable enough. Underused though is the excellent Brendan Fletcher as the 'bad kid'."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Keystone Pictures",
         "Equicap"
      ],
      "summaries": ["A young boy and a talented stray dog with an amazing basketball playing ability become instant friends. Rebounding from his father's accidental death, 12-year-old Josh Framm moves with his family to the small town of Fernfield, Washington. The new kid in town, Josh has no friends and is too shy to try out for the school basketball team. Instead he prefers to practice alone on an abandoned court, he befriends a runaway golden retriever named Buddy. Josh is amazed when he realizes that Buddy loves basketball...that is playing basketball...and he is GOOD! Josh eventually makes the school team and Buddy is named the Team Mascot. Josh and Buddy become the stars of halftime. Buddy's half-time talent draws media attention. Unfortunately, when Buddy's mean former owner, Norm Snively, comes along with a scheme to cash in on the pup's celebrity, it looks like they are going to be separated."],
      "budget": 3000000
   },
   "movielensId": 1592,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-01",
      "dvdReleaseDate": "1998-02-04",
      "directors": ["Charles Martin Smith"],
      "runtime": 98,
      "movieId": 1592,
      "title": "Air Bud",
      "mpaa": "PG",
      "actors": [
         "Kevin Zegers",
         "Wendy Makkena",
         "Michael Jeter",
         "Bill Cobbs",
         "Brendan Fletcher",
         "Norman Browning",
         "Eric Christmas",
         "Nicola Cavendish"
      ],
      "imdbMovieId": "0118570",
      "originalTitle": "Air Bud",
      "genres": [
         "Comedy",
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": ["B17kRwsDojw"],
      "plotSummary": "A young boy and a talented stray dog with an amazing basketball playing ability become instant friends. Rebounding from his father's accidental death, 12-year-old Josh Framm moves with his family to the small town of Fernfield, Washington. The new kid in town, Josh has no friends and is too shy to try out for the school basketball team. Instead he prefers to practice alone on an abandoned court, he befriends a runaway golden retriever named Buddy. Josh is amazed when he realizes that Buddy loves basketball...that is playing basketball...and he is GOOD! Josh eventually makes the school team and Buddy is named the Team Mascot. Josh and Buddy become the stars of halftime. Buddy's half-time talent draws media attention. Unfortunately, when Buddy's mean former owner, Norm Snively, comes along with a scheme to cash in on the pup's celebrity, it looks like they are going to be separated.",
      "tmdbMovieId": 20737,
      "avgRating": 2.34568,
      "releaseYear": "1997",
      "numRatings": 1620,
      "posterPath": "/ny0lBB66RdnhIkfzsqpLl2suQaY.jpg"
   }
}