{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "office",
            "id": 1438
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "secretary",
            "id": 11677
         },
         {
            "name": "misogynist",
            "id": 165288
         }
      ],
      "imdb_id": "tt0119361",
      "video": false,
      "title": "In the Company of Men",
      "recommendations": [
         77469,
         51145,
         18408,
         25985,
         24481,
         42186,
         50916,
         86823,
         41647,
         47841,
         29884,
         24071,
         81792,
         241432,
         26030,
         43122,
         96246,
         32047,
         43802,
         38824
      ],
      "backdrop_path": "/iV9eG4Y35QqmTpdRWtPTuniatAR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chad",
               "gender": 2,
               "credit_id": "52fe46049251416c7506a35d",
               "name": "Aaron Eckhart",
               "profile_path": "/aRSofX2rMpOhPanB9Wh7veYmFn4.jpg",
               "id": 6383,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Christine",
               "gender": 1,
               "credit_id": "52fe46049251416c7506a361",
               "name": "Stacy Edwards",
               "profile_path": "/3FBtBFrmjUx0W0bbKYqW2gpgIkI.jpg",
               "id": 43372,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Howard",
               "gender": 2,
               "credit_id": "52fe46049251416c7506a365",
               "name": "Matt Malloy",
               "profile_path": "/ian5yLWKo8Ttz8kEZIv9GLNCz2c.jpg",
               "id": 19208,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Co-worker #1",
               "gender": 0,
               "credit_id": "54776946925141105e00000b",
               "name": "Michael Martin",
               "profile_path": null,
               "id": 1390109,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "John",
               "gender": 0,
               "credit_id": "54776951c3a368402e000c13",
               "name": "Mark Rector",
               "profile_path": null,
               "id": 1390110,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46049251416c7506a36b",
               "name": "Neil LaBute",
               "profile_path": "/snHfcueBlYFinCdUoVmK9CHdZX0.jpg",
               "id": 58689,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46049251416c7506a371",
               "name": "Neil LaBute",
               "profile_path": "/snHfcueBlYFinCdUoVmK9CHdZX0.jpg",
               "id": 58689,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46049251416c7506a377",
               "name": "Tony Hettinger",
               "profile_path": null,
               "id": 94489,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe46049251416c7506a37d",
               "name": "Mark Archer",
               "profile_path": null,
               "id": 987303,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46049251416c7506a383",
               "name": "Stephen Pevner",
               "profile_path": null,
               "id": 954064,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46049251416c7506a389",
               "name": "Karel Roessingh",
               "profile_path": null,
               "id": 989072,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46049251416c7506a38f",
               "name": "Ken Williams",
               "profile_path": null,
               "id": 203165,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46049251416c7506a395",
               "name": "Joel Plotch",
               "profile_path": null,
               "id": 61192,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.796143,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 14585,
      "vote_count": 51,
      "budget": 0,
      "overview": "Two business executives--one an avowed misogynist, the other recently emotionally wounded by his love interest--set out to exact revenge on the female gender by seeking out the most innocent, uncorrupted girl they can find and ruining her life.",
      "similar": [
         24420,
         1024,
         22152,
         339397,
         979,
         1643,
         8067,
         18168,
         226,
         2142,
         17609,
         429733,
         3134,
         49950,
         298312,
         9093,
         1903,
         4771,
         6075,
         50546
      ],
      "original_title": "In the Company of Men",
      "runtime": 97,
      "poster_path": "/jdg8w5BVEJbakwO1GW7jFQ9EGwC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/jEMVaCuEjQ3lzkhakWDKNVjwd9Q.png",
            "name": "Alliance Atlantis Communications",
            "id": 803,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fair and Square Productions",
            "id": 8809,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-19",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Are all men bastards...or just misunderstood?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Neil LaBute"],
      "runtime": 97,
      "synopsis": "Set in an unnamed Midwestern American city, Chad (Aaron Eckhart) and Howard (Matt Malloy) are two middle management employees at a corporation, temporarily assigned to a branch office away from their home city for several weeks. Howard is assigned to head up the new project and Chad is to assist. After their first meeting at the local airport and after having dinner and drinks, they talk about the history about their failed relationships. Embittered by bad experiences with women, they form a mean-spirited revenge scheme to find an insecure woman, romance her simultaneously, and then break up with her at the same time. Chad, who is cruel, manipulative, duplicitous, misogynist, and abusive to his subordinates and co-workers, is the originator and driving force behind the scheme, while Howard is the more passive of the two, which leads to a later conflict with the scheme. Chad decides upon Christine (Stacey Edwards), a deaf co-worker who is so self-conscious that she wears headphones so people, thinking that she is listening to music, are compelled to get her attention visually or tactilely without immediately learning that she is deaf. Chad and Howard decide to each ask her out, and out of her lonelienss, she accepts. Over the course of several weeks, both of them date her simultaneously. In the meantime, things with the project go wrong; a fax Chad is supposed to have sent to the home office is \"lost\" and a presentation Chad is supposed to deliver to the home office is unable to be carried out successfully after some documents are allegedly printed so lightly that they are illegible. These mishaps culminate in Howard being demoted and Chad taking his place at the head of the project after he places the blame for most of the mishaps on the unknowing and nebbish Howard. Chad eventually sleeps with Chistine, and she falls in love with him. When Christine eventually breaks this news to Howard that she's dating his co-worker Chad, Howard tells Christine the truth about their scheme, and tells her that he loves her. Christine is shocked by the revelation, and refuses to believe that Chad would do this. When she confronts Chad, he admits the truth. Christine angrily slaps Chad, but he is so unashamed of his behavior, and cruelly taunts Christine, who collapses into tears after he leaves her. Several weeks later. Howard confronts Chad back home at his apartment. Howard is now apparently in the bad graces of the company, being moved to a lower floor while Chad is doing well. Chad offers to go to higher managerment to say something on Howard's behalf. Nevertheless, Howard is not worried about work, he confesses to Chad that he really loved Christine and feels ashamed at what they did to her. At this point Chad, despite having previously told Howard that his girlfriend, Suzanne, had left him, shows Howard that she is still there, asleep in his bed. Chad says that he carried out the entire plan \"because I could,\" and he asks Howard how it feels to have truly hurt someone. Howard, who had never done anything like that before, leaves, horrified and angry that Chad used him just so he could steal his promotion as well as hurt an innocent woman just for the hell of it... and now has completely gotten away with it. Howard travels back to the nameless city and to a local bank where he sees Christine now working as a clerk. Howard tries to speak to her, but she ignores him. He loudly pleads with her to \"listen\" to him, but his pleas literally fall on deaf ears.",
      "writers": ["Neil LaBute"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119361/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA1NjYzMDg4NzheQTJeQWpwZ15BbWU3MDA3NTc5MzE@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Aaron Eckhart, Matt Malloy, Stacy Edwards | See full cast and crew »"],
      "reviews": [
         "This movie has no physical violence, but it's truly scary. Chad is evil. He hurts others' feelings for the pleasure of showing himself that he can. He has an explanation for his cruelty, but that's just to draw Howard in to play his game. Without that explanation, he'd still find reasons to be cruel, because his pleasure comes from seeing others in pain. Worse, he can get away with his cruelty, because he is charming, charismatic, and effectively manipulative in his dealings with people. Except in the central plot, he manages to hurt people without taking the blame, by making his victims blame themselves. Howard is both a victim and a willing participant in Chad's evil plot. Without people like him, people like Chad are much less able to hurt others. But people who are too weak to stand in the way of bad people are fairly common. Even those weak enough to be drawn into the plots of bad people are common enough. Even a person strong enough to foil Chad's plot could only have done so if he had known about it, and Chad knew not to trust his plans with such a person. Howard had a chance to be the hero, but he was too weak and became another villain. The central victim, Christine, started out suspicious, but was drawn in by Chad's skillful manipulation, and to some extent Howard's real interest in her. Chad was also good at choosing a victim who would fall for the plot, just as he chose an accomplice effectively. Other victims had other weaknesses that Chad found ways of exploiting, like the man whose speech he mocked in a way that made that victim feel like he himself was to blame. Most people have never met a serial killer, but many have met people like Chad, who enjoy hurting others. The fact that Chad is an example of a more familiar type of evil makes him much scarier. He's more chilling because he doesn't have a clear reason for his badness -- he just enjoys being cruel. What is scarier than an evil that one can imagine falling victim to in everyday life?",
         "Neil Labute's In the Company of Men is an amazing motion picture, one of the best films of 1997 and a shocking indictment of the ego-driven corporate world in which we live. On the surface, the film, expertly written by Neil Labute in his first feature effort, seems to be a cruel tale of misogyny. Lurking beneath the surface, however, is the film's true message, one which depicts the business world as a battle of survival of the fittest, a harsh world where men sacrifice their integrity and compassion in favor of oneupsmanship and greed. Fed up with their failures with members of the opposite sex, two co-workers, Chad (Aaron Eckhart) and Howard (Matt Malloy) decide to play a cruel prank on an unsuspecting female victim. They will both date her, and then after a six-week period, they will dump her, a plan they've devised after years of being tormented and unlucky with women. They eventually choose their prey, a deaf typist named Christine (Stacy Edwards) and begin their quest, asking her for dates, sending her flowers, and sharing intimate moments. All this seems like a pleasant surprise to Christine after years of no dating--but, of course, she doesn't know the plan the men have hatched. I don't want to reveal too much more about the plot than this. I will say that the film has two climactic scenes, one expected and the other inevitable in retrospect. The first climax makes the movie a success, the second makes the film great--only then do we see Labute's true intent. Labute's cast of no-names is uniformly excellent. Eckhart, who has since become a Labute staple, delivers a fascinating performance as a truly despicable character, the smooth and fast-talking Chad. Matt Malloy is excellent as Howard, the \"weaker\" of the two men, and Edwards is great as the hapless deaf typist, presenting her character as likable, intelligent, and sensitive, not just a stereotypical handicapped woman. But the real star of the film is Labute's script. Judging by this, and his three more recent films (Your Friends and Neighbors, Nurse Betty, and Possession--all quality films), Labute is a writer-director to monitor for years to come. A noteworthy comment about In the Company of Men is that it has been marketed as a comedy. Those of you expecting slapstick humor and romantic charms might be better served seeing another movie. In the Company of Men is NOT comedy. There are elements of black humor, especially one particularly depraved scene involving one of the men and an office intern. However, In the Company of Men is more tragic than comic, a look into the tarnished male psyche brought on by years of corporate stress and paranoia. I couldn't help but think of David Mamet's Glengarry Glen Ross, another film about corporate greed in today's world when I was watching this one. However, while Glengarry plays as more of a character-driven mystery and morality play, In the Company of Men is much more insidious, and it offers no solutions in the end. In fact, the final shot of the film is, in my mind, one of the most memorable in modern cinema. Just who exactly has the upper hand?.... 9/10",
         "When I first heard about this movie my main motivation for seeing it was related to the controversy that surrounded it. I had heard all sorts of things said about what a misogynistic piece of garbage this was, but not afraid of a few negative reviews I went and saw it. It's hard to say what impressed me most about this movie. I thought the performances were excellent, the dialogue was sharp and inciteful and the story intense. Aaron Eckhart's narcissistic, callous performance was amazing. I cannot understand how this movie is misogynistic in any way whatsoever, as the characters are so hideous there is no way known you could empathise with them or consider their behaviour as anything other than abhorrent. I thought that the snapshot of the corporate male dominated workplace was fantastic and the picture it painted of testosterone charged males excellent. The ending was amazing and I recall leaving the cinema and not being able to speak for a full 10 minutes. See this movie. 9/10.",
         "This is a riveting movie, but also an unexpected one. I didn't see this until it came out on video, and I had heard a lot about it of course, but luckily I was in the dark on the twist LaBute throws in at the end. Most people got that this was a study of male-female relationships from a wildly off-kilter view, and that was powerfully done. But I think most people missed this is also about the workplace, specifically the Alpha Male in the workplace, and how he got that way. Is it any wonder that Chad and Howard decide to make a game of their seduction of Katherine when it's clear they've had to plan their whole careers as if they were competing in a game of some kind? I think I agree with an interview I saw with LaBute where he said he thought Howard was actually the more despicable character, because Chad is only in it for the game, where Howard starts to take those feelings seriously. Nevertheless, Eckhart's performance makes Chad one of the most chilling characters I've ever seen in movies. Where a lot of movie villains \"indicate\" to let you know they're just acting (which does work when it's done right), Eckhart gives away nothing, so you never know what he's thinking, even if he tells you what he's thinking. I hope he goes on to bigger things.",
         "The film begins with two men in an airport lounge, both discussing how they recently broke-up with their girlfriends. The first man is named Chad (played by Aaron Eckhart). He is seemingly cordial to talk to but behind the smiling facade lies a loathsome, callous, spiteful fellow - one who is ruthless without showing any sign of remorse - in fact, he seems to derive great pleasure and pride from inflicting anguish on others, especially women. The other man is Howard (Mike Mallory), Chad's colleague at work and also a former member of the same college as Chad. Howard is a quieter chap, and seems to just go along with Chad's comments. The two men have just arrived in a new town on a six week stay regarding their office work. Chad suggests that they date the same woman for the duration of the six week stay then dump her. Howard eventually agrees. The woman they pick is Christine (Stacy Edwards), a deaf woman who works in their office block. Chad thinks Christine is the perfect victim, with her being deaf, and mocks her distorted speech to Howard, and refers to her as a 'freak'. The two men start to date Christine, but problems start to arise when Howard bumps into them both in a restaurant. The film displays the start of each of the six weeks with a title and a burst of chaotic music. There are a few memorable scenes towards the conclusion of the film. The film focuses on the dog-eat-dog materialistic corporate world, and some of the envious and vindictive people that exist within it. I don't want to reveal any more, but I recommend you see this troubling film.",
         "When I rented this film I had heard a lot of good things about it. I also heard that it was a comedy. It was in the comedy section. It was promoted as a comedy. IT WAS NOT A COMEDY! This is a very serious film that is sometimes very difficult to watch. Moreover, the ending is very depressing. Eckhart plays the biggest jerk in the history of film. A good movie that you will probably not enjoy watching.",
         "Neil Lebute's \"In the Company of Men\" is a film depicting emotional terror inflicted by two guys onto an innocent, deaf woman. One is sleazy, self-absorbed and mean-spirited, but charismatic and socially powerful and popular. The other is less than popular and tags along for his \"therapeudic\" plan to put a woman through romance-related stress to relieve them of their woman troubles. The result is a haunting, realistic wake-up call. From it's disorienting opener to a truly disturbing closing shot, \"In the Company of Men\" is a truly important motion picture.",
         "Chad (Aaron Eckhart) and Howard (Matt Malloy) are in a new town for 6 weeks on business. Frustrated by the women in their lives they decide to use the time to seduce an insecure woman and make her feel loved - only to destroy her before they leave. They pick Christine (Stacy Edwards), a deaf girl from their office and set the plan in motion. This is a fascinating black comedy looking at the macho world of American businessmen - although it is a look at the shallowness and competitiveness of men generally. The plot may sound simple but it is very powerful and insightful - although the men are exaggerated versions of reality in order to make clear points. The film doesn't totally satisfy but it is a great character piece. Almost to a man the leads are all excellent, Eckhart is almost pure evil as the man who we all recognise or know, while Malloy is great as the man who wants to be in the game but is getting to the point where he longs for simpler values. Edwards is beautiful as the vulnerable Christine who gradually opens up with confidence as she is made to feel more and more special. Labate's direction is spot on for this - most of the action is dialogue based and the sets are made like theatre sets. As such the direction is quite static but the camera is often set in very interesting shots. Labate's writing is the real strength with the whole dialogue strong, perhaps exaggerated and yet totally believable. A wonderfully harsh drama that will make you aware that will carry you along effortlessly.",
         "Most people I know who saw this movie thought that Chad was a total jerk; that Howard was a total sap (who got cajoled by Chad into being a half-baked jerk); and that Christine was the \"victim\" here. I disagree. Chad and Howard were deliberately playing a 'game' (albeit a nasty and mean one) to strike back at the opposite sex for what they perceived to be inter-personal injustices perpetrated against them by the female gender. In doing this both Chad and Howard pursue Christine, despite her handicap, but whereas Chad continues the ruse until the bitter end, Howard actually does let his better sense of humanity prevail and falls in love, for real, with Christine. But Christine chooses Chad over Howard, clearly because Chad was more cute and charming in her eyes. By contrast, she more than once breaks Howard's heart before anyone has a chance to break hers. So, I would argue that HOWARD, not Christine, is the real victim here: he is set-up and manipulated by Chad, whom he reluctantly plays along with from the very onset, and has his true emotions trounced by Christine, whose vanity leans her toward Chad, who is heartlessly playing a cruel joke on her all along. The movie is an excellent social commentary and is impeccably cast and brilliantly acted, all the way through. The real victim here, though, IMHO, is basic human decency.",
         "That's a big statement, but I stand behind it without reservation. This is my favorite movie of the past decade and it easily makes my top five films of all time. First off, don't come in expecting a stylish, extravagant film with excellent cinematography. Neil Labute's direction is the epitome of minimalism, with virtually no camera movement and entire scenes played out in one shot. I'm not totally sure, but I'd say there are maybe two or three medium close-ups in the entire film, and that's it. The characters are always viewed from a distance, reflecting Labute's background in theater (if you like this, by the way, read Bash, it will blow your mind) and allowing his actors to be as realistic and naturalistic as possible. Contrary to popular belief, stage acting is more natural than film acting; Labute's distance and long takes create a realism that is rarely seen on celluloid. This film is pretty much all dialogue, but this is some of the best-written dialogue I have ever heard. I don't think any man can watch this movie without recognizing some of the conversations that take place in this film. Aaron Eckhart and Matt Molloy are pitch perfect as the chauvinist, attractive, and ultimately evil Chad and the nerdy, pathetic, and ultimately emotionally doomed Howard. Stacy Edwards as the deaf Christine is also very strong; in fact, when I saw her in another movie speaking normally I almost fell out of my chair. I won't say much about the plot, for this is one of those movies that's really better to go in knowing nothing and watch the sickening events unfold. Let me just say that this film has a twist ending that marks one of the few moments in film that truly shocked me. In fact, I challenge anyone to sit still through this scene; I've seen the movie five times and it still makes me squirm in my seat. If you're looking for a big shock, look no further than this masterpiece, but don't expect a cheap thrill. Next to Vertigo, I don't think any film has hit me with a greater psychological impact. Oh, and if you're a female, and you don't want to become a lesbian, don't see this movie. Period. 10/10"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Alliance Atlantis Communications",
         "Fair and Square Productions"
      ],
      "summaries": [
         "Two junior executives on a six week business trip, both of whom have been recently hurt by women, devise a horrible plan to get even with women for their past hurts: They intend to find, romance, and then dump a vulnerable woman. They choose Cristine, and for a while all goes according to plan. However, it soon becomes clear that things are not as simple as they think.",
         "The executives Chad and Howard have just been rejected by their mates. While traveling for a six weeks temporary assignment in another office, they plot an evil game to get even with women. They plan to seduce a vulnerable woman and dump her with her feelings and self-esteem completely destroyed. When they meet the deaf secretary Cristine, they find their perfect victim. However, things get complicated when Howard falls in love for Cristina.",
         "Two business executives--one an avowed misogynist, the other recently emotionally wounded by his love interest--set out to exact revenge on the female gender by seeking out the most innocent, uncorrupted girl they can find and ruining her life."
      ],
      "budget": 25000
   },
   "movielensId": 1594,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-19",
      "dvdReleaseDate": "1998-03-17",
      "directors": ["Neil LaBute"],
      "runtime": 97,
      "movieId": 1594,
      "title": "In the Company of Men",
      "mpaa": "R",
      "actors": [
         "Aaron Eckhart",
         "Stacy Edwards",
         "Matt Malloy",
         "Michael Martin",
         "Mark Rector"
      ],
      "imdbMovieId": "0119361",
      "originalTitle": "In the Company of Men",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["5kvfCm-rVpQ"],
      "plotSummary": "Two business executives--one an avowed misogynist, the other recently emotionally wounded by his love interest--set out to exact revenge on the female gender by seeking out the most innocent, uncorrupted girl they can find and ruining her life.",
      "tmdbMovieId": 14585,
      "avgRating": 3.66618,
      "releaseYear": "1997",
      "numRatings": 2735,
      "posterPath": "/jdg8w5BVEJbakwO1GW7jFQ9EGwC.jpg"
   }
}