{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ship",
            "id": 3799
         },
         {
            "name": "whale",
            "id": 4676
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "killer whale",
            "id": 155529
         },
         {
            "name": "whaler",
            "id": 162756
         }
      ],
      "imdb_id": "tt0119152",
      "video": false,
      "title": "Free Willy 3: The Rescue",
      "recommendations": [
         9073,
         34751,
         1634,
         24478,
         20066,
         37244,
         43643,
         10438,
         40688,
         24476,
         25973,
         41586,
         39128,
         80346,
         33657,
         47354,
         376244,
         291167,
         21352,
         40562
      ],
      "backdrop_path": "/309vBDYOFxHhUddCssyRw5kdpEn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jesse",
               "gender": 2,
               "credit_id": "52fe47839251416c7509c1a9",
               "name": "Jason James Richter",
               "profile_path": "/sdFFQNefNEfiFiyIL8Sz6IweUkM.jpg",
               "id": 18259,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Randolph Johnson",
               "gender": 2,
               "credit_id": "52fe47839251416c7509c1ad",
               "name": "August Schellenberg",
               "profile_path": "/iZ7dQ3JMdrWoUyh4vB8vOxhqoSI.jpg",
               "id": 18260,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Drew Halbert",
               "gender": 1,
               "credit_id": "52fe47839251416c7509c1b1",
               "name": "Annie Corley",
               "profile_path": "/cb2fKqpMAZ9NwMj8HXMfWV6VHci.jpg",
               "id": 6907,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Max Wesley",
               "gender": 2,
               "credit_id": "52fe47839251416c7509c1b5",
               "name": "Vincent Berry",
               "profile_path": "/w1e6NjRdWcMYoLd9xK5ImucGUWY.jpg",
               "id": 83209,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "John Wesley",
               "gender": 2,
               "credit_id": "52fe47839251416c7509c1b9",
               "name": "Patrick Kilpatrick",
               "profile_path": "/wEu61ecaSkCN1mD4vXf5WlrUKTV.jpg",
               "id": 32286,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mary Weslay",
               "gender": 1,
               "credit_id": "52fe47839251416c7509c1bd",
               "name": "Tasha Simms",
               "profile_path": "/rUpxBaMRBei6jyyRTiUqszw566I.jpg",
               "id": 83211,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47839251416c7509c1c3",
               "name": "Sam Pillsbury",
               "profile_path": null,
               "id": 64099,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "546b7b3d92514101e6002122",
               "name": "Keith Walker",
               "profile_path": "/s4dUkFANMNg68Mo0gNPNEczIrTS.jpg",
               "id": 445708,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 1,
               "credit_id": "56bd370b92514173530016dc",
               "name": "Helen Jarvis",
               "profile_path": null,
               "id": 22061,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 2,
               "credit_id": "59e6fbbf9251411cb900457a",
               "name": "John Mattson",
               "profile_path": null,
               "id": 56488,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 6.201869,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18519,
      "vote_count": 92,
      "budget": 0,
      "overview": "Willy the whale is back, this time threatened by illegal whalers making money off sushi. Jesse, now 16, has taken a job on an orca-researching ship, along with old friend Randolph and a sarcastic scientist, Drew. On the whaler's ship is captain John Wesley and his son, Max, who isn't really pleased about his father's job, but doesn't have the gut to say so. Along the way, Willy reunites with Jesse",
      "similar": [
         205775,
         1865,
         26466,
         2756,
         166426,
         12707,
         244,
         228165,
         10140,
         9016,
         22,
         58,
         87827,
         105864,
         76285,
         71805,
         9392,
         10191,
         581,
         254
      ],
      "original_title": "Free Willy 3: The Rescue",
      "runtime": 86,
      "poster_path": "/x7XV6aRUle4sBGMxZixqnfBtbGG.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Donner/Shuler-Donner Productions",
            "id": 5739,
            "origin_country": ""
         },
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-08-08",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/aef15QAJ8Kxbh8W5zXqJb1f9Vhw.jpg",
         "name": "Free Willy Collection",
         "id": 9328,
         "poster_path": "/3M2Q9ZDTyFBfi3ohz2gizFmnoL0.jpg"
      },
      "tagline": "A new friend. A new threat. A new adventure that will capture your heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sam Pillsbury"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Keith Walker",
         "John Mattson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119152/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjk4MTE5MzU5Ml5BMl5BanBnXkFtZTcwMDYyMDUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason James Richter, August Schellenberg, Annie Corley | See full cast and crew »"],
      "reviews": [
         "Free Willy 3 is primarily about Max, an intelligent, inquisitive ten-year-old who accompanies his father on a whaling expedition. His conscience bothers him about his father's career, but instead of taking the usual route of performing a string of silly pranks (like you would see in a lot of children's shows), he tries reasoning with his dad. He also asks question after question -- not just about the technical aspects of whaling, but he also delves deeper into the more important questions of life (\"Do you always have to do the right thing, even if it hurts?\"). One of the things I liked best about Free Willy 3 was the realistic and sympathetic portrayal of the father, even though he was the \"villain\" of the story. He was a man doing a job that has been in his family for years, and without it he wasn't sure who he was. Despite having a career others disagreed with, he was a caring, compassionate person who loved his son. Other characters are drawn out nicely as well -- Jesse and Randolph, from the first two films, and their new co-workers on the sea -- showing their tempers as well as their more positive sides. Couple all these features with stunning cinematography and a beautiful score, and you have one fine film!",
         "Okay guys, the fact that this movie got such a low rating really makes my blood boil! If you can't appreciate such a touching film as Free Willy 3: The Rescue, I'd like to see what you guys watch. This movie really touched me, so did the other two movies in the trilogy. I'll admit, this movie may not have been as good as the other two, which is why I'm only giving it a 9 out of 10, but it still is quite the masterpiece. It's better than any of those other bullshit movies about animals, like air bud or MVP! Those movies were garbage and have absolutely nothing on free Willy. Free Willy 3: The Rescue, has, and always will have, a special place in my heart. I grew up with this trilogy and I hold it very dear to my heart. If you're a parent and you want your child to see some quality film making, I advise you to rent Free Willy 3. This movie doesn't have any violence or anything that'll warp your child's mind into growing up to be some crack-head, animal beating criminal, which is what most movies tend to be doing these days. No, this movie will inspire your kid to do good with his life, it'll make your child appreciate the beauty of animal life. If you haven't seen this movie, I recommend you watch it asap. It will appeal to people of all ages.",
         "In comparison with the first film or even the second, Free Willy 3 seems dark and lackluster. But for some reason, I liked it as much, if not more, than its prequels. The film had a purpose and it accomplished the purpose. Some people who have seen the film are annoyed with Jesse's sudden seriousness. Here's a hint: He grew up, as most people usually do over the course of four years. Why do you think that there was a new discontented kid? I enjoyed how the movie stands for change and reformation, and how it states that even as old stories are lost, new ones begin.",
         "The first wildlife family film is alright fun, the sequel wasn't as likable (once in a while), so I had to finish the trilogy, and see which of all of them is most bearable. Basically, (Jesse Jason James) Richter is now sixteen years old, and has taken a job on a ship as both researcher and protector of Orca whales. He is working with old friend Randolph Johnson (August Schellenberg), sarcastic scientist Drew Halbert (Annie Corley), and on the ocean he is of course reunited with old friend Willy the Whale (Keiko). Meanwhile, on a whaling ship is John Wesley (Patrick Kilpatrick) and his young son Max (Vincent Berry), who after seeing many of them isn't very keen on killing the Orca whales. While he doesn't have the guts to say no to his Dad, Jesse gets Max to meet Willy and his new girlfriend who is pregnant with their baby, and he realises that his Dad is doing something illegal and nasty to nature. Also starring Tasha Simms as Mary Wesley, Peter LaCroix as 1st Mate Sanderson, Stephen E. Miller as Dineen, Ian Tracey as Kron and Matthew Walker as Captain Drake. The problem with this one is that the human story takes over and we hardly see enough of the beautiful, originally show stealing creatures, the birth of a baby nearly makes up for the lack of time they are used, but the first film is always going to be the one to watch. Okay!",
         "I liked two previous Free Willy movies when original was completely a perfect masterpiece while the first sequel was also pretty good. . Now, I watched the third movie and I found it excellent, almost as great as the original, though the first Free Willy movie is without a doubt the best in the trilogy. In this movie our main hero Jesse is now 16 and he begins to work with his old friend Randolph on a scientific researching ship. This summer new danger threatens his relations with giant whale Willy - illegal whalers. Jesse meets young boy, who is son of the captain of whaler's ship and he tries to convince him that whales are living creatures and not just a food for expensive restaurants. The relations and dialogs between captain of whaler's ship and his son Max (played by two newcomers Patrick Kilpatrick and Vincent Berry) and dialogs between them are the strongest parts of the movie. Acting is still pretty good and young Vincent Berry who was much better than slightly annoying Fransis Capra is the second movie created an excellent and memorable performance as Max, young and innocent kid, who learns that his father is involved in illegal fishing. Jason James Richter one more time (to my great sadness the last time) showed his acting abilities with strong performance as almost grown-up Jesse. Free Willy 3 is beautifully shot movie with gorgeous cinematography which is as good as in first movie but here we can entire ocean instead of small pool. With such a good cinematography, great scenery, well written and poignant story and good soundtrack the last Free Willy 3 is an excellent example how good can be a family movie. Sweet and innocent, bright and entertained and that's the most important to me without any sign of vulgarity and typical rude humor it easily became to all-time family classic. Anyone must realize that whales (and others animals) can be more human than people. My rating 9,5 out of 10. The movie is dedicated to memory of Keith A.Walker (the man who brought two great characters Willy and Jesse into our life). IMDb is a great source for any movie lover but some ratings can be exceptionally misleading.",
         "I am going to start off by saying I really like the first two Free Willy movies. I would hardly call them the best movies ever, but they are very nice movies and I think underrated. This sequel is a worthy one. While there is a predictable story, some weak spots in the script and a lacklustre ending Free Willy 3:The Rescue is a nice and worthy sequel, that could have been so much worse. Flaws aside, Free Willy 3 does have some stunning cinematography, and I loved the scene when Randolph throws the oranges in the water. I also loved the scenes between Nikki and Willy, and the one when Nikki gives birth which was brilliantly done. The score is absolutely beautiful, the pacing is brisk and the direction is amiable. And the characters are appealing especially Willy and Nikki, while Jesse and Max are great characters and the father is a sympathetic figure even for the villain of the piece, except I don't see him as a proper villain, just someone who means well but doesn't know exactly what he wants. The acting is good too, Jason James Richter and Vincent Berry are very likable, August Schellenberg makes a welcome return as Randolph and Patrick Kalpatrick does a great job with his character. All in all, a pleasant family film. 7/10 Bethany Cox",
         "Granted, I understand how others were expecting adventure kind of things in this movie but it was not bad at all. This movie was more, how I like to say nonfiction than fiction meaning that it tells of what really happens without exaggerating the facts like most movies do. Most people who gave it a low rating were expecting exaggerated things, amazing adventure like no other and hence they were disappointed. This move, though short (that's what I thought), was simple and sensitive. The ending was rather lame they could have spiced it up like sending the guy to jail or something like that but right afterward you see the female whale give birth-hence with the facts without being too much like a lot of movies are nowadays. So this movie deserves a solid \"A\" and even Sisko and Ebert gave it two thumps up and they are movie experts, so there you go.",
         "This was a VERY entertaining family film. I had not seen either previous Willy flics, yet I was into it from beginning to end (along with my 4 year old daughter). So why the low rating? My hunch is people judge family films by adult criteria. Which is totally absurd, since we all know children's movies today are far superior than 95% of the so called, adult films coming out (which ironically enough, seem made for audiences with a teenager's intelligence). In short: ignore the low rating.",
         "FREE WILLY was one of the best \"Feel-good\" movies ever made! It isn't often that a movie makes you both Sad and happy at the same time and makes you want to stand up and cheer at the ending, but FREE WILLY was one of the few movies that did it. Willy and Jesse met again in FREE WILLY 2 and it was great to see them together again, but unfortunately the enterprising premise (involving an oil spill in the ocean endangering Willy and his Family) turned out to be a bit too slow-paced and in some cases too hokey (like the scene where Jesse and Willy re-unite again after the first time Jesse plays the harmonica...it could have been thought out better). Also the film spent too much time dealing with the issues of Jesse's new Step-brother, Elvis. However, the suspenseful last half-hour of the movie was great. Which brings us to Part 3 which is actually almost as good as the first film and a lot better than part 2. The storyline (involving the wrongful and illegal hunting of Whales and Jesse & Randolph's quest to stop a crew of nasty hunters) is very well written and emotionally charged like the first movie. I wish this film was marketed and advertised better because it really deserves to be seen! It is emotional and heartfelt like the magic of the first FREE WILLY and in the end you will stand up and cheer. It's cool to see what has become of Jesse and how he has grown up and it is good to know that Jesse and Randolph will always stick together to do what is right! If you passed on this because you were afraid that it was more of the same, guess again! It is another wonderful story that deserves to be enjoyed again and again! Check it out!!!",
         "Free Willy is pretty much the non-sci-fi version of E.T. Although not as good, it still gives you the same feeling and remains an iconic landmark. Free Willy 2 was also great with many great elements. Now, there's Free Willy 3: the most different and edgiest which polarizes the opinions of the viewers. Jesse gets a job working with his longtime buddy Randolph. They discover that Willy is going to be a father, so Jesse is excited. Meanwhile, young Max Wesley sees his father illegally hunting wales. Max knows that's wrong, but his dad convinces him it is not a big deal. Max befriends Willy and starts to feel for him. When Jesse and Randolph get involved, they try to stop Max's father from more wale killings. Richter and Schellenberg are the only two returning cast members. Many people wonder what happened to Elvis and Nadine from the previous flick. I found Jesse and Randolph alone to be fine, as they are the best characters. One may also not like half the story centring around Max and his family. They also may not like seeing his father hunting and killing wales, which is shown. There are also brawls which make things less settling. Having said that, this movie needed that action and brutality. Doing another Free Willy movie in the same fashion as the first two would suck. Although the first two were good, they were also dry and stale with little excitement. The sheer danger rises which makes for more excitement."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Regency Enterprises",
         "Donner/Shuler-Donner Productions"
      ],
      "summaries": [
         "Willy the whale is back, this time threatened by illegal whalers making money off sushi. Jesse, now 16, has taken a job on an orca-researching ship, along with old friend Randolph and a sarcastic scientist, Drew. On the whaler's ship is captain John Wesley and his son, Max, who isn't really pleased about his father's job, but doesn't have the gut to say so. Along the way, Willy reunites with Jesse, who helps Max realize that whales are a little more than just cheese burgers.",
         "A teenage Jesse and old friend Randolph try to foil an illegal whaler threatening Willy and his pregnant mate."
      ],
      "budget": 0
   },
   "movielensId": 1595,
   "movielens": {
      "languages": [
         "Český",
         "English"
      ],
      "releaseDate": "1997-08-08",
      "dvdReleaseDate": "2003-01-28",
      "directors": ["Sam Pillsbury"],
      "runtime": 86,
      "movieId": 1595,
      "title": "Free Willy 3: The Rescue",
      "mpaa": "PG",
      "actors": [
         "Jason James Richter",
         "August Schellenberg",
         "Annie Corley",
         "Vincent Berry",
         "Patrick Kilpatrick",
         "Tasha Simms"
      ],
      "imdbMovieId": "0119152",
      "originalTitle": "Free Willy 3: The Rescue",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["5N3_O2sh4ek"],
      "plotSummary": "Willy the whale is back, this time threatened by illegal whalers making money off sushi. Jesse, now 16, has taken a job on an orca-researching ship, along with old friend Randolph and a sarcastic scientist, Drew. On the whaler's ship is captain John Wesley and his son, Max, who isn't really pleased about his father's job, but doesn't have the gut to say so. Along the way, Willy reunites with Jesse",
      "tmdbMovieId": 18519,
      "avgRating": 1.79672,
      "releaseYear": "1997",
      "numRatings": 1097,
      "posterPath": "/x7XV6aRUle4sBGMxZixqnfBtbGG.jpg"
   }
}