{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "reunion",
            "id": 9824
         },
         {
            "name": "reunited friends",
            "id": 190722
         }
      ],
      "imdb_id": "tt0118818",
      "video": false,
      "title": "Career Girls",
      "recommendations": [
         26195,
         44535,
         55143,
         24041,
         52705,
         70404,
         46900,
         465,
         25985,
         49559,
         14521,
         106222,
         14268,
         46908,
         35122,
         36843,
         32598,
         23523,
         49453,
         20967
      ],
      "backdrop_path": "/aQuIDyKmyEpM4OUO9MPLAqKdpKA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Hannah Mills",
               "gender": 1,
               "credit_id": "52fe4796c3a36847f813dbd7",
               "name": "Katrin Cartlidge",
               "profile_path": "/vYzJWgFwdctp3XsfWIzQ7L0aGm8.jpg",
               "id": 1641,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Annie",
               "gender": 1,
               "credit_id": "52fe4796c3a36847f813dbdb",
               "name": "Lynda Steadman",
               "profile_path": null,
               "id": 223457,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe4796c3a36847f813dbdf",
               "name": "Kate Byers",
               "profile_path": null,
               "id": 223458,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ricky Burton",
               "gender": 0,
               "credit_id": "52fe4796c3a36847f813dbe3",
               "name": "Mark Benton",
               "profile_path": "/pw3eE2w0ayS1ES9GPbWxOGkEm8U.jpg",
               "id": 77638,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mr. Evans",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dbe7",
               "name": "Andy Serkis",
               "profile_path": "/eNGqhebQ4cDssjVeNFrKtUvweV5.jpg",
               "id": 1333,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Adrian Spinks",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dbeb",
               "name": "Joe Tucker",
               "profile_path": null,
               "id": 143181,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ricky's Nan",
               "gender": 0,
               "credit_id": "5617a21dc3a3680fa000270a",
               "name": "Margo Stanley",
               "profile_path": null,
               "id": 105482,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dbcd",
               "name": "Mike Leigh",
               "profile_path": "/kvW8YDDi0dHOEYJG7jLHYQRrRJs.jpg",
               "id": 65452,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dbd3",
               "name": "Mike Leigh",
               "profile_path": "/kvW8YDDi0dHOEYJG7jLHYQRrRJs.jpg",
               "id": 65452,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5617a23dc3a3680f9a002265",
               "name": "Dick Pope",
               "profile_path": null,
               "id": 60085,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "5617a251c3a3680fba0024df",
               "name": "Marianne Jean-Baptiste",
               "profile_path": "/7C1Ubphw4o1Gv200pAwlgohdxcV.jpg",
               "id": 17352,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5617a25f9251412aef0024b2",
               "name": "Tony Remy",
               "profile_path": null,
               "id": 1132800,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "562f88fe9251414ad800ba99",
               "name": "Robin Sales",
               "profile_path": null,
               "id": 17254,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.854045,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 49462,
      "vote_count": 18,
      "budget": 0,
      "overview": "Two young women reunite and rekindle their friendship after having said goodbye at their college graduation, six years earlier.",
      "similar": [
         114150,
         10760,
         20453,
         337874,
         325133,
         9777,
         62211,
         440021,
         9529,
         27066,
         8469,
         8065,
         8923,
         9475,
         489,
         37247,
         401898,
         290764,
         76726,
         122081
      ],
      "original_title": "Career Girls",
      "runtime": 83,
      "poster_path": "/o6TImIOfHdEuIUwjApllJiBGgul.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Matrix Films",
            "id": 38861,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Thin Man Films",
            "id": 10100,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         }
      ],
      "release_date": "1997-06-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Leigh"],
      "runtime": 83,
      "synopsis": null,
      "writers": ["Mike Leigh"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118818/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyNzY0NDUwNV5BMl5BanBnXkFtZTcwMTMyMzAzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Katrin Cartlidge, Lynda Steadman, Kate Byers | See full cast and crew »"],
      "reviews": [
         "With \"Career Girls,\" Mike Leigh almost reaches the sheer greatness of his 1995 picture \"Secrets & Lies,\" with yet another thought provoking study of modern British life. Ignore the sneers and criticisms that some critics felt the film deserved on its release:- They either weren't paying enough attention, or simply didn't understand what was going on. Although it's true that \"Career Girls\" lacks the more conventional plotting of his earlier film, Leigh is able to make up for it in this film's character studies and wonderfully observational dialogue. The 'Story' is relativly simple; the film charts the ups and downs of two London polytechnic students, Hannah and Annie, during the mid to late 1980's, interweaving their day to day lives in with their lives today, seven years later in the 1990's, when they decide to meet up again for the weekend in London. During the forty eight hours they spend together, a series of coincidences reconcile them with faces from their student lives, digging up a mixture of bad and good memories all over again. Doesn't sound interesting? Well, actually, it's a marvellous film. Amongst the dozens of observations Leigh makes in the movie's 90 minute running time is the way that, although many years have past since our protagonists have been together, the difficult and often painful relationship between them is still very much alive and kicking. It even creates parallels between events that occurred years ago to events that occur during the weekend over which much of the movie is set, suggesting all the more that perhaps people and relationships can never truly change, and that time isn't such a healer after all. The performances are nearly always excellent, with the two leads giving it all they've got in semi-spontaneous roles. Leigh's direction always keeps the viewer entertained and involved, and his usage of gorgeous colour to represent the change in eras is perfect; the usage of a blue tint for the 1980's scenes is a stroke of genius, and adds a suitably cold and harsh tone to the sequences. There's also plenty of humour in there too, including a wonderful series of scenes where our two girls pay a visit to a most peculiar apartment owner on the London Docklands. \"Career Girls\" is another absolute, utterly rewatchable gem from Mike Leigh, and, following on from such classics as \"Naked,\" and, indeed, \"Secrets and Lies,\" the only assumption I can make about the Stafford-born filmmaker is that if he isn't a true genius, he must be on the verge of being one!",
         "I've seen a lot of Mike Leigh's films and while I know that Career Girls isn't considered by most critics his best film, I think it's his most touching (at least from the ones I have seen). Annie and Hannah were roomates in college for 4 years, after they graduated Annie returned to her hometown and now 6 years later she's visiting her old friend in London for the first time in those 6 years. Re-uniting with old friends is something that has happened to all of us and always brings back the most bittersweet memories. This is a beautiful film and I recommend it to everyone.",
         "The combination of Alison Steadman and the stunningly talented Katrin Cartlidge make for a very quirky but really down-to-earth film. Although it was slated heavily for being OTT i think the characters are so true to life. We all must've known certain folk back in the early 80s who were of a similar character to those portrayed here. Katrin Cartlidges' death is a HUGE loss. She was one of the most talented and beautiful actresses who fitted in so well when directed by Mike Leigh. If you fond of films containing humorous British nostalgia and are fed up with the false, glitzy, Hollywood -influenced exterior that seems to be the winning trade mark these days, then this is the sort of film for you. Let's see more films about REAL life, warts and all, (like this one) for a change!",
         "This is one of Mike Leigh's more easy-going efforts, overall, a bit mannered, sort of an urban picaresque, \"Naked\"-lite if you will. When I saw it on initial release, I liked it fine, but thought it would be memorable mainly for particular bits--the very funny scene with the obnoxious yuppie flat owner, the very powerful scenes with Mark Benton as Ricky--rather than for any coherence. I saw it again this week and it is sticking in my mind with more impact than before; to me it now resonates as a meditation on the need to get on with one's life, and the costs (in friendship, soulfulness, caring) of doing so, and the tragedy of those who just can't make the jump. Not one of Leigh's greatest films, but like everything he's made, well worth the time.",
         "When I saw Mike Leigh's Naked, the first time, one word, genius, never left my mind. I still think it is one of the most intelligent pieces of filmmaking I have ever seen. About 180 degrees away in its subject matter, Career Girls affects me even more strongly. The idea that a couple of college girl-chums might get together after a few odd years, is nothing new. The film effectively puts their relationship under a microscope, in two drastically different times of maturation, the college years, and the 10 or so years after. Under that scrutiny each will blossom, brilliantly, through the short span of the film, much like a rose blooms in time-lapse photography. It's a helluva notion. Leigh accomplishes it all brilliantly. We have all seen buddy pictures, and Career Girls is no 48 Hours, or Lethal Weapon. It's a truly sensitive look into the human soul, the human heart portraying a friendship we only imagine. This film literally leaves me breathless.",
         "I was pleasantly surprised with this movie. It came on HBO the other night, and it was late so I was about to go to bed. I decided to just watch the beginning, but started to become quite interested in it. It turned out to be a pretty darn good little movie and I am glad I stayed up to watch it. Although it is a little different and a little slow, I thought it was a genuinely good movie with some very powerful performances. The characters are strong and the story is simple, but sweet.",
         "Yes, this film has been panned by many, but in my view Mike Leigh was near top form again with this absorbing and moving film. The late, great Katrin Cartlidge puts in an excellent performance. Dreadfully sorry to learn that such a talented young stage and screen actress has died. Lynda Steadman is also superb. The film is partly in flashback to college days in the 1980s and partly set in the \"present\" of the 1990s. I see the exaggerated twitching and accents of the characters in the 1980s scenes as part of the flashback genre. Perhaps I went to University with exceptionally twitchy people, or perhaps the memory pitches college-days memories at 30 frames-per-second, but my own \"flashbacks\" to such times feel a bit like that. I thought it was intriguing cinematography, but the majority seems to be against me. Where the film does grate a little is in the coincidences that lead them to run in to their past several times. Two of the coincidences are necessary for the plot and interest. One seems like \"a coincidence too many\" and it goes nowhere - maybe there was an intended plot thread that got dropped - well the coincidence should also have been dropped in that case. It's a short film and it held our attention from start to finish. Not Mike Leigh's very best film, but well worth seeing.",
         "After Secrets and Lies, which I feel is one of the best family dramas ever made, Mike Leigh decided on something lighter and quicker and quirkier. It's basically a character study of two neurotic women who became good friends when they lived together in college and who reunite several years after graduation. In the present day both of them are moving forward in their careers and a lot more comfortable with themselves. The movie moves back and forth in time and is quite remarkable at convincingly showing what a transformation they've made since their college days. However, while Secrets and Lies showed in great detail the painful process of moving forward emotionally, Career Girls only shows you the before and after, leaving the most interesting aspects of their characters a bit of a mystery. It's a fascinating yet incomplete portrait of two unique women. *** out of ****",
         "Mike Leigh's often improvised, raw films can be off-putting if you're unprepared. He has a real nack for finding performers who put their full souls into his films and the style of the acting in this film explodes with a vibrant, distinctive energy. A slice-of-life tale of two college friends who meet up years later and find coincidence and fate entwine in quite unpredictable ways, the film is all about the tensions beneath the surfaces and those things that so often go unsaid. Its a love story between friends much like \"Muriels Wedding\" and again without a sexual component. The two women undertake an exterior and interior journey and learn about the love that friendship quietly evolves. Cartlidge and Steadman are unique performers and the beautiful music score is by \"Secrets and Lies\" actress Marianne Jean-Baptiste.",
         "First time i saw this film (a few years ago) I thought it was dreadful. Irritating actors doing irritating characters doing irritating acting. And having seen it again they're still irritating. There must come a point in Mike Leigh's much vaunted \"method\" of character improvisation where he loses objective judgement; he's so closely, and myopically, caught up in the whole process he can't see how parodic his actors \"charactering\" is becoming. There's a scene in a pub illustrates how embarrassingly bad this improvised method can get; you've got social phobic psychology student Annie (Lynda Steadman) flittering away with fidgety fingers over itchy twitchy face; sat next to her is fellow psychology student, fat Ricky, spluttering and stammering with wild flailing blind arms like somebody with jerky Aspergers; and opposite is cynical Hannah (Katrin Cartlidge) sneering with quotation mark emphasis at their \"pretentious psychobabble\" doing a mocking beaky hand thing. Tics and fidgets and jerks gone galorious \u0096 and non of it is meant to be being \"funny\". It's not p--s-taking you're seeing, it's seriously intended role-playing. But i thought to myself: this is just mimic mania gone mad; parodic mannerism has now subsided into ridiculous pantomimic absurdity. It was like witnessing Neurosis overload; these 3 hapless actors in a Mike Leigh film had just allowed themselves to be turned into grotesque caricatures, riddled with hopelessly unfunny autistic distortions of Tourettes syndrome. Oh dear. I've seen this neurotic OTT grotesquery before in Mike Leigh films; how ruinously afflicted Jane Horrocks was by it in Life is Sweet (and Timothy Spall too); Brenda Blethyn in Secrets and Lies with all her self-pitying \"sweed arts\" and \"darlins\" got pretty close to unbearable too. I suppose its par for the course. You have to expect that Mike Leigh films come with this trademark neurotic \u0096 bordering on mental illness - characterisation. Sometimes it leads towards heartfelt Pathos. And sometimes it veers off into something unbearably unbelievably Pathetic. Which unfortunately it does for big chunks of this film, especially in the retrospective flashbacks to when they were playing themselves as \"immature\" polytechnic students. In the other - friends reunite \u0096 half of the film the tics and twitches have calmed down or grown up a bit. Annie is still doing that mad eyed down turned petrified stare when stressed or confronted; Hannah has stopped doing the beaky hand thing, but the sour antipathy hasn't really sweetened any, its just found less obvious streams in which to curdle; she's professionalised her cynicism, forged a career for herself out of the energy of her anger. Ricky, however, hasn't survived \u0096 he's gone full on bonkers. One of life's sad little causalities, left to wander off on his own down the career-less path to nowhere. I suppose thinking about it i did feel a bit more in sympathy with the general premise of the film this time: the whole reflecting back on how we once were, and what we now like to think we've become, how much better or improved we like to seem to ourselves, while knowing all the while \u0096 deep down \u0096 that nothing much has changed about us at all, and nothing ever will. We're more or less stuck with our silly little selves for the duration. Mind you, at least i'm not stuck inside a character in a Mike Leigh film for the duration. Lol. That would be purgatory!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Channel Four Films",
         "Thin Man Films",
         "Matrix Films"
      ],
      "summaries": [
         "Career girls opens with a train journey towards London's Kings Cross where Annie, one of the major characters is about to meet her old university friend Hannah. She recalls moving into a grotty student flat with Hannah in the mid-eighties. In those days Annie was self conscious and jumpy. The pair have not seen one another since graduation. They both now have moderately successful careers and are, at least on the surface, self assured in their new lives. However, they are still carrying a lot of emotional baggage from their university days. During the course of a weekend they rediscover their close friendship and encounter many faces from the past.",
         "Annie and Hannah are former flat mates. Annie arrives in London to visit Hannah after six years of separate living. They remember the times they had together, relationships they had, start new ones...",
         "2 young women reunite and rekindle their friendship after having said goodbye at their college graduation, six years earlier."
      ],
      "budget": 0
   },
   "movielensId": 1596,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-01",
      "dvdReleaseDate": "2005-09-06",
      "directors": ["Mike Leigh"],
      "runtime": 83,
      "movieId": 1596,
      "title": "Career Girls",
      "mpaa": "",
      "actors": [
         "Katrin Cartlidge",
         "Lynda Steadman",
         "Kate Byers",
         "Mark Benton",
         "Andy Serkis",
         "Joe Tucker",
         "Margo Stanley"
      ],
      "imdbMovieId": "0118818",
      "originalTitle": "Career Girls",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["H3ZEYe-qYrI"],
      "plotSummary": "Two young women reunite and rekindle their friendship after having said goodbye at their college graduation, six years earlier.",
      "tmdbMovieId": 49462,
      "avgRating": 3.42519,
      "releaseYear": "1997",
      "numRatings": 528,
      "posterPath": "/o6TImIOfHdEuIUwjApllJiBGgul.jpg"
   }
}