{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0120112",
      "video": false,
      "title": "She's So Lovely",
      "recommendations": [
         83489,
         84278,
         46797,
         42257,
         27609,
         61280,
         43886,
         38731,
         115332,
         60792,
         42731,
         60994,
         56135,
         37922,
         51759,
         111883,
         49963,
         111469,
         66027,
         5179
      ],
      "backdrop_path": "/jSuctgrS6UhRJsKHQbC7zqvpnpl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Eddie Quinn",
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b595",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maureen Murphy Quinn",
               "gender": 1,
               "credit_id": "52fe46a79251416c9105b599",
               "name": "Robin Wright",
               "profile_path": "/tXfQTgcIEPP7gtVdJ44ZxZPhacn.jpg",
               "id": 32,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joey Germoni",
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b59d",
               "name": "John Travolta",
               "profile_path": "/6CKR08ipxM8d2xOB26ja7OlXx7H.jpg",
               "id": 8891,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kiefer",
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b5a1",
               "name": "James Gandolfini",
               "profile_path": "/19r3knxqTAPUgfItOPXg3ouOcpI.jpg",
               "id": 4691,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tony 'Shorty' Russo",
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b5a5",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Georgie",
               "gender": 1,
               "credit_id": "52fe46a79251416c9105b5a9",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Lucinda",
               "gender": 1,
               "credit_id": "52fe46a79251416c9105b5ad",
               "name": "Susan Traylor",
               "profile_path": "/A3ZpoAui1ure4Nx2b83wUMI8lvv.jpg",
               "id": 4158,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Security Guard",
               "gender": 2,
               "credit_id": "56ec0b51c3a36822560026e2",
               "name": "Chris Kinkade",
               "profile_path": "/epxoyvp0SyZsJvrRl3mdBVusjzC.jpg",
               "id": 1592478,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b5b3",
               "name": "Nick Cassavetes",
               "profile_path": "/daXFYs1PxFtrAZJv5iLMpqnIGet.jpg",
               "id": 11151,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b5b9",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b5bf",
               "name": "Joseph Vitarelli",
               "profile_path": null,
               "id": 55440,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a79251416c9105b5c5",
               "name": "Thierry Arbogast",
               "profile_path": null,
               "id": 997,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5a869f910e0a2652ab034981",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.614301,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 38295,
      "vote_count": 33,
      "budget": 18000000,
      "overview": "Maureen is pregnant and her husband Eddie is missing. Nervous, Maureen shares a couple of drinks with neighbor Kiefer, who tries to rape her and then beats her. When Eddie returns and finds his wife bruised, he goes ballistic, shoots a paramedic and is put in a psychiatric institution. Ten years later, Eddie is released and finds that Maureen has divorced him and is remarried with three children, one of whom is his little girl Jeanie. Eddie goes to reclaim his wife",
      "similar": [
         3134,
         11564,
         298312,
         8810,
         281,
         948,
         133805,
         2142,
         22323,
         14433,
         12162,
         1359,
         4771,
         431,
         8923,
         97630,
         101,
         205,
         141,
         562
      ],
      "original_title": "She's So Lovely",
      "runtime": 100,
      "poster_path": "/gDOgvYTg1CU6NIKQEFvznwHrxRq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1997-08-29",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "The story of one outrageous woman. Caught between two men. Both of them certain of one thing...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nick Cassavetes"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["John Cassavetes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120112/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0ODE1MjU2M15BMl5BanBnXkFtZTcwNTk5NTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sean Penn, Robin Wright, John Travolta | See full cast and crew »"],
      "reviews": [
         "Movies that will never have an Oscar do not possess the following: 1. Extensive gripping plot of historical nature, or about a famous personality (read `The English patient,' `Braveheart,' `Titanic,' `Beautiful Mind') 2. Unreal or almost unreal plot twists (read `Lord of the Rings') 3. Clearly morally defined characters (read Billy Zane character in `Titanic;' Mel Gibson's character in any movie he is in). You either love them or hate them. 4. Long viewing time. 5. Sense of the plotline ending at the end of the movie (you pretty much can picture the life of Forrest Gump after the movie end, and you know what's going to happen to Rose from `Titanic', at least key things) The movie `She's so lovely' is a tale of Eddie (Sean Penn), a drunk with a mental problem, and Maureen (Robin Wright Penn), a drunk with lots of other problems. They are in love, he goes to mental institution, she is pregnant, but marries another, Joey (Travolta is for once in a movie he really belongs in, and does a terrific job). Ten years later, Eddie comes out and comes back for Maureen. All of these characters are semi-crazy, semi-abusive, semi-kind, semi-dumb. How can you love someone who hit his wife then tells her he loves her? And how can you not love that same person for being a dad to 3 little girls, one of them not his own? How can you forgive a woman for divorcing her husband while he is sick, and then not sympathize with her when she paid for it by 10 years of being separated from the man she loves? And what to think of a man who comes to take a woman from a family she made without him because he clearly sees her love for him? Penn's performance is as always vulnerable and smart. Wright Penn is the most under-appreciated actress of our time; I still cannot forgive the aforementioned academy for not even nodding her way with her brilliant performance in `Forrest Gump.' These two actors can act with their eyes alone, seems fitting that they are together also in real life. Having said all that, `She's so Lovely' is clearly not an Oscar material. It's too real. It's too good.",
         "Some of the people who \"review\" flicks here continually amaze me with their complete lack of film knowledge. When I heard an interview with the always-extraordinary Sean Penn, in which he said he was upset that so few people had seen what he considers to be his best work: this film and the excellent \"At Close Range,\" I knew that I had to catch this. Then, finding that it was based on an unproduced John Cassavetes script, I was all the more eager. That final statement should scare off anyone who expected a happy, romantic Hollywood film, as they clearly haven't seen any of the late writer/director's stark, realistic films. Cassavetes' work relied heavily on tortured, unlikable or unredeemable characters who can act their brains out [quite often portrayed by his wife/widow, Gena Rowlands]. We're talking serious fare, folks ~ required viewing such as \"Husbands,\" \"Woman Under The Influence,\" \"The Killing of a Chinese Bookie\" and \"Gloria\" [the brilliant Rowlands original, not the adequate Sharon Stone remake]. Now comes his former B-movie star & son, Nick, who dusts off papa's script and enlists the type of actors who are eminently qualified to play a group of true undesirables: Sean Penn, Robin Wright Penn, James Gandolfini, Harry Dean Stanton, Debi Mazar and the newly-retalented John Travolta, who appears in the last reel. Even Mom [Rowlands, of course] gets a small but important role. And the adorable Kelsey Mulrooney, playing Penn & Penn's nine-year-old daughter is terrific without stooping to precociousness. Is this a brutally honest film? Yep. Is it vulgar in nearly every way? Of course. Do the leading characters have any chance of redemption, moral or otherwise? Not likely. Do I care? Let's just say that there's more passionate acting in \"She's So Lovely\" than was evident in nearly every other 1997 film. And that's certainly good enough for me. So there.",
         "Sean Penn does method, John Travolta chews scenery, the kids are cute enough to make one diabetic and Robin Wright Penn's performance keeps banging away at the same note over and over and over again. The characters were so unsympathetic I didn't care the least bit what happened to them. There is no plot to speak of. The cinematography ranges from grunge to bland and I don't understand where the romantic comedy angle comes in. What's so funny (or romantic) about abuse and codependency taken to sociopathic levels on all fronts? And I would definitely wave off anybody who has ever suffered from mental illness, because they would find the flick downright insulting. Of course there are real people like this out there, but so what? If I don't waste any of my precious time on this earth watching the denizens of Jerry Springer, why would I want to watch their fictional counterparts? You want a movie about an irredeemable person that is worth seeing? Go rent Citizen Ruth. It is infinitely better than this horrorshow. This might have worked as a ten-minute indie movie, but as an hour and a half Hollywood flick, it's a complete waste of celluloid. I watched it (sporadically) on tv for free, and I still regretted it. Whatever you do, if you must watch this piece of crap, use a free video store coupon to do so. Chances are, you would regret spending any money on it.",
         "Maureen is a bit strung out and pregnant from her low-life husband Eddie. Their lives are an unpredictable mix of actions that mostly involve drinking and scamming round on the fringe of society. When Eddie is \"away\" for a few days, Marueen falls in drinking with neighbour Kiefer, who tries to rape her but then just beats her. She explains this away to Eddie so as to keep him from going crazy at her or anyone else but when he does start to flip she calls the paramedics to take him into care for his own safety. However when he shoots one of them, Eddie is sentenced to a mental institution. When he comes out he finds that Maureen has divorced him and has moved onto a much more stable and reliable man in the form of Joey, with whom she has had more children. Almost halfway in it becomes evident that this film isn't going to work out that well because, before the \"10 years later\" jump, the love between the two leads hasn't been established to a convincing degree. Given that the narrative is using this mutual attraction (despite all the negatives) as its lynchpin this is a bit of a problem. Other than establishing that both are unstable and using each other for meaning, the film doesn't do that much for all the time it takes up. The second half isn't that much better as Eddie comes out as a sort of watered down Rainman and disrupts Maureen's new relationship with Joey. The script then asks us to swallow that she still loves Eddie to the point where the mere news that he is released sees her flush the last ten years down the toilet. I can sort of understand what the script was trying to do but it didn't manage to produce anything interest in the aggressive relationships that it paints in the gutter. The characters are where the main failing is. Maureen's character is poorly defined and Wright-Penn doesn't appear to understand what motivates her character and thus turns in a really mixed performance that pushes emotional buttons in each scene but is never consistent. Eddie is OK in the first half of the film as he just seems like a drunk unstable loser but in the second half he is unconvincingly soft. Likewise Penn is strong in the first half but he is unconvincing in the second. Their performances aren't helped by a weird mix of tones \u0096 at times a dark love story, at other times a cringingly awful \"comedy\" complete with \"jaunty\" music being played over a fight on the front lawn or that horrible scene at Joey's bar. Travolta is a bit better and Stanton is a reasonably nice addition in a small role. Overall this is a shocking mess of a film that spirals downhill from the mid-point onwards. The first half shows potential but doesn't manage to pull off the formative stages of the central relationship and thus fails to set up the second half. However the second half isn't helped by poor development and a terrible mishmash of \"comic\" moments that simply feel crass and out of place \u0096 I suspect even if the first half had been a stormer, this second half would have been poor enough to drag it all under. Even the acting talent seems all at sea and unsure of where they stand or who they are. A load of rubbish with little or no value.",
         "I suppose that the point of this movie is that love, and people in love, are not necessarily very \"proper\" and jasmine-smelling. Fine, I agree, but by the time the movie ended I was not sure it was love this movie was about. Quinn and Mrs. Quinn amply deserve each other that there was hardly any point in making a long movie to demonstrate that. The pity is, that the movie was well done, well directed, with some nice touches; the actors were also good, but the script, or rather, the characters are a mess. In any case you might even tolerate the failures of script and characters but it is impossible to get past the inanity of the protagonist Mrs. Quinn: she just doesn't make sense. In the second part of the movie Mrs. Quinn is as messed-up as in the first part, only ten years, a new marriage, three children and a change in her social standing are supposed to have happened in between; nevertheless, only her clothes and her makeup have changed. How can that be? I am not the same as ten years ago, and not so many things have happened to me. Also, she's supposed to be the pivot of the whole conflict, but she's not solid enough to justify that.",
         "This was just about the worst movie I've ever seen. All I could think about during the \"early days\" part of the film was how terrible some children must have it when they are born to mentally and emotionally unstable parents. I did think Sean played his role well, but the story sucked me into a pit of despair and made my stomach churn at stupidity of Mrs Quinn. I noticed the accent mutilations as well. So true love is ditching your current husband and three young children for a guy you haven't seen ONCE in the last ten years? Sounds like those two should have shared that cell at the sanitarium. Many of the character interactions didn't make sense, the story had ample amounts of LAME, and the funniest part was the very very end where we see the 'happy couple' and their two loser buddies DRINKING and DRIVING down the road in that stylish 1968 Buick Riviera. Classy.",
         "As a filmmaker John Cassavetes was always challenging his audience. He wanted to shake people out of their traditional patterns of the way people watch movies. He wanted to constanly stay one step ahead of viewers and challenge them to keep up. If you know this, any Cassavetes movie is a rewarding viewing experience. If you are unaware of this, you will surely be lost like so many reviewers I've read here are. SHE'S SO LOVELY is Nick Cassavetes paying tribute to his father's unique and often misunderstood style. The characters, like real people, do not know what they are going to do from one moment to the next. This is what makes the movie so funny, unpredictable - and so honest and true to life - that it makes some uncomfortable. Alot of critics have stated that it is unrealistic that a mother would ever leave her family under the circumstances presented here, but until you've been in a similar situation how can you really say? At any rate, one thing you can never accuse this movie of being is predictable. John Cassavetes often recut his movies even when people liked them. If he were still alive, he would probably be delighted to read all the negative reviews here, because they all point to one thing: Cassavettes has done it again. He has shaken people out of their set ways of watching movies and no one seems to be hip to it - yet. Like any great jazz artist, the work of John Cassavetes may be misunderstood at first, but finds it's audience eventually. He is somewhere laughing, knowing he has done his job. If you don't agree, keep this review in mind and watch this movie again/for the first time. Like all of his films, SHE'S SO LOVELY improves with repeat viewings.",
         "It distresses me that anyone who has watched this movie thought that it had any redeeming qualities. From the beginning, with totally unreadable credits, until the outrageous ending, it was a huge waste of great actors and expensive celluloid! If you know anything about film making, you know that entertainment is a larger priority than art. Although, most good films have one or the other. Great films combine both. Unfortunately this is neither entertaining nor is it art. I am disappointed that anyone thought this movie was good. I was especially angry by the good reviews especially the thumbs up. There is nothing remotely entertaining or artistic about this film, not even those adorable kiddos. To exploit those children for the sake of a film is unforgivable. No they did not shock me with any of their actions, they just made me sad. It also saddened me that any one those quality actors, involved in this film, actually allowed it to be released. I encourage anyone thinking about seeing it to pass it by.",
         "Was very disappointed in this film. Where to start? Well first of all, most of the movie is really just set-up for the last 1/4 of the movie yet nothing really much happens in all this time so I found myself just wondering when John Travolta would enter the picture. I guess the major problem with the movie is that Robin Wright Penn's character doesn't progress at all. Though there's supposed to be this time span of ten years between the first 3/4 of the movie and the last. So in the last 1/4 of the movie we find Robin Wright Penn's character in this home in the suburbs, married with kids and all, yet it's played as if she just stepped out of the gutter of the proceeding portion of the movie. Really makes no sense at all. It's a fairy tale and totally unbelievable. ***SPOILERS AHEAD**** And to accept the fact that she would just run off with Sean Penn's character (who's been in the nut house for 10 years) even though she hasn't kept in touch with him in all those years and has a new husband (Travolta) and kids and a whole life, yet she just leaves it all behind is just so silly. A similar scenario was played out much better in the end of the movie Castaway with Tom Hanks & Helen Hunt. In that movie he returns from the dead after having been stranded on an island for years. When he returns, he finds Hunt married with kids. Though they profess their love for each other, she of course, says she simply can't run off with him and leave her kids and her present husband. THAT folks is reality. What we have presented in this movie is just so much silliness. Shame too, because the acting's not bad. But basically what you have is a movie where the first 3/4 of it is one long boring set-up followed by a quick totally unbelievable last 1/4.",
         "None of the major characters in this movie is particularly redeemable, yet it remains a fascinating film. Eddie (Sean Penn) is a hard-drinking working guy, devoted to his friends and passionate about his wife Maureen (Robin Wright Penn). Eddie's mentally unstable; he has a very weak grasp on the concepts of time and space, and thus often vanishes for days at a time without realising how long he's been gone (and without understanding why Maureen worries about him). Maureen is equally passionate about Eddie; but he's been gone for three days at the start of the film, and their neighbour Kiefer is pleasant and more importantly -there-, and she accepts his offer of drinks and later of dancing. Kiefer pushes it too far, however, and though Maureen tries to keep the truth from him, Eddie finds out. His tenuous grasp on mental stability snaps at this point, and this is really the climax of the film. As has been mentioned before, this is not an Oscar-winning film. Not because it's not excellent -- with a script by John Cassavetes and command performances by both Penns (spectacular, really, both of them, in roles that would have been poorly played by clumsier actors) and John Travolta, and excellent supporting roles all around -- but because it isn't a Hollywood movie about Good versus Bad, with Good ultimately triumphing. People don't make good choices. People aren't particularly \"good\" parents. What ultimately happens isn't supposed to happen in the movies. But it does, and it's true to the characters, and it lifts this film up above the usual sugar-coated drabble we're so often fed by the cookie-cutter that is Hollywood."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Miramax",
         "Clyde Is Hungry Productions",
         "Sheen/Michaels Entertainment"
      ],
      "summaries": ["Maureen is pregnant and her husband Eddie is missing. Nervous, Maureen shares a couple of drinks with neighbor Kiefer, who tries to rape her and then beats her. When Eddie returns and finds his wife bruised, he goes ballistic, shoots a paramedic and is put in a psychiatric institution. Ten years later, Eddie is released and finds that Maureen has divorced him and is remarried with three children, one of whom is his little girl Jeanie. Eddie goes to reclaim his wife."],
      "budget": 18000000
   },
   "movielensId": 1600,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-29",
      "dvdReleaseDate": "2000-11-14",
      "directors": ["Nick Cassavetes"],
      "runtime": 100,
      "movieId": 1600,
      "title": "She's So Lovely",
      "mpaa": "R",
      "actors": [
         "Sean Penn",
         "Robin Wright",
         "John Travolta",
         "James Gandolfini",
         "Harry Dean Stanton",
         "Debi Mazar",
         "Susan Traylor",
         "Chris Kinkade"
      ],
      "imdbMovieId": "0120112",
      "originalTitle": "She's So Lovely",
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Mk4xerKgi9o"],
      "plotSummary": "Maureen is pregnant and her husband Eddie is missing. Nervous, Maureen shares a couple of drinks with neighbor Kiefer, who tries to rape her and then beats her. When Eddie returns and finds his wife bruised, he goes ballistic, shoots a paramedic and is put in a psychiatric institution. Ten years later, Eddie is released and finds that Maureen has divorced him and is remarried with three children, one of whom is his little girl Jeanie. Eddie goes to reclaim his wife",
      "tmdbMovieId": 38295,
      "avgRating": 2.83858,
      "releaseYear": "1997",
      "numRatings": 731,
      "posterPath": "/gDOgvYTg1CU6NIKQEFvznwHrxRq.jpg"
   }
}