{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dutch",
            "id": 1881
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "mobster",
            "id": 11578
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "1930s",
            "id": 214548
         }
      ],
      "imdb_id": "tt0119311",
      "video": false,
      "title": "Hoodlum",
      "recommendations": [
         59111,
         69485,
         84293,
         406582,
         213803,
         39310,
         86793,
         48843,
         20263,
         25573,
         389832,
         147879,
         308017,
         70576,
         20759,
         26293,
         143928,
         25646,
         6,
         49345
      ],
      "backdrop_path": "/8X2XRNOs3izinVwlPwd8ODWMZYe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bumpy Johnson",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e015229",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dutch Schultz",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e01522d",
               "name": "Tim Roth",
               "profile_path": "/hgaIXIW9GKnZhrweplBonG7uhhP.jpg",
               "id": 3129,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Francine Hughes",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e015231",
               "name": "Vanessa Williams",
               "profile_path": "/25QMiae8zSvSYObHDbYn1mgbOrz.jpg",
               "id": 27011,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lucky Luciano",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e015235",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Stephanie St. Clair",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e015239",
               "name": "Cicely Tyson",
               "profile_path": "/j7j7Qc1qi3W6JOqmPVWqqs5awjt.jpg",
               "id": 18249,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Illinois Gordon",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e01523d",
               "name": "Chi McBride",
               "profile_path": "/8SZovWxZzQ78uQp2rNzU9fKyYJS.jpg",
               "id": 8687,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Bub Hewlett",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e015241",
               "name": "Clarence Williams III",
               "profile_path": "/hDjTPLvUNDnoA6rHDX5JrftAWZa.jpg",
               "id": 15864,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Captain Foley",
               "gender": 2,
               "credit_id": "58d440a6c3a368124f0193a4",
               "name": "Richard Bradford",
               "profile_path": "/fGMexQI7Po1AuHO7masqwUWId1P.jpg",
               "id": 1272,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Thomas E. Dewey",
               "gender": 2,
               "credit_id": "58d440b892514103d20038e8",
               "name": "William Atherton",
               "profile_path": "/ulUP6CRnC3F6XmD3NH0AMJpVmln.jpg",
               "id": 7676,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Pigfoot Mary",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e015245",
               "name": "Loretta Devine",
               "profile_path": "/zLQFwQTFtHkb8sbFdkPNamFI7jv.jpg",
               "id": 18284,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Sulie",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e015249",
               "name": "Queen Latifah",
               "profile_path": "/ht52no1SMDhYBwRAmWL9a5YCss1.jpg",
               "id": 15758,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Lulu Rosenkrantz",
               "gender": 2,
               "credit_id": "58d440c4c3a368127c018f84",
               "name": "Ed O'Ross",
               "profile_path": "/jEMZrrxJ0DBQwyFF5tVl3WN4c8A.jpg",
               "id": 8658,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Albert Salke",
               "gender": 2,
               "credit_id": "58d440cc9251411faa019ac0",
               "name": "Mike Starr",
               "profile_path": "/9JrAo8iPqaLk4SrxMNq1sKHeKaK.jpg",
               "id": 5170,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Jules Salke",
               "gender": 2,
               "credit_id": "58d440d4c3a368127c018f91",
               "name": "Beau Starr",
               "profile_path": "/hUQfwJYLuaQhdx02MWhzQuwFzxW.jpg",
               "id": 42308,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Whispers",
               "gender": 2,
               "credit_id": "58d440ddc3a36812340190f3",
               "name": "Paul Benjamin",
               "profile_path": "/lzZ0SL2I7I4EU4jcj1gtlPwv0NE.jpg",
               "id": 15534,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4432c3a368484e01524f",
               "name": "Bill Duke",
               "profile_path": "/46uPgJKKjAhPak4G7526ZFHiRvA.jpg",
               "id": 1103,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4432c3a368484e015255",
               "name": "Chris Brancato",
               "profile_path": null,
               "id": 64506,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57edfb8bc3a3682ab7000b48",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57edfb929251415e39000afb",
               "name": "Frank Tidy",
               "profile_path": "/8IHxkjqkL4UOGUCrADCG0w3g0kj.jpg",
               "id": 59955,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57edfb989251415daa000b32",
               "name": "Harry Keramidas",
               "profile_path": null,
               "id": 1061,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.344442,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22073,
      "vote_count": 43,
      "budget": 30000000,
      "overview": "In 1934, the second most lucrative business in New York City was running \"the numbers\". When, Madam Queen, the powerful woman who runs the scam in Harlem, is arrested. Ellsworth \"Bumpy\" Johnson takes over the business and must resist against the invasion from merciless mobster Dutch Shultz.",
      "similar": [
         400,
         769,
         8012,
         37645,
         156022,
         10651,
         64689,
         8456,
         240,
         24,
         23483,
         281957,
         241554,
         588,
         74997,
         366964,
         445954,
         398175,
         133805,
         341006
      ],
      "original_title": "Hoodlum",
      "runtime": 130,
      "poster_path": "/pl4S4tU4qcXp9wBHnJCso2xcq8P.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Artists Pictures",
         "id": 16685,
         "origin_country": ""
      }],
      "release_date": "1997-08-27",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Power is measured in enemies.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill Duke"],
      "runtime": 130,
      "synopsis": null,
      "writers": ["Chris Brancato"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119311/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA3OTQ0NjM0M15BMl5BanBnXkFtZTcwNTMzNjIyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Laurence Fishburne, Tim Roth, Vanessa Williams | See full cast and crew »"],
      "reviews": [
         "It seems to me like in today's film world, critics, whether it be Ebert or the viewers, are quick to down a film if it has a large budget. I think Hoodlum fell victim to this epidemic. With a bankroll of wonderful actors and actresses, and some of the best historical recreation of the locations, the movie delivers. The plot was simple, but it doesn't need to be complicated in a gangster flick like this. It was based on real people, so the creators of the film cannot go ballistic on changing the story. Maybe the 'critics' would like it better if it had a little green man who uses the force, or maybe a future crime prevention device. Well, you won't find this here. It's a wonderful, semi-true story about the way things were in Harlem and the surroundings areas back then. Fishburn turned in a wonderful performance, and Roth played a great villian as he always does. Just relax, and take it for what it's meant to be. Entertainment.",
         "I really enjoyed this film. As far as crime dramas go it is up there with The Godfather to me. Laurence Fishburne was great in his role as Bumpy Johnson. Tim Roth gave a great performance also. The film did a great job portraying the inner turmoil of people. Also it did a great job at showing the racist attitudes of the times. Example: Dutch asking his main guy, who is black to wrap up his (shultz) sandwich scraps so that he (the black guy) could take them home to feed his grandkids. Classic subtle racism. The clothes and the music were also good for the period. One scene was even shot at the cotton club which no movie during this period is complete without. Great Job! Great Film!",
         "I had this movie on homemade VHS for a while and just received the DVD. Mesmerizing!!! Beautifully Filmed! Hats off to Bill Duke - another very distinguished African-American director!! Once you get past the fact that the movie is FILLED with phenomenal performances from the likes of Laurence Fishburne, Andy Garcia, Tim Roth, Vanessa Williams. Queen Latifah, Loretta Devine, Clarence Williams III, and of course, Miss Cicely Tyson you also discover a gem of a movie. It follows the exploits of a 30s Harlem gangster Bumpy Johnson. Fishburne reminds you of why he is such a charismatic actor. His performance here is one you can watch over and over again. Of course the movie may have been exaggerated but what movie isn't?! It is a very stylized presentation and the obvious attention to detail to create the look and the feel of the period help intensify the viewing experience. I am quite proud of the production and highly recommend it become part of your movie collection. Notwitstanding that is a worthy project, there are treasures of performances here that warrant attention.",
         "\"Hoodlum\" is a film that deserved much better. Bill Duke, its talented director, gives us a picture of what the Harlem of the thirties was like. In fact, \"Hoodlum\" suffers when it's compared to Coppola's \"The Cotton Club\". Mr. Duke, an actor himself, was able to amass a great cast and he got performances that are amazing from this first rate ensemble. The cast headed by the brilliant Laurence Fishburn is amazing. Mr. Fishburn is basically the whole reason for watching the film. His Bumpy Johnson is a larger than life figure in that era. Tim Roth also is quite amazing as Dutch Schultz, a white man who saw the hidden treasures of the black community of Harlem and tried to capitalize in that world. Andy Garcia plays Lucky Luciano, an Italian man who also was instrumental in the criminal activities one sees in the film. Also in the cast, Vanessa Williams, Cicely Tyson, Loretta Devine, William Atherton, Queen Latifah, and the rest, respond well to Mr. Duke's command. The film is entertaining and will not disappoint fans of the genre, or of Mr. Duke.",
         "Hoodlum.....what can I say, if you had cool Grandparents that grew up in Harlem in the 1930's who liked to party, dress and play numbers then maybe you'd of heard some of the stories about the going ons in Harlem U.S.A. during that period. Numbers were literally the Black mans lottery back then and communication between runner and player no matter how small the amount played was the lug that connected dreams with hope for the little guy; Hoodlum is a story about the preservation of those hopes and dreams by a one Bumpy Johnson. The music, wardrobe and cinematography is superb, I highly recommend this tale of Harlem history. Macheeste~",
         "Riveting film about gang wars and race relations in 1930s New York, with Ellsworth \"Bumpy\" Johnson (Laurence Fishburne) at the center. Engaging characters and situations make this overlong movie watchable; but Andy Garcia doesn't channel Luciano as well as he should, and Tim Roth turns Dutch Schultz into such a blatant stock villain that one wonders what the real Arthur Fleggenheimer was like. Otherwise, excellent performances all around - and Paul Benjamin steals several scenes as a creepy assassin who talks as if he eats tobacco leaves for breakfast. Emotional and powerful.",
         "The 1997 movie `Hoodlum' takes place during the depression. A black man named Ellsworth `Bumpy' Johnson (Lawrence Fishburne) was released from prison and went back to Harlem. Then he joins his cousin, Illinois Gordon, and gets back into an illegal lottery racket ran by Madame Queen. They call the game `numbers.' They say that numbers is the only business in Harlem which provides them with work. A white man from uptown named Dutch Shultz (Tim Roth) is also trying to run the numbers downtown in Harlem, and there ends up being a battle between Shultz and the Queen. Madame goes to jail and leaves Bumpy in charge. Bumpy meets a fine woman, Francine (Vanessa Williams), who sees good in him and wants him to stop messing around with `numbers.' But she stays by his side while things get chaotic. Will he realize what he should do in time or will he lose everything? The director Bill Duke has a message in this movie. It says when people are left limited options, they are going to find a way to get by. In one scene, Bumpy is telling Illinois because of the depression there isn't very many jobs and white men didn't leave them any jobs, so they had no options for making money other than through the numbers racket. This movie had fast paced action. I liked the part where Dutch Shultz wants Madame Queen's organization out of the numbers racket in Harlem, so he can make all the money from it. Bumpy, who works for Madame Queen, comes up with a plan for eliminating the problem of Dutch, by getting Lucky Luciano (Andy Garcia), another gangster, and Dutch in a fight. This movie is a `classic gangster movie.'",
         "Snap-brim fedoras, vintage autos, blazing Tommy guns, corrupt public officials and greedy mobsters battling it out over turf rights recur throughout director Bill Duke's violent, 1930s' racketeering epic \"Hoodlum,\" a pictorially authentic actioneer that evokes memories of the classic Robert Stack television series \"The Untouchables.\" Although \"Hoodlum\" boasts a top-drawer cast, including Laurence Fishburne, Vanessa Williams, Tim Roth, and Andy Garcia, this lavishly mounted but uneven gangster saga suffers from its rambling length, garrulous script and a shortage of shoot-outs. As the first major film to headline the crimes of Harlem's infamous Black Godfather Ellsworth 'Bumpy' Johnson, this production offers a novel departure for audiences that are weary of superheroes, female warriors and hard-bitten cops who have were crowding the big-screen when \"Hoodlum\" appeared in 1997. The Chris Brancato screenplay introduces Bumpy in 1934 as he exits Sing Sing Prison. Duke and Brancato exert great pains to differentiate Bumpy from the typical African-American mobster. He peruses books, plays chess, and pens poetry. As literate as Bumpy is, he can pull a trigger or wield a knife without a pang of remorse when somebody threatens a person who he loves. Like \"The Godfather II\" and \"Once Upon A Time in America,\" \"Hoodlum\" charts the rise of the Godfather of Harlem in a ruthless game of survival that claims his best friend Illinois Gordon (Chi McBride of \"I, Robot\") and leaves Bumpy forever altered by the gory experience. Ostensibly, you won't see anything in \"Hoodlum\" that you haven't seen in dozens of other crime films. \"Hoodlum\" features notorious real-life racketeers such as Dutch Schultz (Tim Roth of \"Pulp Fiction\") and Lucky Luciano (Andy Garcia of \"Godfather III\") as well as corrupt special prosecutor Thomas Dewey (William Atherton of \"The Sugarland Express). When Bumpy arrives in Harlem, he watches a numbers runner working for Madam Stephanie St. Clair (Cicely Tyson) who is the so-called 'Queen of the Numbers.' The Dutchman craves to absorb the territory that the Madam has struggled for a decade to build into the number one home-grown Harlem business. Bumpy vows to prevent any takeover by the Irish mob. Meanwhile, the boorish, grubby, low-life Schultz refuses to appease Lucky or Bumpy. Along the way, Bumpy falls in love with righteous Francine (Vanessa Williams) who wants him to find respectable work. Bumpy refuses to stoop to menial employment. When Dutch cannot kill the Madam, he bribes a judge to send her to the pen. Bumpy supervises the Madam's empire at her request during her absence. Bumpy's bloodthirsty methods clash with her live-and-let-live notions. Eventually, Luciano and Bumpy strike a deal, and Dutch finds himself out in the cold. Suddenly, gangster gunfire chops down a young, innocent numbers runner. Now, Bumpy's cronies think that he has gone too far. Francine bails out on him more out of the formulaic dictates of the story than for any motivated reason. So do the filmmakers. The second half of the movie shows Bumpy losing favor with everybody. The film's publicity notes claim that \"Hoodlum\" is complete fiction, but historical characters populate the story. Of course, movies rarely recreate history with any fidelity. History is more chaotic than dramatic, so filmmakers recast it to fit their dramatic formulas. One way is by cutting the number of characters. Refusing to portray these events as they actually occurred, Duke and Brancato blow a fantastic opportunity to exploit their melodramatic potential. Duke, whose directorial credits include \"Deep Cover\" and \"A Rage in Harlem,\" wrestles with the obvious lapses in Brancato's script. The length of \"Hoodlum\" may have been cut by the studio to squeeze in more showings in a single evening. The action grows and takes on an episodic quality when Bumpy becomes callous. After the first half, the film's momentum bogs down, and \"Hoodlum\" loses its air of fun. The time has come for the characters to pay the piper. The filmmakers embrace a curious morality. In most gangster movies, the hoodlum hero must die. Bumpy gets off easy, as does Luciano and only Dutch antes up with his life. Duke and Brancato allow their criminals greater leniency. The gangsters are less cancerous than the defenders of justice. Consequently, \"Hoodlum\" concludes on an anti-climax. Moreover, the filmmakers neglect to post an epilogue about Bumpy's outcome. For the record, the gangster who hires Shaft to find his kidnapped daughter in \"Shaft\" is a variation on Bumpy\" as is the kingpin mobster in \"American Gangster\" with Denzel Washington. The problem with Brancato's script is its uneven quality. The action-packed first half is more entertaining than the tedious, long-winded second half. The filmmakers glorify Bumpy initially as a Robin Hood gangster who steals from a rival mob and gives to Harlem's starving citizens. Fishburne is riveting as a tough-as-nails but warm-hearted criminal. Roth takes top acting honors, however, as Dutch Schultz and looks like he had a ball exaggerating those vile elements in Schultz's psychotic behavior. Garcia epitomizes sartorial urbanity as the peace-making Italian gangster who divides his time between Bumpy, Dutch, and special prosecutor Dewey. Atherton's egotistical special prosecutor bristles with revulsion in his dealings with these crooks, but accepts their bribes. The filmmakers make the repressive Dewey appear particularly loathsome, a Judas whose contempt for the mob is exceeded only by his mockery of justice. Despite some flavorful dialogue, \"Hoodlum\" plays it straight down the line as a dramatic shoot'em up. Audiences expecting a variation on Eddie Murphy's \"Harlem Nights\" may leave this Fishburne film disappointed. Although it's no \"Godfather,\" \"Hoodlum\" is definitely above-average and far beyond those 1970s camp classics that headlined Fred Williamson as the black Caesar of crime in \"Hell Up in Harlem.\" If you enjoy gangster epics, \"Hoodlum\" is worth the price of admission. Some critics have savaged \"Hoodlum\" for its debatable morality. Ironically, Bumpy rises to the summit of his profession. At fade-out, however, Duke and Brancato show that the gangster's life is one that leaves you standing alone in the rain outside the church door without a friend.",
         "A solid, well-to-do flick, \"Hoodlum\" is a good film trying to live up the dying genre of the 1930's gangster flick. Laurence Fishburne is in top form as Bumpy, an ex-con from Sing Sing who becomes a big time ganglord in Harlem. While not tackling enemies such as Dutch Schultz (Tim Roth) and Lucky Luchiano (Andy Garcia), Bumpy romances his girl Francine (the fine Vanessa Williams). Packed with machine gun-toting violence, \"Hoodlum\" has the cool style of modern day crime thrillers such as \"New Jack City\" and the sneering Al Caponeish look of the old style",
         "How great this film could have been! It uses the real history of New York's Gangsters as a background and seems reasonably well researched. At times. Personally, however, I have several gripes with this movie: The irritatingly predictable script and much too clean-polished setting seem to come straight out of a \"screenwriting-for-housewives\" class. The \"messages\" in the film (such as its anti-racist and pro-religious scenes) are horribly blatant. The romantic scenes and musical interludes are much too long and boring; the violent scenes too short and clean. Johnson is portrayed as a good gangster at first, which almost works out. His \"internal struggle\" theme doesn't work at all. The supposedly elegant Gangster Luciano has to shlep a horrible dog around with him throughout the film. Bumpy Johnson's friend ist forced to do a horrible \"funny negro singer\" routine, offsetting the supposedly antiracist messages. And that Bumpy Johnson, at the end of the film, finds Gawd and turns away from the evil gangster life is a) predictable and b) idiotic. \"Hoodlum\" could've been a great film. As it is, it's merely mediocre."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["United Artists Pictures"],
      "summaries": [
         "The film focuses on the war of two gangs in 1930s Harlem for the control of illegal gaming - one headed by black strategic godfather Bumpy Johnson and another by white ruthless hothead Dutch Schultz. Negotiations proposed by white syndicate boss Lucky Luciano never get under way, blood flows and Johnson gets jailed. When Johnson is paroled, he gets the work of enforcer for mighty Stephanie \"The Queen\" St. Clair. She is also jailed for racketeering and when she leaves she makes him promise \"no violence\".",
         "Tells the story of how Ellsworth \"Bumpy\" Johnson helped Madame Stephanie St. Clair keep Dutch Schultz from taking over her Harlem numbers racket.",
         "In 1934, the second most lucrative business in New York City is a lottery know to the locals as \"the numbers\". Someday, Madam Queen, the powerful woman who runs the scam in Harlem, is arrested. Ellsworth \"Bumpy\" Johnson takes over the business and must resist against the invasion from merciless mobster Dutch Shultz.",
         "Black gangsters in 1930 Harlem fights Dutch Schultz who is trying to horn in on their numbers racket."
      ],
      "budget": 0
   },
   "movielensId": 1601,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-27",
      "dvdReleaseDate": "1998-02-04",
      "directors": ["Bill Duke"],
      "runtime": 130,
      "movieId": 1601,
      "title": "Hoodlum",
      "mpaa": "R",
      "actors": [
         "Laurence Fishburne",
         "Tim Roth",
         "Vanessa Williams",
         "Andy García",
         "Cicely Tyson",
         "Chi McBride",
         "Clarence Williams III",
         "Richard Bradford",
         "William Atherton",
         "Loretta Devine",
         "Queen Latifah",
         "Ed O'Ross",
         "Mike Starr",
         "Beau Starr",
         "Paul Benjamin"
      ],
      "imdbMovieId": "0119311",
      "originalTitle": "Hoodlum",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["MBumkLUp-Lk"],
      "plotSummary": "In 1934, the second most lucrative business in New York City was running \"the numbers\". When, Madam Queen, the powerful woman who runs the scam in Harlem, is arrested. Ellsworth \"Bumpy\" Johnson takes over the business and must resist against the invasion from merciless mobster Dutch Shultz.",
      "tmdbMovieId": 22073,
      "avgRating": 2.89224,
      "releaseYear": "1997",
      "numRatings": 696,
      "posterPath": "/pl4S4tU4qcXp9wBHnJCso2xcq8P.jpg"
   }
}