{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kids and family",
            "id": 9963
         },
         {
            "name": "based on tv series",
            "id": 10988
         }
      ],
      "imdb_id": "tt0119509",
      "video": false,
      "title": "Leave it to Beaver",
      "recommendations": [
         26258,
         41779,
         31246,
         61728,
         79500,
         44020,
         46286,
         18943,
         32685,
         68927,
         36047,
         26450,
         18935,
         25697,
         180243,
         26386,
         58048,
         21793,
         17745,
         25969
      ],
      "backdrop_path": "/uJ7F0uYn5PwH3KJ9wQ2X4PTiZEW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Ward Cleaver",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d051",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "June Cleaver",
               "gender": 1,
               "credit_id": "52fe46369251416c9104d055",
               "name": "Janine Turner",
               "profile_path": "/52pvn7fi9siuBGwntyklTHpHxCI.jpg",
               "id": 51580,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Theodore 'Beaver' Cleaver",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d059",
               "name": "Cameron Finley",
               "profile_path": "/kveRt3GkfcNFGFbOwwwkjExpadP.jpg",
               "id": 215830,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Wallace 'Wally' Cleaver",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d05d",
               "name": "Erik von Detten",
               "profile_path": "/twnF1ZaJ1FUNUuo6xLXwcxjayBE.jpg",
               "id": 12901,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Edward 'Eddie' Haskell Jr.",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d061",
               "name": "Adam Zolotin",
               "profile_path": "/tkaFxHz4rtsY7Nqd2pljwFLQIZT.jpg",
               "id": 53123,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Fred Rutherford",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d065",
               "name": "Alan Rachins",
               "profile_path": "/zM62T7sKS5SdRM4fZAmtx0PzwDt.jpg",
               "id": 105626,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Miss Landers",
               "gender": 1,
               "credit_id": "52fe46369251416c9104d069",
               "name": "Grace Phillips",
               "profile_path": null,
               "id": 167718,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Football Coach Gordon",
               "gender": 2,
               "credit_id": "52fe46369251416c9104d06d",
               "name": "Geoff Pierson",
               "profile_path": "/vhLTZ86i4fa5NbhpHoORIe0pKIl.jpg",
               "id": 25879,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Karen",
               "gender": 1,
               "credit_id": "52fe46369251416c9104d071",
               "name": "Erika Christensen",
               "profile_path": "/a2o0FlVZegV7f99fCZvwszL9qBd.jpg",
               "id": 21711,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46369251416c9104d041",
               "name": "Andy Cadiff",
               "profile_path": "/iQrb6bvjpRbVEPVZwzChl4HtXI5.jpg",
               "id": 80307,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46369251416c9104d04d",
               "name": "Joe Connelly",
               "profile_path": null,
               "id": 218277,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59c1a769c3a3682c6f000b6c",
               "name": "Bob Mosher",
               "profile_path": null,
               "id": 1226665,
               "department": "Writing",
               "job": "Idea"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.721355,
      "production_countries": [],
      "id": 37244,
      "vote_count": 23,
      "budget": 0,
      "overview": "Cleavers are an all-American family living in Ohio - wise father Ward, loving mother June, teen-age son Wally and 8-year-old \"Beaver\" Theodore. Beaver hopes to get a bike as a gift from his father and to please him tries out for his school football team and he makes it, only to be embarrassed. The bike he gets is quickly stolen. Meanwhile Wally is trying to help his friend Eddie Haskell to get the heart of pretty classmate Karen, but Karen seems to like Wally more, and that leads to tensions between the friends.",
      "similar": [
         8871,
         9487,
         13053,
         10137,
         10122,
         13417,
         14113,
         27996,
         15907,
         34560,
         36257,
         50546,
         39451,
         927,
         1885,
         26441,
         35101,
         60897,
         16508,
         32611
      ],
      "original_title": "Leave it to Beaver",
      "runtime": 84,
      "poster_path": "/5kIB8EOMVZ8R5buObgD6p7hkwCx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1997-08-22",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "The Beav is back.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andy Cadiff"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Bob Mosher",
         "Joe Connelly"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119509/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMTY3NTc2Ml5BMl5BanBnXkFtZTcwNTgxMTkxMQ@@._V1_SY317_CR57,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher McDonald, Janine Turner, Cameron Finley | See full cast and crew »"],
      "reviews": [
         "As someone who grew up watching \"Leave It To Beaver\" on television, and now on DVD, this \"upgraded\" movie version is disgusting. Out-of-touch movie critics like Porter & Martin, who have a best-selling paperback book each year of short movie reviews of anything on tape or disc, called this \"wholesome\" fun. In fact, they said it was so wholesome kids of today might not want to see it, meaning it was too goody-goody for them. This shows you how out-of-touch film critics can be because compared to that 1950s show, this is HARDLY a wholesome movie. In this LITB, the young guys are all after girls and sex, use the word \"suck\" all the time and the story is filled with 1990s-type Hollywood portrayals and comments (Beaver was excited because he saw an R-rated movie, etc.) Overall, it's still a kid's movie and Cameron Finley is \"cute\" as Theodore \"Beaver\" Cleaver and his parents are nice, but there are too may moral problems with this version. Stick to the TV shows, especially now that the first two seasons on DVD. Those are fantastic.",
         "I rented the movie with great hope I watch a \"Leave it to Beaver\" rerun every time they come on. What I got was a cheap overated mockery of great television. They turned the show into a complete mess. The characters, with Eddie Haskell as the one exception, were not even similar to that of the TV show. If it ain't broke don't fix it and next leave good wholesome television alone.",
         "After hearing that Erik Von Detten was in this movie when he was younger... I was very curious to see it. Once the movie started, I could tell it was sort of a satire... which is totally cool and fun to watch. Beaver is a very charming character and Wally would be the perfect child if he acted the same in today's society. This movie had my attention the whole way through. It was totally cute, and had a lot of references that little kids may not \"get\" ... Erika Christiansen is in this movie too and she looked way different back then. I think they did a good job in this movie trying to portray the way children think and act and perceive the world. Although the mother is portrayed a bit like a Stepford Wife, it isn't that big of a distraction. You really begin to feel for the characters in this movie even though there hasn't been a whole lot of character development.",
         "Seems amazing what trouble a little kid can get himself into at times. Quite an interesting watch - the plot revolves around the kid Beaver and the problems he has trying to do the things that will get his father to approve of him and like him more, and his older brother's attempts to woo a girl who likes another. Somehow, these people all manage to entangle themselves into one another's lives and makes for some pretty predictable sequences and scenes. But I like shows with kids as stars, and this is one of the better ones to come from the studios.",
         "I grew up watching this show and I couldn't wait until the movie came out. After I watched it , the video was in my hands. Since it was made from a tv series like The Brady Bunch , it beat them by a long shot. It's worth watching and there's one scene that will tell you something if you pay attention to it. This is when the Beaver and his father are in the coffee cup and they're talking about ' the look '. Eddie Haskell ( Ken Osmond ) appeared to have the right idea on his acting. Being around Ward and June he so polite but if he was with Wally or the Beaver it would be like he knew everything. Everyone else did a good job also. I liked the times whenever Lumpy would be so sloppy and eat anything in sight. The funny thing about this movie is , when he got his bike for his birthday it brings back memories when I got one I kept dreaming about. It's a 20\" red Diamond Back , alloy frame , three piece crank & double wall rim ( for all you riders to give you an idea.) That Christmas I thought it was over but sure enough at the last minute here it comes. It was 30* outside but I could care less ! I changed clothes and went for a spin. Since then it's been spotless and this was 4 years ago. I still have it. Again as the movie , there's nothing wrong with it and enjoyable / relaxing for the whole family. There is a true example on this - DON'T let strangers ride your bike no matter what they say. Also lock it up. One time I thought mine was safe and I was gone for only 30 seconds. When I came out , it was gone but I caught them.",
         "I have read a bunch of these other reviews, in which many people seem to strongly dislike the 1997 movie \"Leave it to Beaver.\" Well, I have one question for them: Do you even watch the show?! The 1997 movie combines countless themes and storylines from various episodes of the original series, a technique that is enjoyable and funny. The actors are great, and it is wonderful to see some of the original show's cast making cameos in the film (such as the actors who originally played June Cleaver, Eddie Haskell, and Lumpy). The movie gives a fresh twist to a classic television series, and effectively bridges the gap between generations. This film is enjoyable for younger children and teens who may not have seen the original series, as well as being exciting for parents or other adults who know and love the Cleaver clan from way back in the 50s. This film is a true winner, despite pointless criticisms that it may have received.",
         "Throughout watching practically this entire movie, I had a stupid grin on my face. That's the kind of film this is. It's cheesy, sentimental, substandard, and predictable. . . . and I enjoyed it. Before watching it, I had never seen an episode of the classic sitcom ''Leave it to Beaver'', from which this movie is based, but I was acquainted enough with the material to expect some Dennis the Menace type antics. And that's what I got. It's hard to figure out if the movie is winking at us; it just seems so cheerfully absurd! It basically follows the story of Beaver, a trouble-prone young boy, and his adventures and misadventures. The film's setting is in a suburban neighbourhood stuck somewhere between 1950 and 1990. Although I was really entertained, this movie's definitely not very good. But if you want a heartwarming and gentle film that's very ridiculous, you might want to check this one out.",
         "Before watching the film, I realized it must have been quite a challenge, not to the actors, but to the writers, to update it. With knowledge of writing, I figured one writer could probably do it, but that a team would probably dilute it terribly. Four writers are listed, two as major writers, so it isn't as badly diluted as if a large team did it. And the writers did well. We have an up to date Beaver, with an up to date world, but still keeping in the story line of basic day to day life struggles, and drawing some comedy from them. If I was to nit pick, it would be at the parents. Ward and June are nothing like the old series. While the other characters seemed perfectly cast, it looked like there was an attempt to deviate from Beaumont and Billingsley in the portrayal of the parents. Hugh's Ward was not nearly the pretty boy we see in this movie. Nor was he as ill tempered. Hugh was the personification of moderation. That said, the actors were all very good. I've worked in little \"real life\" depiction films before, and each scene is extremely time consuming to film, and the more \"ordinary\" a scene appears, the more time it takes to film it. This, of course, is because Fantasy can have multiple depictions, but watching a grade school Football game is \"watching a grade school Football game\", and less can be left to chance. In these scenes, it really looks like all the participants were very patient. Not many people realize how much tougher an innocuous movie like this is to film. I always laugh when small movie producers will be reluctant to do a Fantasy based movie because of budget, when the budget for this sort of film is set at a large scale, while one can be lax with the other. This new LEAVE IT TO BEAVER did a lot of very good things. The way the characters interwove throughout the piece was especially good. A little storybook? Not nearly so much as one would think, and no more story book than mere coincidence of all that can happen in a day will allow. It looks like the writers spent a ton of energy into interweaving the characters in the story, and came up with a very elaborate, well designed scheme. Some very well done scenes, like the skating rink, but it's not fair to single these out, because all of the scenes were well done. I won't credit the director for keeping an entire cast and crew in line, because it is the cast and crew who deserve credit for their patience. Anyone could direct a team as disciplined as this. That's not to put down the director. You have only to look at my high rating of the film to know how I feel about that. Everything was well done. I was pleasantly surprised.",
         "Leave it to Beaver is not what I would have chosen from the video shop shelves, but it really surprised me. I've never seen the old TV series (too young for that), and I don't know if the movie relates to it in any way. It's nice and genuine fun for the whole family. That movie got me, my parents and all my brothers stuck on the couch for two hours! Tha misadventures of this cute little boy are amazing! It's the kind of thing anyone of us has been through: parents pressure, looking up to your older brother, breaking things... all that happens when you're 8 and have a lot of energy to spend. You'll be glad you watched it.",
         "Big screen treatment of the classic '50's comedy series. It's got size and color and a score and stunts, but little of the charm or innocence or sincerity of the original which is what made it great. The script is distractingly episodic. Over all it is slick enough to hold the attention of a child, but fans of the tv show should stay far away."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Robert Simonds Productions",
         "Universal Pictures"
      ],
      "summaries": [
         "Cleavers are an all-American family living in Ohio - wise father Ward, loving mother June, teen-age son Wally and 8-year-old \"Beaver\" Theodore. Beaver hopes to get a bike as a gift from his father and to please him tries out for his school football team and he makes it, only to be embarrassed. The bike he gets is quickly stolen. Meanwhile Wally is trying to help his friend Eddie Haskell to get the heart of pretty classmate Karen, but Karen seems to like Wally more, and that leads to tensions between the friends.",
         "The Cleavers are an all-American family living in Ohio - wise father Ward, loving mother June, 12 year-old son Wally and 8 year-old son Beaver. Once Beaver sees a shiny red bike in a bike shop, he really wants it. Wally's seriously obnoxious friend Eddie gives Beaver the advice to \"suck up\" to his father by playing football. Soon it's Beaver's birthday and he gets a computer from his Aunt Martha and the shiny red bike he really wanted from his parents (I was thinking Wally told them about it). On the first day of school, Wally rides Beaver to school. After school, Wally and Beaver meet up with Eddie and Wally and Eddie go into the soda shop while Beaver waits outside. Suddenly, some other kid much older than Beaver comes and starts showing Beaver a lot of bike tricks. On the last trick, he takes off and does not come back. At dinner, Beaver and Wally tell Ward and June about the bike. At school the next day, Beaver has to see Miss Landers after school because of his failing grades. Soon after Wally tries to hook up Eddie with Karen, a classmate who seems to like Wally better than Eddie. Wally and Eddie get invited to Karen's boy-girl party and everyone plays Spin the Bottle. Wally ends up with Karen and after they start hanging out together. Soon after Wally gets Karen taken away from him by Kyle, Karen's former boyfriend. After that, Kyle and the kid who stole Beaver's bike dares Beaver to go into the giant coffee cup above the coffee shop. Ward and June soon find out about the football team and the being left behind in school."
      ],
      "budget": 15000000
   },
   "movielensId": 1602,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-22",
      "dvdReleaseDate": "1998-01-20",
      "directors": ["Andy Cadiff"],
      "runtime": 84,
      "movieId": 1602,
      "title": "Leave it to Beaver",
      "mpaa": "PG",
      "actors": [
         "Christopher McDonald",
         "Janine Turner",
         "Cameron Finley",
         "Erik von Detten",
         "Adam Zolotin",
         "Alan Rachins",
         "Grace Phillips",
         "Geoff Pierson",
         "Erika Christensen"
      ],
      "imdbMovieId": "0119509",
      "originalTitle": "Leave it to Beaver",
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["OcAxeKCisrA"],
      "plotSummary": "Cleavers are an all-American family living in Ohio - wise father Ward, loving mother June, teen-age son Wally and 8-year-old \"Beaver\" Theodore. Beaver hopes to get a bike as a gift from his father and to please him tries out for his school football team and he makes it, only to be embarrassed. The bike he gets is quickly stolen. Meanwhile Wally is trying to help his friend Eddie Haskell to get the heart of pretty classmate Karen, but Karen seems to like Wally more, and that leads to tensions between the friends.",
      "tmdbMovieId": 37244,
      "avgRating": 2.05488,
      "releaseYear": "1997",
      "numRatings": 492,
      "posterPath": "/5kIB8EOMVZ8R5buObgD6p7hkwCx.jpg"
   }
}