{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "diamond",
            "id": 1384
         },
         {
            "name": "liberation of prisoners",
            "id": 2019
         },
         {
            "name": "transport of prisoners",
            "id": 3543
         },
         {
            "name": "interview",
            "id": 4434
         },
         {
            "name": "arrest",
            "id": 5638
         }
      ],
      "imdb_id": "tt0119695",
      "video": false,
      "title": "Money Talks",
      "recommendations": [
         14577,
         9448,
         30963,
         16300,
         11676,
         8860,
         9776,
         14034,
         13408,
         9458,
         9308,
         10723,
         16096,
         26352,
         6522,
         12475,
         11517,
         26180,
         11001,
         12253
      ],
      "backdrop_path": "/vwek6Wv8LTHFiUCZAVD3pKqFcDo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Franklin Hatchett",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41af",
               "name": "Chris Tucker",
               "profile_path": "/9RQvgEi1GnPK4QzqOGHL3jP3VZr.jpg",
               "id": 66,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "James Russell",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41b3",
               "name": "Charlie Sheen",
               "profile_path": "/g4e1QpcNTpmq2uPr5GDNuMvjRuU.jpg",
               "id": 6952,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Grace Cipriani",
               "gender": 1,
               "credit_id": "52fe44f5c3a36847f80b41b7",
               "name": "Heather Locklear",
               "profile_path": "/ryFO3TlhGi0mddbHECswjzsiF51.jpg",
               "id": 58691,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Guy Cipriani",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41bb",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Paula",
               "gender": 1,
               "credit_id": "52fe44f5c3a36847f80b41bf",
               "name": "Elise Neal",
               "profile_path": "/6Z6LVIlaCVMWsRgOPFOA4NOXAQO.jpg",
               "id": 21215,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b418d",
               "name": "Brett Ratner",
               "profile_path": "/957qMp4h7kLlWehsDhznI39G7zr.jpg",
               "id": 11091,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4193",
               "name": "Walter Coblenz",
               "profile_path": null,
               "id": 13718,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f5c3a36847f80b4199",
               "name": "Tracy Kramer",
               "profile_path": null,
               "id": 58690,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b419f",
               "name": "Joel Cohen",
               "profile_path": "/cCJDIvQatfefZtB9cI49S2L3erC.jpg",
               "id": 12892,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f5c3a36847f80b41a5",
               "name": "Alec Sokolow",
               "profile_path": "/v79vlRYi94BZUQnkkyznbGUZLjT.jpg",
               "id": 12893,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41c5",
               "name": "Chris Tucker",
               "profile_path": "/9RQvgEi1GnPK4QzqOGHL3jP3VZr.jpg",
               "id": 66,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58070fc59251415a7a01135d",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58070fd29251415a54011bbe",
               "name": "Tony Pierce-Roberts",
               "profile_path": null,
               "id": 3960,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.984882,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9416,
      "vote_count": 109,
      "budget": 0,
      "overview": "Money Talks is a 1997 American comedy film directed by Brett Ratner. Sought by police and criminals, a small-time huckster makes a deal with a TV newsman for protection.",
      "similar": [
         107846,
         5925,
         1701,
         11471,
         9291,
         1368,
         1369,
         708,
         76640,
         38234,
         11808,
         11615,
         1429,
         5176,
         278,
         709,
         10447,
         5971,
         13291,
         134411
      ],
      "original_title": "Money Talks",
      "runtime": 97,
      "poster_path": "/bN57Rl003E9pYred5kw9Rp8h9Np.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1997-08-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "This ain't no buddy movie.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brett Ratner"],
      "runtime": 97,
      "synopsis": "Chris Tucker once again hilarious trash talkin' a rich white dude! Charlie Sheen has nice teeth. Freddy Prince Jr. no where to be found. Mr Rattner, genius thank you! Yes.",
      "writers": [
         "Joel Cohen",
         "Alec Sokolow"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119695/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNzU5Mzk1OV5BMl5BanBnXkFtZTcwMjIyMTIyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Charlie Sheen, Chris Tucker, Heather Locklear | See full cast and crew »"],
      "reviews": [
         "Plot summary: Franklin Hatchett (Tucker) is a small time con man who instantly becomes famous (or infamous depending on how you look at it) after he escapes from prison. Mistakenly wanted for murder by the police and wanted for robbery by a gang of crooks, Hatchett's only hope to clear his name and get out of this mess is a television reporter named James Russell (Sheen). This movie was just a good time. After seeing Rush Hour with Chris Tucker and Jackie Chan, I wanted to go back and see earlier comedies with Chris Tucker in a starring role. (I already saw Dead Presidents, The 5th Element and Friday, but they either weren't comedies or he wasn't a starring character.) Again, this movie was a good time. It doesn't deserve to win any awards, but it's just fun to watch. The entire cast offers great performances, while it's always good to see Paul Sorvino perform. While Tucker's character isn't exactly the nicest guy, the audience feels bad for him. The audience is made to feel that he does what he does because he has to. In his situation, I don't think many people would do otherwise. While he does take things to extremes, the movie wouldn't be as fun if he didn't. I would recommend this movie to any comedy fan, \"buddy movie\" fan or fan of the actors.",
         "Chris Tucker and Charlie Sheen are excellent and hilarious in this great movie. Almost all of the jokes that Chris Tucker made I laughed at. He proved once again, after Friday fame, that he is a great comic. Charlie sheen does really good in this one, too. Overall the whole movie is a great comedic flick and I definitely, definitely recommend this to the average person. Rating 10 out of 10.",
         "A Classic Action Comedy. This in my opinion is Chris Tucker at his best. From the opening scene to the end, Chris Tucker is hilarious. From the funny looking hair cut to the cussing and singing, he reminds you of Eddie Murphy in Beverly Hills Cop. Charlie Sheen also does an impressive job. The action scenes are not spectacular, but it does a good job. Money talks is a good blend of Guns/Explosions and laughter. If your a fan of 48 Hours, Nothing To Lose or any other Action Comedy, Money talks is a must see. 7.4/10",
         "The movie that made director Brett Ratner a recognizable name is mostly another white-yuppie-and-black-ghetto-guy-have-to-join-up kind of story (summer 1997 also saw the release of the Tim Robbins-Martin Lawrence buddy comedy \"Nothing to Lose\"). But as far as I'm concerned, Chris Tucker - who earlier that summer had starred in \"The Fifth Element\" - is always funny enough to merit at least some recognition; and anyway, this sort of flick is supposed to be silly. While Charlie Sheen is far less entertaining in his role, Paul Sorvino played such an interesting character that I agreed with one of my friends that he and Chris Tucker should have gotten more scenes together. Truth be told, I'd actually never heard of Vic Damone until I saw this movie. OK, so maybe we could be cynical and say that Chris Tucker just gets the same role in every movie. I still consider him funny, and I wish to assert that \"Money Talks\" is good for a few laughs. Worth seeing if only for that.",
         "Chris Tucker is brilliant in Money Talks. He is definitely a crowd pleaser and has made a name for himself. His fast talking clever ways of getting him in and out of trouble are very amusing. In this movie he manages to outsmart the bad guys, which I love to see. He is just hilarious, and the funniest man in the world! I love his movies, and in this movie people get to see what they love, pure Tucker at his best of high-pitched motor mouth ways. I love his Scarface impression, it shows his comedic talents. It is definitely time for Tucker to take over where Eddie Murphy left off. Hail the new King of Comedy!!",
         "A low-level smooth talking hustler by the name of Franlin Hatchet (Chris Tucker) is on the run from the police, after a jailbreak. Which he is falsely accused of planning a violent jailbreak. Now the whole city is on his trail and the only one, who could clear his name is an ambitious television reporter James Russell (Charlie Sheen). Which is the only reason why Franklin was sent to prison, because of James. Now together, they find each other mixed-up with cops, crooks and euro-trash bad guys. Which Franklin knows that the man (Gerard Ismael) was chained-up with in the bus. He was trying to retrieve a fortune in diamonds. Directed by Brett Rather (Rush Hour Trilogy, X-Men 3:The Last Stand, Red Dragon) made an highly entertaining comedy with enough thrills and humour. Although the premise is familiar but Tucker's energetic comical performance makes this worth watching. DVD has an sharp anamorphic Widescreen (2.35:1) transfer (also in Pan & Scan) and an strong-Dolby Digital 5.1 Surround Sound. DVD includes the original theatrical trailer, cast information and star highlights by Tucker and Sheen. After the box office success of this film, Tucker went on the one of the leads of the \"Rush Hour\" movies. Paul Sorvino is amusingly cast as Russell's future father-in-law. Written by Joel Cohen and Alec Sokolow. Which they wrote films together like \"Garfield\", \"Garfield:A Tale of Two Kitties\" and \"Toy Story\". Tucker also executive produced the film. Super 35. (****/*****).",
         "Brett Ratner the director of this movie & other movies such as \"Red Dragon & Rush hour 1,2 & now also making part 3, delivers his best directing performance i think. Money talks probably didn't get as big as Rush hour because of the fact there is a lot of swearing throughout this movie, which makes it even more hilarious. Chris Tucker & Charlie Sheen make a good team together, If you like Rush Hour, Friday, 48 Hours, Starsky & Hutch & Lethal Weapon 4 then you'll love this movie. Chris Tucker is a crack up throughout the movie, while Charlie Sheen is good in being serious yet still funny. I rate this movie a 9 / 10, i recommend this movie to any Chris Tucker fans or a good movie to watch with a group of friends.",
         "In the feverishly-paced, interracial action comedy \"Money Talks,\" hyper-kinetic comic Chris Tucker plays Franklin Hatchett, a two-bit, street-wise, ticket-scalping hustler pursued by a trigger-happy Belgian diamond smugglers, thuggish loan sharks, corrupt cops, and his own pregnant girlfriend. In his first starring role, Tucker clearly wants to imitate Eddie Murphy. Co-starring Charlie Sheen as a frustrated news reporter, a persuasive supporting cast, featuring Paul Sorvino and Heather Locklear, and crackling direction by Brett Ratner in his debut, \"Money Talks\" is nothing but rambunctious fun. The key to \"Money Talks\" is whether you find Chris Tucker either entertaining or obnoxious as a whiny-voiced dynamo whose motor-mouth never stops. If you've seen the doper farce \"Friday\" or last summer's mega-budget science fiction saga \"The Fifth Element,\" you'll recognize Tucker by his bulging cue-ball eyes, pouting bottom lip, and beetle brows. Acting like Buckwheat with a subversive attitude, Tucker's trademark is his helium-pitched, fast-paced delivery with profanity between every other word. He can rattle off a line of dialogue faster than a Federal Express commercial. When Tucker isn't dodging bullets and careening in cars in \"Money Talks,\" he is jive-talking and wise-cracking with the kind of brazen effrontery that either makes you laugh harder or aggravates you to no end. The screenplay by \"Toy Story\" scribes Joel Cohen and Alec Sokolow uses the classic theme of mistaken identity. Franklin is raking in some cool bucks as a scammer who fences stolen property at his car wash. Along comes scoop-hungry television news reporter James Russell (Charlie Sheen of \"Platoon\") who gets Hatchett arrested for soliciting goods. The incredulous Hatchett winds up shackled to an unidentified Belgian crook. Nobody recognizes the infamous Raymond Villard (Gérard Ismaël of \"Spécial Police\"). During a routine bus transfer, Villard's henchmen blow up the vehicle and rescue their boss. Franklin survives by virtue of his being cuffed to the evil Villard. Aboard their escape helicopter, Franklin learns about a cache of $15 million in diamonds. Before the villains can kill him, our hero bails out of the chopper and splashes into the ocean. But Franklin is only leaping from one frying pan to another. It seems the L.A.P.D. has accused him of killing the fourteen prisoners and two police guards on the bus. Hatchett contacts Russell because he believes the news reporter might help him. Russell agrees to harbor the fugitive so he can get an exclusive as well as convince his British boss Barclay (David Warner of \"Titanic\") to re-hire him. Even that backfires when Russell finds himself implicated in Franklin's crime. Although the Cohen and Sokolow screenplay adheres to a predictable formula, the story generates enough thrills and chills as well as a neatly planted surprise or two to pass muster. Basically, \"Money Talks\" amounts to a chase thriller with all the villains pursuing Franklin. They're prepared to kill Franklin as well as anybody else who gets in their way. Meanwhile, not only must Russell keep Franklin alive, he also must humor the wealthy parents of his bride-to-be Grace Cipriani (\"Melrose Place's\" Heather Locklear). Happily, the plot confines both Grace and her catty mom Connie (Veronica Cartwright of \"Alien\") to their mansion. A lesser script would have involved them in a kidnapping plot. Most of the time, the film focuses on Franklin's center camera efforts to negotiate with his various enemies and adversaries. Freshman helmer Ratner supercharges the action with such momentum that it rarely let up on it fast and furious pace. If the second to a winning comedy is maintaining a lively, timely, breakneck clip, Ratner succeeds in spades. \"Money Talks\" careens from one plot twist to the next with marvelous abandon. Ratner nimbly directs a genuinely exciting chase scene, an explosive assault-on-the-bus scene, and the gunslinging pyrotechnical finale at the Los Angeles Coliseum where everybody wields a weapon. When he isn't proving his talent helming these second-unit action scenes, Ratner has fun playing Tucker and Sheen off each other. The solid, dependable, square-jawed Sheen makes a convincing straight man for Tucker. He is a news reporter with aspirations to join CBS-TV's \"60 Minutes.\" Sheen's scenes with Tucker crackle with live-wire energy as the two spar with each other. The fierce, pugnacious camaraderie between these guys recalls the feisty relationship between Eddie Murphy and Nick Nolte in \"48 Hrs,\" and that's what makes Tucker and Sheen such an offbeat and hilarious pair. Wolfish Gérard Ismaël turns in an appropriately guttural performance that captures the hard-edged notoriety of the Belgian antagonist. The rest of the cast, including Sorvino as Russell's future father-in-law, Veronica Cartwright as the sneering wife, and Locklear as Russell's pretty bride acquit themselves well in peripheral roles. In minor roles, Paul Gleason of \"Trading Places\" stands out as a sympathetic but suspicious Lieutenant Bobby Pickett and Michael Wright as one of Franklin's schoolyard chums. \"Money Talks\" compares favorably to the old buddy comedies of Richard Pryor and Gene Wilder because it only wants to be a rollicking barrel of monkeys. If Chris Tucker can keep making agile comedies that click like \"Money Talks,\" then Eddie Murphy has something to worry about.",
         "The only thing that can be said for \"Money Talks\" is that it held my interest. No, it's not a great film, but then again few comedies of this sort are. For what it is, the film entertained me enough to recommend it. Tucker and Sheen have rather good chemistry together, albeit it in a less-than-spectacular way. Essentially the plot is a bunch of nonsense, it's just an excuse to see another white man/black man buddy comedy in the vein of \"Lethal Weapon,\" \"Running Scared,\" etc. This is not a \"good\" movie but if it's on TV you might as well give it a go, it's hardly awful and certainly better than it could have turned out to be. 3/5",
         "This so-called comedy loses all track of direction, makes \"comedic\" use of extreme violence and bloodshed, is pointless and inane, uses profanity instead of wit, and dulls the intelligence level of its watchers. I evidently had a masochistic urge when I turned it on and stuck to it. It is blissfully short and makes ill-use of Sheen, Sorvino and Locklear. (Their agents should have known better.)"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Sheen/Michaels Entertainment"
      ],
      "summaries": [
         "Chris Tucker is a small time con man who instantly becomes famous after a murder, wanted dead or alive, his only hope is a journalist named James Russell (Sheen).",
         "Sought by police and criminals, a small-time huckster makes a deal with a TV newsman for protection."
      ],
      "budget": 25000000
   },
   "movielensId": 1604,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-22",
      "dvdReleaseDate": "1998-01-14",
      "directors": ["Brett Ratner"],
      "runtime": 97,
      "movieId": 1604,
      "title": "Money Talks",
      "mpaa": "R",
      "actors": [
         "Chris Tucker",
         "Charlie Sheen",
         "Heather Locklear",
         "Paul Sorvino",
         "Elise Neal"
      ],
      "imdbMovieId": "0119695",
      "originalTitle": "Money Talks",
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": ["juTBjT-hzlc"],
      "plotSummary": "Money Talks is a 1997 American comedy film directed by Brett Ratner. Sought by police and criminals, a small-time huckster makes a deal with a TV newsman for protection.",
      "tmdbMovieId": 9416,
      "avgRating": 2.93946,
      "releaseYear": "1997",
      "numRatings": 859,
      "posterPath": "/bN57Rl003E9pYred5kw9Rp8h9Np.jpg"
   }
}