{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sword",
            "id": 1938
         },
         {
            "name": "planetary configuration",
            "id": 5295
         },
         {
            "name": "sword fight",
            "id": 9725
         },
         {
            "name": "fate",
            "id": 10855
         }
      ],
      "imdb_id": "tt0119484",
      "video": false,
      "title": "Kull the Conqueror",
      "recommendations": [
         36859,
         7269,
         2199,
         25087,
         40688,
         18856,
         34309,
         83489,
         70024,
         210599,
         19086,
         47881,
         11955,
         11221,
         18862,
         31633,
         22792,
         25697,
         55377,
         36693
      ],
      "backdrop_path": "/kK65zLFM0qLpFip9vzmHWjMrboS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kull",
               "gender": 2,
               "credit_id": "52fe474c9251416c750945dd",
               "name": "Kevin Sorbo",
               "profile_path": "/a6rDi3tkNJwaVoP7VGbdGelwtYw.jpg",
               "id": 51965,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Akivasha",
               "gender": 1,
               "credit_id": "52fe474c9251416c750945e1",
               "name": "Tia Carrere",
               "profile_path": "/s2y4Hj7ZIuEMyE0W3o8WCVcHwiL.jpg",
               "id": 13445,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "General Taligaro",
               "gender": 2,
               "credit_id": "52fe474c9251416c750945e5",
               "name": "Thomas Ian Griffith",
               "profile_path": "/eBXSCzKTo9EuNHbKWQqrAhETaSm.jpg",
               "id": 60705,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ascalante",
               "gender": 2,
               "credit_id": "52fe474c9251416c750945e9",
               "name": "Litefoot",
               "profile_path": "/6MmZFvtuY2Vmnt6lDsC7hw8lk4X.jpg",
               "id": 69302,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tu",
               "gender": 2,
               "credit_id": "52fe474c9251416c750945ed",
               "name": "Roy Brocksmith",
               "profile_path": "/2mLWMlroPa18WsH1QZtiSBJbhYo.jpg",
               "id": 12888,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Juba",
               "gender": 2,
               "credit_id": "52fe474c9251416c750945f1",
               "name": "Harvey Fierstein",
               "profile_path": "/eh53YLoB8SeTUD0prET8lCo0Cfo.jpg",
               "id": 7420,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Zareta",
               "gender": 1,
               "credit_id": "52fe474c9251416c750945f5",
               "name": "Karina Lombard",
               "profile_path": "/8uS7dXBJCTQaHQGyTFc2EhB9mKD.jpg",
               "id": 11068,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Enaros",
               "gender": 2,
               "credit_id": "52fe474c9251416c750945f9",
               "name": "Edward Tudor-Pole",
               "profile_path": null,
               "id": 79638,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Ducalon",
               "gender": 0,
               "credit_id": "52fe474c9251416c750945fd",
               "name": "Douglas Henshall",
               "profile_path": "/ofbU3w8hlafOJfQ1uiAwjL1QSRw.jpg",
               "id": 35862,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Dalgar",
               "gender": 0,
               "credit_id": "52fe474c9251416c75094601",
               "name": "Joe Shaw",
               "profile_path": null,
               "id": 82409,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "King Borna",
               "gender": 2,
               "credit_id": "52fe474c9251416c75094605",
               "name": "Sven-Ole Thorsen",
               "profile_path": "/vNjv3gk22eqihzOqXm2vz5yP58V.jpg",
               "id": 20761,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Ship Captain",
               "gender": 2,
               "credit_id": "52fe474c9251416c75094609",
               "name": "Terry O'Neill",
               "profile_path": "/gJazxnZsm4sDavnP7gedgO7rtpw.jpg",
               "id": 82410,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Zulcki",
               "gender": 2,
               "credit_id": "52fe474c9251416c7509460d",
               "name": "Pat Roach",
               "profile_path": "/5YXmfgXqCjqEhmyjz1xhuWy8Zr4.jpg",
               "id": 10942,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Mandara",
               "gender": 2,
               "credit_id": "52fe474c9251416c75094611",
               "name": "John Hallam",
               "profile_path": "/pJTpp7OBqiVg0Ms9CDVO22qp7Gy.jpg",
               "id": 12690,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Slave",
               "gender": 0,
               "credit_id": "52fe474c9251416c75094615",
               "name": "Peter Petruna",
               "profile_path": null,
               "id": 82411,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe474c9251416c7509461b",
               "name": "John Nicolella",
               "profile_path": null,
               "id": 70765,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe474c9251416c75094621",
               "name": "Robert E. Howard",
               "profile_path": null,
               "id": 57547,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe474c9251416c75094627",
               "name": "Charles Edward Pogue",
               "profile_path": null,
               "id": 56058,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.274318,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17832,
      "vote_count": 44,
      "budget": 0,
      "overview": "A barbarian named Kull becomes ruler after defeating the old king in battle, thus receiving his crown. But direct heirs of the king, trying to topple Kull and regain the throne, bring an old witch queen Akivasha back to life. Their plan backfires, however, as Akivasha plans to have her demon lords rule the kingdom alone. The only thing that can stop her is the breath of the god Volka, and Kull.",
      "similar": [
         616,
         24293,
         879,
         64686,
         8009,
         24,
         393,
         36648,
         1865,
         9313,
         9342,
         1735,
         762,
         274857,
         98566,
         36586,
         37430,
         346672,
         526,
         19913
      ],
      "original_title": "Kull the Conqueror",
      "runtime": 95,
      "poster_path": "/j8BmhqcdacN6LgIdnf97URB8qpY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Korsala Productions",
            "id": 3409,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Raffaella De Laurentiis Productions",
            "id": 3410,
            "origin_country": ""
         }
      ],
      "release_date": "1997-08-29",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Courage conquers all.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Nicolella"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Robert E. Howard",
         "Charles Edward Pogue"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119484/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MzU5MjMyNF5BMl5BanBnXkFtZTYwOTUzMjc4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kevin Sorbo, Tia Carrere, Thomas Ian Griffith | See full cast and crew »"],
      "reviews": [
         "\"Kull The Conqueror\" is cinematic cheese, and knows it. The actors know it. The director knows it. Certainly the person responsible for the inclusion of the constant heavy metal guitar solos know it! Which is the best part of the film, the constant screams \"waaaa-wa-wa-wa-wa!!!\" of that heavy metal guitar, briefly punctuated by your standard grade-Z fantasy film dialogue. I laughed my arse off throughout the entire film and had a great time. Anyone who takes this film, or themselves, too seriously, will hate it. Anyone who knows how to kick back and enjoy fluff, will have a grand old time.",
         "Former slave and pirate, Kull is now a great warrior but can't seem to fit in with the army because he is one of the few who does not have noble blood. When he stands up to the King for slaying his relatives, Kull is forced to fight and kill him and, as a result, the King sees the light and passes the crown to Kull seconds before dying. The Princes don't like it and the court officials are pretty unimpressed but the law is the law and whatcha gonna do? When he starts to free slaves, treat lesser as equals and generally be a nice king, the Princes plot his removal but when assassins fail they go to a wizard to breathe life into a demon in a ginger wig in the form of a gorgeous woman. I must admit that, when I recorded this I thought that it was Krull from 1983 simply because I had misread the television guide. Never having bothered with Xena, Hercules or any of these modern swords and sorcery television series and movies that tend to clutter some cable stations in the UK because they all seemed of very low quality to me, but I still decided to watch this anyway. Perhaps it is because the lack of development and character isn't a major problem for me over 90 minutes whereas it is over a 22 week long series but I actually did enjoy this even if it just plays like an extended version of one of these shows \u0096 all rock music and modern humour. The plot is very simple but is enough to allow for the basic fighting and swaggering that the audience would demand. It isn't that well written of course and simply has lots of mystical nonsense in the place of narrative while the characters could only be more one-dimensional if they had been painted onto a wall. Likewise the cast don't do a great deal but at least they seem to be having fun and at least not take it too seriously. Although I'm not about to claim he is anything other than a muscle-bound cable television actor, I was quite won over by Sorbo's charisma and good humour \u0096 he makes a good lead for stuff at this sort of level. Despite being stuck in a silly red wig that does nothing for her looks, Carrere enjoys overacting in a vampy role which is good even if she has little screen time. Lombard has a plainer, less fun role but I did enjoy her and she worked well with Sorbo. The princes are quite fun, in particular Griffith and, as always, Fierstein camps in up in the way only he can. None of them are great but at least they make the film seem like a bit more fun. Overall this is not the film to come to if you don't like the genre or have standards higher that daytime television (Hercules is now a kids TV filler on channel 5 here) but if you like that sort of thing then this does just about enough to be an entertaining little bit of modern sword and sorcery in the mould of, well, everything else Sorbo has been in!",
         "The screenplay writer must have read Howard's book, since there are literal quotes like `By this axe I rule!', which Kull exclaims during the coronation, yet again, this movie is no serious attempt to capture the raw, barbarian spirit of Howard's heroes. `Kull the Conqueror' reminds me of `Sinbad and the Eye of the Tiger' rather than `Conan the Barbarian' or `Hercules'. Exactly like Patrick Wayne, Kevin Sorbo has to sail to the Land of Ice to find a solution to his problem: the evil witch threatening the once peaceful kingdom. `Kull' is nice, colourful adventure, Sinbad with more muscles and less charm, nothing special, but not as bad as some reviewers wrote, either. I'll watch it again on a rainy day. Of course, if you expected another `Conan the Barbarian', you'll be disappointed, but `Conan the Destroyer' and `Red Sonja' were no match for this masterpiece in the past, and `Kull' is at least a bit better than these two. Tia Carrere as the red-haired witch Akivasha who cannot be killed, for she is living in a fire, is brilliant. Her immediate transition from the enchanting beauty to screaming rage compares to nothing. I still didn't figure out why Sorbo chose the same profession as De Niro and Dustin Hoffman, but he's passable here. Give it a try if you like the genre.",
         "Ok ok, I know, you're not supposed to compare this movie to the Hercules series, but please, Sorbo's acting style is unchanged. Kull kills people in this movie and he's not a half-god, but that's where the differences end. This movie even has a Salmoneus-clone played (hilariously) by Harvey Fierstein. Watch it, enjoy it, but don't expect too much from it.",
         "Let me get one thing straight. Kull never is, never was, and never will be a relation of Conan's. He \"existed\" way before Conan. The Cimmerean's (Conan was Cimmerean) were descendants of the Atlanteans, but there does not appear to be a direct link between Kull and Conan.*phew* Glad to get that out of the way! So much for anyone who knows anything...*raises eyebrow* Anyway, Sorba is pretty much what I imagined Kull to be; not as muscled as Conan, much more wiry, and a little less \"Me hit thing hard with big sword\" (OK, Conan not think but...you get the general idea...). The film itself is done in that Hercules style, typical of American S&S at the moment, but it doesn't lose the idea of the originals. OK not as much sex involved, and certainly a lot less violence and misogyny (to a certain extent), but it stil makes for a great brainless piece of fun, much like Conan The Barbarian (I try and forget Destroyer and Red Sonja...definitely not up to scratch). The soundtrack wasn't as inspired as the Conan films (I mean metal in the Hyborian age? Please?!), and kinda took away from the flick in a way. Then again, it did come across as an extended Xena program...no bad thing. I suppose it depends on what you want out of the film. If you want to relive the early 80's S&S stuff...maybe this isn't for you. If you just want some brainless fun...sweet. Give it a try. For those, wanting a bit more, keep your eye out. Arnie has confirmed he has signed on for King Conan (or Conan 3 effectively)...could be a good return to form here! 7 out of 10",
         "KULL is not to be taken seriously, even though it is derived from a serious book by the author of the Conan stories, Robert Howard. Kevin \"Hercules\" Sorbo plays Kull, a warrior in search of a kingdom in a time long forgotten, in a breezy, off-handed manner -- and his refusal to take his character too seriously works in favor of this low-budget quickie. The ever-delectable Tia Carrere plays a witch who plans to take over the world, and she is absolutely delicious as a supernatural villainess. The fights are clumsily staged, the sets are from hunger, but the dialog is a lot of fun and everyone would appear to be having a good time. A rainy day pick. It certainly kicks Red Sonja's butt.",
         "I like Kevin Sorbo, so I watched the film. It wasn't mentally tasking and it never set out to be. The movie was designed to be campy and it said so. You heard the rock music in the background during the trailer, so why are people so disappointed with it? I still enjoyed it for its dry wit and simplicity. It was a nice flashback to those old Conan movies. I've heard that Kull is Conan's father, and I don't know much about this character from the Conan films, but I dug him. I found him charming. The Conan movies wasn't much in the way of smart either, but people still enjoy it. I liked the combination of modern themes and music with the extremely old school nature of the film. It was like a land before time or something. Watch it if you just wanna watch something and don't expect much.",
         "I saw the movie on television yesterday evening. When I had looked into the tv magazine I saw that the movie is rather new (1997), but I had never heard of it, which means nothing good. Then I saw that Kevin Sorbo starred in it. I don't have a problem with him, but he's absolutely fixed to that \"Hercules\"-role, so I knew exactly what to expect. But it wasn't THAT bad. The plot was mediocre, but not ridiculous. The special effects weren't too good, but some looked nice. The scenery looked extremely fake from time to time, but there also were some nice backgrounds and such. It's not really a bad movie, I was not bored when I watched it. If you are a fan of such medieval settings and lower your expectations a bit it might be worth a watch. 5/10",
         "Rock music. Fantasy realm. Cool battle scenes. Okay, not the most perfect movie in the world, but still a good movie. Kevin Sorbo plays Kull a barbarian from Atlantis. Wishing to join General Taligaro's Dragon Legion, he is rejected at first for not being \"noble blood\". When the King decides to slaughter his entire family, so his life is not endangered later on when they challenge the throne. Kull (Sorbo) is kills the King and takes his place, as is the law. When the threat of an evil demon queen comes knocking, Kull takes one last adventure to destroy the queen who is trying to take his kingdom, while also falling in love along the way. Kull the Conqueror was actually meant to be Conan 3 (Conan the Conqueror, and was based on the first Conan story \"The Phoenix on the sword\"), but due to Arnie not wanting to reprise his role and Kevin not wanting to redo a character already played. (Note however that a Kull story entitled \"By This Axe I Rule\" is very similar to the story line of this movie, and is a more likely basis for the movie.) After all is said and done though, this fantasy movie mixed with a great soundtrack of heavy rock music, we have a superb movie made to entertain us on a rainy day. 2/2 for the actors' roles. 2/2 for the excellent scenery. 4/4 for the storyline. 2/2 for the production, directing, script and overall areas of the movie.",
         "On the scale of sword and sorcery flicks, this ranks below 'Conan The Barbarian', above the dreary 'Red Sonja', about on par with 'Conan The Destroyer'; which is to say that it's an energetic fantasy film that doesn't take itself seriously and can be a lot of fun if you let it be. Kull of Atlantis seeks to join the army of Velusia, but instead, through an unexpected turn of events, he finds himself proclaimed king of the empire instead. Holding onto his new throne will be much harder than taking it, as the blood heirs to the empire make a deal with a wizard to revive a 3000 year-old demon who seeks to kill King Kull and claim the empire for herself. 'Kull the Conqueror' originally started out as 'Conan the Conqueror', but after Arnold refused to reprise the role, the script was changed to accommodate Howard's other barbarian hero, Kull. As such, much of the story is actually taken from the Conan stories ('The Hour of the Dragon' in particular). Interestingly, the first Conan movie took most of it's story material from the Kull tales. A little bit of irony for you. As for the film itself, it does enough things right to entertain; Sorbo fits Kull role perfectly (actually truer to the source character than Arnold ever was), Griffith is an effectively grim villain and Tia Carrere hams it up nicely as the evil Akiavasia. The locations and sets have a wonderfully fantasy feel to them and the assorted fight scenes are well choreographed and fast paced. Given their age, the FX and make are good without ever looking terribly real. One thing I found very enjoyable in the film was the liberal dose of humor; not lame one-liners or goofy antics, but some solid humor that compliments the scenes rather than ruining them. The biggest problem the movie has is the damn PG-13 rating; it keeps the movie from really delving into adult fantasy the way you want it too. Both 'Red Sonja' and 'Conan the Destroyer' suffered the same problem. Another issue is the generic butt-rock music that accompanies the fight scenes; the music for the rest of the film is epic and fits the period nature of the film, but the lame guitar riffs that get churned out during every fight is just annoying. Also, many of the supporting actors just aren't any damn good at acting and tend to injure many of the scenes. Lastly, the script is a little lean for an epic adventure film, clocking in at just 90 minutes, almost no time is spent getting to know the characters any better than is necessary to drive the plot. All told, this is a fun, fast, fantasy film meant to be enjoyed rather than analyzed. It makes a decent entry in the Howard film canon (the best way to watch it is part 4 of a Howard marathon; Conan 1 & 2, Red Sonja, Kull). The film made no money in theaters, which is too bad, as we aren't likely to see any more of these any time soon. Energetic, humorous, and full of action (though not without some issues), a solid sword and sorcery flick. 7/10"
      ],
      "genres": [
         "Fantasy",
         "Action",
         "Adventure"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Raffaella De Laurentiis Productions",
         "Korsala Productions"
      ],
      "summaries": [
         "A barbarian named Kull unexpectedly becomes a king after an old king (whom Kull has just killed in a battle) gives his crown to him. But direct heirs of a killed king, trying to topple Kull and regain the throne, bring an old witch-queen Akivasha back to life. Their plan backfires, however, as Akivasha is going to allow their lords - demons - to rule the kingdom. The only thing that can stop her now is a breath of the god Volka.",
         "An barbarian warrior becomes a king when he defeats a king in armed combat and the king's heir conspire to overthrow him and reclaim the throne by resurrecting an evil sorceress."
      ],
      "budget": 0
   },
   "movielensId": 1606,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-29",
      "dvdReleaseDate": "1998-02-24",
      "directors": ["John Nicolella"],
      "runtime": 95,
      "movieId": 1606,
      "title": "Kull the Conqueror",
      "mpaa": "PG-13",
      "actors": [
         "Kevin Sorbo",
         "Tia Carrere",
         "Thomas Ian Griffith",
         "Litefoot",
         "Roy Brocksmith",
         "Harvey Fierstein",
         "Karina Lombard",
         "Edward Tudor-Pole",
         "Douglas Henshall",
         "Joe Shaw",
         "Sven-Ole Thorsen",
         "Terry O'Neill",
         "Pat Roach",
         "John Hallam",
         "Peter Petruna"
      ],
      "imdbMovieId": "0119484",
      "originalTitle": "Kull the Conqueror",
      "genres": [
         "Adventure",
         "Fantasy",
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "aLWayoYSLHA",
         "Qlondt_U4w4"
      ],
      "plotSummary": "A barbarian named Kull becomes ruler after defeating the old king in battle, thus receiving his crown. But direct heirs of the king, trying to topple Kull and regain the throne, bring an old witch queen Akivasha back to life. Their plan backfires, however, as Akivasha plans to have her demon lords rule the kingdom alone. The only thing that can stop her is the breath of the god Volka, and Kull.",
      "tmdbMovieId": 17832,
      "avgRating": 2.37015,
      "releaseYear": "1997",
      "numRatings": 928,
      "posterPath": "/j8BmhqcdacN6LgIdnf97URB8qpY.jpg"
   }
}