{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "individual",
            "id": 30
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "rome",
            "id": 588
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "treasure",
            "id": 1454
         },
         {
            "name": "portland",
            "id": 1896
         },
         {
            "name": "cocaine",
            "id": 2150
         },
         {
            "name": "generations conflict",
            "id": 2200
         },
         {
            "name": "idaho",
            "id": 2347
         },
         {
            "name": "hustler",
            "id": 2348
         },
         {
            "name": "german",
            "id": 2349
         },
         {
            "name": "seattle",
            "id": 2350
         },
         {
            "name": "narkolepsy",
            "id": 2352
         },
         {
            "name": "pink bathrobe",
            "id": 2353
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "gay sex",
            "id": 15135
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "road movie",
            "id": 167043
         }
      ],
      "imdb_id": "tt0102494",
      "video": false,
      "title": "My Own Private Idaho",
      "recommendations": [
         476,
         18197,
         26748,
         232,
         21450,
         25188,
         10217,
         68924,
         11446,
         21309,
         994,
         695,
         3033,
         13776,
         14924,
         18900,
         11171,
         1807,
         18329,
         12714
      ],
      "backdrop_path": "/vBSvzhCXdPJdsGGAUlnabAwDfAy.jpg",
      "revenue": 6401336,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Mike Waters",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011cf5",
               "name": "River Phoenix",
               "profile_path": "/qfokbmRwRvmIVsLHScshxLPAB3C.jpg",
               "id": 741,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Scott Favor",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011cf9",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Richard Waters",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011cfd",
               "name": "James Russo",
               "profile_path": "/tV4X0uEuqu6XYml3yEs9rsG9EzW.jpg",
               "id": 785,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Bob Pigeon",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d01",
               "name": "William Richert",
               "profile_path": "/c7OLmySPTx7UO17ua1upOMnhbeN.jpg",
               "id": 6385,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Gary",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d05",
               "name": "Rodney Harvey",
               "profile_path": null,
               "id": 6386,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Carmella",
               "gender": 1,
               "credit_id": "52fe4247c3a36847f8011d3f",
               "name": "Chiara Caselli",
               "profile_path": "/eXrEpcV8HEuvddz3eWFEPi5uSQM.jpg",
               "id": 6405,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe4247c3a36847f8011d43",
               "name": "Grace Zabriskie",
               "profile_path": "/ibBabuSM1UyPYFFo0wBXhGbqElk.jpg",
               "id": 6465,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Jack Favor",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d47",
               "name": "Tom Troupe",
               "profile_path": null,
               "id": 6466,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Digger",
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011d51",
               "name": "Michael Parker",
               "profile_path": null,
               "id": 53361,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Denise",
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011d55",
               "name": "Jessie Thomas",
               "profile_path": null,
               "id": 188589,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Budd",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d59",
               "name": "Flea",
               "profile_path": "/3mvSPp8RpuuPJUuNwq9PyjFu2Ug.jpg",
               "id": 1237,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Hans",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d5d",
               "name": "Udo Kier",
               "profile_path": "/sTNpaKOBNi7WUJw7jPDrsbGAL4O.jpg",
               "id": 1646,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Jane Lightwork",
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011d61",
               "name": "Sally Curtice",
               "profile_path": null,
               "id": 1048023,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011cf1",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4247c3a36847f8011d0b",
               "name": "Laurie Parker",
               "profile_path": null,
               "id": 512,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d11",
               "name": "Anthony Brand",
               "profile_path": null,
               "id": 6387,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011d17",
               "name": "Bill Stafford",
               "profile_path": null,
               "id": 6388,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d1d",
               "name": "John J. Campbell",
               "profile_path": null,
               "id": 5227,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011d23",
               "name": "Eric Alan Edwards",
               "profile_path": null,
               "id": 6389,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d29",
               "name": "Curtiss Clayton",
               "profile_path": null,
               "id": 6390,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d2f",
               "name": "David Brisbin",
               "profile_path": null,
               "id": 6391,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe4247c3a36847f8011d35",
               "name": "Beatrix Aruna Pasztor",
               "profile_path": null,
               "id": 6392,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011d3b",
               "name": "Gina Monaci",
               "profile_path": null,
               "id": 6393,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d4d",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 10.751748,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 468,
      "vote_count": 283,
      "budget": 2500000,
      "overview": "In this loose adaptation of Shakespeare's \"Henry IV,\" Mike Waters (River Phoenix) is a gay hustler afflicted with narcolepsy. Scott Favor (Keanu Reeves) is the rebellious son of a mayor. Together, the two travel from Portland, Oregon to Idaho and finally to the coast of Italy in a quest to find Mike's estranged mother. Along the way they turn tricks for money and drugs, eventually attracting the attention of a wealthy benefactor and sexual deviant.",
      "similar": [
         376867,
         258480,
         98,
         244772,
         449176,
         11421,
         6637,
         89,
         319,
         546,
         192145,
         169813,
         26280,
         339,
         338189,
         14748,
         1696,
         9090,
         70578,
         11000
      ],
      "original_title": "My Own Private Idaho",
      "runtime": 104,
      "poster_path": "/2AzIv2b6mI2Ye4uJUTdi4wjIvLb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
         "name": "Fine Line Features",
         "id": 8,
         "origin_country": ""
      }],
      "release_date": "1991-10-17",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "It's not where you go, it's how you get there.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gus Van Sant"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "William Shakespeare",
         "Gus Van Sant"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102494/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTgyODU3MjE1M15BMl5BanBnXkFtZTcwNzQzOTcyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: River Phoenix, Keanu Reeves, James Russo | See full cast and crew »"],
      "reviews": [
         "This movie isn't about being, or even about being a hustler. \"My Own Private Idaho\" is about finding a home. In his finest performance, River Phoenix plays Mike, a narcoleptic street hustler with false memories of a terrific childhood. Mike wants to find his mother and family, but how or why he left them is never discussed. This is a movie that shows life at the lowest rung, and is very similar to Kerouac's \"On the Road\" and especially John Rechy's \"City of Night.\" (In fact the line about becoming a fairy is straight from \"City of Night\"). Mike and Scott (Keanu Reeves) are both male prostitutes in Oregon. Why either of them have drifted into this profession is anyone's guess. Scott is clearly not gay, but Mike might be and their relationship is what holds the movie together. The film works on many levels, but does have its flaws. It's faux-Shakespearen scenes make the film drag in the middle. Van Sant directed the movie like a dream, which is what Mike's life basically is. This is a haunting and very sad tale about friendship and finding a home. The performances, especially Phoenix and Udo Kier and Van Sant's dream-like direction are what you remember. \"My Own Private Idaho\" may be a flawed film, but in my opinion, it is one of the very best of the '90's.",
         "I adore this movie, have owned it on VHS long before there was anything else and have seen it an insane number of times. It isn't perfect, but with me personally, though I'm a European female and thus have no personal life experience that could resemble anything the main characters go through, it struck a chord of universality that made it heart-breaking. The pathos in it, the bitter poetry, the warped magic is just unbelievably beautiful... and painful. It is visually inventive and the casting - even Keanu Reeves's, which has been so often criticised - is top-notch. Reeves's character is a flippant, spoilt young man who goes through life acting in his own self-glorifying drama: what better actor to cast in that role than someone whose acting is so contrived? And Phoenix... well, what can I say... to me, this is THE River Phoenix role, the one that can single-handedly turn him into an immortal, a legend. The Shakespearian quotations I adored: the relationship between Prince Hal and Falstaff from Henry IV, Part II is among the most mesmerising of the Bard's dramatic repertoire - that play was like an emotional earthquake to me. My Own Private Idaho caught its spirit perfectly, and translated it into a context that was original in its own right yet more faithful to Shakespeare in feeling than a more literal transposition might have been. Also, I found the portrayal of Rome in the part in which River's character goes out there to search for his mother, refreshingly true to life and totally cliché-free. As an Italian from Rome, it's very rare that I see a non-Italian film portraying my city of origin with so much authenticity. The FEEL of the place at a given time - the late 80s - was spot-on. In conclusion: to me, not only was My Own Private Idaho one of the best adaptations of (at least parts) of a Shakespeare play that I've seen, but also a tragedy of almost Shakespearian intensity in its own right. It had it all: the unhealthy, consuming passion (the fatal flaw), the power struggles, the young heir in his reckless, youthful days eventually maturing into the arrogance of the privileged (Keanu), the parental ghost that one of the protagonists looks to as his prophetic voice, the voice that may give his life a meaning (River's search for and the flashbacks to the memory of his mother), the intense pathos throughout, the tragic deaths at the end... that film is just pure magic to me! Just writing about it makes me want to see it again - what, for the 20th time or something?! And the tragedy at My Own Private Idaho's core is so universal, it really becomes completely secondary whether it's about and between men, women, homosexuals or heterosexuals.",
         "I watched this film on TV 5 years ago, when I was only eleven years old, and I remember that I was especially impressed by River Phoenix's magnificent performance. I had already watched \"Stand By Me\" (one of my favorites), and it was very interesting watching him older in such a daring film. I think he was the best actor of his generation but, unfortunately, he died too young. \"My Own Private Idaho\" is a poetic and bittersweet road movie, one of Gus Van Sant's best. Here in Brazil it received a bad title, \"Garotos de Programa\" (something like \"Rent Boys\"). Yes, the main characters are rent boys, but this is not what defines them. \"My Own Private Idaho\" (what a beautiful title!) mostly deals with loneliness, virile sexuality and friendship, and paternity. It's much more than \"a film about rent boys\". Besides, watching it the so-called \"modern boys\" would realize that Keanu Reeves isn't Neo from \"The Matrix\", but a versatile actor; and, perhaps, they'd discover that boyish friendship may be truly sincere. 10/10.",
         "This is the movie that I sincerely hope River Phoenix will long be remembered for. His performance as the narcoleptic and confused street-hustler Mike is so perfect and touching and realistic that it makes me cry every time. Gus Van Sant's films often have a strange aura about them (see Drugstore Cowboy, To Die For) and never has it been more evident than in this oddly affecting road movie/drama. The camera shots of long horizon-spanning roads and skylines, fast-motion clouds, surreal and symbolic shots of houses and rushing rivers provide the film with a strange almost other-worldly charm. Interspersed with the gritty realism of life on the streets of Portland Oregon in the early 90's, and (stranger still) Shakespeare. Some of the plot (Bob and Scott mainly) is based on the Shakespeare play Henry IV (with Keanu Reeves playing the Prince Hal character of Scott, and William Richert playing the Falstaff-like role of \"King-Of-The-Streets\" Bob.) It's a fascinating, touching and very successful blend of styles overall. The big themes (the search for love and belonging) are conveyed in a very interesting and genuinely moving manner. I particularly enjoyed the symbolism and pathos the film flittingly suggests. The performances are uniformly excellent, and this movie remains one of my all-time favourites. One of the greatest (and most unique) indie movies of the 1990's.",
         "Like others, I had heard about this film, but had never seen it because it can be hard to locate. Finally I rented it from an independent video store. I am not familiar with the body of River Phoenix's work, but his performance was outstanding in this film. This makes his untimely death even more tragic. The film has its merits and shortcomings. The Shakespearen references are unexpected, and I agree with others that they don't exactly \"work\". They seem too forced. But they do add an interesting texture to the film, elevating it above \"just another social commentary\". Keanu's performance isn't as flat as others may lead you to believe -- it's not bad, but it probably could have been better. I think that, now that he is more mature, he is coming into his prime as an actor. In this film, he was still rather young, and for some reason it's hard to take him seriously. Keanu doesn't quite make the transformation that his character requires. River Phoenix, on the other hand, is entirely believable, if not inspired. The film is an allegory for a lot of things. Mostly I see it as a commentary on the basic human needs for love and home. Keanu's character can go home any time he wants. River's character is searching for the ghost home of his heart; a home he will never find on a road which never ends. It's an odd film, and not everyone would enjoy it or \"get\" it. But if you're looking for something different, thought-provoking, and of course, want to see Reeves and Phoenix (not to mention Flea), then take a look.",
         "*VERY MINOR SPOILERS* My Own Private Idaho is a sublime drama focusing on the relationship between two rent boys in Portland, Oregon. Phoenix (in career-best form) plays Mike, a narcoleptic, quiet homosexual searching for his mother. Reeves, inevitably overshadowed by his outrageously,talented co-star, is Scott, the son of the Mayor, slumming it as a hustler. Based on Shakespeare's Henry IV, the cast and director make bold and brilliant use of the play, playing fast and loose with the rules and the dialogue and creating a glorious, freeform odyssey of expression and discovery. Noted independent director William Richert is marvellous as Bob (the Falstaff figure), with Udo Kier, Flea, Rodney Harvey and Chiara Caselli rounding out an outrageous supporting cast. Brilliantly acted and directed, with fine use of colour, recurring motifs and bold credits, Idaho possesses a rare, dream-like quality. The music too is perfectly chosen, and complements the magical dialogue perfectly. You'll never listen to The Pogues' \"Old Main Drag\" without thinking of this movie and of its central figure: of Phoenix appearing from left of frame with only a black bag and a stopwatch ... of the fireside scene, and of the final line. Added to that, it's funnier than most comedies - River's simple \"Thanks\" when his pleading with a fat naked man finally gets him ten more dollars, the sight of our hero hurdling fences as Reeves tells a policeman: \"I guess he doesn't like cops\", and the superb, absurdist dialogue by the fire - and exists as one of the most honest and moving depictions of love ever seen on the screen. Delightfully, Idaho remains a film that polarises audiences: it will either go straight into your Top 10 or your dustbin after you've finished it, though you must see it, to decide where you stand. Whether you love it or despise it, you will never, EVER forget it. Haunting, affecting, funny and wise, Idaho simply works on every level.",
         "Gus Van Sant, truly one of the best directors in this century, has a visionary eye that enables audiences to see life in a different/new way. In this case he takes Henry IV- usually overshadowed by Henry V, and turns it in to a heart wrenching tale that modern audiences can appreciate. The visual pictures that get layered on and on and on our eyeballs are like dance steps carefully plotted. The use of lesser known actors is refreshing, and the chemistry between River Phoenix and Keanu Reeves is overwhelming. This is a must see for any lover of independent films, for any person tired of predictable plots, or for anyone who wants to open their heart to vulnerable characters and love them. This movie gets you involved.",
         "This most important film powerfully and accurately looks into the life of a hustler. Phoenix and Reeves put their butts (careers) on the line to make a film about a subject virtually taboo for a mainstream America. You must see MOPI many times before you can understand the full meaning of what Van Zant is saying. Every scene has meaning, although at first it is hard to relate some scenes to the whole, than after many viewings, GESTAULT, you will see the whole picture. If you saw the ending a sad or tragic, watch again with the idea that Scott picks Mike up again off the highway as he did through out the film, in the final scene. Now the ending is positive, even hustlers care and friendship triumphs. Phoenix should have gotten an Oscar for this James Dean like characterization, which no one has ever come close to since Dean's death. Was he trying to be Dean like, I think so. Watch 'Rebel Without A Cause' then MOPI back to back, and make your own decision. Reeves simply does not get the credit he should for his best work here. His understated interpertation of Scott Favor is masterful. For me it is hard to separate Reeves from Scottie Favor, he makes the part so natural. Both Reeves and Phoenix characters are so right on, their story seems true. Van Zant, who wrote and directed this classic, must have had some exposure to hustlers to so clearly understand the lifestyle. Did he use real hustlers for the bit parts? Sure seemed like it to me. Aside from the ending, the best scenes are the funerals and the campfire scenes. How would you want to be buried, like Scottie's dad, or like Bob? The interplay of the two funerals says so much about the sad state of affairs of Christian America. I'm a Bob, so bury like a Bob. The campfire love scene between Phoenix and Reeves is so powerful, I can't find words to describe it. Did they have any real feelings for each other or are they just terrific actors? Same question applies to Sal Mineo and James Dean, interestingly Mineo said yes in an interview, he was attracted to Dean. Ok so I'm attracted to all four of them. Anything I didn't like, not much, but I could have done without the stereotypes of the guys Mike and Scott tricked with. Also I don't yet understand the choice of Eddie Arnold's 'Cattle Call' (an all time favorite song of mine) early in the film. Most of the other music has obvious significance, but why this song here? This film put gay subject matter into mainstream America, in a most unique way. There are other important films with great gay scenes (Lion In The Winter, for instance) but a whole film with nothing but gay lifestyles so clearly defined and beautifully portrayed. This is the best yet. Every Christian should have to watch this and maybe a few will remember Jesus's teachings, as it applies here, and not accept church teachings that gay lifestyles are in some way unacceptable.",
         "Mike (River Phoenix) has narcolepsy, and whenever he feels super-stressed he suffers what I interpret to be attacks of cataplexy, that is, sleep triggered by heightened emotions. His friend, would-be lover and fellow male prostitute, Scott (Keanu Reeves), has a rich dad who's going to leave him a hefty sum when he turns 21. These two characters are the main focus of \"My Own Private Idaho\" which deals with common and uncommon themes, such as home, sexual identity and love. Van Sant throws in some Shakespearean language plagiarised straight from Henry IV and a non-linear narrative and you've got one very cute surrealist indie film. The credits to this film are it's director and star, River Phoenix, whose understated and moving performance lifts this film above the trash it easily could've been in another director or actor's hands. Van Sant uses symbols to represent emotional states and his use of special effects is limited and effective. There is some really heartfelt dialogue in this movie, especially the much-mentioned camp-fire scene. This film can be irritating; sometimes the Shakespearean dialogue doesn't work (and it's okay to admit that a near-perfect film like this has flaws) and Reeves is sometimes a little stiff. The film is mostly redeemed by its bitter-sweet ending and fun opening titles. I'm not going to tackle any issues in this film because I just don't have the energy. Just appreciate the film for what it is and have a nice day. :)",
         "\"My Own Private Idaho\" is the movie, in my opinion, that showed the true talent of River Phoenix. I was sitting on the couch one night flipping through the channels and saw that River was in it and I thought \"Why not? Hes a good actor\". This movie absolutely blew me away. Its this sad and heartful story abut a young boy who is abandoned and is thrown into a life he never should of fathomed of having. He has to sell him self just to get a meal. This movie has touched so many hearts and inspires so many!! River isn't the only great actor, Keanu Reeves does a wonderful supportive job. His character is a rebel against his political dad (trying to make him look bad...typical teenager!!). His and River's paths of live cross and they become traveling buddies!!Its a movie that you'll never forget and i think it becomes more powerful as the years go on. I have to say, movie lovers really do miss River Phoenix. He was a great person and hopefully he adchieved all that he wanted to."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["New Line Cinema"],
      "summaries": [
         "Surreal character study focusing on the friendship between two male hustlers, Mike and Scott, in Portland, Oregon. They live on the streets, do drugs, and sell themselves to men and women. Mike is quiet, gay and suffers from narcolepsy. Abandoned as a child, he is obsessed with finding his long-lost mother. Scott is the rebellious son of a high-ranking family, who lives this life mostly to embarrass his father. Mike is in love with Scott, who still maintains he is straight and insists that his wild lifestyle on the streets is only temporary. Together, they embark on a quest to find Mike's mother, traveling from Portland to Idaho to Italy, with Scott picking up a beautiful girl along the way.",
         "Two best friends living on the streets of Portland as hustlers embark on a journey of self discovery and find their relationship stumbling along the way."
      ],
      "budget": 2500000
   },
   "movielensId": 1611,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-10-17",
      "dvdReleaseDate": "2005-03-01",
      "directors": ["Gus Van Sant"],
      "runtime": 104,
      "movieId": 1611,
      "title": "My Own Private Idaho",
      "mpaa": "R",
      "actors": [
         "River Phoenix",
         "Keanu Reeves",
         "James Russo",
         "William Richert",
         "Rodney Harvey",
         "Chiara Caselli",
         "Grace Zabriskie",
         "Tom Troupe",
         "Michael Parker",
         "Jessie Thomas",
         "Flea",
         "Udo Kier",
         "Sally Curtice"
      ],
      "imdbMovieId": "0102494",
      "originalTitle": "My Own Private Idaho",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["QQbq2kl-P-4"],
      "plotSummary": "In this loose adaptation of Shakespeare's \"Henry IV,\" Mike Waters (River Phoenix) is a gay hustler afflicted with narcolepsy. Scott Favor (Keanu Reeves) is the rebellious son of a mayor. Together, the two travel from Portland, Oregon to Idaho and finally to the coast of Italy in a quest to find Mike's estranged mother. Along the way they turn tricks for money and drugs, eventually attracting the attention of a wealthy benefactor and sexual deviant.",
      "tmdbMovieId": 468,
      "avgRating": 3.42175,
      "releaseYear": "1991",
      "numRatings": 2786,
      "posterPath": "/2AzIv2b6mI2Ye4uJUTdi4wjIvLb.jpg"
   }
}