{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "unlikely friendship",
            "id": 167982
         },
         {
            "name": "italian stereotype",
            "id": 168551
         },
         {
            "name": "odd couple",
            "id": 187376
         }
      ],
      "imdb_id": "tt0119465",
      "video": false,
      "title": "Kiss Me, Guido",
      "recommendations": [
         32700,
         32445,
         64802,
         15850,
         5591,
         81350,
         97537,
         50073,
         14205,
         21001,
         50070,
         19094,
         9098,
         21059,
         19555,
         32633,
         54934,
         35638,
         13141,
         239552
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Frankie",
               "gender": 0,
               "credit_id": "561e2c53c3a3686ccc001bf0",
               "name": "Nick Scotti",
               "profile_path": null,
               "id": 59191,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Warren",
               "gender": 2,
               "credit_id": "561e2c65c3a3686cc3001e9b",
               "name": "Anthony Barrile",
               "profile_path": null,
               "id": 58819,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Pino",
               "gender": 2,
               "credit_id": "561e2c7ac3a3686ccc001bf7",
               "name": "Anthony DeSando",
               "profile_path": "/b7LiBIdaquQDfRJYAvy2TEurb2h.jpg",
               "id": 176628,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Meryl",
               "gender": 1,
               "credit_id": "561e2c90c3a3686cc1001d50",
               "name": "Molly Price",
               "profile_path": "/ac0F7GOwiSqglHajRHfUwlHUiW4.jpg",
               "id": 150972,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Terry",
               "gender": 2,
               "credit_id": "561e2ca59251414fb2000346",
               "name": "Craig Chester",
               "profile_path": "/FqvLDDJo596DbjngCOEMCDPOb7.jpg",
               "id": 82769,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Joey Chips",
               "gender": 2,
               "credit_id": "561e2cbf92514142b6001f6c",
               "name": "Domenick Lombardozzi",
               "profile_path": "/wDRD21PpTrP8MDAskbQ0NsftM57.jpg",
               "id": 17941,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "58252983c3a3683604002321",
               "name": "Jennifer Esposito",
               "profile_path": "/faY5fwjsJ8da3wJWSE7kQ3MPhgz.jpg",
               "id": 18285,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "561e29c09251414fb20002df",
               "name": "Tony Vitale",
               "profile_path": null,
               "id": 18139,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "561e29c992514142c9001d4d",
               "name": "Tony Vitale",
               "profile_path": null,
               "id": 18139,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "561e29e79251410d8f001a04",
               "name": "Ira Deutchman",
               "profile_path": null,
               "id": 27556,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "561e29fc92514142bf001bdb",
               "name": "Christine Vachon",
               "profile_path": "/fCSCpC4pxQ7xW6nNJt5klv2cowM.jpg",
               "id": 2862,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "561e2a11c3a3686cc1001d0b",
               "name": "Karen Vitale",
               "profile_path": null,
               "id": 1522364,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "561e2a2bc3a3686cd8001e7b",
               "name": "Claudia Raschke",
               "profile_path": "/tVTJdnxJyND7fl8mF5bJ5rFf64T.jpg",
               "id": 1144397,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "561e2b81c3a3686cd8001eb9",
               "name": "Alex Hall",
               "profile_path": null,
               "id": 229891,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561e2b959251414fb2000318",
               "name": "Kerry Barden",
               "profile_path": "/zb3khdNgVHerkFz4esvjSZHnbDW.jpg",
               "id": 5328,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "561e2ba9c3a3686cd100204b",
               "name": "Pat Distefano",
               "profile_path": null,
               "id": 1522365,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561e2bbbc3a3686cd6001c30",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561e2bce925141756d00012c",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "561e2be3c3a3686cd100205b",
               "name": "Jeffrey Rathaus",
               "profile_path": null,
               "id": 1522366,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "561e2bf49251414fb200032c",
               "name": "Wanda Wysong",
               "profile_path": null,
               "id": 1522367,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "561e2c08c3a3686cdd002159",
               "name": "Victoria Farrell",
               "profile_path": null,
               "id": 54900,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.24389,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32519,
      "vote_count": 11,
      "budget": 0,
      "overview": "When he discovers his girlfriend having sex with his brother, Frankie (Scotti) decides to head to Manhattan, leaving his Bronx pizza shop forever for the fame and fortune of show business. But before stardom, he needs a place to stay. Looking in the personals, he notices GWM. And thinking it \"Guy with Money,\" he heads to the Village and the apartment of gay actor Warren (Barrile), who's in desperate need of this month's rent.",
      "similar": [
         449176,
         184352,
         10938,
         11000,
         26280,
         4927,
         10806,
         16367,
         338189,
         376867,
         2898,
         428493,
         21060,
         9261,
         1966,
         142,
         1213,
         9800,
         398818,
         11421
      ],
      "original_title": "Kiss Me, Guido",
      "runtime": 86,
      "poster_path": "/esqwwwjYwMcz7HqfLCWo0H0mdx1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Redeemable Features",
            "id": 1483,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Capitol Films",
            "id": 826,
            "origin_country": ""
         }
      ],
      "release_date": "1997-07-18",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tony Vitale"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Tony Vitale"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119465/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzMyNTE4Mjk4MF5BMl5BanBnXkFtZTcwNTMwMjEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Nick Scotti, Anthony Barrile, Anthony DeSando | See full cast and crew »"],
      "reviews": [
         "\"Kiss Me Guido,\" written and directed by Tony Vitale, is a little fun piece set in New York's Bronx and lower Manhattan. The light comedy involves mistaken identities, misunderstandings, and mis-pairings, with somewhat stereotypical character types and situations. A sincere and energetic cast is headed by handsome Nick Scotti in an impressive comic performance, and all the players seem to be enjoying themselves with this little romp. I personally found it to be an amusing diversion.",
         "Stereotypes, full of them yes, but behind every stereotype there is a truth or two.... As a person who fits into the two main groups portrayed in this movie and who comes from New York City, I have to say one only need take a stroll through the Village or through the Bronx to see those stereotypes running around! This movie was good fun, a farce, a case of mistaken identity--the little bits of Italian thrown in made me laugh and think of my own family and how often I heard some of the phrases used in it. Well, I certainly had a friend who was just like Terry and saw plenty of Dakotas running around too. This little movie holds a mirror up to some who fit the stereotype and says \"laugh at yourself\" there is humor in life all around us. Note the lack of violence and the theme that the most improbable pair of people may just be able to find that they have something in common. It's not Oscar material--accept it for what it is and have a laugh. Oh yes, Nick Scotti ain't bad to look at either.",
         "KISS ME, GUIDO Aspect ratio: 1.85:1 Sound format: Ultra-Stereo Writer/director Tony Vitale's comedy of (gay) manners is lightweight, inoffensive stuff distinguished by vivid performances and smart dialogue, but the film refuses to take risks and almost succumbs to blandness as a result. Ultra-cute Nick Scotti is the ultra-macho Italian-American stud who, due to circumstances beyond his control, finds himself rooming with ultra-gay Anthony Barrile. Thereafter, the film basically examines the ways in which these two disparate personalities attempt to reconcile themselves to one another, and how friendships are formed under duress. Gay viewers attuned to Vitale's sensibilities will find themselves laughing out loud at regular intervals, while everyone else will probably smile politely, admiring the witty one-liners while never really 'getting' the joke. Everything hinges on the appeal of the central characters, and they're a bit of a mixed bag: Despite his rough-hewn exterior, Scotti's character comes across as too much of a nice guy to really pose a threat to anyone - gay or straight - but his performance is so natural and strong that he simply acts poor Barrile right off the screen! Scotti also has the distinct advantage of being devastatingly beautiful, which Vitale exploits in several amusing ways, especially a dream sequence inspired by THE SOUND OF MUSIC(!). Anthony DeSando plays Scotti's brother with an even greater degree of exaggerated studliness, like a firecracker going off on the 4th of July, while Craig Chester enjoys himself as Barrile's camp best friend. The film is charming, safe, and very watchable - and Scotti's only 'gay' kiss in the entire picture is with the one person you'd least expect. Enjoy... NB. The movie inspired a short-lived TV series, \"Some of My Best Friends\" (2001), with Jason Bateman as the gay guy, and Danny Nucci as his ultra-hunky straight roommate.",
         "A dumb as bricks Italian Frankie (Nick Scotti) unwittingly moves in with a gay guy Warren (Anthony Barrile). He doesn't know Warren is gay--he thinks GWM means \"guy with money\"!! He finds out and gets along with Warren...but he knows his family and friends won't accept Warren. What to do? The jokes are obvious and there are some REALLY bad ones, but I still like this. It has stereotypes galore--Frankie's family especially. Frankie's dumb; his brother is seriously over-sexed (and dumb); his mother is fat, loud and obnoxious; his father is fat and always has stomach pains and the grandmother always dresses in black, is always at the kitchen table and doesn't speak a word of English! Warren is also stereotyped--his apartment is immaculate, he has art paintings all over the walls and he LOVES Julie Andrews. He also has a very queeny (and very funny) gay best friend. Still, I was giggling and laughing through this. The movie is so good-natured you can't be offended. And it IS a silly movie anyways. And it has a happy ending. The acting is all pretty good if a little shrill. Scotti especially comes off well. He's also very handsome and we get a few shots of his muscular chest. So, not good but fun. A true guilty favorite. Best line: \"You threw up on your shirt\".",
         "KISS ME GUIDO needs a re write and a remake. It is actually a funny premise fairly well executed, edited and cast...but with far too many stereotypes. Also the sound recording is not good at all. All these negatives still do not outweigh the fact that there is a good movie here waiting to be snazzed up into something played more into the galaxy of LA CAGE AUX FOLLES or PRISCILLA . As a low budget NY gay-ish camp/ Italian comedy it is simple and funny, but seems like a first draft that was made instead of reworking and reinventing and then snaring a better budget and bigger mindset. I like KISS ME GUIDO enough to give it a peck not a smooch. Maybe Tony Vitale can do as I suggest and boost the whole thing up a few octaves and make it bigger and louder and funnier and genuinely raucous. See NORMAN IS THAT YOU from 1976 for pointers....or THE (new musical version) PRODUCERS from Mel Brooks and go there.",
         "This film is about a straight man looking for a room to rent, and he stumbles upon a room in a gay man's flat. After misinterpreting what GWM means, the pizza guy with Italian roots view a nice flat inhabited by a gay actor. Both these guys just had relationship troubles, and they both do not understand each others' lifestyles. After tolerance and understanding, they become great friends. Together with the fun supporting characters, and the numerous romantic entanglements, \"Kiss Me Guido\" is a fun, light hearted film that entertains. Though it's made with a small budget, it doesn't look cheap. the only thing that bothers me is the old fashioned hairstyles that do not age well.",
         "Kiss Me Guido is a campy, somewhat monolithic but very funny story of \"culture clash\". The visual appeal is substantial, and the humor is on par with \"Will & Grace\". It is an excellent vehicle for showing the truth about several sub-cultures of American society without singling out anyone for offensive jabs. As soon as it is released on DVD it will be in my collection!",
         "I saw this movie last night and what a hilarious movie. The neighborhood and characters were so true Italian that I felt I was with my own family. And, Warren and Terry cracked me up. Very funny movie and a cute storyline.",
         "dumb, with broad stereotypes, but it was quite funny. I spent my first sixteen years in and Italian neighborhood in the Bronx, and the Italian guys are pretty on the mark. I found the gay guys a little too much of a stereotype, but not enough to ruin the film. I also think it is a mistake to call this a gay film. It is really a light comedy with a gay man and an Italian-American man. If you are looking for something PC with a strong social statement on being gay, don't bother with this film. If you have an open mind, time to kill, and want to laugh, this film is pretty good. And yes, I can believe some guy from the Bronx thinking that GWM means \"guy with money.\"",
         "The situation of a straight young macho Italian, suddenly finding himself in a gay environment, has possibilities that were not explored. Scotti was good in the role, and the supporting cast did what they were supposed to to, but it just didn't click. I think that the fault lies in the script, which was funny at times, but rather patchy. I disagree with \"Anonymous\" of NYC who said that it was \"moronic and one dimensional\", but I do agree that it could have been better."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Capitol Films",
         "Redeemable Features"
      ],
      "summaries": ["Warren has an extra room in his apartment (and is five months behind on the rent) after his lover moves out, so a friend places an ad on his behalf for a GWM roommate. Frankie, a pizza baker (and aspiring actor), decides to move out of his family's flat in The Bronx when he comes home one evening and walks in on his brother making love to Frankie's girlfriend. Frankie checks ads for roommates in \"the city\" (i.e., Manhattan), notices Warren's ad and decides to answer it, reasoning that GWM stands for \"Guy With Money.\""],
      "budget": 740000
   },
   "movielensId": 1612,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-07-18",
      "dvdReleaseDate": "2001-01-09",
      "directors": ["Tony Vitale"],
      "runtime": 86,
      "movieId": 1612,
      "title": "Kiss Me, Guido",
      "mpaa": "",
      "actors": [
         "Nick Scotti",
         "Anthony Barrile",
         "Anthony DeSando",
         "Molly Price",
         "Craig Chester",
         "Domenick Lombardozzi",
         "Jennifer Esposito"
      ],
      "imdbMovieId": "0119465",
      "originalTitle": "Kiss Me, Guido",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "When he discovers his girlfriend having sex with his brother, Frankie (Scotti) decides to head to Manhattan, leaving his Bronx pizza shop forever for the fame and fortune of show business. But before stardom, he needs a place to stay. Looking in the personals, he notices GWM. And thinking it \"Guy with Money,\" he heads to the Village and the apartment of gay actor Warren (Barrile), who's in desperate need of this month's rent.",
      "tmdbMovieId": 32519,
      "avgRating": 3.21992,
      "releaseYear": "1997",
      "numRatings": 482,
      "posterPath": "/esqwwwjYwMcz7HqfLCWo0H0mdx1.jpg"
   }
}