{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "rent boy",
            "id": 231839
         }
      ],
      "imdb_id": "tt0120197",
      "video": false,
      "title": "Star Maps",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Carlos Amado",
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d93",
               "name": "Douglas Spain",
               "profile_path": "/4WgW1tcO06dC3Wnmr4qsjajovQI.jpg",
               "id": 77350,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Pepe Amato",
               "gender": 0,
               "credit_id": "52fe4a9bc3a36847f81d7d97",
               "name": "Efrain Figueroa",
               "profile_path": "/4LXc47bgpkxJ1GjF69Y9rNN5bWd.jpg",
               "id": 168164,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Jennifer",
               "gender": 0,
               "credit_id": "52fe4a9bc3a36847f81d7d9b",
               "name": "Kandeyce Jorden",
               "profile_path": null,
               "id": 1044098,
               "order": 2
            },
            {
               "cast_id": 22,
               "character": "Teresa Amato",
               "gender": 1,
               "credit_id": "5903dda992514169d0002569",
               "name": "Martha Velez",
               "profile_path": null,
               "id": 194698,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Maria Amato",
               "gender": 0,
               "credit_id": "52fe4a9bc3a36847f81d7da3",
               "name": "Lysa Flores",
               "profile_path": null,
               "id": 1044099,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Letti, Pepe's Girlfriend",
               "gender": 0,
               "credit_id": "52fe4a9bc3a36847f81d7da7",
               "name": "Annette Murphy",
               "profile_path": null,
               "id": 1044100,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7dab",
               "name": "Robin Thomas",
               "profile_path": "/seivBO3KRFAKqNgL3wnvpwxHwKz.jpg",
               "id": 41465,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Juancito Amato",
               "gender": 0,
               "credit_id": "52fe4a9bc3a36847f81d7daf",
               "name": "Vincent Chandler",
               "profile_path": null,
               "id": 1044101,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Fred Marin",
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7db3",
               "name": "Al Vicente",
               "profile_path": "/avW8xzMK0ezRiBkxwWgRvj2Tyov.jpg",
               "id": 156625,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Cantinflas' Ghost",
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7db7",
               "name": "Herbert Siguenza",
               "profile_path": "/3N3hUAIO9k1ZaPwO2Ojb6pbOQ5I.jpg",
               "id": 178667,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Star Map Boy",
               "gender": 2,
               "credit_id": "57f49db39251411c6f001eaf",
               "name": "Michael Peña",
               "profile_path": "/oqlIKSglghuX7kSTalODn71nlOd.jpg",
               "id": 454,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d59",
               "name": "Miguel Arteta",
               "profile_path": "/c1StX0L6loDCLcQODL8Z6CPYF1t.jpg",
               "id": 61069,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d5f",
               "name": "Miguel Arteta",
               "profile_path": "/c1StX0L6loDCLcQODL8Z6CPYF1t.jpg",
               "id": 61069,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d65",
               "name": "Miguel Arteta",
               "profile_path": "/c1StX0L6loDCLcQODL8Z6CPYF1t.jpg",
               "id": 61069,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d6b",
               "name": "Matthew Greenfield",
               "profile_path": null,
               "id": 61071,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a9bc3a36847f81d7d71",
               "name": "Beth Colt",
               "profile_path": null,
               "id": 588421,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d77",
               "name": "Matthew Greenfield",
               "profile_path": null,
               "id": 61071,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d7d",
               "name": "Chris Iovenko",
               "profile_path": null,
               "id": 144514,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d83",
               "name": "Mitchell Kelly",
               "profile_path": null,
               "id": 547147,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a9bc3a36847f81d7d89",
               "name": "Scott King",
               "profile_path": null,
               "id": 263621,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a9bc3a36847f81d7d8f",
               "name": "Chuy Chávez",
               "profile_path": null,
               "id": 53897,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.591452,
      "production_countries": [],
      "id": 108401,
      "vote_count": 3,
      "budget": 0,
      "overview": "Carlos wants to be an actor. But his father, Pepe, wants him to work in the family business, that is, male prostitution. Carlos decides that he will be one of his father's boys until he can get his foot in the door in Hollywood.",
      "similar": [],
      "original_title": "Star Maps",
      "runtime": 86,
      "poster_path": "/oX3LxA4bg6U9HuGEcHL5wCiiLAC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "1997-07-23",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "In Hollywood every dream has a price.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Miguel Arteta"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Miguel Arteta",
         "Miguel Arteta"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120197/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3NTU2NzQyMl5BMl5BanBnXkFtZTcwODk1MjYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Douglas Spain, Efrain Figueroa, Kandeyce Jorden | See full cast and crew »"],
      "reviews": [
         "I thoroughly enjoyed \"Star Maps.\" I found it to be a very unique and original film that was totally unpredictable, something which you don't see too often in today's films (I'm still trying to figure out what was up with Carlos' brother). I think anyone who has ever dreamed of coming to Hollywood to become a movie star or who has a crazy family they want to get away from, will relate to the character of Carlos and what he is striving for. Good acting from all.",
         "Carlos is a young man with dreams of becoming an actor in Hollywood. However to get money and fill time until he hits it big, Carlos gets drawn back into his father's business which involves lots of young men selling maps to the homes of the stars \u0096 or rather using this as a front for acting as male prostitutes. When one of his clients offers him a bit part in her television show, Carlos takes the chance for a few lines to start him off. His father naturally objects and warns him that only him and his prostitution racket are what Carlos will ever have, but Carlos continues with his dream. Despite having lots of things that it could focus on and therefore quite a bit of potential this film turns out to be rather a messy and unfocused affair that does enough to keep you watching without ever doing enough to grip or truly engage. It does this by simply keeping moving but for my money that was not enough; I wasn't really convinced by the world I was being shown \u0096 neither the gigolo world or the opportunities that Carlos got as a result of it. The two didn't sit well together and I didn't think Carlos suited either of them as a character either. Failing to convince me or engage me meant that I never got into the characters or their stories so, no matter what happens in the film, I honestly never cared for any of them enough to stick with it. The cast try hard but most of them are just left trying without the material to work with. Spain was surprisingly good but his character was unconvincing and there was only so much he could do with it by himself. Figueroa is larger than life but again the material doesn't allow him to be a person. The support cast all have the same problems, all of them are trying hard but the material allows the audience to remain apathetic about them and their fate and their performances are diminished as a result. Overall this is an interesting enough film but it tries to do too much and succeeds in none of them. The main failure is that it is never convincing enough to engage and, although it never drags, it is certainly difficult to care about all the things that are happening. Distracting then, but certainly not a \"good\" movie.",
         "I went into this movie only knowing via the IMDb that this was a \" comedy drama \" featuring a protagonist called Carlos who dreams of being an actor . This is something many people registered over at the IMDb can relate too , we all dream of being stars in Hollywood , not necessarily movie stars ( It's screen writing with me chaps ) but obviously we want to make a success of our lives . So I sat down on the sofa with a cup of tea to watch this comedy drama Teenager Carlos lives with his stepfather Pepe and sick mother along with his brother and sister . Luckily Pepe is well connected in Hollywood and can get Carlos \" work \" which beats selling Star Maps on street corners . Oh hold on this \" work \" involves Carlos stripping naked and letting men do sexual things to Carlos . OMFG you mean Pepe is pimping his stepson ! Who's the idiot who wrote off to the IMDb saying that this was a comedy drama ? Let me warn everybody coming to this entry that STAR MAPS is a bleak , depressing , nihilistic movie where the audience never feel like smiling once . It's very much like a Larry Clark movie containing unlikable characters and rather explicit sex There's a scene where Maria ( Carlos sister )invites her boyfriend round for dinner and as soon as he sat down at the table I had to switch over because you soon cotton onto the fact that if someone is about to experience anything resembling happiness someone else is going to enter the scene and take it away from them as sure as night follows day This is something of a backhanded compliment to writer/director Miguel Arteta because you genuinely care for the characters in the movie , you feel great sympathy for some of them but because the majority are shown as freaks , pimps and whores it becomes very difficult and despite being very involving it's far from entertaining due to the subject matter .",
         "Once apon a time, there was this latin boy who wanted to be a star. He went to Hollywood where he quickly found out that every waiter in town wants to be one to. He turns to the oldest profession ever written (in what we in California call selling \"Star Maps\") & he gets an instant lesson on life. The ever-so sexy & hot Douglas Spain plays this character better than anyone as he parades through the hills trying to get what he wants...this film isn't for everyone, but, if you are willing to sacrifice TALENT over STORY, then please see one of Hollywoods hottest upcoming actors (Spain) in his best role yet. 1-10 (10) Z.",
         "\"Star Maps\" appears to be a sincere dramatic product which simply spreads itself too thin. The film attempts to focus on the problems, unusual in both quantity and character, which beset a Mexican family in Los Angeles. However, it spreads itself to thin, lacks purpose, plays out uneven, is occasionally hard to swallow, and when it runs out of time it just quits. Overall the film has its moments but they're too few and too far between. A somewhat gritty drama with strong sexual content, \"Star Maps\" just doesn't measure up. Most likely to be appreciated by indie lovers and Mex-Am audiences. (C-)",
         "Miguel Arteta wrote and directed this extremely naïve modern-day story of a young Hispanic boy in Hollywood, just off the bus from Mexico, who reunites with his family and becomes part of his father's street corner map-selling business--a front for prostitution (a fact every driver seems to get but, oddly, no police). Arteta doesn't have a solid or interesting take on this old situation, and he has no intrinsic feel for the ambiance of Los Angeles. What's worse, he has even less talent working with his Hispanic cast (these must be the most Anglo-ized Latinos and Latinas on the screen since the 1960s). The youngster's domineering, abusive father stands in the kid's way of his pursuing an acting career (wouldn't that bring in more dinero than sex-for-cash?), yet Arteta never puts this love-hate relationship into any perspective, and the flashback near the climax does nothing to reconcile our feelings for the characters. It's a mess, yet one can clearly perceive a spark of ambition here, a stab at something more profound than what we ultimately see on the screen. * from ****",
         "\"Star Maps\" is a unusual for a Hollywood film. It is quite literate and does not follow the conventional Hollywood film structure. In fact, it views like a film version of a literary novella. This is probably it's weakness and it's strength. I am being very vague because I do not like to step on anyone's enjoyment of film by inadvertently spilling the beans. Just take my word for it that \"Star Maps\" is a literate movie with very talented Hispanic actors and actresses. \"Star Maps\" is the bittersweet journey of a Mexican hustler who wants to be a famous actor but finds that goal challenged by his extremely dysfunctional family. This movie is a great Hollywood coming-of-age story in the vein of \"Where The Day Takes You\" and \"Eddie Presley\". Definitely worth a look!",
         "This movie wants to be great. It's got a really fresh, original script. Sometimes the directing is just as fresh and original. But every time you think it's going to immerse you, it turns into a TV movie. The \"look\" of the movie often (but not always) screams TV and not film. The acting is usually \"art house\" good. But then some scene is so poorly acted you have to wonder why the director didn't make another take. The pacing is rushed and then not. It's like two different directors worked on two films from the same script and some inexperienced editor had to make it into one movie. The sex scenes are quite hot, but then the pacing is clipped. It plays like a very late-night TV movie where they want to include sex, but they don't want it to be quite soft-porn, so they pan or edit it more tightly. The movie is worth seeing, if nothing else for the great original story and \"moments\" where it achieves filmness. In between you just have to sit through some scenes and wonder if the director or the art director went on break and the rest of the crew started shooting without them. The music is often excellent, but also inconsistently tossed in without creating any overall synthesis or mood. Sometimes music can bring together a disjointed film. Here it's another missed opportunity. Annette Murphy is a stand-out as \"a whore and your father's girlfriend.\" Douglas Spain is so beautiful in this that he smolders -- completely convincing as a young prostitute. Lysa Flores (who was also the musical director) is one of the actors that makes the movie not suck -- terrific! Kandeyce Jorden is distractingly beautiful as a Cindy Crawford look-alike. Unfortunately she's miscast. Her monotone voice, while alluring, doesn't fit the style of the film. It comes off as bored or disinterested, which doesn't match her character's motivation. Her sex scenes are very nice, however. Kandeyce Jorden has since been writing and directing short films. You can see Undone and Layover on the web at iFilm.com and Skyy.com. Director/writer Miguel Arteta has directed and written \"The Good Girl\" since this. You can see some similarity in style and in flaws. I think Mr. Arteta needs to work with a mentor to achieve his potential. It's obviously there, it's just unrealized. This is a sexy and interesting film. It's well worth seeing, even for the flaws.",
         "I am amazed at the comments, as many of the commentators seem to want to watch a Hollywood movie, but were unaware that they were watching a film. First off, yes, this movie is gritty. And it does have its flaws. I can tell, however, that few of the commentators carefully watched this film by a)the sole focus on the character Carlos, and b)the comment that this was an unhappy ending. This is a story about a family, and it is not so much a docudrama about Mexican immigrants living in Los Angeles as it is an allegory about family life and the struggle to be happy. A key character in this film is the mother, Teresa. She is mentally ill (I believe schizophrenic, but it is never detailed) and she serves as the center for the family. Carlos and Maria want to leave, but stay because of their duty to take care of their mother. The brother (whose name I forget) withdraws, and does not want to face the reality of the family dynamics. But here is where I believe everyone is wrong. There is a happy ending, just not a completely resolved one. When Teresa commits suicide, she is free from her world, and is free to be with Cantinflas, who accepts her without condition. She now frees Maria, who stayed only to take care of her, who has found love (look closely at the ending montage - her boyfriend is still with her). Pepe has no more power over Carlos, nor over Maria. The allegory is about the trap that a dysfunctional family (being an allegory, we see a family being dysfunctional in the extreme) can become, and a stronger trap than we are often willing to admit to ourselves. Carlos stands up for himself in the end, not just against Pepe, but also against Jennifer, who merely wants to possess him in a different way. No, I thought the end was rather positive, and I applaud Arleta for not trapping the audience into a stereotypical \"happy ending,\" but rather truly freeing these characters not only from their chains, but also from a pat, Hollywood ending. The scene with Cantinflas and Teresa at the end was quite beautiful. The futures of all of the characters are open, just as anyone else's in the real world.",
         "STAR MAPS Aspect ratio: 1.85:1 Sound format: Dolby Stereo The dreams of a Mexican-American boy (Douglas Spain) are shattered by his abusive father. STAR MAPS is a reasonably engaging, though somewhat downbeat, examination of frustrated idealism amid the seedier side of life in Hollywood. The film's cynical narrative mixes dysfunctional families, mental breakdown, suicide, prostitution (male and female), sex and violence into a brew which simmers nicely without ever boiling over into something truly remarkable."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Flan de Coco Films",
         "King Films"
      ],
      "summaries": ["Carlos wants to be an actor. But his father, Pepe, wants him to work in the family business, that is, male prostitution. Carlos decides that he will be one of his father's boys until he can get his foot in the door in Hollywood. Finally one of his clients, a rich soap star, offers him a bit part in her show. Pepe tell Carlos that she is just using him and demands that he not see the women any longer. Carlos defies his father and when his big day comes he is finds out the harsh realities of life are even harsher than he imagined."],
      "budget": 0
   },
   "movielensId": 1613,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1997-07-23",
      "dvdReleaseDate": null,
      "directors": ["Miguel Arteta"],
      "runtime": 86,
      "movieId": 1613,
      "title": "Star Maps",
      "mpaa": "",
      "actors": [
         "Douglas Spain",
         "Efrain Figueroa",
         "Kandeyce Jorden",
         "Martha Velez",
         "Lysa Flores",
         "Annette Murphy",
         "Robin Thomas",
         "Vincent Chandler",
         "Al Vicente",
         "Herbert Siguenza",
         "Michael Peña"
      ],
      "imdbMovieId": "0120197",
      "originalTitle": "Star Maps",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Carlos wants to be an actor. But his father, Pepe, wants him to work in the family business, that is, male prostitution. Carlos decides that he will be one of his father's boys until he can get his foot in the door in Hollywood.",
      "tmdbMovieId": 108401,
      "avgRating": 3.15926,
      "releaseYear": "1997",
      "numRatings": 270,
      "posterPath": "/oX3LxA4bg6U9HuGEcHL5wCiiLAC.jpg"
   }
}