{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "buddhism",
            "id": 188
         },
         {
            "name": "himalaya",
            "id": 486
         },
         {
            "name": "austria",
            "id": 1201
         },
         {
            "name": "mountain",
            "id": 1262
         },
         {
            "name": "buddhist monk",
            "id": 1529
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "prisoner of war",
            "id": 1968
         },
         {
            "name": "monsoon",
            "id": 2385
         },
         {
            "name": "tibet",
            "id": 4558
         },
         {
            "name": "dalai lama",
            "id": 4559
         },
         {
            "name": "mountaineer",
            "id": 4560
         },
         {
            "name": "lhasa",
            "id": 4561
         },
         {
            "name": "wedding",
            "id": 13027
         }
      ],
      "imdb_id": "tt0120102",
      "video": false,
      "title": "Seven Years in Tibet",
      "recommendations": [
         4476,
         297,
         6073,
         4477,
         1535,
         819,
         8367,
         6520,
         409,
         293,
         8195,
         581,
         9804,
         9944,
         2133,
         2024,
         1647,
         11329,
         2604,
         3595
      ],
      "backdrop_path": "/6HjYM1vgqWpFTr01tOBrskfvxcu.jpg",
      "revenue": 131457682,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Heinrich Harrer",
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a10d",
               "name": "Brad Pitt",
               "profile_path": "/kU3B75TyRiCgE270EyZnHjfivoq.jpg",
               "id": 287,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Dalai Lama, 14 Years Old",
               "gender": 0,
               "credit_id": "52fe4295c3a36847f802a111",
               "name": "Jamyang Jamtsho Wangchuk",
               "profile_path": "/fW1MmG9Q6q5NIvWEVf3S6CJJNgb.jpg",
               "id": 14591,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Peter Aufschnaiter",
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a115",
               "name": "David Thewlis",
               "profile_path": "/lWCGcTKvr4QUi8MvFBleMw8xY8.jpg",
               "id": 11207,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Ngawang Jigme",
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a119",
               "name": "BD Wong",
               "profile_path": "/w7Hs9m6ocS2qlibvrLOvmyCKbAN.jpg",
               "id": 14592,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Kungo Tsarong",
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a11d",
               "name": "Mako",
               "profile_path": "/gU3eoZP8OQZLFMPZ9MYWa6pajvT.jpg",
               "id": 10134,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Ingrid Harrer",
               "gender": 1,
               "credit_id": "52fe4295c3a36847f802a121",
               "name": "Ingeborga Dapkunaite",
               "profile_path": "/hVqzjEBJiaYp9sTJA4IXNLJtLK2.jpg",
               "id": 14593,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Pema Lhaki",
               "gender": 0,
               "credit_id": "52fe4295c3a36847f802a125",
               "name": "Lhakpa Tsamchoe",
               "profile_path": "/z43d44Xxq8bToSGMOtWcsPhmFgG.jpg",
               "id": 14594,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "British Officer",
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a129",
               "name": "Duncan Fraser",
               "profile_path": "/65nwyXassO3PmeL8vvC7DKDXcSM.jpg",
               "id": 14595,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Regent",
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a12d",
               "name": "Danny Denzongpa",
               "profile_path": "/9mfS2Tuf4C4VXOsTglXaCyHI4cj.jpg",
               "id": 14596,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Chinese 'Amban'",
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a131",
               "name": "Victor Wong",
               "profile_path": "/70vAqnH2QFhLOenNQCVcaG1JhN3.jpg",
               "id": 11395,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a0c1",
               "name": "Jean-Jacques Annaud",
               "profile_path": "/sxNr4V5xESbnn6To1etsLoPj5SC.jpg",
               "id": 2352,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a0c7",
               "name": "Jean-Jacques Annaud",
               "profile_path": "/sxNr4V5xESbnn6To1etsLoPj5SC.jpg",
               "id": 2352,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a0cd",
               "name": "Heinrich Harrer",
               "profile_path": null,
               "id": 14587,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4295c3a36847f802a0d3",
               "name": "Becky Johnston",
               "profile_path": null,
               "id": 14588,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a0d9",
               "name": "Iain Smith",
               "profile_path": "/3jhs9gdWhLBsKgOIKzmWnrkX0xD.jpg",
               "id": 8374,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a0df",
               "name": "John Williams",
               "profile_path": "/2Ats98PB1SH2yfEPikiLdhRuXZm.jpg",
               "id": 491,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a0e5",
               "name": "Robert Fraisse",
               "profile_path": null,
               "id": 2596,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4295c3a36847f802a0eb",
               "name": "Noëlle Boisson",
               "profile_path": null,
               "id": 12758,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4295c3a36847f802a0f1",
               "name": "Priscilla John",
               "profile_path": null,
               "id": 3311,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe4295c3a36847f802a0f7",
               "name": "Francine Maisler",
               "profile_path": "/7kOKhRSuwDXqyd2Dm2xdWdi18lQ.jpg",
               "id": 6410,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4295c3a36847f802a0fd",
               "name": "Hoang Thanh At",
               "profile_path": null,
               "id": 14589,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4295c3a36847f802a103",
               "name": "Jim Erickson",
               "profile_path": null,
               "id": 8680,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe4295c3a36847f802a109",
               "name": "Enrico Sabbatini",
               "profile_path": null,
               "id": 14590,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4295c3a36847f802a137",
               "name": "John H. Williams",
               "profile_path": null,
               "id": 12107,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 11.101577,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 978,
      "vote_count": 838,
      "budget": 70000000,
      "overview": "Austrian mountaineer, Heinrich Harrer journeys to the Himalayas without his family to head an expedition in 1939. But when World War II breaks out, the arrogant Harrer falls into Allied forces' hands as a prisoner of war. He escapes with a fellow detainee and makes his way to Llaso, Tibet, where he meets the 14-year-old Dalai Lama, whose friendship ultimately transforms his outlook on life.",
      "similar": [
         5925,
         423,
         15121,
         16869,
         2253,
         613,
         637,
         409,
         85,
         1771,
         14574,
         227306,
         424,
         228150,
         339259,
         289222,
         351339,
         369885,
         9654,
         152760
      ],
      "original_title": "Seven Years in Tibet",
      "runtime": 136,
      "poster_path": "/cflSeFUVDCf73Tzh5sB204JbQ6j.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mandalay Entertainment",
            "id": 1236,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Applecross",
            "id": 57435,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Reperage & Vanguard Films",
            "id": 57436,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-12",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "At the end of the world his real journey began.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jean-Jacques Annaud"],
      "runtime": 136,
      "synopsis": "The introduction shows the young Dalai Lama receiving gifts from Tibetan monks. One gift he receives, an ornate music box, has special meaning to him, as he is still a young child. The progress of Heinrich Harrer through India and Tibet on his trek across the high plateau to Lhasa is interwoven with the story of the young Dalai Lama growing into an 8 year old boy who becomes the spiritual leader of Tibet, with a thirst for western knowledge and later into an adolescent. The Dalai Lama is portrayed by three different actors as he grows up. Harrer (Pitt) and his pregnant wife Ingrid (Ingeborga Dapkunaite) are briefly shown being driven to the train station in Graz, for Harrer's departure on an expedition to Nanga Parbat. It becomes evident that Ingrid resents his departure. At the station Harrer barges through the crowds, dragging his wife by the hand, and shows his resentment of Peter Aufschnaiter's selection as leader of the expedition. Harrer at the train station in 1939 appears hostile to the Nazi Party, taking their flag with reluctance. The real-life Heinrich Harrer admitted he had Nazi sympathies at the time which he later regretted. Harrer's arrogance and self-sufficiency become apparent as he sits by himself on the train journey to India. The expedition begins climbing the mountain Harrer, Aufschnaiter, and the expedition group begin climbing Nanga Parbat. Harrer falls, injuring his leg, but hides his injuries from the group. Harrer places Aufschnaiter's life in danger by his inability to pull him safely up a cliff due to the pain of his injury; this worsens their relationship. After an avalanche, Aufschnaiter orders the group to retreat back to the base, despite Harrer's determination to reach the summit. While descending from the mountain, Harrer encounters a Tibetan traveller who gives him a photograph of the Dalai Lama for his protection. On reaching the base, they learn that Germany has invaded Poland, and they are arrested by the British and taken by truck to Dehra Dun prison camp. Harrer writes to Ingrid in Austria, telling of his capture; she responds with divorce papers and tells him she wishes to re-marry. Harrer's son Rolf is now two. Harrer makes several unsuccessful escape attempts. Eventually Aufschnaiter manages to steal a British uniform and several of the prisoners escape. The members of the group go separate ways, with Harrer heading for northern India. On reaching northern India in 1943, Harrer steals food from a religious offering, but is later violently sick from food poisoning. The rest of the group, apart from Aufschnaiter, have been recaptured. Aufschnaiter plans to travel to China to find work. They cross the border into Tibet and set out east, but are met by two men on horseback who tell them they must turn back. Aufschnaiter attempts to speak to them in Tibetan, which he learned while in prison, but is told that foreigners are strictly forbidden in Tibet. On reaching the next town and requesting food, they are confronted by the same two men. They learn that one of them is the garpon, leader of the province, and that the reason that foreigners are forbidden from Tibet is that there is a threat of attack from outside forces. Harrer attempts to appease the garpon by offering him the photo of the Dalai Lama, but they are forced to return towards India, escorted by two guards who are told to shoot them if they try to escape. Harrer and Aufschnaiter are escorted to a small town near the border with India where they trade what little they have in return for food. Harrer persuades Aufschnaiter to trade a watch that he received from his father for climbing Mont Blanc. Seeing one of the guards trying on a Chinese army uniform, he offers him his \"German army boots\" while actually giving him crampons. The guard takes a liking to the \"boots\" and puts them on. Harrer and Aufschnaiter escape to the mountainside where the guards, clad in the heavy crampons and uniforms, are unable to follow. While recovering from the escape, Aufschnaiter discovers that Harrer has deceived him about not having a watch to trade, and is furious at Harrer's selfishness. Harrer, first indifferent, after a while begs forgiveness, offering Aufschnaiter all three of his watches and his wedding ring. Aufschnaiter declines the ring, but Harrer insists, stating \"I didn't deserve it either.\" The two then start on their way over the high Tibetan plateau to Lhasa. The arduous journey to Lhasa (including footage secretly captured by director Jean Jacques Annaud in Tibet) causes Harrer to reflect on his son Rolf and the Tibetan custom that the longer and more difficult the journey in a pilgrimage, the greater the repentance of past sins. High in the Himalayas, Harrer and Aufschnaiter are abducted by bandits, but they escape on horseback. Harrer and Aufschnaiter are forced to kill their horses and eat the meat raw. In Lhasa, the pair encounter pilgrims travelling to Lhasa. They are only allowed to join the group after saying they have \"special permission\" and showing one of the pilgrims the instruction sheet from their first aid kit. As the Tibetan they show it to cannot read English, he allows the two men to join the pilgrims. In Lhasa, Harrer and Aufschnaiter cover their faces to avoid recognition as foreigners. When they try to steal food, Kungo Tsarong, played by Mako, seeing the condition of the travellers, invites them to stay at his home. Tsarong asks for permission for the explorers to remain in Lhasa. The conversation is overheard by the secretary to the regent, Ngawang Jigme (B. D. Wong). Jigme offers Harrer and Aufschnaiter a gift of new clothes, and at the guest quarters of Tsarong's home a Tibetan tailor named Pema Lhaki arrives to measure the two men. Not having seen a woman for several years, they immediately attempt to win her affections. Settled in Lhasa, Harrer continues his attempts to impress Pema Lhaki by demonstrating his climbing techniques and showing a scrapbook containing his achievements back in Austria in skiing and his gold medal at the 1936 Winter Olympics. Lhaki is seemingly unimpressed, stating that climbing is a foolish pleasure and informing Harrer that Western civilization is very different from Tibet, where a man is more respected for abandoning his ego. Harrer, still interested in the Tibetan tailor, rips out a jacket pocket as an excuse to visit her and have it repaired. Harrer enters the store to find Aufschnaiter already there. The three go ice skating together, and Harrer realises that Aufschnaiter has succeeded in winning the Tibetan woman's love. The foreigners have been observed through a telescope by the young Dalai Lama from the nearby Potala Palace. Ngawang Jigme visits the Chinese embassy in Tibet and becomes acquainted with the Chinese ambassador. He has been sent by the Tibetan government to persuade Chinese officials to stop sending financial gifts to Tibetan monasteries as they are becoming suspicious of Chinese intentions. The Chinese official hints that Jigme could gain advancement by offering his services to the Chinese. By May 1945, Harrer visits Aufschnaiter and Pema Lhaki to congratulate them on their marriage. They discuss the activities of the Chinese Communist Party. Lhaki asks Harrer about his life in Lhasa, and he reveals he is very busy and moved out of Tsarong's house five months ago into his own settlement. But he has not found love, and shows his resentment over Aufschnaiter's marriage. Returning to Lhasa, where he has been hired to survey the city, he is told by Ngawang Jigme that World War II is now over. Heinrich immediately begins packing for home when Kungo's elderly wife arrives with a letter for him from Austria. The letter is from his son Rolf, telling him to stop writing. A depressed Harrer receives another letter, this time from the `Great Mother` of the Dalai Lama. In a beautiful Deyangsar courtyard, Harrer greets the Great Mother (played by Jetsun Pema, the sister of the living 14th Dalai Lama). She gives him instructions on how to behave when in the presence of the Lama, who has learned of Harrer's presence in Lhasa and would like to meet him personally. Harrer enters the interior halls of the Potala Palace. Turning into a dark chamber, he sees the mysterious Dalai Lama seated on a throne at the end. Entering behind the Great Mother, he bows repeatedly, much to the amusement of the young Lama. Harrer walks up to the throne, and the Dalai Lama plays with Harrer's mop of blond hair, calling him a yellow head. Shortly afterwards, the Dalai Lama asks the surprised Harrer if he can build him a movie cinema at the palace. He also wants Harrer to teach him about western civilization and become his private tutor during the building process. Harrer immediately begins building the theatre, but encounters a problem, as the workers refuse to harm the worms in the earth while digging, believing that each could have been their mother or a loved one in a past life. Harrer again visits the Dalai Lama, who emphasizes that religious concerns are paramount, and that he must honor them and find a solution. As the movie house is built, Harrer begins tutoring the boy in world geography and the ways of the west. Harrer and Aufschnaiter with a number of important monks and ministers attend a festival near a river, where they meet Ngawang Jigme to celebrate his promotion to the position of minister. At a Christmas party, Harrer returns Aufschnaiter's old watch. Harrer had come across it by chance at a shop and retrieved it as a gift to Aufschnaiter, along with a note thanking him for his friendship. Soon afterwards, a Tibetan turns on the radio and a Chinese announcer proclaims that they plan to invade Tibet. The party breaks up, and an evil omen at night casts a shadow on what is to come. At a meeting with the cabinet, the regent states that Tibet recognizes no foreign sovereign and banishes all Chinese officials from Tibet, including those at the Chinese embassy. As the crisis grows, the Dalai Lama has a terrible nightmare of Chinese atrocities near the Tibetan border in Taktser, his birthplace, with monasteries being burnt down and monks being forced to kill each other. He seeks comfort with Heinrich Harrer, who tells him it was a dream, only to find soon after that the Chinese have indeed crossed the Tibetan frontier, burnt Taktser, and are advancing. Three Chinese generals fly to Lhasa to speak with the Dalai Lama, and against Harrer's request Ngawang Jigme raises the Chinese flag, saying that Tibet should embrace the enemy if it cannot defend itself. Monks have spent many days creating a sand mandala to welcome the generals, who show their disrespect by wiping their feet on it. Despite the Dalai Lama's speech to them that Tibet is a peace-loving nation, the head of the Chinese delegation dismisses religion as \"poison\", and war soon breaks out on the Tibetan frontier at Chamdo. Ngawang Jigme is sent to Chamdo with a small Tibetan army to defend against the Chinese attack, but many Tibetans are killed. Jigme makes the decision to surrender after just 11 days and then blows up the Tibetan ammunitions dump, destroying any hope of a counter-attack. During a treaty signing in Lhasa, Kungo Tsarong tells Harrer that if Jigme had not destroyed the weapons supply, Tibetan guerillas could have held the mountain passes, buying time to appeal to other nations for help. As the Chinese take control of Tibet and the Chinese flag flies at Lhasa, Harrer visits Ngawang Jigme to condemn him for his surrender, and insults him by returning the jacket he received as a gift. Despite the Chinese invasion, the Dalai Lama, now fifteen years old, is formally enthroned as the spiritual and temporal leader of Tibet. Harrer pays a final visit to the Lama on top of the Potala and prays with him. As he leaves the palace, he is given a gift of the music box which was shown to be so dear to the Dalai Lama at the beginning of the film. Harrer bids farewell to Aufschnaiter and Pema and returns to Austria in 1951 to visit his son Rolf, now a young boy. Although his son initially refuses to see him, Harrer leaves the musical box as a gift for him and watches him lovingly from the crack in the door. In the film finale, Harrer gradually comes to know the son he has thought about all the years while he was in Tibet and trains him like himself in the art of climbing mountains. Having reached the top of a mountain, Harrer is shown with a Tibetan flag planted beside him at the peak.",
      "writers": [
         "Heinrich Harrer",
         "Becky Johnston"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120102/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMTcyMTI2NF5BMl5BanBnXkFtZTYwNDUxMTI5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Brad Pitt, David Thewlis, BD Wong | See full cast and crew »"],
      "reviews": [
         "First of all, Seven Years In Tibet is a very aesthetically pleasing film. The snowy Himalayas, the Tibetan villages, and the amazing costumes and religious ceremonies are all filmed beautifully, with rich colours and lighting. The music by John Williams is also excellent, and it's fascinating to hear how it blends with the unusual Tibetan music. It's not all surface though, there's depth here too. Don't believe the negative comments about Brad Pitt's acting. Admittedly his accent slips a bit in places, but he does a great job as Heinrich, both the unpleasant, arrogant character at the beginning, and the more gentle and wise man that he becomes as the film progresses. His relationship with the young Dalai Lama (a very impressive actor) is an unusual one and refreshingly unsentimental. The film is well edited; scenes are not drawn out any longer than they need to be. As a whole, it is fast paced but also peaceful, tender and moving. You don't get bored but you're not bombarded with pointless action scenes either. It's a pleasant surprise to see a Hollywood film where women and other cultures aren't treated as objects, and are allowed to be full, complex characters. It could be argued that this film has a Western perspective, but after all, it is adapted from a book written by a European living in Tibet, and intended for Western audiences. It treats the Tibetan culture with a great deal of respect, so I don't really see a problem with that. Similarly, those who have complained that it doesn't tell you enough about the Dalai Lama and too much about Heinrich, ultimately it is Heinrich's story, and that is its strength: that it is one man's tale, and not a political polemic. It gives you a great sense of how people's stories intersect and how the whole world is connected. Overall, an unusual film, very involving and emotional without sentimentality, with wonderful music and outstanding cinematography. Highly recommended.",
         "Seven Years in Tibet is to the true story what the Sound of Music is to Maria Von Trapp's autobiography. Maria writes in the second volume of her autobiography that she wanted to sue the film makers, and I wonder whether Heinrich feels the same. I thought it was an excellent film that did a great job of conveying accurately what Lhasa looks like, having earlier seen a book of photographs from British expeditions around 1910. And I am glad it generated some sympathy for the plight of the Tibetans. But having since read Heinrich's autobiography, it appears that virtually every event in the movie was made up, including the business with the watch. I don't understand why, because the true story was fascinating, with lots of drama. What is wrong with the minds and egos of people in Hollywood? If they want to completely distort the original facts, don't call it non-fiction.",
         "I saw this film for the first time last night after hearing a great many people recommend it to me. I don't know why I waited so long! This is a soul stirring movie that is perfect in its simplicity. I don't think it's the best performance Brad Pitt has ever offered, but he was quite good. David Thewlis (an amazing actor who never receives as much praise he deserves) gave a perfect performance. But the real beauty of the film is the Tibetan people and their lifestyle. The cinematography was breathtaking and perfectly matched the mood of the film. I loved this movie so much that I'm going to buy it immediately. I love uplifting epic types of movies and this is truly one of the better ones I've seen in a while. In fact, it's one the better movies I've seen in a while.",
         "This masterpiece, still makes me curious every time I see it. Brad Pitt does an amazing job portraying an Austrian, even down to his accent. The cinematography is extraordinary, and the direction is quite good. I love watching it every so often, and learning new things that I missed the times before. The film has a great amount of interesting facts, and takes place in the 1930's through '50's. There are times when it is; magical, spiritual, enlightening, sweet, sad and poignant. I recommend it to anyone who enjoys interesting and true stories. If nothing else watch Pitt with his masterful portrayal of this real life character, who faces hardships, physically, spiritually and emotionally.",
         "This movie has some of the best cinematography I have ever seen. The movie does a great job of showing the Potala Palace and Jokhang Temple in Lhasa as well as the rural villages of Tibet. Not to mention the breath taking views of the Himalayas. Yes, Brad Pitt's accent wasn't exactly his best but it's forgivable when watching the movie. His acting was superb, portraying Heinrich's transition, which is what the movie is all about. The movie did lack qualities of the book, the ending was totally wrong and somewhat disappointing. And the whole Nazi part in Austria was completely unnecessary. Besides a few minor details, the movie is well worth the 2 1/2 hours especially if you are interested in the Chinese seizure of Tibet and the Tibetan culture and people. (Free Tibet!)",
         "\"Seven Years in Tibet\" was a pleasant surprise. Sporting an Austrian accent that got slammed by some critics, I thought Brad Pitt was pretty good as an arrogant Nazi who finds himself captured by the British during a failed expedition to the Himalayas and is later stranded in Tibet after escaping from a POW camp. He finds his humanity in the forbidden-to-foreigners city of Lhasa, especially after meeting the 14 year old Dalai Lama. Echoes of \"Lost Horizon,\" \"The King and I\" \"Last Emperor\" and others abound, but the movie is \"old Hollywood\" in the best sense with magnificent scenery (widescreen advised: the mountains and countryside of Argentina and Canada stand in for Tibet). The heart of the movie is the relationship between the blond Aryan golden boy and the young \"Kundun,\" with a performance by the young Tibetan actor playing the latter that is so charming he nearly steals the whole film. An engrossing blend of fact and fiction, the picture manages to avoid condescending to the Tibetans and over-reverent preachiness. Wrapped in an excellent production, this epic story makes entertaining viewing. One question: how did the young Dalai Lama come by his love of movies in that remote location?",
         "This is a panoramic film exploring the wilderness of Tibet through the consciousness of an arrogant Austrian climber (Brat Pitt). As Pitt challenges Nanga Parbet, the ninth highest mountain in the world and one of the hardest to climb, the political chaos of late 1930's and 1940's, and his own demons, the nature of mankind is revealed as layers of civilization are peeled to reveal an inner self paradoxically more powerful and yet more vulnerable to the ebb and flow of inhumanity. His own philosophical journey is a reflection of political machinations of the time, the ontogeny recapitulating phylogenetic change of western civilization resulting in a complex modern world forever coiled for violence and warfare. This film has a European pace unsuitable for those addicted to action figure movies with huge budgets and high body counts. I recommend it as a \"good view\" similar to a good read.",
         "Tibet has certainly fascinated people all over the world. The hidden land in the most forbidding place on the planet not at either pole. In its day Lost Horrizon made quite a bit of money for its author James Hilton. But the real story of Heinrich Harrer is better than anything a fictional author could have thought up. Brad Pitt is Harrer in Seven Years In Tibet and this has become my favorite film of his. Heinrich Harrer, a world famous mountain climber and Austrian national hero goes on an expedition in 1939 to conquer an unclimbed peak in the Himalayas. While he's doing his mountain climbing Germany of which Austria is now part of marches into Poland and World War II begins. Harrer and his party are interred as enemy aliens. In 1942 Harrer escaped and he and a friend played by David Thewlis make their way into Tibet. The rest of the film is the seven years he spent there, centered around the unique friendship he formed with the child ruler of Tibet, the Dalai Lama. This in fact is the same Dalai Lama who today is possibly the world's greatest and non-aligned apostle of the gospel of peace. Brad Pitt is never better in the film than he is with the three child actors who play the Dalai Lama at various stages of his life. The physical hardship that he and Thewlis endure just getting into Tibet is adventure enough. But the spiritual journey he undergoes in his time there makes this one of the most unique adventure stories of the last century. One thing I liked about Seven Years in Tibet is that no effort was made to cover up Harrer's Nazi background. In an alternate universe one can speculate on what might have happened to him had he actually had to serve in the army in World War II. His internment saved him from possibly being involved any number of atrocities. God, fate, some kind of higher power saved him for something wonderful. The cinematography is breathtaking, this film had an incredible number of locations. Note that it was shot in British Columbia, in Argentina with the Andes serving as the Himalayas, Austria and even some establishing footage was shot in Tibet itself on the sly. Tibet's status is unique unto the world. It has been part of China since the Ming dynasty. It's referred to properly as the autonomous region of Tibet. China has given it autonomy in varying degrees over the past several centuries, it's never been truly independent. The Communist regime back in the days of Mao Tse-tung brutally asserted it's sovereignty a few times, most notably in late fifties when the Dalai Lama was forced to flee Tibet and live in Northern India where he resides to this day. That is when he's not traveling the world as it's foremost advocate of non-violence. It is sad that this film did not get more box office than it did. Brad Pitt, David Thewlis, director Jean Jacques Arnaud are all persona non grata in the People's Republic of China for making this film. Quite a market indeed to be shut out of for a stand for humanity. It's to be hoped that one day the Tibetans will be free. Until then they have their unique brand of Buddhism to sustain them and this wonderful film to tell their story.",
         "While it take some time to get moving, this is a truly captivating film. It's about redemption and pain. It's about true events which cast the Tibetan culture against the Chinese's land grab. We have the Buddhists on the one hand, and the godless hordes on the other. The die is cast and all we can do is watch. This is a movie about a selfish character and his comrade who find respite in the Himalaya's in the temple of the Dalai Lama. The gentleness and trust of the people is betrayed by one of them but it really wouldn't have mattered. There is a nice relationship developed between the young Lama and Brad Pitt's selfish, pig headed Westerner. Apparently there are elements of truth to this story. One feels so helpless in a world like this with so little one can do. It finally gets to what the Buddhists preach. Absolute dedication to their beliefs down to the last person.",
         "The main problem with this film, and indeed with many films set in the outdoors, is that it's too long. Maybe it's because I'm a product of the city and the suburbs, but to me, most movies set in the outdoors that don't use the scenery to advance the plot or set the mood, but rather just want to gaze at it, bore me quickly. It's like, \"Yes, it's beautiful, let's move on.\" Also, though I like Brad Pitt, he doesn't always do the job with his Austrian accent; even when he gets it down, you're always thinking, \"That's Brad Pitt doing an Austrian accent,\" rather than, \"That's Heinrich Harrer.\" And that whole subplot about Harrer missing the son he's never seen doesn't work. Still, there is much to like in this film. In many of these \"white men in strange country\" movies, the emphasis is on what the white man teaches the people in the other country, and that's somewhat condescending; here, it's on what the people in the other country teach Harrer, yet his story isn't made more important than the story of the Tibet people. Also, though his accent doesn't convince, Pitt is convincing as Harrer in the physical sense; he looks like a former skier and like the blond, blue-eyed ideal of the Nazis. And finally, he's convincing in taking us through Harrer's transformation. Two more things; one, someone in their comments wondered how the Dalai Lama knew so much about Western culture. According to the book, Harrer found the Dalai Lama to be quite curious about the world around him, so he studied what he could. Also, the film meets head-on the controversy about Harrer being a former Nazi; it doesn't soft-pedal his past at all, which makes his transformation that much more convincing."
      ],
      "genres": [
         "Adventure",
         "Biography",
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": [
         "Mandalay Entertainment",
         "Reperage & Vanguard Films",
         "Applecross"
      ],
      "summaries": [
         "After the death of 11 climbers, Austrian Heinrich Harrer (Brad Pitt) decides to add glory to his country and to the German pride by climbing Nanga Parbat in British India, and leaves his expectant wife behind. Egoist and a loner, he does not get along with others on his team - but must bend to their wishes after bad weather threatens them. Then WWII breaks out, they are arrested and lodged in Dehra Dun's P.O.W. Camp. He attempts to break out in vain several times, but finally does succeed along with Peter Aufschnaiter (David Thewlis), and end up in the holy city of Lhasa - a place banned to foreigners. They are provided food and shelter, and Peter ends up marrying a tailor, Pema Lhaki, while Heinrich befriends the Dalai Lama. He meets regularly to satiate the child's curiosity about the world, including Jack the Ripper and 'yellow hair'; in return he is exposed to teachings of Lord Buddha and even constructs a movie theater, while getting news of the end of the war; his divorce; and his son's refusal to communicate. But nothing will prepare him for the devastation about to descend when Communist China decides to attack, leading to the deaths of over 1 million Tibetans, destruction of over 6000 monasteries, and betrayal from their very own people.",
         "Heinrich Harrer runs from trouble at home in WWII Austria to climb Mt. Nanga Parbat. After meeting unforseen obstacles, he comes into contact with the forbidden city of Lhasa.",
         "Heinrich Harrer journeys to the Himalayas to climb mountains, leaving his wife behind in Austria. War breaks out while he's gone and he is placed in a prisoner-of-war camp. Harrer escapes to Tibet where he befriends the childhood Dalai Lama and witnesses the Tibetan/Chinese confrontation escalate.",
         "Heinrich Harrer is an Austrian mountaineer who is forced to be a hero for the Nazi propaganda. He leaves Austria in 1939 to climb a mountain in the Himalayas. Through a series of circumstances (including POW camp), he and fellow climber Peter Aufschnaiter become the only two foreigners in the Tibetan Holy City of Lhasa. There, Heinrich's life changes forever as he becomes a close confidant to the Dalai Lama.",
         "True story of Heinrich Harrer, an Austrian mountain climber who became friends with the Dalai Lama at the time of China's takeover of Tibet."
      ],
      "budget": 70000000
   },
   "movielensId": 1619,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-12",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Jean-Jacques Annaud"],
      "runtime": 136,
      "movieId": 1619,
      "title": "Seven Years in Tibet",
      "mpaa": "PG-13",
      "actors": [
         "Brad Pitt",
         "Jamyang Jamtsho Wangchuk",
         "David Thewlis",
         "BD Wong",
         "Mako",
         "Ingeborga Dapkunaite",
         "Lhakpa Tsamchoe",
         "Duncan Fraser",
         "Danny Denzongpa",
         "Victor Wong"
      ],
      "imdbMovieId": "0120102",
      "originalTitle": "Seven Years in Tibet",
      "genres": [
         "Adventure",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["TWkrRTPtKss"],
      "plotSummary": "Austrian mountaineer, Heinrich Harrer journeys to the Himalayas without his family to head an expedition in 1939. But when World War II breaks out, the arrogant Harrer falls into Allied forces' hands as a prisoner of war. He escapes with a fellow detainee and makes his way to Llaso, Tibet, where he meets the 14-year-old Dalai Lama, whose friendship ultimately transforms his outlook on life.",
      "tmdbMovieId": 978,
      "avgRating": 3.43704,
      "releaseYear": "1997",
      "numRatings": 5924,
      "posterPath": "/cflSeFUVDCf73Tzh5sB204JbQ6j.jpg"
   }
}