{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tragedy",
            "id": 10614
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0120323",
      "video": false,
      "title": "A Thousand Acres",
      "recommendations": [
         108887,
         30239,
         37658,
         48259,
         48958,
         32059
      ],
      "backdrop_path": "/sJvsOhUVSVZCMInTO9lTcXJcS2l.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rose Cook Lewis",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd639",
               "name": "Michelle Pfeiffer",
               "profile_path": "/vyoJV5QYwIGZohrPpKFdKc7EpSP.jpg",
               "id": 1160,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ginny Cook Smith",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd63d",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Larry Cook",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd641",
               "name": "Jason Robards",
               "profile_path": "/d5t554TsCjMvI9zwe7M5gNLvZeX.jpg",
               "id": 4765,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Caroline Cook",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd645",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jess Clark",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd649",
               "name": "Colin Firth",
               "profile_path": "/lKUq407IhFF6CQoJbUgbEyfS9JA.jpg",
               "id": 5472,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ty Smith",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd64d",
               "name": "Keith Carradine",
               "profile_path": "/b2GbGSrgb6twTdjfvUK4y0WrIjx.jpg",
               "id": 30613,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Pammy",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd651",
               "name": "Michelle Williams",
               "profile_path": "/xaRSSWD3jD1KpyjWgzzDP5lO5DS.jpg",
               "id": 1812,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd655",
               "name": "Elisabeth Moss",
               "profile_path": "/iSp2t9GYUUgyqTpz25J6hOHH2An.jpg",
               "id": 32798,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Peter Lewis",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd66b",
               "name": "Kevin Anderson",
               "profile_path": "/roCItER7LbrJJvAV1Fku3jG9g8k.jpg",
               "id": 51805,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Harold Clark",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd66f",
               "name": "Pat Hingle",
               "profile_path": "/bW8alHCKEK0UOJjoZwjwwH7T0ga.jpg",
               "id": 3798,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Ken LaSalle",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd673",
               "name": "John Carroll Lynch",
               "profile_path": "/5eEGOANKnCCj7FLa3oV28gGYWkW.jpg",
               "id": 3911,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Mary Livingstone",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd677",
               "name": "Anne Pitoniak",
               "profile_path": "/zcQf85EI3UyqDc9SKqrVCSKIOx5.jpg",
               "id": 38691,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Charles Carter",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd67b",
               "name": "Vyto Ruginis",
               "profile_path": "/dDZyaISuF9FVK18nTmsuDgOpyKl.jpg",
               "id": 61216,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Marv Carson",
               "gender": 0,
               "credit_id": "52fe4742c3a368484e0bd683",
               "name": "Ray Toler",
               "profile_path": null,
               "id": 1178247,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd687",
               "name": "Kenneth Tigar",
               "profile_path": "/sSdACkgPQYBJVQnd8B6uWpQPjMY.jpg",
               "id": 87128,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Loren Clark",
               "gender": 0,
               "credit_id": "52fe4742c3a368484e0bd68b",
               "name": "Steve Key",
               "profile_path": null,
               "id": 1178248,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Henry Dodge",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd68f",
               "name": "Dan Conway",
               "profile_path": null,
               "id": 940929,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd693",
               "name": "Stan Cahill",
               "profile_path": null,
               "id": 161904,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Wallace Crockett",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd697",
               "name": "Ray Baker",
               "profile_path": "/cDmi2buNK0WR5OdqAJDk6OcvC2N.jpg",
               "id": 12889,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Roberta",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd69b",
               "name": "Beth Grant",
               "profile_path": "/zAT9GvzJE0ytL3C36L461cgKI9p.jpg",
               "id": 5151,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd69f",
               "name": "Andrea Nittoli",
               "profile_path": null,
               "id": 1178249,
               "order": 21
            },
            {
               "cast_id": 26,
               "character": "Judge (uncredited)",
               "gender": 2,
               "credit_id": "52fe4742c3a368484e0bd6a3",
               "name": "Bob Gunton",
               "profile_path": "/b3NfI0IzPYI40eIEtO9O0XQiR8j.jpg",
               "id": 4029,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd65b",
               "name": "Jocelyn Moorhouse",
               "profile_path": "/3TrT5NkGglobl3EPH5OdHlXLGzU.jpg",
               "id": 3047,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4742c3a368484e0bd661",
               "name": "Jane Smiley",
               "profile_path": null,
               "id": 1178245,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4742c3a368484e0bd667",
               "name": "Laura Jones",
               "profile_path": null,
               "id": 65035,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.057649,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 66588,
      "vote_count": 17,
      "budget": 0,
      "overview": "A THOUSAND ACRES is a drama about an American family who meets with tragedy on their land. It is the story of a father, his daughters, and their husbands, and their passion to subdue the history of their land and its stories.",
      "similar": [
         8272,
         45153,
         8967,
         587,
         773,
         858,
         73,
         112160,
         141,
         634,
         244772,
         242224,
         277216,
         24684,
         258480,
         10683,
         1643,
         84355,
         11421,
         43923
      ],
      "original_title": "A Thousand Acres",
      "runtime": 105,
      "poster_path": "/p7tsW4oUi7hHbpNtFZdMQEBj42g.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Propaganda Films",
            "id": 278,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Beacon Communications",
            "id": 919,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Via Rosa Productions",
            "id": 10103,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Prairie Films",
            "id": 14745,
            "origin_country": ""
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-17",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Best friends. Bitter rivals. Sisters.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jocelyn Moorhouse"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Jane Smiley",
         "Laura Jones"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120323/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NjA2OTAzMV5BMl5BanBnXkFtZTcwMTU1MjYxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Michelle Pfeiffer, Jessica Lange, Jennifer Jason Leigh | See full cast and crew »"],
      "reviews": [
         "A Thousand Acres (1997:***) This sober drama lasted about a week in theaters and was dismissed as dreary soap opera by most critics. There are echoes of \"King Lear\" in the story of a wealthy farmer who decides to divide his estate among his three daughters. But I thought the reviews overestimated the extent to which the story uses the Lear parallels. It's just a catalyst for a strong drama of family conflicts and repressed memories coming to the fore that soon goes its own way. There are some script problems: the youngest daughter's loyalty to her cruel father seems quite inexplicable, and as a lawyer you would think she'd know better than to put a hopelessly senile person on the witness stand. The fine cast does pretty well, especially Jessica Lange and Michelle Pfeiffer, although as usual Jennifer Jason Leigh is barely adequate as the youngest sister. Maybe watching this on a stormy Sunday night helped put me in the mood, but I rather enjoyed this one.",
         "When I found out that Jessica Lange, Michelle Pfeiffer, Jennifer Jason Leigh, and Jason Robards were teaming for a film based on a Pulitzer-Prize winning novel, I went out and read the book immediately. \"A Thousand Acres\" was one of the best reading experiences of my life, and while the film couldn't capture the book in its entirety (no film could, unless it were six hours long), I really enjoyed it. Michelle Pfeiffer should have received another Oscar nomination for her fearless portrayal of Rose Cook Lewis, the character modeled after Shakespeare's evil Regan from \"King Lear.\" While all of the performances are solid, they seem somehow timid next to Pfeiffer, who once again proves that she is most definitely not just another pretty face.",
         "I didn't actually have high hopes for this film because I had read some critics reviews when it first came out. I have not read the novel either. I thought the film was very well done and was moved by it. I agree that many of the supporting characters are underdeveloped but I could overlook that because I knew what was motivating the main characters. The two lead actresses are brilliant, especially Jessica Lange, who deserved an Oscar nomination for this. I loved the way her character slowly changed through the movie and Lange can evoke so much emotion in the viewer with something as small as a hand gesture. Pfieffer is strong as well although the story mainly revolves around Ginny and I don't really see why Pfieffer gets first billing here. I strongly recommend the film, espeically on dvd.",
         "Having watched this film years ago, it never faded from my memory. I always thought this was the finest performance by Michelle Pfeiffer that I've seen. But, I am astounded by the number of negative reviews that this film has received. After seeing it once more today, I still think it is powerful, moving and couldn't care less if it is \"based loosely on King Lear\". I now realize that this is the greatest performance by Jessica Lange that I've ever seen - and she has had accolades for much shallower efforts. A Thousand Acres is complex, human, vibrant and immensely moving, but surely doesn't present either of the primary female leads with any touch of glamour or \"sexiness\". I don't think this is well received in these times. Perhaps one reason for this film's underwhelming response lies in the fact that the writer (Jane Smiley(, screenplay (Laura Jones), and director (Jocelhyn Moorehouse) are all women. I know that, in my younger days, I wouldn't have read a book written by a woman. I didn't focus on this fact until years later. If you haven't seen this movie or gave it a chance in the past, try watching it anew. Maybe you are ready for it.",
         "SPOILERS... I had just finished this excellent book and was excited about seeing the film. In particular I was looking for resonant scenes like Larry's kitchen cabinets left out in the rain, the building chemistry between Ginny and Jess, the mounting sense of loss felt by Ginny when each of her family members betrays her, particularly the last wounding blow from Rose. The film rushes from scene to scene, never giving any moment time to resonate with emotion. The result is the feeling that you don't get to know or care about any of the characters. In the book I felt sorrow and shock when Pete died, in spite of his many flaws. In the film he is about as two-dimensional as you can get. Jessica Lange has chops as an actress and could have made Ginny into the sympathetic character she is in the book. Unfortunately, the screenplay and direction didn't allow for it. The film feels mechanical, almost like you can picture the director checking off each scene in her to-do list. Make the breast cancer known, check. Show attraction between Ginny and Jess by having him touch her neck, check. Show Larry deciding to give up the farm, check. I agree with those who said it felt like a Lifetime special. I'm disappointed because the actors are top-notch, especially the freakishly gorgeous Michelle Pfeifer and the criminally under-rated Jennifer Jason Leigh. The land was just as much a character in the book as any of the people, and I wonder what the director could have been thinking by not showing this more. In the end you feel like the sexual abuse and the death of a sister are manipulative plot devices to jerk out the tears. I blame the direction and the screenplay adaptation. Terrence Mallick could have done justice to this great book. I wonder what Jane Smiley thought.",
         "I was very moved by the gentle power of this movie and by the mood it created. I think it should have gotten a great deal more credit than it did. I agree that Michelle Pfeiffer should have been nominated, but I think all the performances were outstanding, and that Michelle Pfeiffer and Jessica Lange portrayed the deep affinity and conflicts of sisters with great emotional depth and sensitivity. Although I didn't read the book, I found the modern concept of King Lear very cool. I certainly will never look at the play quite the same way again!",
         "I was really looking forward for this picture since i heard that Michelle Pfeiffer and Jessica Lange would star together. But when i eventually went to see it i must say i was a bit disappointed. I don't say that the movie was bad ,but the fact that i expected much more from it , make me regard it an average movie. The direction was very poor and the editing unacceptable. The adaption seemed to lack in many ways and Jennifer Jason Leigh was unbearable. But seeing Pfeiffer ang Lange together on screen made me forget everything. These two great actresses proved for once more their talent. When you see them together on screen you forget all the disadvantages the movie has and there's nowhere else you want to be. They both deserved Oscar nominations and Lange probably the award too. Jason Robards though not as good as in some of his previous roles was great too.",
         "......... ........... ............ ............ ............. from Pasto,Colombia...Via: L.A. CA...and ORLANDO, FL Despite having seen A Thousand Acres in a theater 16 years ago, for some reason, I blocked it out and had little recollection of it. Funny how we humans often block things out. In fact, I'd like to call ACRES a \"Human Flick\"...(As opposed to...you know what!) Nothing compares to a movie that consistently refuses to follow your expectations. At least for me, from beginning to end, despite having seen it before, I just couldn't get it right! KUDOS to ACRES. Produced by, Based on a novel written by, Screeplay by, Directed by and Starring WOMEN! YES...They do it ALL!...A job exquisitely well-done, I might add! From the onset, it's obvious that patriarch Larry Cook (Jason Robards, Jr., in one of his last really meaty, showcase roles) together with his three daughters; played masterfully by Jessica Lange, Michelle Pfeiffer and Jennifer Jason Leigh (Stunning ensemble performance); form an utterly dysfunctional family. Apparently, the premature death of Larry's wife, the girls' mother, when they were all children, served as the defining event in all their lives, derailing each member and hurtling them into disparate realities; The operative word here being, \"Apparently\". Robards is inspired as the old-school, iron-fisted farmer, who, because of his age, is beginning to show a few cracks, starting to lose his grip. Probably sensing this, the old-man pulls the rug out from everyone when he announces at a family dinner that he has decided to screw the government out of inheritance taxes on his choice Thousand Acres by forming a corporation where each daughter is an equal partner. All his daughters are stunned, but the two eldest go along with the idea. Caroline, the youngest, who happens to be a lawyer, exercising professional caution, says she'd like to think it over a bit. The old man is beside himself, causing him to set off a chain of events. There is a very deftly handled undercurrent that adds a potent dose of tension to the film throughout. Phenomenal ending, however, judging from the IMDb 5.9 Rating, it seems a lot of viewers don't agree! 9*....ENJOY/DISFRUTELA! Any comments, questions or observations, in English or Español, are most welcome! KissEnglishPasto@Yahoo.com",
         "The story is derived from \"King Lear\"; the setting is a farm in Iowa. Here's a test for this kind of thing: if you find yourself asking, \"Why did so-and-so do such-and-such,\" and the answer is, \"because that's what happened in 'King Lear',\" you know that the film has failed. Well, that IS what happens here. The father figure in this story isn't living his own life, he's mimicking a fictional one. But there's more wrong with the film than this. Jocelyn Moorhouse is ambitious - far more ambitious than I think she realises. She's trying to take the King Lear story and completely change the setting. This is a task in itself. The likeliest result is that the transplanted story will die, and nobody will quite be able to work out why (although there are enough successful transplants, like \"West Side Story\", to make it worth trying). But she's ALSO attempting a revisionist retelling. In the version of \"King Lear\" she wishes to create, Reagan and Goneril command our sympathy, and Cordelia is a villain. This is a task in itself, too. Succeeding at either task is hard; succeeding at both at once is impossible. In fact, succeeding at one while so much as attempting the other, is impossible. If we are to look on the very same events from a different moral perspective then the events must BE the very same events - which means there can be no tampering with setting. If the story is to be transplanted, alive, into a different setting, its moral heart must keep beating the whole while - which means there can be no tampering with ethical perspective. Moorhouse was bound to fail in not just one but in both of her endeavours. And so she did. ...Naturally, it's possible to attempt both tasks, fail at both tasks, yet by some fluke hit upon a work of art that's good for independent reasons. I mention this because I haven't read Jane Smiley's novel, which, for all I know, IS good for independent reasons. But the film isn't. If there was nothing else wrong with it, there would still be no getting around the fact that it's just so thoroughly, excruciatingly DULL. The very fields of corn are even more boring than they would be in real life - which needn't be the case, since off the top of my head I can think of four films (\"The Wizard of Oz\", \"North by Northwest\", \"The Straight Story\", \"Kikujiro\") in which the cornfields aren't boring at all.",
         "'A Thousand Acres' is one of the best books I've ever read and one of the worst movies I've ever seen, so obviously something was lost in the adaptation. On-set reports claimed that the director was trying to change the story radically while stars Lange and Pfeiffer attempted to keep it closer to the book. The director seems to have won out. It's really a shame, because you couldn't ask for a better cast to bring 'Acres' to life. Jason Robards is dead-on as Larry, the psychologically damaged patriarch, and Lange, Pfeiffer, and Leigh have great chemistry as the three sisters. But good actors need good lines, and the screenplay doesn't give them any. The approach taken by the writer and director toward adapting Jane Smiley's brilliant, Pulitzer-prize winning novel seems to have been to simply stick all the dramatic, important scenes together and leave out the nuances and character development that made the story so special. In fairness, 'Acres' couldn't have been easy to adapt; it has more than enough scope to make a movie trilogy or an entire series of television. Perhaps it was a mistake, then, to try to keep the beginning, middle and end essentially the same as the book. This approach shows us all the effects and none of the causes. Especially confusing is the scant 105 minute running time, which is only slightly longer than your average Adam Sandler movie. If the director and studio had been willing to make this a 3-hour film, it might have had a chance. As it stands, the movie plays like a highlight reel of the book, and that's not enough to involve the viewer emotionally. 'A Thousand Acres' is a fantastic story, though the movie would try hard to convince you otherwise. Pick up the book and see for yourself."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Touchstone Pictures",
         "Propaganda Films",
         "Beacon Communications"
      ],
      "summaries": [
         "A THOUSAND ACRES is a drama about an American family who meets with tragedy on their land. It is the story of a father, his daughters, and their husbands, and their passion to subdue the history of their land and its stories.",
         "\"King Lear\" set on a farm in Iowa."
      ],
      "budget": 0
   },
   "movielensId": 1624,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-17",
      "dvdReleaseDate": "1998-04-22",
      "directors": ["Jocelyn Moorhouse"],
      "runtime": 105,
      "movieId": 1624,
      "title": "A Thousand Acres",
      "mpaa": "R",
      "actors": [
         "Michelle Pfeiffer",
         "Jessica Lange",
         "Jason Robards",
         "Jennifer Jason Leigh",
         "Colin Firth",
         "Keith Carradine",
         "Michelle Williams",
         "Elisabeth Moss",
         "Kevin Anderson",
         "Pat Hingle",
         "John Carroll Lynch",
         "Anne Pitoniak",
         "Vyto Ruginis",
         "Ray Toler",
         "Kenneth Tigar",
         "Steve Key",
         "Dan Conway",
         "Stan Cahill",
         "Ray Baker",
         "Beth Grant",
         "Andrea Nittoli",
         "Bob Gunton"
      ],
      "imdbMovieId": "0120323",
      "originalTitle": "A Thousand Acres",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["eGH5iZZxFBg"],
      "plotSummary": "A THOUSAND ACRES is a drama about an American family who meets with tragedy on their land. It is the story of a father, his daughters, and their husbands, and their passion to subdue the history of their land and its stories.",
      "tmdbMovieId": 66588,
      "avgRating": 3.02294,
      "releaseYear": "1997",
      "numRatings": 523,
      "posterPath": "/p7tsW4oUi7hHbpNtFZdMQEBj42g.jpg"
   }
}