{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119557",
      "video": false,
      "title": "The Locusts",
      "recommendations": [38554],
      "backdrop_path": null,
      "revenue": 10082,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Mrs. Potts",
               "gender": 1,
               "credit_id": "52fe48f8c3a368484e1140d7",
               "name": "Kate Capshaw",
               "profile_path": "/fR9ZNjuM67noFAXtZP4Ov5FzRPV.jpg",
               "id": 689,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Flyboy",
               "gender": 2,
               "credit_id": "52fe48f8c3a368484e1140db",
               "name": "Jeremy Davies",
               "profile_path": "/xPM0Wf4zVDpdNw3xokD2mDTqtoP.jpg",
               "id": 4654,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kitty",
               "gender": 1,
               "credit_id": "52fe48f8c3a368484e1140e3",
               "name": "Ashley Judd",
               "profile_path": "/3bgmRDt02iGFVjhqCqstVyEeiwG.jpg",
               "id": 15852,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Joel",
               "gender": 2,
               "credit_id": "52fe48f9c3a368484e1140eb",
               "name": "Daniel Meyer",
               "profile_path": null,
               "id": 538091,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Patsy",
               "gender": 1,
               "credit_id": "52fe48f9c3a368484e1140ef",
               "name": "Jessica Capshaw",
               "profile_path": "/pDTBPqckmOVgP7DseLG0cKNrmtU.jpg",
               "id": 2205,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Ellen",
               "gender": 0,
               "credit_id": "52fe48f9c3a368484e1140f3",
               "name": "Jessica Robertson",
               "profile_path": null,
               "id": 148587,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Cameron",
               "gender": 0,
               "credit_id": "52fe48f9c3a368484e1140f7",
               "name": "Jimmy Ray Pickens",
               "profile_path": null,
               "id": 375719,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Harlan",
               "gender": 2,
               "credit_id": "52fe48f9c3a368484e1140fb",
               "name": "Jerry Haynes",
               "profile_path": null,
               "id": 2850,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Wrangler",
               "gender": 2,
               "credit_id": "53de0008c3a3686c51000d8d",
               "name": "Jason Davis",
               "profile_path": "/9jZUhVKgVYpjxXehpd0A3gwYJgo.jpg",
               "id": 166818,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Earl",
               "gender": 2,
               "credit_id": "59e392f19251410b670001cf",
               "name": "Paul Rudd",
               "profile_path": "/8eTtJ7XVXY0BnEeUaSiTAraTIXd.jpg",
               "id": 22226,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Clay Hewitt",
               "gender": 2,
               "credit_id": "59e392f19251410b670001d1",
               "name": "Vince Vaughn",
               "profile_path": "/r6ISnWjO5fA9QA1BTWUGaqdPyxE.jpg",
               "id": 4937,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48f8c3a368484e1140cd",
               "name": "John Patrick Kelley",
               "profile_path": null,
               "id": 533977,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f8c3a368484e1140d3",
               "name": "John Patrick Kelley",
               "profile_path": null,
               "id": 533977,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.548569,
      "production_countries": [],
      "id": 75250,
      "vote_count": 4,
      "budget": 0,
      "overview": "A drifter enters a small town looking for employment. While working at the local cattle ranch, he meets and falls in love with the beautiful Kitty and becomes involved in a deadly yet erotic love triangle.",
      "similar": [],
      "original_title": "The Locusts",
      "runtime": 124,
      "poster_path": "/etm7ayq4g93kFOhoaVIRTlr0jTA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-10-03",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Patrick Kelley"],
      "runtime": 124,
      "synopsis": null,
      "writers": ["John Patrick Kelley"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119557/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjA4NjUyNzU4MV5BMl5BanBnXkFtZTcwNTUzNzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kate Capshaw, Jeremy Davies, Vince Vaughn | See full cast and crew »"],
      "reviews": [
         "Clay Hewitt(Vince Vaughn)is a drifter from Missouri stopping in 1960s Kansas in hope to earn some money. He only has seven bucks in his pocket. He meets some locals, including Joel(Daniel Meyer), Earl(Paul Rudd), Patsy(Jessica Capshaw) and Kitty(Ashley Judd). Earl suggests he look for employment at Delilah Ashford Potts'(Kate Capshaw) feed ranch. Delilah's reputation of sleeping with her hired hands is common place. She demeans her son 'Flyboy', who is traumatized from his father's death. Clay finally fits in with the other workers and of course is a sexual target of his boss lady. Before Clay talks Kitty into moving on to California; he discovers two big Potts family secrets. The strong sexuality earns THE LOCUSTS the R rating. I really like the diverse characters. The photography catches the moodiness of the story.",
         "I recently rented this movie not knowing a thing about the movie other than that Vince Vaughn was the leading actor. What a pleasant surprise!! Although the plot was sometimes far fetched and definitely perverse, Vince Vaughn's on screen magnetism was evident. The man spent most of the film in an undershirt and oozed sensuality. It is evident that he has the potential to be the screen's next Brad Pitt. The film held my interest for the entire 2 hours. I especially enjoyed the performances of Jermey Davies and Ashley Judd. Kate Capshaw's character was under-developed but her performance was on target.",
         "Normally when I hear or read the title of a movie, I have some idea of what it could be like. That's not always correct, but most of the time it works - especially with famous movies of course. But when I read the title of this movie, I really didn't know what it would be about. Of course I didn't think that it would be a movie about the insect, but I just couldn't form a good idea about it. That's why I just gave it a try, not knowing what to expect, but hoping for the best. And I'm glad that I did, because this certainly was a nice movie. \"The Locusts\" is situated in the 1950's and shows how the arrival of Clay Hewitt changes life drastically in a small town. He's looking for a job and is hired by the local feed ranch's owner, an aging widow who likes to drink and seduce younger men. He quickly becomes her new lover, but also has an eye for her quiet son Flyboy. The boy hasn't spoken a word in years and is completely withdrawn since the death of his father. The only one who he talks to since his recent return from a mental hospital is his pet bull. But Clay wants to give it a try and gradually he manages to get the boy out of his isolation, much against the will of the boy's mother... Even though this is perhaps not the most original story ever, I must say that I had a good time watching this movie. The acting has a lot to do with that of course. Vince Vaughn is very enjoyable as Clay Hewitt and Kate Capshaw did a very fine job portraying Delilah, but in my opinion it is Jeremy Davies as Flyboy, who was the best this time. But overall this is a movie that portrayed its characters well and didn't drown in an overdose of plot twists. This is John Patrick Kelley's first and so far only film, but it certainly makes me look forward to new projects from this man. I give this movie a rating between 7/10 and 7.5/10.",
         "I would much rather see a movie like this, that falters occasionally under the weight of a few cliches, than a thousand \"innovative\" films in love with their own novelties. This film seems made by young filmmakers who've done a hell of a job bringing a very American story to the screen with novelistic detail. Don't see that much anymore, and they almost pull it off here. Wish there was more Ashley Judd. Vaughn and Davies are great together. Vaughn's best role yet... hope there'll be more like it in the",
         "That this film has a running time OVER 2 hours, and has had little or no theatrical recognition, immediately activates my senses. This length will complicate scheduling on pay-cable, and meant pressing an additional disk for the laser package. Why?. One possibility (rare) is that it is truly an auteur's masterpiece, not for the masses, maybe, but important enough, as is, to be kept intact. The more likely scenario is that this movie is such a waste of time that everyone involved could really care less what gets released. By now they've all changed their names, left town, and moved onto the next.. Predictably, The Locusts falls into category 2. Vince Vaughan in a muscle shirt and Ashley Judd with her cotton dress flying in the wind are about all this film has on the plus side. Dragging and nagging situations, disconnected dialogue, and uncertain motivation tend to make most every frame tortuous to endure. First time-writer-directors (John Patrick Kelley here) tend to script a very personal project, one based on material with which they are intimately familiar-they draw on their strength. Subsequent efforts can wane, as the writer ventures into more unfamiliar territory. With this in mind, I leave you with 2 questions: (1) Where in the world did this story come from? And (2) What can we expect from John Patrick Kelly when he starts writing from an unfamiliar point of view ? The answers may scare you.",
         "It's easy to get carried away while watching this movie. This is first and foremost a portrayal of people wrestling with their destiny and past, and ultimately facing a fate that seems unavoidable. The cast, without exceptions, superbly adds life to these characters that grasped me and led me through an avalanche of feelings. Vaughn in one of his finest performances.",
         "An American movie without happy end. Kate Capshaw heads a cast of young actors. From the start she comes over disgusting. 2 hours later you'll love here. It is really a very dark family secret. Vince Vaughn, Jeremy Davies, Ashley Judd are some of the names in this well-done USA movie. Who gives this stares anyway? Movie made during the 1997s. TRY TO WATCH IT ! The rest of the cast is young and horny. It plays on a mid America cattle farm. A seasonal worker, who may or may not haved killed a girl in KC, Kansas City, Missourri, finds a job in the south. La Madame Capshaw says yes. She smokes a lot in the movie. and she has a most wonderful main house ans cattlle field. A lot of blood on t-shirts and skirts. It makes it more hot. WATCH THIS MOVIE ! In Europe they would possibly say that if Kate Capshaw wasn't married to Steven Spielberg, this movie would have been never made? But watch for yourself.",
         "I have always thought that Vince Vaughn was a decent actor but this film just proves I was wrong...he is fantastic! Ashley Judd, Kate Capshaw, and Jeremy Davies turn in performances that would earn them award nominations if the movie had any media backing whatsoever. Great film.",
         "A cliche-ridden movie with a lusty widow and a mysterious drifter. And oh yeah, they have secrets. And we know it takes place in the quasi-South since everyone drinks iced tea out of Mason jars. Despite the cliches and sloppy film-making, it's completely enjoyable. Cheesy, corny, fun, sexy and often touching thanks to lovely performances by Vince Vaughn and Jeremy Davies. And someone PLEASE remake Streetcar Named Desire quickly. Vince Vaughn is a star in the making, and he and Ashley Judd sizzle. Stanley and Stella, anyone?",
         "There are many films in this category, depressing reality genre. Good acting performances by lead actors. The film lacks good moral outcome, which I think should be present in films like this. The only contribution this film leaves is perhaps that You start taking up praying as the only way to cease these endings."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Motion Picture Corporation of America (MPCA)",
         "Orion Pictures",
         "Renegade Films"
      ],
      "summaries": [
         "The daily life in a tiny Kansas town is indelibly changed when enigmatic drifter Clay Hewitt enters the landscape. Within a few hours of Clay's arrival, he punches out the local drunk, steals his gorgeous lady love, Kitty, and is hired by the local feed ranch's owner, boozy aging widow Delilah. Known for her appetite for younger men, Delilah eagerly takes him in, letting him use the carriage house on her estate. She of course has more in mind for Clay than merely room and board. Her completely withdrawn and utterly dominated young son, Flyboy, hasn't spoken a word to anyone other than his pet bull since his recent return from a mental hospital following eight years of incarceration. Clay slowly yanks the boy out of his shell, which unleashes a series of (occasionally brutal) turns of events.",
         "A drifter enters a small town looking for employment. While working at the local cattle ranch, he meets and falls in love with the beautiful Kitty and becomes involved in a deadly yet erotic love triangle."
      ],
      "budget": 0
   },
   "movielensId": 1628,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-03",
      "dvdReleaseDate": "2002-03-19",
      "directors": ["John Patrick Kelley"],
      "runtime": 124,
      "movieId": 1628,
      "title": "The Locusts",
      "mpaa": "R",
      "actors": [
         "Kate Capshaw",
         "Jeremy Davies",
         "Ashley Judd",
         "Daniel Meyer",
         "Jessica Capshaw",
         "Jessica Robertson",
         "Jimmy Ray Pickens",
         "Jerry Haynes",
         "Jason Davis",
         "Paul Rudd",
         "Vince Vaughn"
      ],
      "imdbMovieId": "0119557",
      "originalTitle": "The Locusts",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A drifter enters a small town looking for employment. While working at the local cattle ranch, he meets and falls in love with the beautiful Kitty and becomes involved in a deadly yet erotic love triangle.",
      "tmdbMovieId": 75250,
      "avgRating": 2.5283,
      "releaseYear": "1997",
      "numRatings": 53,
      "posterPath": "/etm7ayq4g93kFOhoaVIRTlr0jTA.jpg"
   }
}