{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "irish-american",
            "id": 1857
         },
         {
            "name": "election campaign",
            "id": 6085
         },
         {
            "name": "make a match",
            "id": 6664
         }
      ],
      "imdb_id": "tt0119632",
      "video": false,
      "title": "The Matchmaker",
      "recommendations": [
         14167,
         55143,
         17439,
         116008,
         48345,
         49963,
         26195,
         19094,
         32519,
         45069,
         50035,
         20242,
         15673,
         33379,
         22792,
         240723,
         31776,
         27465,
         31342,
         15313
      ],
      "backdrop_path": "/thjlUi4Gx0ZmpsQVEQ7jK8WXjZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marcy Tizard",
               "gender": 1,
               "credit_id": "52fe43e7c3a368484e005045",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sean Kelly",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e005049",
               "name": "David O'Hara",
               "profile_path": "/zPWpTV19nPLawd1E9A1jUDdcT2H.jpg",
               "id": 2482,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e005055",
               "name": "Denis Leary",
               "profile_path": "/lnk4HjUeqDlT6Kg9PaQsVIDpl56.jpg",
               "id": 5724,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Dermot O'Brien",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e00504d",
               "name": "Milo O'Shea",
               "profile_path": "/axJwk4Mwj1ZBx09YE3Lu5qU0QkE.jpg",
               "id": 47137,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Senator John McGlory",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e005051",
               "name": "Jay O. Sanders",
               "profile_path": "/wgCFAatAtmfN5zWgwzGgA48wwXu.jpg",
               "id": 6067,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e00505b",
               "name": "Mark Joffe",
               "profile_path": null,
               "id": 59438,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43e7c3a368484e005061",
               "name": "Karen Janszen",
               "profile_path": null,
               "id": 56909,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.140002,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 20457,
      "vote_count": 21,
      "budget": 0,
      "overview": "Marcy, a worker in the reelection campaign of bumbling Senator John McGlory, is sent to Ireland on a quest to find the Irish ancestry of Sen. McGlory, to help him win the Irish vote. But when Marcy arrives in the small village of Ballinagra, she finds herself in the middle of a matchmaking festival, and the local matchmaker is determined to pair her off with one of the local bachelors.",
      "similar": [
         77953,
         9603,
         3131,
         45317,
         769,
         8390,
         586,
         379,
         11610,
         9429,
         16995,
         7985,
         51209,
         10139,
         9452,
         6641,
         11648,
         43522,
         9776,
         12254
      ],
      "original_title": "The Matchmaker",
      "runtime": 97,
      "poster_path": "/d4T1angi2Wc03txOZSRgc1Jm1PF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Good Film Company",
         "id": 5406,
         "origin_country": ""
      }],
      "release_date": "1997-10-03",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "A comedy for the incurably unromantic.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Joffe"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Greg Dinner",
         "Karen Janszen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119632/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MDE4MDQ1N15BMl5BanBnXkFtZTcwMDA4NDgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Janeane Garofalo, David O'Hara, Milo O'Shea | See full cast and crew »"],
      "reviews": [
         "Sorry to whomever thought this was \"a lame waste of a fine actress\" (the wonderful Janeane Garofalo) but for the record, Irishmen (and women, one presumes) actually *do* say \"bollocks\" with the frequency with which Americans say the \"S\" word, and there's merely ONE \"pee\" joke in the entire film. Sheesh. That said, this is an utterly charming film, involving a US Senator (Jay O. Sanders) from Boston with Kennedian aspirations ~ although he's trailing badly in the polls for re-election. So he and acerbic campaign manager Denis Leary send their jaded top aide (JG) to Ireland to find the Senator's geneology ~ his \"roots\" as it were ~ for campaign purposes. Unfortunately for her, the tiny town in which she's to do her research is just beginning its annual \"Matchmaking Festival,\" wherein this really takes hold of Erin-firma. City~gal JG, who's used to [and yearns for] faxes, cell-phones and email is suddenly the top candidate for the gentry. And her quest for the Senator's geneology proves slowly to fall below her expectations. But Milo O'Shea, as the town's premiere matchmaker, wagers with a matchmaking rival that he can get JG together with one of the town's seeming ne'er-do-wells (David O'Hara) and the latter is just as eager to ... ummm.. \"fax\" her as well. To say more would spoil the fun. And it *is* fun. And poignant. And sweet. And occasionally acid-witted. Only one solid \"rewind and watch it again\" belly laugh, but a lot of great plotting and a fun love story. Sure it's candy, but it's infinitely edible. You want lame? See a Jim Carrey movie. Any of them. Want to see talent wasted? Cameron Diaz screams to mind. Janeane Garofalo in *anything* is better than just about anyone in most films today. 4 Stars, say I.",
         "If this movie isn't the best thing Janeane Garofalo has ever done it must be close. The acerbic wit she was known for on \"The Larry Sanders Show\" is there, but so is everything else. She's a three-dimensional character. It's refreshing to see a love story without a sex scene, or even a gratuitous nude or near nude scene. Most filmmakers nowadays would throw something like that in just to tease audiences with it in the trailer. But \"Matchmaker\" is an honest movie, and Garofalo's Marcy is tough yet vulnerable and loveable. Some would say that \"Matchmaker\" exploits the Irish by way of stereotyping them. I had the opposite impression. It seemed that the people who made this movie loved the Irish. Usually I find myself agreeing with the aggregate score of each movie in the IMDb. But in this case I'm out of the mainstream. The aggregate score is 6.2, which normally indicates a barely watchable movie. But I gave Matchmaker a 10.",
         "I first watched this movie from the middle and I couldn't switch the channels after that. It was very different from the usual love stories. The interaction between the characters was great and Janeane Garofalo was brilliant. I watched it after a few weeks on video. Since then I've rented it quite a few times and I never get bored. Well worth your time. Funny and very sweet.",
         "This sunny comedy, directed with great verve by Mark Joffe, kept reminding me of the whimsical comedy \"Local Hero\" by Bill Forsyth. The film cashes in the folklore of Ireland as no other film, in recent memory does. \"The Matchmaker\" will charm, as well as disarm all those viewers looking for a nice time at the movies by immersing in its wonderful spell and taking the trip of discovery to Ireland. The story relies on all the color of the Emerald Island and its people. Where could there be a matchmaking festival, but if not in Ireland? The local characters live in a magical world. In a way, those people having lived in the area where the film takes place, are richer in traditions than we city folk are. It's a sobering experience for Marcy, the otherwise cynical girl that goes searching for her boss' roots in the old country and ends up being enchanted by what she finds there. It's an experience she will not forget easily. Jeanane Garofalo is wonderful as Marcy. This actress always projects an intelligent aura into everything she plays in films. Milo O'Shea is always amazing in anything he plays; he is no exception on this film. Mr. O'Shea is simply marvelous. David O'Hara, Paul Hickey, Maria Boyle Kennedy, Saffron Burrows and Denis Leary, among others, do excellent work under Mr. Joffe's direction.",
         "I never even heard of this film when it came out, but am glad I caught it on cable. The Matchmaker is a romantic comedy, but one with a very original and charming premise, setting and characters. I love the fact that the two leads, Janeane Garafalo and David O'Hara, have enormous chemistry and appeal, while not looking like standard Hollywood movie stars. I'd love to see O'Hara in another lead role - he has a very offbeat sex appeal. There are some very amusing scenes, and the bit of the American senator meeting his supposed long lost Irish relatives is hilarious. O'Hara's \"We've got to talk\" scene is great - for that one alone, I'll go buy the video! If you enjoy Ireland and romantic comedies that are slightly different, then by all means rent this, it's a charming little film.",
         "I love this movie, I am Irish, and take no offense at either the characters or the language (bollocks!!). All of which came across as very real. Good old fashioned Irish rogues, out to have a bit of \"craic\"(meaning fun, pronounced \"crack\"). This is one of my favorite Irish movies. Janeane Garofalo is beautiful and talented, Denis Leary is hilarious in his sleaziest, Milo O'Shea and Rosaline Linehan are hilarious also as the two rival matchmakers, although Rosaline wasn't given near enough to do. Lots of colorful Irish characters, Eamon Kelly, David Kelly too. If you like a bit of old fashioned \"stage\" Irishness, then you'll enjoy this movie, lots of laughs and little off color humor (when Eamon Kelly finds his missing teeth - yuk!)but definitely laugh out loud hilarious entertainment. Did I mention the lovely West of Ireland and Aran Islands scenery? Watch out for reviews with spoilers, as they'll ruin the whole movie for you.",
         "This is one of my favorite movies of all time!! Janeane Garofaolo is amazing in this...she is funny and sardonic, while still being a very likable character. The actor that played Shaun did an excellent job as well..he was quite charming! I have watched this movie at least 15 times, and still get a great laugh whenever I watch it!!! Not to mention the last time I watched it I heard things I had not heard before. This is a very refreshing, light hearted romantic comedy that thankfully didn't choose to include a wild nude sex scene - it would have been awkward in this movie and would have taken away from it's charm. I highly recommend this movie!!!",
         "This movie quickly became a family favourite, so much so that my sons and daughters each have a copy of their own. The movie is watched four or five times a year and none of us ever tire of it.Having watched it so often my children (now adults) know most of the dialogue and from time to time one or the other will launch into a reenactment of one of the scenes, accents and all. While, Garofalo and O'Hara are excellent, it is the remainder of the cast who provide most of the humour - some of the cast are well known here in Ireland, while others are less so. Regardless, their one line deliveries and interactions with one another will crack you up. You just have to see the 'cottage scene with the senator' it is priceless! I still end up laughing uncontrollably every time I see it. They say laughter is good for the 'soul' - watch the Matchmaker and you'll never have to worry about the state of its health!",
         "I thoroughly enjoyed this film. It has a credible (in terms of dialogue) story, with wonderful acting all around, and is well put together. I am saddened by the fact that it blew through the theaters, but glad to have caught it on video.",
         "This movie is so fun. Janeane Garofalo is perfect for the part and David O'Hara is charming. It would be great to see him more. I feel that the casting was well done. The Irish setting is especially lovely. I wish there were more films like this. It is a feel good \"Americanish\" romantic comedy with a delightful Irish feel which reminds you that there is a world outside of the US. It brings to mind another movie that makes me feel the same: American Women. Again, this movie takes place in Ireland, it transports you as well to a peaceful quaint village with charming characters and lovely scenery. Part of the charm of both these movies is the music."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Good Film Company",
         "Polygram Filmed Entertainment",
         "Working Title Films"
      ],
      "summaries": [
         "Marcy is an assistant to Senator John McGlory, who is having problems with a re-election campaign. Desperate for Irish votes, McGlory's chief of staff Nick sends Marcy to Ireland to trace McGlory's relatives or ancestors. Marcy arrives at the village of Ballinagra when it is preparing for an annual Matchmaking Festival. A well-dressed, handsome and single young lady, she becomes the center of attention for two professional matchmakers, Dermot and Millie, as well as for bartender Sean.",
         "When election campaigner Marcy Tizard arrives in Ballinagra Ireland to track down the ancestral roots of U.S. Senator John McGlory, romance is the last thing on her mind. But this otherwise sleepy village is in the middle of its annual matchmaking festival, and the locals have money on it that she'll be fixed up in no time.",
         "Marcy, a worker in the reelection campaign of bumbling Senator John McGlory, is sent to Ireland on a quest to find the Irish ancestry of Sen. McGlory, to help him win the Irish vote. But when Marcy arrives in the small village of Ballinagra, she finds herself in the middle of a matchmaking festival, and the local matchmaker is determined to pair her off with one of the local bachelors."
      ],
      "budget": 0
   },
   "movielensId": 1629,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-03",
      "dvdReleaseDate": "2003-01-07",
      "directors": ["Mark Joffe"],
      "runtime": 97,
      "movieId": 1629,
      "title": "The Matchmaker",
      "mpaa": "R",
      "actors": [
         "Janeane Garofalo",
         "David O'Hara",
         "Denis Leary",
         "Milo O'Shea",
         "Jay O. Sanders"
      ],
      "imdbMovieId": "0119632",
      "originalTitle": "The Matchmaker",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["PhTjYefSkuc"],
      "plotSummary": "Marcy, a worker in the reelection campaign of bumbling Senator John McGlory, is sent to Ireland on a quest to find the Irish ancestry of Sen. McGlory, to help him win the Irish vote. But when Marcy arrives in the small village of Ballinagra, she finds herself in the middle of a matchmaking festival, and the local matchmaker is determined to pair her off with one of the local bachelors.",
      "tmdbMovieId": 20457,
      "avgRating": 3.23089,
      "releaseYear": "1997",
      "numRatings": 981,
      "posterPath": "/d4T1angi2Wc03txOZSRgc1Jm1PF.jpg"
   }
}