{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "florida",
            "id": 1196
         },
         {
            "name": "stolen money",
            "id": 8627
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "stabbing",
            "id": 14831
         },
         {
            "name": "bank robbery",
            "id": 15363
         },
         {
            "name": "parent-in-law child-in-law relationship",
            "id": 184496
         },
         {
            "name": "beekeeper",
            "id": 224563
         },
         {
            "name": "orlando florida",
            "id": 224564
         }
      ],
      "imdb_id": "tt0120402",
      "video": false,
      "title": "Ulee's Gold",
      "recommendations": [
         49427,
         81619,
         92422,
         28892,
         95764,
         47019,
         5282,
         85769,
         37053,
         49011,
         48458,
         27480,
         15912,
         48918,
         55026,
         86664,
         41386,
         114994,
         62364,
         203922
      ],
      "backdrop_path": "/gVqObIkuuaE7irQ4MC4CaCL7jlT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Ulee Jackson",
               "gender": 2,
               "credit_id": "52fe48c5c3a36847f8178965",
               "name": "Peter Fonda",
               "profile_path": "/dgorN06SQ9ZNL2NY3I7BNxg93lc.jpg",
               "id": 8949,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Connie Hope",
               "gender": 1,
               "credit_id": "52fe48c5c3a36847f8178969",
               "name": "Patricia Richardson",
               "profile_path": "/rOrXiF41KMpr8fPX070UV3n0iVe.jpg",
               "id": 134178,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Helen Jackson",
               "gender": 1,
               "credit_id": "52fe48c5c3a36847f8178971",
               "name": "Christine Dunford",
               "profile_path": "/vhMhDSK5D6csFtK1uI8ktnkuSyR.jpg",
               "id": 150061,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Jimmy Jackson",
               "gender": 0,
               "credit_id": "52fe48c5c3a36847f8178981",
               "name": "Tom Wood",
               "profile_path": "/5GTEmE1e2Xr5FKP59qCAEK8Vo5f.jpg",
               "id": 43772,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Casey Jackson",
               "gender": 1,
               "credit_id": "52fe48c5c3a36847f817896d",
               "name": "Jessica Biel",
               "profile_path": "/34c4S8IX9JQPoEAMJ4o5FTVbzM1.jpg",
               "id": 10860,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Penny Jackson",
               "gender": 1,
               "credit_id": "52fe48c5c3a36847f8178985",
               "name": "Vanessa Zima",
               "profile_path": "/lyd5C8ZVFtnZ1Diq0qgbuRVLvO9.jpg",
               "id": 130104,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Eddie Flowers",
               "gender": 2,
               "credit_id": "52fe48c5c3a36847f8178979",
               "name": "Steven Flynn",
               "profile_path": null,
               "id": 155949,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Ferris Doley",
               "gender": 2,
               "credit_id": "52fe48c5c3a36847f817897d",
               "name": "Dewey Weber",
               "profile_path": "/beGvYqnuTTSeyxCKW77r9dHYlLg.jpg",
               "id": 167676,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Sheriff Bill Floyd",
               "gender": 2,
               "credit_id": "52fe48c5c3a36847f8178975",
               "name": "J. Kenneth Campbell",
               "profile_path": "/iTdMiC7DDcFa1vVJs5qMky5m6cl.jpg",
               "id": 97944,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Chance Barrow",
               "gender": 2,
               "credit_id": "570af4fac3a3687796005dd4",
               "name": "Traber Burns",
               "profile_path": null,
               "id": 173807,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Charley Myers",
               "gender": 0,
               "credit_id": "570af519c3a3684f41001308",
               "name": "Ryan Marshall",
               "profile_path": null,
               "id": 1201464,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Mark",
               "gender": 0,
               "credit_id": "570af520c3a3680ee1000e0f",
               "name": "Chad Fish",
               "profile_path": null,
               "id": 1604113,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48c5c3a36847f817895b",
               "name": "Victor Nunez",
               "profile_path": null,
               "id": 138322,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48c5c3a36847f8178961",
               "name": "Victor Nunez",
               "profile_path": null,
               "id": 138322,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "570af9519251412bcc00018d",
               "name": "Charles Engstrom",
               "profile_path": null,
               "id": 1030290,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "570af95e92514112160007a1",
               "name": "Virgil Mirano",
               "profile_path": null,
               "id": 1423867,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "570af96bc3a3680b77005aef",
               "name": "Victor Nunez",
               "profile_path": null,
               "id": 138322,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570af97ac3a368356a000d7a",
               "name": "Sam Gowan",
               "profile_path": null,
               "id": 1604114,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "570af986c3a3680ee1000fb8",
               "name": "Peter Saraf",
               "profile_path": null,
               "id": 4855,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "570af991c3a3680ee1000fc2",
               "name": "Stewart Lippe",
               "profile_path": null,
               "id": 1604116,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "570af99e9251413627001022",
               "name": "Judy Courtney",
               "profile_path": null,
               "id": 1391067,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "570af9a9c3a368356a000d94",
               "name": "Pat Garner",
               "profile_path": null,
               "id": 1453741,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "570af9b6c3a3684f4100150e",
               "name": "Edward Saxon",
               "profile_path": null,
               "id": 16297,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "570af9c19251417da7001777",
               "name": "John Sloss",
               "profile_path": null,
               "id": 3727,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "570af9ce9251412c74000174",
               "name": "Valerie Thomas",
               "profile_path": null,
               "id": 1324700,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "570af9da9251410ebf0014f2",
               "name": "Charles Kulsziski",
               "profile_path": null,
               "id": 1474667,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "570af9e592514111f2000820",
               "name": "Marilyn Wall-Asse",
               "profile_path": null,
               "id": 1391068,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.670193,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 55306,
      "vote_count": 21,
      "budget": 0,
      "overview": "An elderly beekeeper and Vietnam vet must rescue his daughter-in-law and protect his grandchildren from killers.",
      "similar": [
         281957,
         769,
         507,
         298312,
         2142,
         400,
         3134,
         1587,
         4771,
         8967,
         110415,
         112160,
         205,
         141,
         97367,
         244772,
         339692,
         281,
         185,
         4538
      ],
      "original_title": "Ulee's Gold",
      "runtime": 112,
      "poster_path": "/uGoXXAGHhjdDzHmt8PkYKfSwqu3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nunez-Gowan",
            "id": 75348,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Clinica Estetico",
            "id": 1274,
            "origin_country": ""
         }
      ],
      "release_date": "1997-06-13",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Victor Nunez"],
      "runtime": 113,
      "synopsis": "Ulee Jackson ( Peter Fonda) is a widowed Florida beekeeper whose son Jimmy ( Tom Wood) is in prison following a botched robbery. Jimmy's wife Helen ( Christine Dunford) has abandoned their two daughters and is living somewhere in Orlando. Ulee's stubborn independence prevents him from asking for help, and as the movie begins he has his hands full running his business and acting as surrogate parent to his granddaughters Casey and Penny. Casey ( Jessica Biel) is a rebellious teenager and Penny ( Vanessa Zima) is a timid 10-year-old who seems confused by her parents' absence and the tension at home. When Ulee visits Jimmy in prison, Jimmy tells him that Helen has turned up at the Orlando home of two low-lifes named Ferris and Eddie. They were Jimmy's accomplices in the bank robbery, but were never caught. Now they say Helen is sick, and Jimmy asks Ulee to bring her home. Ulee goes to Orlando to pick up Helen, but it turns out what Ferris and Eddie really want is the bank money that Jimmy hid after the robbery. Ulee agrees to ask Jimmy about it, and then takes Helen home. Helen's \"illness\" is actually drug addiction, and while she is almost comatose on the way home, she becomes violent and belligerent as she wakes up near the house. Ulee's tenant and neighbor, a divorced nurse named Connie Hope ( Patricia Richardson), is brought into the home by a frightened Penny, and over the next few days she helps Helen through her drug withdrawal. Meanwhile Ulee learns that Jimmy hid the bank money in one of his beeyards. He tells Ferris and Eddie he'll bring the money to Orlando in a few days, but they decide they can't wait and take Helen and the girls hostage in Ulee's home. They then force Ulee at gunpoint to take them to the beeyard, where he shows them the hiding place. As they are recovering the money, Ulee kicks the gun into the swamp. The angry men ride with Ulee back into town, then stab him in the parking lot when they arrive. As Ulee lies bleeding on the ground, Ferris and Eddie drive off but are pulled over almost immediately by the sheriff (who was probably tipped off by Connie). The movie ends with a newly hopeful Jackson household. Helen has stepped back into her role as a mother, and Jimmy expects to be paroled soon. Ulee is happy to return to his bees, but has mixed feelings about giving up some of his responsibilities. (\"I feel like an old drone. They don't need me now.\") As he recovers from his knife wound he begins work on expanding his business to accommodate Jimmy's eventual return, and seems to finally be taking a romantic interest in Connie.",
      "writers": ["Victor Nunez"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120402/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NjY3NzA0OF5BMl5BanBnXkFtZTcwMDQ3Mjg3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Fonda, Patricia Richardson, Christine Dunford | See full cast and crew »"],
      "reviews": [
         "I just love this film. I like the Faulkner-like story set in the South. I like the subdued, yet brilliant performance by Peter Fonda. I like the detailed shots of the art of beekeeping. The music...I just love this movie. The story centers around Ulee, a stoic beekeeper and honey maker. Ulee's son is doing time in prison for his part in a robbery. His son's wife is a junkie who walked out on her three daughters, leaving Ulee to raise them. Although Ulee is not an emotional man, you sense he loves his grandkids and son, he just has trouble showing it. Well, the mom comes back, his son's partners in crime come back and Ulee realizes that his simple life is in great peril. This is a wonderful family film and I think a performance by Fonda that is very personal. I highly recommend it.",
         "This movie is great in a number of ways. For a start, it shows Peter Fonda is a truly accomplished screen actor and not merely Henry's son, Jane's brother or Bridget's dad. It is a pity that he has had so few good roles to play over the years and his acting career has been largely disappointing. However,he totally brings the character of Ulee to life . Ulee is a decent man trying to do the right thing and when you see this film you are behind him all the way, willing him to overcome all the obstacles he encounters.This film, while a mostly straightforward simple tale,lifts the spirits and is a direct result of how positive the script is. Peter Fonda should make more films like this or he soon might find himself looking for the few good 'grandfather' roles out there in the movie world.",
         "Excellent tale about a man who gets involved with 2 men intent on getting their hands on a stash of stolen loot from an armored car robbery. Unique story with an actor I haven't seen since he hit middle age. Peter Fonda still has the same soulful eyes he had when I first saw him in \"Wild Angels\" back in the mid-60's. His acting has improved considerably over the years; I thought his old underground films were somewhat amateurish back then. This was a fine movie which reminded me a little of his western \"The Hired Hand\" from some 20 years ago. Well worth watching.",
         "Surely one of the best human dramas of the last few years, Peter Fonda is great as Ulee Jackson, a deeply wounded but incredibly strong man who by sheer strength of will reaches out to drag back together a shattered family. His performance is a masterpiece of understatement; we can almost physically sense the roiling depths of anger and resentment that lie below his cold, almost imperturbable exterior. The crime subplot never takes precedence over the gripping family drama that is the movie's core. It is wonderful to see the various characters gradually becoming re-integrated into a functioning family; i.e. the daughter's appearing late at night in the work area to help Ulee, whose restrictions up to then she has mightily resented, with his backbreaking work. Few have commented on the double entendre of the movie's title. Ulee's \"Gold\" is, on its surface, the honey he works to produce. It is clear, at the film's conclusion, that the \"Gold\" is, in actuality, the family he has brought together again. (I suppose we could have a triple entendre in that it might also refer to the long-lost money that is at the crime subplot's core).",
         "Peter Fonda plays Ulee, a middle-aged beekeeper raising his incarcerated son's two daughters in rural northern Florida. Suddenly two of his son's partners in crime show up, dump the son's wife (who had abandoned the family years before) on their doorstep, and begin menacing around looking for lost loot. Ulee tries to do the right thing, but while \"keeping it in the family\". Most directors and screenwriters today would go for tautness and intensity. Not here, though it is not lacking in drama. This is a study in family dynamics as three generations (and neighbors) try to pull it together and address the crises that confronts them. Rent this movie. It is subtle, well-crafted, and the best work Peter Fonda has done in decades.",
         "\"Ulee's Gold\" is a simple little film that is reminiscent of Old Hollywood. Peter Fonda (Oscar-nominated) stars as a bee-keeper in Florida who has lived a somewhat uneventful life. He's raising his two young grand-daughters because their father is in prison and their mother is nowhere to be found. When Fonda learns from his imprisoned son that his daughter-in-law needs his help, he rescues her from a life which has nearly been ruined by drug-use. Fonda brings her back to live with him, but also learns from his son that two thugs may create trouble because of a score they (the son and thugs) pulled off years earlier. Now the thugs want the money and Fonda must show emotional strength at his family's darkest hour. The film is above-average in every aspect, but it is Fonda that makes the film as good as it is. Everyone else is adequate, but this is his show. The screenplay and direction are just good enough to keep the film above water. Overall a good film. 4 stars out of 5.",
         "A pretty good little movie. The pace is a little slow, and often not much seems to be happening. This is not a bad thing here. Hollywood is usually so formulaic that they must not be discouraged when they try something a little different. Everything worked well here, the acting, the photography, the direction. Yes, Peter Fonda turned in a fine performance. I wonder if as much would have been made of this if Fonda hadn't spent most of his career playing in total stinkers, though. The small-time crooks, Fonda must deal with (including his son) are such losers they seem directly imported from an Elmore Leonard novel. Special mention for the child actress Vanessa Zima (Penny Jackson). She performed wonderfully in her role, full of soulful and meaningful looks. Either she is a very good child actress, or the casting director did a great job finding a girl who looks the part.",
         "Now I see why this is such a good movie, the plot is simple and people can relate to these same problems that many families experience. I was very thankful to find this video on sale it's worth every gold penny! Ulee's Gold has Peter Fonda as a Florida beekeeper who returns to take care of family while his son is in prison. Problems are many dealing with the mother of his two granddaughters the mother is battling a drug problem, plus dealing with dangerous thugs who are former friends of his son. These problems all turn to gold in the end as you will find during this film that the Fonda character discovers his soul with the strength and courage that helps everyone begin life anew. Great performance from Peter Fonda a golden globe winner. This was the movie debut of Jessica Biel, believe me she is a future babe.",
         "It's not until the second half of \"Ulee's Gold\" that we hear Peter Fonda's character's full name, Ulysses. Once spoken you can't help feeling the rush of recognition of Homer's influences in this well-acted drama. There is Ulee's dead wife, Penelope--whom was Odysseus' wife in \"The Odyssey\". There is Ulee's daughter-in-law Helen--whom was responsible for starting the Trojan War in \"The Illiad\". Ulee is a veteran of the Vietnam War in much the way that Odysseus was of the Trojan War. He tells his grand daugher Penny he survived because of his \"trickery\" in much the same way Odysseus did with the Trojan Horse. His endurance of the many things which befall him after being sent to retrieve his Helen remind one of the way Odysseus was treated when he returned to his home as a beggar. Nods to Homer aside, this film was slow at times but worth the rental when taken in its entirety. Peter Fonda and Patricia Richardson both give outstanding performances with Fonda well deserving of the Golden Globe for his portrayal of Ulee. Rent it on your next visit to the video store--it won't disappoint.",
         "Although many people say this film is slow and has no action, that is not true in many areas. It IS mostly a drama on the life of a middle-aged beekeeper and his family's problems. But there are also many scary situations, and although there are no actual fights, the scenes between Ulee and his son's cohorts are realistically tense. Peter Fonda is a brilliant actor and Patricia Richardson shows us her talents as well."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Clinica Estetico",
         "Nunez-Gowan"
      ],
      "summaries": [
         "Ulee is called one day by his incarcerated son, Jimmy, asking for a favor. Jimmy will repay his debts if they save his wife, Helen, from hoodlums. Ulee must now risk his and his family's lives to save Helen.",
         "Vietnam War veteran Ulee Jackson comes from a long line of Florida beekeepers. He believes that his and his family's lives are nobody's business but their own. He has been retreating from life ever since the death of his childhood sweetheart wife, Penelope, six years ago. He now lives with his two granddaughters, teenaged Casey and adolescent Penny, as their father/Ulee's son, Jimmy, is in prison for robbery, and their mother/Jimmy's deadbeat wife, Helen, abandoned the girls, Helen's current whereabouts unknown. Despite factors killing off bees worldwide, Ulee has placed most of his energies into his beekeeping business, as bees are still easier to manage than his family. In prison, Jimmy receives news via telephone call from his two shifty friends, Eddie Flowers and Ferris Dooley, that they know where Helen is, she who is possibly in trouble. Jimmy asks Ulee to retrieve her from Eddie and Ferris in Orlando. Upon his arrival in Orlando, Ulee learns that Eddie and Ferris, who do have a drugged out Helen, manufactured Ulee's retrieval of Helen so that he could be a face-to-face messenger to Jimmy. Eddie and Ferris were Jimmy's two associates in the robbery that put Jimmy behind bars, Jimmy who never ratted them out. Eddie and Ferris learned from Helen in her fragile state that Jimmy managed to steal an extra $100,000 in the robbery, and they now want that money, with Ulee, Casey and Penny's safety at ransom. Beyond finding out from Jimmy about the money, Ulee, like everything else in his life, decides to deal with this issue solely on his own. Regardless, he may get some unrequested help from a few people in dealing with his collective life issues, including local sheriff, Bill Floyd, with who Ulee has been on the outs since Jimmy's imprisonment, and nurse Connie Hope, who is new to the area as Ulee's tenant in the house he owns across the street from his own.",
         "A reclusive beekeeper slowly pulls his dysfunctional family back together, but not without having to fight his son's previous dastardly cohorts."
      ],
      "budget": 2700000
   },
   "movielensId": 1633,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-13",
      "dvdReleaseDate": "1999-08-24",
      "directors": ["Victor Nunez"],
      "runtime": 112,
      "movieId": 1633,
      "title": "Ulee's Gold",
      "mpaa": "",
      "actors": [
         "Peter Fonda",
         "Patricia Richardson",
         "Christine Dunford",
         "Tom Wood",
         "Jessica Biel",
         "Vanessa Zima",
         "Steven Flynn",
         "Dewey Weber",
         "J. Kenneth Campbell",
         "Traber Burns",
         "Ryan Marshall",
         "Chad Fish"
      ],
      "imdbMovieId": "0120402",
      "originalTitle": "Ulee's Gold",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["3cea_SDUKIY"],
      "plotSummary": "An elderly beekeeper and Vietnam vet must rescue his daughter-in-law and protect his grandchildren from killers.",
      "tmdbMovieId": 55306,
      "avgRating": 3.66339,
      "releaseYear": "1997",
      "numRatings": 2595,
      "posterPath": "/xg0nvJALCLchiULDoJ5dEcXC6mi.jpg"
   }
}