{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "stag night",
            "id": 8070
         },
         {
            "name": "death",
            "id": 34079
         }
      ],
      "imdb_id": "tt0120192",
      "video": false,
      "title": "Stag",
      "recommendations": [],
      "backdrop_path": "/rXqF8v2OENSJid6cTa5Ll4fXsHq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Michael Barnes",
               "gender": 2,
               "credit_id": "52fe45e99251416c91042a7b",
               "name": "Mario Van Peebles",
               "profile_path": "/ciIe7kUrTA2nL8dPDA4L88DcBZX.jpg",
               "id": 16214,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ted",
               "gender": 2,
               "credit_id": "52fe45e99251416c91042a7f",
               "name": "Jerry Stiller",
               "profile_path": "/wyleNpBLMLZ9CNjl13hNB8zoFIa.jpg",
               "id": 26042,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dan Kane",
               "gender": 2,
               "credit_id": "52fe45e99251416c91042a83",
               "name": "Kevin Dillon",
               "profile_path": "/uAJsJxnbTWOpkBjRRBNtyRDt8qW.jpg",
               "id": 6863,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jon DiCapri",
               "gender": 2,
               "credit_id": "52fe45e99251416c91042a87",
               "name": "William McNamara",
               "profile_path": "/c19069KdW7VW4h8Q5Cq35j8sOMl.jpg",
               "id": 18687,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e99251416c91042a77",
               "name": "Gavin Wilding",
               "profile_path": null,
               "id": 115362,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546cd38b925141304c001d77",
               "name": "Pat Bermel",
               "profile_path": null,
               "id": 294790,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "546cd394c3a368097d001c60",
               "name": "Evan Tylor",
               "profile_path": null,
               "id": 538715,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "546cd3a1925141305f001b92",
               "name": "Jason Schombing",
               "profile_path": "/8UrFXrkSyszfZzZwUKIBErDHYHG.jpg",
               "id": 116047,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.925606,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36434,
      "vote_count": 6,
      "budget": 0,
      "overview": "Victor Mallick returned to his home and found out that all of his friends have arranged a surprise bachelor/stag party for him. Two strippers were hired to cheer up the party. However, when some of the men accidentally killed one of the strippers, they are left to face the consequences of their action.",
      "similar": [
         10029,
         238636,
         341006,
         205,
         182560,
         10585,
         431,
         4141,
         681,
         948,
         59967,
         261023,
         562,
         281,
         201085,
         339692,
         381288,
         298250,
         281957,
         379149
      ],
      "original_title": "Stag",
      "runtime": 91,
      "poster_path": "/5FU8zjnjf5o79Q1a0RpaOxM0yLr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rampage Entertainment",
            "id": 26144,
            "origin_country": ""
         },
         {
            "logo_path": "/eNdCXEfW6rDxjnO3VdqIzWVuviH.png",
            "name": "Lions Gate Films",
            "id": 35,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "The life of the party just died!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gavin Wilding"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Pat Bermel",
         "Jason Schombing"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120192/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzcyMTYzOTI5N15BMl5BanBnXkFtZTcwOTUyNjcxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: John Stockwell, Mario Van Peebles, Jerry Stiller | See full cast and crew »"],
      "reviews": [
         "Stag came out first before Very Bad Things. What is better about Stag is the dark elements it has: a bachelor party disaster, nobody walking out alive, and who is going to die first. anyway, very bad things ripped off the idea of a dead stripper falling flat on her face, but what I liked about Stag is that it wasn't too much of a dark comedy, but a normal thriller that should've been in the theaters. So I'm going to give it my thumbs up.",
         "I actually saw this after \"Very Bad Things\" and realised where \"Very Bad Things\" may have gained the basic ideas from. This is actually a more superior film than \"Very Bad Things\" as it does take the issue seriously and making it seems like it could happen to anyone. The large cast, unfortunately, makes it difficult for specific character developments to arise. Even though at the end of the film we do feel sorry for Taylor Dayne's and Kevin Dillon's character. The acting in the film is quite decent too with Dayne holding herself quite well among the other performer. Kevin Dillon comes close second for his portrayal as a man who painfully tries to do the right thing. The ending, while a little dark, could not have been better executed. Overall, 7.5 out of 10.",
         "**SPOILERS** An anything goes wild stag party turns into a nightmare for all those involved with half of the participants ending up dead, from gunshots beatings suicide and even a heart-attack, and the other half having their lives ruined forever. It didn't have to happen this way it was just to be an evening of good natured fun for the person that the party was being thrown for \"Entrepreneur of the Year\" Victor Mallick, John Stockwell. Victor about to get married had everything going for him in both business and marriage but that went down the drain together with his freedom by the time the night of horrors ended. Victor now faces some seven years behind bars with his good friend and business partner attorney Michael Barnes, Mario Van Peebles, turning states evidence against him. As for that slick and slimy shyster, who's running for city council, Michael Barnes all his back-stabbing and legal maneuvering in the end will not only have his license to practice law revoked but have him end up as Victor's cell-mate. Michael as smart as he was, in saving his lousy neck, overlooked an object that recorded the entire sleazy cover-up that he orchestrated. A good old video camcorder that was accidentally left, during all the confusion, on record mode! The party at first was going as expected with everyone getting juiced on booze and drugs until two, paid for their services, strippers Kelly together with her older sister Serena, Jenny McShane & Taylor Dayne, and their friend Stoker, William Parel,unexpectedly dropped in. Dressed as policemen the three, Kelly Serena & Stoker, ended up setting off the by now out of control and excited party-goers to the point where Kelly ended up dead with her spine broken. Trying to cover up Kelly's death, which in fact was accidental, the stag-party goer made things a lot worse in trying to protect their careers and reputations by acting like criminals more then just someone, or someones, who're victims of circumstances. A lot like the movie \"12 Angry Men\" we get to see the guest of honor Victor and his drinking and partying buddies try to justify their actions that lead to Kelly's death. In justifying their actions Victor & Co. do things far worse, and with full knowledge of what their doing, then what they did to the deceased Kelly by accident! What we get is a night of planning conniving and executing crimes that in the end would put the entire cast of characters, with the exception of those who ended up dead, behind bars for up to fifteen years. The film \"Stag\" shows how a group of totally innocent and, with the exception of the stag party's drug supplier ex-con Pete Webber (Andrew McCarthy), upright citizens can in their unfounded fear be whipped up to commit a number of major crimes in a frantic effort to save their jobs freedoms and reputations. Webber, the drug dealer, being a career criminal was anything but concerned in murdering those who can implicate him in Kelly's death. It was fascinating to see Webber's, who should have known better, plan since the worst that he, having really nothing to lose, could get is breaking his parole not losing a six figure job in the business legal sports or entertainment world. ***SPOILER ALERT***The person at the party who was just there because he was Victor's good friend, not that he was a big success in anything, Gulf War Vet Dan Kane, Kevin Dillion, was the only one who seemed to have his head screwed on straight. Trying to do the right thing Ken almost gets himself shot by non-other then Victor, in trying to save his a**, who didn't know who his friends really were until the police put the cuffs on him. Victor trusted his good friend and business partner Michael Barnes who's testimony sent him up the river without a paddle and, when he was to be released, job to support his very expensive lifestyle. P.S What a difference things would have been for Victor, as well as those at the stag party, if he just listened to his friend Ken. Ken, unlike Michael Barnes, looked after Victor's best interests not those of his own. In the end the almost invisible, to those at the party, camcorder, and what it recorded, was the evidence that got Ken off the hook as well as hooked Victor and his friends into the sate penitentiary.",
         "This film was great. If you've ever been to a bachelor party or heard stories about bachelor parties, this movie is for you. I'm a married woman and have heard scores of stag party anecdotes, both funny and lewd. This movie shows what can happen to perfectly normal, decent, middle to upper-middle class guys when things go terribly wrong and spiral out of control. As the movie progressed I just kept thinking: \"I KNOW these guys, this could happen to people I KNOW.\" Basically, it shows how bad things happen to average, normal people and how we all have a dark side that can come out when pushed to the wall. Watch this movie, with an honest, open mind, and see if there's someone you know up on screen. By the way, is it just me or is the new movie Very Bad Things a rip-off of this one? I've only seen the trailers, but it looks like the same movie. We'll see...",
         "I first saw a trailer for this film on a movie we rented and thought 'Hmm, I might quite like to watch that' and then forgot about it after the movie had finished. Then, a few years later, it was on a movie channel, late at night, so I sat up and watched it. Wow - it has since become one of my all-time favourite, story-driven films ever. No kidding. The acting, the editing, the direction, the story - it's brilliantly intense, and Andrew McCarthy is fan-bl**dy-tastic as the guy that tries to keep it together, right down to how he deals with Timon (sp?). This film is beaten in my top ten rankings only by Suicide Kings, but if that didn't have Walken and Leary in it, this would be closer to the 1 spot.",
         "I was up late the other night and this was on HBO. I only started to watch it because of John Henson, who I liked watching on \"Talk Soup\". Boy, was this a stretch for him! \"Stag\"'s premise is simple enough, but the writing and cinematography were complex. As I was watching, I was reminded of another engrossing film... \"Suicide Kings\". Both take place in one location (mostly), and both involve a group of guys dealing with their recent actions, and a hostage. Both also have a known comedic actor (in this case Henson) doing a dramatic turn. And VERY well, I might add. Unlike most movies, this one doesn't quite turn out like you think it will, not completely. For mostly B Actors, I was very impressed with the quality of the work. I'm also surprised more impressive talents didn't sign on after Jerry Stiller got attached to the movie! But nonetheless... if you liked \"Suicide Kings\" you should like \"Stag\" as well.",
         "The plot of a bachelor party gone terribly wrong plays far better as \"black comedy\" in \"Very Bad Things\", than in the claustrophobic free for all that is \"Stag\". The constant flip flopping of plans to save their asses really becomes tiresome. Almost the entire film takes place in one room, and with so many characters with zero character development, the outcome becomes a \"so what\". Sure it's violent at times, but the talent of Ben Gazzara, and especially Jerry Stiller is totally wasted by not pursuing the dark comedy angle. What you are left with is a claustrophobic movie, that is vastly inferior to \"Very Bad Things\". - MERK",
         "Things look pretty good for groom to be John Stockwell, where his mates hold him a surprise stag party. His guests are an assortment of characters, some oldies types, that have you questioning, how exactly are these guys related, without never really knowing much about 'em. They are soon wishing it was just a stag party instead of a shag party, when one of two hookers, the prettier, younger one, ends up taking a really bad fall, while being tossed around on a blanket, where she falls face flat on the floor, instantly dead. This is what happens when things get a little too crazy, where alcohol and drugs can really make you do stupid s..t. Too, prior to her death, she had politely asked them to stop, to no avail, and now our men have a situation, where this party has really died. The other hooker, rock singer, Taylor Dane, who in some close ups, horribly resembles a girl I went to acting class with, is kept hostage by this group, who we appallingly discover, with the exclusion of one, are all out to save their own skin. They don't give two hoots about the dead girl, including one promising actor, who doesn't want to throw his career down the toilet on account of a whore. They have plans for the surviving sister too. The rest of the film, impressively intense, at times, deals with the shared conflict between the men, and how they all must agree to do away with the other girl, only we have a greater conflict. Kevin Dillon is the only one not on board. One line of dialogue he uses to describe his friends, and this gutless act, I totally agree with, but really what would you do, if faced with this situation? Would you tell the truth, and risk jail? What if you had everything in front of you, and everything to lose? What if you were that promising actor? Stag, silently raises these questions, and what you would really do in this predicament, where these kind of (before and after) circumstances, could happen tomorrow. That's what I got from this movie, of being any of those guys. They were all in a inescapable dilemma, fate and karma paying one of em, with a heart attack. After all, only earlier was he bonking the deceased. Andrew Mccarthy plays sleaze great here, as a real piece of s..t drug dealer, in probably one of his best performances, the less caring of them all. It was great to see him get his just desserts. Not helping the situation or the men's paranoia, we have some little interruptions by a lonely and annoying old neighbor, guess you can't guess who? Stag eventuates with a realistic, if disillusioned ending, I totally bought, where sometimes, truth can pay off. Good on ya Kev. Stag is one of those better b movies, and when you got a jazzy Tom Jones's number to open it up, you know you're in for something good. A mainstream movie copy followed, Very Bad Things.",
         "..Actually think about a hidden meaning at the title. (Stag) is obviously the party for a single man who is getting married which is exclusively for men only (and no problem if there are some strippers too !). But on the other hand the same word (Stag) could mean : betray, deceive, or something for men only ! And what a banquet of successive reciprocal treachery we had among a bunch of men who represented the degeneration's ugliest degree, the most evil trends and the vilest unity at all whether as men, friends, or creatures of lamentable contemporary bourgeois ! It's about some men of the American middle class having a hard time with an accident they never plan whom eventually didn't ever make the right ideal choice to end up as true criminals like their own truth from the start which is hiding behind old masks without a bloody chance everyday ! That same situation made other movies like (Very Bad Things \u0096 1998) and (100 Mile Rule - 2002), but at (Stag \u0096 1997) it had a reasonable treatment as a fine studying for that terrifying weakness in such a class, a solid atmosphere (one place in just one night), along with thrilling time too. The acting was sober (for example it's the best performance of Jerry Stiller yet), and the event's panic was cinematically well expressed. Here the social commentary was outstanding compared to the other 2 movies. Let alone a few smart touches (Jerry Stiller raises the American flag as the carnage ends in the morning !, Tom Jones sings \"Let me love you tonight\" at the opining credit ! ..etc). But it had of course its own flaws.. Yes, it got the best analysis for its characters and their hidden past (one of them killed before and he got away with it ! As all of them are hidden killers in a way !). Though the script resorted to nasty phrases on screen to speak about every character ! Like it was hard to present them out of the stag, yet maybe they were too many to present which leads us to the logical question : Why are they 10 characters ?! That's numerous ! Especially when the script didn't make the stage as an epitome for the American society cleverly with balanced concentration on them all. Moreover, I felt some rashness at the third act. For sure I loved that bloody massacre at the end (and by the most poor character as the lower class against the unjust higher one) nevertheless, it's just an ending where the bad guys went to prison easily by the tape of the video camera ! I thought that this complete nightmare must end in a harmonious hideousness when all, or most, of them get away with it having the enduring concealed pain, as ordinary killers living among us dressed like usual humans but they are all beasts inside. However the movie selected a regular happy end ! Bloody but with all our emotions had been vaporized with all of those sick culprits under a suitable punishment ! It could be satisfying for the viewers, but not that satisfying for the case of the story. Anyway, it was all good well-meaning as a cinematic social incubus which is too annoying, and not that forgettable as its counterparts of the same satire at the same time.",
         "I like both of these films! They're probably a 'genre', although I don't know any other \"stag party disaster\" films. I have to say, I also saw a little bit of 'Shallow Grave', especially in 'Very Bad Things' where it was necessary to dissect and dispose of all those inconvenient bodies. Hello 'Goodfellas'. Certainly not for everyone...but you know who you are. Take time to watch both. I don't think you'll be disappointed with either of them. Kevin McCarthy and Christian Slater are the bad guys. Good choice and they do a good job."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Lions Gate Films",
         "Rampage Entertainment"
      ],
      "summaries": [
         "Victor Mallick returned to his home and found out that all of his friends have arranged a surprise bachelor/stag party for him. Two strippers were hired to cheer up the party. However, when some of the men accidentally killed one of the strippers, they are left to face the consequences of their action.",
         "A group of men are having a bachelor party. But when misfortune befalls one of the strippers at the stag, a convoluted scheme is hatched by the party-goers to avoid blame."
      ],
      "budget": 3000000
   },
   "movielensId": 1636,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-04-01",
      "dvdReleaseDate": null,
      "directors": ["Gavin Wilding"],
      "runtime": 91,
      "movieId": 1636,
      "title": "Stag",
      "mpaa": "",
      "actors": [
         "Mario Van Peebles",
         "Jerry Stiller",
         "Kevin Dillon",
         "William McNamara"
      ],
      "imdbMovieId": "0120192",
      "originalTitle": "Stag",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["x69QdJh-qsY"],
      "plotSummary": "Victor Mallick returned to his home and found out that all of his friends have arranged a surprise bachelor/stag party for him. Two strippers were hired to cheer up the party. However, when some of the men accidentally killed one of the strippers, they are left to face the consequences of their action.",
      "tmdbMovieId": 36434,
      "avgRating": 2.55682,
      "releaseYear": "1997",
      "numRatings": 88,
      "posterPath": "/pDExeTUG97hg55paEtjk3Mpckh1.jpg"
   }
}