{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new jersey",
            "id": 586
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "bisexuality",
            "id": 3183
         },
         {
            "name": "menage a trois",
            "id": 3190
         },
         {
            "name": "comic book",
            "id": 5451
         },
         {
            "name": "comic-strip artist",
            "id": 6799
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "best friend",
            "id": 12392
         }
      ],
      "imdb_id": "tt0118842",
      "video": false,
      "title": "Chasing Amy",
      "recommendations": [
         2293,
         2294,
         2292,
         2295,
         10218,
         1832,
         243,
         9430,
         9434,
         13342,
         9571,
         12498,
         1548,
         9675,
         10358,
         4995,
         13685,
         1542,
         1648,
         13785
      ],
      "backdrop_path": "/5VnEfd60Rie9A8HrgZMVzyibdaP.jpg",
      "revenue": 12021272,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Holden McNeil",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047bd1",
               "name": "Ben Affleck",
               "profile_path": "/lowyjtC3tZcNEGrxCGoEwjqgdvk.jpg",
               "id": 880,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Alyssa Jones",
               "gender": 1,
               "credit_id": "52fe4346c3a36847f8047bd9",
               "name": "Joey Lauren Adams",
               "profile_path": "/hQqqcyUvLQwnqBYCdpGZIfKOpmO.jpg",
               "id": 16484,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Banky Edwards",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047bd5",
               "name": "Jason Lee",
               "profile_path": "/67wSoVHxlOqtRhh3KJFBYf2qrDJ.jpg",
               "id": 11662,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hooper LaMont",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047be1",
               "name": "Dwight Ewell",
               "profile_path": "/uoyxSV5CvpgHjVFlDaXhsize0G4.jpg",
               "id": 20283,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Jay",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c27",
               "name": "Jason Mewes",
               "profile_path": "/so3nT2vgSCZMO2QXDVHF3ubxaFX.jpg",
               "id": 19302,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Silent Bob",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047be5",
               "name": "Kevin Smith",
               "profile_path": "/3XXThSMqHQgQFjM4bMJ25U1EJTj.jpg",
               "id": 19303,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Fan",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047be9",
               "name": "Ethan Suplee",
               "profile_path": "/tdfUFBwYm9rjwD2YtVl9LYoyoE2.jpg",
               "id": 824,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Collector",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047bed",
               "name": "Scott Mosier",
               "profile_path": "/9QIQyjKlRGXBHEXFSRFGIbv5Ig4.jpg",
               "id": 20503,
               "order": 7
            },
            {
               "cast_id": 4,
               "character": "Little Kid",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047bdd",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Shawn Oran",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c2f",
               "name": "Matt Damon",
               "profile_path": "/elSlNgV8xVifsbHpFsqrPGxJToZ.jpg",
               "id": 1892,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Jim Hicks",
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c2b",
               "name": "Brian O'Halloran",
               "profile_path": "/Ah9gKFDAfCthMIL4bjItjlut4vd.jpg",
               "id": 23629,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Kim",
               "gender": 0,
               "credit_id": "54c56abc9251412d9c001e0d",
               "name": "Carmen Llywelyn",
               "profile_path": "/nk1bAoJtDppHmputFeccCTW1f2x.jpg",
               "id": 143963,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Singer",
               "gender": 1,
               "credit_id": "568bac929251411334024415",
               "name": "Guinevere Turner",
               "profile_path": "/4TfrypzdT5ngoywRz7XyPexaDkN.jpg",
               "id": 32030,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Himself",
               "gender": 0,
               "credit_id": "59a64d68c3a36827e900518e",
               "name": "Joe Quesada",
               "profile_path": null,
               "id": 1187909,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Alyssa's Roommate (uncredited)",
               "gender": 1,
               "credit_id": "5456039ac3a368147c006b37",
               "name": "Illeana Douglas",
               "profile_path": "/w2O2SOXzwtJu9eytb3hGS7T8ftR.jpg",
               "id": 7796,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Jane",
               "gender": 1,
               "credit_id": "568bad1a9251410ffb0027e0",
               "name": "Welker White",
               "profile_path": "/aR8bLPY8Z74JIYSQ4RK5VlDz19O.jpg",
               "id": 93620,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047bf3",
               "name": "Scott Mosier",
               "profile_path": "/9QIQyjKlRGXBHEXFSRFGIbv5Ig4.jpg",
               "id": 20503,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047bf9",
               "name": "David Pirner",
               "profile_path": null,
               "id": 21299,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047bff",
               "name": "David Klein",
               "profile_path": null,
               "id": 21405,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c05",
               "name": "Scott Mosier",
               "profile_path": "/9QIQyjKlRGXBHEXFSRFGIbv5Ig4.jpg",
               "id": 20503,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c0b",
               "name": "Kevin Smith",
               "profile_path": "/3XXThSMqHQgQFjM4bMJ25U1EJTj.jpg",
               "id": 19303,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c11",
               "name": "Kevin Smith",
               "profile_path": "/3XXThSMqHQgQFjM4bMJ25U1EJTj.jpg",
               "id": 19303,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c17",
               "name": "Kevin Smith",
               "profile_path": "/3XXThSMqHQgQFjM4bMJ25U1EJTj.jpg",
               "id": 19303,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4346c3a36847f8047c1d",
               "name": "Christopher Del Coro",
               "profile_path": null,
               "id": 21133,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4346c3a36847f8047c23",
               "name": "Shana Lory",
               "profile_path": null,
               "id": 21208,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 11.223669,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2255,
      "vote_count": 549,
      "budget": 250000,
      "overview": "Holden and Banky are comic book artists. Everything is going good for them until they meet Alyssa, also a comic book artist. Holden falls for her, but his hopes are crushed when he finds out she's a lesbian.",
      "similar": [
         244772,
         1018,
         10358,
         401898,
         449176,
         258480,
         11421,
         2142,
         44945,
         540,
         48650,
         12793,
         19344,
         20770,
         11000,
         1902,
         1919,
         370663,
         11634,
         26371
      ],
      "original_title": "Chasing Amy",
      "runtime": 113,
      "poster_path": "/4vFJileWrCGaBeobCmF0tXpQCUb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "View Askew Productions",
            "id": 16934,
            "origin_country": ""
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-04",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "It's not who you love. It's how.",
      "adult": false,
      "homepage": "http://www.viewaskew.com/chasingamy/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kevin Smith"],
      "runtime": 113,
      "synopsis": "Holden McNeil (Ben Affleck) and Banky Edwards (Jason Lee) are comic book artists and lifelong friends. Holden is the calmer, more reasonable of the duo; Banky, meanwhile, is the caustic and short-tempered half. The story opens at a comic book convention in New York City where the two are promoting their latest comic series 'Bluntman and Chronic'. During a panel discussion, they meet Alyssa Jones (Joey Lauren Adams). She is a struggling writer whom is friends with the African-American writer and activist Hooper (Dwight Ewell) who puts on this militant image to hide his flamboyantly gay personality. That evening, they go out for drinks at a local bar where Holden is attracted to Alyssa, but soon learns that she is a lesbian when she invites him and Banky to a bar she frequents to hear her sing a pop song. However, the two begin hanging out, and a deep friendship develops. This does not sit well with the homophobic Banky, who dislikes and distrusts Alyssa and is bothered by the relationship that develops between her and Holden. Holden and Banky's business relationship suffers as well -- the two had been on the verge of signing a lucrative deal to turn Bluntman and Chronic into television show and Banky feels that Holden is no longer taking their combined efforts or the TV show seriously. Eventually, Holden is no longer able to contain his feelings, and confesses his love to Alyssa. She is initially angry with him, but that night, the two begin a romantic relationship. This new development worsens the tension between Holden and Banky. Determined to not let Holden and Alyssa have a future, Banky investigates and uncovers dirt on Alyssa's past, and he reports to Holden that Alyssa participated in a threesome with two guys during high school, which gave her the nickname \"Finger Cuffs\". Holden is deeply disturbed by this revelation, having believed that he is the first man Alyssa had ever slept with. Holden asks advice from Hooper who tells him that if he wants his relationship with Alyssa to work, he must be honest and truthful as to put whatever is bothering him behind him by being up front with her about it. The following evening, Holden angrily confronts Alyssa while attending a hockey game, after he clumsily attempts baiting her into confessing. During a tearful argument in the parking lot, she tells Holden about her \"many\" youthful sexual experimentations. She apologizes for letting him believe that he was the only man she had been with. However, she refuses to apologize for her past, and Holden leaves feeling angry and confused. Later, during lunch at a local diner with the local stoners and drug dealers Jay and Silent Bob (Jason Mewes and Kevin Smith), whom were the inspiration between for the Bluntman and Chronic comic book, Holden gives them their monthly residual pay for sales of the comic book. Here he confides in them about his troubled feelings and relationship with Alyssa. Speaking more than one line for the first time, Silent Bob reveals that he was once in a relationship \"a couple of years ago\" which was similar to Holden's. Despite the fact that he was in love with his girlfriend, Amy, his insecurities about her adventurous sexual past caused him to sabotage the relationship and leave her. Angry at himself for letting her go, he has \"spent every day since then chasing Amy... so to speak.\" Inspired by Silent Bob's story, Holden devises a half-baked plan to fix both his relationship with Alyssa and his fractured friendship with Banky. He invites them both over and tells Alyssa that he would like to get over her past and remain her boyfriend. He also tells Banky that he realizes that Banky is in love with him... kissing him passionately to prove the point. Holden suggests that the three of them should have sex with each other in a threesome to relive Alyssa's glory days. Though initially appalled, Banky agrees to participate. But Alyssa quickly refuses and explains to Holden that it will not save their relationship for she knows that he will always be insecure about her past. Before leaving, she states that she loves him, but she will not be his whore, slapping him across his face. Her past about who she was is over. Banky also leaves the apartment without saying a word, and summarily ends their friendship. One year later, both Banky and Holden are busy promoting their own respective comics at a convention in New York. It is revealed that Holden has dissolved their partnership over Bluntman and Chronic, leaving the viewer with the assumption that he sold the publishing and creative rights over to Banky (which is corroborated in the beginning of 'Jay and Silent Bob Strike Back'). Banky smiles sadly at seeing his old friend, who silently congratulates him for his success. Banky gestures over to a booth hosted by Alyssa, and provides wordless encouragement to Holden to go talk to her. He has a brief, quietly emotional conversation with Alyssa, and gives her a copy of 'Chasing Amy', his new comic based on their failed relationship. After Holden leaves, Alyssa's new girlfriend (Virginia Smith) arrives and asks who that was. A shaken Alyssa feigns indifference and replies, \"Oh, just some guy I knew.\"",
      "writers": ["Kevin Smith"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118842/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5ODMyMDY4NF5BMl5BanBnXkFtZTcwNDgwMDEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Affleck, Joey Lauren Adams, Ethan Suplee | See full cast and crew »"],
      "reviews": [
         "\"Chasing Amy\" is a clever and engaging urban love story that just exudes with Kevin Smith's gritty humour. The film's examination of sexuality, and everything involved with it, doesn't for one second sound untrue, even when it makes sure that everything being pointed out is expressed frankly and colourfully. It's not everyday we get a story of a heterosexual man falling in love with a homosexual woman, and although the concept could easily have resulted in a disaster of a movie, \"Chasing Amy\" manages to layer everything almost flawlessly. There are no predictable pitfalls in this film, and nothing is wrapped up in a neat little package. We are offered a group of characters that are likable but flawed, who don't always get, or give, what we would usually expect. I have to say, I never knew what was going to happen next, it manages to be consistenly offbeat without being unrealistic. Ben Affleck and Joey Lauren Adams have incredible chemistry together, perfectly displaying all the emotional complications a relationship as eccentric as theirs would have. Jason Lee was also outstanding in his role of the vaguely jealous best friend. The only thing that bothered me about this film was there was too much YELLING!! and it was slightly uneven at times. But generally I liked it a lot, and I'm just thankful that Kevin Smith is producing such fine work like this, it is truly a refreshing escape from Hollywood's formulaic sap.",
         "\"Chasing Amy\" has to be the best love story of 1997. It was emotional, gripping, funny, sad, heartwarming, and had some great jokes. How could anyone deny that this screenplay was anything less than original, or perfection. Absolutely intoxicating. The performances were right on and the writing was magnificent. Kevin Smith is, without a doubt, one of the best new writers. With this movie he goes to a whole new level. \"Clerks\" was great, and I think I'm one of the five people that enjoyed \"Mallrats\", but \"Chasing Amy\" takes the cake. Nothing else came even close that year. That movie should have made a star out of Joey Lauren Adams. She gave the BEST performance in 1997 and was robbed of an Oscar nomination, as was the script. The scene outside of the ice rink is more than enough to show just how good she was. And anyone who can watch that ending, the you don't know if you should cry or jump for joy ending, and not feel something, is heartless. The movie was great. It is one of my personal favorites, and will always be.",
         "My all-time favourite film! Kevin Smith creates such truly endearing, eccentric, quirky characters, and then manages to cast actors who seem destined to play their roles. Joey Lauren Adams steals the show (we need to see more of this brilliant gem!), and the Jason Lee / Ben Affleck dynamic is really powerful - all of the actors appear so natural and comfortable, and Jason Mewes is a gift from God (and that's coming from an athiest!). A beautifully written conversational comedy that very gently uncovers the hypocrisy surrounding gender relationships. This film goes way beyond the 'acceptance of sexual preference' cliche, and instead concentrates on the insecurities that all human beings are born with - gay or straight! Mr Smith, you are truly a genius!!!",
         "Miles away from his usual low level comedy, in Chasing Amy, Kevin Smith manages to deliver a great rom-com with some serious undertones. There are the standard Smith jokes throughout the film, but this time they take a backseat to the touching tale of Holden and Alyssa. I don't know quite how he did it, but Chasing Amy feels real and unpredictable. It's not some glossy Hugh Grant/Julia Roberts production, instead it's filled with characters that feel more like real people, which is a nice relief. The film manages to be both moving and funny, and the cast do their best work to date (Affleck and Adams at the hockey game must rank as one of my favourite scenes of all time). This may not be Smith's best known film, but it's definitely his best. [8/10]",
         "Love stories are difficult to do well. So is comedy. Kevin Smith does both. Very very well. Chasing Amy is, in my opinion Kevin Smith's best movie (Clerks 2nd, Dogma 3rd) and I really don't know where to start the praise. Traditionally, Hollywood romantic comedies are... well, bad. Really lame PG-13 comedy, with some catch phrase repeated ad nauseum, and always some sort of \"hilarious\" incident involving a baby or a cute dog. And the characters are just as annoying as the lame jokes, so ultimately, you don't really care about whether or not they get together in the end. Chasing Amy is different. These characters are lifelike.This isn't a romantic comedy for teenage girls. It's a movie for adults. Almost everyone can relate to being a situation where they've loved someone so much, but due to certain circumstances, you just weren't able to have that person. And I guess that's what Amy's all about. Unrequited love. Well, Unrequited love and sexual identity, but that's another topic for another day. The real genius of this film is that for all it's serious themes, it manages to convey it's message without being at all pretentious. Most independent films have this sort of, arrogant pretentious \"I'm so artistic\" feel about them.......And I hate that. Smith's success lies in the fact that his movies are meaningful, and they're actually funny as well. And Chasing Amy is no exception. In short, you'll be hard pressed to find a more entertaining, and realistic love story than Chasing Amy. It's combination of hilarious dialogue, interesting characters, and realistic themes makes it a winner.",
         "To me a film can have no action and no real special effects and still be great. If that film can take it's characters and make them interesting by making them speak the way we know people do, then you are left with a fantastic film. So is the case with Kevin Smith's wonderful film Chasing Amy. For anyone who thought that Ben Affleck couldn't act, watch this movie and enjoy how he plays Holden. He is honest in his approach to a character that is as complex as any great movie character. Also cast perfectly is Joey Lauren Adams as his girlfriend and Jason Lee is so good as Banky, his best friend and business partner that I really could have seen him with an Oscar nod that year. Kevin Smith's strength is that he knows how people talk and he is honest in his assessment of his characters. And that is what makes this film the gem that it is. And did I mention that it is a wonderful romance and it is wickedly funny? If all you've ever seen of Kevin Smith is Clerks, then check out this awesome flick. It certainly makes you appreciate how good Smith is at writing characters. A really great film. Note**** If anyone is a true fan of Jaws ( and I, like Smith think it is the greatest movie ever made ) then watch for the scene in Jaws where Hooper and Quint compare wounds to be parodied hilariously in this film.",
         "Chasing Amy is again a look into some strange people's lives. This movie strays a bit from the style of Kevin Smith's first two movies, in that the story seems to play a more important role in the movie. In the past the story was almost irrelevant to the hilariously entertaining dialogue. Not that this dialogue is not strange and entertaining as well, but the story does seem to dominate more. Although I enjoyed Clerks the most, I enjoyed this movie as well. Don't you love how Brian O'Halloran from Clerks (Dante) keeps popping up in all of Kevin Smith's movies!?",
         "Being a huge Kevin Smith fan, its no wonder I love this movie so much, it is one of the best movies I've ever seen. Its a close toss up for my favorite Smith movie, right next to Clerks. The Plot: Holden McNeil(Ben Affleck) and Banky Edwards(Jason Lee) are two long time best friends and the co-creators of their successful comic book Bluntman and Chronic. One day while they were pushing their comic at a comic/sci fi convention, they met a girl named Alyssa Jones. Holden immediately falls for Alyssa, but his hopes are shattered once he finds out a shocking surprise, she's a lesbian. Still, they form a great friendship which only makes Holden more in love with her. Once Holden reveals his love to Alyssa, they form what seems like a great relationship. Things change; however, once Banky fears that this friendship will affect their long friendship and Holden has to deal with Alyssa's rich past. The Good: This is a very well done movie. Kevin Smith is well known for his creative dialog and clever direction in all of his movies, this is no exception. The actors performances, especially those of Ben Affleck, Jason Lee, Joey Lauren Adams, and Dwight Ewell, is exceptional. You won't find better direction for this kind of movie. I normally don't like love stories but this is one of those rare exceptions. The Bad: Nothing really bad about this movie but its not for everyone. First off, the movie deals with some really touchy subject matter. Its also one of the most profane movies I've seen. If you are offended of either one of these subjects, I wouldn't recommend it. Overall: Chasing Amy is one of the best movies I've ever seen. I give it a 10/10!",
         "With his third film, Kevin Smith tried to do something new for him: a grown-up film. As loved as it may (deservedly) be, Clerks is remembered for the crude humor rather than the plot, while Mallrats, which was meant to be a smart, amusing teen movie, turned out to be little more than a vehicle for Jason Lee's comedic talent. Chasing Amy is radically different: combining Smith's trademark superb dialogue, believable characters and a heartfelt story, it is one of the best, most insightful romantic comedies of the '90s, and the director's most satisfying picture aside from Clerks I and II. Whereas his first two movies kept referencing other films as soon as there was time to do so, Chasing Amy centers on Smith's second great passion: comic-books. In fact, it all begins at a convention, where Banky Edwards (Jason Lee) and Holden MacNeil (Ben Affleck) are signing issues of their successful book Bluntman & Chronic. Afterwards, they hang out with fellow artists Hooper X (Dwight Ewell) and Alyssa Jones (Joey Lauren Adams), and while Banky spends all of his time arguing with Hooper over the racism in Star Wars (one of the funniest things Smith has ever written) or the gay subtext in Archie comics, something clicks between Holden and Alyssa, and soon enough they start seeing each other almost every day. It is obvious something deeper than friendship is in the air, and they both know it, yet there's a catch: Alyssa is a lesbian, or at least she used to be one before meeting Holden. Hence the big question: can they have a meaningful relationship with her past being such a huge burden? What kind of sacrifices will have to be made? In another film, the boy-loves-lesbian premise would have been an excuse to deliver a 90-minute marathon of distasteful, gratuitously explicit jokes. Chasing Amy, on the other hand, is good because it really cares for its characters and whatever crudities there may be never feel excessive or out of place, but on the contrary they manage to convey the speaker's emotions more correctly (this is particularly true for Jason Lee's foolproof, energetic performance). The central love story is honest and touching, two characteristics that are evident in the realistic dialogue and acting: Adams, who hasn't managed to find a decent role ever since, portrays Alyssa as a human being, not a stereotype, and that's what makes her scenes with Affleck, always at his best when working with Smith, compelling and almost painful to watch. Most of the time, Chasing Amy is a perfect balance between gross-out humor and tender romance, something the director kept toying with on the underrated Jersey Girl (where the jokes were less sweary than usual) and perfected with his masterpiece, Clerks II. There are, however, a few moments when Smith doesn't understand he has to stop and tells us everything about a certain character's personality, whereas he should simply have implied it. Overall, though, this feature remains one of the most hilarious, moving, revealing films of the '90s, with its best moment saved for the director himself: halfway through the movie, the mandatory Jay and Silent Bob (Jason Mewes and Smith) make their appearance. In all the other View Askew flicks, they are just incredibly funny. This time, Bob breaks his silence and gives a long, thoughtful speech that explains the film's title and has more to say about love and relationships than certain movies do in their entire running time. Astonishing. 8,5/10",
         "\"It's not who you love, it's how\" is a great tagline for the movie. Affleck's character cannot deal with Lauren's character's past and that's the main reason why they can't maintain a serious relationship. Silent Bob in a very important scene talks about \"Chasing Amy\" and that's when everything makes more sense. I'm not a big Kevin Smith fan but I have to admit that I liked this movie very much. There are some personal conflicts that not many movie-makers talk about; in this case, it's your partner's love past. Smith brings his own experience to the movie and it's told in an interesting manner. SCRIPT \"Chasing Amy\" has a clever fast-paced script filled with funny lines and intelligent discussions related to love relationships. The cast is surprisingly good. Creative script that works as a comedy, a drama, or a romantic comedy with Smith's personal touch. CAST Ben Affleck gives a totally believable performance as the lead male character; Joey Lauren Adams was simply great in her role, and what can I say about Jason Lee? He stole the show whenever he was on screen. Supporting characters like Jay and Silent Bob were a good addition and the movie asked for them. FUN FACTOR It's very high. The subplots are entertaining and the climatic scene involving the three main characters has great dialog. 7/10. Surprisingly good. Recommended for open minded people."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Too Askew Prod. Inc.",
         "View Askew Productions"
      ],
      "summaries": [
         "A pair of comic book authors named Holden McNeil and Banky Edwards, who live in New Jersey, have been best friends for 20 years. They spend their time working in their studio, and in the evenings they are going out. But their friendship is about to be disputed for the first time in their life, when a beautiful young lesbian woman named Alyssa Jones enters their life and Holden falls in love with her. Now Holden has to deal with Banky's jealousy, and with his new girlfriend's very rich past.",
         "Holden and Banky are two average guys who just need someone to bring out their hidden secrets. Enter Alyssa Jones and Hooper LaMont, two homosexuals who are slightly more experienced than the former two. Together, Hooper and Alyssa show Holden and Banky that being gay isn't as bad as they might think. Meanwhile, Holden develops an 'untainted' love for Alyssa, one which she finally sees in him as well, taking Holden on a journey through the complexities of love in the 90s.",
         "Holden and Banky are best friends and authors of a popular comic book called \"Bluntman and Chronic\". Holden falls in love with Alyssa, also a comic book artist, who happens to be a lesbian. Holden's new relationship with Alyssa strains his life-long friendship with Banky, and soon the relationship between Holden and Alyssa hits a wall due to Holden not being able to deal with her past.",
         "Holden and Banky are comic book artists. Everything's going good for them until they meet Alyssa, also a comic book artist. Holden falls for her, but his hopes are crushed when he finds out she's gay."
      ],
      "budget": 250000
   },
   "movielensId": 1639,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-04-04",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Kevin Smith"],
      "runtime": 113,
      "movieId": 1639,
      "title": "Chasing Amy",
      "mpaa": "R",
      "actors": [
         "Ben Affleck",
         "Joey Lauren Adams",
         "Jason Lee",
         "Dwight Ewell",
         "Jason Mewes",
         "Kevin Smith",
         "Ethan Suplee",
         "Scott Mosier",
         "Casey Affleck",
         "Matt Damon",
         "Brian O'Halloran",
         "Carmen Llywelyn",
         "Guinevere Turner",
         "Joe Quesada",
         "Illeana Douglas",
         "Welker White"
      ],
      "imdbMovieId": "0118842",
      "originalTitle": "Chasing Amy",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "EiATQ04pH14",
         "7K-z0EdVm2c"
      ],
      "plotSummary": "Holden and Banky are comic book artists. Everything is going good for them until they meet Alyssa, also a comic book artist. Holden falls for her, but his hopes are crushed when he finds out she's a lesbian.",
      "tmdbMovieId": 2255,
      "avgRating": 3.6062,
      "releaseYear": "1997",
      "numRatings": 16210,
      "posterPath": "/4vFJileWrCGaBeobCmF0tXpQCUb.jpg"
   }
}