{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz club",
            "id": 5823
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "private detective",
            "id": 155790
         },
         {
            "name": "film noir",
            "id": 195402
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0112857",
      "video": false,
      "title": "Devil in a Blue Dress",
      "recommendations": [
         31004,
         20676,
         46027,
         19143,
         16148,
         19380,
         9558,
         10684,
         9415,
         3515,
         22073,
         4639,
         18910,
         32077,
         66,
         12280,
         10858,
         10337,
         21878,
         14662
      ],
      "backdrop_path": "/slqA55Dx7qmO73kH2pAyF2HWi7W.jpg",
      "revenue": 16140822,
      "reviews": [{
         "author": "John Chard",
         "id": "564e62e99251414af9000cf5",
         "content": "Everyone was peeing on my head and telling me it's raining.\r\n\r\nDevil in a Blue Dress is written and directed by Carl Franklin, who adapts from the book written by Walter Mosley. It stars Denzel Washington, Tom Sizemore, Jennifer Beals, Don Cheadle and Maury Chaykin. Music is by Elmer Bernstein and cinematography by Tak Fujimoto.\r\n\r\nCarl Franklin had already laid down a considerable neo-noir marker with his searing 1992 thriller One False Move, here he goes more traditional but garners equally impressive results. Plot has Washington as a WW2 veteran who has lost his job and desperately needs money to keep hold of his pride and joy - his house. Taking on a job offered by shifty DeWitt Albright (Sizemore), to find a missing woman, Rawlings quickly finds himself in up to his neck in murder and deception, he must turn ace detective to save his skin.\r\n\r\nSet in late 1940s Los Angeles, what instantly stands out is the period detail. The clothes, the cars and the establishments frequented by Easy and company. With voice over narration also provided by Washington, in dry and sardonic tones, it's every inch a loving ode to the film noir movies released at the time the pic is set. There's plenty of neon signs about the place, some bad ass cops, good sex, brandy and sharp suits, smoking and coolness and of course a psychopath in the classic mould (Cheadle excellent).\r\n\r\nBut of course noir dressage is only that if you haven't got a good pot boiling plot, thankfully this has one. The story takes unexpected turns, always remaining interesting, the distinctive characterisations breathing heavy, managing to off set the run of the mill stereotypes in the supporting ranks. It can be argued that Beals as the titular femme fatale of the title is under written, but the character comes with an air of mystery that serves Franklin's atmosphere very well. Tech credits are high, something of a given with Bernstein and Fujimoto on the list, while Washington turns in another classy show of subtlety and believability.\r\n\r\nLovers of film noir should get much rewards from Devil in a Blue Dress. 7.5/10",
         "url": "https://www.themoviedb.org/review/564e62e99251414af9000cf5"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ezekiel 'Easy' Rawlins",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3e9f",
               "name": "Denzel Washington",
               "profile_path": "/semwsON3dN3np6cyzlCw7F2YDGe.jpg",
               "id": 5292,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "DeWitt Albright",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3ea3",
               "name": "Tom Sizemore",
               "profile_path": "/soINOuacuiThRb2LyPD4tTWve7C.jpg",
               "id": 3197,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Daphne Monet",
               "gender": 1,
               "credit_id": "52fe44aec3a36847f80a3ea7",
               "name": "Jennifer Beals",
               "profile_path": "/x3HHLQ7UVZDuSU5e2wZMQWEjrwl.jpg",
               "id": 3130,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mouse Alexander",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3eab",
               "name": "Don Cheadle",
               "profile_path": "/b1EVJWdFn7a75qVYJgwO87W2TJU.jpg",
               "id": 1896,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Matthew Terell",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3eaf",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Todd Carter",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3eb3",
               "name": "Terry Kinney",
               "profile_path": "/hv6CObyItPeEg5eJzzTb4L1j6DP.jpg",
               "id": 11067,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Joppy",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3eb7",
               "name": "Mel Winkler",
               "profile_path": null,
               "id": 35038,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Degan Odell",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3ebb",
               "name": "Albert Hall",
               "profile_path": "/yHGN2pIdBcBk19sAu0EchOxfYMY.jpg",
               "id": 8354,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Coretta James",
               "gender": 1,
               "credit_id": "52fe44aec3a36847f80a3ebf",
               "name": "Lisa Nicole Carson",
               "profile_path": "/tBSQsDwvA7G4hLzsHwE2wCi2Yzy.jpg",
               "id": 55274,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Dupree Brouchard",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3ec3",
               "name": "Jernard Burks",
               "profile_path": "/ipIZSXh9kKJFxW2IAVM7aHXiT5.jpg",
               "id": 55275,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Junior Fornay",
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3ec7",
               "name": "David Fonteno",
               "profile_path": "/kfuVHdttluE6KaSx0gOcSHudgCJ.jpg",
               "id": 55276,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44aec3a36847f80a3ecd",
               "name": "Carl Franklin",
               "profile_path": "/6jQitXVCxmsBYtBURZhTw2NaUg9.jpg",
               "id": 21712,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aec3a36847f80a3ed3",
               "name": "Carl Franklin",
               "profile_path": "/6jQitXVCxmsBYtBURZhTw2NaUg9.jpg",
               "id": 21712,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3ed9",
               "name": "Walter Mosley",
               "profile_path": null,
               "id": 56011,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3edf",
               "name": "Gary Goetzman",
               "profile_path": "/7uD9essxoWX745IbAbBvNidJeM7.jpg",
               "id": 27098,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3ee5",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a36847f80a3eeb",
               "name": "Tak Fujimoto",
               "profile_path": "/stUrxvmoFNrNLskc2oPhrOOeinB.jpg",
               "id": 16300,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44aec3a36847f80a3ef1",
               "name": "Carole Kravetz",
               "profile_path": null,
               "id": 21717,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44aec3a36847f80a3ef7",
               "name": "Jesse Beaton",
               "profile_path": "/j9drz3sbayEt7TR4ZisxzNLfyOk.jpg",
               "id": 21714,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.096822,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8512,
      "vote_count": 108,
      "budget": 27000000,
      "overview": "In late 1940s Los Angeles, Easy Rawlins is an unemployed black World War II veteran with few job prospects. At a bar, Easy meets DeWitt Albright, a mysterious white man looking for someone to investigate the disappearance of a missing white woman named Daphne Monet, who he suspects is hiding out in one of the city's black jazz clubs. Strapped for money and facing house payments, Easy takes the job, but soon finds himself in over his head.",
      "similar": [
         4771,
         281,
         984,
         1266,
         357096,
         18587,
         10651,
         910,
         15069,
         26390,
         12150,
         96,
         949,
         320,
         445954,
         9411,
         17494,
         963,
         2749,
         123109
      ],
      "original_title": "Devil in a Blue Dress",
      "runtime": 102,
      "poster_path": "/z0Boi5LktVxDMFnpyAqQEnYfPtM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mundy Lane Entertainment",
            "id": 2510,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Clinica Estetico",
            "id": 1274,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-15",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Private detective Easy Rawlins has been caught on the wrong side of the most dangerous secret in town.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Carl Franklin"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Walter Mosley",
         "Carl Franklin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112857/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNTA0ODIzOV5BMl5BanBnXkFtZTcwMzg2ODUxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Denzel Washington, Tom Sizemore, Jennifer Beals | See full cast and crew »"],
      "reviews": [
         "When Ezekiel `Easy' Rawlins loses his job he begins to worry how he'll make ends meet when DeWitt Albright offers him cash to help find Daphne Monet, the fiancée of politician Todd Carter. He takes the job as she is known to like Afro-Americans and will be easier for him to find. He gets information from a friend but is then framed for her murder. Stuck between the police and Albright's men, Easy has to uncover why Monet is so important to so many people and save himself from jail. Franklin's greatest achievement here is the way he brings the period to life, albeit with a certain amount of nostalgic love for the idea. The film has a great jazz soundtrack and a real sense of place and atmosphere to it. This supports the plot well and makes the film feel stronger and richer for it. The plot is a solid mystery that sees Easy pulled into a wider plot with the inevitable twists and turns. It is layered well without being too complex or difficult to follow, but neither does it allow itself to become too simplistic or easy. The film doesn't really play on racism or the race of Easy but it does make race an equal influence (with money, power and influence) on the plot and the characters. Washington plays Easy well, reacting well to things and being a good character. I don't know if it was ever planned that Easy would be a character than would allow for further adaptations, but I know I would like to have seen Washington take Easy further into his PI role. Sizemore is good in support, as are Kinney, Carson, Beals and Chaykin. The strongest support is given by Cheadle. His character may be extreme but he brings an energy to the film that it benefits from (although it didn't need it). The cast all ad to the rich feel of the plot and direction. Overall this is a solidly enjoyable detective story with all the twists and turns that you could expect from that genre. However it also benefits from a great sense of place and time that is all though the film \u0096 not merely painted on with sets or soundtrack. A class act from Washington and others just adds to the feeling of quality.",
         "To call this one of the most underrated films of the last ten years, is an understatement. This film is up there with \u0091Chinatown' and \u0091L.A Confidential. . Denzel Washington is cool, and smart. Don Cheadle is stand out as the cold killer with a smile, mouse. But the real praise must go to Carl Franklin, who proves that \u0091One false move' was not just a fluke As much as I liked the film 'L.A. Confidential' my problem with it was that a lot of black characters where being brutalised, without any chance to fight back. In this film they fight back. We have a black hero, someone who is as smart anyone else and in some cases smarter. I hope that one day someone will film the rest of the Easy' Rawlins books.",
         "This is the kind of film that can stay with you for awhile after you watch it: a haunting kind of film that isn't always pleasant or easy to understand but you remember it. It also helps to have a fondness for the 1940 film noir movies. It doesn't help that it appears racist in nature with people of one color all being the bad guys while people with another color all the good guys. I won't say which is which, but if the colors were reversed, there would have been an outcry about the obvious bias here by screenwriter-director Carl Franklin. Despite this, it's still a fascinating movie that just oozes with the 1940s atmosphere. Great narration in there, a la film noir, great automobiles and great sets. It puts you right into the late 40s in Los Angeles, a little bit like the film Chinatown. Denzel Washington does a nice job with the narration and the lead role, the character of \"Easy Rawlins,\" off the book by Walter Moseley (which I read and recommend). Tom Sizemore and Don Cheadle play very intense characters in supporting roles, particularly Cheadle as the trigger-happy \"Mouse.\" Jennifer Beals is alluring as the mysterious \"Daphne Monet.\" The film is a bit confusing in parts and was especially so for me since the book was not exactly the same and had a totally different ending. Nonetheless, the film has always fascinated me and drawn me back for multiple viewings. It's good storytelling and it would be fun to see more of Moseley's books translated to the big screen.",
         "Denzel Washington plays Easy Rawlins, a down-on-his-luck sometime machinist, sometime detective in late-1940's L.A. Seems someone wants him to find a mysterious white lady in a blue dress (Jennifer Beals)who's thought to have been seen in a blacks-only club. Enter Easy, who with his connections can get into the club and find the girl. But, of course, there's more to this plot than just that, or else it'd be a mighty short film. The atmosphere is a major asset here; director Carl Franklin has done a magnificent job not only of recreating the Los Angeles of the late forties but also of showing the story from the black perspective, a rarity in film. All the sights and sounds are there, and if you concentrate real hard you can even detect the smells, too. Washington's aces, of course, as usual; makes you wonder if he'll do any more adaptations of Walter Mosley books starring Easy Rawlins. He's aided by a very good supporting cast, including Beals and Tom Sizemore (playing a heavy, surprise surprise!). Fans of Washington should watch this, but really anyone who likes film noir will approve.",
         "I am glad I caught this film on TV; it was great entertainment and executed well. I don't want to ramble on too much, so here goes. The acting is great - Washington giving another good performance. His narration was suitably dry too. Cheadle just chewed on the scenery. He was hardly in the film, but when he was, his impact as Mouse was powerful. Elsewhere, Beals was good as the titular devil in the blue dress. Sizemore was good as the sleaze ball who hires Washington - yet he seems to good at playing these types in all his films. The aesthetic of the film was enticing. The smooth camera-work was mesmerising. The first shot that tracks through the busy streets and then cranes up through the window to Easy is so Hitchcock - or any director of film noir for that matter. The colours are beautiful too, from the orange skies in the day, to the hazy blues at night. The story is gripping, if a tad predictable. If you like your Sam Spade and your Marlowes this film will be fine for you. The ending where Washington closes in on a house in the hills is very 'Big Sleep'. Devil In A Blue Dress is unique in terms of perspective. The story is told from a black males view point and this makes the film very interesting to watch. No more all-white worlds of the 40's generation. This film shows both sides of the coin, and doesn't end up with a chip on both shoulders. The film may be a tad predictable, but this should not deter you. This film is underrated and deserves your attention. Very entertaining.",
         "Murder, politics, sex and scandal; and it is all about a girl in a blue dress. An out of work WWII vet(Denzel Washington)is trapped in a web of lies, backstabbing and flying lead when he agrees to look for a politician's girlfriend(Jennifer Beals). Some real good movie music by the likes of Memphis Slim, Duke Ellington, Roy Brown and Jimmy Witherspoon. Very apt support from:Tom Sizemore, Don Cheadle and Lisa Nicole Carson. One steamy sex scene scorches and redeems.",
         "Because Walter Mosley's stories are great and I was surprised that none of the other Easy Rawlins books have been filmed. A rich lode of ore , waiting to be mined. AND, Don Cheadle. His acting as \"Mouse\" is stunning. In the 3 or 4 Easy Rawlins books that I've read, the character constructions of Easy, Mouse, and their relationship, is fascinating. I read Devil in a Blue Dress before I saw the movie and when I saw Mouse brought to life, I could barely wait for the credits to roll--\"Who WAS that guy?\" Washington brings Easy to life too, and the recreation of Watts and L.A. in the late 40's/ early 50's is excellent (I was there). The movie wasn't great, but way above ordinary, and I'd love to see a reprise with Washington and Cheadle.",
         "Carl Franklin's adaptation of Walter Mosley's classic detective novel is a dark and funny tale of a detective with bad luck. Denzel Washington handles the material well. However, the star in the film is Don Cheadle as Mouse. This cold blooded killer steals several scenes away from Washington. The film also creates an accurate depiction of the racial climate in the late 40's. Issues of race and identity are displayed in the entire film. And Franklin does an incredible job of controlling the characters and narrative. An incredible film.",
         "If you are looking for a great crime film...this is the movie for you. It doesn't have all the complicated twists and turns of other movies such as \"The Usual Suspects\" but it still serves a movie that keeps your attention the old fashioned way, reveal a piece of information but don't tell all of it. Denzel does a good job and Don Cheadle gives a great performance as Mouse. I hope the rest of Walter Mosley's books become films because if this is any indication of how the rest will be made.",
         "I really enjoyed this screen adaption of the prolific Walter Moseley's first novel. Generally, it was nice to see a piece on this historic period focusing on blacks on the West Coast, as opposed to the usual settings of the South and NYC. Also, the racial issues were handled with enough restraint that I could watch it (i am generally too angered and upset by period pieces with racial issues to enjoy them). Denzel gives a great performance in a much better vehicle than the one for which he finally won a Best Actor Oscar. Jennifer Beals is also convincing, thought my knowledge of her real life biracial heritage sort of ruined her character's surprise revelation in the movie for me. Lisa Nicole Carson gives an effective albeit brief performance, but the show is definitely stolen by Don Cheadle as Mouse. (\"if you didnt want him killed why'd you leave him with me?\"). I had the pleasure of seeing him off Broadway in Top Dog Underdog, and i think that this film was his breakout role. Overall very enjoyable."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Clinica Estetico",
         "Mundy Lane Entertainment"
      ],
      "summaries": [
         "It is 1948 in LA and Ezikeal \"Easy\" Rawlins, an African-American World War II veteran, is looking for work. At his friend's bar, he is introduced to a white man, DeWitt Albright, who is looking for someone to help him find a missing white woman assumed to be hiding somewhere in LA's Black community. This woman, Daphane Monet, happens to be the fiancée of a wealthy \"blue blood,\" Todd Carter, who is currently the favorite in the city's mayoralty race. Daphane Monet is known to frequent the Black jazz clubs in LA. Easy, innocently, accepts Albright's offer; however, he quickly finds himself amidst murder, crooked cops, ruthless politicians, and brutalizing hoodlums. This is a Chandler-esque \"who-done-it\" with an African-American theme.",
         "An Afro-American man is hired to find a woman and gets mixed up in a murderous political scandal."
      ],
      "budget": 27000000
   },
   "movielensId": 164,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-15",
      "dvdReleaseDate": "1999-03-09",
      "directors": ["Carl Franklin"],
      "runtime": 102,
      "movieId": 164,
      "title": "Devil in a Blue Dress",
      "mpaa": "R",
      "actors": [
         "Denzel Washington",
         "Tom Sizemore",
         "Jennifer Beals",
         "Don Cheadle",
         "Maury Chaykin",
         "Terry Kinney",
         "Mel Winkler",
         "Albert Hall",
         "Lisa Nicole Carson",
         "Jernard Burks",
         "David Fonteno"
      ],
      "imdbMovieId": "0112857",
      "originalTitle": "Devil in a Blue Dress",
      "genres": [
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["50EVm04iPLk"],
      "plotSummary": "In late 1940s Los Angeles, Easy Rawlins is an unemployed black World War II veteran with few job prospects. At a bar, Easy meets DeWitt Albright, a mysterious white man looking for someone to investigate the disappearance of a missing white woman named Daphne Monet, who he suspects is hiding out in one of the city's black jazz clubs. Strapped for money and facing house payments, Easy takes the job, but soon finds himself in over his head.",
      "tmdbMovieId": 8512,
      "avgRating": 3.46053,
      "releaseYear": "1995",
      "numRatings": 4598,
      "posterPath": "/z0Boi5LktVxDMFnpyAqQEnYfPtM.jpg"
   }
}