{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "player",
            "id": 199050
         }
      ],
      "imdb_id": "tt0119326",
      "video": false,
      "title": "Def Jam's How to Be a Player",
      "recommendations": [
         22067,
         47816,
         16158,
         20322,
         58792,
         14809,
         28121,
         31654,
         19267,
         20682,
         41417,
         30593,
         39964,
         22314,
         21915
      ],
      "backdrop_path": "/cTlfAfK0LHtPd779STY0HGMMKgg.jpg",
      "revenue": 13960203,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Drayton Jackson",
               "gender": 2,
               "credit_id": "52fe458ec3a368484e06215f",
               "name": "Bill Bellamy",
               "profile_path": "/khQmLcjaaIgVQr5d91drXVnMhzF.jpg",
               "id": 77896,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe458ec3a368484e062163",
               "name": "Lark Voorhies",
               "profile_path": "/phOsvB1rzxlEHvNn0juvKVZbsLE.jpg",
               "id": 154341,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Buster",
               "gender": 2,
               "credit_id": "52fe458ec3a368484e062167",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nadine",
               "gender": 1,
               "credit_id": "52fe458ec3a368484e06216b",
               "name": "Elise Neal",
               "profile_path": "/6Z6LVIlaCVMWsRgOPFOA4NOXAQO.jpg",
               "id": 21215,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe458ec3a368484e062171",
               "name": "Lionel C. Martin",
               "profile_path": null,
               "id": 229097,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546bb70b9251412f50000785",
               "name": "Mark Brown",
               "profile_path": "/zlJ8ulAS24PrT5pEOz2X2XGaUub.jpg",
               "id": 66116,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.98009,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28353,
      "vote_count": 10,
      "budget": 0,
      "overview": "Dray is a young playboy whose only objective in life seems to be to have sex with as many girls as he can without getting caught by his girlfriend Lisa. Dray's sister Jenny and her friend Katrina plan to show him that the way he lives is wrong and organize a party in Malibu, inviting all of his girlfriends.",
      "similar": [
         19053,
         22705,
         179144,
         276,
         17899,
         80752,
         8363,
         979,
         23949,
         16980,
         9777,
         107811,
         86838,
         15037,
         17612,
         6075,
         122081,
         627,
         11801,
         10090
      ],
      "original_title": "How to Be a Player",
      "runtime": 93,
      "poster_path": "/dkASDMHYtMrzggoEKps9GQQ0v0N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Def Pictures",
            "id": 38799,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Island Pictures",
            "id": 3492,
            "origin_country": ""
         }
      ],
      "release_date": "1997-08-06",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lionel C. Martin"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Mark Brown",
         "Mark Brown"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119326/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxNzQ3MjcyMV5BMl5BanBnXkFtZTcwOTI4MTU1MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Bellamy, Natalie Desselle Reid, Lark Voorhies | See full cast and crew »"],
      "reviews": [
         "Anyone who thinks that this is not one of the best movies ever needs to seriously rethink their life. The acting was on point, the characters were well developed, and I certainly learned a thing or two about life. Life dose NOT get much better than this. I own two copies one on VHS and one on DVD so that way where ever I am I can watch this amazing flick. My favorite scene is the backyard barbecue.... the way the pimp of all pimps gives his advice is an aspiration to us all. I would suggest to anyone at all that you go and buy this amazing theatrical effort as soon as you possibly could. The very state of your life could depend on it.",
         "This move was fair because it was a story that featured over dramatic funny events. It also gave a insight how a guy was able to be a player. Some women like, Marie Marrow, aka Katrina, actually enjoyed men who were about game. I will admit there were parts in this movie that they could of cut out but one could easily figure out what was going to happen before the scene occurred. I would not suggest ever seeing this at a movie theater but this is a funny rental that I think one would get either by themselves or with good friends. I do not think this movie set African Americans back in anyway. This movie was a typical funny movie that was just over dramatizing relationships and situations.",
         "very funny, and very exciting. The movie \"How to Be a Player is one of the funnies movies I have ever seen. I really enjoyed watching this movie. It was extremely funny. I laughed throughout the entire movie. If you have not seen this movie, you must! \"How To Be a Player\" Had me rolling from beginning till the end.. Bernie Mac was Hilarious.. and the story was cute and thorough. Bill Bellamy and Natalie Desselle \"his Nosey sister were good as well. Yes I saw this movie years ago, I just upgraded from VHS to DVD. It's good to have it just brings back memories. danceability-1 Amsterdam Holland",
         "I happened to see part of How to be a Player last night when surfing the TV channels last night. I really couldn't believe it was on the air. Terrible acting,stupid dialog, boring script, everything was so bad! And the actors were so stereotyped and so predictable. There was absolutely no character development to say the least. About an hour later, I flipped past it once again and watched for about 3 minutes to see if it was still as bad as I had thought. It WAS! Whoever thought this would be a good movie was sadly mistaken. Amazingly, our new channel \"Bounce\" showed it back-to-back on Friday night. Why???",
         "OK, I remember watching this movie and yeah, it is silly, i didn't once think \"oh this is going to be ground breaking stuff\". You have to look at the audience the movie is targeted for. Fact is, there are people out there that are \"players\" and \"Haters\". You get a good picture of both in this movie. I thought the most interesting thing in this movies was how the main character was describing just how he was getting over on the ladies. Now i admit, in another life, some of the SAME stuff he was \"doing\", I did. So it cracked me up seeing it on a big screen for all to see. This one of those movies where you are with your buddies, having a few beers, and want to waste some time. I have seen BAD movies before, and trust me, this is far from being the worst.",
         "I just watched this movie again after seeing it many years ago, and it was just as funny as I remembered it being initially. This is one the best black comedies in recent years, it's very light hearted and not meant to be taken seriously (it's a comedy after all) Bill Bellamy & his friends are hilarious. This is definitely as must see for anyone wanting to see a good light hearted comedy that will make you laugh all the way through. The only movie in this genre that currently comes to mind that I liked better than \"How to be a Player\" is the original \"Friday\". To sum it up, see this movie if you like African American comedies, or light hearted comedies of any genre with no deep message & just a lot of adult oriented laughs.",
         "I've watched and enjoyed two other 'black' comedies(not to be confused with \"black comedies\"), The Wash and Booty Call. However, in the very first scene of this film, I found myself having a bad feeling about it(yes, that was a Star Wars reference)... I started to think this was going to be a dreadfully bad film. Sadly, my instinct turned out to be right. The plot is fair, but it's not very well-developed. The situations are instantly forgettable. The credits have just barely finished as I'm typing this, and I'm straining to remember any of it. The acting is not terribly short of perfectly atrocious. The characters are pretty thin, very nearly stereotypes(I know I say that a lot, but believe me, this time, I *really* mean that). The only way you can really distinguish between them(a task I found nearly impossible to accomplish throughout watching) is to note their extreme personas(which seem to be about all of them) and attach said attributes to their respective character names. Sorry, that was somewhat confusing, wasn't it? Not quite as confusing as trying to tell these caricatures, pardon, characters apart(rather alarming, really, considering how few there are). The film has a moral, or at least thinks it does. I did find some poetic justice in the film, but the majority of it just seemed forced, underdeveloped. Now, the main reason I borrowed this from a friend was that I read the plot... and personally, I cannot stand the thought of 'players' or 'playing'. I can think of few things that bother me more than disrespecting women. The idea of seeing such a 'player' be put in a situation where his 'game' stands to be exposed, in front of the poor girls that have fallen victim to him, no less... why, I found that to be potentially every bit as entertaining as watching Charlie Sheen(or his character on the show, it's quite difficult to tell them apart) get a taste of his own medicine in *that* episode of Two and a Half Men. Yes, schadenfreude. It's not nice, but neither is 'playing'. Whether or not the film contained just that, I shan't say. I wouldn't want to ruin whatever there is left of it for anyone who has yet to see it(and still intends to). Why is it, by the way, that a man being promiscuous is 'playing', whilst a woman doing the same is a slut? Personally, I find that to be a double-standard. Yes, women make an emotional connection to whomever they sleep with... but men have emotions too, despite many of us attempting to deny that fact. A few final thoughts... I very much enjoyed and appreciated the fate of one particular character, whom I found myself feeling sorry for throughout most of the film. Why *did* Bernie Mac attach his fairly big(star-status-wise, not 'number of letters'-wise) name to this film? And finally, the music in this was better than the film. I recommend this to fans of 'black' comedy, and it helps if you're big on gratuitous nudity and stereotypes(and for anyone wondering; yours truly is most definitely not. I belong solely in the first-mentioned category of that sentence). Could have been worse, but there's far most definitely room for improvement. 3/10",
         "This movie is really funny. I was laughing my butt off the whole time. See this movie. I would see it again there is no doubt about that.",
         "This movie is very nasty, but it still so funny. A movie about how a player is trying to teach a player while his sister is trying to catch his cheating tail. Very funny. You will be on the floor laughing. Just don't get a heart attack from doing it. Just kidding. This was just too funny.",
         "This film was a travesty for African-American films, it probably killed several deals for quality African-American films to get made. The only thing I can find good in it, was the beautiful actress Mari Morrow, who had nothing good to work with in the material. She is reduced to just a lovely piece of eye candy amongst the madness."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Def Pictures",
         "Island Pictures",
         "Outlaw Productions (I)"
      ],
      "summaries": [
         "Dray is a young playboy whose only objective in life seems to be to have sex with as many girls as he can without getting caught by his girlfriend Lisa. Dray's sister Jenny and her friend Katrina plan to show him that the way he lives is wrong and organize a party in Malibu, inviting all of his girlfriends.",
         "A playboy gets the tables turned on him when a party is arranged with all of the women he has been two-timing are in attendance."
      ],
      "budget": 0
   },
   "movielensId": 1640,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-06",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Lionel C. Martin"],
      "runtime": 93,
      "movieId": 1640,
      "title": "Def Jam's How to Be a Player",
      "mpaa": "",
      "actors": [
         "Bill Bellamy",
         "Lark Voorhies",
         "Bernie Mac",
         "Elise Neal"
      ],
      "imdbMovieId": "0119326",
      "originalTitle": "How to Be a Player",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["0vUXK0uBOL8"],
      "plotSummary": "Dray is a young playboy whose only objective in life seems to be to have sex with as many girls as he can without getting caught by his girlfriend Lisa. Dray's sister Jenny and her friend Katrina plan to show him that the way he lives is wrong and organize a party in Malibu, inviting all of his girlfriends.",
      "tmdbMovieId": 28353,
      "avgRating": 2.71376,
      "releaseYear": "1997",
      "numRatings": 545,
      "posterPath": "/dkASDMHYtMrzggoEKps9GQQ0v0N.jpg"
   }
}