{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "circus",
            "id": 291
         },
         {
            "name": "lion",
            "id": 2043
         },
         {
            "name": "eccentric",
            "id": 10483
         },
         {
            "name": "robot",
            "id": 14544
         }
      ],
      "imdb_id": "tt0119107",
      "video": false,
      "title": "Fast, Cheap & Out of Control",
      "recommendations": [
         85589,
         41480,
         14268,
         77621,
         26525,
         20967,
         28216,
         23001,
         133,
         56511,
         17447,
         32636,
         24998,
         911,
         18603
      ],
      "backdrop_path": "/uRTTxWaSnd7vGEA1foPUVDzHL2H.jpg",
      "revenue": 832735,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself (Wild Animal Trainer)",
               "gender": 0,
               "credit_id": "52fe44b7c3a368484e0330b1",
               "name": "Dave Hoover",
               "profile_path": null,
               "id": 93154,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Himself (Topiary Gardener)",
               "gender": 0,
               "credit_id": "52fe44b7c3a368484e0330b5",
               "name": "George Mendonça",
               "profile_path": null,
               "id": 93155,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself (Mole-Rat Specialist) (as Ray Mendez)",
               "gender": 0,
               "credit_id": "52fe44b8c3a368484e0330b9",
               "name": "Raymond A. Mendez",
               "profile_path": null,
               "id": 93156,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself - Robot Scientist",
               "gender": 0,
               "credit_id": "52fe44b8c3a368484e0330bd",
               "name": "Rodney Brooks",
               "profile_path": "/2jBe1xiBeBzmL8lRRLCUQOrYVY8.jpg",
               "id": 93157,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b8c3a368484e0330c3",
               "name": "Errol Morris",
               "profile_path": "/6ck4ws1yMg3oLlZmdONi8T35aSU.jpg",
               "id": 18533,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b8c3a368484e0330c9",
               "name": "Robert Richardson",
               "profile_path": "/9tLrDHL9qL9yYIhcJVaINwnzmWN.jpg",
               "id": 149,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b8c3a368484e0330cf",
               "name": "Caleb Sampson",
               "profile_path": null,
               "id": 93158,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b8c3a368484e0330d5",
               "name": "Lindsay Law",
               "profile_path": null,
               "id": 93159,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b8c3a368484e0330db",
               "name": "Mark Lipson",
               "profile_path": null,
               "id": 93160,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b8c3a368484e0330e1",
               "name": "Errol Morris",
               "profile_path": "/6ck4ws1yMg3oLlZmdONi8T35aSU.jpg",
               "id": 18533,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b8c3a368484e0330e7",
               "name": "Julia Sheehan",
               "profile_path": null,
               "id": 56078,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b8c3a368484e0330ed",
               "name": "Kathy Trustman",
               "profile_path": null,
               "id": 93161,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b8c3a368484e0330f3",
               "name": "Shondra Merrill",
               "profile_path": null,
               "id": 93162,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44b8c3a368484e0330f9",
               "name": "Karen Schmeer",
               "profile_path": null,
               "id": 73994,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.57626,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25099,
      "vote_count": 11,
      "budget": 0,
      "overview": "Hilarious, sad, absurd, eerie and beautiful, \"FAST, CHEAP &amp; OUT OF CONTROL\" is a film like no other. Starting as a darkly funny contemplation of the Sisyphus-like nature of human striving, it ultimately becomes a profoundly moving meditation on the very nature of existence.",
      "similar": [
         19959,
         605,
         19,
         2048,
         262543,
         157336,
         87101,
         39254,
         198184,
         11360,
         19995,
         2907,
         2454,
         2277,
         8587,
         9693,
         411,
         630,
         10527,
         11430
      ],
      "original_title": "Fast, Cheap & Out of Control",
      "runtime": 83,
      "poster_path": "/ieNPqF60S39Hji89t9VvwpNPC9c.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-10-03",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.sonypictures.com/classics/fastcheap/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Errol Morris"],
      "runtime": 80,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119107/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyMTQ4OTg3NF5BMl5BanBnXkFtZTcwNzE3NDIyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Dave Hoover, George Mendonça, Rodney Brooks | See full cast and crew »"],
      "reviews": [
         "Don't believe the folks who say this film is about the thin line between genius and madness. That may be part of it, but it's far from what's important here. The real loot here is FC&OOC's exploration of the \"other\", and our attempts to understand, shape and control it. Humans have a fascination with the nature of life and intelligence--whether it comes in the form of wild animals, plants in a garden or robots developing in a lab--and the ways we approach these things reveal as much about subject as object. This film does a beautiful job of highlighting the mystery inherent in living and/or intelligent things, evoking the awe we feel when we regard them, and the questions that arise when we attempt to study, cultivate, contain or \"tame\" them.",
         "In science, there is a property of any complex system, that more complexity and subtlety will result with each added component. This, in my opinion, was the subject of \"Fast, Cheap, and Out of Control.\" The parallels drawn between AI, societal mammals, commonality of life (the lion tamer) and art (topiary gardener) flesh out a world where the idea of \"God\" can well be reduced to a simple inherent property of existence. Mole rat societies are not so far from human societies; humans are not so different from animals; robots are not so different from animals; and each individual represents a unique degree of specialization that proves important to the greater society it exists in. I found this work elegant, subtle, and even-handed, not to mention completely unique in its structure and faith in the audience to decipher an individual meaning from the context provided. Each person interviewed is wholly engrossed in their craft, something for which no other human can be substituted, and that exuberance shines in their eyes. It's a strange ride that inspires wonder in trusting viewers, exactly the way that the experts' wonder has motivated their realization as truly unique humans.",
         "This was easily the best film of 1997. Morris has tried it all; one camera documentary, for Gates of Heaven; Rashomon tinged storytelling, with The Thin Blue Line; and now, finally, the beautiful and moving Fast, Cheap, and Out of Control. In the earlier films, the viewer's left with the task of sifting through lots of unedited information to put together his own story from what's been gathered, rather like Ed Wood going through rolls of archival footage to see if there's a movie there. In this one, Morris had a story to tell, and he goes after it with aplomb and purpose. His camera angles are ingenious, his use of slow motion masterful, and the story--that the personality traits that lead to success are the same, regardless of the stripe of the pursuit--comes along gently. Once the connection's been made, he overlaps the voice of one participant over the work of another, and the resonances between all of them become more and more apparent. Watching Morris come along as a filmmaker is a little like watching a favorite cousin come of age. This movie makes you want to cheer, not only for Morris, but for the cast of misfits he's put on film who've taken their lives and made something of them. These four men are workers. They're not managers, not victims of dumb luck. They're doing these jobs because they love them, and because they love them and work without pause, they've become successful. They're not geniuses. Like Morris, they've merely managed to focus. Morris shows us what a rare thing that is. Bravo.",
         "Encapsulated reviews are misleading. I had several times bypassed \"Fast, Cheap and Out of Control\" on IFC for more lively sounding fare on movie channels. When I finally selected it as the least boring of an afternoon's TV movie offerings, I regretted not having picked it sooner and seen it more often. This documentary delighted me! Interviews were enhanced by display of the works of four brilliant practitioners, fanatical about the unusual focus of their work or study. We are introduced to naked mole rats, robots as the next stage in evolution, wild animal training and a visionary handicrafter/topiary designer. Each professional provided unusual insights to their efforts and perhaps to our own natures as human beings. The documentary seemed designed to hold even those with the even shortest of attention spans. Rather than engaging each subject in depth as a single segment, the interviews are presented in approximately one minute scenarios, often with a montage of old film footage relating connections and historical ideas about some of the subject matter. Just as a viewer's mind might start to drift during a segment, it collides with the next subject, often forcing mental connections that may not have come naturally. After watching this one, I felt compelled to find and view the other productions of Errol Morris, and I shall keep an eye out for his future works. I believe that its audience should comprise anyone with a spark of interest in the world around them and the desire to be entertained. Whether you are fond of documentaries or not, I think this one will offer a pleasant and quickly passing ninety minutes. Gene Romero gromero001@aol.com",
         "This movie is a work of genius. It asks as well of answers to some degree most major questions of life as we know it (and don't know it) all through interviews and visual juxtapositions. The real-life people are astoundingly interesting and passionate and when Errol distorts our minds using subjective imagery such as old 40's films and intercutting between interviews to enhance its meaning, he conjures welcome associations of human nature. No one can sculpt the documentary form as brilliantly as this man.",
         "I was amazed at how Errol Morris abstractly tied together four people with such contrasting occupations. I was skeptical before seeing the film--after all, how on earth would anyone relate a lion tamer, topiary gardener, mole rat specialist and robot expert--but Morris pulls it off excellently. The ties between certain details of each interview either tie visually or conceptually with one of the other interviewees, and the beauty is in the way the ideas are strung together. The quirky soundtrack is fantastic, giving a twist to circus music that carries the mood of the film, as well as help Morris to make serious comments about life. At any rate, this is a very enjoyable documentary, even to those who strongly dislike documentaries.",
         "Hiding within this movie are four fairly interesting mini-documentaries about four men, each with a vision - perhaps even an obsession - about one particular facet of life. The common thread uniting them is that each of the four is fascinated by the ways in which animals, men, plants, and even machines evolve, learn, and grow. A recurring theme is training or control. Unfortunately, these four interesting stories are chopped up and interwoven in ways that often seem arbitrary and pointless. Plus, about 25% of the movie is made up of clips from other, mostly bad, movies... and the soundtrack music is often intrusive and annoying. So I'm mystified why a number of critics thought this was the best documentary of 1997. Maybe there were just a lot of bad documentaries that year! Worth watching if you have nothing else to do, but nowhere near great.",
         "It's amazing how one film can warrant such diverse audience opinion about \"what it all means\". That which I took away from this movie is a concept of God's existence that is nothing short of genius. I'm not saying that this is the director's intention...it's only what I took from it. Four Gods absorbed completely and differently in their four worlds: 1. Artistic God - the gardener - the God who spends his days creating the world for man to live in. \"This is my world. I don't care how you live in it, but don't mess it up.\" Because man has freewill, God is uninvolved in man's evolution. 2. The Bully God - the lion tamer - the God who rules the world with discipline. \"This is my world. Do as I say and nobody gets hurt.\" God won't let man evolve out of fear of losing physical superiority. 3. The Control Freak God - the mole rat scientist - the God who controls man's life. \"This is my world. Live in it, but I will observe, limit, and dictate what you do.\" God won't let man evolve out of fear of losing mental superiority. 4. The Free Thinking God - the robotics engineer - the God who aids and improves man's life with only one commandment/program...respect. \"This is our world. We share it. Live in it as you please. I am not expecting you to be perfect. All I am asking for is that you treat each other with mutual respect.\" Together, we evolve into our creation. This is the God which I prefer.",
         "This makes the third Errol Morris movie I've seen, and I'm increasingly not liking his style. He seems to find very interesting and varied characters, great personalities to create documentaries for, and then with tongue-in-cheek editing make fun of everything they are about. It's never really a direct caricaturation of them and Morris seems most of the time to be saying, \"But no, no, these people are really fascinating, really!\", but there's always these subtle little canted angles and not-so-subtle editing techniques that show that Morris seems to be mocking them behind their back. This movie tracks four people who break the traditional boundaries of organic separation... a man who studies African hairless molerats to find that they are amazingly ant-like, a lion tamer, a man who keeps a garden full of animal-shaped shrubbery, and a robot designer. The general theme of the film seems to revolve around the question of what designates animal, human, and life features? So the title of Fast, Cheap, & Out of Control doesn't really seem to mean anything in terms of the movie... right? Except of course Morris seems just a little disturbed by these individuals' passions (he might call them \"obsessions\") making synthetic designs on life. I share not that fear and honestly don't appreciate some of the connections Morris makes in the film. But I stress his subtlety. With no voice-over narration and leaving the words entirely to the interviewees, it's not as if Morris ever pounds that anxiety onto the spectators' collective head. Instead he mixes circus footage and ant footage together often at times when they're taken out of the context of the circus and the ants, showing a sort of collective absurdity behind what all of these people are talking about. I don't find them absurd, I find them all very neat and interesting individuals. Unless, of course, he didn't intend such juxtapositions, which means he's just a bad craftsman instead of a silent subverter. Considering none of this films I've seen so far have particularly impressed me, I don't really care to find out what he's trying to do. --PolarisDiB",
         "I saw this film and loved it, though it was hard to gain the proper sense of perspective, as I know Dave (the lion tamer). However, it's interesting to note that Errol Morris is not nearly so controlling or manipulative as some viewers seem to think. He doesn't have to stretch the subject matter to try and make connections... he just lightly played the characters, and they all start to sound the same after a point. Anecdotal evidence? The obssessive robot scientist, after the making of the film, apparently decided the end of the world was coming, and holed up in his laboratory building his robot army (this is of course a rumor, from the lion tamer). In any event, he wouldn't come to any photo shoots after the release, so the other three men posed with a cardboard cutout of him... check the art and you might be able to tell."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "American Playhouse",
         "Fourth Floor Pictures"
      ],
      "summaries": ["What do an elderly topiary gardener, a retired lion tamer, a man fascinated by mole rats, and a cutting-edge robotics designer have in common? Both nothing and everything in this unconventional documentary directed by Erroll Morris. Fast, Cheap & Out of Control (Referring to the robot specialist's strange philosophy of robot design structure, not Erroll Morris's documentary techniques!) interplays, overlaps, and interrelates these four separate and highly specialized documentary subjects in order to in truth study all of humanity, raising questions about the future of mankind."],
      "budget": 0
   },
   "movielensId": 1649,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-03",
      "dvdReleaseDate": "2002-09-24",
      "directors": ["Errol Morris"],
      "runtime": 83,
      "movieId": 1649,
      "title": "Fast, Cheap & Out of Control",
      "mpaa": "",
      "actors": [
         "Dave Hoover",
         "George Mendonça",
         "Raymond A. Mendez",
         "Rodney Brooks"
      ],
      "imdbMovieId": "0119107",
      "originalTitle": "Fast, Cheap & Out of Control",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["wFukiQOvDYs"],
      "plotSummary": "Hilarious, sad, absurd, eerie and beautiful, \"FAST, CHEAP &amp; OUT OF CONTROL\" is a film like no other. Starting as a darkly funny contemplation of the Sisyphus-like nature of human striving, it ultimately becomes a profoundly moving meditation on the very nature of existence.",
      "tmdbMovieId": 25099,
      "avgRating": 3.86667,
      "releaseYear": "1997",
      "numRatings": 1530,
      "posterPath": "/ieNPqF60S39Hji89t9VvwpNPC9c.jpg"
   }
}