{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "interview",
            "id": 4434
         },
         {
            "name": "tribute",
            "id": 6964
         },
         {
            "name": "rock music",
            "id": 11700
         },
         {
            "name": "rock band",
            "id": 18001
         },
         {
            "name": "neil young",
            "id": 156204
         },
         {
            "name": "concert film",
            "id": 156205
         }
      ],
      "imdb_id": "tt0120539",
      "video": false,
      "title": "Neil Young & Crazy Horse: Year of the Horse",
      "recommendations": [],
      "backdrop_path": "/tP6IJgUfrsybWFgQsFurkazGVKt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe467dc3a368484e0936ab",
               "name": "Neil Young",
               "profile_path": "/a16W37yjeFIH2tyg5xokN49075F.jpg",
               "id": 15425,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe467dc3a368484e0936af",
               "name": "Frank Sampedo",
               "profile_path": null,
               "id": 235284,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe467dc3a368484e0936b3",
               "name": "Billy Talbot",
               "profile_path": "/4eCLVGE7OKEs2LFLQzHsVIQEKat.jpg",
               "id": 235287,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe467dc3a368484e0936b7",
               "name": "Ralph Molina",
               "profile_path": "/1S3mNrVR17s2t9fadq1gw5YsAFL.jpg",
               "id": 235288,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe467dc3a368484e0936a7",
            "name": "Jim Jarmusch",
            "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
            "id": 4429,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.258835,
      "production_countries": [],
      "id": 62422,
      "vote_count": 4,
      "budget": 0,
      "overview": "Indie director Jim Jarmusch lenses a low-tech tribute to protean rocker Neil Young and his long-standing band, Crazy Horse. Stitched together from archival material shot in 1976 and 1986 along with candid scenes of Young and the band kicking back between shows, this rockumentary is as ragged as it is direct. Concert performances include renditions of hits such as \"Sedan Delivery\" and \"Like a Hurricane.\"",
      "similar": [
         80009,
         34490,
         31736,
         143557,
         20575,
         404736,
         67675,
         404724,
         373558,
         81167,
         513473,
         328037,
         36802,
         31802,
         72744,
         30192,
         74406,
         274722,
         404575,
         20556
      ],
      "original_title": "Neil Young & Crazy Horse: Year of the Horse",
      "runtime": 106,
      "poster_path": "/3zlD32BjQhJszGXRsZJD3POshk5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-10-08",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jim Jarmusch"],
      "runtime": 106,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120539/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxOTE0OTYxMV5BMl5BanBnXkFtZTcwMDQ4MTU1MQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Neil Young, Jim Jarmusch, Ralph Molina | See full cast and crew »"],
      "reviews": [
         "I wouldn't say that Year of the Horse, director Jim Jarmusch's only documentary, is one of the all-time great rock-docs (i.e. Woodstock, Last Waltz, Pink Floyd Live at Pompeii), but it does have many good things going for it, not the least of which the performances. Although some of the interview footage goes into some lulls and conventions (i.e. 'deep' explanations of how the band works, the fights, the self-conscious attitude of being in a film trying to capture 25 years in 2 hours), it's not as boring as I would've expected from the interviews. Some people have said this is like a Spinal Tap film that takes itself too seriously, and I can see where that criticism could stand. However, Jarmusch has a lot of pride in his experimental style, shooting only with 16mm & 8mm, mostly grainy or home-video style. The results are something of a very personal view into Young and his Crazy Horse people, some of whom seem to be more 'there' than others. A couple of segments though, like when Jarmusch reads from the bible to Young, or vintage footage of Scottish views on the band/shenanigans with the band in a hotel room, are quite entertaining on their own. But for those looking for just the music instead of the interviews or talk, the film may or may not meet your expectations, depending on how much of a Neil Young fan &/or Neil Young & Crazy Horse fan you are. If you're of the latter, it's probably a must-see, with songs like \"F***in' up\", \"Slips Away\", \"Tonight's the Night\", and a couple of songs I've just plain never heard of before seeing the film. There's also the finale, with a half retro Young and present-day (1996 present day) performance of \"Like a Hurricane\", which will probably be the highlight for those who only are familiar with the hits of Neil Young, or for anyone. The best thing that I can say about the performances, as a little more than a casual observer/listener to Young/Crazy Horse's music, is that there is always this uncommon energy between all the players in the band. Even if what they're singing is loud or distorted or \"grunge\", they are having fun on stage, and the camaraderie is an enjoyable part of the performances. Jarmusch's style with these scenes ranges from wild and cool, to a step or two away from being a little pretentious or, worse, MTV style editing. Most of the time though, his vision works for the material, and in the end what we get is more of a glimpse at what Young & Crazy Horse are all about- a pure form of rock & roll, harder than the solo Young stuff if not as hard as the rockers of today, and its definitely not of the 'corporate' product pool. B+",
         "Granted, non-fans of Neil Young will not like this film, but as one of his biggest fans (I have over 35 CDs of his music, solo and with CSN, Buffalo Springfield and others), I loved this film. Many people were put off by the grain of the Super 8 sequences, but I think that visual scheme ADDS to the mood and feel of his music. I also liked the varied song list. Not only does he play songs from his most recent album of the time (Broken Arrow, an OK, but not great album) but he revisits his classics (Tonight's the Night, Barstool Blues, Like A Hurricane). It's a great sampler. I also liked the weird humor that Young and Crazy Horse infuse into the documentary sequences. Many people were understandably turned off by this (including my mother and she LIKES Neil's music!)but I thought of it as in the Frank Zappa-vein of bizarre personal humor that only a handful of people fully get. NOTE: If you buy this film, purchase the Canadian import version. It is presented in widescreen format (1.77:1 not 1.66:1 as listed in technical specs) The USA Films release is panned and scanned and believe me Jarmusch makes the most of the frame, no matter how small it is)It costs more, but believe me, it's worth the extra money!",
         "I DO like Neil Young and Crazy Horse, yet I felt Neil's simplistic guitar solos took up more screen-time than I would have liked. That is my only reservation. Jarmusch' good-natured approach and sympathetic questions makes this watchable and revealing. Neil's father obviously has great respect for his son. And Frank Sampedro's cynical retorts were very funny! More to the point - \"Like a hurricane\" still sounds like a rock classic.",
         "This film is a great documentary, i was not a fan of Neil young but was won over by this kooky depiction of Young's band crazy horse, Great music interesting people, the real life subjects of this movie resemble Jarmusch's loveable offbeat fictional charicters. A good Friday night film watch it",
         "Ive seen about 3 other documentaries on Neil Young,but this one is the most interesting.Not just a typical concert film....but an overview of Crazy Horse.Some of the concert footage was a little long though.I am a big Neil Young fan and if you are also,you will like this movie.The best Crazy Horse movie is still Rust Never Sleeps ,though.",
         "Year of the Horse (1997) ** (out of 4) I can respect what Jim Jarmusch was going for. I mean, it's clear that the ugliness of this film was done on purpose but just because you respect someone for trying something different doesn't mean you have to be entertained by it. This documentary, the director's only to date, takes a look at Neil Young and Crazy Horse's 1996 tour with interviews with those involved as they discuss the history of the group. This includes a rather rocky road in the 1970s and various re-gatherings leading up to the '96 tour. Right from the start in big bold letters we're told about the 8mm, 16mm and various other formats used to create this film but whatever they were going for must have gotten lost in the mix because the end result is a pretty ugly film to look at and listen to. I understand the visuals of the film were probably meant to capture the mood and spirit of the music but by filming this way they've also delivered some rather ugly audio. I've heard a lot of people get upset over the selection of songs but as I've grown as a Young fan I've realized that he does what he wants and that includes releasing something with not too many hits. I didn't mind the song selection as the performances were quite good but sadly I thought the actual audio quality didn't do them justice. There was an interesting take on \"Tonight's the Night\" and a clever mix between an old and new performance of \"Like a Hurricane\" that was very good. With that said, the ugliness of the film also has some pretty boring interviews where Young and the band just keep talking and talking and quite often it's about a rather uninteresting subject. There's no question that Young die hards will want to check this out but others should probably avoid it.",
         "The point of this film is to catch the essence of Neil Young & Crazy Horse's strange sound. Their sound is interesting because it is based on pure emotions (according to Neil Young), and not so much on technical skills (if you listen to drummer Ralph Molina he plays like a 10-year old). This film should therefore appeal to anyone who's interested in music. In addition to that, in contains fantastic live performance by one of the truly great rock bands. Why this film is good? It IS the essence of Crazy Horse - it is lo-fi, filmed with a shaky 8mm camera (but the sound is okay). It's trashy American feeling with the random interviews (like when guitarist \"Poncho\" questions why Jarmusch is doing this film) and all the on-the-road footage is also contributing to explaining how they work as a band, and therefore why the sound like they do. This film reflects the trashiness of Crazy Horse.",
         "Felt obliged to write a review as none of the reviews posted so far seem to have been from people who saw this at the cinema. I was lucky enough to catch this in 97 at a film festival and the memory of it still lingers. The talking heads interviews are unmemorable, but the live concert footage is incredible. It's some of the rawest, most powerful and yet subtly controlled rock music to have ever been captured. I's also nice to see some essentially middle-aged guys rock out big time. It's hypnotic and savage, and every time Neil hits his custom big red box and kicks into a solo you can feel the passion oozing from the man. If you want something polished you'd be better of with some Pet Shop Boy's videos, but if you're after authentic blood, sweat and tears take a chance on this. And for god's sake either turn it up very loud or better still put some cans on and get the full effect.",
         "Jim Jarmusch (Broken Flowers, Ghost Dog: The Way of the Samurai) directed this documentary (his only one) of Neil Young and Crazy Horse's 1996 concert tour. Jarmusch's grainy, home-movie style make this a very interesting film as we look into the background of the band. Ten songs including \"F*ckin' up\", \"Slips Away\", and \"Tonight's the Night\". The only complaint I had about the music was Neil Young's guitar solos. They seemed to go on forever. This movie is really for Neil Young fans. 20+ years of music history in a couple of hours.",
         "If you're a Neil Young fan, you will love this movie. The music is outstanding, almost mind-altering in it's depth and beauty. Yes, I call it beautiful even though it's raw and riotous, even though it's crude and vulgar, even though it sometimes feels like the harrowing of hell, it's beautiful music. Young's music is incomparable and his live performance shows you what an artist looks like when he's under the influence of his muse. He gives a succinct insight into his vision of true rock music: it never gets comfortable, it never gets tame, it never gets easy. Neil Young is in a class with Bob Dylan and Keith Jarrett: artists completely dedicated to their work. I highly recommend this movie. Jarmusch does an incredible job of combining 3 decades worth of footage into this 1996 tour. The interview with Jim Jarmusch and Young is very interesting: two artists talking about what they do."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": ["Shakey Pictures"],
      "summaries": ["This film documents Neil Young and Crazy Horse's 1996 concert tour. Jim Jarmusch interviews the band about their long history, and we see backstage footage from the 1970s and 1980s."],
      "budget": 0
   },
   "movielensId": 1652,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-08",
      "dvdReleaseDate": null,
      "directors": ["Jim Jarmusch"],
      "runtime": 106,
      "movieId": 1652,
      "title": "Year of the Horse",
      "mpaa": "R",
      "actors": [
         "Neil Young",
         "Frank Sampedo",
         "Billy Talbot",
         "Ralph Molina"
      ],
      "imdbMovieId": "0120539",
      "originalTitle": "Year of the Horse",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["CoJicHPkPa8"],
      "plotSummary": "Indie director Jim Jarmusch lenses a low-tech tribute to protean rocker Neil Young and his long-standing band, Crazy Horse. Stitched together from archival material shot in 1976 and 1986 along with candid scenes of Young and the band kicking back between shows, this rockumentary is as ragged as it is direct. Concert performances include renditions of hits such as \"Sedan Delivery\" and \"Like a Hurricane.\"",
      "tmdbMovieId": 62422,
      "avgRating": 3.01099,
      "releaseYear": "1997",
      "numRatings": 91,
      "posterPath": "/np95YMmxTJRBcaAXa4TYzcwwNw5.jpg"
   }
}