{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "underdog",
            "id": 240
         },
         {
            "name": "sea",
            "id": 658
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "wales",
            "id": 1209
         },
         {
            "name": "ukraine",
            "id": 1738
         },
         {
            "name": "strangeness",
            "id": 1942
         },
         {
            "name": "shipwreck",
            "id": 2580
         },
         {
            "name": "doctor",
            "id": 13005
         },
         {
            "name": "xenophobia",
            "id": 160910
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "strange person",
            "id": 198141
         }
      ],
      "imdb_id": "tt0120257",
      "video": false,
      "title": "Swept from the Sea",
      "recommendations": [
         33695,
         73336,
         28284,
         144060,
         36790,
         53882,
         241432,
         249391,
         38986,
         90130,
         16405,
         3288,
         2348,
         19965,
         263091,
         24811,
         67216,
         86531,
         48375,
         31605
      ],
      "backdrop_path": "/e2lutMkcmaQHBABhLIBmneSyT7H.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Amy Foster",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e15b",
               "name": "Rachel Weisz",
               "profile_path": "/3QbFXeiUzXUVUrJ7fdiCn7A7ReW.jpg",
               "id": 3293,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Yanko",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e15f",
               "name": "Vincent Pérez",
               "profile_path": "/elPFKCVOZyMni2hx7mLlaYkyifD.jpg",
               "id": 20239,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Dr. James Kennedy",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e163",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Miss Swaffer",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e167",
               "name": "Kathy Bates",
               "profile_path": "/pwHCkfIBeDdz93RlcmDWqXefozi.jpg",
               "id": 8534,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mr. Swaffer",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e16b",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mary Foster",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e16f",
               "name": "Zoë Wanamaker",
               "profile_path": "/6R8oHxB9aQj7DjaBgrb4sO9SJJg.jpg",
               "id": 20240,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mr. Smith",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e173",
               "name": "Tony Haygarth",
               "profile_path": "/4CGR3JgdJCndVQ9vhH4rQhudczG.jpg",
               "id": 20241,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mrs. Smith",
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e177",
               "name": "Fiona Victory",
               "profile_path": null,
               "id": 20242,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Canon Van Stone",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e17b",
               "name": "Roger Ashton-Griffiths",
               "profile_path": "/3lvWs4Kz0aATpcSY7PyPhkKgH6W.jpg",
               "id": 20243,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Mr. Wilcox",
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e17f",
               "name": "William Scott-Masson",
               "profile_path": null,
               "id": 20244,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Mrs. Wilcox",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e183",
               "name": "Eve Matheson",
               "profile_path": "/aMv7dIAS3lcbiKOwHVF2O6CV1tm.jpg",
               "id": 20245,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Jack Vincent",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e187",
               "name": "Dave Hill",
               "profile_path": "/qalzexKrnsI7LEMfzB2R0BJDzLW.jpg",
               "id": 20246,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Isaac Foster",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e1a3",
               "name": "Tom Bell",
               "profile_path": "/ylBV5ZVw7GiPRqKu2gpqH3UbL8J.jpg",
               "id": 22169,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e14b",
               "name": "Beeban Kidron",
               "profile_path": null,
               "id": 20237,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e151",
               "name": "Joseph Conrad",
               "profile_path": "/e9K1LVshKNQUziyAgSrB3uCjMOZ.jpg",
               "id": 8327,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e157",
               "name": "Tim Willocks",
               "profile_path": null,
               "id": 20238,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e18d",
               "name": "Beeban Kidron",
               "profile_path": null,
               "id": 20237,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e193",
               "name": "Charles Steel",
               "profile_path": "/wcScRXif1Qk8qfRweNeOp4KzE99.jpg",
               "id": 20247,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e199",
               "name": "Polly Tapson",
               "profile_path": null,
               "id": 20248,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e19f",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.321187,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 1959,
      "vote_count": 18,
      "budget": 0,
      "overview": "The film tells the story of Russian emigree and the only survivor from ship crash Yanko Goorall and servant Amy Foster in the end of 19th century. When Yanko enters a farm sick and hungry after the shipwreck, everyone is afraid of him, except for Amy, who is very kind and helps him. Soon he becomes like a son for Dr. James Kennedy and romance between Yanko and Amy follows.",
      "similar": [
         1986,
         858,
         334,
         40807,
         205775,
         319,
         634,
         2288,
         242224,
         5123,
         425,
         437557,
         1607,
         10956,
         1365,
         880,
         10488,
         9587,
         10054,
         7459
      ],
      "original_title": "Swept from the Sea",
      "runtime": 113,
      "poster_path": "/24CGT6BDh5TjaoxfUdeAg36NhBA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tapson Steel Films Productions",
         "id": 820,
         "origin_country": ""
      }],
      "release_date": "1998-01-23",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Beeban Kidron"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Joseph Conrad",
         "Tim Willocks"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120257/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMzA2MTAwOV5BMl5BanBnXkFtZTcwMTQ3MzAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rachel Weisz, Vincent Perez, Ian McKellen | See full cast and crew »"],
      "reviews": [
         "The British have dedicated themselves lately to film their wonderful 19th century novels: Jane Austen, Thomas Hardy, and have come now into the 20th for a Joseph Conrad short story with a strong 19th century flavor. It's their answer to the special effects-oriented Hollywood film. And they are catering to the older audiences, those who care more for story values and literary qualities than for the display of technical advances in films. Any one who cared for Sense and Sensibility, The Return of the Native and Persuasion, will have a real feast in Swept from the Sea. The Conrad story is beautiful, and the adaptation is intelligent. A memorable musical score by John Barry, the breathtaking photography and the magnificent scenery are real assets for those who pursue an esthetic experience in the movies. Old fashioned? Perhaps. But the emotional experience is second only to that of Wuthering Heights, which it resembles in certain secondary aspects. Forget the unfavorable reviews you may have read, practically all of them oriented toward teenagers. Swept from the Sea is a film for mature audiences.",
         "Konrad Korzeniowski at age 15 ran away from his native Poland to seek fortune in the world - the same as Yanko Gooral in this film - and fetched up at Marseilles. There he signed on as crewman on a merchant vessel and spent the next 15 years sailing the seven seas. At 30 years of age he landed in London and decided to settle. He married and began writing novels - in English. Now, what kind of English he learnt aboard merchant sailing ships late in the 19th Century might well be imagined: Greeks, Italians, Chinese, Filipinos, Indians, Galicians......... However, his novels are among the greatest literary achievements in literature in the English language. His first novel near 1900, but as he had not been schooled in the Victorian style, his narrative was entirely different. Basing himself on his own experiences roaming the wild and wide seas, where he even went through a shipwreck, his novels were on the one hand resounding novels of adventure, if not of the swashbuckler type, but backed up by that deeply rooted Russian philosophical sense of feelings and human emotions. His novels are not simply `yarns' as such; nor are they simply romantic `nouvelles'; nor are they simply autobiographical; they are combination of all these, and much more. Today, among the best pieces of literature ever written in English, we have `Lord Jim' and `Nostromo', two gigantic tales with superb human and humane backgrounds. Simply watching a film based on a Joseph Conrad novel is not enough to reveal all the invisible, profound thoughts, the real human philosophy of life, how humans think and react under different situations. To really understand this author it is imperative that you slowly read and digest his works. Perhaps you should start with `Almayer's Folly' before embarking on the two previously mentioned masterpieces. However, `Swept from the Sea', based on his story `Amy Foster' does wonderfully well in not only showing the story, but also giving us a glimpse into the powerful thinking of Joseph Conrad. This point was evidently on Ms. Beeban Kidron's mind when she set out on making this film. Ably helped by her cast, the result is pretty good, even more than good. Vincent Perez is not bad, even quite good at times; Rachel Weisz has made the job of her life in a highly concentrated reading, and the supporting cast like Ian McKellar and Kathy Bates is top-notch stuff. The filming sequences on the Cornish coast in the deep south west of England, especially with the fog curling round the forelands and creeping up the inlets and into the harbours, or in the pouring rain, gives excellent ambientation to the telling of the story. John Barry's musical apportation was the same as always, such that if I had closed my eyes I might well have been watching `Dances With Wolves' (qv); however it fitted in with the proceedings and the photography well enough. Filmed on the wild coastline of Cornwall, south-west England, now tamed by the August hordes of campers and footpathers, carvanners and English language learners; IMDb lists Pentire Point on the northern coastline, but I cannot help thinking that I saw some village streets such as in Mullion, Coverack or even Mousehole (pronounced \"muzzle\") on the south coast of that beautiful holidaying area of England. The famous author John Le Carré also has his home down there. This is a film worth seeing, even for the most pedantic and enthusiastic readers of Conrad's novels such as I, precisely because I think Conrad himself would have been quite pleased with Ms. Kidron's work, with Tim Willocks' very correct adaptation for the screen. But whatever happens, do not pass up reading and seeing Conrad's Masterpiece, converted into a masterpiece for TV \"Nostromo\" (1996) (mini) (qv).",
         "I caught this movie today by chance, it was a quiet Sunday so i gave it a chance. The beauty of the landscape is matched by Rachel Weisz. Vincent Perez has the most kind eyes that completely draw you in. Their passionate love affair leaves you absolutely breathless. Ian McKellen shines. His portrayal of a man scarred from and scared of love is tremendous. The look in his eyes near then end when he realizes that he was wrong about Weisz's character is filled with anguish and regret. Perez is a perfect gentleman in every respect, even when he comes up against the harsh and cruel opposition of the people in his new home. You not only feel for him in his anguish but feel with him. This movie sticks with you afterwords. It makes you feel beautiful and you ache with the characters. Highly recommended.",
         "I managed to catch this film while channel surfing and quickly ushered my children outside so that I could enjoy the show. Although the cinematography may not be up to Hollywood standards of crisp, digitized landscapes I found the film to be a wonderful tale. If you have felt like the outsider, ever tried to shut off your emotions in order to stop others from hurting you - you will have no trouble relating to the character of Amy Foster. The acting was well done (I am not an expert at English dialects, although I'd say the accents were as adequately done as the actors who attempted the Newfie accent in The Shipping News). I love historical tales (Jane Austen is a favourite) and thoroughly enjoyed this one as well. 8 out of 10",
         "I rented this movie because I was trying to watch as many Rachel Weisz movies as possible (inspired by her acting in The Mummy Returns). I must say this movie is a gem I would have otherwise missed. I think this movie is all about subtlety of character. The whole enigma around Amy Foster exists only because people don't appreciate the subtleties of her personality and interactions with others. As Dr. Kennedy says in his narration, her silence was not out of inaction or stupidity; rather it was a way of communicating either disdain, disinterest, or disapproval for how others were treating her. Amy's main way of communicating, aside from her silence, was through her eyes. Even though Yanko learned to speak English, he also appreciated and learned to communicate in Amy's own language. I liked Vincent Perez's acting in this movie. His Russian accent was pretty authentic. The other British accents seemed to be mixed between various regions. I'd say this is probably the best acting I've seen out of Rachel Weisz in the five of her movies I've seen. However I notice that those expressions which I felt were so striking in this movie for this character are rather stereotyped expressions that she uses in general. I don't know whether that is what the directors are looking for or if this is one of the few acting flaws that Ms. Weisz might yet overcome. Overall score: 8/10",
         "It was a mean time both historically and geographically. The people lived on a stark and barren spit of land attached to a strikingly beautiful yet often-ferocious sea. Storms were frequent and accompanied by howling winds, slashing rains and crashing waves which occasionally ended in catastrophic shipwrecks. People scratched around just to subsist. The harsh elements succeeded in stealing love from their souls, much as the sea stole lives from the broken ships. Those who did not fit in were scorned and made to suffer. Notwithstanding all this however, this story talks to the will of 2 simple people, who though raised in a harsh land by even harsher people manage to find love and peace, albeit for a short while, despite outrageous cruelties visited upon them. *** 1/2 Stars; 1 Hankie.",
         "I awoke early in the morning to by chance catch this particular movie. Or more so it caught me. This beautiful story of powerful love is quite the heart-wrenching story of tragedy, and in many ways a more powerful image of what you can endure for love, and what love can endure. If I can say nothing else, I would like to say I'm glad that I was allowed the opportunity to watch it. Ian McKellen as always created a spectacular character. His character, Kennedy, is the physician in the town that the main character Yanko washes up on. Kennedy is thoughtful and well presented. Another example of these magical characters within this story is Miss Swaffer, played by Kathy Bates. Its as if the people playing these character have a real love for the story, making them appear more than just two-dimensional figures, but real living breathing people.",
         "This movie is excellent. I knew the cast was good, and in fact all the performances are first class, but the story and the scenery are equally inviting. I caught this on a wet afternoon, and I was totally drawn in. Well worth watching, my only quibble is with the sound, which is too quiet during speech passages and too loud during the music and sound effects.",
         "This is a sad little gem of a movie. I really liked that the plot explored more themes than just romantic love. The story had just as much to do with issues of identity, community, and fidelity. In my opinion, there were a few technical and narrative flaws that kept the film from attaining the level of greatness that it deserved, especially when considering the quality of the performances. The slight quiver in Weisz's voice was right on target as was Perez's accent. The rest of the illustrious cast was more than capable. In regards to the type of story and the setting, I can't help but think that a three-part mini-series would have been a more appropriate treatment than a feature film. I emerged from watching the movie with a feeling that there was a lot more to explore beneath the surface of each character.",
         "This film is about a Russian man who survives a shipwreck. He stays in Britain to start a new life, only to face maltreatment and discrimination. His life turns a new chapter when he falls in love against all odds. \"Swept from the Sea\" is definitely a beautiful and emotional film. The second half of the film had so much emotions that captured me. It engages me so much that I wanted to know what will happen the next second. Rachel Weisz is brilliant in it, her fear in the hut and the subsequent guilt are played very well. Her lines about her dearest belongings being swept from the sea are touching and thought provoking. It saddens me as it highlights her position as an outcast in the community. However, I find the first half of the film rather inconsistent. The relationship between different characters are inadequately introduced, so I was completely confused by the shocking revelation about Amy Foster's heritage. Overall, I enjoyed watching \"Swept from the Sea\"."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Phoenix Pictures",
         "Tapson Steel Films Productions"
      ],
      "summaries": ["The film tells the story of Russian emigree and the only survivor from ship crash Yanko Goorall and servant Amy Foster in the end of 19th century. When Yanko enters a farm sick and hungry after the shipwreck, everyone is afraid of him, except for Amy, who is very kind and helps him. Soon he becomes like a son for Dr. James Kennedy and romance between Yanko and Amy follows."],
      "budget": 0
   },
   "movielensId": 1656,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-23",
      "dvdReleaseDate": "2004-01-20",
      "directors": ["Beeban Kidron"],
      "runtime": 113,
      "movieId": 1656,
      "title": "Swept from the Sea",
      "mpaa": "",
      "actors": [
         "Rachel Weisz",
         "Vincent Pérez",
         "Ian McKellen",
         "Kathy Bates",
         "Joss Ackland",
         "Zoë Wanamaker",
         "Tony Haygarth",
         "Fiona Victory",
         "Roger Ashton-Griffiths",
         "William Scott-Masson",
         "Eve Matheson",
         "Dave Hill",
         "Tom Bell"
      ],
      "imdbMovieId": "0120257",
      "originalTitle": "Swept from the Sea",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The film tells the story of Russian emigree and the only survivor from ship crash Yanko Goorall and servant Amy Foster in the end of 19th century. When Yanko enters a farm sick and hungry after the shipwreck, everyone is afraid of him, except for Amy, who is very kind and helps him. Soon he becomes like a son for Dr. James Kennedy and romance between Yanko and Amy follows.",
      "tmdbMovieId": 1959,
      "avgRating": 3.21277,
      "releaseYear": "1998",
      "numRatings": 141,
      "posterPath": "/24CGT6BDh5TjaoxfUdeAg36NhBA.jpg"
   }
}