{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "new mexico",
            "id": 1508
         },
         {
            "name": "smuggling",
            "id": 6212
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "theft",
            "id": 14604
         }
      ],
      "imdb_id": "tt0119338",
      "video": false,
      "title": "Hurricane Streets",
      "recommendations": [88082],
      "backdrop_path": "/uGbKJsLkx1KM2Yvyl4MBSThwGb2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Marcus",
               "gender": 2,
               "credit_id": "52fe4abbc3a368484e163cff",
               "name": "Brendan Sexton III",
               "profile_path": "/kQsOIQuGcqwdpolSEzLV7RfYVsV.jpg",
               "id": 2839,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Harold",
               "gender": 0,
               "credit_id": "548324c3c3a36829a30086fc",
               "name": "Antoine McLean",
               "profile_path": null,
               "id": 1395443,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Louis",
               "gender": 0,
               "credit_id": "548324cec3a36829a700897c",
               "name": "Mtume Gant",
               "profile_path": null,
               "id": 1183822,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Benny",
               "gender": 2,
               "credit_id": "548324db9251414efa0090b7",
               "name": "Carlo Alban",
               "profile_path": "/56k99vdEESOIAoUsofnb7s9tZYM.jpg",
               "id": 52863,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Chip",
               "gender": 0,
               "credit_id": "548324e7c3a36829ab008b71",
               "name": "David Roland Frank",
               "profile_path": null,
               "id": 1395445,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4abbc3a368484e163cfb",
               "name": "Morgan J. Freeman",
               "profile_path": "/sahczLXjQ9b9zPHfASuRRrINgHQ.jpg",
               "id": 66800,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "548324b39251416e74008cd0",
               "name": "Morgan J. Freeman",
               "profile_path": "/sahczLXjQ9b9zPHfASuRRrINgHQ.jpg",
               "id": 66800,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.453608,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 125052,
      "vote_count": 5,
      "budget": 0,
      "overview": "Marcus is a kid on Manhattan's mean streets. He's turning 15, his father is dead, his mother is in prison for smuggling undocumented aliens. His grandmother is raising him. He has four close buddies who have a basement clubhouse; they shoplift and sell the wares to kids. One is moving toward selling drugs. Marcus wants to take a breather from the city and visit family in New Mexico. He also meets Melena, 14, a sweet kid who dreams of going to Alaska; her father is not just protective but angry and uncommunicative. The gang pressures Marcus to move up to burglary and car theft. He just wants to breathe open air. Can anything go right?",
      "similar": [
         1701,
         339692,
         107846,
         2749,
         483,
         6075,
         4771,
         769,
         185,
         500,
         37094,
         9291,
         5925,
         278,
         1429,
         680,
         76640,
         97630,
         180863,
         1991
      ],
      "original_title": "Hurricane Streets",
      "runtime": 86,
      "poster_path": "/g9ZKqxrCh6kQBwYKNrvvifIkTGW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Posthorn Pictures",
            "id": 40543,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Giv'en Films",
            "id": 40544,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-21",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Know life. No limits.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Morgan J. Freeman"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Morgan J. Freeman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119338/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MTg5MjU3N15BMl5BanBnXkFtZTYwODEzMjY5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Brendan Sexton III, Shawn Elliott, Antoine McLean | See full cast and crew »"],
      "reviews": [
         "\"Hurricane Streets\" is all about Marcus (Sexton), a disaffected teen boy struggling to grow up in the mean streets of some waterfront hood in NYC. A slow starter with a weak story, this flick manages some par performances from a cadre of young actors as it dogs along, peaking late, and ending abruptly with an unsatisfactory resolution. \"Hurricane Streets\" is a mediocre cable watch at best which will leave you with the feeling you've seen it all somewhere else before. (C)",
         "This is my favorite independent film. The simplicity in the storyline is refreshing and the idealistic dreaming of inner-city youth is inspiring. It takes you back to a more simple time when hardships didn't get in the way of the big picture. Brendan Sexton III shines as the ambitious Marcus. Kit Carson's character brings wild imagination and hope to Marcus' life. The acting is very natural and the heart of the story lies within each of these characters. Sure, it would be nice to learn more about each one. It's the ambiguity that has kept at least one person interested from start to finish. For anyone who has ever dared to dream and think outside the confines of the area you grew up in, \"Hurricane Streets\" will take you on the joyful (but bumpy) journey of youth. Beautiful film by the wonderful Morgan J. Freeman.",
         "Don't be put off by the slow pace of the beginning of the film. It well worth the wait, for what comes after. The abrupt ending of the film, is one of the best endings I have ever seen. Also it is one of the best most accurate depictions of what its actually like to be a \"street kid\" in NYC. So much better than \"Kids\" (not that Kids was a bad movie).",
         "I only rented this movie because Sexton was in it and i appraise him for his excellent work in \"Welcome to the Dollhouse\" and \"Empire Records\". I heard that this movie was real good if you like crime dramas, which i do. At first the movie was real upbeat and i liked it becuase i'm a teenager and i know alot of people that talk like that, i sometimes do. Towards the middle it kind of dragged and the ending was disappointing. Kind of like Welcome to the Dollhouse, you have to decide what's going to happen. But I still enjoyed, i give \"Hurricane Streets\" ***1/2 out of ****",
         "Some decent performances were dulled by characters that never developed and a story that never really went anywhere. A tame counterpart to Larry Clark's \"Kids,\" we are taken into the tough inner-city streets and into the lives of a few of its teenage inhabitants. I couldn't get over the feeling that I knew these kids were acting, whereas in \"Kids\" the performances seemed shockingly real, like a documentary. Lacking on many counts, the movie never provoked much emotion and there seemed to be no closure to any of the characters nor did I care.",
         "Once in a while you accidentally see a movie you think might possibly be good. After reading the other reviews I decided to give Hurricane Streets a chance. Boy, am I glad I did. The two principal characters are very well acted and totally believable. I related and sympathized immediately with both of them. I didn't find the story line slow at the start as some of the viewers have commented. I did have trouble understanding the dialog because of the muttered lines. Maybe it's a NY thing not to speak clearly. It ultimately didn't matter because Marcus' plunge into deeper and deeper trouble was gripping, sad and terrifying to watch. I especially like the way the director open-ended his movie. This left me to wonder what would happen to the two lead characters and allowed my imagination full play. I hope that the director will become well known enough so people won't mix him up with the actor. Apparently they are two totally different people. Give this movie a chance.",
         "First of all like it has been said, this is not typical Hollywood garbage, resolution at end flick which is refreshing.. I grew up in blue collar New Jersey and the setting is NYC... The characters hit close to home and I had one of each of them close to me in my adolescent years.. I rented it not realizing that one of the cast, Carlo Alban was actually an acquaintance of mine in real life.. Apart from the fact that I have my own opinion about him, I think that he as well as the other actors involved do a great job in providing a realistic, down to earth portrayal of urban youth in the mid-late 90's.. The score is also not glamorous, but well done.. You are allowed to have a glimpse of the world seen through so many eyes, that is rarely done accurately on-screen... A well written movie.. See it..",
         "The life of an inner city teen in Larry Clark's KIDS is portrayed as single minded and pointless, and while it was an eye opening film experience, ultimately its overall value was shock. I was infuriated at the lengths that selfish teens with no since of life's value would go for self gratification, in the only pursuit conceivable to an immature mind. Hurricane Streets shows us an inner city teen that seems to see the bigger picture. Marcus gets by committing minor thefts, storing his money away with future plans in mind. He's smart enough to shy from major crime and isn't overcome by peer pressure. Theres nothing macho in his criminal activity, he's drawn to it out of immediate necessity. Furthermore, Marcus is capable of not merely lust, but love. He's generous rather than selfish. When you see him at his worst, its sympathy you feel, not disgust or shame. Like the teens in KIDS, Marcus grows up too fast in a hostile environment that precipitates this growth. But the choices he makes are smart or at least noble, not stupid and shameless. His life is not pointless, it has meaning. If you want to get a look at the tragic inner city life of teens, you could watch KIDS and be shocked, or you could follow the example Marcus sets in Hurricane Streets and see the bigger picture. I rate it 9/10",
         "This movie has many great points. The main character, 15 year old Marcus, added a great raw aspect to this movie that i haven't seen too often in other films, through his acne-ridden face with seemingly no make-up and harsh young new york accent. The film has a fine plot, but its logic gets very confused towards the end. The ending of the movie left many sub-plots of the movie unfinished, but after pondering it for awhile, i realized that it was a great way to end the movie. Hurricane Streets is similar to the film KIDS in many ways, but falls short of meeting KIDS' underlying messages and tones, and it's fantastic realism. 'Hurricane' does however have much more soul and feeling displayed than KIDS.",
         "Hurricane Streets was one of the most powerful, realistic movies I have ever seen. Marcus was on the outside who every teenager is on the inside. I should know, I'm 16."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Giv'en Films",
         "Posthorn Pictures"
      ],
      "summaries": ["Marcus is a kid on Manhattan's mean streets. He's turning 15, his father is dead, his mother is in prison for smuggling undocumented aliens. His grandmother is raising him. He has four close buddies who have a basement clubhouse; they shoplift and sell the wares to kids. One is moving toward selling drugs. Marcus wants to take a breather from the city and visit family in New Mexico. He also meets Melena, 14, a sweet kid who dreams of going to Alaska; her father is not just protective but angry and uncommunicative. The gang pressures Marcus to move up to burglary and car theft. He just wants to breathe open air. Can anything go right?"],
      "budget": 500000
   },
   "movielensId": 1659,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-21",
      "dvdReleaseDate": null,
      "directors": ["Morgan J. Freeman"],
      "runtime": 86,
      "movieId": 1659,
      "title": "Hurricane Streets",
      "mpaa": "R",
      "actors": [
         "Brendan Sexton III",
         "Antoine McLean",
         "Mtume Gant",
         "Carlo Alban",
         "David Roland Frank"
      ],
      "imdbMovieId": "0119338",
      "originalTitle": "Hurricane Streets",
      "genres": [
         "Romance",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "XumaKYDG9dM",
         "PZibLqWZ7cM"
      ],
      "plotSummary": "Marcus is a kid on Manhattan's mean streets. He's turning 15, his father is dead, his mother is in prison for smuggling undocumented aliens. His grandmother is raising him. He has four close buddies who have a basement clubhouse; they shoplift and sell the wares to kids. One is moving toward selling drugs. Marcus wants to take a breather from the city and visit family in New Mexico. He also meets Melena, 14, a sweet kid who dreams of going to Alaska; her father is not just protective but angry and uncommunicative. The gang pressures Marcus to move up to burglary and car theft. He just wants to breathe open air. Can anything go right?",
      "tmdbMovieId": 125052,
      "avgRating": 3.07767,
      "releaseYear": "1997",
      "numRatings": 103,
      "posterPath": "/g9ZKqxrCh6kQBwYKNrvvifIkTGW.jpg"
   }
}