{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "train",
            "id": 13008
         }
      ],
      "imdb_id": "tt0119210",
      "video": false,
      "title": "Switchback",
      "recommendations": [
         12395,
         9057,
         39787,
         31606,
         32855,
         31640,
         15720,
         219575,
         46027,
         4954,
         31618,
         32221,
         32077,
         63437,
         31597,
         23303,
         13571,
         163228,
         25598,
         19380
      ],
      "backdrop_path": "/cL3qCqaAonH8arNV5nE2wqrt8P8.jpg",
      "revenue": 6482195,
      "reviews": [{
         "author": "John Chard",
         "id": "5895f86dc3a368089f00b83a",
         "content": "Cause he told the truth, and once you've heard the truth, everything else is just cheap whiskey.\r\n\r\nSwitchback is written and directed by Jeb Stuart. It stars Dennis Quaid, Danny Glover, Jared Leto, R. Lee Ermey, Ted Levine and William Fitchner. Music is by Basil Poledouris and cinematography by Oliver Wood.\r\n\r\nFBI agent Frank LaCrosse (Quaid) is tracking a serial killer who he believes kidnapped his young son.\r\n\r\nSwitchback is a standard serial killer based thriller that flopped at the box office. It's not a bad film but it never delivers on its potential. The location travelogue of the story is most impressive, especially the last third once we get to the snowy mountains of Colorado, but it's the scenery that grips and holds the attention more than the plot.\r\n\r\nThe red herrings have interest value enough for us to stay with what is at just under two hours a long film, but resolutions are either anti climatic or too obvious. Cast are a mixed bag, with Quaid just okay as the perpetually bleak protag and Glover sadly winding out as miscast once film shows its hands. Thankfully Leto and Ermey are on hand to keep a rein on things, playing the intended thriller tone just right as per their respective characters.\r\n\r\nIt's perhaps unlucky to have followed far superior/intelligent serial killer based thrillers, rendering it then and now as weak offerings. It's not the dead on stinker the box office suggests, and trimmed of 20 minutes it would have been a decent time waster, but as it is it plays out as unoriginal and lacking in directorial focus. 5/10",
         "url": "https://www.themoviedb.org/review/5895f86dc3a368089f00b83a"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Frank LaCrosse",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501ddb1",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Bob Goodall",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501ddb5",
               "name": "Danny Glover",
               "profile_path": "/jSNTEnm0Sxm8FRtoBfJmhmQyozH.jpg",
               "id": 2047,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sheriff Buck Olmstead",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dd89",
               "name": "R. Lee Ermey",
               "profile_path": "/r8GBqFBjypLUP9VVqDqfZ7wYbSs.jpg",
               "id": 8655,
               "order": 2
            },
            {
               "cast_id": 1,
               "character": "Missy, the Babysitter",
               "gender": 0,
               "credit_id": "52fe43c79251416c7501dd7d",
               "name": "Claudia Stedelin",
               "profile_path": "/balCvxBWw6FV3I7dptfvmXpE9oT.jpg",
               "id": 67805,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Man on Porch",
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dd85",
               "name": "Brent Hinkley",
               "profile_path": "/1vsUTyswlmeKc4nZOEivdq482mO.jpg",
               "id": 7134,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Lane Dixon",
               "gender": 2,
               "credit_id": "5654e5bd92514145ba0004de",
               "name": "Jared Leto",
               "profile_path": "/msugySeTCyCmlRWtyB6sMixTQYY.jpg",
               "id": 7499,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Andy LaCrosse",
               "gender": 0,
               "credit_id": "599e930c925141105600c12a",
               "name": "Ian Nelson",
               "profile_path": null,
               "id": 1875778,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Bud",
               "gender": 2,
               "credit_id": "57cdddad925141794c006261",
               "name": "Walton Goggins",
               "profile_path": "/gA5nf2alzIPPjs1MSjS1PmrCedJ.jpg",
               "id": 27740,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Deputy Nate Booker",
               "gender": 2,
               "credit_id": "57cdddbec3a36868d900661f",
               "name": "Ted Levine",
               "profile_path": "/7O3vgqgicfNeGr3leC0qB074fjX.jpg",
               "id": 15854,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Sim",
               "gender": 0,
               "credit_id": "57cdddcc9251417958006357",
               "name": "Louis Schaefer",
               "profile_path": null,
               "id": 1675163,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Chief Jack McGinnis",
               "gender": 2,
               "credit_id": "57cddddd9251413db600116c",
               "name": "William Fichtner",
               "profile_path": "/oIGjbztWvTqn4tnolW9rDCjpgxu.jpg",
               "id": 886,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Fae",
               "gender": 0,
               "credit_id": "57cdddf4925141515900b0bd",
               "name": "Maggie Roswell",
               "profile_path": "/v2rJHrmv3fcTLfdjX42to9F0JuA.jpg",
               "id": 6007,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dd8f",
               "name": "Jeb Stuart",
               "profile_path": null,
               "id": 7671,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dd95",
               "name": "Jeb Stuart",
               "profile_path": null,
               "id": 7671,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c79251416c7501dd9b",
               "name": "Mel Efros",
               "profile_path": null,
               "id": 67808,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dda1",
               "name": "Basil Poledouris",
               "profile_path": "/jEUcVOa9gppkDvr5MJOvSD5KVtj.jpg",
               "id": 7728,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501dda7",
               "name": "Oliver Wood",
               "profile_path": null,
               "id": 11409,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c79251416c7501ddad",
               "name": "Conrad Buff IV",
               "profile_path": null,
               "id": 3987,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5883ff70c3a368063c01189a",
               "name": "Gale Anne Hurd",
               "profile_path": "/oRWGpXdIm2lu870aaKpgO3wy19n.jpg",
               "id": 869,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.631635,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10871,
      "vote_count": 69,
      "budget": 37000000,
      "overview": "FBI agent Dennis Quaid tries to catch a serial killer who kidnapped his son.",
      "similar": [
         39874,
         2832,
         984,
         10285,
         948,
         1991,
         1949,
         3597,
         3600,
         10781,
         44247,
         8090,
         1696,
         4232,
         4638,
         101,
         1359,
         392044,
         181283,
         238636
      ],
      "original_title": "Switchback",
      "runtime": 118,
      "poster_path": "/cGUECqzHTEmzfMmvqDAG7wI6reQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pacific Western",
            "id": 1280,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-10-31",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The hunter becomes the hunted.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jeb Stuart"],
      "runtime": 118,
      "synopsis": null,
      "writers": ["Jeb Stuart"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119210/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNzM2Nzg2OV5BMl5BanBnXkFtZTcwMjM1MjcxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny Glover, Dennis Quaid, Claudia Stedelin | See full cast and crew »"],
      "reviews": [
         "Wow, this is an intense story that should keep you interested for the full two hours. The five main roles are all men and they are pretty interesting, led by Danny Glover's character, who is very, very creepy. I'm hesitant to say much about this film for fear of giving anything away for those who have not seen it. Suffice to say its a rough movie in regards to language, violence and general attitude but the story grabs you quickly and is tough to put down once you are into it. One complaint I read said this film never made it big because it was too convoluted a storyline. In fact, the story isn't really pieced together until the last few minutes. Well, a lot of films over the years were like that (Charlie Chan and Sherlock Holmes mysteries, just to name two) and no one complained. The fact that FBI agent Dennis Quaid would figure things out to the exact minute does stretch credibility so don't look for a film that makes a lot of sense: it's simply a very tense thriller that entertains, so it serves its purpose. Lee Ermey, the fanatical drill sergeant in Full Metal Jacket, also is fun to watch in here. Jared Leto and Ted Levine also contribute nicely. It's a man's film, for the most part and an effective diversion for two hours.",
         "I saw this film for the first time on late night television after returning from the cinema where I saw the disappointing 'Along Came a Spider'. There are similarities, but Switchback is by far the better film. Jeb Stuart has done a terrific job keeping us at the edge of the couch and there are very few cliches around. Danny Glover and the entire cast are just right, and all the characters, even the minor roles, are three-dimensional. The story centres on a young handsome hitchhiker picked up and befriended by the serial killer. But this is no ordinary serial killer -- he is Mr. Popularity along the mountain roads where they travel in buddy movie-fashion. But not for long. The killer isn't out to make new friends. What he is doing is cleverly framing the loner-hitchhiker (finger prints on murder weapon etc) so that the law will be searching for the hitchhiker, and not the real killer. That is the killer's modus operandi. So here we have this handsome hitchhiker with a mysterious past (a doctor who ran away) and a killer with a bloody past who is on the run. Enter an FBI agent (Dennis Quaid) who is wanted by the FBI. The FBI want Quaid off the case. But Quaid is a determined man: the serial killer, who he has tracked for 18 months, has kidnapped his son....All of these outsiders come through a small town where the local sheriff loses the election by opting to help the truant FBI agent find the real killer... Three quarters of the way through the film, everyone is chasing someone and the tension keeps mounting along with the altitude. The killer has left a note with a cryptic clue that Dennis Quaid must decipher. But the key to his son's whereabouts lies elsewhere..... This is a fresh breath of writing into a genre that has been abused and neglected of late. There are nice echos of our favourite films noir (...the hitchhiker, the loner, the car accident.....the guessing came about who is who...). There's a touch of The Fugitive, but not too much. On top of all the good acting, casting, plotting and suspense, there's nice atmosphere and locations in the Rockies.",
         "Switchback was an enjoyable mystery/thriller with a few nice action sequences. Quaid's character seemed a bit cliche to me (like he was impersonating a dour Harrison Ford) but Glover's character was unique and interesting. This movie didn't have a lot of surprises or plot twists, but director Jeb Stuart managed to keep my interest high by using well drawn and likeable characters and by keeping a lot of balls in the air from the beginning of the movie. With the exception of the serial killer himself, the conflicting motivations of the characters played well with the story and provided plenty of tension. I especially enjoyed the portrayal of the serial killer himself. This is possibly the first movie I've seen where the killer had a human face and was not a psycho mastermind genius or a low-life loner with a chip the size of Manhattan on his shoulder.",
         "As a thriller, this had some holes. For starters, Stuart identifies the killer too early (at least, I figured it out), so some tension is robbed). The postcard thing never really made any sense to me. And though it's clear who the killer is, his identity raises questions about how Quaid's son is kept without the authorities knowing. But I can forgive a lot of that because we care about the characters. Quaid, Ermey, and Glover, are three of our finest character actors, and they make us interested in their characters. Also, Ted Levine offers fine support, and Jared Leto creates mystery in his role when there wasn't a whole lot written in.",
         "I liked just about every aspect of this movie. The local police aren't portrayed as a bunch of inbred idiots, the killer isn't portrayed as maniacal and impersonable, and the FBI agent isn't just a suit with all the personality of a tube of toothpaste. All of these combine to make a refreshing murder mystery/thriller. This isn't the classic \"who dun it?\" type of murder mystery; rather, it is more in the flavor of \"Silence of the Lambs\", where we discover who the killer is long before the end of the movie, and the suspense comes from anticipating the hero catching the villain.",
         "Exciting thriller plenty of suspense and action , dealing with the kidnapping of a FBI agent's son and the desperate chase of the murderer who has him . As a F.B.I. agent named Frank LaCrosse (Dennis Quaid) goes home to encounter has been broken into and his son is missing . He is following the clues of a brutal serial killer whose massacre stretches nearly two years . Frank's relentless pursuit leads to Amarillo , Texas , where two more victims have been found slashed to death and the enigmatic series killer goes on his crime spree . As Frank join forces with the local Sheriff named Buck Olmstead (R. Lee Ermey) and his Deputy Nate Booker (Ted Levine) to search for his suspect , elusive killer , and all of whom investigate the murders before he disappears perhaps forever into the Rocky mountains . Meantime , a drifting previous medic named Lane Dixon (singer/actor Jared Leto) is picked up by an ex-railroad man , an African-American named Bob Goodall . This is a thrilling film that contains intrigue , noisy action , suspense , chases and plot twists . The highlights result to be the train confrontation and the surprise ending . Interesting and thrilling screenplay by the same director Jeb Stuart who debuts in this enjoyable flick . Intriguing narrative is well developed , as we are interested on the events are we are really cared what happens to this people . According to an interview with Jeb Stuart in Premiere magazine, he had originally intended to make this movie back in the early 1980's under the title 'Going West in America', with Sidney Poitier, Robert Duvall, and Kevin Bacon in the three main roles . Magnificent acting by the protagonist trio as Dennis Quaid , Jared Leto and Danny Glover . Excellent support such as Ted Levine as Deputy Nate Booker , Leo Burmester as Clyde 'Shorty' Callahan , Walton Goggins as Bud , William Fichtner as Chief Jack McGinnis and special mention to Lee Ermey as Sheriff Buck Olmstead . Furthermore , a rousing and stirring original musical score by Basil Poledouris . Colorful and evocative Cinematography by Oliver Wood . The motion picture was well directed by Jeb Stuart in his film debut . Stuart is a prestigious screenwriter , he wrote successful films such as ¨The fugitive¨, Die Hard¨ , ¨Another 48 hours¨ , ¨Lock up¨ , ¨Fire down below 2¨ and ¨Just cause¨ . He only has directed two films ¨Switchback¨ and ¨Blood done sign my name¨ , both of them failed at box office ; however , ¨Switchback¨ is today pretty well considered . The picture will appeal to Dennis Quaid and Jared Leto fans .",
         "Almost an oxymoron, isn't it? A well-done serial murderer story? Yet they do come along from time to time. This one isn't as innovative as \"Seven,\" not as well observed, but it's still above average. The killer, the affable Danny Glover, arranges to take the hitch-hiking, unwitting Jared Leto on a trip through the Colorado mountains in the middle of winter. Glover, whose identity is unknown to any social control agents, is being pursued by a local police department, R. Lee Ermey in charge, and a loose cannon FBI agent, Dennis Quaid, whose son Glover has kidnapped and stashed away somewhere. Half the film has Glover driving his white El Dorado, festooned with pics of Playmates of the Month, through a convincingly snowy landscape. The other half deals with the reluctant cooperation between Ermey and Quaid. Ermey finally decides to throw the law books out the window and join Quaid in his personal quest. The climax brings Glover, Leto, and Quaid together in the caboose of a freight train plowing its way through a mountain pass and turns the movie into what is more or less a formulaic bang up. Two things contribute to the quality of the film. One is the location shooting. Everything looks cold, bare, gloomy, and windswept. The landscape seems to be hibernating and waiting for spring. The other thing is Danny Glover's performance as the serial killer. He's great. A Scatman Crothers whose big grin and avuncular manner barely manage to mask the vicious psychopath beneath. Glover's character has worked these mountain passes for the railroad before. Everyone in the small towns along the route and on the job seem to know and love him -- and he's a black guy too. It says volumes about our national change in attitude that someone was willing to cast an African-American actor as a charming murderer of white people, and Glover justifies the risk that was taken. Quaid is stolid, stuck in the humorless role of the anxious but determined father. Jared Leto can't really act at all. And there are clichés in abundance. The car that rolls off the road and hangs on the edge of a cliff while its occupants try to crawl out of the wreck. It's held up by a single tree, which cracks and allows the vehicle to plunge into the valley, while Leto hangs onto some projecting roots by his fingertips. But it's Danny Glover who redeems the film. At the start, we only see him as an amiable guy, and only gradually do we come to suspect his identity as the killer. The first time he uses his knife, the victim is an old friend with whom he has shared his childhood. It's a truly chilling scene. Glover's friendly smile fades into a scowl while the puzzled victim simply stares back at him. Then there is Glover's death. He's knocked from a speeding train and does a series of somersaults down a snowy slope, yipping and yelling along the way, like Major Kong riding the catastrophic bomb in \"Doctor Strangelove.\" What a job he does. At heart, it's just another serial killer story but -- here we must all get on our knees and thank heaven for small favors -- the killer doesn't leave puzzling clues behind based on \"Alice in Wonderland\" or The Seven Deadly Sins or the first folio of Billy Shakespeare's works or the seven levels of Inuit hell. There's only one teasing clue, and it doesn't require a trip to the library to solve it. There's really very little gore, and no violence except for a few minutes at the end. You'll probably like it.",
         "I was surprised by this film quite a bit. I thought it would be another mediocre paint-by-the-number genre piece. To my amazement Switchback is a taut and suspenseful film. Its fun to see Danny Glover cast against type. By no means a masterpiece, but well worth watching by thriller fans",
         "throughout this noirish thriller, and it doesn't look easy. Otherwise, the acting is fine and the story is full of interesting twists and details. Watch this film late at night, alone -- it definitely will keep you awake until the very end, when you might sit up and say Huh? No, really, it's a good film.",
         "This is one of my favorite movies. A very menacing storyline if you pay attention. Danny Glover is fully believable in the role of a serial killer, Bob Goodall. His eyes and smile convey an extreme homicidal persona one second, but just friendly and laid back the next. I have never seen any actor portray this kind of character as well as Mr. Glover. One of the most convincing scenes is when he follows the attractive female clerk into the store room of a country store. His demeanor, very understated, reflects a trusted friend until he enters the room and says a few words to her and his facial expression, still subdued, completely changes in an instant, going from friend to most dangerous. Hard to describe, but his acting was superb as a psychopath and I recommend this movie."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Pacific Western",
         "Paramount Pictures",
         "Rysher Entertainment"
      ],
      "summaries": [
         "F.B.I. agent Frank LaCrosse returns home to find his home has been broken into, his son is missing and Missy the babysitter is lying in a pool of her own insides. Her murder being the hallmarks of a elusive enigmatic serial killer whose slaughter spree...stretches nearly two years. Frank's desperate pursuit leads to Amarillo, Texas, where two more victims matching the killers M.O. have been found slashed to death. As Frank searches for his suspect the local Sheriff Buck Olmstead and his Deputy Nate Booker investigate the killings in-between a heated election feud, with his competition police chief Jack McGinnis. All the while drifting former doctor Lane Dixon is picked up by ex-railroad man, Bob Goodall. As a local Mechanic, Clyde 'Shorty' Callahan becomes the latest victim. Frank hopes and prays to find this sociopath before he disappears perhaps forever into the rocky mountains",
         "An FBI agent tries to catch a serial killer who kidnapped his son."
      ],
      "budget": 37000000
   },
   "movielensId": 1661,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-31",
      "dvdReleaseDate": "1998-12-01",
      "directors": ["Jeb Stuart"],
      "runtime": 118,
      "movieId": 1661,
      "title": "Switchback",
      "mpaa": "R",
      "actors": [
         "Dennis Quaid",
         "Danny Glover",
         "R. Lee Ermey",
         "Claudia Stedelin",
         "Brent Hinkley",
         "Jared Leto",
         "Ian Nelson",
         "Walton Goggins",
         "Ted Levine",
         "Louis Schaefer",
         "William Fichtner",
         "Maggie Roswell"
      ],
      "imdbMovieId": "0119210",
      "originalTitle": "Switchback",
      "genres": [
         "Action",
         "Adventure",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["HeQmMOywsJA"],
      "plotSummary": "FBI agent Dennis Quaid tries to catch a serial killer who kidnapped his son.",
      "tmdbMovieId": 10871,
      "avgRating": 3.11624,
      "releaseYear": "1997",
      "numRatings": 671,
      "posterPath": "/cGUECqzHTEmzfMmvqDAG7wI6reQ.jpg"
   }
}