{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "surgeon",
            "id": 3262
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "profanity",
            "id": 9754
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "brutality",
            "id": 14707
         },
         {
            "name": "buddy",
            "id": 15214
         }
      ],
      "imdb_id": "tt0118900",
      "video": false,
      "title": "Gang Related",
      "recommendations": [
         14469,
         19092,
         69007,
         12489,
         26352,
         55336,
         66894,
         31394,
         31127,
         14809,
         79582,
         105941,
         36354,
         34601,
         44020,
         287915,
         41971,
         24775,
         32049,
         36555
      ],
      "backdrop_path": "/yWjWTIL1yL2Wx6xdqyXss0VYnvK.jpg",
      "revenue": 5,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Detective Frank K Divinci",
               "gender": 2,
               "credit_id": "52fe45ef9251416c75067743",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Detective Rodriguez",
               "gender": 2,
               "credit_id": "52fe45ef9251416c75067747",
               "name": "Tupac Amaru Shakur",
               "profile_path": "/qPpFzmTKEcxEea6J4UTI5ic1tsf.jpg",
               "id": 54422,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cynthia Webb",
               "gender": 1,
               "credit_id": "52fe45ef9251416c7506774b",
               "name": "Lela Rochon",
               "profile_path": "/9DBu3r5O4fBosSS4FnSzFCVpm0O.jpg",
               "id": 51359,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joe Doe / William",
               "gender": 2,
               "credit_id": "52fe45ef9251416c7506774f",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Arthur Baylor",
               "gender": 2,
               "credit_id": "52fe45ef9251416c75067753",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Richard Simms",
               "gender": 2,
               "credit_id": "52fe45ef9251416c75067757",
               "name": "Gary Cole",
               "profile_path": "/cqsNC0LRZZz2k1dbgIcGITQ4DZN.jpg",
               "id": 21163,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Manny Landrew",
               "gender": 0,
               "credit_id": "52fe45ef9251416c7506775b",
               "name": "Terrence 'T.C.' Carson",
               "profile_path": "/eto2MDC4VXLGiPOXNqSdlWJ5yxL.jpg",
               "id": 233191,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ef9251416c75067761",
               "name": "Jim Kouf",
               "profile_path": null,
               "id": 21155,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546e08819251414c78001c6b",
               "name": "Jim Kouf",
               "profile_path": null,
               "id": 21155,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "563f646ac3a3681b6102fd09",
               "name": "Brian J. Reynolds",
               "profile_path": null,
               "id": 1533102,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "563f64aec3a3681b4b02bd8f",
               "name": "Mickey Hart",
               "profile_path": null,
               "id": 126297,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "563f6585c3a3681b54030da0",
               "name": "Todd C. Ramsay",
               "profile_path": null,
               "id": 1767,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "563f6594c3a3681b5202e54f",
               "name": "Carol Lewis",
               "profile_path": null,
               "id": 21363,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "563f65b8c3a3681b5202e557",
               "name": "Shari Feldman",
               "profile_path": null,
               "id": 1533103,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "563f65c2c3a3681b5e02cc55",
               "name": "Stephanie Ziemer",
               "profile_path": null,
               "id": 1515868,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "563f663e925141781900be8f",
               "name": "Brad Krevoy",
               "profile_path": null,
               "id": 51702,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "563f664cc3a3681b6102fd57",
               "name": "Steven Stabler",
               "profile_path": null,
               "id": 51703,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "563f665dc3a3681b5c0309ca",
               "name": "John Bertolli",
               "profile_path": null,
               "id": 58201,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "563f67279251413442006eeb",
               "name": "Lynn Kouf",
               "profile_path": null,
               "id": 58424,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "563f6767c3a3681b6102fd8f",
               "name": "Jeff Ivers",
               "profile_path": null,
               "id": 58202,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "563f67dc9251413442006f10",
               "name": "Jeffrey Downer",
               "profile_path": null,
               "id": 71245,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "563f67f7c3a3681b5e02ccbc",
               "name": "Happy Walters",
               "profile_path": null,
               "id": 21933,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "563f68559251416cd8007108",
               "name": "Jory Weitz",
               "profile_path": null,
               "id": 956271,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 2,
               "credit_id": "5686a76292514131df01cd3d",
               "name": "Charles William Breen",
               "profile_path": null,
               "id": 21615,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.523759,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14398,
      "vote_count": 43,
      "budget": 0,
      "overview": "Two corrupt cops have a successful, seemingly perfect money making scheme- they sell drugs that they seize from dealers, kill the dealers, and blame the crimes on street gangs. Their scheme is going along smoothly until they kill an undercover DEA agent posing as a dealer, and then try to cover-up their crime.",
      "similar": [
         984,
         11423,
         15069,
         37645,
         979,
         96,
         4771,
         75780,
         357096,
         445954,
         21484,
         10359,
         10651,
         2749,
         1696,
         18587,
         26390,
         12150,
         1949,
         1572
      ],
      "original_title": "Gang Related",
      "runtime": 102,
      "poster_path": "/fxlSIqCkZSttymnSvL6RHHmr0Fh.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
            "name": "Orion Pictures",
            "id": 41,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kouf/Bigelow Productions",
            "id": 3589,
            "origin_country": ""
         }
      ],
      "release_date": "1997-10-08",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Some cops play by the rules. Their own.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jim Kouf"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Jim Kouf"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118900/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MjYxMTM3OV5BMl5BanBnXkFtZTcwMTMzNDcxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: James Belushi, Tupac Shakur, Lela Rochon | See full cast and crew »"],
      "reviews": [
         "Much better movie than I expected. Jim Belushi and Tupac Shakur have a good chemistry as 2 crooked, conflicted cops. Tupac Shakur actually played a very good character as the increasingly troubled cop. He was willing to bend some rules, and put some money in his pocket, but things have now gone entirely too far for him. Jim Belushi plays a morally dumb cop who continues to make the situation worse, and continues to believe he can probably manipulate his way out of anything. Dennis Quaid, James Earl Jones and Lela Rochon were all excellent. I didn't expect too much from this, but I was drawn into a well-done, well-acted movie.",
         "Gang Related had a great premise, which was enough to get me to want to see it. James Belushi (K-9, Race the Sun) and the late Tupac Shakur (Gridlocked, Poetic Justice) play two corrupt cops. They sell stolen drugs, kill the guy they sold it to, take the drugs & money, and label the crime as gang related. This has worked for the first ten times, but the 11th doesn't. The 11th guy they killed, turned out to be an undercover cop. So the two are put in charge of finding the killer. So knowing that they themselves killed him and could be in huge trouble, they begin to look for possible candidates to take the fall. Eventually they decide on a homeless man, wonderfully played by an unrecognizable Dennis Quaid (Switchback, Dragonheart). They then get Belushi's girlfriend and stripper, Lela Rochon (Waiting to Exhale, The Chamber) to testify against him. Soon though things don't work out as Rochon starts to lose confidence and more evidence comes out about the mysterious homeless man. Belushi and Shakur start to lose their trust and confidence with each other. This is a well-written film with some great dialogue and an awesome ending. James Belushi is great as the mastermind behind the plot and the one who won't give up. Tupac Shakur is just as good (in his final role) as the partner who has at least some sort of a conscience. Rochon is good. Fine support work is turned in by James Earl Jones and David Paymer as Quaid's lawyers. I highly recommend this movie. Rated R: (violence, language, nudity)",
         "GANG RELATED (1997) *** Starring: James Belushi, Tupac Shakur, Lela Rochon, Dennis Quaid, James Earl Jones, and David Paymer Written and directed by: Jim Kouf Running Time: 106 minutes Rated R (for strong pervasive language, violence, sexual situations, and some nudity) By Blake French: My expectations for \"Gang Related\" weren't exactly peak high when I decided to screen it. The production just didn't look like anything new to be added into the gritty undercover street cop genre. I was wrong, and the film is somewhat original. I liked the film and its gritty ghetto style it is shot in. I recommend it to those of you looking for a violence action picture with an attitude. The film's setup begins a little week, but then triggers a series of unpredictable events that connect to each other in a distributive fashion. The two main characters are FBI agents Divinci (James Belushi), and Rodriguez (Tupac Shakur). They are corrupt cops, taking the law into their own hands in many cases, sometimes resulting in murder. One night, Divinci and Rodriguez undercover a drug bust that ends in them shooting the seeming criminal dead. As it turns out, the so called drug lord was actually an undercover cop. The movie's intentions are clear from the first act; we are watching a story from the bad guys point of view. It is an unconventional idea. The opening contains to little dramatic material to go much anywhere, so the rest of the film much hinge of from it. We meet two characters, receive some development that explains to us these are down on their luck, profane, unrighteous individuals, and are then propelled into the rest of the plot, which basically details the complications of the villain's bad choices. Once Divinci and Rodriguez learn the identity of the man they brutally killed, they panic. Their first intentions. Since they are the cops assigned to this high pressure case, that they will need to come up with a either a criminal suspect who will plead guilty to their dastardly deed, or frame a crime friendly fellow who can't prove he didn't commit their murder. In the streets they come from, crime and murder is an everyday occurrence, so their plans should work out a-okay...right. I really liked where the film goes from here: In desperation, Divinci and Rodriguez decide to frame a homeless bum for their murderous crime, played tremendously convincing by Dennis Quaid. The bearded man selected is so out of it, he doesn't even remember his name. So our two incisive corrupters give him a name, plant evidence, explain to him a story which he believes happened, and bribe him to confession. Characters who enter the story afterward are Cynthia (Lela Rochon), a stripper who is persuaded to lend a deceitful but helping hand to Divinci and Rodriguez, powerful lawyer Arthur Baylor James (Earl Jones), who comes to the rescue of the bum's hopeless defense, and another \"lesser\" lawyer named Elliot Goff (David Paymer). \"Gang Related\" contains a story that is as involving and intriguing as any action picture in the last several years. It uncommonly has unpredictable elements inside. The complication of the conflict are tense and involving as the characters sink themselves into a deeper pit of despair and trouble. But one thing came across my mind as I watched Divinci and Rodriguez work up a taut sweat as they make life or death cover up choices, why don't they just flee the country? Jim Kouf, who wrote and directed this final film to star the late Tupac Shakur, observes decent performances with the strong dramatic impulse manifested. He holds nothing back, and at times goes over the edge a little in his style of direction. The atmosphere created in \"Gang Related\" is abrasive, pervasive, and indiscreetly tough. But with such a movie titled \"Gang Related,\" what would you expect? Brought to you by Orion Pictures.",
         "I really didn't want to rent this film, but one of my friends, PA(nick-name)who was a big fan of Tupac Shakur talked me into it. I am glad he did, because this was one of the best films of 1998. James Belushi was great in this film, and so was Shakur and Lela Rochon. James Earl Jones appears in a little role in the last 40 minutes of the film.He was great, too. However, the film is about two corrupt cops who sell drugs, then they kill the buyer and steal the drugs and everything else of value on him. It had worked 10 times. But unfortunately the 11th time(The one we saw) goes wrong.The buyer was a undercover-cop and they has been set to do the investigation.Now the film really starts. The two cops now start looking for someone to blame, and a homeless man named Tom looks like an easy target. The rest you can see for yourself.You really should. The movie is Great I gave it 9/10!",
         "Detectives Divinci and Rodriguez are crooked cops involved in dealing drugs and murdering the competition. When one of their victims turns out to be an undercover DEA agent, they are put on the case to find the murderer. With DEA agent Richard Simms desperate to get the killer, Divinci and Rodriguez realize that they have to frame someone else for the crime. Settling on homeless man 'Joe', they give him drink, get him to sign a statement and falsify the evidence to make a strong enough case to convict. I had half wanted to see this film for a few years simply because I am keen to take the few chances I have to try see Tupac acting \u0096 for me he was the saviour of Poetic Justice and he is much better than the vast majority of the hip hop 'actors' we have seen recently. The plot here is pretty much a standard thriller plot based around two dirty cops and, although it lacks real flair or imagination, it still manages to do its job and be an enjoyable and occasionally quite gritty little thriller. It could have done with a greater sense of tension though, for the majority of the time it merely unfolds as opposed to being fast paced or very exciting but it is still an enjoyable enough little film even if it pretty much goes where you expect it to. The cast is a big factor in making this film more interesting and making it rise above the other genre films that it will be competing with on the bottom shelf. Belushi has been in more than his fair share of sh*t video thrillers but here he is actually quite good and seems comfortable with material that, although not great, is certainly nowhere near the low level that he is getting used to. In his last film, Tupac is great and he should be a role model for all hip hop stars who want to act \u0096 even just in the choice of role he gives a great example \u0096 can you imagine many other rappers playing a corrupt cop with as little glamour as Tupac had? Snoop is a fine example, his last few roles have been versions of the caricature he plays in his music and many other rappers do the same \u0096 trading on their image rather than acting. Tupac is far from his gangsta image and he delivers a very down to earth performance \u0096 as with several other of his films he made this better by his presence. The gorgeous Lela Rochon is given an eye candy role at the start but she is able enough to make a good performance out of it (as well as having a body and looks to die for!). The smaller roles add the feeling of cast depth even if some of them add little else. Quaid for example has so little to do you wonder why he bothered \u0096 he feels like he should be a bigger part of the film but he isn't. For the opposite reason Jones, Cole and Paymer are all quite good because they are minor roles and they just feel like quality padding. Overall this is not a particularly earth shattering thriller but it does its job well enough and I found it pretty enjoyable. A well-known cast certainly helps to make the material rise slightly above the rest of its genre but it is a great performance by Tupac in a different role that made it for me; if only other rappers were less afraid of their image when making role choices then we may not be experiencing a wave of awful blaxploitation films all over again.",
         "Good movie....has a few twists and turns you don't expect. Both James Belushi & the late Tupac Shakur were well cast in the main roles - especially Belushi - this role being very different from his usual ones. The only other two cast members that have some grunt in the movie are Lela Rochon and Dennis Quaid. James Earl Jones has an appearance - if only small - but for me I will never be able to disassociate him from the voice we have all come to know as Darth Vader. Dennis Quaid however does some lime light stealing - but you'll just have to watch it to find out why! Overall good entertainment - may not be everyone's cup of tea - but had me engrossed. In a sense a typical good cops go wrong movie - but one that at least grabs you and sucks you in to watching it to find out what happens next. I gave it a 7/10.",
         "If it wasn't for the fact that I'm a huge fan of Rap-music, and that I consider Tupac Shakur as the greatest rapper of all time, chances are that I would have never taken my time to watch \"Gang Related\". In fact, I don't consider any of the films Tupac starred in as directly bad. \"Poetic Justice\" (1993), \"Juice\" (1991) and \"Gridlock'd\" (1996) are all films that I would recommend and consider as highly watchable. Now \"Gang Related\" was the only film he got the chance to star in, where he didn't play a criminal or a street-thug from the ghetto. In this film he actually plays a police officer... ...a corrupt one that is, though. Divinci (played by James Belushi) and Rodriguez (Tupac Shakur) are two cops who are dealing drugs, bribing and even murdering peoples when they're at work. Their formula is to sell drugs to naive buyers, then kill them and keep the money. This seems to work just fine until one of their victims turns out to be a undercover-police officer. Crime-movies like this isn't exactly my favorites, but I liked this one. Jim Kouf has written an interesting story with enough thrilling and surprises, and except for that part, the actors has to carry the film on their own. I haven't seen many films starring James Belushi, but this is the best performance I've seen by him. He fits the role as Divinci perfect, and really takes the film to a higher level. The chemistry between Belushi and Tupac is also working well. This was Tupac Shakur's last role before he passed, but it is not his best. It's a good performance, though he's being overshadowed by Belushi. Along with Ice Cube, Tupac was a rapper that really COULD act, unlike many of today's rappers who's mostly making a fool out of themselves, trying to act in movies. Lela Rochon (a beautiful woman who plays Divinci's friend Cynthia) and Dennis Quaid (who plays the bum Joe) are also giving some approved performances. Before watching \"Gang Related\" I had seen a few teasers, and it looked like an average crime-film to me. It may not be an extraordinary crime-film, but I sure found myself glued to the TV. As the first hour went by, it became very intense and thrilling. I'm not sure of what to think about the ending of the film, though. It was surprising and had a twist of ironic humor, but I kind of disliked it a little bit, for some reason. To me, it was ONE major flaw in this film: ***Spoilers Following*** During long parts of the film, Divinci and Rodriguez are discussing the murder case, while nobody knows that THEY are the murderers. They keep roaring, screaming and revealing things to each others in public places like at the police station.I think it's very illogical that NOBODY hears or notices them and reacts. ***End Of Spoilers***. I also have to say that I disliked the score, and I'm talking about that awful \"main\" theme, which is being played often through out the film. It doesn't fit the film and it's mood at all. \"Gang Related\" is a good crime-film, with a well-written story and two good actors in the leading roles. It is not as bad as you may think at first, and it's well worth watching at least one time...not exactly the kind of film that's to be watched numerous times, anyway. Tupac Shakur's last film. May he Rest In Peace. 8.0 out of 10",
         "This is a solid noir movie with outstanding performances from Jim Belushi and Tupac Shakur, but the thing I've appreciated most is the history , and the ending too is so different from the average of this kind of movies. Belushi is so convincing, he is nearly perfect in his part ( the corrupted cop ) and there is Gary Cole too in a little part. But, again, the best of this movie is the history, that evolves so surprising and unexpected.",
         "Everything that can go wrong does go wrong for a couple of corrupt homicide cops in \"Disorganized Crime\" director Jim Kouf's \"Gang Related,\" an ensemble police procedural thriller that springs one startling surprise after another on its unsuspecting audience. This above-average but unsavory chronicle of a crime coming unraveled boasts a talented cast in a heavyweight tragicomedy of errors. What elevates \"Gang Related\" several notches above the ordinary gangsta epic is the film's old-fashioned portrayal of good and evil in a morally ordered universe where everybody must atone for their sins. The filmmakers have borrowed elements as diverse as O'Henry's classic comeuppance storytelling style and combined it with bits and pieces from big-budgeted movies such as William Friedkin's \"To Live and Die in L.A.\" (1985) and Joseph Ruben's \"Money Train\" (1995). Indeed, Kouf's accomplished piece of film-making looks like the flip side of Peter Hyams' buddy cop movie \"Running Scared\" with Billy Crystal and Gregory Hines, although the cops that Crystal and Hines played were good guys to the core. The characters in \"Gang Related\" serve as the pawns of a serpentine plot. None of them exert control over what transpires and the irony of this isn't lost on audiences. Few ensemble movies reach the big screen anymore, so this proves both surprising and gratifying to see such a polished effort like this one. Writer & director Jim Kouf produced a similar saga with his 1989 crime spoof \"Disorganized Crime.\" Everything went awry for a gang of thieves in \"Disorganized Crime.\" In \"Gang Related,\" everything goes awry, too, but for the police. The chief difference is that Kouf plays it straight right down the line. Although the parable teeters at times on travesty, Kouf never shifts the accent to buffoonery. You know something is different, too, when a couple marquee stars shows up in minor of crucial roles. You can barely recognize Dennis Quaid at first as a remorseful derelict and James Earl Jones's arrival occurs straight out of the blue. As Detective Frank DaVinci and Rodriguez, James Belushi and Tupac Shakur create a credibly chummy chemistry. Arguing that drug dealers constitute the scum of society, they set them up for buys, knock them off, and then attribute the murders to gangs. They have iced nine drug dealers with this reliable method of operation, using narcotics secretly liberated then later returned to the police evidence room. DaVinci and Rodriguez get the shock of their lives when they learn that their latest victim, Lionel Hudd (Kool Moe Dee of \"Panther\"), was an undercover D.E.A. agent. Moreover, Hudd's superior, Agent Richard Simms (Gary Cole), is determined to do whatever it takes to get to the bottom of Hudd's murder and applies a lot of heat on the L.A.P.D. to find a suspect. Neither detective wants to confess to the crime so they search for a patsy. Several patsies don't pan out because they have iron-clad alibis, but this doesn't stop our unscrupulous protagonists from trying to set them up. They bring them into an interrogation room and slide the murder weapon across the desk at them and these poor fools catch the gun and wind up handling. One examines the revolver in detail and then cleverly wipes it clean and sends it sliding back at the cops. Eventually, DaVinci settles on a street bum. No sooner has Joe Doe (Dennis Quaid of \"The Rookie\") been arrested than it turns out that he is a rich man thought dead for seven years. It seems that William Daine McCall, son of the founder of a major telecommunication corporation, was a celebrated surgeon who stepped out on his wife with a nurse. An argument between McCall and his wife prompted her to fly into hysterics, enough so to take their two kids and leave their home. Tragically, about a mile from home, the wife and children died in a car accident and McCall goes on a bender. Meanwhile, things keep getting worse for our protagonists. They enlist the aid of a stripper named Cynthia Webb (Lela Rochon of \"Waiting to Exhale\") as an eyewitness. It seems that DaVinci is banging her on the side when he is sleeping with his wife. Cynthia buckles in court, however, when defense attorney Arthur Baylor (James Earl Jones of \"Clean Slate\") tears up her contrived story under careful cross-examination, and she admits to perjury. Pretty soon the relationship between DaVinci and Rodriguez begins to deteriorate because Rodriguez lacks DaVinci's cold, calculating nerve to kill people without a qualm. James Belushi of \"Mr. Destiny\" plays an out-and-out villain here in a change-of-pace casting. He invests his character with more depth than you would normally associate with him. At times, his performance is so charismatic that you want evil to triumph. In his final screen appearance, the late rapper Tupac Shakur shows that his artistry will be missed as much by music enthusiasts as moviegoers. Writer & director Jim Kouf has breathed new life into a routine plot by standing it on its head. Half of the fun of \"Gang Related\" is watching DaVinci and Rodriguez dig themselves deeper the more that they try to dig themselves out of disaster. Usually, in a movie like \"Gang Related,\" the heroes are the guys who are in trouble, but neither DaVinci nor Rodriguez qualify as heroes. They only character with any shred of integrity here is Cynthia. When she commits perjury, she refuses to divulge the identities of her cohorts. That's what makes Kouf's police thriller different and that difference might alienate orthodox crime movie junkies who need a hero to cheer.",
         "I didn't have very high expectations for this one (partly because I am not terribly keen on James Belushi) but actually, the film was pretty good. The important thing is to understand the film as a thriller, rather than as a realistic or atmospheric piece. The subject matter and designated environment would point to noir, but the film fails to capture a sense of place or encapsulate an environment and way of life in a way that would justify such a designation. The environment is not actually unrealistic, but again it is not really captured either. Instead, the grit and indeed realism, tends to throw off the viewer, causing him to anticipate a different type of film. \"Gang Related\" is about plot, and there are a satisfactory number of twists and turns for the viewer. One could easily imagine a movie like this being adapted to the stage. The acting is generally of a very high standard with strong performances by Shakur and Belushi. The weakness of this film is rather in the fact that the film fails to create or capture a set of especially nuanced characters, and similarly fails to create a strong sense of place. A different director and different cinematography could have done this without substantial alteration. The dramatic twists and turns in the plot also could be considered a weakness, but this would be due to a misunderstanding of the type of story being told, rather than because that story is in itself a bad one."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Orion Pictures",
         "Kouf/Bigelow Productions"
      ],
      "summaries": ["Two corrupt cops murder an undercover DEA agent by mistake, and frantically try to cover their tracks by framing a homeless man for the crime. That involves juggling evidence, coaching witnesses, and improvising to keep their desperate scheme from unraveling."],
      "budget": 0
   },
   "movielensId": 1662,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-08",
      "dvdReleaseDate": "2001-11-20",
      "directors": ["Jim Kouf"],
      "runtime": 102,
      "movieId": 1662,
      "title": "Gang Related",
      "mpaa": "R",
      "actors": [
         "Jim Belushi",
         "Tupac Amaru Shakur",
         "Lela Rochon",
         "Dennis Quaid",
         "James Earl Jones",
         "Gary Cole",
         "Terrence 'T.C.' Carson"
      ],
      "imdbMovieId": "0118900",
      "originalTitle": "Gang Related",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["yom2xLNiKTM"],
      "plotSummary": "Two corrupt cops have a successful, seemingly perfect money making scheme- they sell drugs that they seize from dealers, kill the dealers, and blame the crimes on street gangs. Their scheme is going along smoothly until they kill an undercover DEA agent posing as a dealer, and then try to cover-up their crime.",
      "tmdbMovieId": 14398,
      "avgRating": 2.893,
      "releaseYear": "1997",
      "numRatings": 243,
      "posterPath": "/fxlSIqCkZSttymnSvL6RHHmr0Fh.jpg"
   }
}