{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "victim",
            "id": 4399
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "pool cleaner",
            "id": 166256
         },
         {
            "name": "spanish music",
            "id": 208913
         }
      ],
      "imdb_id": "tt0119327",
      "video": false,
      "title": "Hugo Pool",
      "recommendations": [
         94622,
         76297,
         239318,
         232138,
         37665,
         50493,
         7547,
         113693,
         28410,
         98486,
         20564,
         17286,
         59940,
         30331,
         174808,
         79995,
         31083,
         48798,
         17241,
         47070
      ],
      "backdrop_path": "/gTndVpWEXdStquhs1Yn2OJPDqXG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Hugo Dugay",
               "gender": 1,
               "credit_id": "52fe44ce9251416c9101d80f",
               "name": "Alyssa Milano",
               "profile_path": "/5ddv9PnPeuoYXzXIbBjREU41K4z.jpg",
               "id": 24967,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Pool Supply Man",
               "gender": 2,
               "credit_id": "52fe44ce9251416c9101d813",
               "name": "Mark Boone Junior",
               "profile_path": "/riibKDljUzdSfIZygymhKx9yNPx.jpg",
               "id": 534,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Henry Dugay",
               "gender": 2,
               "credit_id": "52fe44ce9251416c9101d817",
               "name": "Malcolm McDowell",
               "profile_path": "/lnVJ6J8szi86ssDTfyvZSl8lnlr.jpg",
               "id": 56890,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Strange Hitchhiker",
               "gender": 2,
               "credit_id": "52fe44ce9251416c9101d81b",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Franz Mazur",
               "gender": 2,
               "credit_id": "52fe44ce9251416c9101d81f",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Minerva",
               "gender": 1,
               "credit_id": "5478949c9251416a27000cd2",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Floyd Gaylen",
               "gender": 2,
               "credit_id": "547894aac3a36839b50001ac",
               "name": "Patrick Dempsey",
               "profile_path": "/eHNUaEyNBVuCSxJjPQIgH0keYru.jpg",
               "id": 18352,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Chick Chicalini",
               "gender": 2,
               "credit_id": "547894ba9251416657000897",
               "name": "Richard Lewis",
               "profile_path": "/3FXeKupG6T32AXZ4mAh9XqIGfiu.jpg",
               "id": 6105,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ce9251416c9101d805",
               "name": "Robert Downey Sr.",
               "profile_path": "/6ITEZoNCgMweY7Sf6DxV4T5mkwG.jpg",
               "id": 59874,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ce9251416c9101d80b",
               "name": "Robert Downey Sr.",
               "profile_path": "/6ITEZoNCgMweY7Sf6DxV4T5mkwG.jpg",
               "id": 59874,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.513467,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32332,
      "vote_count": 19,
      "budget": 0,
      "overview": "Hugo Pool is a quirky tale of a Los Angeles pool cleaner who falls in love with a young man dying of Lou Gerhig's Disease.",
      "similar": [
         24420,
         22152,
         1259,
         46705,
         1643,
         8067,
         18168,
         3134,
         339397,
         1024,
         979,
         298312,
         9093,
         38,
         88,
         13,
         1903,
         50546,
         112160,
         86331
      ],
      "original_title": "Hugo Pool",
      "runtime": 92,
      "poster_path": "/jJyR2glvvgUZ3qjFVYBUzsKgXmZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nomadic Pictures",
            "id": 12467,
            "origin_country": "CA"
         },
         {
            "logo_path": null,
            "name": "BMG Independents",
            "id": 38567,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "A comedy with serious relief",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Downey Sr."],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Robert Downey Sr.",
         "Laura Ernst"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119327/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4ODk5NDkyOF5BMl5BanBnXkFtZTcwNzI3OTY0MQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Alyssa Milano, Mark Boone Junior, Malcolm McDowell | See full cast and crew »"],
      "reviews": [
         "Judging from the range of comments on Hugo Pool they seem to run the gamut. As a film, it's not the kind of thing I'd usually watch, but it did contain some rather strange characters. Alyssa Milano in between her stints as Tony Danza's daughter in Who's The Boss and one of the Halliwell sisters in Charmed was cast in the lead by director Robert Downey, Sr. She seems to have taken complete charge of the pool cleaning company that is a family business because dad (Malcolm McDowell) is reverting to being a teenager and mom (Cathy Moriarty) can't control her gambling addiction. In fact she either has to come up with the money or sleep with the bookie. Anyway somebody has to step up to the plate and Alyssa seems the only one likely to do so. She's got a lot of customers out there in Nevada who want to use their swimming pools because of the heat and who need them cleaned. Anyway on her route she meets Patrick Dempsey who even with Lou Gehrig's disease is not about to miss out on all the good things in life. In fact one of only two parts of his anatomy are untouched by amytrophic lateral sclerosis, his brain and the love muscle. In fact the second has some remarkable staying power as he informs us. Hugo Pool is the story of all these characters and the day they spend together. It's an interesting tale and maybe had it been done in a more straightforward and romantic way, I might have liked the film better. Still it's not the fault of the cast who give some very good performances. Not mentioned by me before are Robert Downey, Jr. as an egotistical movie director and Sean Penn as a hitchhiker Malcolm McDowell picks up. Dig those sky blue shoes that Penn wears. Hugo Pool might be your cup of tea, it wasn't quite mine though.",
         "In \"Hugo Pool\" the adorable Alyssa Milano plays Hugo Dugay. A young diabetic pool cleaner who has to clean over forty pools in one day. She has some of the most eccentric David Lynch like customers, including a man (Patrick Dempsy) in a wheel chair who can only talk by a computer. Because of his kindness she can't help but fall head first, not in a pool but in love. Hugo also tries to help her crazy parents. Her father (Malcom Mcdowell) is a recovering junkie who shoots up drugs in a puppet. He calls the drug \"Ring-Dang-Doo\". Her mother is a compulsive gambler and owes someone money. Hugo is so kind, she even loans her mother money. \"Hugo Pool\" is a bizarre, colorful tragic comedy. Filled with bright blue and yellow colors throughout, it has a whacked out sense of humor that only Robert Downey Sr. could create. No wonder why his son is so crazy!",
         "This is a little babe of a movie, the kind that comes on at 1 am and you can't turn it off. Very inventive casting. McDowell and Penn are delightful as are Moriority and Milano. Then, you also have Downey, Jr, Dempsey, and Lewis (AND Chuck Barris). A zany cast of \"characters\"! I was impressed with how handily Milano carried herself and led this cast.",
         "I'm generally not a fan of Robert Downey Senior's movies. His characters tend to be cartoons and his episodic style means that we seem to be watching a series of \"Saturday Night\" comedy sketches. \"Hugo Pool\" has enough great actors in it that all the usual faults are turned into virtues. It also has a sweetness and heart that I haven't seen in any other Downey film. The film is dedicated to Downey's wife and co-writer Laura Ernst. She died of the same terrible disease that the character played by Patrick Dempsey has. It is amazing how Downey shows the disease, but never lets us get sentimental over it or be afraid of it. It is just one more comic element in the film. I hope Laura coped with it as well as Patrick Dempsey's character does. The stand out performance here is by Malcolm McDowell. His portrayal of an old drug addict trying to kick the \"Ding, Dang, Du\" is charming and funny and sad all at once. The only unfortunate thing is that he's only on screen for about 20 minutes. I think the harsher criticisms of this film are by people who expected a more realistic, integrated film. If you willing to give Downey his quirky style, this film is sweet and delightful.",
         "So it may not be a blockbuster. But quirky does describe it well. Sean Penn and Roddy McDowall have an interesting relationship in this movie, but it's a good thing that Downey Jr. is related to the writer, as his portrayal of Franz is way over the top. But the surprise is that Danilo Perez provided the soundtrack, and while the original music may not live up to the content of his jazz albums, the inclusion of the Thelonious Monk tunes in the soundtrack is an incredible treat!",
         "There are a number of memorable acting turns, some more than obvious self-reflective references to addictions (of all types), and a too-pat hand of predictability to move this film beyond a 6 for me. The performances almost rise above the plot restrictions (or lack of restrictions)....an interesting contrast is Robert Altman's \"Cookie's Fortune\" which I saw two days later which used the characters' idiosyncrasies to move a plot.",
         "Okay, so the story of \"Hugo Pool\" wasn't the strongest. Nothing exactly happened. But Alyssa Milano was very nice in this movie, Cathy Moriarty and Malcolm McDowell(!) were interesting in it, and it had three of Hollywood's most splendid actors, Robert Downey, Jr., Patrick Demsey and Sean Penn. Downey was totally hopped-up and bounce-around weird. Demsey's eyes and smile were entirely irrepressible. Penn was approachably strange and wonderful. My advice: get over the fact that the story isn't the focus of the movie before you watch it and enjoy the thoroughly enjoyable performances.",
         "I liked \"Hugo Pool\" because it was so strange and not at all based in reality. It was a little too much to take in at first, but once I realized that this wasn't your average movie, I delighted in the refreshing style that was used throughout the picture. I am a huge Robert Downey Jr. fan and I thought that his performance was excellent, although his skinny body made me wonder if he was unhealthy during the making of this movie. The whole cast did a great job of being completely out there.",
         "The concept of the film was appealing in principle. However, the initial message got lost because at the end I was simply thankful that the movie was over. The characters were not so much 'deep' as they were stereotypes - there is your standard average dysfunctional family, an alcoholic father, a gambling self-centred mother, the cheerful and hardworking daughter along with a couple of odd-balls thrown in as a bonus. If it was supposed to be funny, the movie needed a slightly quicker pace. However, the acting was pretty good. The cast could have done wonders for this story if the script had been a little better.",
         "This is a fun movie! It was nice to see a movie that didn't remind me of something else. Alyssa Milano, Cathy Moriarty, Malcolm McDowell, and Sean Penn were great. A special applause to Patrick Dempsey, who shows that acting is more than just saying words. I was very touched by his performance and the bond formed by Floyd and Hugo. All in all, an unusual fun movie with a \"quirky gait.\" Rent it and you won't be disappointed."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "BMG Independents",
         "Nomadic Pictures"
      ],
      "summaries": ["Hugo Pool is a quirky tale of a Los Angeles pool cleaner who falls in love with a young man dying of Lou Gerhig's Disease."],
      "budget": 0
   },
   "movielensId": 1666,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "1999-10-05",
      "directors": ["Robert Downey Sr."],
      "runtime": 92,
      "movieId": 1666,
      "title": "Hugo Pool",
      "mpaa": "R",
      "actors": [
         "Alyssa Milano",
         "Mark Boone Junior",
         "Malcolm McDowell",
         "Sean Penn",
         "Robert Downey Jr.",
         "Cathy Moriarty",
         "Patrick Dempsey",
         "Richard Lewis"
      ],
      "imdbMovieId": "0119327",
      "originalTitle": "Hugo Pool",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["e8Dn186y6Fk"],
      "plotSummary": "Hugo Pool is a quirky tale of a Los Angeles pool cleaner who falls in love with a young man dying of Lou Gerhig's Disease.",
      "tmdbMovieId": 32332,
      "avgRating": 2.67,
      "releaseYear": "1997",
      "numRatings": 150,
      "posterPath": "/jJyR2glvvgUZ3qjFVYBUzsKgXmZ.jpg"
   }
}