{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancer",
            "id": 733
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "tango",
            "id": 2683
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0120275",
      "video": false,
      "title": "The Tango Lesson",
      "recommendations": [],
      "backdrop_path": "/oc5207zyaBJP6fnX5a3ahCeGpW6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Sally",
               "gender": 1,
               "credit_id": "52fe457f9251416c91034851",
               "name": "Sally Potter",
               "profile_path": "/zSyRgr2Wc7Dbi4IDZCjkDouAaJI.jpg",
               "id": 57206,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Red Model",
               "gender": 0,
               "credit_id": "52fe457f9251416c91034855",
               "name": "Morgane Maugran",
               "profile_path": null,
               "id": 147015,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Pablo",
               "gender": 0,
               "credit_id": "52fe457f9251416c91034859",
               "name": "Pablo Verón",
               "profile_path": null,
               "id": 147016,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Yellow Model",
               "gender": 0,
               "credit_id": "547875a7925141231c001c40",
               "name": "Géraldine Maillet",
               "profile_path": null,
               "id": 1145352,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Blue Model",
               "gender": 0,
               "credit_id": "547875b592514103b8002220",
               "name": "Katerina Mechera",
               "profile_path": null,
               "id": 1390470,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Fashion Designer",
               "gender": 0,
               "credit_id": "547875c6c3a3687aea0002cb",
               "name": "David Toole",
               "profile_path": null,
               "id": 1090538,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Photographer",
               "gender": 2,
               "credit_id": "56293c499251412853000025",
               "name": "George Antoni",
               "profile_path": null,
               "id": 207309,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Man at Tea Dance",
               "gender": 0,
               "credit_id": "590fd3a69251414e8d027c30",
               "name": "Howard Lee",
               "profile_path": "/lwxInDDV2FQzx1V3IAhuiRIYJWU.jpg",
               "id": 572135,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe457f9251416c91034847",
               "name": "Sally Potter",
               "profile_path": "/zSyRgr2Wc7Dbi4IDZCjkDouAaJI.jpg",
               "id": 57206,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe457f9251416c9103484d",
               "name": "Sally Potter",
               "profile_path": "/zSyRgr2Wc7Dbi4IDZCjkDouAaJI.jpg",
               "id": 57206,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56293cc29251412851000039",
               "name": "Hervé Schneid",
               "profile_path": null,
               "id": 2425,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "599c58219251410e6d018333",
               "name": "Fred Frith",
               "profile_path": null,
               "id": 577,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "599c58589251410e7101900f",
               "name": "Irene Lamb",
               "profile_path": null,
               "id": 390,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "592514af9251413b41009432",
               "name": "Robby Müller",
               "profile_path": "/d9Fz3vBIBBYUXYbPTIxo2FwYGSL.jpg",
               "id": 1632,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "599c58479251410e21018ab2",
               "name": "Sally Potter",
               "profile_path": "/zSyRgr2Wc7Dbi4IDZCjkDouAaJI.jpg",
               "id": 57206,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "599c587e9251410e670181bf",
               "name": "Carlos Conti",
               "profile_path": null,
               "id": 18496,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "599c5887c3a368228c017b6a",
               "name": "Paul Minter",
               "profile_path": null,
               "id": 1556946,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "599c58a09251410e71019084",
               "name": "François-Xavier Bazin",
               "profile_path": null,
               "id": 1647261,
               "department": "Production",
               "job": "Unit Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.772133,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 34838,
      "vote_count": 4,
      "budget": 0,
      "overview": "On a trip to Paris Sally meets Pablo, a tango dancer. He starts teaching her to dance then she returns to London to work on some \"projects\". She visits Buenos Aires and learns more from Pablo's friends. Sally and Pablo meet again but this time their relationship changes, she realises they want different things from each other. On a trip to Buenos Aires they cement their friendship.",
      "similar": [
         858,
         141,
         634,
         9762,
         44214,
         242224,
         112160,
         258480,
         43923,
         20352,
         437557,
         342473,
         297762,
         1826,
         27586,
         40807,
         8966,
         8967,
         1581,
         1359
      ],
      "original_title": "The Tango Lesson",
      "runtime": 100,
      "poster_path": "/73YrM0W2vfkGjsJwTvxq3JX8hZH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Adventure Pictures",
            "id": 36765,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Adventure Films",
            "id": 39696,
            "origin_country": ""
         }
      ],
      "release_date": "1997-11-28",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sally Potter"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Sally Potter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120275/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5ODk3MzE3NV5BMl5BanBnXkFtZTcwMTAyNDMzMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Sally Potter, Pablo Verón, Morgane Maugran | See full cast and crew »"],
      "reviews": [
         "This uncommon film will test your ability to perceive at different levels, on the surface it only portraits what it seems to be a weak plot and the subplot of a movie within a movie, but that are not the points of this movie in my estimation. In another level there are the metaphorical aspects of the Tango (being a dance form born in the gutter motivated by raw instincts and erotic sensuality) versus the all unending male/female quest for love and understanding. This is not the typical follow me through the plot and visuals movie, but instead is about an atmosphere of sound and silent body language, spoken through the haunting sounds of a Bandoneon, lost in the sorrow of its own world. The poetic images and symbolisms are all there for those who can see them, but you need a sensitive and willing heart to find them. Like one of the characters says in the movie `You have to have suffered a lot to understand Tango'. Those who are still too attached to their egos will only see the surface, you have to let yourself go and then you will see. This microcosm of the world of relationships is enveloped in ravishing music and dance, all this tinted with subtle erotic overtones. It is not about the obvious, it is about the inner beauty or not of its characters, and their quest for communicating and understanding love. I find Sally Potter to be the perfect match in every way to Pablo Verón character's ego and abilities. This is a lesson indeed to teach those who live only in the shallow surface of today's society, that real emotions run deeper than the tan of their skin or their \"look\". To love and to feel is hard work and not just good looks. And to understand a \"Tango\" you have to dance it, and here they dance it as best as I have seen it on film. And you have to ask yourself. When was the last time you truly held or were held in some one arms in a dance floor at such close distance with such passion? (And I don't mean sexuality as it is imposed commercially in everything now a days). This is a dance of kindled spirits and of two hearts who are emphatic on their pains and joys in their path through life, which see the world so differently but are ultimately united by their passion for the Tango, and to me, here is the real lesson. As it has been said, `You really need two to Tango!' and especially when the lesson is about love.",
         "I have read a lot of commentary on this film. Then I went to the director's website (Sally Potter) and I read her comments. I was so into this movie. It started out slowly and I wasn't sure if I was going to stick with it. But as it went on, I was totally drawn in. I love the fact that the director chose to film it in black and white which only added to the artistry of it. I loved the fact that she as the director, and making it autobiographical, allowed us (the audience) a peek into her creative process. I also love the fact that she courageously placed herself into the hands of another artist to learn the tango. I was impressed when I read that Sally Potter had a background as a dancer so it came naturally to her to appreciate and learn the tango. This movie impressed me on many levels because as a creative talent it takes courage to cross over into the world of another artistic discipline (how easily could a dancer cross over into the world of a film director? you see my point). Or maybe that's not a fair comparison. But to me its literally a case of walking a mile in another man's shoes. Perhaps we find it easy to stand on the sidelines and criticize the work of an artist (be it an actor, director, dancer, writer, etc.) but is it hard to come up with creative visions? Not bloody likely. I viewed this film as a metaphor for life, relationships, artistry, etc. all of which had parallels in the film. If this sounds too deep, it is, believe me! I saw all of this and more in this film. It also felt as if Sally Potter is going through an autobiographical and artistic midlife crisis in this film which has given me courage to put myself on the line autobiographically and artistically. There was some criticism that she should have cast someone else in the title role, but when you can't see anyone playing yourself, but yourself, how can you answer even this kind of criticism? Bravo Sally! I appreciated the peek you gave the audience into your creative process.",
         "this is a wonderful film - for tango lovers as well as for people who like to ponder about life. if you are looking for a movie with pretty girls, short skirts, and guns, you will be asleep before the first five minutes are over. While the tango moves and general dance moves are great, what's really unique about this film is the commentary it makes about life and the power dynamics of relationships between men and women. It also makes commentary on the film industry and what it means to be an artist in this day and age. While it's true that Sally Potter is not a 21-year-old leggy blonde, she looks damn good at her age (I wish I had her body) and she is a very good actress. Pablito Veron also does a good job playing an arrogant ass. His dancing is awesome. Casting Pablo with a spring chicken as some have hinted, would have ruined the film all together. Go Sally - make more of these films; I'd love to see your other commentary.",
         "The British filmmaker and screenwriter Sally (Sally Potter) is in Paris writing the story of models that are murdered by a serial-killer. When she sees a performance of the Argentinean tango dance Pablo (Pablo Verón), she asks Pablo to give tango lessons to her. She becomes obsessed by the dance, dancing with Pablo. Then she travels to Hollywood to have a meeting with producers that want to make her movie, but she gives up on her project. She decides to make a movie about tango casting Pablo in exchange of their partnership in the dance. \"The Tango Lesson\" is a little movie apparently biographical of Sally Potter for fans of dance in general and particularly the tango. The romance is developed in slow pace and practically nothing happens but good dances. My vote is six. Title (Brazil): \"The Tango Lesson - Uma Lição de Tango\" (\"The Tango Lesson \u0096 A Tango Lesson\")",
         "Care to dance? Sally Potter, film director (\"Orlando\"), did, and fell in love with the Tango and Pablo Veron, one of its authentic Argentinian exponents. Pablo is a pretty sexy guy, and a bit younger than Sally, but by the end she's leading and he's following.(I'm not sure whether they actually get to do the horizontal tango.) In between we learn with Sally the intricacies of the dance as an expression of culture as well as personal affinity. There's not much of a story (a year in the life of an original and talented art film maker)but the Paris and especially Buenos Aires settings are evocative - the latter seems frozen in the 40s, when the economic tide went out for Argentina. No, the dance is the thing. Remember Zorba? \"A Greek man dances for his soul.\" Sally dances like a moth drawn to a candle, but wears asbestos underwear and gets an interesting movie out of it. The black and white photography is luminous and completely appropriate, and the soundtrack a treasure trove of Tangos. Recommended for those interested in \"romance\" ie vertical and horizontal tangos though as I said the latter is merely hinted at. Not a film for people who want a compelling story.",
         "There are some amazing stories about the tango, and this is definitely one of them. Lyrical account of a woman finding passion and life as she is consumed by her desire for the Tango. Amazing dance sequences and really beautiful cinematography.",
         "This film was fantastique! The dancing scenes, especially the scene where Sally dances with three men in an empty warehouse, were beautifully shot and I found myself wishing over and over that it was me in the arms of Pablo Veron... The musical score and soundtrack are also superb; if you can find a copy of the soundtrack, do pick it up! It is the most authentic sampling of Argentinean tango that I've ever been able to find (unless you can get an original Astor Piazzolla album).",
         "How much is true, and how much is fiction? That is the genius behind this quiet movie. And as a viewer you yearn to know the answer to that question. A little gem by screenwriter, Sally Potter. Hats off!",
         "As many reviewers have noted, there isn't a lot of talking in this movie, and indeed, this makes for a slow first half hour, but as the movie unfolds you realize that silence is the genius of the film. It's appropriate that writer/director/star Sally Potter has chosen tango for her subject, for, as we see in the film, tango at its best is about two dancers communing with each other, silently and sharply. Sally and Pablo, the Argentinean dancer co-star, connect immediately as Pablo realizes Sally's seriousness and passion to the art of tango, and the two commune in various dance scenes, as well as through the one good conversation they have about believing in God. But eventually this communion breaks down as the duo consider exploring romance, and then Sally and Pablo do a whole lot of dancing--instead of talking. In the end, I think they realize that their relationship is based on a kind of mutual pain/joy: the pain of alienation that Sally experiences in her job as a director and that Pablo feels as an artist, and the joy Sally feels as a creator and Pablo as a dancer for whom dancing is like a religion. This joy is evident in a memorable scene where Pablo dances all over the kitchen while making dinner for Sally, using every kitchen utensil as a rhythmic instrument. Besides dancing, there is also a lot of gazing in this movie--mostly Sally gazing at Pablo, and on the larger scale, the viewer gazing at the two dancing. Part of Sally's fascination with tango, and indeed the way she became enraptured by it, stems from the sheer joy of watching. Sally exercises a kind of powerful intrusiveness in her gaze, and it is this that makes her truly dangerous, and more of a leader than a follower as Pablo notes. With this in mind, the subplot involving a movie Sally pitches about models being killed perhaps by their lovesick director starts to make sense--for in this case and in Sally's case, the art of looking has become a bit like murder, as the viewer subsumes the object into him/herself and thereby robs it of its autonomy. As Pablo says to Sally after their first public performance, Sally's intense gaze robs him of his freedom and blocks his artistic ability; at the same time, though, it is precisely this gaze that fuels the uncontainable joy of Pablo and Sally's two other dance teachers. In the end I think this movie asks more questions than it answers, but it certainly dwells on an unsuccessful relationship that somehow manages to fulfill at the same time as it intrudes and violates. We may like to think of tango as a dance of love and communion, but it can also be about power and control, and in this sense Sally uses tango as a metaphor for her relationship that transcends words yet can't subsist on silence.",
         "the dance. the passion of clashing characters, cultures and dancing styles. the music. the never-ending strive for dominance, for self-comprehension, for excellence in the art that speaks to your heart. the joy of love and the crying of the broken heart. the non-imposing touch of religion and intellect and determination, melted into the lives of tri-lingual strangers who allowed their pathes to cross to form an emotional bouquet of lust, atristry and cinematography called the tango lesson. elegant, sincere, and wicked. possibly, one of the best movies you'll ever let sink under your skin, along with the rain of buenos aires, lights of the Seine cruise ship, and a-typical british breath of life. mesmerizing movie. heart-breaking soundtrack. highly recommended if you believe that tango - or any art, for that matter - can change one's life. and a-must if it already did."
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Adventure Pictures",
         "Adventure Films",
         "Arts Council of England"
      ],
      "summaries": [
         "On a trip to Paris Sally meets Pablo, a tango dancer. He starts teaching her to dance then she returns to London to work on some \"projects\". She visits Buenos Aires and learns more from Pablo's friends. Sally & Pablo meet again but this time their relationship changes, she realises they want different things from each other. On a trip to Buenos Aires they cement their friendship.",
         "The British filmmaker and screenwriter Sally is in Paris writing the story of models that are murdered by a serial-killer. When she sees a performance of the Argentinean tango dance Pablo, she asks Pablo to give tango lessons to her. She becomes obsessed by the dance, dancing with Pablo. Then she travels to Hollywood to have a meeting with producers that want to make her movie, but she gives up on her project. She decides to make a movie about tango casting Pablo in exchange of their partnership in the dance."
      ],
      "budget": 0
   },
   "movielensId": 1669,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch",
         "Español"
      ],
      "releaseDate": "1997-11-28",
      "dvdReleaseDate": null,
      "directors": ["Sally Potter"],
      "runtime": 100,
      "movieId": 1669,
      "title": "The Tango Lesson",
      "mpaa": null,
      "actors": [
         "Sally Potter",
         "Morgane Maugran",
         "Pablo Verón",
         "Géraldine Maillet",
         "Katerina Mechera",
         "David Toole",
         "George Antoni",
         "Howard Lee"
      ],
      "imdbMovieId": "0120275",
      "originalTitle": "The Tango Lesson",
      "genres": [
         "Drama",
         "Music",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": ["R6waGX7uKDs"],
      "plotSummary": "On a trip to Paris Sally meets Pablo, a tango dancer. He starts teaching her to dance then she returns to London to work on some \"projects\". She visits Buenos Aires and learns more from Pablo's friends. Sally and Pablo meet again but this time their relationship changes, she realises they want different things from each other. On a trip to Buenos Aires they cement their friendship.",
      "tmdbMovieId": 34838,
      "avgRating": 3.44883,
      "releaseYear": "1997",
      "numRatings": 342,
      "posterPath": "/73YrM0W2vfkGjsJwTvxq3JX8hZH.jpg"
   }
}