{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rembrandt",
            "id": 8058
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "art",
            "id": 14893
         },
         {
            "name": "forger",
            "id": 209096
         }
      ],
      "imdb_id": "tt0119365",
      "video": false,
      "title": "Incognito",
      "recommendations": [
         36790,
         19667,
         106968,
         110109,
         78051,
         41590,
         70817,
         45179,
         31633,
         26393,
         116014,
         42012,
         63777,
         26337,
         47608,
         40480
      ],
      "backdrop_path": "/mF2FAxKGLScAgnuH5NhIw9XceMu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Harry Donovan",
               "gender": 2,
               "credit_id": "52fe46dac3a36847f8115c7b",
               "name": "Jason Patric",
               "profile_path": "/1WxY2kcQqx9gHloTmRuY5ta3Nje.jpg",
               "id": 12261,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Prof. Marieke van den Broeck",
               "gender": 1,
               "credit_id": "52fe46dac3a36847f8115c7f",
               "name": "Irène Jacob",
               "profile_path": "/vjlwVgbpb22S4rriqkfOd9H4kmU.jpg",
               "id": 1350,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Turley (prosecutor)",
               "gender": 2,
               "credit_id": "52fe46dac3a36847f8115c83",
               "name": "Ian Richardson",
               "profile_path": "/wUENAdxr5JFGFNbDe6HTFwrlvA9.jpg",
               "id": 385,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Milton A. Donovan",
               "gender": 2,
               "credit_id": "52fe46dac3a36847f8115c87",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Alastair Davies",
               "gender": 2,
               "credit_id": "5481fdc1c3a3685c0e000710",
               "name": "Thomas Lockyer",
               "profile_path": null,
               "id": 17202,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46dac3a36847f8115c71",
               "name": "John Badham",
               "profile_path": "/vWzb3cQz4qYtfXQ6qyCrSTw61xA.jpg",
               "id": 12840,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46dac3a36847f8115c77",
               "name": "Jordan Katz",
               "profile_path": null,
               "id": 134191,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.142341,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 45928,
      "vote_count": 10,
      "budget": 0,
      "overview": "Harry Donovan is an art forger who paints fake Rembrandt picture for $500,000. The girl he meets and gets into bed with in Paris, Marieke, turns out to be an arts expert Harry's clients are using to check the counterfeit picture he painted.",
      "similar": [
         306819,
         5876,
         5236,
         2502,
         12162,
         13811,
         1018,
         949,
         9741,
         9798,
         189,
         793,
         6977,
         426,
         1571,
         44214,
         269795,
         168259,
         156022,
         152742
      ],
      "original_title": "Incognito",
      "runtime": 108,
      "poster_path": "/1oqfg2IBGNFAFylDK56NXo558y2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-11-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Harry Donovan is a master in the art of deception... trapped in a lie so perfect even the truth can't save him.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Badham"],
      "runtime": 108,
      "synopsis": "Harry Donovan (Jason Patric) is a talented and enterprising painter who takes in large amounts of cash for his expert forgeries of old masters he produces for clients. Keeping a low profile he is disconnected with his own artistic capabilities and his drive to produce the fake work of old masters is in part an ignoring of his own inner purpose. His father (Rod Steiger), from the Ash Can school is aging and castigates Harry for not following his own artistic merits to follow through on his plan to have his own show with a respectable gallery. However, Harry is disappointed once again, and a gallery rejects to give an exhibition with his paintings. The father is sick with age, he also tried to become a painter, but is not famous. Harry meets up with a group of gallery owners lead by Alastair Davis (Thomas Lockyer) who is seeking an old master to sell for a high price. With Turley (Ian Richardson), Tom Agachi (Togo Igawa) and Iain (Simon Chandler) to raise the funding they go to Harry and offer him $500,000 for a forgery of a Rembrandt. During his research for a lost master Harry discovers a Rembrandt from 350 years ago when it was being transported from Rotterdam to Spain and begins recreating in specific detail the lost painting down to using materials that have been out of use for centuries. During his activities in Paris, Harry meets a young and endearing woman Prof. Marieke van den Broeck (Irène Jacob) who initially introduces herself as a student but in fact is a professor and an authority on Rembrandt. She and Harry are taken with each other and sleep together before Harry leaves for Amsterdam to fabricate his masterpiece. Harry -who told her that he was an art professor- wanted to see her again on another date, but she refuses and remains elusive. The clerk of the hostel where Marieke is staying sees them making love. Marieke also leave a not on her pillow saying \"You've been wonderful.\" The process is tiresome: the pigments, the canvas, the frame... everything has to be perfect. After completing the canvas Harry brings it to Spain for Alastair and his retinue but the art dealers decline to pay Harry the money until they have established from art experts that the painting is real. The critics are attracted by being offered the information that it's a Díaz de la Peña painting which has just been found. Marieke is the most important critic, as she belongs to the board for Rembrandt authentifications, and she is the only one who says that she doesn't believe it's a true Rembrandt. It could have been done by one of his alumni. When Alastair decides to sell the painting at auction Harry disagrees and takes the painting with him. Obviously, the rest disagree with him, but Harry threatens them with Alistair's own gun. Although Harry fires the gun, he doesn't kill anyone. However, when the police go after him, he is accused of killing Agachi. He kidnaps Marieke, who is outraged because Harry has lied to her. As a pursuit ensues across the French, and English borders Harry and Marieke handcuffed together learn many things about each other. Marieke is accused of being an accomplice of Harry, while Alastair tries to get his hands on the fake Rembrandt again. Marieke and Harry argue about what art is, the outrageous quantities of money paid for paintings of dead paintors who died in abject poverty. Harry can't sell his fake Rembrandt. The murder frightens everybody. Two thugs finally accept to pay 100,000 in cash, but they are just Alastair's men trying to get it for free. Harry fights one of them. When Harry gets in touch with one of his contacts, the police is waiting there. Harry runs away, and throws the painting into a garden fire. However, the painting survives. Harry is judged. He says that he painted the fake Rembrandt, but nobody believes him. Only Marieke says that it's a fake. However, she's discredited in front of the jury because of her love/sex relationship with Harry. From gaol, Harry tries to contact his own father, who doesn't want Harry to worry about him. Harrys' father knew about his illegal business, but he never judged him, although he tried to encourage Harry to paint his own works. Alastair visits Harry on jail, and tells him harsh and cruelly that his father has died of a weak heart. Marieke tells Iain that he should be careful, as Alastair Davies may decide to get rid of him as he got rid of Tom Agachi. Eventually, Harry's barrister arranges the final proof: Harry will paint another copy in front of the jury. The judge accepts, although Harry finally is unable to do it - the eyes of his father - his inspiration for the blind eyes of Rembrandt's father - prevents him to go on living making cons. Everything is going bad for Harry. Iain is the last witness. He confesses that Alastair Davies killed Tom Agachi. Alastair goes frantic and threatens to kill him. The judge holds Alastair in contempt, and sends him to jail without bail until a new judgement is set. Iain keeps the painting. Harry is freed, but it's Iain who gets the fake Rembrandt. He sells it to a hotel chain in Hong Kong. However, Harry has not said his last word: he tells Juan del Campo (Ricardo Montez) that he's been cheated. The Spanish government considers the Rembrandt part of Spain's national patrimony, so they have the right to pay the money it was auctioned for and take it to Spain. Because of Juan's ownership, the money will go to him. His lawyer tells Iain this when he's celebrating the great success of selling the fake Rembrandt as a true painting, in his luxurious gallery. They can't do anything about it. The del Campo family wants to share with Harry Donovan some of his rightfully-theirs money. After taxes, there are 600 million pesetas for the family, and they give a part to Harry Donovan. He tries to locate Marieke. He also tries to paint his own materials. The first one is a portrait of Marieke. She finally arrives to look at the painting. Harry Donovan and Marieke kiss passionately.",
      "writers": ["Jordan Katz"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119365/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxNTQ3MjA1OV5BMl5BanBnXkFtZTcwODUwNTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Patric, Irène Jacob, Thomas Lockyer | See full cast and crew »"],
      "reviews": [
         "\"Incognito\" is one of those gems that you have to dig deep to discover. A relatively unknown movie, I bumped onto it as it was shown on the TV: I started viewing it hoping it to be at least watchable, and I was pleasantly surprised to realize that in fact it was really good. The story is about a highly talented arts forger (Patrick), who agrees to paint a fake Rembrandt picture for $500,000. However, things get complicated when a girl he sleeps with (Jacob) happens to be one of the experts to judge its authenticity, and she gives the painting thumbs down. As if this were not enough, his employers change their tune with him, and this is when everything turns rather sour... Jason Patrick is really good in his role; so good in fact, that I re-aligned my overall rating for him completely after this movie (it wasn't that high before that, as you can imagine). Irene Jacob is also good as his girlfriend, while Rod Steiger plays a small role but still manages to remind us of his grand standing. The film is well-directed, with the pace running smoothly; neither unnecessarily fast, nor boringly slow. All in all, a surprisingly good film: 8/10.",
         "I have seen this movie more times than any other. There is something unusual about this movie: you like it but can not really figure out what exactly makes you feel that way. There is suspense and drama here. The direction is good and so is the part played by the actors. The story grips you almost from the beginning until the last scene. The movie lets you roam around the inner circles of art and forgery. Probably all this adds up to make it a movie that one enjoys watching, any time, all the time.",
         "A bit of a pleasant surprise (considering its lack of theatrical release in the NY area), Incognito is a fairly involving drama/thriller involving a disturbed artist who's gotten so entangled in the underworld of art forgery he's never formed an identity of his own...he does a great Rembrandt, but Irene Jacob spots it as a fake, which both infuriates and attracts him...a murder occurs and the pursuit is on, with him trying to clear his name and trying to become a \"real\" artist...Patric is a little too brooding and pouty, making him hard to like for much of the film (C. Sheen or J. Depp could make him a much more sympathetic \"bad\" boy), but beautiful location work (widescreen, too -- I saw the laserdisc -- on video it's probably a mess) and the lovely & talented Ms. Jacob make it a surprisingly unique experience...check it out.",
         "Yes, the production values of INCOGNITO (especially the gauzy photography) smack of \"B\" Level production, this film shines for a few reasons, most notably the peek into the world of Art, Art History and Art Forgery. Anyone who considers themselves curious about both Rembrandt, his place in the art world, and the art world's place in history will enjoy this movie. The performances are excellent, and it deserved better than Direct to Video.",
         "I was VERY pleasantly surprised by this one. Its dialogue on the true meaning of great art is truly interesting, even if simplistic (but not relative to most films out there). I thought Patric was pretty good, but it's the script itself that does most of the work. The scenery and imagery is also fantastic.",
         "Although sometimes way too slow-moving and not as involving as it should have been, this film was almost a \"keeper\" in my collection. The story was different, and I liked it, about an artist producing a fake Rembrandt. Jason Patric, an interesting and underrated actor, played the role on the con 'artist,' so to speak. Appealing-looking Irene Jacob, played the female lead. She was likable, unlike Patric's character. There are some interesting moments in this film, particularly for those who love art. There also are a few nice shots of Jacob that should please most male viewers. Overall, nothing that super but decent and worth a rental. It's different, I'll say that.....but don't expect a lot.",
         "I just saw this piece on Czech TV. Although it was somewhat spoiled by translation, it caught my attention from the beginning till the finale. The cooperation of editing and screenplay is very good, it made me feel like watching some James Bond movies ... except this one was based on art, of course. I also loved the pace of this pleasantly surprising film, it flew with no significant faults. There are many films on TV in our country and majority of them are pure crap. Especially when you see them on midnight hour. This one was really pleasant and I am glad I spent my time with it. 7/10 Really watchable !",
         "Well, not technically sound all the way through, but for 2am on HBO, this is quite a good little movie. Patric seems a little lost, and the whole thing with his father isn't done very well, but Jacob is always nice to watch, and there were enough interesting parts and nice shots, to keep one's attention. In any event, watching those paintings was pretty cool. Pretty good. All in all, a rather pleasant movie.",
         "This movie made me very frustrated. It is a well acted movie, especially by Irene Jacob, but even Jason Patric does a an OK job. The villain is quite general but well conceived. The biggest problem is the script, which is very intelligent. So why is this a problem? Because no matter how intelligent it is, it still has huge holes. For example, in the beginning Harry (Jason Patric) is seen running from the police on TV. Was there a cameraman present? And why is the TV black-and-white? Then after him and Marieke know each better (if you get my drift), she says that she has to leave in a hurry, yet she is not hurrying. Also, why does Alastair (Thomas Lockyer) kill his Korean partner? Wasn't it enough to accuse Harry of theft? Finally I saved the worst for last: They (Harry and Marieke) are in a London suburbs and Harry uses the phone. Then Marieke who believed herself kidnapped locks Harry in the telephone booth. She locks him from the outside!!!!What is the logic in that? I can understand the lock to be on the inside (Harry's side) but on the outside?! Yet if you'd like to see a well structured, yet flawed thriller, see \"Incognito\". It has a boring beginning, an exciting middle and an utterly unsatisfying ending. 5/10",
         "Harry Donovan is an art forger who paints fake Rembrandt picture for $500,000. The girl he meets & gets into bed with in Paris, Marieke turns out to be an arts expert. Harry's clients are using to check the counterfeit picture he painted. I knew this was going going to be a class A film but it does give a good the peek into the world of Art, Art History & Art Forgery. Anyone who considers themselves curious about Rembr&t, his place in the art world, & the art world's place in history will enjoy this movie. There are some interesting moments in this film, particularly for those who love art. The movie is actually much more complicated that the short summary I have provided. Jordan Katz's screenplay is full of authoritative, fascinating facts about how art is variously made, copied, authenticated & exposed as fake. 'Incognito' could serve as a handy tool for teaching courses in the detection of art forgery. Directed by John Badham, a Hollywood hack with a decent commercial track record (Saturday Night Fever, Short Circuit, War Games, Stakeout) Jason Patrick is really good in his role Patric is believable in his role as a suffering artist & skillfully shifts from unlikable to sympathetic. ; Irene Jacob is also good as his girlfriend (she is known for her films with Krzysztof Kieslowski) Rod Steiger plays a small role but still has the staying power of the great actor we know. The romance with Jacobs, who plays, Marieke van den Broeck, reminds us of a \"39 Steps\" Hitchcock kind of way. The European locales (Dutch, Spanish,Parisian) are very much like paintings & the director & cinematographer did a good job here. Too bad the DVD transfer was so poor. The film is well-directed. I found the DVD transfer poor & grainy etc. I guess in 1997 transfers were not as good as now. The movie looked pretty poor on my big screen HDTV. I think this film had limited release fared poorly & was sent right to DVD. Really I don't know why as it really a pretty acceptable thriller."
      ],
      "genres": [
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": ["Harry Donovan is an art forger who paints fake Rembrandt picture for $500,000. The girl he meets and gets into bed with in Paris, Marieke, turns out to be an arts expert Harry's clients are using to check the counterfeit picture he painted."],
      "budget": 0
   },
   "movielensId": 1675,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-11-14",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["John Badham"],
      "runtime": 108,
      "movieId": 1675,
      "title": "Incognito",
      "mpaa": "",
      "actors": [
         "Jason Patric",
         "Irène Jacob",
         "Ian Richardson",
         "Rod Steiger",
         "Thomas Lockyer"
      ],
      "imdbMovieId": "0119365",
      "originalTitle": "Incognito",
      "genres": [
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["nFkn_Ep8j1I"],
      "plotSummary": "Harry Donovan is an art forger who paints fake Rembrandt picture for $500,000. The girl he meets and gets into bed with in Paris, Marieke, turns out to be an arts expert Harry's clients are using to check the counterfeit picture he painted.",
      "tmdbMovieId": 45928,
      "avgRating": 3.18462,
      "releaseYear": "1997",
      "numRatings": 130,
      "posterPath": "/1oqfg2IBGNFAFylDK56NXo558y2.jpg"
   }
}