{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nun",
            "id": 745
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "hospital",
            "id": 11612
         },
         {
            "name": "half sister",
            "id": 210018
         }
      ],
      "imdb_id": "tt0118901",
      "video": false,
      "title": "Critical Care",
      "recommendations": [
         128056,
         128998
      ],
      "backdrop_path": "/xT2Izx9Eki9ZRGTmet0ttTLhr4p.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dr. Werner Ernst",
               "gender": 2,
               "credit_id": "52fe464ec3a368484e08981b",
               "name": "James Spader",
               "profile_path": "/gFDjZje8P0S3MzHuw1cxiYuHBX5.jpg",
               "id": 13548,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Felicia Potter",
               "gender": 1,
               "credit_id": "52fe464ec3a368484e08981f",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Stella",
               "gender": 1,
               "credit_id": "52fe464ec3a368484e089823",
               "name": "Helen Mirren",
               "profile_path": "/4EGgBJPUBz68ZrnFuLVo01r0uND.jpg",
               "id": 15735,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Butz",
               "gender": 2,
               "credit_id": "52fe464ec3a368484e089827",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nun",
               "gender": 1,
               "credit_id": "52fe464ec3a368484e08982b",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Furnaceman",
               "gender": 2,
               "credit_id": "52fe464ec3a368484e08982f",
               "name": "Wallace Shawn",
               "profile_path": "/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg",
               "id": 12900,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Bed Two",
               "gender": 2,
               "credit_id": "54bd21f8c3a3681da0001bb5",
               "name": "Jeffrey Wright",
               "profile_path": "/wBh9rwK3aRr1hCrSRLxxPHKzGeU.jpg",
               "id": 2954,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Constance 'Connie' Potter",
               "gender": 1,
               "credit_id": "54bd2205c3a3684046005e51",
               "name": "Margo Martindale",
               "profile_path": "/4YmmVgOGKsDsGGLunCHmigj2TbV.jpg",
               "id": 452,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Dr. Hofstader",
               "gender": 2,
               "credit_id": "54bd2216c3a368389c0045bc",
               "name": "Philip Bosco",
               "profile_path": "/8B8EQk868fQF8fGZ1w33XDV5Z1S.jpg",
               "id": 6541,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Robert Payne",
               "gender": 2,
               "credit_id": "54bd2227c3a3681da0001bbc",
               "name": "Edward Herrmann",
               "profile_path": "/3AGRAverIuT6kgSfGQPiY55QZzG.jpg",
               "id": 52995,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe464ec3a368484e089817",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54bd21c9c3a3686c6100a6f9",
               "name": "Steven Schwartz",
               "profile_path": null,
               "id": 162532,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54bd21d69251411d7700ae54",
               "name": "Richard Dooling",
               "profile_path": null,
               "id": 1415591,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "55571004c3a3687782005ded",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5557101fc3a3687782005df1",
               "name": "Steven Schwartz",
               "profile_path": null,
               "id": 162532,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55571066c3a3687774005562",
               "name": "David Watkin",
               "profile_path": null,
               "id": 10639,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5557107d9251411e5b0053d2",
               "name": "Tom Swartwout",
               "profile_path": null,
               "id": 53468,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5557108fc3a368776a005107",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "555711139251411e5700571d",
               "name": "Philip Rosenberg",
               "profile_path": null,
               "id": 20968,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5557118d9251411e5b005410",
               "name": "Dennis Davenport",
               "profile_path": null,
               "id": 29219,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "555711a5c3a368777e0052fb",
               "name": "Enrico Campana",
               "profile_path": null,
               "id": 1467298,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "555711bcc3a368776c004fbb",
               "name": "Carolyn Cartwright",
               "profile_path": null,
               "id": 20838,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "555711d7c3a368776f00605d",
               "name": "Dona Granata",
               "profile_path": null,
               "id": 944971,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "555711f5c3a368776c004fc0",
               "name": "Blanche McDermaid",
               "profile_path": null,
               "id": 1457045,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "555712079251411e540050ea",
               "name": "Karen Pidgurski",
               "profile_path": null,
               "id": 1401601,
               "department": "Crew",
               "job": "Unit Publicist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.387452,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         }
      ],
      "id": 61337,
      "vote_count": 10,
      "budget": 0,
      "overview": "Werner Ernst is a young hospital resident who becomes embroiled in a legal battle between two half-sisters who are fighting over the care of their comatose father. But are they really fighting over their father's care, or over his $10 million estate? Meanwhile, Werner must contend with his nutty supervisor, who insists that he only care for patients with full insurance. Can Werner sidestep the hospital's legal team and do what's best for the patient?",
      "similar": [
         27029,
         40807,
         1367,
         11005,
         510,
         2064,
         416477,
         10312,
         48138,
         26976,
         1523,
         1597,
         1700,
         2300,
         1903,
         4922,
         7446,
         567,
         1281,
         109414
      ],
      "original_title": "Critical Care",
      "runtime": 107,
      "poster_path": "/nqDcgfwBPAOW5kZzAdfXXcu3FqT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mediaworks",
            "id": 12451,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "ASQA Film Partnership",
            "id": 44419,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Live Entertainment",
            "id": 285,
            "origin_country": ""
         }
      ],
      "release_date": "1997-10-31",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sidney Lumet"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Richard Dooling",
         "Steven Schwartz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118901/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MjUyMzA5OF5BMl5BanBnXkFtZTcwNTk5OTcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: James Spader, Kyra Sedgwick, Helen Mirren | See full cast and crew »"],
      "reviews": [
         "This film takes its place beside many comedy/dramas touching on the inadequacies of the medical profession, such as Otto Preminger's \"Such Good Friends (1971)\" and Arthur Hiller's \"The Hospital (1971).\" Though the comedy here is not as \"black\" as those films, which concentrated more on the incompetencies of some doctors and nurses, \"Critical Care\" finds its humor in the insurance-driven medical profession today. Albert Brooks is absolutely wonderful as the epitome of a doctor caring only about the bottom line. His only concern is whether or not a prospective patient has medical insurance, and his decision to keep a comatose patient with no chance of recovery alive is based solely on the fact that the insurance company pays $9,500 per week (\"cold cash\") if he's alive, and zilch if he dies. Conversely, an emergency patient has very little priority if he has no medical insurance. The reason to see the film is Albert Brooks, in a much different role than he usually plays. The setup is a bit contrived, but is easily forgiven. I also enjoyed the brief roles of Wallace Shawn as the devil (called \"furnaceman\" in the credits) and Anne Bancroft as sort of an angel in a nun's habit.",
         "This film should be required viewing for all physicians, insurance execs and lawyers. The story is a dark comedy which looks at the twisted mess that is our modern healthcare system. James Spader is perfect as a cynical medical resident who learns the hard way about the realities of dealing with a patient's family, lawyers and the insurance games played by hospital administrators. As a family practice physician I can say that the plot of this film rings true on many levels....the stress of being a resident, the battle between family members, insurance companies and hospital administrators and the conflicting expectations of all involved. A favorite of the Sundance Channel and with good reason. A great flick...",
         "Sidney Lumet shows why he is a unique voice in the American cinema with his take on the state of medicine in this country. Mr. Lumet, working on the screen play by Steven Schwartz, based on Richard Dooling's excellent book, presents us a story about what's wrong with our health care system. His acerbic take on the way some physicians conduct themselves goes underneath the surface as he explores what happens when there's a complication as a young doctor is drawn into a family drama that involves the hospital where he is an intern. If you haven't seen the film, maybe you would like to stop reading. We are taken to an new intensive care unit of a big hospital. Everything is so impersonal that one doesn't get any feeling of warmth in the way the people are seen in their beds, as they are being treated from different ailments. Young doctor Ernst is an intern assigned to that area. He shows signs of fatigue because of his long hours on duty. Our attention is directed to the patient on Bed 5, an older man who is comatose. His younger daughter, dressed to the nines, comes to pay a visit that seems more of an excuse to flirt with the doctor, rather than her concern about the state of her own father who doesn't show any signs of life. Dr. Ernst is dazzled by the beautiful Felicia. When he asks her to go to dinner, she accepts all too readily. At the same time we are introduced to the head nurse of that area, Stella, a woman who has seen suffering and death frequently. She goes to assist Bed 2, a young black man who has a kidney problem. All this patient wants is to die. Who can blame him? His parents, on the other hand, have a different idea. This man is visited by a sinister figure who stands, as a devil figure. Stella wants to help, but she her hands are tied. Young Dr. Ernst has his own troubles. He works for a doctor that keeps paging him, but when he goes to his office, the man, doesn't even remember calling him. This man is suffering from a loss of memory caused by his heavy drinking. Dr. Butz is the worst nightmare as the head of the department. All he cares is about if the patient has an insurance policy that will pay whatever he, and the hospital will demand. Bed 5, alone, has been billed for more than a hundred thousand dollars! Dr. Werner Ernst in a moment of carelessness falls for Felicia's charms. Little does he knows that she is using him for her own greedy purposes. Felicia, and her sister Connie, are battling because of the clause in their Bed 5 father's will. A lot of money is at stake; each woman is fighting for it in their own dirty way. Dr. Ernst has an epiphany when the nun-like figure comes into Bed 5's room and confronts the doctor with some facts that resonate in the young doctor. Finally, everything comes to a head as the two sisters bring law suits against the hospital. This is when the legal system comes into play. We see the ugly faces of all the different factions. In a great confrontation at the end of the film, we see all different lawyers and doctors as they prepare to fight. Dr. Ernst, in a daring moment gets the warring parties together. James Spader, as Dr. Ernst, is nothing short of perfection. His take on this young intern, in the middle of the mess that has been created around him, is amazing. Helen Mirren, as Stella, the kind nurse makes another invaluable contribution to the film. Kyra Sedgwick, is Felicia, the pretty young daughter who doesn't care about the dying father. Margot Martindale plays Connie, the other sister. Jeffrey Wright is the patient Bed 2 in a great performance. The surprise of the film though, is Albert Brooks, whose Dr. Butz is one of the best characters of his career. The rest of the cast is first rate. Sidney Lumet is to the congratulated for tackling this thorny issue about what's wrong in the country in the fields of medicine, law, and insurance.",
         "A very sarcastic film, and quite an entertaining one, too. Although (or maybe because) many of the truths about the American medical system presented seem to have been taken directly from Samuel Shem's novels, and despite the hard to believe ending, this movie is fun to watch. Its relatively low imdb rating is prove for the relatively low level of humor that most people share. I recommend this movie to any medical student, trust me- you will enjoy it.",
         "It is hard to say HOW this film escaped my radar..... Just saw it in IFC and was amazed at the breadth of talent on it along with the wonderful ideas. Would like to see it a couple of more times just to digest it. Don't own a TV - my girlfriend does; I only watch it when I see her. Why on earth this movie did not get proper distribution ? Strongly recommend. Wallace Shawn's character made me think of All that Jazz - don't ask me why. Maybe due to their life/death discussions. Ed Hermann was really astonishing as a lawyer.Kira Sedgwick and James Spader were truly wonderful together. Hope to hear some feedback.",
         "Well I liked this a lot. I have only seen THE NETWORK so far from the same director and I am more willing now than before to check more. Thought provoking as few films can be & having a context dealing with many interesting, philosophical topics, this will probably appeal to the majority of serious film fans. Located in a hospital, it comments on euthanasia, doctor's and medical personnel everyday life, medical care VS. money but then again, much much more. Not long before the end, and after some smart religion-centered dialogs, I was a bit disappointed by the \"religious\" overtone given mostly the \"nun\"-character, but in the next scenes the film delivers again... Highly recommended, but it can be a bit depressing at times for the very sensitive ones.",
         "Not bad medical drama hampered by the fact that for a great deal of the film Spader's character behaves like an idiot. This isn't the actors fault, he gives as good a performance as possible considering the actions forced on him by the script. He is certainly supported by a high quality cast in almost every role. Kyra Sedgwick is annoying and not terribly convincing but she is the lone sore spot. Helen Mirren is wonderful as an understanding and compassionate nurse and Albert Brooks a stitch as a loony doctor well past his sell by date. The script has many holes but it does make a strong plea for doctors seeing patients as people not just science projects and sources of income.",
         "Directors as renowned and diverse as Sidney Lumet only come along every so often. This great director had such an incredibly long career as a filmmaker before his unfortunate passing earlier this year. His career spanned fifty years and practically every genre you can think of. Only a few times did Lumet tackle comedy, and Critical Care is one of those times. The movie takes place in a hospital where Dr. Werner Ernst (James Spader) becomes helplessly involved in a legal battle between two half-sisters who are fighting over the $10 million inheritance of their comatose father. Werner has to put up with this feud as well as his senile supervisor, Dr. Butz, played by an almost unrecognizable Albert Brooks, who insists that Werner only take care of patients with health insurance. Werner must maneuver around the legality of the hospital in order to do what is right for the patient in this twisty, wacky, nutty, and all around fun flick from the late and great Sidney Lumet. Critical Care is a fairly straightforward film when you boil it down. There isn't a lot going on here, but what it has to offer is entertaining enough. It's a witty little film with fun characters and great performances. I thoroughly enjoyed James Spader as the film's lead, as he carries the film well, but the film is really lifted up by its supporting cast. Helen Mirren plays the head nurse on Spader's floor, who has a profound outlook on life, even if she has very unorthodox ways of showing it. She isn't in every scene but when she stops by it always seems she is there to give some sort of advice or perspective on the wacky situation the other characters find themselves in. Jeffrey Wright has a small part as a dying patient who sees visions of the devil coming to take his soul. The devil is played by highly unexpected Wallace Shawn. The sub story that develops between Wright and Shawn, as well as Mirren, is a fascinating parallel to the central story of the film. Kyra Sedgwick and Margo Martindale play the two half-sisters fighting over their father. Sedgwick is a seductive model whose devious ways get Spader into more trouble than he bargained for. Martindale is a deeply religious woman who uses God as her safety net for everything she says about her father and the situation she is in. Her over the top character effectively pokes fun at devout Christians who believe Jesus is the answer to all problems, something I'm always a fan of. But my favorite character of them all is easily the curmudgeonly Dr. Butz, played incredibly well by Albert Brooks in an hysterical role. Dr. Butz is grumpy, unethical, and very technologically challenged, making for some silly yet amusing running jokes in the film. I looked forward to every scene with Brooks as the nutty geezer and was always satisfied with whatever scene he appeared in. When you get right down to it, Critical Care is a film that you watch, enjoy, then forget. I really liked this flick. It made me laugh and it didn't waste my time or insult my intelligence. It's simple enough and not something to do back flips for. It's a small film, very minimalistic, but makes the most out of what it has. The actors are great and the variety of characters are all fun. I couldn't see myself watching this film again but it was at least an effective use of an hour and forty minutes of my time.",
         "Man, talk about a missed opportunity. This oddly obscure medical film from prolific and uneven legend Sidney Lumet attempts to bridge the gap between comedy and drama, and although occasionally in succeeds (mostly in the snarky repartee between doctor James Spader and nurse Helen Mirren), it mostly fails due to a lack of depth in its characterization, and everything is attempts to do, \"Scrubs\" has done better at least 10 times a year. It's basically the plot of the second half of \"Million Dollar Baby\", from the doctors' point of view, with all the random hospital jokes and long-winded speeches that come with that. Actually, considering Margo Martindale's presence at the vegetable's side, it feels more like that film that I was comfortable with, heh. But, being a James Spader movie, there has to be a random sex scene in the middle of it, and it got me out of that funk. It's not as kinky as I would have anticipated, although he does tape it. Actually, the cast is *shockingly* fabulous and makes me sad that they were wasted in such a middling film. In addition to Spader, we have Kyra Sedgwick (in a bizarrely-dressed performance), Helen Mirren, Anne Bancroft, Albert Brooks, Jeffrey Wright, Wallace Shawn, Colm Feore AND Edward Hermann. Really, you got THAT group together and made a lame, jokey hospital melodrama? Shame on you, Lumet. It moved quickly and rarely grew painfully tiresome, but as every joke felt flat and every emotional scene fizzled harmlessly, it just made me nostalgic for the time two hours earlier when I was watching \"Scrubs\". Those were great times. {Grade: 5.5/10 (C+/C) / #55 (of 66) of 1997}",
         "Movie tries to be funny but fails in its attempt. Also, the movie has such a simplistic ending. Basically 2 sisters are fighting over their dad who is on his death bead. One sister wants the dad to be taken off life support soon so that he will die and she can collect all of his money. The other sister will receive all the money if the dad lives long enough. The hospital want's to keep him alive until his insurance runs out. The sister who wants the dad to die, seduced a doctor and is blackmailing him with a video tape and threatens to turn the video over to the hospital if he doesn't cause her dad to die. The solution the doctor proposes is the solution most normal people would think of with only a few seconds of thought needed. And the way the doctor forces the solution and wraps up the whole film in a couple of minutes is just too simplistic. It was a dumb movie and an even worse ending. 3 stars out of 10."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "ASQA Film Partnership",
         "Live Entertainment",
         "Mediaworks"
      ],
      "summaries": ["Werner Ernst is a young hospital resident who becomes embroiled in a legal battle between two half-sisters who are fighting over the care of their comatose father. But are they really fighting over their father's care, or over his $10 million estate? Meanwhile, Werner must contend with his nutty supervisor, who insists that he only care for patients with full insurance. Can Werner sidestep the hospital's legal team and do what's best for the patient?"],
      "budget": 12000000
   },
   "movielensId": 1677,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-31",
      "dvdReleaseDate": "1998-02-18",
      "directors": ["Sidney Lumet"],
      "runtime": 107,
      "movieId": 1677,
      "title": "Critical Care",
      "mpaa": "R",
      "actors": [
         "James Spader",
         "Kyra Sedgwick",
         "Helen Mirren",
         "Albert Brooks",
         "Anne Bancroft",
         "Wallace Shawn",
         "Jeffrey Wright",
         "Margo Martindale",
         "Philip Bosco",
         "Edward Herrmann"
      ],
      "imdbMovieId": "0118901",
      "originalTitle": "Critical Care",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["NnqNzGt9BiQ"],
      "plotSummary": "Werner Ernst is a young hospital resident who becomes embroiled in a legal battle between two half-sisters who are fighting over the care of their comatose father. But are they really fighting over their father's care, or over his $10 million estate? Meanwhile, Werner must contend with his nutty supervisor, who insists that he only care for patients with full insurance. Can Werner sidestep the hospital's legal team and do what's best for the patient?",
      "tmdbMovieId": 61337,
      "avgRating": 2.60714,
      "releaseYear": "1997",
      "numRatings": 182,
      "posterPath": "/nqDcgfwBPAOW5kZzAdfXXcu3FqT.jpg"
   }
}