{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "forbidden love",
            "id": 3691
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "british high society",
            "id": 157258
         },
         {
            "name": "privileged life",
            "id": 184950
         },
         {
            "name": "1910s",
            "id": 210184
         }
      ],
      "imdb_id": "tt0120520",
      "video": false,
      "title": "The Wings of the Dove",
      "recommendations": [
         29946,
         38244,
         25520,
         23333,
         25985,
         175956,
         61280,
         8447,
         18701,
         46278,
         41801,
         16771,
         37636,
         48862,
         46280,
         45174,
         33358,
         42707,
         51145,
         47844
      ],
      "backdrop_path": "/qsUbGzkSkcXwx2T2DLhFGlpgkqK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kate Croy",
               "gender": 1,
               "credit_id": "52fe46cbc3a36847f8112785",
               "name": "Helena Bonham Carter",
               "profile_path": "/rHZMwkumoRvhKV5ZvwBONKENAhG.jpg",
               "id": 1283,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Merton Densher",
               "gender": 2,
               "credit_id": "52fe46cbc3a36847f811279d",
               "name": "Linus Roache",
               "profile_path": "/u98VM2S9mbUMCMPvCpk2OUn4Eg2.jpg",
               "id": 3900,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Aunt Maude",
               "gender": 1,
               "credit_id": "52fe46cbc3a36847f8112795",
               "name": "Charlotte Rampling",
               "profile_path": "/iuggCphmBfNoUFaUWfpJCTxX4e6.jpg",
               "id": 44079,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lord Mark",
               "gender": 2,
               "credit_id": "52fe46cbc3a36847f8112791",
               "name": "Alex Jennings",
               "profile_path": "/k0HulWVLwUpwbNubQpHXpSaxdI9.jpg",
               "id": 15739,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Lionel Croy",
               "gender": 2,
               "credit_id": "52fe46cbc3a36847f8112799",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Millie Theale",
               "gender": 1,
               "credit_id": "52fe46cbc3a36847f8112789",
               "name": "Alison Elliott",
               "profile_path": "/b34krbD7KsLySeEI323lGhING2l.jpg",
               "id": 15675,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Susan Stringham",
               "gender": 1,
               "credit_id": "52fe46cbc3a36847f811278d",
               "name": "Elizabeth McGovern",
               "profile_path": "/egt1d836NcYDTeiokz5Im8gHU4r.jpg",
               "id": 4513,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Journalist 1",
               "gender": 2,
               "credit_id": "5a24c0f90e0a264cc40cdf74",
               "name": "Ben Miles",
               "profile_path": "/erYrlzzg8F85SqEqG1cRZ9Ftjkh.jpg",
               "id": 11280,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Journalist 2",
               "gender": 0,
               "credit_id": "5a24c10ac3a3680b8a0d04ce",
               "name": "Philip Wright",
               "profile_path": "/wOuNk0ndcH0dhQPsl8b4uajip5L.jpg",
               "id": 24273,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cbc3a36847f81127a3",
               "name": "Iain Softley",
               "profile_path": "/citetzG3VlJ402NcaWicUHffxfl.jpg",
               "id": 1978,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cbc3a36847f81127a9",
               "name": "Sandy Powell",
               "profile_path": "/6J0JwsWmFv3vKEguRTV71aK5J.jpg",
               "id": 9027,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "55d1a60992514131a5009a2e",
               "name": "Hossein Amini",
               "profile_path": "/4JAxOnHRrFIZ9sv8oRoWxLFA3go.jpg",
               "id": 56960,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a24c1760e0a264cc80dace7",
               "name": "Henry James",
               "profile_path": "/xR2YUBp0saT4Ss4uRHNWtpBfNnG.jpg",
               "id": 39013,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.876808,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 45609,
      "vote_count": 43,
      "budget": 0,
      "overview": "Kate is secretly betrothed to a struggling journalist, Merton Densher. But she knows her Aunt Maude will never approve of the match, since Kate's deceased mother has lost all her money in a marriage to a degenerate opium addict. When Kate meets a terminally ill American heiress named Millie traveling through Europe, she comes up with a conniving plan to have both love and wealth.",
      "similar": [
         281957,
         994,
         141,
         185,
         634,
         627,
         769,
         4771,
         452507,
         133805,
         2142,
         400,
         3134,
         241765,
         398181,
         10995,
         2275,
         2252,
         948,
         8810
      ],
      "original_title": "The Wings of the Dove",
      "runtime": 102,
      "poster_path": "/wEqXtfzZfjYbCSztc4YYEc4AJJ6.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1997-11-07",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "A couple with everything but money. An heiress with everything but love. A temptation no one could resist.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Iain Softley"],
      "runtime": 102,
      "synopsis": "In early 1900s London, England, Kate Croy lives under the careful watch of her domineering Aunt Maude, who is determined that the young woman does not follow in the path of her recently deceased mother, whose dissolute husband, Lionel, squandered her wealth in order to support his opium addiction. Maude wants Kate to marry the well-off Lord Mark who has a title and estates, despite the fact that Kate does not love him. Kate is dependent on her wealthy aunt's goodwill, but abandons her plans to defy her aunt when she is reminded that her father is at Maud's mercy as well. Kate's boyfriend, the financially struggling muckraking journalist Merton Densher, wants to marry her, but is skeptical of Kate's intentions despite her pleas for him to wait as she tries to find a way out of her dilemma. One day, Kate is introduced by Lord Mark to the wealthy and outgoing American orphan and heiress Millie Theale, who is on an extended trip through Europe with her best friend Susan Stringham, and the cynical Kate is captivated by Millie's beauty, openness, and amusement at the conventions of society. Millie and Kate become fast friends and Millie invites Kate to accompany her and Susan to Venice, Italy as part of their excursion. Prior to their departure, Millie meets Merton, with whom she is smitten, and she asks him to join them. Lord Mark secretly reveals to Kate that Millie is terminally ill, and that he desires Kate but has to marry Millie to avoid losing his estates. Knowing Millie is repulsed by Lord Mark's crudity, she decides to adopt his scheme and persuade Merton to woo Millie. She fully expects Millie's generous nature will lead her to include Merton in her will, making him wealthy enough to satisfy her aunt and allow them to marry. He despises her scheme but can't resist the opportunity to be in Venice with Kate. Over the next several days, Kate becomes so jealous of the genuine affection growing between Merton and Millie that she lures him away one night, abandoning Millie in a crowd. Millie confronts her the next morning and Kate realizes she must leave, without warning Merton, if her scheme is to succeed. What neither she nor Merton anticipate is how things will change when she is gone. Some months later, following Millie's death in Venice, Kate comes to Merton's flat. She asks why he has not come to see her and finds a letter, telling Merton that Millie did indeed bequeath a sizeable portion of her estate to him. He tells Kate that he will not take the money, and she must marry him without it, if she will. She agrees, and they re-cement their bond by making love. But afterwards, Kate asks him to tell her that he is not still in love with Millie, or his memory of her, and he cannot. So, Merton returns to Venice... alone.",
      "writers": [
         "Henry James",
         "Hossein Amini"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120520/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzMjczODc4Nl5BMl5BanBnXkFtZTcwODQ5NjYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Helena Bonham Carter, Linus Roache, Alex Jennings | See full cast and crew »"],
      "reviews": [
         "In this most affecting adaptation of Henry James's dense and difficult novel, Ian Softley brings passion back to the oft-derided genre of \"period\" movie. There are many angles in the story; tales of deception, social hypocrisy, conflict between our hearts' desire and our conscience, of regrets, and some degree, of just deserts. However, in the heart of it lies an unforgettable love triangle, fuelled by the amazing performances of the three leads. Helena Bohnam-Carter, in the pinnacle of her career, embodies the fierce intelligence and ruthless determination of Kate Croy, a woman born in a wrong era, whose effort to hold on to both love and wealth tragically backfires. Linus Roache, playing Kate's secret love, brings tortured Merton Densher (where does James come up with these names?) vividly to life. He has the sort of intense good looks and physical presence required for this role in spades; and his dramatic ability shines though, especially in his last scene with Millie, where he acknowledges his duplicity before the all-accepting love of the dying girl with an incredible raw emotionality. I was most impressed with Allison Elliot's Millie, however. The angelic Millie could have been a big cliché of a character, but in Elliot's skillful hands, Millie takes on the luminance of spirits and love of life that grow even as her physical strength fails. The story and the actors are tremendously aided by gorgeous cinematography (especially the mournful beauty of rain-soaked Venice) , costumes-to-die-for by Sandy Powell (who wore that fabulous red dress to this year's Oscar, accepting the award for \"Shakespeare in Love\". She should have won it for this film), and beautiful music. A movie to be watched in a dark rainy afternoon, and savored like fine wine.",
         "The Wings of the Dove is an incredible film. Helena Bonham Carter performs her role with nuances of visage and body, and in particular eyebrow, which capture the essence of Kate's manipulation and longing. Everyone performs well. The cinematography is some of the most beautiful I have ever seen on film--it ranks near Vertigo as one of a few films which breach entertainment and are masterpieces of art. The Venetian and Edwardian locales never cease to fascinate and titilate the viewer. The final sequence represents graphically the vacuity which has enveloped Kate and her love with haunting realism. Do not watch the film to be \"entertained\"--it depresses with little reserve and wrenches the heart. Let the music, camera, and Bonham Carter sweep you into the magic of this cinematic masterpiece.",
         "I can't believe there are only two comments for this film. It's a subtle film and a rare one in which your feelings for the characters change. I have read the book, and seen all the other films made of Henry James novels, and this one is by far the best at translating at least some of the moral ambiguity at the heart of most James novels. Helena plays a woman forced to give up her boyfriend Merton because he has no money. She meets and befriends a wealthy, but terminally ill American, Milly. She decides that Merton will court Milly, inherit all of Milly's money when she dies, and have the funds to marry Helena. The film is about Merton's moral awakening as he realizes how horrible what he's doing is, and WHO Helena's character really is. You would have to read the novel to understand how difficult it is to adapt this material, and what a great job they really have done. Bring your hankies for the scene near the end (not in the novel, actually) in which Merton apologizes to Milly. This invented scene crystallizes all of the emotion and makes the movie fulfilling in a way a straight working of the novel could not have been. Helena is good, but her character is simplified somewhat from the book. I think this should have at least been up for Best Picture. See it. --- Check out website devoted to bad and cheesy movies: www.cinemademerde.com",
         "This was not one of my favorite novels when I read it (for James, I prefer THE PORTRAIT OF A LADY), but this is a very good film. Director Iain Softley and writer Hossein Amini made the smart decision to move this up in time to the 1910's, which enables them to get to the passions more than James does here. Softley also makes this darker than most literary adaptations, in look and in tone, without suffocating it, and he avoids making this a film about production design rather than about a story. He does labor a bit in trying for tragedy, but that's only a quibble. Alison Elliot, a good actress (I liked her in THE UNDERNEATH and the otherwise flawed THE SPITFIRE GRILL), takes awhile to warm up as Millie, because she seems a little too modern, but she avoids easy sentiment as the dying heiress. Linus Roache, who I thought was a little awkward in PRIEST, here avoids the trap of being the third wheel, making us understand what both Millie and Kate see in Merton. But the real triumph here is Helena Bonham Carter, who gave the best performance of the year. One character says of Kate, \"There's something going on behind those beautiful lashes,\" and that can usually be said of the characters Carter plays, but sometimes she's overly detached. Here, she's completely engaged, and she pulls off the difficult trick of never losing our sympathies even when her character does something despicable. And where James sort of made Kate just manipulative, Carter makes her human and longing.",
         "It's nice to see that some directors still believe that a great movie is subtle. No need to hit audiences over the head to get the point across. Think 'Howard's End.' Think 'Remains of the Day.' Think 'A Passage to India.' Wings of the Dove is in the same league. Helena Bonham-Carter is magnificent as she takes us from thinking of her in sympathetic terms, to beginning to have second thoughts about her character, to becoming aghast at the cold calculation of her plot. No one is good or evil here, merely human and full of beauty, pain, and unworthiness. I loved it. And most of all, it's a moving PICTURE. The night scenes in the gondola are some of the greatest cinematography ever. 'Titanic' didn't come close.",
         "There are two tests in my mind for a classic film. First, it must plant some images permanently in your life. Very few films do that. Two films that are cogent to discussing this one are Helena Bonham Carter's Ophelia in Zefferelli's `Hamlet.' She and Glenn Close acted circles around the guys -- her expression in the midst of the play within the play is lasting over years in my memory. The whole film revolves around that moment. Also lasting are several images from the ostensibly unambitious `Oscar and Lucinda.' But I also carry many lasting film images that are junk, courtesy of Lucas and Spielberg. That brings us to the second condition: for a film to be classic, evocation of the images, the remembrance, needs to be multidimensional, to elevate rather than dumb down. Measured by those rules, this film is remarkable. For a few years, I have carried the image of the next to last scene where Carter makes love and in the act discovers the truth about her love. This is so wonderful, so tragic, so true that it has stuck with me, together with the secondary images, the memories of Venice and Millie that Merton is in love with. I hope to follow this woman's career for decades. I wonder where it will go?",
         "\"The Wings of the Dove\" poetically unveils itself with beautiful visuals and explorations in to the complexities of desire. A tragic irony, with an excellent finale. This movie also contains the most painfully emotive sex scene that I have ever seen; as it is honest and detailed with emotions that so rarely are captured this brilliantly in 'art'. This movie is intimate.",
         "This one really took me by surprise, in the best way possible. The story is a perfect blend of suspense and romance that is flawlessly engaging from start to finish. I couldn't help but keep my eyes glued to the screen the entire time. It flows beautifully and never moves too far ahead or too slow for the viewer. There wasn't a single second where I was bored or waiting for the film to end. I'm not usually the biggest fan of a period romance, but I was blown away by this one. The score is incredible. It sets the perfect ambiance for the film and makes you feel like you are with these characters. The ending left me in a complete catharsis. I was just numb, staring at the screen in disbelief. Helena Bonham Carter is unexplainably phenomenal. She is one of a rare breed of actors who can display more emotion simply with her eyes than most actors can with their entire body. I feel blessed to watch her perform. Her extreme versatility and authenticity is unparalleled. Her performance is the best from a female that I've ever seen. The Academy should be in jail for giving the Oscar to the mediocre Helen Hunt over Bonham Carter's flawless tour de force.",
         "This is one of my favorite films of the 90's. Great cast, fantastic screenplay, simply an incredible telling of a compelling story. The movie moves along in organic fashion, never feeling contrived or manipulative (probably because the story comes from a good novelist). The characters are well developed and make the choices you believe these characters would make. Helena Bonham Carter, Linus Roach and Allison Elliot are all excellent, and Charlotte Rampling is always good. I also like the contrast set up with the dreary English settings vs. the romantic and elegant Venetion scenes. I think this movie is vastly underrated and should be seen by any serious film fan.",
         "Kate (Helena Bonham Carter) is a young woman in love with a poor journalist, Merton (Linus Roache). Its Edwardian England and, having no money of her own, Kate lives with a wealthy aunt (Charlotte Rampling) who is avid to marry Kate well. Thus, the beautiful lady will not be free to wed Merton or any man of her choosing, if he doesn't have the goods. They meet secretly and passionately, even arranging a clandestine trip to Italy. Once there, the two cross paths with an extremely wealthy American, Millie (Alison Elliott) who casts her eye on Merton. Since neither Kate nor Merton have revealed that they are a couple, a difficult triangle is created, for Millie also chooses Kate as a friend. This becomes even more complex when the British duo learn that Millie, despite being young and beautiful, is incredibly ill with a respiratory ailment. Temptation arrives. What would happen, Kate asks Merton, if HE romances Millie, marries her and inherits her wealth upon her death? Why, the secret lovers would be set for life! Merton is appalled at the idea of making advances on a dying girl but, eventually, gives in. What neither Kate or Merton count on is the young gentleman's growing attraction to Millie, for she is sweet and funny as well as very lovely. Is tragedy in the future for this trio? Unfortunately, yes. This stunningly gorgeous film, based on the novel of Henry James, is a superior piece of movie making that cannot be denied. The three actors, Bonham Carter, Roache, and Elliott are extremely compelling in their difficult roles and all of the lesser cast members do fine work, too. Then, the setting in Italy, mostly, is lovely, with cinematography of the very finest. Costumes, too, are gorgeous, especially Elliott's garments and accessories. But, naturally, it is the powerful story of love and deception, with tragic results, that is the strongest asset of all. It should be stated that there are a couple of explicitly sexual scenes that might upset a few viewers. But, for the majority of film fans, they will be accepted as a necessary part of the story's elements. If you have never picked up this film, don't delay! Wings of the Dove is a soaring achievement that should be seen by everyone who loves great cinema."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Miramax",
         "Renaissance Dove"
      ],
      "summaries": [
         "Kate Croy's mother was born to wealth and privilege, but she threw it all away to marry Kate's father, a penniless opium addict who admits to having stolen from his wife. After her mother's death, Kate is offered an opportunity to return to the life her mother gave up. There is a condition, however: Kate must sever all of her old ties, not only to her father, but also to her lover, the muck-raking journalist Merton Densher, whom she has promised marriage. Kate reluctantly agrees to this, and in the meantime becomes friendly with \"the world's richest orphan,\" Millie Theale, an American making the Grand Tour. Desperate to see Kate, Merton crashes a party that she and Millie are attending, and Millie is attracted to him. When Kate learns that Millie is dying, she comes up with a plan to have her cake and eat it too...but all does not go as planned.",
         "In the early years of this century, an impoverished British woman, Kate Croy, seems trapped by and dependent upon her wealthy aunt. Befriending a fatally ill, rich American woman provides Kate with not only a trip to Venice, but an opportunity to break free of her aunt and her poverty.",
         "An impoverished woman who has been forced to choose between a privileged life with her wealthy aunt and her journalist lover, befriends an American heiress. When she discovers the heiress is attracted to her own lover and is dying, she sees a chance to have both the privileged life she cannot give up and the lover she cannot live without."
      ],
      "budget": 0
   },
   "movielensId": 1683,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1997-11-07",
      "dvdReleaseDate": "1999-09-14",
      "directors": ["Iain Softley"],
      "runtime": 102,
      "movieId": 1683,
      "title": "The Wings of the Dove",
      "mpaa": "R",
      "actors": [
         "Helena Bonham Carter",
         "Linus Roache",
         "Charlotte Rampling",
         "Alex Jennings",
         "Michael Gambon",
         "Alison Elliott",
         "Elizabeth McGovern",
         "Ben Miles",
         "Philip Wright"
      ],
      "imdbMovieId": "0120520",
      "originalTitle": "The Wings of the Dove",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Jyymh5Wil7o"],
      "plotSummary": "Kate is secretly betrothed to a struggling journalist, Merton Densher. But she knows her Aunt Maude will never approve of the match, since Kate's deceased mother has lost all her money in a marriage to a degenerate opium addict. When Kate meets a terminally ill American heiress named Millie traveling through Europe, she comes up with a conniving plan to have both love and wealth.",
      "tmdbMovieId": 45609,
      "avgRating": 3.68971,
      "releaseYear": "1997",
      "numRatings": 2011,
      "posterPath": "/wEqXtfzZfjYbCSztc4YYEc4AJJ6.jpg"
   }
}