{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116592",
      "video": false,
      "title": "I Love You, I Love You Not",
      "recommendations": [
         38509,
         26108
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "52fe46c9c3a36847f81120e1",
               "name": "Claire Danes",
               "profile_path": "/6Lr3Yc53iifCPtJz1jTzjhVxa0j.jpg",
               "id": 6194,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "52fe46c9c3a36847f81120e5",
               "name": "Jude Law",
               "profile_path": "/4077Cyuo1mw53u1gNjLyQkqeZN0.jpg",
               "id": 9642,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "52fe46c9c3a36847f81120e9",
               "name": "Jeanne Moreau",
               "profile_path": "/5T4FjqcFiStJVZvlaNkzFFPslw2.jpg",
               "id": 14812,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46c9c3a36847f81120dd",
            "name": "Billy Hopkins",
            "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
            "id": 3192,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.33446,
      "production_countries": [],
      "id": 45565,
      "vote_count": 11,
      "budget": 0,
      "overview": "School student and her European-born grandmother share sad stories of their lives.",
      "similar": [],
      "original_title": "I Love You, I Love You Not",
      "runtime": 88,
      "poster_path": "/A5GdAeUX727UrGKBngMWFS6dlmM.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-08-28",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Billy Hopkins"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Wendy Kesselman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116592/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1ODY5MTYwMF5BMl5BanBnXkFtZTcwMzU3MjkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeanne Moreau, Claire Danes, Jude Law | See full cast and crew »"],
      "reviews": [
         "I am so angry at this film that it will be very difficult for me to contain the harsh words that are ready to spew from my mouth. This will not be a review for young readers. I Love You, I Love You Not was an atrocity from beginning to end. From both the disgustingly poor editing, to the sloppy acting, all the way to the horrendous themes that seemed to plot two random events together this film screamed \"After School Special\". In fact, now that I think about it, \"After School Special\" would be too delicate of a summary, it instead felt like a eager undergraduate film student attempting to be smart by attempting to poorly summarize the Holocaust with the turmoil of being a high school student. Hopefully the professor of this assignment saw the project and properly gave it the \"F\" it deserved. Hollywood completely outdid itself on this doozy of a film. I am surprised that the Jewish community didn't find this film offensive in the way that it trivialized the events of the Holocaust and compared them to the social troubles of a High School girl. I was upset by this occurrence, and I am not even Jewish. After this short film viewing, I felt dirty, upset by the Hollywood community, and ready to shout obscenities at everyone involved with this project. I Love You, I Love You Not was just another Hollywood attempt to monopolize on Claire Danes' My So-Called Life popularity while trying to be overly symbolic by involving the Holocaust. Is anyone else as sick as I am about this disgraceful marriage? I do not understand at all what director Billy Hopkins was attempting to convey with this film. The themes were muddled in a slew of choppy editing and horrid flashbacks that left my mind in a confused knot. In one instance we had Danes unwilling to spend time with her grandmother, while in the next instance she was opening up everything in her life to her, while in the next she was making out with the mirror, and suddenly in the next she was asking Moreau to tell her a nightmarish bedtime story involving Robert Sean Leonard. Wouldn't that give anyone nightmares? It did give everyone nightmares and preempts our next step into the randomly anti-Semitic High School in which Danes attends. Unlike other films that use the Holocaust to show the injustices of the world, like in School Ties, this film randomly interjects the anti-Semitic moments near the end as if only to help strengthen already dead climax. Like nearly every scene in this film, the supposed \"high-points\" come and go nearly as quickly as modern fashion, leaving the viewer with nothing at all. I walked away of this film with an embarrassed look. While there may have been some attempt at meaning behind Billy Hopkins' camera, what eventually was released was a childish attempt to combine the trivial life of a High School girl to that of the monumental disaster known as the Holocaust. Could you put these two together? A great director probably could, but Hopkins' could not. All that it seems that he wants to create are meaningless dramatic plot-holes coupled with beautiful people. Which, ultimately, leads me to the acting. While \"abhorrent\" would be a light word summarizing the purely absent acting of Danes, Law, and Van Der Beek, it is the only one that I could think of. Danes, using the same character structure from My So-Called Life in this film, could not find her way out of a paper bag if she tried. I could hear Hopkins in the background saying, \"Give me more Angela Chase, I hired you for Angela, I WANT ANGELA\". Her character is all over the place, manic depressive in one moment, happy the next, chaotic throughout, pitiful entirely. I loved the fact that she was a \"reader\", but one of the most ignorant characters created. You would think that with all the books she would have learned from them, sputtering quotes throughout the film, but alas, that never happened. Again, we were left with only Angela Chase. Award winning Jeanne Moreau bounces of the non-existent acting of Danes by providing her own character which does not fit into this film. Obviously disturbed by her time in Auschwitz, Moreau never develops this. She allows Danes to walk all over her, creating a weak grandmother and a needy, spoiled granddaughter. Throw in \"boy-toy\" Jude Law only for looks (because his character was as transparent as Saran wrap) and you have the worst cast in cinema. Nobody did any work with their characters, but instead walked around the set happy to be earning some, if any, money for their roles. I am surprised that both Danes and Law were able to pull themselves out of the I Love You, I Love You Not rut. Overall, this was a confusing film that was only proved worse by torrential acting, very ill cinematography, a hasty Hollywood story (very obviously created by the infamous recycle machine), and by combining a trivial moment in a teenager's life with the historical hardships of the Holocaust. That would be similar to me trivializing the horrible deaths on the beaches of Omaha with me not getting a date for my Senior Prom. That just is painful to hear and visually see. The acting was non-existent, but obvious ploys to get a younger audience to attempt to connect with the story. The direction was nauseating. The constant flicking between present day and past stories kept me dizzied for days afterwards. Then, there was the uproarious casting of Robert Sean Leonard, I couldn't help but laugh when I continually saw him on screen. The only actor worth mentioning in this film was Julia Stiles, but that was because she kept her mouth shut. This was a disaster from the beginning and should be forgotten by all! Grade: * out of *****",
         "Sad, strange little movie stars Claire Danes as Daisy; a shy, bookish girl attending an elite private school in New York. When she's not gushing over the delectable Ethan (Jude Law), she's spending time with her Nana in the countryside reading books and listening to Nana's tales of her survival of the holocaust. The movie tries to intertwine the themes of post and modern day anti-semitism via Nana's stories and flashback sequences with Daisy's trials and tribulations at school when knowledge of her Jewish heritage is made public. Unfortunately, as hard as this movie tries, it never quite hits the mark. The performances from Danes and Moreau though are heartfelt, and the message is there for those who want to see it. This movie means well and attempts to educate us on one of the all time greatest blights on mankind - prejudice. Worth a look for early performances from Jude Law, James Van Der Beek and Julia Stiles before they hit the big time.",
         "Well, this is certainly a fast forward movie to be rented, with many parts that could be zapped past. It does explore how one grows up and deals with the pains of youth, and surprisingly, it does end with a splash that isn't expected, yet makes sense in review the movie. It's certainly worth seeing along with a field trip to the Simon Wiesenthal Center in Southern California to understand the background of the story and to get a better grasp of the complexities of emotions that many have to deal with even today. But it isn't a movie that is very deep nor giving. The viewer is left sitting there with the ending, and yet wondering why bother as the movie does deliver fully in engrossing the viewer and placing them into another world. It is a third person movie and you are that 3rd person -- a casual observer never to really enter. A first draft, by a child, compared to Schindler's List.",
         "Essentially, this movie has all the makings for..well, a better one. Claire Danes plays a quiet girl with sad eyes, and unloving parents who spends most of her time with her Grandmother. One day in english class, she reads aloud a poem written about Jude Law's character, \"Ethan\", who is the stereotypical jock/playboy on campus. The two get together...blah blah blah.. I won't tell you anymore except the the ending is VERY dissapointing. It's as though the movie just, ends. You don't see it coming, you feel like it should be starting to get good, and the plot holes filled up..well, they aren't, and it does. It's really quite aggrivating. Jude Law and Claire Danes performances are great, but not quite enough to push this movie onto my favourite list. But, don't let me discourage you, it's worth the rent.",
         "For me this film is unsuccessful in intermingling the issue of antisemitism with the coming of age of a relatively studious young woman. On one level the Jude Law character might be only marginally deeper than his disgustingly callow friends. He is attracted by the young woman's seriousness and relatively shy affection for him but this attraction is offset by her social conservatism. The depth of any antisemitism in him or amongst his silly friends is never explored. In the end the motivation of his character, and the point of the film, elude me. An interpretation that springs to mind is that gentiles do not feel the significance of the holocaust, that they trivialise it. Part of coming of age for jewish girls is therefore that they should (or simply do) experience failed love affairs with gentiles. The fact that these affairs fail for these reasons is somehow constructively educational for the girls. I truly hope this is not intended to be the message.",
         "A girl who loves to stay with her grandmother who was a jew survivor from the \"camps\" of Hitler, but hides her story, falls in love with an athlete guy in a high-school where the teens have prejudice against her and her way of life. Sweet, but slow movie, although Danes and Moreau are superb.",
         "I had to watch this movies twice. The first viewing left me a bit off kilter, a bit confused - as to how I felt about the film (the performances etc..) and the story. What I have decided after watching it over: This story is unique, nice. I felt the 3 main roles where well given. Claire Danes is the classic thoughtful and misunderstood child [My so called Life leading the way for teenage 'angst' series; Juliet - in Romeo and Juliet]. She pulls off the dreamy look. Jude Law, a fitting choice for Daisy's shy affections as her 'perfect' guy. The rest of the cast? Gone. Scratch all of them. I felt James Van Der Beek was totally unconvincing as a taunter/verbal bully (?). There were definitely angles in the film that needed work - particularly Ethan's character, and his interaction with his friends. If you try and come to some conclusion about them - you draw a blank. An intended one? I don't know. As well as Daisy's home life needed work. I can't decide whether it is left out on purpose or not. The directing, for me, was what ultimately let the story down rather than enhancing it. No lingering shots, no closeups where there should have been, particularly during Ethan and Daisy's interaction. It's hard to explain, but the shot's didn't work. Didn't create the feeling the movie needed to work. And this is a story that deserves to work.",
         "This movie was 80 minutes long??? It seemed twice that! I Love You, I Love You Not is certainly not horrible, but it's not a movie I'd really care to watch again. I was strolling through Blockbuster searching for a film to watch over the weekend when this particular one caught my eye. Even though I'm not a Claire Danes fan (though she did a fine job in Little Women), I saw Jude Law's name and knew I had to rent it. I was disappointed. This film is contrived, cliched, and doesn't know whether to be totally serious or humorous. It fails on all counts (especially the hokey scene at the school assembly)! The narrative of this movie is totally choppy, and the Holocaust scenes and the school scenes don't seem to blend in well together. If they'd focused solely on the romance of Jewish Daisy and Gentile Ethan the film might have really gone somewhere. This is not to say that Jeanne Moreau doesn't shine as Nana, she absolutely radiates. Claire Danes gives an OK performance, and had the role and the story in general been better, she could've done a terrific job as Daisy. And what about Daisy's parents? They are almost never mentioned. What exactly is her relationship with them? The true saving grace is Jude Law as Ethan. We can see why he is entranced by Daisy, as she is not the \"typical\" cheerleader giggly type who hangs all over him. We understand how he gives in to the prejudice around him when it comes to Daisy and his friends. I believe, especially after Mr. Law's success in The Talented Mr. Ripley, he is going to take Hollywood by storm and make all sorts of great movies. Let's just hope they're all better than this one!",
         "Daisy (Claire Danes) is a young Jewish girl in a private school in New York City. An only child with a strained relationship with her parents she begins a relationship with Ethan (Jude Law) Mr. Perfect jock and scholar. After experiencing Anti-Semitism she finds comfort in her Nana (Jeanne Moreau.) A concentration camp survivor she helps Daisy accept who she is by telling her stories and playing mediator between Daisy and her parents. With a look into Jewish life both during and after the Holocaust, this movie is moving. With young actors like Jude Law, Claire Danes and James Van Der Beek you can't not like this movie. A well written story and good acting makes up for the lack luster ending.",
         "Eighteen years later and it's still being shown? What an embarrassment for all. Did anyone read the script before agreeing to do this? This movie is jaw-droppingly bad and cringe-inducing. The story is insipid and that's being generous. The terrors of the Holocaust in this film could have been substituted for a disappointing shopping trip to Barney's. The characters are all extremely attractive but shallow and undeveloped, the settings and art direction are as beautiful and unrealistic as a Ralph Lauren magazine spread. That's the problem with the entire movie--everything is pretty, clean and sterile. The acting is direction-less, a waste of a fine cast. The only reason I could think of why this 90 minutes of wasted time came to light is the back story of a casting director calling in favors from agents and the studio because what he really wanted to do was direct."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+",
         "Chrysalis Films",
         "Die Hauskunst"
      ],
      "summaries": [
         "Prep school student Daisy and her European-born grandmother Nana share the sad stories of their lives: Daisy tells Nana of her romance with young Ethan and problems in school because she's Jewish; and Nana tells of her young years under Nazis when she was sent to ghetto and then to concentration camp.",
         "English-raised young gentleman Ethan is his New York prep school's lacrosse captain and girls' dream prince. Yet he takes a romantic interest in Daisy, the silly-shy social misfit, whose rare only hobby is reading, while confiding in and relaxing only with her 'nana' (grandma), a Nazi concentration camp surviver. However Ethan's platonic romance stage patience runs out and Daisy can't cope with insensitive pranks at school."
      ],
      "budget": 0
   },
   "movielensId": 1685,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-08-28",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Billy Hopkins"],
      "runtime": 88,
      "movieId": 1685,
      "title": "I Love You, I Love You Not",
      "mpaa": "NR",
      "actors": [
         "Claire Danes",
         "Jude Law",
         "Jeanne Moreau"
      ],
      "imdbMovieId": "0116592",
      "originalTitle": "I Love You, I Love You Not",
      "genres": [
         "Drama",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "School student and her European-born grandmother share sad stories of their lives.",
      "tmdbMovieId": 45565,
      "avgRating": 2.95361,
      "releaseYear": "1996",
      "numRatings": 97,
      "posterPath": "/A5GdAeUX727UrGKBngMWFS6dlmM.jpg"
   }
}