{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "human animal relationship",
            "id": 2526
         },
         {
            "name": "whale",
            "id": 4676
         },
         {
            "name": "killer whale",
            "id": 155529
         }
      ],
      "imdb_id": "tt0113114",
      "video": false,
      "title": "Free Willy 2 - The Adventure Home",
      "recommendations": [
         18519,
         1634,
         34751,
         9446,
         17414,
         10438,
         10714,
         11076,
         25059,
         29918,
         11164,
         10680,
         36355,
         332,
         11888,
         11806,
         11231,
         11158,
         6116,
         11894
      ],
      "backdrop_path": "/vdAvXHSrzzLli220pbXEbTUGT6a.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jesse",
               "gender": 2,
               "credit_id": "52fe44d8c3a36847f80ad815",
               "name": "Jason James Richter",
               "profile_path": "/sdFFQNefNEfiFiyIL8Sz6IweUkM.jpg",
               "id": 18259,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Glen Greenwood",
               "gender": 2,
               "credit_id": "52fe44d8c3a36847f80ad819",
               "name": "Michael Madsen",
               "profile_path": "/azCognW0p1hl2bJFH31ZNtcTJ3R.jpg",
               "id": 147,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Annie Greenwood",
               "gender": 1,
               "credit_id": "52fe44d8c3a36847f80ad81d",
               "name": "Jayne Atkinson",
               "profile_path": "/Ae4wkn9x4JABoFWlNtdABYv2uol.jpg",
               "id": 18261,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Randolph Johnson",
               "gender": 2,
               "credit_id": "52fe44d8c3a36847f80ad821",
               "name": "August Schellenberg",
               "profile_path": "/iZ7dQ3JMdrWoUyh4vB8vOxhqoSI.jpg",
               "id": 18260,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Nadine",
               "gender": 1,
               "credit_id": "5341bd37c3a368150700229f",
               "name": "Mary Kate Schellhardt",
               "profile_path": "/nN54NVsxm5M6yhdQlSECm2y5vxK.jpg",
               "id": 8184,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Elvis",
               "gender": 2,
               "credit_id": "5341bd4ec3a36814ff0021ea",
               "name": "Francis Capra",
               "profile_path": "/fmFbfu6OeimG24ShcEAybcsEDNz.jpg",
               "id": 17918,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Dwight Mercer",
               "gender": 2,
               "credit_id": "5341beb6c3a368151e0021ca",
               "name": "Mykelti Williamson",
               "profile_path": "/8TTxzpuvvpw2tB8xZBCDslYupNU.jpg",
               "id": 34,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Kate Haley",
               "gender": 1,
               "credit_id": "5341becfc3a3681517002202",
               "name": "Elizabeth Peña",
               "profile_path": "/ePeN3h3UDH9S4THwxwWjQQyK3cH.jpg",
               "id": 7430,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "John Milner",
               "gender": 2,
               "credit_id": "5341bee2c3a36815070022ce",
               "name": "Jon Tenney",
               "profile_path": "/fiG1bW6DX1szsRDPIYjfIKPQ0kV.jpg",
               "id": 4602,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Bill Wilcox",
               "gender": 2,
               "credit_id": "5341bef3c3a368152f0023da",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44d8c3a36847f80ad827",
               "name": "Karen Janszen",
               "profile_path": null,
               "id": 56909,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d8c3a36847f80ad82d",
               "name": "Corey Blechman",
               "profile_path": null,
               "id": 18256,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44d8c3a36847f80ad839",
               "name": "Jennie Lew Tugend",
               "profile_path": null,
               "id": 14337,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44d8c3a36847f80ad83f",
               "name": "Lauren Shuler Donner",
               "profile_path": "/uwuWpT2xyhwlrfSCk6xTTvrRvEE.jpg",
               "id": 7200,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d8c3a36847f80ad845",
               "name": "Basil Poledouris",
               "profile_path": "/jEUcVOa9gppkDvr5MJOvSD5KVtj.jpg",
               "id": 7728,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d8c3a36847f80ad84b",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d8c3a36847f80ad851",
               "name": "Robert Brown",
               "profile_path": null,
               "id": 14339,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d8c3a36847f80ad857",
               "name": "Dallas Puett",
               "profile_path": null,
               "id": 2533,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d8c3a36847f80ad85d",
               "name": "Dwight H. Little",
               "profile_path": "/9Q77ZzYvRkVmfdU6twRQyvW4YB8.jpg",
               "id": 56998,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59e6fc309251411cb9004608",
               "name": "John Mattson",
               "profile_path": null,
               "id": 56488,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 6.559327,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9073,
      "vote_count": 161,
      "budget": 0,
      "overview": "Jesse becomes reunited with Willy three years after the whale's jump to freedom as the teenager tries to rescue the killer whale and other orcas from an oil spill.",
      "similar": [
         1634,
         12707,
         18519,
         9273,
         205775,
         13053,
         9325,
         168,
         10010,
         28178,
         927,
         928,
         424488,
         15370,
         158999,
         12227,
         579,
         381289,
         404378,
         10339
      ],
      "original_title": "Free Willy 2 - The Adventure Home",
      "runtime": 95,
      "poster_path": "/yLyyjm4m3fSvbazyFv4RtUnb2uQ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Bahasa indonesia",
            "iso_639_1": "id"
         },
         {
            "name": "Bahasa melayu",
            "iso_639_1": "ms"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Alcor Films",
            "id": 644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Donner/Shuler-Donner Productions",
            "id": 5739,
            "origin_country": ""
         },
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-07-19",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/aef15QAJ8Kxbh8W5zXqJb1f9Vhw.jpg",
         "name": "Free Willy Collection",
         "id": 9328,
         "poster_path": "/3M2Q9ZDTyFBfi3ohz2gizFmnoL0.jpg"
      },
      "tagline": "The adventure is back. The fun is back. Willy's back. And this time he's brought his whole family to meet an old friend ... and take on a new challenge.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dwight H. Little"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Keith Walker",
         "Karen Janszen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113114/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjgyNTc4Mzk4OV5BMl5BanBnXkFtZTcwMDgwMDQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason James Richter, Michael Madsen, Francis Capra | See full cast and crew »"],
      "reviews": [
         "First of all, I have to say what I liked original Free Willy movie. In fact, I fall in love with it. I suppose it is one of the best family movie and best animal movie so far. For some reasons Simon Wincer, who directed the first movie didn't return for making this sequel, though we can see again all major characters from Free Willy. Our main hero, Jesse is now fourteen years old and he finds out that his mother passed away and he has a stepbrother named Elvis. Elvis hasn't got any relatives except Jesse and he arrives to Greenwood's home. The whole family goes to the holiday trip in a camping near an ocean's cove where Jesse again meets his friend Randolph and Willy. Willy found his family and all seems perfect for the friends but suddenly another danger threatens their friendship. But now it's even more serious. The movie was released in 1995, eight years before notorious tanker \"Prestege\" shipwrecked near Spanish coast and ruined hundred of miles of coastline, not to mention that millions living creatures got killed in the result. It was a real message and it passed absolutely unnoticed because for many people these movies are just cheesy movies for kids only. And in the real life the main reasons of the monstrous disaster was absolutely same \u0096 money. The other problem point of the movie is rather difficult and complicated relation between Jesse and his much younger stepbrother, Elvis (played by Francis Capra). Elvis, who has lost his mother, also feel himself very uneasy about the situation and now both boys have to decide how to deal with this difficult situation. The story is basically good written and leaves some place for action and excellent scenes in the cove, including underwater shots. This time we can see whales in their natural habitat, not in the small pool. Whole movie is well shot and locations for shootings are very suitable and good selected. Jason James Richter is as good as in original movie and Francis Capra also did a very good job as rather annoying Jesse's half-brother. The soundtrack (again written by Basil Poleydoris) is worth mentioning alone because of its rather good musical themes and songs. A very good movie for whole family and not a brainless laughable family entertainment that very often bring to us Hollywood studios. A nice message for young audience that you must always think about defending the wild nature and what in real life there are more important things than money. My vote 8,2 out of 10 or between B+ and A-.",
         "This movie is just as good as the original. It presents a more complex theme, and one that is a common problem with all marine animals. It was funny seeing Jesse impress Nadine by showing off his relationship with Willy. Plus, I think that Nadine, aka, Mary Kate, is a cutie! I want to marry her! The problem with the oil spill isn't original, but it reminds us to always keep a look out for the orcas' safety. This movie differs from the first movie in the fact that it shows willy with his family, it shows orcas in a pod, and it shows their relationship as a family. How sweet! Willy is a very sociable whale. If you want the excitement and thrilling adventure that you got in the first movie, check this one out asap. Safe for the entire family!",
         "My Take: Preachy, eco-friendly sequel, but has its moments. Let go of your \"Save The Whales\" placards, allow FREE WILLY 2: THE ADVENTURE HOME do the job for you. If you thought the original FREE WILLY had enough \"Free the Whales\" slogans to match a 3-ton Orca's weight, FREE WILLY 2 is even bigger, with its environmentalist propaganda that is! In its story and characters, it lacks that certain oomph of the original, which elevated it from its predictable genre origins. FREE WILLY 2 is much more predictable, with a by-th-numbers storyline that might just entertain the kids and give adults a toothache from all its sweetness. Still, for what its worth, FREE WILLY 2 is enjoyable family affair. I say it's at least worth a rental. For the record, at least its a better bargain than FLIPPER or even, not that it has any connection, JAWS: THE REVENGE. The storyline is more filled of \"Save the Whales\" slogans than ever before. After leaving Willy (Keiko, assisted by an animatronic and CG double) from his leap of faith in the original's finale, Willy faces a new threat, this time outside the confines of a small tank. Jessie (Jason James Richter), now grown-up, is out to save the day again. The story also provides him a sort-of-girlfriend (Mary Kate Schellhardt) with a deep concern for the environment (Couldn't this movie ever be more nature-friendly?) and even a little brother named Elvis (Francis Capra), who is just so... annoying. Not that the film is crowded with good guys, bad guys and beleaguered whales, but why did they actually think that this kid, annoying and a bit spoiled at some point, would deepen the film's emotional level? Why they think a kid as nearly annoying as Elvis (who's simply annoying quips are more than enough to drive you to the breaking point) would be a good way to stretch Jessie's character, I really don't know. Still, as family entertainment, FREE WILLY 2 does just about enough for a mild recommendation. The photography is adequate, capturing on film a lively shot of its environments and, of course the whales. I've read a trivia about the film that it uses much more animatronic whales than the first film, yet it's really hard to spot in most scenes due to the rather seamless effect. The story is shallow, predictable, but actually quite believable, although the Jessie-Elvis brotherhood is something that can easily be removed without doing any harm to the story. As family entertainment, I at least give it a fair and easy recommendation. Rating: *** out of 5.",
         "free willy 2: the adventure home i think is a good movie, but i still prefer the first free willy movie. This movie was made in 1995. The movie starts with Willy with his family, Randolph (Now a best friend to Jesse) hears willy's whale voice, he records the voice and is chuffed to show it to Jesse when ie sees him. Jesse is know grown up by 4 and a half inches. Randolph sets out to collect Jesse to take him to the sea and to see Willy again, Jesse can't believe his eyes when he sees willy and is amazed to see him as a bigger whale. Jesse meets Randolph's god daughter Nadean. They both become friendly to each other and get along together very well. Things become worse for the whales as oil is spreaded all over the sea, Luna (Willy's sister) is in danger as the oil gets into her lungs, Jesse starts to panic and calls Randolph, Jesse alos has a half brother called Elvis who is an 8 year old kid, He always wanted to help the whale but jesse's foster parent say that he is too young, he then runs away and then comes back. Things become eveen worse when fire spreads with the oil still, in the sea, nadean and elvis are rescued but jesse loses grip of holding onto the ladders, Willy saves him by going under the flames and bringing him to safety. I give this movie 10 out of 10.",
         "[CONTAINS SPOILERS] It's been two years since Jesse had helped his friend, Killer Whale Willy, become free in the ocean. Now, Jesse is 14 and is living a happy life with his new parents, The Greenwoods. They are going on a vacation by the lake. Jesse received some sad news one afternoon. His long lost mother was found--dead. Jesse also learns that he's got an 8 year old brother. His name's Elvis and he was as obnoxious and annoying as anyone could get. Elvis comes to stay with Jesse and his family so they take him to the lake with them. Jesse meets up with Randolph again and learns that Willy and his family are close by! Jesse also meets Randolph's niece and falls head-over-heels for her. Jesse has a tough time sharing a tent with Elvis, so he goes to the pier and surprise: Willy pops up. Willy's existence is again in jeopardy. An oil tanker ran aground and is spilling oil into the water! It infects Willy's little sister Luna. Jesse and Randolph hurry to the rescue. Elvis wanted to help, but everyone told him to get lost. So he did. He over hears some men planning to sell Willy and his family to a theme park, so Jesse, Elvis, and Randolph's niece, Nadine, must put a stop to it! Glenn let's them borrow his little boat--unbeknownst to him. The oil has caught fire. Everyone's life is at stake, but they make it out. Willy and his siblings rejoin their mother and swim back to sea. This movie was as good as the first. It has more action, but was still good. See it if you already haven't. --",
         "The boy is back. The whale is back. Most of the supporting cast from the 1993 cult classic \"Free Willy\" is back for the sequel, which hit theaters before an excited crowd of youngsters and their parents in 1995. But the cheer-inducing magic that I loved so much in the original has gone in \"Free Willy 2: The Adventure Home\" which isn't quite the adventure that the title seems to hint at. The title just seems more marketable and that's the way the movie feels, too. It's got the typical monotonous, rushed feeling that I tend to find most sequels have and while it's far from a disaster, it is a letdown from the warmness and nostalgia-stirring charm that I adored so much in the original film. In the last movie, the beloved orca Willy (Keiko) leaped to safety from greedy marine park owners and escaped to the wild while the little boy he befriended, Jesse (Jason James Richter) finally came to peace with his foster parents. Two years later, Willy is still running free in the wild with his kin and the boy is reaching that age. You know. The age where girls send his heart pumping and the news that he has a half-brother strikes him like a ton of bricks. His estranged mother has passed away and so he and his foster parents have to take the unwanted, obnoxious brat from New York (Francis Capra) on their camping trip. Jesse's not so interested in camping, but more in meeting up with his old friend (August Schellenberg), his pretty goddaughter (Mart Kate Shellhardt), and of course, lovable Willy and his family. But things take a turn for the worse when an oil tanker runs aground in the cove where the whales are living and it's then that I realized \"Free Willy 2: The Adventure Home\" should have been titled \"Free Willy 2: The Escape\" because that's more of what it's about. Or why not just \"Free Willy 2\"? Oh, yeah. Marketable. Everything that I loved so much in the first movie has been watered down here. First of all, the sheer awe and magic of the killer whales. Whereas I could really feel the majesty and the amazing presence of Willy and the other whales in the first film, here it seems more like placid outtakes from a rather cheap documentary, as if the cast cheering at the sight of Willy were doing so at pictures and not the real thing. Amazing as it sounds, but even though his namesake is the title of the movie, Willy has very little to do with the movie at all. He's really just there for more marketing value. It's not until the third act, the only energized moment in the picture, that he really comes into play and even though, just briefly. Furthermore, the character dynamics are diminished. The sequel tries to explore the further complications of Jessie's life, but it only cracks open the doors of opportunity, never exploits them. The dynamic between him and his foster parents is just dimmed-down reruns of the same stuff we saw in the first movie. Even his relationship to the whale is dumbed away. But how about his new cast mates? Well, Mr. Capra does what he can, but he has one of the most aggravating characters in children movie history to play here. Even when his heart gets put into the right place, he's really hard to put up with and as a result, becomes hard to care about. And pretty and talented as she is, as Jesse's love interest, Miss Shellhardt does not have much to do and their romance is contrived, tiresome, tedious, and boring. As most teenage love stories are. Maybe that's just the key. Maybe the reason I've never bought teenage love stories in movies is because I don't believe in them. I don't buy the gimmicks they use here, especially considering the age. But that's a subject for another day. The point is: their scenes together go on forever but leave about as much impact as a speck of sand on the wing of a plane. The first two acts of \"Free Willy 2\" are really slow-going. Not until the third act does the movie even pick up a little. The director, Dwight H. Little has talent. He knows how to use a camera well and he has skill with working around actors and his crew. The movie is well-shot...most of the time. The whale scenes aren't very well-staged. But what ultimately founders the movie is the severely diminished screenplay. Now I saw this movie more than ten years ago, as a child, having fallen in love with the original film. But whereas the first \"Free Willy\" stuck in my memory into my adulthood, this one did not. I only remembered flashes of it. Looking back on it again, I can clearly see why.",
         "In my opinion, none of the sequels can stand up to the first, though this one is pretty good. I find the acting to be good, for the most part. Elvis is portrayed perfectly as the delightfully annoying pest of a little brother, though his character development is shown well as the movie progresses. It felt nice to watch Elvis and Jesse grow closer until the ending, where it seemed as though they had grown up together and shared a bond. Nadine is a nice addition to the cast of characters, providing Jesse with a love interest. It was nice to watch their bond develop and grow as the movie went on as well. The only complaint I have about the acting is the scene at the dock where Jesse is first reunited with Willy (aside from having seen him from a distance on Randolph's boat). I felt as though there could have been much more emotion shown from Jesse. He was obviously happy to see Willy again, but I expected more excitement and enthusiasm. The storyline is believable and brings attention to the very real problem of oil spills. Some consider it a bit preachy, but I'm glad this movie spreads awareness about the damage oil spills do to the environment instead of just the tourism industry. The robots in this movie were phenomenal, though in the scenes where Jesse introduces Nadine to Willy, and the ending after Willy saves Jesse from the fire, some of the paint on the chin spots is visibly missing (half of one of the spots is gone) and in some scenes it appears as though the spots in Willy's right eye-patch aren't there at all. Minor mistakes compared to how real and believable the robots are, though. Overall, a good movie with a good message to spread. Recommended.",
         "I really enjoyed the first film, it was sweet and cute, and elevated to a greater level by that wonderful killer whale Keiko who played Willy. This sequel is not as good, but it is decent. I do agree the story isn't as good or as believable this time around, the script lacks sparkle and the direction isn't as clever. But it is beautifully filmed, with lovely cinematography and scenery, and the score is really pleasant. Free Willy 2 mayn't be the most fast-paced movie ever made, but it moves briskly, and the message is admirable. What makes the movie charming though is the cast, Jason James Richter is still very likable and Francis Capra is funny and natural here. Mary Kate Schellhart and Michael Madson also do nice work, however it is the orcas that steal the show, every scene with them in is utterly riveting. Overall, inferior but nice and pleasant. 7/10 Bethany Cox",
         "although i know everyone doesn't agree with why they are making sequels. but for this movie this was a reasonable answer and i supported this reason. The reason that they made this movie is because warner brothers needed to let people know about what was happening with that whale in person. Because he was going through a tough time and he was in poor health at that aquarium that he was at. and they needed the money to transfer him to oregon so he can improve his health a lot better and be trained to go to the wild. not that i blame them but the wild was not such a good place for him. even though keiko's family was there it was still not a good place for him to be do to the drama most of the orca's were experiencing. the only thing i didn't get is why didn't the free willy foundation sell keiko to anyone that can afford to take care of him in person. someone who will have a tank all prepared for keiko (a huge tank) and be there to take care of him in person, like make sure he's OK and all and to give him his treatments when needed. that would have been better instead of donating money to get some kind of kit. But anyhow the movie itself I have to give it a rating 10 out of 10 after all this movie had a wonderful story and a wonderful point.",
         "Plot close to unbelievable but absolutely stunning photography. Plus relatively fast-paced action still make superior family viewing for those with kids 10-14 range."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": [
         "Alcor Films",
         "Canal+",
         "Donner/Shuler-Donner Productions"
      ],
      "summaries": [
         "Two years ago the boy Jesse helped the whale Willy to jump into freedom. Jesse enjoys the life with his adoptive parents, when his half-brother Elvis arrives because of the death of their mother. During a camping trip Jesse meets Willy again, as well as his Indian friend Randolph. A tender love develops between Jesse and Rudolph's goddaughter Nadine. Suddenly a crashed oil tanker endangers the whales, and several animal and human lives have to be saved as well when the oil catches fire.",
         "Jesse becomes reunited with Willy three years after the whale's jump to freedom as the teenager tries to rescue the killer whale and other orcas from an oil spill."
      ],
      "budget": 0
   },
   "movielensId": 169,
   "movielens": {
      "languages": [
         "English",
         "Bahasa indonesia",
         "Bahasa melayu"
      ],
      "releaseDate": "1995-07-19",
      "dvdReleaseDate": "2003-01-28",
      "directors": ["Dwight H. Little"],
      "runtime": 95,
      "movieId": 169,
      "title": "Free Willy 2 - The Adventure Home",
      "mpaa": "PG",
      "actors": [
         "Jason James Richter",
         "Michael Madsen",
         "Jayne Atkinson",
         "August Schellenberg",
         "Mary Kate Schellhardt",
         "Francis Capra",
         "Mykelti Williamson",
         "Elizabeth Peña",
         "Jon Tenney",
         "M. Emmet Walsh"
      ],
      "imdbMovieId": "0113114",
      "originalTitle": "Free Willy 2 - The Adventure Home",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["qqOPd5jKYG4"],
      "plotSummary": "Jesse becomes reunited with Willy three years after the whale's jump to freedom as the teenager tries to rescue the killer whale and other orcas from an oil spill.",
      "tmdbMovieId": 9073,
      "avgRating": 2.29538,
      "releaseYear": "1995",
      "numRatings": 4044,
      "posterPath": "/yLyyjm4m3fSvbazyFv4RtUnb2uQ.jpg"
   }
}