{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "christianity",
            "id": 186
         },
         {
            "name": "coma",
            "id": 732
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "radio station",
            "id": 1224
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "apostle",
            "id": 3033
         },
         {
            "name": "minister",
            "id": 3065
         },
         {
            "name": "louisiana",
            "id": 3134
         },
         {
            "name": "forgiveness",
            "id": 3446
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "preacher",
            "id": 18072
         }
      ],
      "imdb_id": "tt0118632",
      "video": false,
      "title": "The Apostle",
      "recommendations": [
         21887,
         21355,
         20637,
         32081,
         18129,
         14112,
         61225,
         44718,
         28176,
         16769,
         10896,
         9452,
         10613,
         12647,
         56448,
         19382,
         71068,
         56801,
         65040,
         291964
      ],
      "backdrop_path": "/re1cA1vSeCsz6yy7cBkA6X4FtlS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Euliss Dewey",
               "gender": 2,
               "credit_id": "52fe4373c3a36847f8054f85",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Troublemaker",
               "gender": 2,
               "credit_id": "52fe4373c3a36847f8054f89",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mrs. Dewey Sr.",
               "gender": 1,
               "credit_id": "52fe4373c3a36847f8054f8d",
               "name": "June Carter Cash",
               "profile_path": "/xKYigjnhVKcBXphibEg3ReYGIvu.jpg",
               "id": 28767,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jessie Dewey",
               "gender": 1,
               "credit_id": "52fe4373c3a36847f8054f91",
               "name": "Farrah Fawcett",
               "profile_path": "/aUMdPKJVwIHJhZX8BZlFbroaRwP.jpg",
               "id": 28768,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Toosie",
               "gender": 1,
               "credit_id": "52fe4373c3a36847f8054f95",
               "name": "Miranda Richardson",
               "profile_path": "/kTs3t6pnO3zR7WYSVYzQfJ9yKMW.jpg",
               "id": 8436,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Horace",
               "gender": 2,
               "credit_id": "52fe4373c3a36847f8054f99",
               "name": "Todd Allen",
               "profile_path": "/m8bGdt2Yzz2KXCYHAzzYjBv7dJW.jpg",
               "id": 21484,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Sam",
               "gender": 2,
               "credit_id": "55990f38c3a3684baa001773",
               "name": "Walton Goggins",
               "profile_path": "/gA5nf2alzIPPjs1MSjS1PmrCedJ.jpg",
               "id": 27740,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Joe",
               "gender": 2,
               "credit_id": "55990f5692514156770016b3",
               "name": "Billy Joe Shaver",
               "profile_path": "/e7kI8sNl4PfeJ6MiHpOll7HUPQV.jpg",
               "id": 71563,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Latin Translator",
               "gender": 1,
               "credit_id": "55990f6cc3a3684baa00177a",
               "name": "Renée Victor",
               "profile_path": "/wAVDqwFhQsRQgO6VIYq6T9Wbbx8.jpg",
               "id": 154004,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Child Accordionist",
               "gender": 2,
               "credit_id": "5a542c590e0a2607e0006345",
               "name": "Hunter Hayes",
               "profile_path": "/vpXmKpJdGHCpWwPMfMQPYczybgp.jpg",
               "id": 1956569,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4373c3a36847f8054f7b",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4373c3a36847f8054f81",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4373c3a36847f8054f9f",
               "name": "Barry Markowitz",
               "profile_path": null,
               "id": 34191,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4373c3a36847f8054fa5",
               "name": "Stephen Mack",
               "profile_path": null,
               "id": 34192,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4373c3a36847f8054fab",
               "name": "Linda Burton",
               "profile_path": null,
               "id": 34193,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.926783,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2895,
      "vote_count": 51,
      "budget": 5000000,
      "overview": "After his happy life spins out of control, a preacher from Texas changes his name, goes to Louisiana and starts preaching on the radio.",
      "similar": [
         1919,
         1712,
         9469,
         1599,
         649,
         9451,
         13998,
         1554,
         5172,
         13193,
         46829,
         8327,
         24798,
         291869,
         1776,
         9844,
         9782,
         24276,
         5721,
         31283
      ],
      "original_title": "The Apostle",
      "runtime": 134,
      "poster_path": "/9TENkQeln0bdLnlO1VdoCd5HCSi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Butcher's Run Productions",
         "id": 1257,
         "origin_country": ""
      }],
      "release_date": "1997-10-09",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The hardest soul to save was his own.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Duvall"],
      "runtime": 134,
      "synopsis": "Written and directed by Robert Duvall, The Apostle also features Duval as the central character in this biopic of Eulis F. Dewey, a self-proclaimed holiness preacher who admits to his wife, played by Farah Fawcett, to having a \"wandering eye\" and actual infidelities, but also adamantly declares his love for his wife, his children, and his Lord. Beginning at the scene of a tragic automobile accident, Dewey pulls over to surmise the situation. His mother, (June Carter Cash) remains in the car at his bidding as he makes his way to a vehicle out in the tall grasses of a field, almost, as it were, led by a spiritual force. Upon finding a young man at the wheel, and his motionless girlfriend at his side, he speaks only to the young man's spiritual condition, the need to repent and believe upon Jesus for the salvation of his soul. An officer approaches and insists that he must leave the scene and finally succeeds in getting him to return to his car. He drives his mother home, readies to leave, but she pulls what apparently is her usual stunt of requesting her blanket, and he returns to find her on the floor. He simply covers her and says that he has to go, and jokes about her speaking to St. Peter for him in glory. To be continued...",
      "writers": ["Robert Duvall"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118632/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1NzUyMTg0OF5BMl5BanBnXkFtZTcwMzY1NTUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Duvall, Todd Allen, Paul Bagget | See full cast and crew »"],
      "reviews": [
         "In order to fully appreciate \"The Apostle\" it might help to have some experience with southern Pentecostal culture. I do, and was completely taken in by the film. My wife, on the other hand, doesn't have that experience and understands neither the film nor my fondness for it. But I think that, if one is not distracted or confused or simply put off by the loud, emotional, sometimes corny religiosity portrayed here, one can see a strong, compelling story of a seriously, ultimately fatally flawed man whose faith in God and in God's mission for him reaches to his very core. On the surface, one can view Sonny Dewey as just another example of a certain type of religious fraud: the backslapping, perpetually-grinning, wisecracking good old boy who uses religion and exploits his flock for his own selfish ends. He looks like someone who doesn't practice what he preaches. He womanizes, he's not above taking a snort from this pocket flask, he has a troubled marriage and we get the hint that he is the source of more than his share of the trouble, even to the extent of driving his wife into the arms of another man. He seems to be just another Elmer Gantry or, to pick from the real world, he's just like one of the fallen televangelists of recent years. But just when you're comfortable with that judgment of him, Sonny proves you wrong. He admits to his faults, some more freely than others. But he makes no excuses for them and, in the end, he knows that he is going to pay for them. What really draws me into the film, and what really makes Sonny interesting for me, is the way Duvall has made him such a complex character. He's a bad guy and a good guy. He is darkness and he is light. He is sometimes endearing and other times someone you really don't feel comfortable trusting. But by creating this ambiguity, Duvall does a service not only to the way religious leaders are characterized in film, he also pays homage to core religious issues. By diving into the murky waters of Sonny's soul, Duvall goes into territory known to any seriously religious person. As much as you might want things to be black and white, a good portion of the time you're being pulled back into the shadows: there are good intentions and evil deeds; there are selfless aspirations and appetites to be fed. Sometimes you swing wildly from one side to the other. Sometimes you are on an even keel. Sometimes you're not sure. Faith and work determine how such a struggle will turn out. Sonny is energized by both. He believes in what he is doing. He believes that God has given him a mission and he is determined to accomplish it, even in spite of himself. While it might be tempting to make a stark contrast between the message Sonny preaches and the actions he has done that are contrary to it, one must always remember that a good preacher always preaches to himself as well as his congregation. But some of the more revealing moments of the film are not when Sonny is in front of a congregation, or even with other people generally, but when he is alone with God: ranting at God in anger; dedicating himself to God in the moment that he becomes the Apostle; the soul-searching moments when he forgives his wife and resigns himself to his fate. The no-punches-pulled realness of Sonny's struggle is a refreshing departure from the usual film portrayals of religious figures: plaster saint, con-man, one-dimensional milquetoast. But it also brings to the forefront the question of whether Sonny, or any of us, can be used for divine purpose. \"The Apostle\" is beautifully filmed and captures well a portion of the rural South: you can almost feel the humidity and smell the swampwater. And while the well-known actors in the film (Farrah Fawcett, Billy Bob Thornton, Miranda Richardson) all turn in fine performances, it is the unknowns --the church members and townfolk -- that really give the film an added authenticity.",
         "I didn't grow up down South, or even in the midwest, but I do know a little bit about the Pentacostal Church and Christian fundamentalism. Robert Duvall is an ambitious actor and film maker, and The Apostle hits home with its perceptive and loving portrayal of country people in the United States. It is refreshing to see that culture portrayed as something other than gaggles of yahoos. The Apostle focuses on the community spirit of the church, and thereby shatters some of the mystery of its appeal in a culture as self-centered as our own. There are no saints in this story, just a protagonist and his supporters trying to make sense of a country in which there is little love and way too much usury. The film is harsh on a number of levels, very no-nonsense though drawn out at various moments. But it's real, and that's more than can be said for ninety per cent of what passes for films about U.S. culture these days. It's said by some folks that Robert Duvall has been trying to make this film for a lot of years, and there are parts of The Apostle that contain faint echoes of his 1983 project Tender Mercies. It hardly matters, since both are interesting films for different reasons. Some day we'll see Robert Duvall as the vast repository of Americana he really is, until then, The Apostle is one of the best testimonies to his strengths that I know of. Can I get a witness?",
         "You can't help but being mesmerized by Robert Duvall in the title role. He must of seen a lot of southern preachers as he grew up, because he wrote this as well and the role suited him to a tee. The supporting cast is fine, with Rick Dial and John Beasley getting kudos for their work, but the movie is first and foremost about The Apostle. If you like Robert Duvall as an actor, you will like this movie. His attention to detail in his roles is well known. He brings quirks and nuances to help flesh out his characters, and this role is no different. The Apostle is a flawed man who can lift others up, but has trouble lifting himself up. And that contradiction is what gives this movie its flavor. All-in-all, a fine movie.",
         "Superior acting and a plot based on realism make this a classic movie of actual southern life ... a life that I experienced as a child and adolescent. Duvall's evangelist portrayal is not only convincing but eerie in the way it so fully represents many southern ministers of the gospel ... be they true believers or be they charlatans. I can't help but wonder if the cast was comprised of local folks ... or at least folks reared in the south ... rather than professional actors. They all did an excellent job contributing to the realism of this movie. I almost always enjoy a movie that \"tells it like it is\" ... and sofar, this is one of the most enjoyable I have ever seen.",
         "This film kept me thinking for days afterwards. A highly emotionally charged film, The Apostle is essentially a one-man tour de force for Duvall with an ensemble supporting cast. Duvall's performance was so convincing that had he performed this role live I'm sure he would have moved the whole audience to tears. I resisted seeing this film at first expecting that it would be the usual tired, antireligious stereotype that late twentieth century script writers revel in. But The Apostle does not blindly follow any stereotypes. The premise is plausible and the realistic character portrayals give the viewer the feeling that they are right there in the story. This is a riveting tragic tale of a very flawed man who has the gift of inspiring others to better and greater things. Had Shakespeare been around today, he would have borrowed this storyline, but I doubt he could have done a better job. It is a cautionary tale for anyone in a position of leadership. Somehow, despite the tragedy framing this story, I found it very uplifting. If you like a film with a message that prompts you to think, then see this movie.",
         "My husband and I have loved this movie since we saw it the first four or five times. After recently buying a DVD and getting The Apostle in DVD we found a new since of excitement. The director's insights given have enriched the movie and given it deeper personality. Here is a few thoughts to help capture this wonderful creation Eulis `Sonny' Dewey is a Southern Pentecostal Holiness Evangelist and Preacher from Texas living a seemingly happy life with his wife Jessie and his two `beauties' (children). Suddenly his flashy, hyped world comes apart: Jessie is having an affair with youth minister Horace. Sonny gets drunk, enraged and hits Horace with a baseball bat, putting him into a coma in which he later dies. Sonny escapes town, takes a new name, `The Apostle E.F.', and goes to Louisiana. He starts to work as a mechanic for local radio station owner, Elmo, and Elmo lets him preach on the radio. E.F. starts to preach everywhere: on the radio, on the streets, and with his new friend, Reverend Blackwell, he starts a campaign to renovate an old church. Along the way he wants to have an affair with Elmo's secretary `Toosie,' and all the time he is preaching, he knows his time is running out. His past sins are catching up with him and so is the law. The character of Sonny is developed in every scene. Each scene reveals another complex part of Sonny's character. One scene will show his humility and the next shows his pride. These contradictions of, sanctification versus earthiness, generosity versus possessiveness, and open affability versus anger are developed to show the complexity in Sonny's character. Robert Duvall's sense of evil is simple and forgiving (things most all people deal with). Robert Duvall constantly explores how good a human can be and how much good he can do when `sold out' to God. His personal communication scenes with Jesus make his character seem vulnerable, open, and honest. The Apostle is set in a Southern, God Fearing, Right Wing, Conservative, setting. Even though Sonny has had a `womanizing' problem in the past, the morality is certainly conveyed as an absolute and conservative religious morality. This is a community of a small group that belongs to Jesus and Sonny's `little church'. Since the Southern Pentecostal Church, containing both Blacks and Whites together is, not a stereotype, The Apostle is developing new territory in genre definition. The ideas of feminism or gay liberation are hardly understood in this rural religious Southern setting. Morality and fidelity are high on their social standards. However, overeating and gluttony are accepted weaknesses. Getting drunk is one weakness that most of the men have had in their younger rebellious days. The charismatic, convincing, conniving, and calculating Sonny describes a most entertaining and flawed `Man of God'. The theme of an uneasy co-existence of the holy part of Sonny, with his flesh, is brought to film for the first time. The protagonist Sonny is the most authentic portrayal of a Southern Pentecostal Holiness Evangelist/Preacher with almost every other word being, `Praise the Lord,' `Hallelujah', `Amen,' `Thank you, Jesus,' which all come from his heart. The other (earthly) side of Sonny is aptly convincing. Earthy examples are: his description of his womanizing to his wife, his drunken fight, (where he strikes his wife's lover with a baseball bat), and his cruelly dragging his wife off the ball field by her hair, and showing his obvious drunkenness, anger and cruelty when he blew up. Another subtle example is when he is doing his charismatic preaching on the radio, while the secretary is watching his intensity, and he follows it by preaching to her, (meanwhile, there is this calculating sales pitch with sexual sub-text between the two people). A subtle but revealing example of Sonny's character is shown by Duvall's acting in two `sales-like, asking for the order' scenes. The first scene takes place where Sonny and the secretary have had several encounters and Sonny is trying to get into her life, house, and bedroom. After a couple of hot intense smothering kisses, Sonny keeps saying, `Come on now,' for his closing `pitch', to which she keeps answering, `Next time'. The other is in the closing scenes of the movie inside the `One Way Road to Heaven' church. Sonny and members are having an `altar call', and have been singing, `Softly and Tenderly Jesus is Calling', and as a final plea to a parishioner to accept Jesus into his life, Sonny keeps using his sales phrase `Come on now!' Even though the words are previously used for his earthly desires, in this scene he captures his passion to perfection and his tears are genuine as he pleads with all his heart. In my mind, I can describe Robert Duvall's Academy Award deserving character acting as a poignant, perplexing, portrayal of a paradoxical, problematic, passionate, preacher. Even though I could also choose Jack Nicholson's role in `As Good As It Gets'(who won the Oscar), the depth and breadth of Nicholson's acting don't measure up to the job done by probably America's greatest actor, Robert Duvall. I believe this technique of documentary style filmmaking places the burden of carrying the movie on the acting and solely on Robert Duvall's Academy Award winning shoulders, and he delivers",
         "The Apostle is a gripping film on a most unpromising subject matter. The film has none of the obvious flash of movies such as Elmer Gantry and The Rainmaker which covered some of the same territory. The Apostle is based on straightforward storytelling, great character development and nice, gentle pacing - but with a strong kick. Robert Duvall, one of the best actors of the last thirty years, gives a powerful performance as the preacher driven by his inner demons - and gods. Over the years, we've seen preachers played by actors ranging from Burt Lancaster to Steve Martin but Robert Duvall comes up with a truly individual and original interpretation. What makes the character Sonny stand out is that he is so real! Ranging from his most charismatic (doing a Joe Dolan impersonation?) to his most personal, one feels that Sonny (the apostle EF) is real, believes what he is doing is real and is confident in his destiny - no matter how odd or quirky he appears at times. The film is character driven with a good sprinkling of incidents throughout. Story points introduced early on and developed before half way give the film a strong feel of The Fugitive, the TV series - laid back, story based but with the undercurrent of \"a ticking bomb under the table\" (Alfred Hitchcock). Minor quibbles: Miranda Richardson's character is a little too young for Robert Duvall's. June Carter Cash, both the actress and the character, seem under utilised. And at times it is possible to see the joins. The version I saw on video appears to be shorter than that shown originally in the US cinema. This pruning may account for some of these minor points. Overall, The Apostle is highly recommended. Filmgoers without a strong interest in religious matters should find the characters, their treatment and the landscape in which they operate fascinating. Most people of a religious disposition should have little difficulty with the film as a film though they may not always like what they see from a religious viewpoint. 8.75. Amen!",
         "Robert Duvall did an excellent job bringing this film to life. The other 'actors' in the film also contribute to give \"The Apostle\" a realistic warmth rarely achieved in mainstream films. I refer to the cast as 'actors' because aside from numerous character actors, Duvall being one of the greatest, the film is inhabited by non-actors. In other words, the people in church, from the Holiness preachers to the warm small-town folk, are real people, not trained in acting. Duvall's story is engaging and beautiful in the way it shows the flaws amid great talent in a man who chooses for himself the calling of Apostle. I love this film, the accurate portrayal of some aspects of southern U.S. life and culture, and especially Duvall's performance.",
         "I will always admire Robert Duvall for all the personal effort he put into making this film. As a church worker who is a moderate/liberal Christian, there are few other movies like it out there. It presents a pastor who is clearly flawed and sinful, as all of us are. However, it also presents someone who simply wants to serve the Lord and help people, whether they are poor, black or prisoners. The filming locations and use of real pastors give the movie an extremely authentic feel. Great music as well! Highly recommended movie with great acting, a story that makes you think and a balanced portrayal of evangelical Christianity.",
         "Although I have mixed emotions about this film, I have always enjoyed watching it and find it utterly fascinating. This is a powerful story of a very flawed-but very sincere Pentecostal preacher from Texas who flees after slugging his adulterous wife's lover with a baseball bat, killing him, as it turns out. \"Sonny\" (Robert Duvall), winds up starting a rural church from scratch in a small town in Louisiana, and is eventually discovered and sent back to Texas to jail. Duvall gives a tremendous acting performance in here, one of the best I've seen on film. He dominates the picture from start-to-finish. There are some good messages in here, including the one that you reap what you sow, and accepting that even when it's bad news and you wind up paying for your sins. Speaking of that, the bad news about this film is yet another portrayal of a minister who acts very un-minister-like. Here's a preacher who carries a pistol, slugs a man with a baseball bat, runs away from the scene and his family, and later settles a dispute with his fists and makes sexual advances to a woman. I don't know ANY minister (or priest) who would do these things - especially all of them! - but it makes for a good story, film-wise. Another horrible message was seeing the minister's wife (played by Farrah Fawcett) having an affair with the youth minister! I mean, all of this is ridiculous. To those anti-church readers out there, I'm sorry but this is not the way it is, by any means. Yet, despite all that, this is not your typical anti-Christian film ,which is why no major studio would fund this movie. Duvall had to put his own money into this. Hollywood didn't want to back a film in which \"people being saved\" means a lot, where people unashamedly praise the Lord, and are converted. In this film are several touching conversions, including a dramatic one with Billy Bob Thornton, of all people! Hey, with God all things are possible. Many of the people in this movie were not actors, either, but real ministers. Also shown are supporting characters who are all sincere, good people who help \"The Apostle E.F.\" (Duvall) build the church and help make it grow. In the end, despite all his flaws, Duvall's character turns out to be one of a sincere evangelist who truly loves God and wants to do His work wherever and whenever, even on a chain gang as the ending credits attest. The more I watch this movie, the more I appreciate the cinematography in here. I enjoyed the music, too. This is a strange film full of \"good\" and \"bad\" people and their actions and a movie, I suspect, people would either love or hate. I loved it."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Butcher's Run Films"],
      "summaries": [
         "Eulis 'Sonny' Dewey is a preacher from Texas living a happy life with his beautiful wife Jessie. Suddenly his stable world crumbles: Jessie is having an affair with young minister Horace. Sonny gets enraged and hits Horace with a softball bat, putting him into a coma. After that he leaves town, takes a new name, 'Apostle E.F.' and goes to Louisiana. There he starts to work as a mechanic for local radio station owner Elmo, and Elmo lets him preach on the radio. E.F. starts to preach everywhere: on the radio, on the streets, and with his new friend, Reverend Blackwell he starts a campaign to renovate an old church.",
         "After his happy life spins out of control, a preacher from Texas changes his name, goes to Louisiana and starts preaching on the radio."
      ],
      "budget": 5000000
   },
   "movielensId": 1694,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-09",
      "dvdReleaseDate": "2002-11-04",
      "directors": ["Robert Duvall"],
      "runtime": 134,
      "movieId": 1694,
      "title": "The Apostle",
      "mpaa": "PG-13",
      "actors": [
         "Robert Duvall",
         "Billy Bob Thornton",
         "June Carter Cash",
         "Farrah Fawcett",
         "Miranda Richardson",
         "Todd Allen",
         "Walton Goggins",
         "Billy Joe Shaver",
         "Renée Victor",
         "Hunter Hayes"
      ],
      "imdbMovieId": "0118632",
      "originalTitle": "The Apostle",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["nkL2wYSydN4"],
      "plotSummary": "After his happy life spins out of control, a preacher from Texas changes his name, goes to Louisiana and starts preaching on the radio.",
      "tmdbMovieId": 2895,
      "avgRating": 3.68958,
      "releaseYear": "1997",
      "numRatings": 3186,
      "posterPath": "/9TENkQeln0bdLnlO1VdoCd5HCSi.jpg"
   }
}