{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "concentration camp prisoner",
            "id": 3207
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "gay interest",
            "id": 10199
         }
      ],
      "imdb_id": "tt0118698",
      "video": false,
      "title": "Bent",
      "recommendations": [
         77410,
         20675,
         66701,
         65953,
         199310,
         13817,
         17614,
         97537,
         79908,
         69746,
         47619,
         53117,
         84274,
         84298,
         31978,
         121003,
         86087,
         120862,
         42812,
         86232
      ],
      "backdrop_path": "/57LHmyCemE18fBYXk7ni4AKD3FP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8daf",
               "name": "Clive Owen",
               "profile_path": "/jm2as6tLcvHCYQvmMYM4VK6JEnr.jpg",
               "id": 2296,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Horst",
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8db3",
               "name": "Lothaire Bluteau",
               "profile_path": "/4T08wOIWv84KqMYYsd1VUSX1lFF.jpg",
               "id": 38524,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Uncle Freddie",
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8db7",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Greta / George",
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8dbb",
               "name": "Mick Jagger",
               "profile_path": "/nrGPcc3RAvS9OgsoKnRKD3ZoJCM.jpg",
               "id": 1428,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Stormtropper",
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8dbf",
               "name": "Jude Law",
               "profile_path": "/4077Cyuo1mw53u1gNjLyQkqeZN0.jpg",
               "id": 9642,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Prostitute",
               "gender": 1,
               "credit_id": "55dc1d68c3a36809990016b3",
               "name": "Rachel Weisz",
               "profile_path": "/3QbFXeiUzXUVUrJ7fdiCn7A7ReW.jpg",
               "id": 3293,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Max's Friend",
               "gender": 1,
               "credit_id": "55dc1d7492514162c70015da",
               "name": "Sadie Frost",
               "profile_path": "/nORllrdt6W4GYZUcVXJoM0Cxhg1.jpg",
               "id": 41381,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Wolf",
               "gender": 2,
               "credit_id": "562ab1219251414ad8001470",
               "name": "Nikolaj Coster-Waldau",
               "profile_path": "/1r6SwIV4QqZgdkRuql0EQHd0rUB.jpg",
               "id": 12795,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Captain",
               "gender": 2,
               "credit_id": "5900d0a892514161dd00e1c8",
               "name": "Paul Bettany",
               "profile_path": "/1zmr8C7TCqsoCjDVKJycVp2wWyf.jpg",
               "id": 6162,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8dc5",
               "name": "Martin Sherman",
               "profile_path": null,
               "id": 66703,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8dcb",
               "name": "Sean Mathias",
               "profile_path": null,
               "id": 84896,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.010389,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 19601,
      "vote_count": 46,
      "budget": 0,
      "overview": "Max is a handsome young man who, after a fateful tryst with a German soldier, is forced to run for his life. Eventually Max is placed in a concentration camp where he pretends to be Jewish because in the eyes of the Nazis, gays are the lowest form of human being. But it takes a relationship with an openly gay prisoner to teach Max that without the love of another, life is not worth living.",
      "similar": [
         184352,
         449176,
         26280,
         338189,
         14574,
         637,
         228150,
         428493,
         413666,
         380874,
         803,
         1771,
         47643,
         5925,
         423,
         424,
         2253,
         203833,
         16869,
         613
      ],
      "original_title": "Bent",
      "runtime": 105,
      "poster_path": "/a0LP0FS9qDW3RJN8GwYA2G8rBGx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ASK Kodansha",
            "id": 61695,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "NDF Inc.",
            "id": 61696,
            "origin_country": ""
         }
      ],
      "release_date": "1997-11-26",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sean Mathias"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Martin Sherman",
         "Martin Sherman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118698/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMDE0MTI3MV5BMl5BanBnXkFtZTcwNjE5MjgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Lothaire Bluteau, Clive Owen, Mick Jagger | See full cast and crew »"],
      "reviews": [
         "When Martin Sherman's play first appeared (with Ian McKellen as Max and Tom Bell as Horst) it caused outrage and much discussion with its sympathetic and frank treatment of forbidden love in the age of the SS. Here it has undergone a few changes but retains its stark power. Clive Owen (probably not my first choice for the role) plays Max, the homosexual who pretends to be a Jew so he is not at the bottom of the pecking order of prisoners. The way the SS force him to prove his sexuality is shocking whether on the printed page, in a theatre, or up on the big screen. Brian Webber plays his intellectual lover Rudy with some class and it is a brief but touching performance. Lothaire Bluteau, who I had only seen before in 'Jesus of Montreal', was brilliant in the role of Horst, the prisoner with the pink triangle who awakens Max again from his imprisoned desires. There are quiet and intense scenes between the two that are almost unbearably moving to watch, and are done within this film extremely well. Elsewhere in the cast, Ian McKellen himself plays Uncle Freddie (but those of us who saw him as Max would love to have seen that portrayal immortalised on screen), while Mick Jagger is surprisingly good as Greta (a role which could easily be played wrong but he's spot on). This play/film is intended to make its audience confront their prejudices, to shock, move, and inspire them. I think it is an unmissable experience - a difficult one, but worthwhile.",
         "I sat down to watch this movie, and I was completely drawn into it. By the end, i thought that only 15 minutes had passed instead of an hour and a half. The subject matter (homosexual persecution during the Holocaust) was approached with the right amount of dignity and respect. Bent, furthermore, has the most powerful and original love scene that I have ever seen. I do feel that it needed more character development, but regardless it is an intensely psychological and powerful movie.",
         "Only half way through this film did I remember having seen a small theatre production of the play in Los Angeles a dozen years ago. I only remembered when the rock-moving scenes began. I don't recall being particularly moved by the play -- it may have been a condensed 1-act version or something. I only remember thinking it was too \"talky.\" But, the film was very powerful and moving and enraged me! I'm also older and more aware of prejudice on every level. Every gay person...or minority of any kind (race, religion, etc.) should see this film just to remind them (us) of just HOW BAD it can get and how \"humans\" can become such sick animals as the Nazis were in this film. I kept thinking: \"Hey, how can they keep blaming Hitler, when he was not there ordering the guards to torture and ENJOY hurting people like that?\" Powerful film!",
         "Its always the Jew's travail I hear about concerning the Nazi Germany Period, but other GROUPS apparently got treated miserably as well, and this movie deals with one of them. Pathos, tremendous camera action (black/white & technicolor), superb character acting, excellent thematic development and flow, and perfect music accompaniment. I will see it again.",
         "This is a very wordy and long-winded response to guajolotl (guajolotl@aol.com)'s comment\"Yetch!\": In times of desperation and fear, people do awful, incomprehensible things. Everything you know is taken away, the comfortable fears of your daily life are stripped away in an instant and you are put in a situation you are completely unprepared for: you could die. People who live like us, who live safe, cannot comprehend the stark and brutal reality of facing your own death. A drag queen that descends from the air every night to serenade a drunken, orgiastic crowd of sexual outlaws may buy their own life with the lives of others. They may embrace a wave of evil and violence so that it doesn't pick them up and drag them under and do it with the same cool smile that they display on the stage. But their song is still bittersweet and regretful, they still have money and time and information for the people they betrayed. And on a train bearing you away from everything you ever knew or imagined for yourself, an outlaw who has lived running for a year before you were tracked down like an animal, you might simply sit (eyes to the ground) while they drag someone you love away. Maybe after taking home a cute blonde only to see his throat slit by storm troopers in your living room, you would listen when someone told you that in order to survive you needed to sit and listen to them torture your lover without moving to help him. And after hours of hearing his cries and screams and being unable to do anything (because there is no way this is your life and your out of you mind with fear and pain) you would say you didn't know your lover when his limp and bloody body was dragged before you. Maybe you would listen to a nightmare voice that ordered you to beat him because there was nothing else to hear. You would follow the one instinct that they had left you, the instinct to survive. By the time they tossed his body out of the train, would you have anything left to feel? When everything had been stripped away but your own life, what wouldn't you do to save it? And maybe your redemption would lie in love. Maybe when you saw someone (someone who had screamed at you and wanted you and needed you and laughed with you even in the face of death) refuse to let you go, run straight into the arms of death rather than let it shoot them in the back, you would finally become fully human again. The agony of that loss would rip through every part of you but you would feel it, you would know that you could feel. And when you took your own life it would be with the utmost dignity; you would stop fiercely clinging to the uncertain promise of survival and wrap your hands around the walls that bound you as you flew free.",
         "I had seen the play on Broadway twice, once with Richard Gere and David Dukes, and once with Michael York and Jeffrey DeMunn. The movie is very faithful to the play and was just as interesting, which usually is not the case. Mick Jagger is great as Greta. All in all, I'd recommend this movie and did not find it pretentious in the least.",
         "What can I possibly say about this movie that would not bring me to tears. This movie was very powerful and thought provoking. I just could not understand the hatred for human beings, just because of what religion, sexual orientation, or whether they had a big nose. I just can't for the life of me figured that out. I guess I will never figure it out. There were some very strong scenes in this movie that tugged at my heart. The ridiculous killing of men and women for no apparent reason other than what I said above. The never ending work the prisoners did was just unspeakable. The conditions, and also the ever popular \"no touching each other\". The latter is the most difficult to endure for two gay men captured and put to work in the concentration camps. In one powerful scene, that I have to admit I watched over and over about five times, during one of Max and Horst's (main stars) rock moving extravaganza's, they are allowed a three minute rest period while working a twelve hour shift. They are not allowed to look at each other, they must stand up straight looking ahead (some rest period huh). Well without giving away the scene. They have what we would call very graphic and arousing phone sex. And I have to tell you, I was right there with them. This scene really brought these two prisoners much closer together and very much in love. It was beautiful. I have a couple of things that bothered me in this movie. I really hated the way the SS men spoke to the prisoners. I mean, one word sentences like \"You\" - \"Walk\" - \"Friend?\" - or \"Watching You\". I mean for a people who claimed to be the superior race, these guys were not intelligent at all. Also the fake train outtakes that were obviously superimposed into the movie. The scenes themselves were in black and white which told the audience that they were not from the original film, but from some other movie. Overall, this movie was profoundly incredible. It is a must see for everyone, no matter what the content of the movie - gays, murder, sex, SS men, Hitler's BS , concentration camps. You have to watch this movie with an open heart and mind to actually feel for these people, not just because they were two gay men in love and pain, because they were human beings first and foremost. 7.5 out **********. See it, you will not be disappointed.",
         "This film, based on the theatrical production, is a moving and powerful experience. It is both emotional and intense and its power moves even a cynic to tears. While hope bounds throughout the hopeless scenario, the overwhelming feeling is desperation and despair. Though the settings are largely historically inaccurate, they convey the mood of the era precisely. A must see for anyone in the GLBT community or anyone with an interest in the Holocaust. Never forget.....NEVER AGAIN!",
         "The play was great and I hoped the movie adaption will work. I'm glad to say it did. Some bits weren't perfect, but the movie is still very sad and bitterly romantic. How sad and heartbreaking... How could people do such things to other people?... Damn. Not an easy movie to watch, but still a must see. Great acting.",
         "Homosexual playboy in 1930s Germany fights to keep himself and his gay flat-mate out of the grasp of Nazi soldiers, but they are soon rounded up and face the horrors of war. This tough-going drama doesn't delve too deeply into the Party's initial conflict over homosexuality, but it does touch on the labeling of gay men with the Pink Triangle, making them perhaps even more reviled than the Jews (Clive Owen picks the yellow Star of David symbol over the triangle, figuring being a Jew might actually help him survive). Initially arty presentation has flashes of pretension, but is still gripping on a visual and visceral level and very well-acted. It's almost two different movies however, with a work-camp second-half given an appropriately straightforward, if unexciting, direction. Adapted from the controversial play, the last act has perhaps more going on than is actually revealed, and the viewer may either feel the movie loses its energy and soul during this portion or that it is successful on an entirely different level. In any case, difficult as an entertainment, but certainly worthwhile for those curious about this lost chapter in history. **1/2 from ****"
      ],
      "genres": [
         "Drama",
         "History",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "NDF Inc.",
         "Ask Kodansha Company Ltd."
      ],
      "summaries": ["Max is gay and as such is sent to Dachau concentration camp under the Nazi regime. He tries to deny he is gay and gets a yellow label (the one for Jews) instead of pink (the one for gays). In camp he falls in love with his fellow prisoner Horst, who wears his pink label with pride."],
      "budget": 0
   },
   "movielensId": 1696,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-11-26",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Sean Mathias"],
      "runtime": 105,
      "movieId": 1696,
      "title": "Bent",
      "mpaa": "",
      "actors": [
         "Clive Owen",
         "Lothaire Bluteau",
         "Ian McKellen",
         "Mick Jagger",
         "Jude Law",
         "Rachel Weisz",
         "Sadie Frost",
         "Nikolaj Coster-Waldau",
         "Paul Bettany"
      ],
      "imdbMovieId": "0118698",
      "originalTitle": "Bent",
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "youtubeTrailerIds": ["TtcfmJG3JnE"],
      "plotSummary": "Max is a handsome young man who, after a fateful tryst with a German soldier, is forced to run for his life. Eventually Max is placed in a concentration camp where he pretends to be Jewish because in the eyes of the Nazis, gays are the lowest form of human being. But it takes a relationship with an openly gay prisoner to teach Max that without the love of another, life is not worth living.",
      "tmdbMovieId": 19601,
      "avgRating": 3.5689,
      "releaseYear": "1997",
      "numRatings": 283,
      "posterPath": "/a0LP0FS9qDW3RJN8GwYA2G8rBGx.jpg"
   }
}