{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "audition",
            "id": 33928
         },
         {
            "name": "police fake",
            "id": 172732
         },
         {
            "name": "homeless",
            "id": 177927
         },
         {
            "name": "actress",
            "id": 207583
         }
      ],
      "imdb_id": "tt0109266",
      "video": false,
      "title": "Bang",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "The Girl",
               "gender": 0,
               "credit_id": "52fe4ab0c3a368484e161ae1",
               "name": "Darling Narita",
               "profile_path": null,
               "id": 238147,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe4ab0c3a368484e161ae5",
               "name": "Peter Greene",
               "profile_path": "/zCHUxWj7BZ3Uzmkbq9FPpOicniQ.jpg",
               "id": 11803,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Officer Rattler",
               "gender": 0,
               "credit_id": "55a6c228c3a3683005000337",
               "name": "Michael Newland",
               "profile_path": null,
               "id": 1487594,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Pimp",
               "gender": 0,
               "credit_id": "55a6c234c3a368300500033c",
               "name": "Erik Schrody",
               "profile_path": null,
               "id": 1487595,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Officer Trotter",
               "gender": 0,
               "credit_id": "55a6c2419251411e06000323",
               "name": "Michael Artura",
               "profile_path": null,
               "id": 1274315,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Officer Ham",
               "gender": 2,
               "credit_id": "55a6c255c3a3683005000345",
               "name": "James Sharpe",
               "profile_path": null,
               "id": 173833,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jesús",
               "gender": 0,
               "credit_id": "55a6c2629251411e1800030c",
               "name": "Luis Guizar",
               "profile_path": null,
               "id": 1109526,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Juan",
               "gender": 2,
               "credit_id": "55a6c26ec3a3682ff400033a",
               "name": "Art Cruz",
               "profile_path": null,
               "id": 1487596,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "The Producer",
               "gender": 2,
               "credit_id": "55a6c27ec3a3682ff60002eb",
               "name": "David Alan Graf",
               "profile_path": null,
               "id": 99636,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Landlord",
               "gender": 0,
               "credit_id": "55a6c28c9251411e0f0002ec",
               "name": "Stanley B. Herman",
               "profile_path": "/bty5ELo8f2ImERKwELOkzim2kS2.jpg",
               "id": 1163066,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Rooftop Dealer",
               "gender": 2,
               "credit_id": "55a6c2a5c3a36830080002b0",
               "name": "James Noble",
               "profile_path": "/fly8G2L1fhDQEWTaMsn7LK4rKgt.jpg",
               "id": 152699,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Hooker",
               "gender": 1,
               "credit_id": "55a6c2bb9251411e1b0002b7",
               "name": "Lucy Liu",
               "profile_path": "/9nbtjqsx3De7hO2XDtrBQ7M9VCH.jpg",
               "id": 140,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Cook",
               "gender": 2,
               "credit_id": "55a6c2c69251411e140002de",
               "name": "David Preston",
               "profile_path": null,
               "id": 31178,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Drive-By Cholo",
               "gender": 0,
               "credit_id": "55a6c2e39251411e1b0002bb",
               "name": "Paul Saucido",
               "profile_path": null,
               "id": 859896,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ab0c3a368484e161add",
               "name": "Ash Baron-Cohen",
               "profile_path": null,
               "id": 77465,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55a6c2fdc3a3682fff0002d7",
               "name": "Ash Baron-Cohen",
               "profile_path": null,
               "id": 77465,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55a6c30bc3a36830080002b6",
               "name": "Daniel M. Berger",
               "profile_path": null,
               "id": 77469,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55a6c316c3a3682ff4000349",
               "name": "Ladd Vance",
               "profile_path": null,
               "id": 551516,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55a6c3269251411e1b0002c9",
               "name": "David Gasperik",
               "profile_path": null,
               "id": 1108768,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "55a6c334c3a36830080002b9",
               "name": "Orlando Aguillen",
               "profile_path": null,
               "id": 1487597,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.431615,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 124606,
      "vote_count": 1,
      "budget": 0,
      "overview": "A young woman in L.A. is having a bad day: she's evicted, an audition ends with a producer furious she won't trade sex for the part, and a policeman nabs her for something she didn't do, demanding fellatio to release her. She snaps, grabs his gun, takes his uniform, and leaves him cuffed to a tree where he's soon having a defenseless chat with a homeless man. She takes off on the cop's motorcycle and, for an afternoon, experiences a cop's life. She talks a young man out of suicide and then is plunged into violence after a friendly encounter with two \"vatos.\" She is torn between self-protection and others' expectations. Is there any resolution for her torrent of feelings?",
      "similar": [
         3131,
         4771,
         13223,
         116,
         949,
         37094,
         598,
         339692,
         313369,
         458741,
         277216,
         5176,
         13809,
         500,
         26389,
         15092,
         391,
         254470,
         942,
         334521
      ],
      "original_title": "Bang",
      "runtime": 98,
      "poster_path": "/vjhY37XLUKdPKhBnJzzmbZhxlMV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "FM Entertainment",
            "id": 26598,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Asylum Films",
            "id": 10571,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eagle Eye Films Inc.",
            "id": 40739,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Sometimes you've got to break the rules",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ash Baron-Cohen"],
      "runtime": 98,
      "synopsis": "An out of work actress (Darling Narita) is evicted from her apartment in Los Angeles. She goes to an audition at a producer's house in Beverly Hills, but he turns out to be a sleaze. Outside his house, a crazy guy (Peter Greene) throws trash cans in the street, bringing a motorcycle cop to the scene. The cop chases the girl up a dirt track, and threatens to arrest her unless she felates him. She steals his gun and uniform, handcuffs him to a tree, and makes off on his motorcyle. The girl spends the day as a cop, albeit an unorthodox one. She goes to a cafe, gets a free breakfast, and is treated as a colleague by two other cops. She hands out dollars to down-and-outs, coaxes a suicidal drug dealer from a roof ledge, and tells a couple who are copulating on a hillside to have a nice day. Meanwhile back in Beverly Hills the crazy guy has found the real cop, and is starting to torment him. The girl's bike runs out of fuel, and two Mexican illegals drive her to get some. They become friendly, and drink and smoke weed together. As they're refilling her bike, they're shot at from a passing car. The younger Mexican, with whom the girl had connected, is badly injured. The girl tries to help, but then panics and rides off. She finds the drive-by shooters, chases them up an alley, and kills one of them. Later, in another alley, she finds a prostitute (Lucy Liu) fellating a client. She berates her, but the hooker's pimp appears and they beat the girl up. After this the girl rides to the sea and bathes in it to cleanse herself. Then she goes back to Beverly Hills, where she humiliates the sleazy producer in front of another would-be actress (she puts her gun in his mouth, causing him to wet himself). She then finds the real cop still handcuffed to the tree. She changes back into her own clothes, leaves the handcuff key where the cop can get to it, and runs off. The cop reaches his gun first, and is aiming at the girl's back when the crazy guy appears and attacks him. The gun goes off, but the girl is unhurt. As the film ends, we see the cop lying on the ground, and the crazy guy running off with his uniform.",
      "writers": ["Ash Baron-Cohen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109266/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMDc5ODc2OF5BMl5BanBnXkFtZTcwMDE0MjkzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Darling Narita, Peter Greene, Michael Newland | See full cast and crew »"],
      "reviews": [
         "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.) This is an interesting movie with some superior shtick. It's outrageous of course, but there's a semi-plausibility to it throughout, once you accept the initial premise. Here it is: Asian kind of girl (Darling Narita) gets kicked out of her L.A. digs by a landlord thinking only of his mortgage payments. He just locks her out and tells her he is selling her stuff. But she has some hope: she has an audition with a Hollywood producer. His \"office\" is his home in the Hollywood hills. Before she goes in she befriends a schizophrenic street person. He hustles her for a dollar. Inside the house \"producer\" proves to be particularly slimy and we can see he is just scamming her for sex, and when she doesn't come across he verbally abuses her and throws her out. The schizo dude meets her and trashes the street a little just to pent and splits as a motorcycle cop drives up. She runs because it looks like she did the trashing and he chases her into the lush hills where he handcuffs her and gives her a choice: On your knees and do the deed, or you'll spend a night in jail. After assuming the position she manages to grab his gun and handcuffs him to a tree. She has had a bad morning. She freaks and makes him strip and takes his uni, dons it, and his motorcycle and goes on to play cop around town. She cruises some ghetto scenes and gets way into her act: she encounters pushers, dealers, killers, hookers, pimps, gangland lords and she gets engaged. Everybody thinks she's a cop, but she seems to forget herself sometimes. She hands out some money to some street people, runs out of gas and smokes some weed with a Latino hommie. By the way, the scene in the car with Juan and Jesus is just really excellent as it captures the barrio style. Then it gets a little rough. The cute cholo gets blasted in a drive by as his bro is filling her gas tank. She takes off after the perps and ends up shooting a dude. She spots this Asian hooker and tries to tell her she is doing wrong but gets kicked around by her and her pimp for her trouble. Strange how the film has turned a little. She walked more than a mile in the cop's shoes and suddenly we have identification with the enemy in a sense. The movie is now a kind of slapstick symbolic jaunt showing how being a cop in the modern urban scene corrupts absolutely. (I wonder how much of this was intended by Director and writer Ash.) She goes to the ocean to shake off what has happened to her. And then of course she returns to have her way with the lecherous producer and the wayward cop and further befriends the schizo dude. Ah, gee it's kind of sweet in a la la land sort of way. Best joke on the square: CIA = Cocaine Import Agency.",
         "I loved this film. Darling Narita's performance convinced me that what I was seeing was possible, however improbable. She carries the film, but there are several other fine performances here. An added bonus: Lucy Liu, currently appearing in TV's Ally McBeal, in a small but important role as a strung out hooker. Note: I rented this film from BlockBuster under the title \"Bang\" with a release date of 1997.",
         "A woman finds herself in a police uniform after cuffing him to a tree and spends the day as he might have. She experiences an assortment of situations and emotions. Truly an \"if I were in his shoes\" approach works quite well. The film has a lower budget look but features some good acting although I do give the film a low-to-moderate \"yeah, right\" factor in a few scenes.",
         "Bleak look at the life of the less-privileged in contemporary Los Angeles. Darling Narita is utterly believable as the unemployed, homeless actress who gets to be a \"cop\" for a day, and the dialogue, situations and general flow of the film have a definite ring of authenticity (you will never say to yourself \"no, this couldn't happen\"). The director's documentary-like technique draws you into the film; on the other hand, it doesn't give you too many insights into the characters. Ultimately, the film comes to a dead end - like its heroine, it has nowhere to go. (**1/2)",
         "Ash definitely has talent.. a clever script.. you must watch to the end to fully appreciate his talent..of course there were limitations being a low budget movie.. i didn't particularly like the filming style, the hand held camera going back and forth to the different characters.. but the story, a struggling actress, kicked out of her apartment and thrown into a 'real' acting part by bad circumstances, is very interesting and thought provoking and scary. The lead actress is particularly good. like i said before.. don't give up.. see it all the way through.",
         "Ever seen a movie with an unbelievable opening plot device, yet the grim urban reality that it is set in allows you to buy it, in some strange way? Well, I think that describes 'Bang' pretty well. The idea of an actress assuming the role of a cop for a day is outlandish (and that stolen uniform fits pretty nicely). But it works if you let it. Don't expect reality in the plot, but you'll find it in the details of this one. A movie that makes you think about the assumption of identity, about who has power in society, and how that shifts depending on the circumstances.",
         "Stars Darling Narita and Peter Greene. Narita is an actress down on her luck who masquerades as a policewoman for a day. Her acting is pretty good, but she miraculously is not killed by any of the criminals with whom she comes into conflict. Credibility is strained. Nevertheless, the movie accurately shows with wry humor how it can happen that people treat us according to who they think we are. In cast credits, Lucy Liu is mis-identified as Lucy Lui. An inauspicious beginning for a actress who appears to be poised for stardom.",
         "Bang is a good film. Ash manipulates the story well, and the camera squeezes every bit of it in the frame. Great paradoxes between the real and the absurd. Everything is presented well. Good acting, great story, great drama, great cinematography. Check it out. It is a fresh film, one that stands out from the normal action/ drama that is out there.",
         "I don't agree with the other review i really enjoyed the film .Its a hard hitting drama that keeps you watching, a little twisted in places but i think it was intended to shock a very art-house sort of film .I watched it on an independent film channel in the UK late one night so maybe the alcohol helped watch out for the little sub plot running through the film strange anyway enjoy the film its a must see,the film starts slowly but soon gets going a bent policeman plays a nasty trick on the leading lady and is soon caught out resulting in the tables being turned on him. She then steals the policeman's motorbike and pretends to be a policeman then the story begins",
         "A down-and-out actress from L.A. gets evicted and arrested, then gets revenge on all those who wronged her. This film takes an improbable series of events and creates a bizarre yet plausible storyline. It reminds me of John Schlesigner's \"Billy Liar\" - except that the protagonist in Bang! actually gets to play out her fantasies. One of my all time favorites. It's a movie about crooked cops, individual rights, L.A., latinos, asians, unfortunate circumstance, women's rights, etc. There's much to say but I don't want to give it away and I can't submit a review unless it's at least ten lines long so stop reading this already and go watch Bang!"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Asylum Films",
         "Eagle Eye Films Inc.",
         "FM Entertainment"
      ],
      "summaries": ["A young woman in L.A. is having a bad day: she's evicted, an audition ends with a producer furious she won't trade sex for the part, and a policeman nabs her for something she didn't do, demanding fellatio to release her. She snaps, grabs his gun, takes his uniform, and leaves him cuffed to a tree where he's soon having a defenseless chat with a homeless man. She takes off on the cop's motorcycle and, for an afternoon, experiences a cop's life. She talks a young man out of suicide and then is plunged into violence after a friendly encounter with two \"vatos.\" She is torn between self-protection and others' expectations. Is there any resolution for her torrent of feelings?"],
      "budget": 0
   },
   "movielensId": 1697,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-09",
      "dvdReleaseDate": "2006-11-21",
      "directors": ["Ash Baron-Cohen"],
      "runtime": 98,
      "movieId": 1697,
      "title": "Bang",
      "mpaa": null,
      "actors": [
         "Darling Narita",
         "Peter Greene",
         "Michael Newland",
         "Erik Schrody",
         "Michael Artura",
         "James Sharpe",
         "Luis Guizar",
         "Art Cruz",
         "David Alan Graf",
         "Stanley B. Herman",
         "James Noble",
         "Lucy Liu",
         "David Preston",
         "Paul Saucido"
      ],
      "imdbMovieId": "0109266",
      "originalTitle": "Bang",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young woman in L.A. is having a bad day: she's evicted, an audition ends with a producer furious she won't trade sex for the part, and a policeman nabs her for something she didn't do, demanding fellatio to release her. She snaps, grabs his gun, takes his uniform, and leaves him cuffed to a tree where he's soon having a defenseless chat with a homeless man. She takes off on the cop's motorcycle and, for an afternoon, experiences a cop's life. She talks a young man out of suicide and then is plunged into violence after a friendly encounter with two \"vatos.\" She is torn between self-protection and others' expectations. Is there any resolution for her torrent of feelings?",
      "tmdbMovieId": 124606,
      "avgRating": 2.38462,
      "releaseYear": "1995",
      "numRatings": 26,
      "posterPath": "/vjhY37XLUKdPKhBnJzzmbZhxlMV.jpg"
   }
}