{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "angel",
            "id": 290
         },
         {
            "name": "difficult childhood",
            "id": 2467
         },
         {
            "name": "insane asylum",
            "id": 4924
         },
         {
            "name": "pig",
            "id": 4931
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "boarding school",
            "id": 6271
         },
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "dark comedy",
            "id": 10123
         }
      ],
      "imdb_id": "tt0118804",
      "video": false,
      "title": "The Butcher Boy",
      "recommendations": [
         19965,
         51321,
         199291,
         27234,
         16885,
         85589,
         47818,
         34207,
         89199,
         11308,
         73669,
         136478,
         61418,
         78146,
         41747,
         49805,
         4676,
         18414,
         88448,
         38294
      ],
      "backdrop_path": "/5rNL2RZzQWTh5y8jk11cdO4NGGE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Francie Brady",
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf39",
               "name": "Eamonn Owens",
               "profile_path": "/mHMYi0EmHVBD8S8REaVAo4MTEZY.jpg",
               "id": 17779,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joe Purcell",
               "gender": 0,
               "credit_id": "52fe444fc3a368484e01bf3d",
               "name": "Alan Boyle",
               "profile_path": null,
               "id": 89390,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mrs. Nugent",
               "gender": 1,
               "credit_id": "52fe444fc3a368484e01bf41",
               "name": "Fiona Shaw",
               "profile_path": "/74b0OuN3xKs0dTMYBnbhDLwv8Oq.jpg",
               "id": 10981,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Phillip Nugent",
               "gender": 0,
               "credit_id": "52fe444fc3a368484e01bf45",
               "name": "Andrew Fullerton",
               "profile_path": null,
               "id": 89391,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Da Brady",
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf49",
               "name": "Stephen Rea",
               "profile_path": "/taD1NngDbW8cyCuacAT3YaecSEG.jpg",
               "id": 9029,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ma Brady",
               "gender": 1,
               "credit_id": "52fe444fc3a368484e01bf4d",
               "name": "Aisling O'Sullivan",
               "profile_path": "/luQzkPjhck89cjhmwjr6HdjvsEV.jpg",
               "id": 42607,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Leddy",
               "gender": 0,
               "credit_id": "52fe444fc3a368484e01bf51",
               "name": "Peter Gowen",
               "profile_path": "/cg8HiiICVTcZDcJBskp4cJfBJhf.jpg",
               "id": 42838,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Sergeant",
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf55",
               "name": "Sean McGinley",
               "profile_path": "/yYLnTgn7RDR50crBOV7juzJlq6f.jpg",
               "id": 2468,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Dr. Boyd",
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf59",
               "name": "John Kavanagh",
               "profile_path": "/3ElWQEcnhi3lgYtbWPVV9EfExdw.jpg",
               "id": 20282,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mrs. Canning",
               "gender": 1,
               "credit_id": "52fe444fc3a368484e01bf5d",
               "name": "Rosaleen Linehan",
               "profile_path": "/9uUoYAFJ6Q9iPA2PIPRQ95YxdGe.jpg",
               "id": 89393,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Mrs. Coyle",
               "gender": 0,
               "credit_id": "52fe444fc3a368484e01bf61",
               "name": "Anita Reeves",
               "profile_path": null,
               "id": 89394,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Father Dom",
               "gender": 2,
               "credit_id": "53e7c5abc3a3683999001f6c",
               "name": "Niall Buggy",
               "profile_path": "/9xujZ9JOZw8QErVumCs6XCzAVdc.jpg",
               "id": 40043,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Bogman #1",
               "gender": 2,
               "credit_id": "59b8934c9251417e23009099",
               "name": "Gregg Fitzgerald",
               "profile_path": null,
               "id": 1384967,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe444fc3a368484e01bf67",
               "name": "Neil Jordan",
               "profile_path": "/4OWdIhT5gcfcHoBUzGL7E8tu9T1.jpg",
               "id": 17016,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe444fc3a368484e01bf6d",
               "name": "Neil Jordan",
               "profile_path": "/4OWdIhT5gcfcHoBUzGL7E8tu9T1.jpg",
               "id": 17016,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf73",
               "name": "Pat McCabe",
               "profile_path": null,
               "id": 17017,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe444fc3a368484e01bf79",
               "name": "Sandy Powell",
               "profile_path": "/6J0JwsWmFv3vKEguRTV71aK5J.jpg",
               "id": 9027,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.272963,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 22797,
      "vote_count": 45,
      "budget": 0,
      "overview": "Francie and Joe live the usual playful, fantasy filled childhoods of normal boys. However, with a violent, alcoholic father and a manic depressive, suicidal mother the pressure on Francie to grow up are immense. When Francie's world turns to madness, he tries to counter it with further insanity, with dire consequences.",
      "similar": [
         2253,
         180863,
         281957,
         445954,
         133805,
         400,
         1266,
         3134,
         2640,
         59967,
         238636,
         9093,
         1374,
         979,
         8456,
         35,
         101,
         205,
         275,
         627
      ],
      "original_title": "The Butcher Boy",
      "runtime": 110,
      "poster_path": "/5Ch9jHcwxL9VKC1AuRxU54PcRtK.jpg",
      "spoken_languages": [
         {
            "name": "Gaeilge",
            "iso_639_1": "ga"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Geffen Pictures",
            "id": 360,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-07-13",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Neil Jordan"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Pat McCabe",
         "Neil Jordan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118804/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzA3NTM3OTM5N15BMl5BanBnXkFtZTcwMjAyMDE0MQ@@._V1_SY317_CR18,0,214,317_AL_.jpg",
      "actors": ["Stars: Stephen Rea, Fiona Shaw, Eamonn Owens | See full cast and crew »"],
      "reviews": [
         "I don't understand how this movie is so unknown by most of the people. Simply put, this is an amazing film. Eamonn Owens' performance is just unbelievable. There are some serious and sensitives themes in this movie (murder, suicidal thoughts, alcoholism, child abuse, religion) however it's not a disturbing movie (it has its moments though). The reason for the lack of disturbance in this film is because we're seeing everything from the perspective of a little boy. The Butcher Boy is, for sure, one of the best dark comedies/dramas that I've seen. Highly recommendable.",
         "THE BUTCHER BOY comically chronicles a young boy's descent into madness. The boy provides a voice-over from the present to tell the story of his youth in an Irish village in the early 60s. His father's a violent drunk, and his mother is already insane, so it's not difficult to explain why the kid is losing his mind. It's just that he really doesn't know he's going crazy. He believes he's leading a perfectly normal life as we watch in horror as his actions grow more violent and frightening. And it's a comedy! Neil Jordan is a craftsman and creates a very enjoyable movie even given the very dark subject matter. The child actor's are great, the best I've seen this side of PONETTE. If the subject and its treatment don't put you off you will like this movie. If not, try something else.",
         "Just caught this movie on cable; I hadn't heard of it before. It is a brilliant film; black comedy of the blackest sort. What is truly amazing is the acting ability of lead Eamonn Owens; in my mind the finest performance of a kid his age that I've ever seen. The sardonic humor of this film, the way it treats such horrible things as lightly as it does, the acting, the script, the quaint narrative devices, and sense of menace cloaked in charming small town Irish life make this a thoroughly original and engaging character study. Sinead O'Connor is a scream as the Virgin Mary. The thick accents in this film make it a little bit difficult to follow in parts, but American audiences should still be able to understand most of the dialogue. I cannot recommend this film highly enough; it is proof that you can still make a quality movie without buying into cheap Hollywood cliches.",
         "The Butcher Boy is a very weird film...This boy Francie has a bad influence; his father. His father is a violent man, alcoholic, but he loves his son a lot...This boy is very well played by Eamonn Owens, a young actor I didn't know before who surely worths a look at his performance. Stephen Rea is perfect in the role of the violent father, and Fiona Shaw is great in the role of a woman who hates Francie, because he beats up her son. But Francie is dangerous...The story is a mix of fear, hate, madness, happiness, that is mixed up in that little boy's brain. Sometimes, he's the good boy who protects his mother and sometimes he is the murderer...Francie is full of contradictions, and he tries to put happiness and death together. The narrator is very funny, but sometimes tells innapropriate things for the images we watch...but that's the psychotic part of it...incredibly well-shot, this film deserves lots of attention. I bought it for five stupid dollars...and Lost In Space was fifteen dollars...and the video sold it because of the lack of rentals...well, too bad for this video, they have one less good film on the shelf.... Neil Jordan brought us The Crying Game, Interview With The Vampire, In Dreams and some other good films...but I believe this one is his finest job...it's like watching Sleepers, Psycho and A Clockwork Orange at the same time. One thing that could be a problem; the accent of the characters when they speak...but I was happy to see that it was not set in the United States...Great film... I give it 85% and maybe it deserves better.",
         "Neil Jordan, famed for such hits as Michael Collins and The Crying Game, returns to a much more conventional style of filmmaking. This time he leaves out the stars: no Liam Neeson, no Aidan Quinn, no Julia Roberts. This time it's cinema verite: a sotto-voce cast (barring Stephen Rea) which takes the mind off the actors and onto the film. Which is good, because the film is a ripsnorter. It's a powerful expose on how children can turn out horribly wrong through a tough childhood. There is no fancy cinematography or cutesy-pie moments; no Hollywood endings or Schwarzenegger stick-ups. This is pure black comedy which relies on a fabulous script. It revolves around the life of Francie Brady, a young Irish boy who gets up to all sorts of mischief. Him and his friend, Joe, are the local troublemakers in Dublin. But, there's more to Francie than one would think. His is a soul which is black at the core, and the passing of prominent figures in his life, as well as time spent in and out of juvenile detention centres, plus the dirty priests which govern the schools, sends the boy over the edge. He paints a picture of hyperbole. Francie always seems happy, energetic and ready for action, yet boiling up inside of him are bloody demons and unimaginable violence. It's that hyperbole which creates so much tension in the movie, just wondering what he'll do and when he'll do it. The film is narrated by an older Francie, one who has spent his life in a prison for the mentally insane. His narration is humorous and ironic, yet occasionally it derives some of the power from the movie because of its light-hearted, schmultzy comments. Francie sometimes talks to his older self, making one remember \"Ferris Beuler's Day Off\", but apart from that, the film is fantastic. It lags in parts. Occasional scenes are drawn out and lengthy, and you just want to scream out, \"pick up the damn butcher's knife and kill someone!\" To make the film increase in pace. But that's not a major problem, that might just be my attention span, if you didn't have those scenes you wouldn't have such a poignant movie. The Butcher Boy has a very satisfactory denouement. We all took our childhood for granted. It had its ups, it had its downs. This is a film which portrays what sort of childhood arises from continuous downs, dominated by misery and loss, and how much of an effect it can have on such an impressionable mind. This is a wonderful, black, violent, dramatic and hilarious movie. A rare offering, indeed. Nine out of ten.",
         "I went to my local video store last night and walked straight to its awesome horror section. I was specifically looking for this movie, as i had seen it in the store before, and was about to see it until my friend decided that we'd walk out with Joy Ride. The cover of this movie intrigued me, and lead me to think that it would be a darkly comeidic yet still very scary story about a boy's descent into madness. The Butcher Boy is about an Irish boy, Francie, whose domestic life is miserable. His dad is always drunk and his mother is mentally unstable. However, he lets his anger out through his mischevous behavior in the town, particularly directed towards Mrs Nugent and her son, a perfect mother with a perfect son. Francie is also best friends with Joe, a sensitive kid of whom we get the impression from that he is losing interest in Francie's treatings of others, which are going a bit too far. A lot more happens in The Butcher Boy, but if you don't like what you just got, don't see the movie. Though it's not slow, Francie's character development seems to drag, and Neil Jordan seems to advance his personality just before we've had enough. The acting is what makes the movie what it is. Somebody call Eamonn Owens and give this kid a part in a movie. He owns the movie, he is the movie. Words cannot describe how good th' young laddie is at acting as the troubled Francie. This has to be one of my favorite acting performances of all time, right up there with Jason Schwartzman in Rushmore, and Kiefer Sutherland in Stand By Me. This kid needs a good role badly. Everybody else is decent, though i feel that Stephen Rea as Francie's father underplayed the role, and could've added more depth to the character. The character seemed to be waiting to become lively and three dimensional, but Rea went for the B minus and stopped there. The butcher boy was not what I expected, and if you're looking for a horror movie about madness, look elsewhere. If you want a dramatic character study with a child actor better than a million Haley Joel Osments, this is for you. It is thought provoking, upsetting, and doesn't beg for it at all. How many movies can you say that about?",
         "During the 1960's people were fearful of losing their world. What with the Cuban Missle Crises and the threat of Nuclear Winter, it's little wonder many hid in prayerful disillusion. For two young Irish boys, something loomed closer. Their lives encompassed their town, their family and their friendship. The first is Joe Purcell (Alan Boyle) a typical Irish boy out to enjoy his youth. The second is his best and closest friend named Francis Brady (Eamonn Owens) who becomes the unlikely hero in the movie, \"The Butcher Boy.\" To Joe, friendship is a temporary bond which enhances life with laughter, pranks and boyhood imagination. But to Francis Brady, friendship is permanent and indelible which nothing on the planet, including Atomic fire, can separate. Enter, the boy's Nemesis, the town gossip and constant irritation to their bond. Mrs. Nugent, (Fiona Shaw) sees the boys as lowly delinquents, petty trouble makers, vicious bullies and future criminals. During the escalating conflict, the audience watches as Francis loses many of the people he loves. Eventually, Mrs. Nugent causes him to lose his best friend. Vengefully, Francis marks her for ultimate punishment. Audiences must decided the boy's reason for his erratic behavior. Was it his drunken father's (Stephen Rea) physical abuse, his mother's suicidal tendencies, incarceration at reform school, becoming a victim of sexual abuse by Father Sullivan (Milo O'Shea), subsequent shock treatments, increasing mental delusions of space aliens or iconic religious figures. It's little wonder Francsis commits the ultimate act of revenge. This is an honest, straight forward movie, which depicts the inner workings of a fragile but psychotic boy in crises. Many people allow maturity to transform them into adults, but some refuse, paying the inevitable price for doing so. ****",
         "The Butcher Boy is exuberant, funny and horrific. It's passionate and inventive and unforgettable. The Butcher Boy was directed by Irishman Neil Jordan who's previous films are impressive. They include The Crying Game, Mona Lisa, Interview With A Vampire, and Michael Collins. The Butcher Boy is based on a novel by Patrick McCabe who also co-wrote the screen play. I'm very pleased to relate that The Butcher Boy isn't based on a true story!!! I sure hope it isn't anyway. The Butcher Boy is about a lad who commits a horrific murder in a rural Irish town. But the film certainly isn't solemn. Jordan has enlivened an essentially gory tale with a touch of inventive, sometimes humorous magic realism (a bewigged Sinead O'Connor plays The Virgin Mary). Jordan is also blessed by having available a wonderfully gifted leading actor. Fifteen year old Eamonn Owens, a schoolboy in real life from near where The Butcher Boy was shot, plays 12 year old Francie Brady. Francie finds himself betrayed. His dad (Stephen Rea) is a drunk, his Ma (Aisling O'Sullivan) is suicidal. His best friend lets him down. The township and it's institutions aren't supportive. He eventually takes his revenge. The boy also has visions. We could say he's imaginative as children should be, but this boy is cheerfully violent as well. The Butcher Boy doesn't discuss cause and effect at all, but such is the power of the film, most viewers will wonder how such a thing could happen. Was Francie schizophrenic? Was he a psychopath. If he had had a stable loving family what might have happened? Regardless, Eamonn Owens is just terrific as the cheerful, energetic, often very funny Francie Brady. This red headed bundle of uninhibited, unselfconscious energy has created a very memorable screen character indeed. Neil Jordan must have been tickled pink to have such a lead for his film. Leading English stage actress Fiona Shaw plays the prissy Mrs Nugent and Irish stalwart, Milo (the eyebrows) O'Shea plays a meddlesome priest. Stephen Rea fans won't find much to celebrate since Rea doesn't do much more than look drunk, sit, and kick in a television, but that's because The Butcher Boy quite rightly revolves around the wonderful, funny and bloody Eamonn Owens. See The Butcher Boy if you can.",
         "I'd be lying if I claimed that the original reason I saw this wasn't anything as simple and basic as curiosity... the plot simply sounds so bizarre that one can't help but wonder about the movie itself. The movie is a wonderful mix of surrealism, drama and black comedy. As another reviewer points out, the accents may make the dialog a little hard to make out... I was fortunate enough to have subtitles(as any Dane will tell you, we get subtitles on everything that is presented to us on a screen), but I think most anyone who has a good enough grasp on the English language(and a good ear wouldn't hurt) will be able to understand, at the very least, enough of it to follow what's going on. The film is quite disturbing... it's told by a psychotic, and everything is seen from his point of view, making the line between truth and fantasy blur. The narrative is impressive, underplaying some scenes to great effect. The plot is interesting. The pacing is a tad uneven... while most of the film moves as it should, not too fast nor too slow, there are parts where it seems to come to a complete halt. Luckily, these parts are few and far between. The characters are well-written and credible. They are also all competently portrayed. The acting... wow. What can I say? Eamonn Owens is nothing short of an artist. As you watch the film(which I hope you will), observe his eyes... look into them, as he looks around menacingly, and tell me that you don't feel fear. Pure fear. One is reminded of Donald Pleasence's marvelous monologue about Michael Myers' eyes(in Halloween, for the uninitiated). That stare... if I ever met Owens in real life, I doubt I'd dare look him in the eye. Even more impressively, this was his debut performance. I'll have to watch more of his movies, to see if he can pull off other roles as well, but he certainly nailed this one. Stephen Rea was great... I've seen him in nothing else, but I could recognize his face from the trailers for V for Vendetta, a movie I'm looking forward to(even more now that I know he will grace the film with what is sure to be just as astounding a performance as he gave here), even though I'm sure it won't live up to Alan Moore's graphic novel. Sinéad O'Connor was a blast(and seemed to be having one, as well) as Our Lady. I haven't been able to find out who portrayed the main character as an adult, but let me tell you, his voice acting is grand. The narration definitely adds to the film, both in use and in acting. The writing is great. The whole film is highly entertaining and very poignant. This should be seen by just about anyone who can live with(and more importantly, understand) the language and take the disturbing nature of the film. I recommend this to anyone who is afraid of neither accents nor the disturbing images contained herein. Very funny and quite unsettling. 8/10",
         "I'm glad I finally got around to checking out THE BUTCHER BOY - it's one of those sort of films that I've been keeping my eye on for a while, but never managed to pick it up. It turned out to be another strange, cult-like gem that was well worth waiting for. Francie is a troubled kid growing up in working class Ireland in a household where his mother is nuts and his father's a drunk. His one true friend, Joe is all Francie really has, until fate (and Francie's penchant for trouble-making) separate the boys. The rest of the film chronicles Francie's sometimes hilarious, sometimes touching, sometimes disturbing descent into his own madness... A strange films that will run you through the range of emotions - THE BUTCHER BOY is an original film that's hard to compare to any other. I guess I would say it somewhat reminded me of BAD BOY BUBBY (not in \"content\" - more in how it \"effected\" me) as like BBB - THE BUTCHER BOY has parts that are funny, witty, dark, sad, disturbing, heartfelt, and much more - all in one film, without feeling like it's being taken overboard. Another BIG plus - is that oftentimes I'm annoyed by child-leads in films - but Francie's character (and actually all the child actors for that matter) were spot-on in this film. My ONLY real gripe is that many of the characters have such a strong Irish accent that I couldn't tell what the hell they were saying half the time - but that's not their fault, I just found it a bit distracting. A truly strange treasure that I highly suggest checking out...9/10"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Geffen Pictures"],
      "summaries": ["Francie and Joe live the usual playful, fantasy filled childhoods of normal boys. However, with a violent, alcoholic father and a manic depressive, suicidal mother the pressure on Francie to grow up are immense. When his mother eventually commits suicide and Joe goes off to boarding school, Francie sinks ever deeper into paranoia directed mainly against Mrs. Nugent, a nasty neighbor, and fantasy where he has visions of the Virgin Mary. After his father dies Fancie's condition worsens, his behavior becomes more bizarre and erratic culminating in the extremely bloody murder of Mrs. Nugent whom he holds responsible for all the wrongs visited upon him. The authorities arrest Francie and commit him to an asylum in an attempt to cure him."],
      "budget": 0
   },
   "movielensId": 1699,
   "movielens": {
      "languages": [
         "Gaeilge",
         "English"
      ],
      "releaseDate": "1997-07-13",
      "dvdReleaseDate": "2007-02-13",
      "directors": ["Neil Jordan"],
      "runtime": 110,
      "movieId": 1699,
      "title": "The Butcher Boy",
      "mpaa": "",
      "actors": [
         "Eamonn Owens",
         "Alan Boyle",
         "Fiona Shaw",
         "Andrew Fullerton",
         "Stephen Rea",
         "Aisling O'Sullivan",
         "Peter Gowen",
         "Sean McGinley",
         "John Kavanagh",
         "Rosaleen Linehan",
         "Anita Reeves",
         "Niall Buggy",
         "Gregg Fitzgerald"
      ],
      "imdbMovieId": "0118804",
      "originalTitle": "The Butcher Boy",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["SUheRKqVDV0"],
      "plotSummary": "Francie and Joe live the usual playful, fantasy filled childhoods of normal boys. However, with a violent, alcoholic father and a manic depressive, suicidal mother the pressure on Francie to grow up are immense. When Francie's world turns to madness, he tries to counter it with further insanity, with dire consequences.",
      "tmdbMovieId": 22797,
      "avgRating": 3.61738,
      "releaseYear": "1997",
      "numRatings": 1214,
      "posterPath": "/5Ch9jHcwxL9VKC1AuRxU54PcRtK.jpg"
   }
}