{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116490",
      "video": false,
      "title": "Tar",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [],
      "popularity": 0.004522,
      "production_countries": [],
      "id": 293820,
      "vote_count": 0,
      "budget": 0,
      "overview": "Directed by Goetz Grossmann",
      "similar": [],
      "original_title": "Tar",
      "runtime": null,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1997-11-26",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Goetz Grossmann"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Gilbert Giles",
         "Goetz Grossmann"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116490/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2NTkyOTM2NF5BMl5BanBnXkFtZTcwOTg3MDUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kevin Thigpen, Nicole Prescott, Seth Gilliam | See full cast and crew »"],
      "reviews": [
         "I think this film was OK. I thought that Kevin Thigpen the guy who plays Curtis and Nicole Prescott the girl who played Tracy had great on-screen chemistry and I liked the jazzy type of music in the film. Overall, I thought it was pretty low budget and the story line seemed a bit scattered. The only parts of the movie that I enjoyed watching were the scenes that Kevin Thigpen and Nicole Prescott did. I am an avid supporter of any black indie film that comes out, just to give patronage and support to independent black films, but it was not a very good movie. If you are bored on a Saturday and want to watch a movie then this is the movie to watch",
         "\"Tar\" was a very good film. The performances were a bit rocky at the start, however, things picked up and I was hooked. ACTING: At the onset, the acting was a tad bit shaky, but improved through the course of the film. The lead \"Curtis\" and others were quite good. CINEMATOGRAPHY: The film stock used gave this film a 1970's look to it and was very effective. New York looked as gritty and real as ever - and I loved it. There were some interesting shots here. SOUND/AUDIO: Some great music used within; it matched the theme of the film perfectly...kind of 'gritty, underground rap' that matched well with the movie. STORYLINE: The storyline had a few issues. The character portraying the leader of the Black movement did not have his character fleshed out properly. He was briefly introduced in the beginning (the tarring), then midway, then resurfaced at the closing in a sequence I didn't understand. Why did he point a gun at the lead character simply because he did not want to follow through? Also, the mole character should have been fleshed out more also. Was he an actual cop or simply a paid informant off the street? What were his motivations? Overall: The love story between the fired cop and the lead was effective and kept the story going. I liked this film. The cast was effective and the overall aesthetic the film had looked great. Very good for a low budget film.",
         "Really, really crappy. Please, don't waste your time with this totally unimaginative piece of drek. If I had seen this in a theater, I would have definitely walked out. Honestly, I only watched the whole thing to see how bad it could get. Bad. Very bad."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Horres Film + TV"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 1706,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-11-26",
      "dvdReleaseDate": "2003-06-03",
      "directors": [""],
      "runtime": 0,
      "movieId": 1706,
      "title": "Tar",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0116490",
      "originalTitle": "Tar",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Directed by Goetz Grossmann",
      "tmdbMovieId": 293820,
      "avgRating": 1.97222,
      "releaseYear": "1997",
      "numRatings": 18,
      "posterPath": null
   }
}