{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "hiv positive",
            "id": 165770
         }
      ],
      "imdb_id": "tt0113464",
      "video": false,
      "title": "Jeffrey",
      "recommendations": [
         31944,
         133575,
         41253,
         77621,
         9977,
         37922,
         19317,
         9098,
         36672,
         25099,
         56511,
         41480,
         146778,
         1387,
         55561,
         41862,
         42122,
         54934,
         32633,
         42719
      ],
      "backdrop_path": "/r2bFvokTTe2TcVs1AGgtg99ukqt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeffrey",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f5f9",
               "name": "Steven Weber",
               "profile_path": "/ujINzDjLNtELBSUkRHQgExzP4Fb.jpg",
               "id": 6106,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sterling",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f5fd",
               "name": "Patrick Stewart",
               "profile_path": "/wEy5qSDT5jT3ZASc2hbwi59voPL.jpg",
               "id": 2387,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Steve Howard",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f601",
               "name": "Michael T. Weiss",
               "profile_path": "/ky7sNGtQVrB69ZzhziK68Jz4MPS.jpg",
               "id": 42722,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Debra Moorhouse",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f60b",
               "name": "Sigourney Weaver",
               "profile_path": "/gxBIAr3CnBjkNRoPovVJCvEGqP0.jpg",
               "id": 10205,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ann Marwood Bartle",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f60f",
               "name": "Christine Baranski",
               "profile_path": "/veyiN4RP8ZmYfljTNKIyhTCuF2C.jpg",
               "id": 11870,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Darius",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f613",
               "name": "Bryan Batt",
               "profile_path": "/Aw9vEE9CGPYlUrwubVED3fpgjkB.jpg",
               "id": 180422,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f617",
               "name": "Victor Garber",
               "profile_path": "/xFgPEfVEqz7Li2xoyjRPEKCjCrH.jpg",
               "id": 8536,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Father Dan",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f61b",
               "name": "Nathan Lane",
               "profile_path": "/2eB01W4VURqihttVdewfhfhhCwW.jpg",
               "id": 78729,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dad",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f61f",
               "name": "Peter Maloney",
               "profile_path": "/q6R13qWu3EzEGuyfz7n30RNllQj.jpg",
               "id": 15415,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mom",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f623",
               "name": "Debra Monk",
               "profile_path": "/ufZO6Uo9cy4ayM6jJfHfnqL5Elt.jpg",
               "id": 10386,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mrs. Marcangelo",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f627",
               "name": "Olympia Dukakis",
               "profile_path": "/8kYmUwC0SfnJKt39M5Xrr8Q0oIf.jpg",
               "id": 3019,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Sharon",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f62b",
               "name": "J. Smith-Cameron",
               "profile_path": "/nlqKCF29YVHmn9w2IX9pMa5nMqe.jpg",
               "id": 52475,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Dave",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f62f",
               "name": "Ethan Phillips",
               "profile_path": "/clvz59hE09gV2a3FYNBsjUPvPgz.jpg",
               "id": 29445,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Acolyte",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f633",
               "name": "Kathy Najimy",
               "profile_path": "/eFFh5QU9ErNKls7WfyG8VHEc2MY.jpg",
               "id": 11074,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Single Woman",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f637",
               "name": "Camryn Manheim",
               "profile_path": "/baUSk3l2bcmxGvIpifFAyHq2v28.jpg",
               "id": 20187,
               "order": 14
            },
            {
               "cast_id": 28,
               "character": "Grandma Rose",
               "gender": 1,
               "credit_id": "53938f95c3a3686434001d3b",
               "name": "Alice Drummond",
               "profile_path": "/f1O8suDhVloKdPvhyltj017SPTo.jpg",
               "id": 17488,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f607",
               "name": "Christopher Ashley",
               "profile_path": null,
               "id": 252806,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f63d",
               "name": "Paul Rudnick",
               "profile_path": null,
               "id": 32588,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f643",
               "name": "Mark Balsam",
               "profile_path": null,
               "id": 948028,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f649",
               "name": "Mitchell Maxwell",
               "profile_path": null,
               "id": 1112106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47269251416c7508f64f",
               "name": "Victoria Maxwell",
               "profile_path": null,
               "id": 159581,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47269251416c7508f655",
               "name": "Kevin McCollum",
               "profile_path": null,
               "id": 19315,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47269251416c7508f65b",
               "name": "Jeffery J. Tufano",
               "profile_path": null,
               "id": 1144651,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "52fe47269251416c7508f661",
               "name": "Cara Silverman",
               "profile_path": null,
               "id": 56716,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe47269251416c7508f667",
               "name": "Stephen Endelman",
               "profile_path": "/1ey21aHi5U3FS5iZeVwvnodwSrX.jpg",
               "id": 21276,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f66d",
               "name": "Andrew Baseman",
               "profile_path": null,
               "id": 958931,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe47269251416c7508f673",
               "name": "P. Michael Johnston",
               "profile_path": null,
               "id": 1144658,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.739824,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17447,
      "vote_count": 21,
      "budget": 0,
      "overview": "Jeffery, a young gay man in New York, decides that sex is too much and decided to become celibate. He immediately meets the man of his dreams and must decide whether or not love is worth the danger of a boyfriend dying.",
      "similar": [
         449176,
         380874,
         47643,
         184352,
         26280,
         383526,
         26933,
         258034,
         425193,
         338189,
         52799,
         413666,
         322127,
         261776,
         340684,
         10938,
         160165,
         26371,
         9800,
         376867
      ],
      "original_title": "Jeffrey",
      "runtime": 92,
      "poster_path": "/imrDwqsDpufHtoewyCgJUvAD4L0.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Booking Office",
            "id": 12909,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Workin' Man Films",
            "id": 12910,
            "origin_country": ""
         }
      ],
      "release_date": "1995-08-18",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Love is an adventure when one of you is sure... and the other is positive.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Ashley"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Paul Rudnick",
         "Paul Rudnick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113464/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MjM1Njc3NF5BMl5BanBnXkFtZTcwNzI0OTgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Steven Weber, Michael T. Weiss, Peter Jacobson | See full cast and crew »"],
      "reviews": [
         "I watched \"Jeffrey\" with my Husband earlier tonight. I had meant to watch it for years, but it was a \"gay\" film, a genre which I love, but often eschew because these films always make me think--even \"La Cage aux Folles\" had a deep and abiding lesson or two hidden inside.) The themes often involve intolerance, and the traumatic impact of AIDS on the entire gay community; even if the film is a comedy, I find these themes fill me with empathic pain and frustration. I decided to brave those themes despite my female tear ducts this evening, and I was glad I did. This film was silly. This film was witty. The dialogue is sparkling. All those things made it wonderful to watch. The characters we meet are intriguing, and though the 2-dimensional stereotypes are made for laughs, we get the feeling that we are laughing at the strange mix of truth and falsehood many of the stereotypes possess; we are laughing not at people who are \"flaming\" but at characters who are exuberant, joyous people, trying to squeeze every bit of joy and delight that they can out of every moment. I won't spoil the journey through this story with any specifics, let's just say that Jeffrey doesn't quite get it. It is both painful and joyful at turns watching the character navigate through a turning point in his life. I laughed, I got choked up, and then I laughed again, and again ad infinitum. This is not a \"gay\" movie. It's a character driven story that we can all identify with, if our minds and hearts are open.",
         "This is one of those movies that I confidently predict will wind up being considered much better as time goes on than the critics said at its inception. It's especially funny (and biting on occasion) if you happened to have lived through the first rush of AIDS deaths and the fear that engendered. This whole movie is a send up of that, and revels in the idea that sex and life go on even in the aftermath of terror. The Hoe-down fantasy sequence with its overtones of Busby Berkley and Oklahoma is hysterically funny. As for the acting, it's purposely broad with Patrick Steward playing against type, both in his role of Picard and in his many Shakespearean ones. Steve Weber is a hoot and there is no doubt in my mind that the other actors had a blast working in this flick. Many of them appear to have that \"look\" you see when actors are performing for their peers and enjoying every moment of it. The Pink Panthers moment alone lets Stewart shine. Are there flaws in the movie. Yup! The dialogue is sometimes stilted and jokes occasionally are dumped in rather than flowing from the plot, but overall it's witty, biting, and downright rapier-like on more than one occasion. All in all, Jeffrey is fun and worth an hour or so of your life.",
         "I've noticed that many of the people who really didn't like this film were taking it way too seriously....Either that or they were expecting too much. Its a comedy, (with some serious underlying issues)...It doesn't pretend to be anything else. I found it fun, light-hearted and adorable. Michael Weiss is yummy as usual, Patrick Stewart adds flair and finesse, Nathan Lane gives yet another spunky fun performance, etc.. If you have high expectations for the film, you're going to be disappointed. If you want to have a good time and a good laugh, give it a go.",
         "I first saw this film on TV, and was gobsmacked (a British expression!) at Patrick Stewart's performance- this is totally unlike anything else I have seen him in. However, I soon discovered that there many more superb performances in Jeffrey... from the smallest roles (usually played by bigger names than you'd expect!) to the main roles entrusted to Stephen Weber & Michael Weiss. I managed to have a marvelous time just star spotting! I found this so hilariously funny in some scenes, and yet full of pathos in others that I ended up laughing & crying at the same time. In the end I just had to buy it, so I can watch it as often as I want. Be broadminded, and give this film a go... it won't disappoint.",
         "This is the movie that I always say is the funniest one I've ever seen. It's funny because it doesn't rely on Ashton Kutcher or bad parodies or stupid clichés -- the jokes are tight, unique and, most importantly, have meaning. Any comedy that can make us cry at the death of a Broadway extra from Cats (the poor much maligned Cats) but have us laughing at the one man's desire that he feels he can't have, gives us a depth of meaning not seen in comedic film in quite a while. We've become to dependent on having comedies without a meaning, or a point, or a way of laughing at something as terrifying as the AIDS crisis. Sometimes we want to laugh at that which scares us -- it gives us power over it.",
         "This is one of my favorite movies. This movie takes a very serious subject and presents it in a very light-hearted manner. There were times when I wasn't sure if I should have been laughing or crying. My favorite scenes had much to do with the quasi-comical nature in which AIDs is presented, and how each character acts, reacts, and is affected by the sickness. Rest assured, this movie will keep you interested not only with its story line but with the surprise cameo appearances by some of today's best actors. Patrick Stewart gives an outstanding performance as \"Sterling,\" however, it is Michael T. Weiss who steals the show! Not only does he look incredible in white spandex, but his performance is incredibly believable. Whether you are a Weiss fan or not, this movie is a must see! Lanie, NY",
         "Jeffrey is the story of a young gay man, who, in this day of AIDS, decides to give up sex, and the very next day meets the hunk of his dreams. Steven Weber, Michael T Weiss and Patrick Stewart give Oscar worthy performanscs in a film few even know of. It is not truly a 'gay' film , but one about the confusion of true love and the heartbreak of loving some one who is ill. It will bring you to the brink of tears, and then make you laugh. I highly recommend it as a must see.",
         "This is a very silly movie. If you don't think that a movie about AIDS can be silly, you need to see this movie. Susan Sontag would be very happy to see a movie that defies the thought that AIDS=death, and that AIDS (or the fear of it) doesn't stop love or life. Jeffrey is a gay man in New York City who suddenly decides to stop having sex. His plan goes well until he meets a gorgeous man in the gym that he can't stop thinking about. The more he tries to maintain a sex-free lifestyle, the more he thinks about this man. His feelings for the man is complicated when it it revealed to Jeffrey that the man is HIV+. It's as smart as an ironic romantic comedy can be and as funny as a movie about life can be. Personally I think that Patrick Stewart was directed to be far to gay than he needs to be (Not all gay men are limp-wristed, Patrick.) and the world doesn't need another gay priest joke, but you can't take this movie to seriously. After all it's a romantic comedy!",
         "Jeffrey should have been a major massive blockbuster, a sure-fire smash hit, just take a look at some of the names on the cast, Christine Baranski, Patrick Stewart, Sigourney Weaver, Kathy Najimy, Nathan Lane and Olympia Dukakis, yet it failed to set the queer or the straight world alight. Jeffrey a gay romantic comedy from America came out in 1995/6 and was based on a Paul Rudnick play about a young gay New York guy who considers sex is too dangerous in the days of AIDS and commits to a life of celibacy. Just to throw a spanner in the works and pad the film out another hour he meets the man of his dreams, whom surprise surprise just happens to be HIV+. It starred Steven Weber who was nice enough as the insipid Jeffrey an actor/waiter who is supposed to be AIDSaphobic, which just does not wash. Michael T. Weissis handsome and some nice eye-candy but you just wish he would get on and so something, anything as this film drags on and on and ever on. It would have been a total flop and dire mess on the floor of movie history were it not for the dozens of big names doing small cameos - Olympia Dukakis, Robert Klein, Nathan Lane, Kathy Najimy, Kevin Nealon, Ethan Phillips, Sigourney Weaver and Christine Baranski for example. Read more and find out where this film made it in the Top 50 Most Influential Gay Movies of All Time book, click this link. http://www.amazon.co.uk/dp/B007FU7HPO",
         "When Rudnick's right, he's unbeatable (Addams Family Values, In & Out) and when he's not, he reeks (Isn't She Great). Not having seen Jeffrey as a play, I can't attest to its workability in that form, but as a film, it never really gets off the ground. But as a series of loosely-connected vignettes, it's entertaining. The cameos by various stars are very good; Patrick Stewart's performance outshines the vehicle; and a number of trenchant points about America's ongoing confusion about sexuality are made. I have to keep writing because there's a minimum number of lines of text, which is a completely stupid rule."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "The Booking Office",
         "Workin' Man Films"
      ],
      "summaries": ["Jeffrey, a young gay man in New York, decides that sex is too much and decided to become celibate. He immediately meets the man of his dreams and must decide whether or not love is worth the danger of a boyfriend dying."],
      "budget": 0
   },
   "movielensId": 171,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1995-08-18",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Christopher Ashley"],
      "runtime": 92,
      "movieId": 171,
      "title": "Jeffrey",
      "mpaa": "R",
      "actors": [
         "Steven Weber",
         "Patrick Stewart",
         "Michael T. Weiss",
         "Sigourney Weaver",
         "Christine Baranski",
         "Bryan Batt",
         "Victor Garber",
         "Nathan Lane",
         "Peter Maloney",
         "Debra Monk",
         "Olympia Dukakis",
         "J. Smith-Cameron",
         "Ethan Phillips",
         "Kathy Najimy",
         "Camryn Manheim",
         "Alice Drummond"
      ],
      "imdbMovieId": "0113464",
      "originalTitle": "Jeffrey",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["dhOHvdiLaDI"],
      "plotSummary": "Jeffery, a young gay man in New York, decides that sex is too much and decided to become celibate. He immediately meets the man of his dreams and must decide whether or not love is worth the danger of a boyfriend dying.",
      "tmdbMovieId": 17447,
      "avgRating": 3.59829,
      "releaseYear": "1995",
      "numRatings": 1465,
      "posterPath": "/imrDwqsDpufHtoewyCgJUvAD4L0.jpg"
   }
}