{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "drag queen",
            "id": 824
         },
         {
            "name": "voodoo",
            "id": 3392
         },
         {
            "name": "savannah",
            "id": 7323
         }
      ],
      "imdb_id": "tt0119668",
      "video": false,
      "title": "Midnight in the Garden of Good and Evil",
      "recommendations": [
         10354,
         66,
         12596,
         8012,
         9573,
         14684,
         4912,
         9440,
         6723,
         577,
         9869,
         9386,
         9415,
         10990,
         2928,
         1552,
         9944,
         7007,
         11004,
         31662
      ],
      "backdrop_path": "/zDtIIaPdcRvZnvpD1qnI8v4nHOR.jpg",
      "revenue": 25105255,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "John Kelso",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e3d5",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "James Williams",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e3d9",
               "name": "Kevin Spacey",
               "profile_path": "/x7wF050iuCASefLLG75s2uDPFUu.jpg",
               "id": 1979,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Billy Carl Hanson",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e3dd",
               "name": "Jude Law",
               "profile_path": "/4077Cyuo1mw53u1gNjLyQkqeZN0.jpg",
               "id": 9642,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mandy Nichols",
               "gender": 1,
               "credit_id": "52fe4494c3a36847f809e3ed",
               "name": "Alison Eastwood",
               "profile_path": "/mRXDleUiPyNFSv3mOF4PNR7nhkY.jpg",
               "id": 389,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sonny Seiler",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e3f1",
               "name": "Jack Thompson",
               "profile_path": "/l2NNfs9bd6qxqzIOahcz2hErrq8.jpg",
               "id": 12536,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Minerva",
               "gender": 1,
               "credit_id": "52fe4494c3a36847f809e3f5",
               "name": "Irma P. Hall",
               "profile_path": "/jotUUXdkfC7kdreWHSEVamz2mUy.jpg",
               "id": 43853,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Joe Odom",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e3f9",
               "name": "Paul Hipp",
               "profile_path": "/zQehaRjnln1PWKsU2f8n9pDbQrd.jpg",
               "id": 54041,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Chablis Deveau",
               "gender": 0,
               "credit_id": "52fe4494c3a36847f809e3fd",
               "name": "Lady Chablis",
               "profile_path": null,
               "id": 54042,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Betty Harty",
               "gender": 1,
               "credit_id": "52fe4494c3a36847f809e401",
               "name": "Kim Hunter",
               "profile_path": "/nB44EysedphcIWftSqyyG2qBYk8.jpg",
               "id": 10539,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Luther Driggers",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e405",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Detective Boone",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e409",
               "name": "Leon Rippy",
               "profile_path": "/n6CHIOFY3uWwTPQtmhmFSZh2zv4.jpg",
               "id": 15374,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Bus Driver",
               "gender": 0,
               "credit_id": "52fe4494c3a36847f809e40d",
               "name": "Gary Anthony Williams",
               "profile_path": "/2aS1bHnkEnQErbnJl8ZzQQJSzBM.jpg",
               "id": 54043,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Geza Von Habsburg",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e411",
               "name": "Michael O'Hagan",
               "profile_path": "/vuQcwBBi0JBLe8T3uTmGFBhde0l.jpg",
               "id": 53490,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Finley Largent",
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e415",
               "name": "Bob Gunton",
               "profile_path": "/b3NfI0IzPYI40eIEtO9O0XQiR8j.jpg",
               "id": 4029,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Sara Warren",
               "gender": 1,
               "credit_id": "52fe4494c3a36847f809e419",
               "name": "Patrika Darbo",
               "profile_path": "/ixUbj1NWOtLSpu1T2DN8EaQYHpi.jpg",
               "id": 54044,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Margaret Williams",
               "gender": 1,
               "credit_id": "55aff35ac3a3682ff400e622",
               "name": "Anne Haney",
               "profile_path": "/hvGWQpPpZjWMBa59Bfp2S1mdP5f.jpg",
               "id": 11718,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Alpha",
               "gender": 2,
               "credit_id": "5729fe4fc3a3686dbf00208b",
               "name": "Charles Black",
               "profile_path": "/tET4SUUkVrHEVDejTy6Cs2Xgfao.jpg",
               "id": 1615196,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e3d1",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4494c3a36847f809e3e3",
               "name": "John Berendt",
               "profile_path": null,
               "id": 54039,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e3e9",
               "name": "John Lee Hancock",
               "profile_path": "/1eCqzsuFp0xKGeTEErXyEifN82U.jpg",
               "id": 54040,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e41f",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e425",
               "name": "Arnold Stiefel",
               "profile_path": null,
               "id": 54045,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4494c3a36847f809e42b",
               "name": "Anita Zuckerman",
               "profile_path": null,
               "id": 54046,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e431",
               "name": "Jack Green",
               "profile_path": null,
               "id": 356,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e437",
               "name": "Lennie Niehaus",
               "profile_path": "/tiGnFqQ4o4m81Y10Roghm4bycvo.jpg",
               "id": 195,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4494c3a36847f809e43d",
               "name": "Joel Cox",
               "profile_path": null,
               "id": 384,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4494c3a36847f809e443",
               "name": "Phyllis Huffman",
               "profile_path": null,
               "id": 423,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.880364,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8197,
      "vote_count": 205,
      "budget": 35000000,
      "overview": "A visiting city reporter's assignment suddenly revolves around the murder trial of a local millionaire, whom he befriends.",
      "similar": [
         253,
         10198,
         8487,
         2667,
         10585,
         9637,
         9090,
         11054,
         6069,
         11000,
         24103,
         9913,
         16367,
         692,
         9942,
         10173,
         2759,
         29095,
         18835,
         400547
      ],
      "original_title": "Midnight in the Garden of Good and Evil",
      "runtime": 155,
      "poster_path": "/aBnUxDAqULcUasM5cZiMy0970ZU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Malpaso Company",
            "id": 15298,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-11-21",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Clint Eastwood"],
      "runtime": 155,
      "synopsis": null,
      "writers": [
         "John Berendt",
         "John Lee Hancock"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119668/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2ODcyODM3NF5BMl5BanBnXkFtZTcwMzg2OTk0OQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: John Cusack, Kevin Spacey, Jack Thompson | See full cast and crew »"],
      "reviews": [
         "A stylish and haunting film-noir thriller, \"Midnight in the Garden of Good and Evil\" is another lesson in peerless film-making by Clint Eastwood. John Cusack makes one of his most positive performances and skips the usual charming giddiness he is famed for. The storyline never ceases to surprise you and neither do the characters. Spacey's Jim Williams is one of the most fascinating villains ever and Spacey again delivers a perfect performance. More solid work comes from Allison Eastwood, Jude Law and Lady Chablis, the humorous treat of the film. The most mystic and chilling scene is in the middle of the film, when Williams and Kelso visit Minerva, the scene which gives the movie its name. The climax is also incredibly well written and directed, one of the most suspenseful ever. A bravura work from a man who has long since learned how to make perfect film noirs. A highly enjoyable and recommendable movie.10/10",
         "Like \"Citizen Kane\" and \"The Man Who Shot Liberty Valance,\" \"Midnight At The Garden Of Good And Evil\" is a movie about a writer trying to get a simple story, and finding himself with more than he bargained for. John Cusack is the writer, John Kelso, and his explorations of Savannah, Georgia offer some mystery and fun, though the result will be flat for those who already know the story from reading the best-selling book. \"Better to be on the edge of a party, don't you think?\" a young woman named Mandy (Alison Eastwood) asks Kelso at one point. It's a pertinent question. Alison's father Clint and screenwriter John Lee Hancock try to accomplish much the same effect here, dancing at the perimeters of things, showing conversations where words can not be discerned. Many times we see Kelso looking in on some social function from the outside, like at a cotillion for black debutantes or bridge games at the Married Women's Club, a bit adrift but interested in the games people play. At the same time, Kelso becomes quite close to one Savannah resident, Joe Williams, an art dealer whose homosexuality is an open secret until he comes out of the closet by shooting his boy-toy. Kevin Spacey's performance as Williams is rich and fun, his accent not note-perfect but well-tailored to his polished delivery. The way he lazily smokes his cigars as he moves through a party, dabbles in lowcountry voodoo with Jesuitical zeal, or even eats gumbo in prison is a study in an actor's sense of the wholeness of the role. While many book fans savage this with the comment \"It's not what I read in the book,\" I take it in stride. John Berendt didn't carry this thing down from Mt. Sinai either \u0096 most notably by presenting the killing as something that happens after his arrival rather than before he played with the facts in the book. So when the film gives us a romance between Berendt's stand-in Kelso and Mandy or invents connections between the Williams story and the others in the book so the secondary characters can appear in the main story, it kind of works in an offbeat way. What doesn't work is the pace. The film goes on for over two and a half hours, and feels longer. Eastwood obviously approached this project with enthusiasm for the book, and especially for the music of Johnny Mercer which is prominently featured. But the comedy feels labored, the depiction of Williams' trial too unshaded in its sympathy for the defendant, and many of the performances, like that of Jude Law as the dead loverboy, seem underbaked. Two good performances are delivered by people who had real-life roles in the book. Sonny Seiler, who defended Williams, plays the judge in the trial and gets to tell himself when he's out of order. The Lady Chablis, who I never cared for much in the book, has an engaging vulnerability on screen. Even when the story screeches off track by focusing on her character, she makes the logic gaps less bothersome with her playfulness. I even liked Alison Eastwood, who does a good accent, looks the part of Mandy, and makes the film's most egregious detour from the book seem less of a violation. Not a stunner, but her languid delivery and drooping eyelids are very sensual in the everyday manner she presents us with, a half-promise of something good reaching out to you in the dark. In that way, she recreates the spirit of the book quite wonderfully. Pity her father didn't always do the same, but this is an entertaining film more often than not.",
         "I am at a loss as to how anyone can not like this film. It was pure genius. Cusack plays a somewhat stereotypical character (which was very appropriate for the movie, it created a perfect contrast between the cultures of New York and Savannah). Kevin Spacey was nothing short of amazing, better than in The Usual Suspects, and almost as good as in American Beauty. Lady Chablis was also excellent. I especially enjoyed watching Lady Chablis and Jim Kelso's relationship mature and change throughout the film. I have seen the movie numerous times and plan to see it again. Though, it is not for those who wish to go to a movie to be simply entertained. Highly recommended.... 10/10",
         "Like every film Clint Eastwood makes, \"Midnight in the Garden of Good and Evil\" is fascinated by the mystery of masculinity: what it means to be a man, and what you have to do to be the kind of man you think you need to be -- whether that's a father, a member of a cultural group, or the ideal man in a certain social situation. Two highly-acclaimed recent Eastwood films -- \"Mystic River\" and \"Million-Dollar Baby\" -- mildly disappointed me by sinking into oversimplification and predictability. Possibly Eastwood's directing hand is more interesting when less \"self-assured,\" because 1997's \"Midnight in the Garden of Good and Evil\" follows these questions down less well-defined, and thus less predictable, paths. Maintaining a scrupulously neutral eye, the film recounts a complex tale of murder, involving characters who are recognizable types on the surface but carry deep difference underneath. It unfurls a slow, rich, and troubling narrative which answers the mysteries of its crime premise even as it opens much more difficult questions about the very things that murder stories are supposed to make simple: innocence, guilt, motivations, affection, and its characters' so-called morality. Thanks in large part to a literally mesmerizing performance by Kevin Spacey (I'm riveted every time he appears on screen) and a well- balanced turn by John Cusack as the sympathetic investigating reporter, who charms us even as he maintains a total and focused receptivity to new information and strange events, the movie fills its two and a half hours with a slow-paced and carefully balanced story that brings us into the suffocating green world of Southern Gothic, with its all its mannered refinements, thick silences and passionate secrets. There's something in this film that would have pleased Tennessee Williams or Truman Capote, those cool-eyed investigators of the closeted South. John Berendt's nuanced book, Spacey's restrained, smoldering performance and Eastwood's lucidly hands-off direction have created a strange, slow gem of a film. It's not a gem appreciated by everyone, but two years before Spacey's turn in \"American Beauty\" struck a chord that resonated with the wider public, \"Midnight in the Garden\" asks similar questions in a context that is, at the same time, more precise, more exotic, and equally American.",
         "I haven't read the book. Might have hated the film if I had. But I liked it. I did read some reviews before viewing the film, and I was prepared to dislike it. A lot of the criticism has some validity. The movie isn't really a linear type of murder mystery. It's partly that and partly a quirky travelogue of Savannah. The Lady Chablis character gets way too much screen time, apparently because Eastwood thinks that it will entertain us. It does, but only to a point. However, this is a different sort of movie, so I understand why Eastwood includes so much of Chablis, and the voodoo woman, and the fly guy. Also, John Cusack plays it with the same dead-fish expressionlessness that he brings to most of his roles. This isn't really bad, it's just that he's always the same. I had never seen one of Kevin Spacey's films before, and I am impressed at how he really nailed the role. I thought his performance made this film. A word or two about the accents. Most non-Southern actors really murder Southern accents. I'm from Texas, not the Georgia coast, but I thought Spacey hit the accent just right all the way through. It was always there, but was never the focus. (Streepian in its apparent effortlessness) Jack Thompson did his accent very well, also, particularly since I understand that he's an Aussie. Some other cast members didn't do well with the Southern accent, like Alison Eastwood. She overdid it. It seemed strained. And oh, yeah, Cusack sounds like an accentless Californian rather than a New Yorker. Overall, I guess I've written a lot more criticism than praise, but that wasn't my intent. This was a good movie. Think of it more as an art-house film rather than a mass-market picture, and you might have more realistic expectations.",
         "Sometimes, the measure of a good garden is the diversity of opinions it attracts: looking back over other writers' comments, one is struck by just how good this one must be. Some see weeds and disarray - a classic hothouse garden gone to seed - yet others perceive an Autumnal garden: garish in its primary colours of Fall yet splendid in its descent into decay. A splash of brilliance before the inevitable passage into death of all living things. Luckily, I read Berendt's book before seeing the film, and realise just how hard Hancock must have worked to translate it to the screen. It is also, in my mind, one of Eastwood's best (if not THE best) directorial outings. The casting is superb. Not a 'clunker' among them. As an evocation of the decline of the contemporary South, I would offer that it is nonpareil: lazy, sleazy, desperate at times, yet possessed of a dignity that is long past in the rest-of-the-world. Whilst Savannah is not the Big Easy, as portrayed it has much of its charm, artifice, and implied danger. And there's the rub when becoming engrossed in this garden of smoke and mirrors. It appeals to those of us who can only be outsiders looking in. The inclusion in the screenplay of Kelsoe's love interest (not present in the book) was, for me, an acceptable complication. It juxtaposed the \"Yankee's\" at times ingenuous fascination with all around him. His apparent ambivalence toward the sexuality aimed at him by the central characters (Jim and the Lady Chablis are obviously enamoured of him) becomes anchored in his desire to be part of their world but on his terms. Thus the inclusion of a heterosexual relationship which leads to his decision to stay. I would offer, however, that one of the most telling scenes (at least in exploration of Kelsoe's character) is his obvious pride in the 'overpaint' - given to him by Jim - hanging on his newly-acquired wall as he tells his 'love-interest' that he is 'here to stay' for at least six months as he writes his book. It is not the presented landscape itself which intrigues us: it is the possibility that something more valuable resides beneath. A mystery left unsolved. Just like Savannah, really. An excellent film. Enjoy it for itself.",
         "It is 4 years since I first saw this movie (and commented on it before reading the book on which it is based). Having since read the book twice, I thought it time to look at the movie again. I can now see why some of those who had read the book are so dismissive of the movie. I still think it is an interesting, well cast film - but it could have been done better - and that is a pity. There is of course no reason to expect a movie to be an exact replica of a book, but when it is such an excellent book it is a pity that Eastwood chose to alter things unnecessarily. Too much of his daughter (charming though she may be), too much Lady Chablis (fascinating ditto). These additions took up time and space where the actual story could have been fleshed out more. In spite of these minor quibbles, I still think it is an interesting story - and to fans of the book I say - accept it for what it is - it is a fascinating film, entertaining and well worth watching.",
         "A clever but flawed example of the black art of adapting a very literary work to film. The plot has been streamlined (one trial instead of four), some of the characters given expanded roles, others dropped out, a fictitious affair inserted. However the essentially journalistic narrative remains, and the theme remains \u0096 outsider tries to understand an inward-looking society bent on preserving their environment and way of life and resisting outside influence. Healthy decadence, if there is such a thing. The Jim Williams case is really just a framework for author Berendt's enquiry into what makes Savannah tick, and the film tends to ignore that, concentrating on the trial(s) and Jim's relationship with the author figure, who is given a much bigger role than in the book. Hence some of the color bits, Minerva the voodoo lady, Joe the feckless party giver, even the Lady Chablis (played by herself) seemed kind of irrelevant. Some nice acting was evident. Kevin Spacey as Jim Williams in a silver waistcoat and bushy moustache looked a bit like a riverboat gambler, but he held our attention, if not our sympathy. Jack Thompson as his lawyer showed his courtroom manner has come a long way since 'Breaker Morant' and almost had me convinced he really was a good ole boy from the American South instead of a Melbourne bred actor. The bulldog was good too. Savannah is truly a cute town and deserves a visit; the film does not really do it justice. It's done the tourist industry there some good though. On a recent visit your correspondent was unable to get into Clary's, a fairly ordinary diner made famous by the book and the film, for lunch (they don't do dinner) due to the busloads of tourists that had descended on it. Never mind, there's better food elsewhere - try the deli on Drayton \u0096 Parker's, I think.",
         "I got the chance to view this recently on video and to me it left me in total awe. This is Clint Eastwood's best movie to date in a line of good movies that include his directorial debut from \"Play Misty For Me\" to his brandish westerns like \"The Outlaw Josey Wales\" to his Oscar winning \"Unforgiven\",to even his soft hearted material ranging from his military drama \"Heartbreak Ridge\" to the emotional \"The Bridges of Madison County\". But here \"Midnight In The Garden Of Good and Evil\" is astounding entertainment and it features actor Kevin Spacey in one of his most gifted role of his career. The movie focuses on the happenings of Savannah,Georgia where the city of hot nights and cold-blooded murder all rolled into one. Its a rarely do movies of this magnitude show so much of true southern city they are depicting and basically get it right. It also shows in the first half of the movie the that way these houses and the designs which are depicted is incredible(yes,Mr. Eastwood has a eye for good art)and they way details are properly set,especially with the Christmas party dinner scene is perfect as well as the overall architecture of some of the most lavish houses ever bulit(if you ever go down to Savannah you must see this to believe it and its worth the trip) as well as the proper way to show courtesy of upright manners in front of your guests where hospitality is always first rate. But as far as the movie is concern(which is based on John Berendt's novel of the same title)what you see is depicted throughout the movie and the overall beauty of the city of Savannah. The people are so loving and caring that it makes you not only leave,but stay here more to see what happens next. I got the chance to read the book on this,but I take the book over the movie as a tossup,but you will not be disappointed. A grand style of entertainment at its finest hour. Thank you so much Kevin Spacey and director Clint Eastwood.",
         "This is undoubtedly one of the worst films I have ever seen! It's also one of very few that I actually walked out on before it ended. Very disappointing considering the cast and director, but the story is long and slow and the film seemed like it would never end. DO NOT WASTE YOUR MONEY on this piece of crap!"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Malpaso Productions",
         "Silver Pictures",
         "Warner Bros."
      ],
      "summaries": [
         "This panoramic tale of Savannah's eccentricities focuses on a murder and the subsequent trial of Jim Williams: self made man, art collector, antiques dealer, bon vivant and semi-closeted homosexual. John Kelso a magazine reporter finds himself in Savannah amid the beautiful architecture and odd doings to write a feature on one of William's famous Christmas parties. He is intrigued by Williams from the start, but his curiosity is piqued when he meets Jim's violent, young and sexy lover, Billy. Later that night, Billy is dead, and Kelso stays on to cover the murder trial. Along the way he encounters the irrepressible Lady Chablis, a drag queen commedienne, Sonny Seiler, lawyer to Williams, whose famous dog UGA is the official mascot of the Georgia Bulldogs, an odd man who keeps flies attached to mini leashes on his lapels and threatens daily to poison the water supply, the Married Ladies Card Club, and Minerva, a spiritualist. Between being Jim's buddy, cuddling up to a torch singer, meeting every eccentric in Savannah, participating in midnight graveyard rituals and helping solve the mysteries surrounding Billy's murder, Kelso has his hands full.",
         "A visiting city reporter's assignment suddenly revolves around the murder trial of a local millionaire, whom he befriends."
      ],
      "budget": 30000000
   },
   "movielensId": 1711,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-11-21",
      "dvdReleaseDate": "1998-06-02",
      "directors": ["Clint Eastwood"],
      "runtime": 155,
      "movieId": 1711,
      "title": "Midnight in the Garden of Good and Evil",
      "mpaa": "R",
      "actors": [
         "John Cusack",
         "Kevin Spacey",
         "Jude Law",
         "Alison Eastwood",
         "Jack Thompson",
         "Irma P. Hall",
         "Paul Hipp",
         "Lady Chablis",
         "Kim Hunter",
         "Geoffrey Lewis",
         "Leon Rippy",
         "Gary Anthony Williams",
         "Michael O'Hagan",
         "Bob Gunton",
         "Patrika Darbo",
         "Anne Haney",
         "Charles Black"
      ],
      "imdbMovieId": "0119668",
      "originalTitle": "Midnight in the Garden of Good and Evil",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "bUvm4Yd4ebA",
         "2OX_SjGrS_Q"
      ],
      "plotSummary": "A visiting city reporter's assignment suddenly revolves around the murder trial of a local millionaire, whom he befriends.",
      "tmdbMovieId": 8197,
      "avgRating": 3.25901,
      "releaseYear": "1997",
      "numRatings": 5218,
      "posterPath": "/aBnUxDAqULcUasM5cZiMy0970ZU.jpg"
   }
}