{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117167",
      "video": false,
      "title": "Never Met Picasso",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 1,
               "credit_id": "5a84f1cfc3a3686316018779",
               "name": "Alexis Arquette",
               "profile_path": "/jNRBwGKXOZFWLI2ceff1sMUdxcE.jpg",
               "id": 19578,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "5a84f1df0e0a2653b301748a",
               "name": "Georgia Ragsdale",
               "profile_path": "/xLCjuNr4GR6mmMP4IkYNEqTFa9X.jpg",
               "id": 1203433,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "5a84f1f1925141759301b9bb",
               "name": "Margot Kidder",
               "profile_path": "/98HrmSMx8FhMCeoKEODs3OSGYyv.jpg",
               "id": 20011,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "5a84f1f79251410b01015a0f",
               "name": "Don McKellar",
               "profile_path": "/cV1nEafG1CqIdnrce5pVw2hcaep.jpg",
               "id": 20173,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "5a84f20dc3a3686207016e69",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "5a84f218c3a3686207016e76",
               "name": "Alvin Epstein",
               "profile_path": "/3JRnkuxqYgO7rc9sHUJTWgmxKAI.jpg",
               "id": 170898,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "5a84f2250e0a26535a01742c",
               "name": "Omewenne",
               "profile_path": null,
               "id": 1978284,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "5a84f0efc3a36863390188c0",
            "name": "Stephen Kijak",
            "profile_path": null,
            "id": 107168,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.00159,
      "production_countries": [],
      "id": 279698,
      "vote_count": 0,
      "budget": 0,
      "overview": "This gay-oriented drama centers on the life and exploits of Andrew, an aspiring painter. Still living at home with his mother Genna, an avant garde actress, constantly rejected by art schools, and without a lover, Andrew decides to enter a contest in hopes of winning a six month stay in Kenya. Though things aren't great for Andrew, neither are they wonderful for his lesbian friend Lucy who constantly bickers with her lover Ingrid. Lucy complicates Andrew's life when she introduces him to the suspicious-looking, enigmatic Jerry.",
      "similar": [],
      "original_title": "Never Met Picasso",
      "runtime": null,
      "poster_path": "/n78KvNbujqCzP6ZOTTpkZITnOD8.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stephen Kijak"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Stephen Kijak"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117167/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODgwMDYwMjUzOF5BMl5BanBnXkFtZTcwODM1MDQyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Alexis Arquette, Georgia Ragsdale, Margot Kidder | See full cast and crew »"],
      "reviews": [
         "NEVER MET PICASSO owes its name to its main character(brought to life well by Alexis Arquette), a struggling Boston painter. However, its essential plot seems to be the description of a dysfunctional family of sexually-confused artists. How original! Composed of the young gay painter(Arquette), his unbalanced mother (Margot Kidder: art imitating life?) who, among other quirks, discovers her lesbian side in her late 40's), this family also features the gay uncle, the distant father and a menagerie of \"in-laws\" and friends. These encompass artsy and psychic lesbians, dead lovers, black screaming queen artists, and even an S&M queen who is a history professor by day. If this collage of 90's stereotypes interest you more than an original, coherent plot, then NEVER MET PICASSO is definitely for you.",
         "Having gay characters does not make for a gay film and having interesting characters does not always make for an interesting film. Andrew Magnus (Alexis Arquette) is the last of a Boston arts family. Alfred, his aging uncle is a painter and Genna, his mother, is an avant-garde theatre performer. All three are gay but that seems to have no real point in the story. Andrew is blocked in his painting and without inspiration (not unlike this film) The characters have their interesting aspects but we don't learn enough about any of them to really care about them. There was a young man David, that both mother and uncle cared for but he died in Viet Nam, we hear very little about him. Instead we see and hear about the gallery crowd and the flamboyant artists that populate the Magnus' lives and all of the openings, exhibits and parties that occupy their time. I may be a philistine and may be missing the higher meanings here, but I think it's just that there are no higher meanings here. The film stopped short of greatness and got tangled up with flash and form over any real substance.",
         "I happened to stumble upon this oddly perfect little flick at a film festival in Boston. While it's essentially a gay film, I believe that, as a straight guy, I was as entertained by it as anyone else. It's laugh-out-loud funny at times and quite tender and sad at others. Alexis Arquette's performance is truly outstanding as is the Uncle's. And Kijak's directing is flawless. It's one of those films that you still find yourself talking about months later. Run out and rent it.",
         "An indie art-house masterpiece - lush and charming, wry and clever, like John Waters does Antonioni or something. A little low on plot, but makes up for it in ideas - very tender. The uncle is incredible, in fact the whole cast is great. I love Alexis Arquette, even his crazy appearance on reality TV, and he is very good here (and he is not in drag which is a twist!) It's probably not for everyone but I've been thinking about it for days and I'm sure it will stay with me for a long time. So refreshing to see a gay film like this. It's not just a \"gay\" film, but really artistic and human! There is no one coming-out. There are no tragic deaths. It it not camp (well, maybe a little...) And, hello, Margot Kidder! I think this film is a little gem. I had never heard of it before so I'm glad I stumbled upon it on Netflix.",
         "It played at a art house in Brookline MA for about a week or two. I only saw it because I had seen Georgia Ragsdale (a very funny lesbian comedian) twice in Provincetown and I had a casual acquaintance with Eddie Rutkowski. The plot was kind of vague and there was really no resolution but it DID catch the art scene in Boston perfectly back in 1996. It was full of local characters and was shot on location. For a very low budget feature it was well-done and Arquette and Kidder were excellent in small roles. I don't think this ever got a wide release but it might be available on DVD. If you have an interest in Boston back in the 1990s or are a gay man you might like this one.",
         "while watching this film, i was reminded that it will be a great era when amateur film critics learn to quit talking about films, any film, in terms of \"plot\", as if this Elizabethan conception of dramatic action had the same definition as the words \"value\" and \"interest\", as in 'if the film only had more of it, or a better quality one, it would be better'. another term came to mind during the viewing, one that a friend of mine said some time ago, which probably exists as a technical term somewhere in the arcana of film theory: \"screen memory\". he thought something had happen to him (which he was recalling to me) but it was something he'd seen in a movie. \"oh i'm sorry, that was a screen memory\". this film, written by stephen kijak when he was 25, seems to be more focused with its affect on the viewer's memories than a (supposedly) rational sequence of scenes that end well. i found the experience of watching this film like being part of an interesting person's life: fascinating in every bit of its messiness. in the film equal weight is given to the excellent cast, production, sets, and temporal structure, in order to keep it out of the realm of plots-and-action and into the realm of happening-to-you. like life, the film has boring moments. it does not shirk from them, of course, because it embraces them as necessary to the overall effect. the moment where andrew brings his uncle soup, there is a long silence as he proceeds to eat several spoonfuls. not dramatic spoonfuls, but real tastes, struggling to taste against a very hot stew. the tension between the characters is detoured through the action of getting the tasting of the chowder out of the way, annoyingly quotidian moments that interfere with the advice andrew wants to hear. (yes, there are moments like these that do not work, and they are obvious. i don't recall them.) however, the film isn't solely about andrew and his uncle. it's about all of the six lead characters, who all seem to be given equal attention. the film works by accumulating moments from each of the different combinations of characters, sets, moments, artworks. it doesn't work right away; its when a critical mass of the collage (i know it might be called montage) is in place that the emotional effects happen. [plot spoiler next paragraph] for example, i suddenly cried when andrew is at the hospital, the bed empty, his uncle dead, suddenly, off-camera, without notice, discovered accidentally in the hospital, with no corpse to look at. specifically at the moment andrew kneels at his uncle's easel, and later when he finds his photographs. until that point, i was able to observe the film in a somewhat detached, yet interested, state. after that, there were still highs and lows of engagement, yet i was beginning to become attuned to the amplitude, and rode the wave to the end. the sudden emotional depth is abetted by superb performances from talented actors. this type of filmmaking can be carried to new venues, beyond the intertwined family theme. i'd encourage mr. kijak to continue with these ideas, and look forward to the next works. i've no doubt that if the director chooses to continue this is the kind of filmmaking, it will become highly refined and brilliant.",
         "Never Met Picasso, written & directed by Stephen Kijak is a light comedy/avante garde type independent movie that deliver's a story about dysfunctional friend's and family centred around the art's/theatre community. Andy(Alexis Arquette) is a 30yr old painter without direction and languishing his time away at numerous parties and hanging-out with best-pal Lucy(Georgia Ragsdale)a neurotic sculptor. Entering a competition to win a trip to Africa for much needed inspiration. Other characters are Actress/mother Genna Magnus(Margot Kidder) performing in a dreadful stage-play The Naked Tenor(Hilarious, because it's sooo awful)and Uncle Alfred(Alvin Epstein) whom share's a little closet family secret with Andy's mother Genna. Other weird and wonderful characters round out the relationship's romantic or otherwise such as Lucy's girlfriend Ingrid whom channels the spirits of female surrealist's and the mercurial art/historian scholar Jerry(Don McKellar) whom pursue's Andy. In my opinon this is an entertaining well made film, however it isn't strong on plot or real depth. Performances are all excellent by cast and so too the work done by Mr.Kijak. It's a comedy and an interesting one at that but not of interest to a mass-public but for open-minded viewer's a worthy choice for general viewing. I own the video and have still enjoyed it after a few repeated viewing's. Recommended!",
         "I rented this movie a couple of weeks ago. This is one shallow and terribly undeveloped film. I agree with the other reviewer -- there is no substance to any of the characters whatsoever, and the plot is very dull. I don't know how this film got funding --- it's sub-quality freshman filmmaking."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Mighty Reel Productions",
         "Scout Productions"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 1714,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": "2002-08-29",
      "directors": ["Stephen Kijak"],
      "runtime": 0,
      "movieId": 1714,
      "title": "Never Met Picasso",
      "mpaa": "",
      "actors": [
         "Alexis Arquette",
         "Georgia Ragsdale",
         "Margot Kidder",
         "Don McKellar",
         "Keith David",
         "Alvin Epstein",
         "Omewenne"
      ],
      "imdbMovieId": "0117167",
      "originalTitle": "Never Met Picasso",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "This gay-oriented drama centers on the life and exploits of Andrew, an aspiring painter. Still living at home with his mother Genna, an avant garde actress, constantly rejected by art schools, and without a lover, Andrew decides to enter a contest in hopes of winning a six month stay in Kenya. Though things aren't great for Andrew, neither are they wonderful for his lesbian friend Lucy who constantly bickers with her lover Ingrid. Lucy complicates Andrew's life when she introduces him to the suspicious-looking, enigmatic Jerry.",
      "tmdbMovieId": 279698,
      "avgRating": 2.41892,
      "releaseYear": "1996",
      "numRatings": 37,
      "posterPath": "/n78KvNbujqCzP6ZOTTpkZITnOD8.jpg"
   }
}