{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0119819",
      "video": false,
      "title": "Office Killer",
      "recommendations": [
         202171,
         47044,
         108382,
         85224,
         277687,
         100274,
         183661
      ],
      "backdrop_path": "/yi0KRCjwm14fYVPibJfg6jFpH2x.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dorine Douglas",
               "gender": 1,
               "credit_id": "52fe47a3c3a36847f8140861",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kim Poole",
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f8140865",
               "name": "Molly Ringwald",
               "profile_path": "/y8RQwpSQaRfWK70fR9LUT8Fql64.jpg",
               "id": 21625,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Norah Reed",
               "gender": 1,
               "credit_id": "52fe47a3c3a36847f8140869",
               "name": "Jeanne Tripplehorn",
               "profile_path": "/pZcw8RXsRSO9WXHOrQqentISWYv.jpg",
               "id": 10478,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Virginia Wingate",
               "gender": 1,
               "credit_id": "534cf0b4c3a368608f000931",
               "name": "Barbara Sukowa",
               "profile_path": "/mGKhBMI9P2teTXC1v9HgS3WtL73.jpg",
               "id": 23378,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Landau",
               "gender": 0,
               "credit_id": "534cf0bfc3a36860830009b2",
               "name": "Mike Hodges",
               "profile_path": "/35mcdpwimATfaeEGpLhR0iVJ2Ep.jpg",
               "id": 17281,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Carlotta Douglas",
               "gender": 1,
               "credit_id": "53938f1d0e0a266dca002a63",
               "name": "Alice Drummond",
               "profile_path": "/f1O8suDhVloKdPvhyltj017SPTo.jpg",
               "id": 17488,
               "order": 5
            },
            {
               "cast_id": 25,
               "character": "Daniel Birch",
               "gender": 2,
               "credit_id": "571b94ca9251414ef4004dcb",
               "name": "Michael Imperioli",
               "profile_path": "/3AupsGJOUaAiXXaq626wzKaLiZ8.jpg",
               "id": 11486,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f814085d",
               "name": "Cindy Sherman",
               "profile_path": null,
               "id": 1058100,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "571b936492514121a00034ad",
               "name": "Cindy Sherman",
               "profile_path": null,
               "id": 1058100,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "571b936fc3a368525f005caf",
               "name": "Elise MacAdam",
               "profile_path": null,
               "id": 1609619,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "571b937a92514135ff00159c",
               "name": "Tom Kalin",
               "profile_path": "/gLlD5BnIDR3tjg2fthvZXEnRYhs.jpg",
               "id": 66983,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "571b9387c3a368525f005cc1",
               "name": "Todd Haynes",
               "profile_path": "/wBDazO2j49uoquoHTEDxcniyGGC.jpg",
               "id": 16863,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "571b93a2c3a368652400122f",
               "name": "Russell Lee Fine",
               "profile_path": null,
               "id": 68219,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "571b93acc3a368195b003157",
               "name": "Merril Stern",
               "profile_path": null,
               "id": 1332475,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "571b93bac3a36823cb0016e6",
               "name": "Kevin Thompson",
               "profile_path": null,
               "id": 19755,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "571b93cec3a36864e00028dc",
               "name": "Ford Wheeler",
               "profile_path": null,
               "id": 20569,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "571b93e2c3a368525f005cd6",
               "name": "Christine Vachon",
               "profile_path": "/fCSCpC4pxQ7xW6nNJt5klv2cowM.jpg",
               "id": 2862,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "571b93ed925141715d004901",
               "name": "Pamela Koffler",
               "profile_path": null,
               "id": 57427,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "571b93fec3a368525f005cdd",
               "name": "Tom Carouso",
               "profile_path": null,
               "id": 1609621,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "571b942ac3a36864e00028e7",
               "name": "James Schamus",
               "profile_path": "/9E0gGd0rhOZyMnBAeIqFfCAPqzn.jpg",
               "id": 1617,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "571b943c925141115f0056e7",
               "name": "Ted Hope",
               "profile_path": null,
               "id": 5952,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "571b9450c3a3686524001246",
               "name": "John Hart",
               "profile_path": null,
               "id": 2860,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "571b945ec3a36823cb001700",
               "name": "Amy Beth Silver",
               "profile_path": null,
               "id": 65916,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "571b9489925141343c00161d",
               "name": "Todd Thomas",
               "profile_path": null,
               "id": 234850,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5a40246c0e0a264fb90130e2",
               "name": "Evan Lurie",
               "profile_path": null,
               "id": 1947696,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.614579,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49728,
      "vote_count": 15,
      "budget": 0,
      "overview": "When Dorine Douglas' job as proofreader for Constant Consumer magazine is turned into an at-home position during a downsizing, she doesn't know how to cope. But after accidentally killing one of her co-workers, she discovers that murder can quench the loneliness of her home life, as a macabre office place forms in her basement, populated by dead co-workers.",
      "similar": [
         258480,
         10735,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         634,
         437557,
         242224,
         17130,
         43923,
         11634,
         141,
         297762,
         376867,
         394117,
         370663,
         376660
      ],
      "original_title": "Office Killer",
      "runtime": 82,
      "poster_path": "/8sMISf1fOHTe1WOrXgbLmUAnfJX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Working here can be murder",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cindy Sherman"],
      "runtime": 82,
      "synopsis": "Dorine Douglas (Carol Kane) is a mousey introvert copy editor who has been one of he back-office copy editors for Constant Consumer magazine for 16 years and when she is downsized and set up with a laptop, into a part-time work-at-home employee and is faced with tending more for her invalid mother. When Dorine is called into the office late one night to help demanding writer Gary Michaels (David Thornton) fix his computer she is shocked when he is electrocuted trying to jimmy the wires. To assuage her loneliness Dorine decides to take the dead body home to the basement of the house where she lives with her mom. When chain-smoking publisher Virginia (Barbara Sukowa) commands Dorine to team up with the pushy Kim Poole (Molly Ringwald) to re-write Gary's lead story in time for press, Dorine decides to add to the dead bodies in her basement and Virginia's body joins Gary's. In the meantime co-worker Norah Reed (Jeanne Tripplehorn) has taken a liking to Dorine actually befriending her but Dorine has already decided she needs more friends at home to join the ever-growing collection of co-workers and strangers who have crossed her path. When computer tech Daniel (Michael Imperioli) gets suspicious over the disappearance of the work force and investigates things come to a head.",
      "writers": [
         "Tom Kalin",
         "Elise MacAdam"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119819/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzgzMjgzMTg3M15BMl5BanBnXkFtZTcwNTAwMDEyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Carol Kane, Molly Ringwald, Jeanne Tripplehorn | See full cast and crew »"],
      "reviews": [
         "The first question that would come to mind would be whether Carol Kane could play a psycho successfully. And after seeing this film, I would have to say I still don't know because the very tame screenplay didn't allow her to be a well developed psychotic, nor did it allow any other sort of development for any other aspect of this film. The storyline here is very typical. It involves Carol Kane (with very odd penciled in eyebrows) as an awkwardly mousy, hardworking magazine editor in a drab and depressing looking office building where she gets picked on daily. Then, without any time wasted, the inevitable psycho switch gets flipped and she starts killing off her coworkers. I know that may sound to most like your typical fun slasher, but in fact, it can't even be considered a slasher. Actually, I really don't know what genre to categorize this film in because it dips it's toes in a couple different sub-genres without ever fully concentrating on any one area, therein lying the problem. The resulting film just doesn't quite work. At the start, it seemed to be heading into satire territory with office politics and such, but quickly falls flat because of a major lack of humor. As it went on, it then seemed I was in for a slasher, but all of the murders take place off screen, giving us no chase sequences, creative deaths or gore. Then I expected it to take a turn into suspense, but was left with no tension or any sort of character development whatsoever, so I never cared for anyone or anything enough to ever get involved in the storyline. The writers just didn't seem to know what they really wanted, which kind of left the final product in limbo. And it's pretty disappointing because the photographer turned director, Cindy Sherman, seemed to have talent and would have benefited greatly if it were a straight up thriller. So what were we meant to feel during this film? It wasn't smart, funny, thrilling or even bloody. Were we supposed to hate and fear Kane? Or were we supposed to root for her? The whole film felt just as awkward as she looked and felt just as drab and boring as the office building looked, which leaves us with no reason to ever want to visit. I would compare this to later films, such as Love Object and the Willard remake, both of which used the same plot techniques, yet executed them in a much more entertaining fashion. Office Killer isn't a terrible film. I give the director and cast credit for trying. But it's just so lifeless that I can't recommend you wasting your time with it.",
         "I was impressed to see this film had so many bad reviews, both from critics and viewers. I saw it and I actually think it is a very good inside joke, it is only necessary to get the \"spirit\" of it. Director Cindy Sherman uses gore and some very curious camera positions to make you a little bit scary and also laugh once or twice (not out-loud, though). The performances from Carol Kane (totally crazy) and Molly Ringwald (in a very against-the-type turn) are very good. The supporting cast (German actress Barbara Sukowa and The Soprano's Michael Imperioli) is also interesting. I think this film makes a perfect midnight video snack with some friends.",
         "This is a great horror/comedy.Its got a great plot,a great cast who gives great performances including Molly Ringwald(Teaching Mrs.Tingle,The Breakfast Club),Carol Kane(Jawbreaker,Adams Family Values)& Jeanne Tripplehorn(The Firm,Waterworld).This Movie is funny and a little scary if you watch it in the dark.See this Movie!",
         "Don't ever fool around with Dorine Douglas! She will make sure you will pay for whatever you do to her! \"Office Killer\" is a film, judging from most comments submitted to this forum, that deserved better. Cindy Sherman, the director, shows she can deliver a good movie. The film was written by Ms. Sherman and it appears Todd Haynes, a good director himself, helped with the dialog, although he is uncredited. We don't understand, at the beginning, what is Dorine's motivation for doing what she does, but the key to comprehending what's wrong with her is revealed in flashbacks that shows her as a teen ager when some traumatic events occurred involving her parents. Dorine has been dealt a bad blow from life and her reactions, although extreme, seem to be typical of someone that has been deeply scarred. The film works because of the wonderful Carol Kane who does some of the best work of her career. Ms. Kane transforms herself into this weird Dorine, who is the butt of all jokes at the magazine where she works. What triggers her spiral unraveling is the downsizing the company is going through that will render her a part timer, losing, no doubt, a good deal of her earnings. The supporting cast is up to task under Ms. Sherman's direction. Molly Ringwald, Jeanne Tripplehorn, Barbara Sukowa, Michael Imperioli, David Thornton and Alice Drummond, among others, respond well to the director's instructions. One wishes good luck to Ms. Sherman with future films because she is not afraid, to show it all for the viewer's enjoyment.",
         "In the mid-90's, there was this weird trend where 80's New York art stars were all given the chance to direct feature films. The less-than-impressive results: Robert Longo's \"Johnny Mnemonic,\" David Salle's \"Search and Destroy,\" Julian Schnabel's \"Basquiat\" and finally Cindy Sherman's \"Office Killer.\" That only Schnabel moved on to direct a second feature says a lot about these poor directorial choices. Surprise - just because you can paint a picture or take a photograph doesn't mean you know how to make a movie. That said, \"Office Killer\" has a unique look to it: Sherman's photographic eye makes for some nice creepy compositions, even if her philosophy about using a camera cinematically is of the bolt-it-to-the-ground-and-maybe-pan-a-little school. And she works well with cinematographer Russell Fine, though the whole film is shot through a murky lens that had this viewer crying out for the occasional bright exterior just to add a little contrast. So what went wrong with \"Office Killer\"? Well, pretty much what you'd predict would go wrong with a photographer director who had never made a film before: uneven pacing; more attention paid to the setup of a shot than to what's going on in it; a lack of tension; and a cast who, with the exception of the ever-willing Carol Kane, don't seem to know what to do. Aware that they're working for a famous photographer, they quietly obey, even while Sherman clearly has little experience in working with actors. Michael Imperioli and Jeanne Tripplehorn have been far better elsewhere, Barbara Sukowa is flat-out bad, and Molly Ringwald is her usual depthless self. The script is also somewhat leaden, given its dark comic potential. \"Office Killer\" is still a curiosity, interesting mainly for aficionados of Cindy Sherman's work (and you've got to admire those cool opening credits), though horror fans who enjoyed the better-received \"May\" (which I personally didn't care for) might like this movie's look and mood. As for me, I couldn't shake off the feeling that this is the product of a bunch of chuckling New York hipsters who thought they were doing something \"postmodern\" and \"ironic\" but only churned out something uninspired and limp... albeit artsy.",
         "I remembering seeing this in my local video shop and well didn't think much, but I ended up picking this up anyway, kinda by accident and when I got round to watching this, well it wasn't bad, not amazing or brilliant, and not terrible, but somewhere in the middle. I think that this is the only slasher with an office setting, which is a shame as it could be quite interesting. To my surprise this movie has quite a few familiar faces such as Carol Kane (When A Stranger Calls), Molly Ringwald (The Breakfast Club) and Jeannie Tripplehorn (Basic Instinct). The plot seemed interesting enough, a mousey employee goes on a killing spree when she's handed her pink slip at the office. The tone is surprisingly light Carol Kane plays her part well as down trodden would be serial killer Doreen, without going over the top and I really enjoyed Molly Ringwald as the bitchy secretary whose sole purpose is to be a total bitch. But some aspects of this movie simply doesn't work, like the comedy element is almost entirely humourless, the characters are plain and boring and didn't feel for them when they got killed. I would have liked this movie to go a lot darker and the killings to be a lot more innovative instead they were just boring and lacked any thrills. All in all not a terrible waste of time, but is kind of forgettable which makes this movie very average, but seeing familiar faces in a movie like this is always fun.",
         "This movie is strangely entertaining, I don't really know why. The story isn't anything special, it's just the old concept where a harmless person becomes murderous for really vague reasons. Our office killer kills someone by accident, and that somehow makes her start killing people on purpose. Very well, I'll take it. So we get to see her murder a bunch of people, just one after the other, and it's well, there is no right adjective. It's not funny because people are dying gory deaths, it's not shocking because well, look at this thing, but it is pretty good. I believe it's kind of a tongue-in-cheek kind of thing, and I believe it's working. Carol Kane also plays her role very well, helped by the screenplay that's gradually making her character meaner. At one point she encounters some girl scouts selling cookies. What follows is just not cool. Well, maybe a little. I'm also really digging this ending. Either way, this is essentially following a formula, but there's still some creativity involved here and there and I appreciate that.",
         "***SPOILERS*** Hard to take black-comedy that grosses itself out long before the ending credits. Mousey and introverted magazine proofreader Dorine Douglas,Carol Kane,is the most effective worker at the office. When it comes down the grapevine that there's going to be a major change-over at the magazine Dorine as well as most of the staff are sent home to do the work and e-mail it in via a new computer system that being installed. Dorine looking harmless and nerdy has a deep seeded and unstable violent streak in her and it's this event that eventually bring it out to the surface with murderous results. Not wanting to be at home with her infirmed mother Chalotta, Alice Drummond,and away from her job and fellow workers at the office slowly turns Dorine's sick thoughts into violent actions and it's a quirk of fate that sets it all into motion. Quietly and secretly killing off her fellow workers at the magazine Dorine hides their bodies in her basement to keep her company. While all this was going on Kim, Molly Ringwald,a writer at the magazine becomes suspicious of Dorine not really knowing whats she doing but that she's somehow trying to get her fired from the job. Dorine besides murdering her fellow workers is greatly disturbed with Kim who, besides being more popular, seems to be on to her and about to uncover what Dorine's really up to. There's also office manager Norah Reed, Jeanne Tripplehorn who Dorine feels has been embezzling the magazine coffers and is responsible for what's been happening there. Trying to murder Kim in a dark and empty stairway Kim gets away but is later fired for accusing \"sweet and innocent\" Dorine of trying to kill her. Norah who befriends Dorine, because her timely article saved the magazine from folding, invites her out to lunch. It's then when she's knocked out in the parking lot by her and brought back to Dorines basement and locked in with all the other stiffs. Kim getting in touch with Norah's boyfriend Danial, Michael Imperioli, to warn him about how unstable Dorine is as well as Norah being alone with her that afternoon. This has has him driving to the Douglas house looking for her only to find that Kim was right about Dorine, dead right, and that he and Norah were soon to pay the price for not listening to her. Strange but interesting and not for everyones tastes \"Office Killer\" takes a while to get off the ground but once it gets going you can't really take your eye off it. Carol Kane as Dorine is her usual quite and passive self at first but slowly goes postal as the pressure of her job, and putting up with her nagging mom, gets to her and drives Dorine over the brink. We also get an insight of Dorine's relationship with both her mom and dad Peter Douglas, Eric Bogosian,in a number of flashback sequences. The flashbacks indicate that she not only was sexually abused by Peter when she was a young girl but was also responsible for the car accident that took his life, and ended up crippling her mom for life. Which may have well been the reason for her distorted mental state as an adult.",
         "This movie is about a woman who is kind of messed up,but at the same time smart enough to manipulate.She kills people in her working place and puts their dead bodies into her basement and treats them as her friends.Her father used to sexually abuse her and her thinking isn't quite normal...If she is done with one place,she moves on,performing as an helpless old lady,who is very fond of her work.The movie is kinda twisted in its own way.It is not a horror movie though,the special effects aren't very good,if there even is any.There are other interesting characters too in the movie.Some loose ends too.I liked the movie cause it was so different from other movies that kind.Also,it showed,that female murderers aren't always supposed to use their good looks to get away with things.",
         "One day, my friends and I wanted to watch a \"thriller\" or something similar, and we rented \"Office Killer\". Big mistake. This movie is anything but scary. It's a bit gory and disgusting, yes, but it's mainly HILARIOUS!, and not in the parts that are supposed to be funny! (The \"I don't care!\" line kept us laughing for days!) you cannot take it seriously for one second! It's the kind of movie you can make fun of. The performances are ok, as well as the direction, but the special FX makes you wanna cry, or laugh, as in my case. What is that blood made of? ***POSSIBLE SPOILER*** And at the end when the house burns down? It looks like they lit a match between the camera and a picture of the house. Come on, you people, I've seen better FX's in class B movies from the 50's.***END SPOILER*** A small budget is not an excuse, it's a matter of imagination, the corpses and guts were ok. Something else: the characters were underdeveloped. You don't care about them one bit. Go and get them!, kill them all! Who cares? To summarize, this movie has: good actors (what happened to you, guys? you have talent!), average performances, average direction, bad special effects and a lame plot: it makes you feel you are watching a parody or something like that. A bad movie that could have been good. My advice is: go and rent Se7en or Scream, never mind if you already saw them. I give it 4 out of 10."
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Good Fear",
         "Good Machine",
         "Kardana-Swinsky Films"
      ],
      "summaries": [
         "When Dorine Douglas' job as proofreader for Constant Consumer magazine is turned into an at-home position during a downsizing, she doesn't know how to cope. But after accidentally killing one of her co-workers, she discovers that murder can quench the loneliness of her home life, as a macabre office place forms in her basement, populated by dead co-workers.",
         "A mousy office worker accidentally kills one of her coworkers, then proceeds to bump off a few others."
      ],
      "budget": 0
   },
   "movielensId": 1715,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Cindy Sherman"],
      "runtime": 82,
      "movieId": 1715,
      "title": "Office Killer",
      "mpaa": "R",
      "actors": [
         "Carol Kane",
         "Molly Ringwald",
         "Jeanne Tripplehorn",
         "Barbara Sukowa",
         "Mike Hodges",
         "Alice Drummond",
         "Michael Imperioli"
      ],
      "imdbMovieId": "0119819",
      "originalTitle": "Office Killer",
      "genres": [
         "Comedy",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Dorine Douglas' job as proofreader for Constant Consumer magazine is turned into an at-home position during a downsizing, she doesn't know how to cope. But after accidentally killing one of her co-workers, she discovers that murder can quench the loneliness of her home life, as a macabre office place forms in her basement, populated by dead co-workers.",
      "tmdbMovieId": 49728,
      "avgRating": 2.56667,
      "releaseYear": "1997",
      "numRatings": 105,
      "posterPath": "/8sMISf1fOHTe1WOrXgbLmUAnfJX.jpg"
   }
}