{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0120521",
      "video": false,
      "title": "The Winter Guest",
      "recommendations": [],
      "backdrop_path": "/cjL96NuObyl8zE7kPMynns8tw56.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frances",
               "gender": 1,
               "credit_id": "52fe44e9c3a368484e03de37",
               "name": "Emma Thompson",
               "profile_path": "/cWTBHN8kLf6yapxiaQD9C6N1uMw.jpg",
               "id": 7056,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elspeth",
               "gender": 1,
               "credit_id": "52fe44e9c3a368484e03de3b",
               "name": "Phyllida Law",
               "profile_path": "/iL3UchWZqdk6RabqDZW9HBcJDwQ.jpg",
               "id": 17787,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lily",
               "gender": 1,
               "credit_id": "52fe44e9c3a368484e03de3f",
               "name": "Sheila Reid",
               "profile_path": null,
               "id": 47404,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Chloe",
               "gender": 1,
               "credit_id": "52fe44e9c3a368484e03de43",
               "name": "Sandra Voe",
               "profile_path": "/pIHuQOcK7FjepXNGM4Ze49yuPAr.jpg",
               "id": 1645,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Nita",
               "gender": 1,
               "credit_id": "52fe44e9c3a368484e03de47",
               "name": "Arlene Cockburn",
               "profile_path": null,
               "id": 94502,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Alex",
               "gender": 2,
               "credit_id": "52fe44e9c3a368484e03de4b",
               "name": "Gary Hollywood",
               "profile_path": null,
               "id": 94503,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tom",
               "gender": 2,
               "credit_id": "52fe44e9c3a368484e03de55",
               "name": "Sean Biggerstaff",
               "profile_path": "/raDTQ6gEo9XZG3O12dGKkGnP0BS.jpg",
               "id": 11179,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Minister",
               "gender": 2,
               "credit_id": "5a4c39009251415a4c0027c7",
               "name": "Tom Watson",
               "profile_path": null,
               "id": 184329,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Man in street (uncredited)",
               "gender": 2,
               "credit_id": "54d3ea069251417ab2001947",
               "name": "Alan Rickman",
               "profile_path": "/zOJgiaztnrnB7TSdGYU3uwpgivl.jpg",
               "id": 4566,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e9c3a368484e03de51",
               "name": "Alan Rickman",
               "profile_path": "/zOJgiaztnrnB7TSdGYU3uwpgivl.jpg",
               "id": 4566,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5a4c3bca0e0a2646c9002f48",
               "name": "Sharman Macdonald",
               "profile_path": null,
               "id": 77457,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a4c3be5c3a36838ed002aa7",
               "name": "Alan Rickman",
               "profile_path": "/zOJgiaztnrnB7TSdGYU3uwpgivl.jpg",
               "id": 4566,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a4c3c109251415a44002cf2",
               "name": "Michael Kamen",
               "profile_path": "/y83bqw1VP1PkuvOhG2XROwc9eXG.jpg",
               "id": 7714,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5a4c3c3bc3a36838e500278f",
               "name": "Seamus McGarvey",
               "profile_path": "/yXEsxEMHlMDemBy8JrHZFAmd3uD.jpg",
               "id": 3285,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5a4c3c490e0a2646d5002e3d",
               "name": "Edward R. Pressman",
               "profile_path": null,
               "id": 32035,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a4c3c5c0e0a2646cc002e8e",
               "name": "Steve Clark-Hall",
               "profile_path": null,
               "id": 63127,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.842456,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 25994,
      "vote_count": 15,
      "budget": 0,
      "overview": "It's winter in a small Scottish village near the sea, and multiple lives intersect in a day. Frances (Emma Thompson) has just lost her husband to an early death, so her mother, Elspeth (Phyllida Law), travels to Frances' house to reconnect with her daughter and grandson, Alex (Gary Hollywood). Meanwhile, old women Chloe (Sandra Voe) and Lily (Sheila Reid) go to a funeral, youngsters Sam (Douglas Murphy) and Tom (Sean Biggerstaff) cut class, and Alex gets a crush on tomboy Nita (Arlene Cockburn).",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "The Winter Guest",
      "runtime": 108,
      "poster_path": "/9t0hyTI7HTB6JSIecUNODrtBvwa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Capitol Films",
         "id": 826,
         "origin_country": ""
      }],
      "release_date": "1997-12-27",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Come In From The Cold",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Rickman"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Josep Llurba",
         "Sharman Macdonald"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120521/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzgzMTY5ODY3M15BMl5BanBnXkFtZTcwNjM1MDEzMQ@@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Phyllida Law, Emma Thompson, Sheila Reid | See full cast and crew »"],
      "reviews": [
         "For his debut as a film director, Alan Rickman has chosen material with which he is very familiar. The Winter Guest is a play he commissioned and directed on the stage before adapting it for the screen in collaboration with playwright Sharman Macdonald. Rickman's familiarity with the material and his considerable experience of working in front of the camera seem to have prepared him well for the making of an exceptional film. Emma Thompson plays Frances, a photographer whose husband has recently died after a long illness, leaving her to raise a teenaged son. Frances and Alex are visited by Elspeth, Frances' mother (played by Thompson's mother, Phyllida Law). Frances cannot find direction in her life and has surrounded herself with the photographic record of her husband and his illness. Elspeth, whose health is failing, cannot rely on the support of a daughter who is unable even to care for herself. Alex is caught between memories of his father and an emotionally absent mother. On the coldest day in memory, the sea around this remote Scottish village, like the lives of Frances and those she loves, has frozen as far as the eye can see. Together, cinematographer Seamus McGarvey and production designer Robin Cameron Don, have created an environment for the story which mirrors the desolate emotional world in which the characters find themselves. The colours are muted to the point that the film sometimes seems to have been shot in black and white, with only tones of grey to give it texture. Some shots are composed with a rigid symmetry, others with a sweeping, aerial freedom. This contrast is timed to echo the themes of dependency between parent and child, the purpose of Death and grieving, and the tension between the emotion and the intellect. Rickman uses cinematic devices like a veteran. His symbols and recurring motifs of water, fire, and even fur, are used to considerable effect throughout. So too, does he use narrative techniques. Two truant school boys, not originally connected with Frances and her mother, are drawn into their story and used as contrast. In their narcissistic search for pleasure and adventure, they depict the base side of life against Frances' cold intellectual remoteness. Nita, a young woman with romantic designs on Alex, is almost able to draw him out with her passionate attitudes and her aggressive, juvenile, almost animalistic desires. Chloe and Lily, two elderly women of the village whom we meet as they wait for a bus to take them to a funeral, demonstrate the constant presence of death and how it can be embraced and normalised. They pore over obituaries and discuss the rituals of death with a mundane, child-like preoccupation. Their closeness further develops the themes of dependency and need. Some may find the restraint of the film difficult to endure. Characters seem ever on the edge of lashing out or breaking down. There is a contained energy at work which is only seldom evident in their actions. This restraint is deliberate. It becomes the central motif in the film's construction. The story is about the frictions which exist between what we need and what we can give, between parent and child, between passion and logic, life and death. The performances are tight and restrained because the characters, in their efforts to understand and adapt, must be also. The Winter Guest is an excellent film. Rickman uses visual, auditory and narrative techniques like a veteran. There are tremendous performances by all; especially Law (Elspeth) , Arlene Cockburn (Nita) and Sean Biggerstaff (Tom). A wonderful capture of atmosphere and production design is enhanced by exemplary cinematography and held together by an intelligent, controlled and dramatically charged script.",
         "Alan Rickman has made a breathtakingly beautiful, haunting movie that sucks you in and won't let you go until long after the credits have finished rolling. The story centers on four couples: a mother and her grieving adult daughter, her son and the girl who takes a fancy to him, two young teenage boys going through all the troubles of puberty, and two old ladies with nothing left to do but attend funerals. Their stories are intervowen, against the backdrop of a gorgeous Scottish winter landscape, which is threatening to take over and swallow them whole. They all have to find their paths in life, realize what's important and what's worth living for. The pace of this movie is very slow, so granted, it's not for everyone. But if you like your movies bittersweet, with reality seeping out of every pore, then this is a film for you.",
         "A beautiful ordinary story. A film made of long silences and unheard incessant talk. Of painful memories and hopeful looks. Of attending funerals as social occasions. Of unexpressible love. Of a beautifully photographed gray Scottish landscape. Emma Thomson and Phyllida Law deliver powerful performances, although the incredibly poetic early teen Sam and Tom almost steal the movie. When you are tired of idiotic movies that look all the same, go see or rent this one. Highly recommended.",
         "When you break it down, life comes in stages; not just stages of development, but stages that can last for a moment, an hour, a day-- or indefinitely. And they come unbidden and unannounced, like an uninvited guest that drops by and burrows into your very soul to ferret out the deepest hopes, dreams, needs and desires which-- consciously or subconsciously-- are a part of everyone who draws a breath upon the planet. In spring, that guest may bring the joy of rebirth and life; in winter, it may bring a reflection of need and confusion, a feeling of loneliness and loss, the desperation of uncertainty or even despair, all born in that seemingly endless moment of searching and seeking out that elusive and intangible something that lies ahead, just out of reach. The winter guest you can neither refuse nor turn away that is desolation of spirit; a visitor to whom we are introduced in `The Winter Guest,' directed by Alan Rickman. It's an especially cold February in a small village on the coast of Scotland; even the ocean is frozen for as far as the eye can see. And in the harsh wind that blows in from that frozen sea, we find Frances (Emma Thompson), a woman who has lost her husband, and visited by the winter of indecision is held fast in her confusion, unable to move on with her life. There to help her find the warmth of spring is Elspeth (Phyllida Law), her mother, who needs Frances as much as Frances needs her, though neither can find a way to break through the chill that has engulfed their souls. Then there is Alex (Gary Hollywood), Frances's son, still in school, but on the brink of maturity awaiting on the other side of his own winter, a taste of which he samples in the form of Nita (Arlene Cockburn), a local girl who takes a fancy to him. Before it's through, the winter guest will visit others, as well; those in every stage of life. At one end of the spectrum are Lily and Chloe (Sheila Reid and Sandra Voe), elderly friends who seem to stave off the inevitable by attending funerals. At the other end are Sam and Tom (Douglas Murphy and Sean Biggerstaff), boys on the cusp of adolescence, who during their visit will learn that being of a like age does not put them at the same stage of life. And as the story unfolds, in each relationship a different stage of life is revealed and examined, and we see the effects of this winter guest on each. Written by Rickman and Sharman Macdonald (adapted from Macdonald's play), this film is a study in contrasts, a pensive portraiture of life; sparse and reflective, Rickman captures in it the human condition at it's most fragile, and therein finds beauty. He uses the original music (written and performed by Michael Kamen) sparingly, opting instead for the sound of the wind, the cry of the gulls overhead or just a backdrop of silence to underscore the dialogue and the drama of the story, all to great effectiveness. By so doing, he allows the drama to speak for itself, to play out thoughtfully and in such a way that the audience is drawn in and included, very reminiscent of Ingmar Bergman's style, though perhaps a bit more wistful at times. And Rickman allows so many wonderfully telling moments in this film: The young boy, Tom, looking out at the vast frozen ocean that seemingly extends on and on forever, as if he is looking out upon his own life, which even now is extending on ahead of him, forever; or Frances, looking out upon that same ocean, a frozen sea reaching out into the unknown, even as her own life is moving on toward an unknown destination; Sam, the same age as Tom, yet younger, watching from the shore, not yet ready and therefore unable to follow as Tom ventures out into the mists that cover the frozen waters. And there's more: Alex and Nita embracing their passion; Chloe, falling and grabbing hold of a railing for support, then finally reaching out to Lily; Elspeth and Tom, sitting together on a rock and sharing a moment at the shore; Frances taking Elspeth by the arm and helping her. All moments that are profound in their simplicity, and all wonderfully presented by Rickman, with not only the eye, but the heart, of a true artist. Phyllida Law gives an especially engaging performance as Elspeth, as does Voe as Chloe; and Biggerstaff and Murphy are a delight to watch as Tom and Sam. But the lovely Emma Thompson steals the show as Frances, with a superb, introspective and reserved performance that is entirely captivating. She successfully conveys that deepest yearning that so readily identifies the winter into which Frances has entered in her soul, and her scenes with Law (her real life mother) are a subtle expression of reality, and a joy to behold. But again, it's the prolonged moments of silence--created and staged so well by Rickman-- that are beguiling, and say so much about who Frances really is. it's such a treat to find a film in which the director is wise enough and so willing to allow enough time for his performer to do what she does best-- as Rickman did with Thompson here-- the positive impact of which is certainly evident in the depth of Thompson's portrayal of Frances. The supporting cast includes Tom Watson (Minister) and Alan Rickman (Man in the Street). Rickman found beauty in the bleak, frozen landscape of that small, Scottish village, then translated it so well into a representation of those troubling and disorienting transitional periods that can visit us at any given stage of our lives. And, combined with his artistic eye and insight into human nature, it makes `The Winter Guest' a film to be embraced and cherished. It's an experience you'll long remember. 9/10.",
         "First of all, the exquisite beauty of this film is mute evidence of the artistic background of the director, Alan Rickman, who was a graphics designer before he became an actor. The iciness and vastness of the frozen Scottish sea coast made me shiver in summer when I first saw it. The kids' conversation about genitalia was funny, and having had 5 children, I never knew they dropped. Emma Thompson and her mother had a great interaction.which is so appropriate, as it shows both the love and the friction that goes on between mother and daughter who are so much alike. This is the major story line, with the subtexts occurring between the boys and between the old ladies intent on attending funerals, as they approach their own 'going away party'. It is an unusually visually attractive film and certainly not a formulaic dialogue. I recommend it to anyone with a brain and an eye for beauty. Alice Copeland Brown",
         "This film is one of those small but delicious productions in modern european film industry that makes it worth to continue going to the cinema. It is the film version of a Scottish theatre production, that did run with the same basic cast. There is no main plot. It is the summing up of four basic stories which are somewhat interwoven, describing the relationships between very different human beings. The Scottish winter, framing all the story, is almost a character of its own. You can almost sense the ice, the intense coldness around the characters, but you altogether feel the warmth of human emotions. The actors are all outstanding in their characters. Above all others, Phyllida Law and Emma Thompson (real life mother and daughter) give a very powerful performance, portraying a depressed recent widow and her energetic and controlling mother: really a charming old lady. The great Alan Rickman's direction is in my opinion a very good job, bringing all the different stories together and making a magnificent choral film. I eagerly look forward to his next attempt in directorial tasks.",
         "Like any great film, this is close to the essence of life. In four poetic, hearthwarming scenes, different generations of characters are entangled in a longing for protection and affection. Two woman wait at a bus stop for a day out to a funeral, but behind their apparent, casual view on death lies a hidden fear for their own end. A new girl in town chases after a local boy, both search through their mutual attraction towards each other. Two schoolboys are playing near the frozen sea and talk about their future. And all this is bound by the main story of a mother-daughter relationship. From the first flight over the seascape, to the final scene with one of the boys walking into the mist, everything is filmed and directed with the same sense for intense images and esthetic realism. And when on the tones of Liz Fraser, lovingly singing the end-credits, the film ends.....and there's a certain sadness that one already has to leave this beautiful universe behind. \"The Winter guest\" is again (if their ever was doubt) the prove how superior European cinema is compared to the Hollywood-counterpart. I rest my case.",
         "There are other overall comments; I thought I would comment on it from a 'quiet psychological drama' POV. As the different pairs of people (mother/bereaved daughter, son/girlfriend, boys, old women) developed their stories, and sometimes criss-crossed, I saw a growing pattern in how they all dealt with their existential lone-ness and lack of drive. The fun but seemingly insignificant (at first) retired ladies hold the key the others seem to echo each in their own way: that if you have a friend, a journey of discovery, and something (or someone) to care for, you can grow in hard conditions, and move on. There are even almost mythical scenes of epiphany about this theme, but I don't know whether Rickmann or MacDonald intended this beautiful mythological pattern to answer the existential crises we face in modern times, but the richness and depth the characters grow into by the end of the film is something that really hit me. A fascinating study that follows the characters so carefully as to teach you things about yourself. Put this in your medicine cabinet for prompt temporary relief of existential despair. If they can find warmth in that bitter chill, there's hope for us too. Not for you if action movies are your thing, of course! Meets my standard for 'movies that improved my life'.",
         "Since it's an import I saw this one in 1998 and my movie years do not correspond well to the calendar ones, still a great movie all the same. Visually enchanting with a splendidly written dialogue - I caught myself thinking once or twice during the movie - \"What a wonderfully insane script!\" Having watched it twice in a row I got a thick Scottish accent as an added benefit. 10 out of 10 in my book.",
         "This started out very bleak... and slow... but once the women leave the room, things start moving and the gist of what appears to be life and how they live it hits you in the head. It's very intellectually done - the grief, lads learning about their sexuality and the curiosity seekers. I was worried that the older lady (Law) would be a menace to her daughter (Thompson), since the younger was dealing with the grief of her husband. She wasn't really. The overall curiosity of death was prevalent, with the older ladies who attended funeral after funeral. Some people deal with death different. I found that very interesting. The boys were such boys - and I'm glad the characters met eventually. It's also well life moved on for the widow. It had a very film noir feel to it. This is not a huge box office show, but somehow I get the feeling everyone can get something from it, no matter the person. It's endearing and a real film about real life. Rickman did a good job for a first time director. I wish he would do more because he has a rich life to tell. Great movie, great for the older kids and parents."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Capitol Films",
         "Channel Four Films",
         "Fine Line Features"
      ],
      "summaries": [
         "The film centers on four pairs - Frances is a recent widow who wants to get away from Scotland to Australia with her teenage son Alex to escape her memories, arrival of her old mother Elspeth makes her reconsider her decision. Alex approaches his first sexual experience with neighbour girl Nita. Chloe and Lily are two old women who like to attend strangers' funerals and Tom with Sam are two schoolboys who skip school to play on the beach and talk.",
         "A recent widow who is determined to leave Scotland for Australia with her son gets an unexpected visit from her aging mother."
      ],
      "budget": 0
   },
   "movielensId": 1728,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-12-27",
      "dvdReleaseDate": "2005-08-30",
      "directors": ["Alan Rickman"],
      "runtime": 108,
      "movieId": 1728,
      "title": "The Winter Guest",
      "mpaa": "",
      "actors": [
         "Emma Thompson",
         "Phyllida Law",
         "Sheila Reid",
         "Sandra Voe",
         "Arlene Cockburn",
         "Gary Hollywood",
         "Sean Biggerstaff",
         "Tom Watson",
         "Alan Rickman"
      ],
      "imdbMovieId": "0120521",
      "originalTitle": "The Winter Guest",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "It's winter in a small Scottish village near the sea, and multiple lives intersect in a day. Frances (Emma Thompson) has just lost her husband to an early death, so her mother, Elspeth (Phyllida Law), travels to Frances' house to reconnect with her daughter and grandson, Alex (Gary Hollywood). Meanwhile, old women Chloe (Sandra Voe) and Lily (Sheila Reid) go to a funeral, youngsters Sam (Douglas Murphy) and Tom (Sean Biggerstaff) cut class, and Alex gets a crush on tomboy Nita (Arlene Cockburn).",
      "tmdbMovieId": 25994,
      "avgRating": 3.48207,
      "releaseYear": "1997",
      "numRatings": 251,
      "posterPath": "/9t0hyTI7HTB6JSIecUNODrtBvwa.jpg"
   }
}