{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0118566",
      "video": false,
      "title": "Afterglow",
      "recommendations": [],
      "backdrop_path": "/mJYzPjjxlN6brfb7fSXoXAa3fFh.jpg",
      "revenue": 2465960,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lucky Mann",
               "gender": 2,
               "credit_id": "52fe4523c3a368484e04a7d3",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Phyllis Mann",
               "gender": 1,
               "credit_id": "52fe4523c3a368484e04a7d7",
               "name": "Julie Christie",
               "profile_path": "/8ExaneRh7VHcm2rATpau89Qwzjm.jpg",
               "id": 1666,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marianne Byron",
               "gender": 1,
               "credit_id": "52fe4523c3a368484e04a7db",
               "name": "Lara Flynn Boyle",
               "profile_path": "/wAVWGJefzTgXWgop58H1ttHS5H6.jpg",
               "id": 6684,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jeffrey Byron",
               "gender": 2,
               "credit_id": "52fe4523c3a368484e04a7df",
               "name": "Jonny Lee Miller",
               "profile_path": "/70oZd4dPWNAibagHJvRU1Tf9e6h.jpg",
               "id": 9012,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Donald Duncan",
               "gender": 0,
               "credit_id": "52fe4523c3a368484e04a7e9",
               "name": "Jay Underwood",
               "profile_path": "/cUWx3F5tzeMUowmCIJoL2WrLxoe.jpg",
               "id": 27493,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4523c3a368484e04a7e5",
               "name": "Alan Rudolph",
               "profile_path": "/At4tWcBv2zElH82zrFFLkEdm4KA.jpg",
               "id": 72427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "575de5f0c3a3683731001465",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "575de6d79251414e630007c4",
               "name": "Alan Rudolph",
               "profile_path": "/At4tWcBv2zElH82zrFFLkEdm4KA.jpg",
               "id": 72427,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "575de71b9251414a820057cf",
               "name": "Suzy Elmiger",
               "profile_path": null,
               "id": 10419,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "575de731c3a36806ad000a35",
               "name": "Toyomichi Kurita",
               "profile_path": null,
               "id": 57709,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "575de837c3a36806ad000a5e",
               "name": "François Séguin",
               "profile_path": null,
               "id": 38523,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "575de846c3a36837310014ce",
               "name": "François Barbeau",
               "profile_path": null,
               "id": 92207,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "575de8689251414e6300080b",
               "name": "Eliza Paley",
               "profile_path": null,
               "id": 1527434,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "575de8779251413eb2000983",
               "name": "Paul P. Soucek",
               "profile_path": null,
               "id": 1551343,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 1,
               "credit_id": "575de8909251414e8f00082e",
               "name": "Lou Solakofski",
               "profile_path": null,
               "id": 1338135,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "575de89fc3a36837310014eb",
               "name": "Orest Sushko",
               "profile_path": null,
               "id": 1413907,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "575de8b892514103e80011c5",
               "name": "Steve Borne",
               "profile_path": null,
               "id": 1375086,
               "department": "Sound",
               "job": "Music Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.32925,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26941,
      "vote_count": 6,
      "budget": 0,
      "overview": "A handyman with marital problems meets a housewife with the same.",
      "similar": [],
      "original_title": "Afterglow",
      "runtime": 119,
      "poster_path": "/XQ4raXxTzGDXcdYqYOl4e5b2Dn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/voYCwlBHJQANtjvm5MNIkCF1dDH.png",
         "name": "Sony Pictures Classics",
         "id": 58,
         "origin_country": "US"
      }],
      "release_date": "1997-12-26",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "A comedy of tears...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Rudolph"],
      "runtime": 119,
      "synopsis": null,
      "writers": ["Alan Rudolph"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118566/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNzc5MDk3MV5BMl5BanBnXkFtZTcwMjE5NDAwMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Nick Nolte, Julie Christie, Lara Flynn Boyle | See full cast and crew »"],
      "reviews": [
         "There's no doubt Julie Christie was one of the most unique personalities of the late sixties and early seventies. A remote beauty who was sexy and charming in Billy Liar and Darling, haunting and enigmatic in Don't Look Now and McCabe and Mrs. Miller and one of the few things worth remembering about Doctor Zhivago. Her notorious pickiness when it comes to choosing roles has served her well and she is one of the few stars from that time who has moved quite gracefully through a film career. Her resources as an actress allow the character of Phyllis Mann to come alive in a way that few could accomplish and the magic she creates is unforgetable. Laid back hipster Alan Rudolph's sexual roundelay has a lush look on top and a jazzy score below but it's Christie who sears the visuals with sadness, mystery, and wit. Nick Nolte's rugged charm serves him well throughout and when these two are alone together on screen, the art of film acting is proudly displayed. Watch the scene when a drunken Phyllis tries to rekindle their physical relationship and notice the body language. Note to filmmakers: Rudolph's genius is knowing when not to move the camera and in trusting his actors to do the work. The film seems ponderous and flat at first and Johnny Lee Miller and Lara Flynn Boyle are still learning their craft (their scenes do grate), but Afterglow is a cockeyed success for those with patience.",
         "I have extremely mixed feelings about this film. On the one hand, I have only praise for Alan Rudolph for writing a great character for Julie Christie to play and giving her a role she could truly sink her teeth in and prove again what a sensational actress she is. And yet - the film that has been built around her is an almost total dud. I found the plot lame, and Lara Flynn Boyle and Jonny Lee Miller execrable. But when Nick Nolte and especially Julie Christie are on screen, all is forgiven. They're great together, but it's Christie's film all the way. She is such a rarity - an actress who combines genuine Movie Star Glamour, the real deal, with a thoroughly modern sensibility. I could go on gushing, but let me just say that she is sublime and this film gives us an all too rare opportunity to see her in full glory, albeit in a vehicle that's less than worthy of her.",
         "The writer/ director Alan Rudolph clearly understands the beauty of woman. The combination of Julie Christie and Lara Flynn Boyle is beautifully juxtaposed. Nick Nolte provides the rough male energy that highlights the facets of the younger / older woman beauty esthetic. The screenplay provided excellent scenes and the camera work and lighting was top notch. My only disappointment was that I did not see this gem on the big screen.",
         "Not a great story (even annoying at times), but a great film. Beautifully photographed by Kurita, with more than a few truly mesmerizing enchanting moments. Many of those scenes capture the essence of nonchalance which Julie Christie has perfected (or reveals of herself). Her magical detached, casual, indifference thru Kurita's lens is the power and soul of Afterglow.",
         "The lives of a has-been-actress, a charming sleazy plumber, a bored housewife and a stressed corporate head intertwined in this low key screwball. If made by studio heads this film would have been hard to swallow, but when handled by the maestro, Alan Rudolph, and starring real actors, it works a treat.",
         "Afterglow is one of the best films of 1997. Julie Christie has been away too long. With the exception of her role as Gertrude in the 1996 version of Hamlet, I can't recall such a performance in years, and she radiates pure magic in this one. Nick Nolte is always at his best in the smaller, independent films and his portrayal in Afterglow is nothing short of brilliant. So, why isn't it available on laserdisc or DVD?",
         "I like Alan Rudolph movies. I always thought of him as Robert Altman Lite. When I saw \"Welcome to L.A.\" in 1902 (I am exaggerating, but barely), I loved it and it seemed very Altman-like, and even starred some of the Altman-ettes like Geraldine Chaplin and Sissy Spacek. Most of the people were unhappy and if I'm not mistaken, Chaplin spends the whole movie in taxi cabs, taking pictures of the corners of buildings. When I saw \"Choose Me\" years later, it had a breezy, jazzy feel to it that I loved. It was about people in love, unlucky in love, wanting more love, wanting love from someone else, etc. \"Afterglow\" is a little like both of these movies. It has its jazz soundtrack intact and the people are miserable. In a nutshell, Julie and Nick haven't had a decent moment together since before they can remember. Lara and Johnny Lee are much younger but also accumulating many bad moments. Secrets are revealed. Both couples switch mates. They are not that much happier. Both find out about the other. That's it. Nolte and Julie Christie have some good scenes together, but she has much more chemistry with Johnny Lee Miller, who gives the best performance in the movie by a mile. He nails his role as a yuppie/scumbag perfectly. The whole thing is way too long. There are unnecessary scenes galore. If it were not for Julie Christie, I would have lasted 20 minutes w/this one. 5/10.",
         "\"You're the most fascinating woman I've ever met\", he tells her after knowing her for about five minutes. Perhaps that will give you a sense of the sophomoric nature of \"Afterglow\"; a film which tells of two neurotic married couples, one middle aged (Nolte/Christie) and one younger (Boyle/Miller), and their respective interwoven infidelities. With a solid core cast and good technical and artistic capabilities and an interesting premise, \"Afterglow\" should have offered more than characters we're not given to care about even if we could suspend disbelief long enough to care. Nonetheless, there's enough going for this mediocre drama to make it a worthwhile small screen watch for sofa spuds with an appetite for the subject.",
         "Dreadful puns. Unbearable middle-class, underwritten archness. Acting, script that jars even more mercilessly once you realize they're not elements of an avant-garde distanciation strategy. Probably the only film I've ever seen that elicited sheer untrammeled loathing at every moment of viewing, usually bad films only evoke a mild bemusement and wondering when it'll be over, an expectation that it may improve. Compare with meeting someone who fills you with such futility and tedium after the first few words of conversation that you just walk away from them with no excuses or explanations. This film is that person. tedious, irritating schlock.A pristine 'chamber piece' of fatuous complacency. The 1st 20 min came with such an undertow of nauseous inertia, life flashing before eyes, etc, that didn't stick with it. Maybe should watch it again? Do they all get blown up in the end?",
         "Two couples: one young, another older. The younger male is a cold fish (some hint of his being a repressed homosexual - the gay friend coming out, etc.); she is a flighty wife (bad acting by Ms. Boyle). Obtuse frigid Christie, and studly Nolte. All this mess spoiled by bits of slapstick which jerk the viewer about. Also some speeded up scenes which come out of left field. And completely unintelligible ending. Without being a spoiler - no idea of what the person in the final scene was doing. Not even clear as to who it was, in my opinion."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Elysian Dreams",
         "Moonstone Entertainment",
         "Sandcastle 5 Productions"
      ],
      "summaries": [
         "Two families are unhappy with their respective relationships: first of ambitious businessman Jeffrey Byron and sexually frustrated Marianne and second of repair contractor Lucky Mann and former B-movie actress Phyllis. When Lucky arrives to Byron's apartment to make some minor repair and Marianne becomes obsessed with him, the everyday balance breaks.",
         "A handyman with marital problems meets a housewife with the same."
      ],
      "budget": 0
   },
   "movielensId": 1733,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1997-12-26",
      "dvdReleaseDate": "2003-10-14",
      "directors": ["Alan Rudolph"],
      "runtime": 119,
      "movieId": 1733,
      "title": "Afterglow",
      "mpaa": "R",
      "actors": [
         "Nick Nolte",
         "Julie Christie",
         "Lara Flynn Boyle",
         "Jonny Lee Miller",
         "Jay Underwood"
      ],
      "imdbMovieId": "0118566",
      "originalTitle": "Afterglow",
      "genres": [
         "Drama",
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A handyman with marital problems meets a housewife with the same.",
      "tmdbMovieId": 26941,
      "avgRating": 3.27768,
      "releaseYear": "1997",
      "numRatings": 569,
      "posterPath": "/XQ4raXxTzGDXcdYqYOl4e5b2Dn.jpg"
   }
}