{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "transvestism",
            "id": 108
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "belgium",
            "id": 1690
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "transgender",
            "id": 17975
         },
         {
            "name": "gender",
            "id": 34214
         },
         {
            "name": "lgbt child",
            "id": 34333
         }
      ],
      "imdb_id": "tt0119590",
      "video": false,
      "title": "My Life in Pink",
      "recommendations": [
         148168,
         45537,
         214952,
         53408,
         127097,
         17447,
         32716,
         176175,
         209677,
         196396,
         194039,
         82576,
         98914,
         189587,
         179000,
         105352,
         132378,
         42595,
         190725,
         161830
      ],
      "backdrop_path": "/rHifgHfFo7AADaEMZiPg6tZvaRF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hanna Fabre",
               "gender": 1,
               "credit_id": "52fe452dc3a368484e04ca05",
               "name": "Michèle Laroque",
               "profile_path": "/c8wqWIidSYbU5opaxGFwjaaPPyC.jpg",
               "id": 35962,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Élisabeth",
               "gender": 1,
               "credit_id": "52fe452dc3a368484e04ca0d",
               "name": "Hélène Vincent",
               "profile_path": "/rhb3AMUOgv8BcXmzpK16QQOlpFG.jpg",
               "id": 1141,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ludovic Fabre",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04ca11",
               "name": "Georges Du Fresne",
               "profile_path": null,
               "id": 96981,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Albert",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04ca15",
               "name": "Daniel Hanssens",
               "profile_path": "/x2PNFRAgIMltpqiyfdyCdgWURHt.jpg",
               "id": 96982,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lisette",
               "gender": 1,
               "credit_id": "59cb7338c3a368773d00e691",
               "name": "Laurence Bibot",
               "profile_path": "/zpwSDQldnLupqdLkVVSU8ZgMwew.jpg",
               "id": 230074,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jeannot",
               "gender": 0,
               "credit_id": "59cb7349c3a36877a900d087",
               "name": "Jean-François Gallotte",
               "profile_path": "/yZUJu495uXUuDbw0JtMwpsZAp2t.jpg",
               "id": 49863,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Jérôme",
               "gender": 0,
               "credit_id": "59cb73579251412b8f00db1a",
               "name": "Julien Rivière",
               "profile_path": null,
               "id": 1895542,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Thom Fabre",
               "gender": 0,
               "credit_id": "59cb7364c3a368777b00c730",
               "name": "Gregory Diallo",
               "profile_path": null,
               "id": 1895543,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Jean Fabre",
               "gender": 0,
               "credit_id": "59cb736fc3a36877a900d0ab",
               "name": "Erik Cazals De Fabel",
               "profile_path": null,
               "id": 1895544,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Zoé Fabre",
               "gender": 0,
               "credit_id": "59cb737f9251412be100ca93",
               "name": "Cristine Barget",
               "profile_path": null,
               "id": 1895545,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Pam",
               "gender": 0,
               "credit_id": "59cb738c9251412b8b00de7b",
               "name": "Delphine Cadet",
               "profile_path": null,
               "id": 1895546,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Christine \"Chris\" Delvigne",
               "gender": 0,
               "credit_id": "59cb739e9251412be100caa9",
               "name": "Raphaelle Santini",
               "profile_path": null,
               "id": 1895547,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Fabienne Delvigne",
               "gender": 0,
               "credit_id": "59cb73a4c3a368776100ddea",
               "name": "Marine Jolivet",
               "profile_path": "/ms9GqgohIxhe1FO5CkI15Xwhw6l.jpg",
               "id": 34000,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Teacher",
               "gender": 1,
               "credit_id": "59cb73ae9251412bcd00d2ce",
               "name": "Anne Coesens",
               "profile_path": "/jGNOfw6qDn8zhJ7ssiQ5pRm4Vi4.jpg",
               "id": 19382,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Principal",
               "gender": 2,
               "credit_id": "59cb73b79251412b8f00db6f",
               "name": "Vincent Grass",
               "profile_path": "/7XMoWw7jONg4xc7npyNfJGnKBZx.jpg",
               "id": 25133,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Pierre Fabre",
               "gender": 2,
               "credit_id": "59ee630e92514119fc039807",
               "name": "Jean-Philippe Écoffey",
               "profile_path": "/pDqyHLXunSkR5By0hToZxH3e8rI.jpg",
               "id": 49946,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04ca01",
               "name": "Alain Berliner",
               "profile_path": "/g7KHUxBKBGbHldYbNldyPiY40RX.jpg",
               "id": 96972,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04ca1b",
               "name": "Alain Berliner",
               "profile_path": "/g7KHUxBKBGbHldYbNldyPiY40RX.jpg",
               "id": 96972,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04ca21",
               "name": "Chris Vander Stappen",
               "profile_path": null,
               "id": 81966,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a8a95bb9251410a1f07172b",
               "name": "Yves Cape",
               "profile_path": null,
               "id": 1025264,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a8a95d49251410ac4070b88",
               "name": "Sandrine Deegen",
               "profile_path": null,
               "id": 1047005,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a8a95e90e0a26401108d5cd",
               "name": "Carole Scotta",
               "profile_path": null,
               "id": 17424,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a8a95fc0e0a26401108d5ee",
               "name": "Véronique Melery",
               "profile_path": null,
               "id": 19773,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a8a96109251410a1f07176a",
               "name": "Karen Muller Serreau",
               "profile_path": null,
               "id": 1169246,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5a8a96330e0a26401108d620",
               "name": "Jean-Claude Lother",
               "profile_path": null,
               "id": 1558394,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "5a8a9654c3a3686207071bab",
               "name": "Daniel Delume",
               "profile_path": null,
               "id": 80470,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.683978,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 27103,
      "vote_count": 33,
      "budget": 0,
      "overview": "Ludovic is a small boy who cross-dresses and generally acts like a girl, talks of marrying his neighbor's son and can not understand why everyone is so surprised about it. His actions lead to problems for him and his family.",
      "similar": [
         449176,
         26371,
         11421,
         376867,
         398818,
         17483,
         184352,
         16367,
         428493,
         26280,
         11000,
         14,
         84892,
         112160,
         338189,
         11386,
         258480,
         26933,
         249638,
         10806
      ],
      "original_title": "Ma vie en rose",
      "runtime": 88,
      "poster_path": "/f5bySDXIX09A3tbtTYHbXK1V0Nf.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         }
      ],
      "release_date": "1997-05-28",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Sometimes you just have to be yourself.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alain Berliner"],
      "runtime": 88,
      "synopsis": "The story of this sensitively-handled film concerns a young MtF transsexual. It is by turns comic and heartbreaking. Seven-year old Ludovic lives in an upper-middle class Belgian suburban neighborhood. He behaves in a way that is quite natural to him, dresses in a dress or skirt whenever possible, and is quite convinced he will be marrying a neighborhood boy, the son of his father's boss. His favorite television program is a kitchy girls program about a Barbie-like doll called Pam who lives in a flowery girly pink cartoon fantasy world and has magic powers. Young Ludovic dances Pam's dance to the haunting song \"Rose\", and like some other girls of his age fantasizes about marriage to a handsome romantic man who will sweep his female love off her feet. The film depicts the difficulties facing a child with gender identity issues and the way the Ludovic himself, the confused parents and family, society, school, other children, and the neighborhood (hostile, hypocritical, and ignorant) handle the situation. Ludovic is seven years old. At first thinks he is a girl, then becomes confused as everyone attempts to disabuse him of this, then tries to find an acceptable common ground (I am a girlboy, or I am a boy but I will grow up to be a girl, or something went wrong and and I should have been born a girl). When he was born, the extra X chromosome accidentally landed in the trash and he got a Y instead! Even an identity as a girlboy is not allowed him by those around him. The only ones who have any understanding of what he is going through are his psychologist and his grandmother who thinks it might be a phase he is going through, but also confronts the situation with some understanding. His sister also sees Ludovich more as he is than as others believe or want him to be. Under increasing pressure from an ignorant community which gives the family the cold shoulder, the parents naturally have difficulty in dealing with Ludovic's transsexuality, and eventually send him to a psychologist with the intention of \"curing\" him, but of course there is no cure - only understanding. Eventually they come to accept the inevitable. The movie, perhaps a larger than life fictionalisation, is a microcosm of the early life experience of a transsexual. The movie deals with homophobia, bigotry, misunderstanding, the retreat of the transsexual into a fantasy life to escape from unthinkable real life, the attempt of the transsexual to hide the condition because of his/her punishment for showing it, and the reaction of the transsexual's parents, family, and society. Common to the experience, particlarly when the movie was made, is confusion of homosexuality and transsexualism, denial of its existence, the attempt to cure it, the successful discrimination and hostility against the transsexual and his/her family, the realization of the existence of both male-to-female and female-to-male transsexuality, and finally resigned acceptance. The father is fired from his job, and the family moves to a poorer neighborhood, where they find some acceptance and Ludovic meets a young butch girl, perhaps a young FtM transsexual of about the same age. The final relief from troubles is belied by the music which turns somber as the camera pans away from the petit Ludovic, on his own away from the other children. As his pubescent sister says, prophetically, \"it only gets more difficult as you get older\". The final scene dissolves into the haunting theme music, \"Rose\", sung by Zazie and an uncertain transsexual's future.",
      "writers": [
         "Alain Berliner",
         "Chris Vander Stappen"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0119590/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3ODY1MTkxN15BMl5BanBnXkFtZTYwNjQwMjI5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Georges Du Fresne, Michèle Laroque, Jean-Philippe Écoffey | See full cast and crew »"],
      "reviews": [
         "The subject matter of this wonderful film (parents' reaction to their suspicions they may have a gay child) is sadly still a controversial topic. The parents of the 7 year-old hero respond erratically to the ever mounting pile of evidence, at times supportive, at times down-playing, then again aggressively trying to \"fight\" this non-sense in their son's head. The stereotypes of the \"bent\", as well as the extreme \"opposers\" (parents unanimously signing petitions to expel the boy from his school - unanimously???? WOW!), neighbors (who seem to be hiding \"secrets\" of their own) are vivid, and hopefully strongly exaggerated. To see a 7 year old \"hide\" in a freezer is a frightening sign that children feel so desperately \"out-of-place\" in the world that seems to not want them in it. The fantasy element of \"Pam\", a \"Barbie-Doll-like\" fictional character, serves as an escape for the boy who wishes to be a girl. When the family feels forced to leave their home (after Dad got fired - we wonder how that happened??) for a distant new place, all seems well until our hero is \"caught\" swapping party costumes with a girl. The boy's furious mother didn't realize that the little girl was the one who fancied the masculine costume the boy was wearing. At the end there is hope for a happy future for everyone. Unfortunately the parents (who should have known better from the start) took a dangerously long time to figure out what's right. They promised to love their son unconditionally, no matter what. This film is filled with magic and wonder and should be seen by all audiences. An R-Rating is absolutely ridiculous! Elementary schools should make this film mandatory viewing. There is not a single scene in this entire film that would warrant even a PG-13. Who rated this film, anyway - Jerry Falwell? I highly recommend this film to those with an open mind, and especially to those without.",
         "The most obvious way to read MA VIE EN ROSE is as the tale of difficulties faces by a very young boy who is very likely transgenderd--but given the multi-layered nature of the film this is actually a rather narrow point of view. It would be more accurate to describe the film as a rather sly assault on a cookie-cutter society that reacts with a herd mentality toward anything in the least unusual. And Ludovic Fabre is a most unusual child: barely into school, he has become convinced that he is a girl, and in his childhood innocence he sees absolutely nothing socially amiss with the idea. The film begins with a party at which neighbors gather to welcome the newly arrived Fabre family--only to be, along with the family, extremely disconcerted when Ludovic makes an entrance in meticulously applied make-up and a pink dress. His family passes the incident off as a joke, but Ludovic proves remarkably single-minded, and when he draws a neighborhood child into his fantasies he also incurs neighborhood hysteria. The result is at once comic and unpleasantly vicious as his classmates, his neighbors, and eventually his family gradually turn upon him. Although there are one or two problems with character development in the script, the cast--particularly Georges du Fresne as Ludovic and Helene Vincent as free-spirit grandmother Elizabeth--is superlative, and director Alain Berliner balances the serio-comic story with a very light touch. Viewers will laugh a little, cry a little, and ultimately come away from the film feeling an uncertain hope. The fact that this film is rated \"R\" is merely so much more evidence of the power of the herd to dictate standards of normalcy--one or two profanities aside, there is absolutely nothing in the film to offend any intelligent viewer, and the film will hold a special appeal for older children who have been targeted as in any way different by their peers... and for the many adults who remember what it was like to be a victim of a society that prizes conformity over imagination, creativity, honesty, integrity, and self-awareness. Strongly recommended. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "Most comments submitted to this forum seem to give credit to the French cinema for bringing \"Ma vie en rose\" to the screen. While this is a co-production, the film is a Belgian movie, as well as its talented director, Alain Berliner, who co-wrote the screen treatment with Chris Vander Stappen. We first saw this excellent film in a film festival before its commercial release. Thanks to IFCTV, which is airing it lately, we revisited it, and again, we were charmed by this unpretentious movie that has its heart in the right places. The idea of Ludovic, the young boy, who thinks of himself as a girl, has been discussed in some of the wonderful comments submitted to IMDb. \"Ma vie en rose\" is a film that has the courage to tackle a subject that is different from all what one sees in mainstream movies. It also has a lot of messages for the viewer, but those issues are lightly handled by the writers, who had the common sense of treating the film in such manner, instead of throwing it one's face. In fact, it shows how resilient little Ludovis is in spite of all the rejection he suffers at the hands of his peers, as well as the adults, who should have a better understanding of the situation. Little Georges de Fresne does excellent work under Mr. Berliner's direction. He is never bratty and one's heart goes to him because no child should suffer for something they didn't create and have no control about who they really are. The R rating ought to be examined more closely. For a film that doesn't have any nudity, violence or sex, that classification seems too extreme by a film that should be watched by a wider cross section. Thanks to Mr. Berliner for dealing with a taboo with a lot of class.",
         "This is a beautiful movie that will touch your heart. A movie about accepting those we love for who they are, and not what we wish they were. It's a very real look at families and how they interact. About how hard it is for a parent to admit, either to themselves or others, that their child may be \"different\", even when they truly love that child. The child in this movie will steal your heart.",
         "I find myself at an unusual loss trying to decide how to rate this film. All in all, I think I don't think I liked the film, but some of that is due to problems in the film while some stems from problems in the characterizations and the degree to which I was bothered by how the parents of the child related to him. I also think that it is ultimately a sad film that is hurt by the attempt to attach a sort of sunny \"everything's gonna be OK\" ending. In parts, I think this film does a great job of portraying how a young boy, who might be effeminate or who might be gay or who might be transsexual, experiences the world as his personality begins to come into conflict with the ways in which a the world expects a young boy to behave. I think it captures well the sense of confusion and panic that can occur to any child when the sense of a warm, safe family environment is suddenly punctured when it bumps up against societal expectations --- when YOU aren't doing anything different than before, but suddenly everyone is unhappy with you. I do feel that the reactions of the community to this child seemed over-the-top and unrealistic. The idea that the whole neighborhood would band together to ostracize a family who has a 7-year old boy who likes to wear dresses and play with dolls is hard to believe. Of course, we live in a world where in the same week, the Texas legislature can vote 135-6 to ban gay foster parents while the Connecticut Senate votes 26-8 to allow allow same-sex civil unions, so geography may be destiny, and maybe there really are parts of France where parents would sign a petition to oust an effeminate 7-year from his school and the school would agree. To me the emotional heart of the movie was in how the parents behaved, rather than in how the child was reacting. I was horrified by many of the things they said and did (or didn't say and didn't do) to their son as the movie went on. One of things in this movie that left me sad is that, while I think we are supposed to believe at the end that all is well and that the parents have accepted their son as he is, there is really nothing in their behavior throughout the rest of the movie that helps you believe this. They both reject him so thoroughly and are ultimately so MEAN to him (especially the mother, who on more than one occasion blames him to his face for their troubles) that one has to think they will continue to do so. They seem to under-react to the freezer incident (which was, after all, a SUICIDE attempt by a 7 year old (!!!!) And, the fact that the family appears so loving and supportive in the beginning of the film (and that the other \"straight\" children appear happy and well-adjusted) only underscores the horror of what the their other son must be experiencing as HE is rejected by these otherwise supportive parents. But, I also felt that all of the parents' bad behavior was out-of-character given what we are otherwise shown about them in a way that suggests there is a problem with the script/characterizations. (As an aside, I also found it odd that many conversations in the film that I would expect to take place privately took place with a larger audience - i.e. the child is present when the shrink talks about the boy's behavior, the other children are present when the parents fight about the boy, etc. But I don't know if this is bad writing or if these are just US/France cultural differences in play.) Either way, and no matter what the end of the movie would have you think, the boy has been pretty battered by how he's been treated (especially by his parents -- it's one thing to have the world against you, but if at any age, let alone 7 years old, you don't have a safe secure home world, you're really screwed) and I don't think you get over that very easily. Heck, he MOVES OUT at the age of 7 to live with his grandmother because everyone recognizes he'll be better off there. And then is effective forced back home because the family is moving. He's lost the innocent security of childhood years before the age that most people are forced to go through that. So, I didn't hate the movie and it had moments that felt very truthful (I loved when the psychologist tells the boy that there just may be things that his parents will never understand -- I'm just not sure he was at an age to really hear her) but there is a lot of stuff in the movie of which I am suspect and which feels contrived. If it is contrived, there's a problem, but to the extent that it's just reflecting a reality other than what I think exists, then maybe it's good. But, either way, I am bothered by the suggestion in many reviews that this is some sort of \"feel-good\" movie. At the end of it all, you still have a boy who has been traumatize by this family and neighbors and who is likely to continue to face similar problems for years to come.",
         "When I first heard about this movie, I myself was in my teens struggling with identity issues like the main character in the movie. As a transsexual woman myself, the movie plot drew me in. I had no idea that the movie would be a mirror image of my own life, of what had taken place right in my very own home growing up. Ludovic, as innocent as he may be, struggles with the reasoning as to why something that comes so natural to him is so disconcerting to all those around him. This movie captures the pureness and innocence of children and their wild imaginations. As Ludovic faces many obstacles in the movie, including rejection from his very own parents, he somehow finds the courage within him to stay true to his convictions that he is a girl. Let this movie enlighten you, and you will be left wondering what would have come of Ludovic if the movie reflected on him as an adult. The actor of Ludovic was stupendous and completely convincing.",
         "Being a movie fanatic and reviewer, I was invited to the \"Semaine du Cinema Francophone\" in Beirut (francophone cinema week). The movie taught me the word \"tolerance\" as I was one of these stupid guys who mocked on effeminate people. (Maybe to reject my desire at this age to be free to disguise myself, like Ludovic did in the movie). What I know is that being in a place that was supposed to gather cultivated people, journalists and movie reviewers, cinema lovers, artists, etc. I was chocked to hear people laughing at some scenes that were supposed to be moving, sensitive and very important humanely. Also the sound going out public mouth: \"tsss tsss tsss\" was so chocking that I felt more the pressure of \"non-tolerant' society inside the movie theater itself, more than the pressure Ludovic had to endure in his story. My personality was projected into Ludovic who suffered his moments in the film, while I was personally suffering inside the theater and trying to vibe with the movie, despite chocked snobbish people's reaction. An excellent movie. Rather a drama than a comedy!",
         "Why is this wonderful family movie rated \"R\"? Why, on cable, is this heart-warming gem preceded by warnings of \"violence\" and \"adult content\"? Ludicrous! Although told in an almost fable-like manner, \"Ma vie en rose\" is an all-too-rare depiction of believably real parents and children dealing with life's pressures together. Beautifully written, directed and acted, any child would benefit from watching this utterly delightful and thought-provoking film with their parents and discussing the struggles of little Ludovic and his family. Don't miss the opportunity.",
         "I watched this movie in one of my classes, and I was really impressed by it. I didn't expect much to sympathize with a young boy who wants to dress in female clothing and take on womanly characteristics, but as the film went along I not only felt a sympathy but a connection to him. Anybody who's ever felt alienated, for any reason, should relate to Ludovic's character. Yet at the same time I related to the parents in the film too. It's easy for an audience to say, \"Why are the parents being so hard on the kid?\" But if I had a son who wanted to dress up like a girl, I wouldn't take it lightly at all. If this were an American movie, it would be treated like an after-school special. (SPOILERS AHEAD) If this were an American film, by the third act, all of Ludovic's peers would've embraced him with open arms, you'd hear some cheesy score and he'd make some \"uplifting speech.\" As a matter of fact, there's a recent movie called \"Bruno\" (also listed as \"The Dress Code\") which has an identical plot to this movie, and it is given that corny, sentimental treatment. \"Ma Vie En Rose\" is strictly character-driven. There's never a moment where Ludovic's peers treat him with a ton of respect--as it would be in real life. I've expressed it before and I'll express it again--kids and young people are cruel. Their number one goal in life is to torment the lives of others. I am a young person myself and I don't feel like I'm being a hypocrite when I say I'm not part of that majority. The film is also filled with humor. Some of the best movies are touching and powerful, while managing to be very funny at the same time. If you get your hands on this gem, it's a must-see! My score: 9 (out of 10)",
         "I was once a \"child\" - full of awe, wonderment, and an overall appreciation of...just - being. Yes, just being! We were all there at one point in our lives - whether you can, or choose too, remember at all. That childhood was full of light. That childhood was full of naivete. That childhood was full of love.That childhood was full of innocence. One day I realized that I was no longer a child. I don't know exactly how - nor when. The \"light bulb\" just turned on. I became a young adult. I knew \"certain\" things and realized \"other\" things. That's the day I lost \"that childhood\". I knew what other people expected of me. \"That childhood\" is what we all long to return to. \"That childhood\" is the essence of pure love without conditions - and no expectations\". That childhood\" is what this movie is all about. As an \"unadulterated being\" we see ourselves as the center of the universe. It is \"our\" world which all about us takes part in. \"We\" are the reason our parents go to work. \"We\" are the reason a billboard is placed in a certain spot. \"We\" are the reason for everything. \"We\" are neither plotters nor planners. \"We\" are not in it for ourselves - after all - the world is ALL about ourselves - innocently and faithfully we just know this. Growing up is a slap in the face of \"that childhood\". There comes a time when all of society plops it's weight on the unconditional love we feel. There comes a time when all of society says to us \"Wake up - this world is not yours\". I cried as I watched the real world crashing down on Ludovic. This is not so much a story about gender identity as it is a story about the loss of \"that childhood\" innocence. ROSTOV RATING: *****Highly Recommended***** *****All Audiences - Ignore Rating***** *****Bring Tissues***** *****Buy/Rent?---->BUY*****"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Canal+",
         "Centre National de la Cinématographie (CNC)",
         "Cofimage 8"
      ],
      "summaries": [
         "Ludovic is a small boy who cross-dresses and generally acts like a girl, talks of marrying his neighbor's son and can not understand why everyone is so surprised about it. His actions lead to problems for him and his family.",
         "Ludovic is a young boy who can't wait to grow up to be a woman. When his family discovers the little girl blossoming in him they are forced to contend with their own discomfort and the lack of understanding from their new neighbors. Their anger and impatience cave and Ludovic is sent to see a psychiatrist in the hopes of fixing whatever is wrong with him. A movie that addresses trans-gender and gender issues in general through the eyes of a child."
      ],
      "budget": 0
   },
   "movielensId": 1734,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1997-05-28",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Alain Berliner"],
      "runtime": 88,
      "movieId": 1734,
      "title": "My Life in Pink",
      "mpaa": "R",
      "actors": [
         "Michèle Laroque",
         "Hélène Vincent",
         "Georges Du Fresne",
         "Daniel Hanssens",
         "Laurence Bibot",
         "Jean-François Gallotte",
         "Julien Rivière",
         "Gregory Diallo",
         "Erik Cazals De Fabel",
         "Cristine Barget",
         "Delphine Cadet",
         "Raphaelle Santini",
         "Marine Jolivet",
         "Anne Coesens",
         "Vincent Grass",
         "Jean-Philippe Écoffey"
      ],
      "imdbMovieId": "0119590",
      "originalTitle": "Ma vie en rose",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["YveiRUDst6I"],
      "plotSummary": "Ludovic is a small boy who cross-dresses and generally acts like a girl, talks of marrying his neighbor's son and can not understand why everyone is so surprised about it. His actions lead to problems for him and his family.",
      "tmdbMovieId": 27103,
      "avgRating": 3.9489,
      "releaseYear": "1997",
      "numRatings": 1957,
      "posterPath": "/f5bySDXIX09A3tbtTYHbXK1V0Nf.jpg"
   }
}