{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "artist",
            "id": 2679
         },
         {
            "name": "artists' life",
            "id": 2936
         },
         {
            "name": "childhood memory",
            "id": 3321
         }
      ],
      "imdb_id": "tt0119223",
      "video": false,
      "title": "Great Expectations",
      "recommendations": [
         10449,
         9095,
         10575,
         9685,
         28200,
         8067,
         1630,
         2057,
         4823,
         48781,
         10876,
         11860,
         2788,
         11889,
         3525,
         11777,
         9304,
         2246,
         11012,
         9280
      ],
      "backdrop_path": "/l4zs8et9D949eKzmFmrzOVXVBRP.jpg",
      "revenue": 55494066,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Estella",
               "gender": 1,
               "credit_id": "52fe44f4c3a36847f80b3f09",
               "name": "Gwyneth Paltrow",
               "profile_path": "/8x3jpWD7DEvyMXO1FOjwNdd1UZT.jpg",
               "id": 12052,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Finnegan Bell",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f0d",
               "name": "Ethan Hawke",
               "profile_path": "/kcby6VYk6Gb0036nUyh8chY5ZAJ.jpg",
               "id": 569,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Uncle Joe",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f11",
               "name": "Chris Cooper",
               "profile_path": "/ytZY7YofdiAZyiyr4NyiB77lwwQ.jpg",
               "id": 2955,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ms. Nora Dinsmoor",
               "gender": 1,
               "credit_id": "52fe44f4c3a36847f80b3f15",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Character",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f3d",
               "name": "Robert De Niro",
               "profile_path": "/lvTSwUcvJRLAJ2FB5qFaukel516.jpg",
               "id": 380,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Walter Plane",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f41",
               "name": "Hank Azaria",
               "profile_path": "/oesvgZ1ubYSmLYmFtRYz7q7Zht2.jpg",
               "id": 5587,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Jerry Ragno",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f45",
               "name": "Josh Mostel",
               "profile_path": "/jVG0WNJrTDEwETCDfoz0KxZ4vTd.jpg",
               "id": 33489,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe44f4c3a36847f80b3f49",
               "name": "Kim Dickens",
               "profile_path": "/yIXBljS46WXvRk2gma3ravVBBgU.jpg",
               "id": 21165,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Erica Thall",
               "gender": 0,
               "credit_id": "52fe44f4c3a36847f80b3f4d",
               "name": "Nell Campbell",
               "profile_path": "/hWne0hzjHfzaoX2bEI80AF5HUEo.jpg",
               "id": 13476,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Owen",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f51",
               "name": "Gabriel Mann",
               "profile_path": "/zxnzL9nXYJ4hja69CG3LTJJFatG.jpg",
               "id": 32458,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f1b",
               "name": "Alfonso Cuarón",
               "profile_path": "/3zYO8I24q4q3cJNohCg63V88uWo.jpg",
               "id": 11218,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f21",
               "name": "Charles Dickens",
               "profile_path": "/doxkq5losIrz2UyBm6ijmw5biYI.jpg",
               "id": 3557,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f27",
               "name": "Patrick Doyle",
               "profile_path": "/mo87kZiHO5gsoax80Us0S2CPmS.jpg",
               "id": 9152,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f2d",
               "name": "Mitch Glazer",
               "profile_path": "/fcs7uTMtxW8umQEwy0XaLRX02Wl.jpg",
               "id": 28866,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f33",
               "name": "Steven Weisberg",
               "profile_path": null,
               "id": 9647,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3f39",
               "name": "Emmanuel Lubezki",
               "profile_path": "/cUlQjVraYILk8Lt3uCSAJApNYHy.jpg",
               "id": 4185,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.62036,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9410,
      "vote_count": 168,
      "budget": 25000000,
      "overview": "Loosely based on the Charles Dickens' classic novel, \"Great Expectations\" is a sensual tale of a young man's unforgettable passage into manhood, and the three individuals who will undeniably change his life forever. Through the surprising interactions of these vivid characters, \"Great Expectations\" takes a unique and contemporary look at life's great coincidences.",
      "similar": [
         306819,
         1281,
         509885,
         40807,
         9292,
         426,
         12159,
         4011,
         269795,
         258230,
         59436,
         152742,
         582,
         120467,
         340666,
         263472,
         210860,
         5876,
         339877,
         1247
      ],
      "original_title": "Great Expectations",
      "runtime": 111,
      "poster_path": "/9T1YxwFZcUjy60xWiZFsb0z0z1H.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         },
         {
            "logo_path": "/A32wmjrs9Psf4zw0uaixF0GXfxq.png",
            "name": "The Linson Company",
            "id": 4700,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-19",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Let desire be your destiny.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alfonso Cuarón"],
      "runtime": 111,
      "synopsis": "The movie begins with young Finnegan \"Finn\" Bell (Ethan Hawke) exploring the beaches of the Gulf Coast of Florida. An escaped convict (Robert De Niro) suddenly pops out of the water and overpowers him, making Finn promise to bring back food and medicine and a bolt cutter to get the iron shanks off his leg next day. Finn does, and the convict unexpectedly tries to make Finn take him by boat to Mexico. The police seize the small boat heading out to sea. The convict hides on a buoy, and Finn's boat is towed back to shore. The next day, Finn sees on the news that the convict has been caught, and that he was Arthur Lustig, a former mobster and his sentence is the death penalty. Uncle Joe (Chris Cooper) gets called to Paradiso Perduto (\"lost paradise\"), home of the richest lady in Florida, Ms. Nora Dinsmoor (Anne Bancroft). Ms Dinsmoor had gone crazy several years before after being left standing at the altar by her fiancee. Ostensibly he was called there for a gardening job, but he does no gardening. Instead, she slips him a large sum of money under the door, calling it \"gas money.\" Meanwhile, Finn, who he brought along, meets young Estella (Gweneth Paltrow) in the overgrown garden. Ms Dinsmoor sees them interacting and calls Maggie (Kim Dickens), Finn's sister, to ask her to let Finn be a playmate for Estella, even though Estella apparently dislikes Finn. Maggie pushes Finn into this for the money. On Finn's first visit to Ms Dinsmoor, she is disappointed when Finn cannot dance for her, but is intrigued when he says he can draw. She forces Estella to sit for a portrait, which Finn draws with make up on an old piece of wallpaper. While he draws, Ms Dinsmoor warns Finn that he will fall in love with Estella and have his heart broken. After the portrait session, Ms. Dinsmoor calls it a day and asks Estella to help Finn find the door. On the way out, she pauses to take a drink from a water fountain and politely offers him a drink from it as well. While Finn is drinking, Estella, who was playing a trick on him, manages to give him a tongue kiss. Several years pass. Maggie runs away from home and Joe raises Finn alone, despite there being no blood relation. Finn goes to Paradiso Perduto every Saturday, where he learns to dance with Estella. One day, Estella (now played by Gwyneth Paltrow) mentions that she has a party to attend. Ms Dinsmoor is shocked that she does not have an escort to take her, to her dismay (\"It's the '80s!\"), so Finn (now played by Ethan Hawke) volunteers to escort. Estella quickly agrees (though rather annoyed at Ms. Dinsmoor's over-protectiveness). When Finn shows up at the party, he is not allowed in because he is not on the guest list. Estella shows up beside his pick-up truck and asks him playfully if he will take her to his house. Finn agrees. Once they get there, Estella starts to seduce Finn, getting him to put his hands up her dress, and they make out heavily. Then she suddenly leaves, claiming that she is very busy that night. The mention of the party was merely another trick to seduce Finn, showing Estella still makes advances on him, which are also implied to be increasingly sexual. The next day, Finn goes to Paradiso Perduto, only to be told by Ms Dinsmoor that Estella had left to study abroad in Europe. Finn is considerably upset. For the next seven years he resolutely puts Estella and Ms Dinsmoor out of his mind, along with other high class things like his art. He helps Joe out with his fishing business. One day, a lawyer comes to Finn and tells him that he will have a gallery show in New York City. Finn and Uncle Joe are astonished at this stroke of luck, not the less because Finn has not drawn ever since Estella left. In the end, Finn is convinced to go to New York, which Estella had once claimed was the art capital of the world. When he arrives, he immediately gets to work drawing again, since he has no pieces to put on exhibit. He sits down in the East Village's Tompkins Square Park, drawing everything he sees and revealing that he has not lost his skill. He takes a break to get a drink from a water fountain - the park's historic Temperance Fountain - and while he is drinking, Estella appears and kisses him. She then invites him to afternoon tea with her at a high class club. Finn arrives to tea with Estella and some of her high class friends. He only has eyes for Estella, but is rudely brought back to earth when Estella introduces her fiancé, Walter Plane (Hank Azaria). Walter teases him by asking how much he would charge to draw a portrait of Estella. He then leaves in a hurry amidst the laughter of Estella's friends. One day, Finn wakes up in his hotel room to see Estella standing next to him. When he expresses surprise, Estella reminds him that he had wanted to draw a portrait of her. While he prepares his sketch pad and charcoal, Estella removes her clothes. Finn draws many sketches of her naked in different positions. Estella suddenly puts her clothes back on and leaves, saying that she is very busy. Growing sick of Estella's games, Finn chases her out to a cab and asks why she keeps doing this to him. Estella looks sad while explaining through a metaphor that she was trained to act this way by her Aunt Dinsmoor. Walter shows up at Finn's hotel room one day, wanting to see the result of the portrait session, and is blown away at the nudity. He then confesses to Finn that he thinks Estella is using Finn to push Walter into asking her to marry him and asks him how to please her, as she was a childhood friend of his. Finn has no idea how to respond and Walter soon leaves. The lawyer who had found Finn in Florida shows up again, moving Finn to a big studio where he can work on his art more comfortably. Finn quickly fills up the studio with his artwork as the opening date of his gallery draws nearer. He makes Estella say that she will be there. One night, at an important event, Finn becomes frustrated when Walter draws Estella away when he barely even got to talk to her. He follows them to their dinner at a Chinese restaurant. As the bemused dinner guests look on, Finn asks Estella to dance. They dance for a few seconds and then leave the restaurant. Once on the sidewalk, they run for Finn's art studio where they engage in passionate sex. Finally, the opening night of Finn's gallery show arrives. He looks everywhere for Estella but she is nowhere to be seen. Instead, Uncle Joe shows up, to Finn's surprise and, to some degree, embarrassment. When Joe accidentally knocks a tray of wine glasses over and tries to clean up the mess, Finn repeatedly tells him with increasing volume to \"just leave it.\" Joe feels that he and his homely manners are an embarrassment to Finn and decides to leave early, despite Finn's attempts to get him to stay. Finn then goes to Estella's abode in New York, hoping to find her there, but instead he finds Ms Dinsmoor there, who had come up to New York for the \"special event.\" When Finn asks if she means his gallery opening, she tells him, no, she came up for Estella's wedding. When Finn becomes upset at this news, she says icily that she warned him when he was a child. At this, Finn tells Ms Dinsmoor that she has broken his heart, the way her fiance did all those years ago in the same way she had revealed her heart was broken. At this comparison, Ms Dinsmoor breaks down and apologizes remorsefully. Finn returns to his studio to find a strange bearded man wanting to see him. The strange man turns out to be Arthur Lustig. He reveals his identity to Finn in a roundabout way. Finn is at first incredulous, but then he becomes uncomfortable with the old man's presence and implies that he should leave. As Lustig is walking out the door, he hints to Finn that he has knowledge of what Finn wants. Finn thus accompanies Lustig to the subway station, since Lustig has a plane to catch from the John F. Kennedy International Airport for Paris. While they are waiting for a train, Lustig sees some unsavory and muscular acquaintances on the opposite platform. Finn and Lustig outmaneuver them and get on a train. They think they are safe, but as the train is in motion one of the old acquaintances comes through the car and brutally stabs Lustig in the side, stepping off the train at the next stop. As Lustig bleeds to death in Finn's arms, he reveals that he has been Finn's benefactor, paying for the lawyer, the gallery, the studio, the plane ticket, and even buying every single piece that Finn had up at the gallery. This was in return for the kindness that Finn showed to him as a child. This news, along with Estella's wedding, is too much for Finn. He detaches himself from everything and goes to Paris to study art. He becomes successful in his own right, and eventually he goes back to Florida for a visit. There he visits his Uncle Joe and reconciles with him. Ms Dinsmoor has long since died and Paradiso Perduto is decrepit and falling down, and scheduled for demolition, but he decides to visit her house anyway. As he is sitting in the garden, he thinks he sees the apparition of Estella as a child (though this one is laughing and smiling, a contrast to the haughty, grim-faced child he once knew). He follows the little girl through to the back dock where he finds the child's mother, who turns out to be Estella. Estella had since gotten divorced. She admits that she has often thought of him, and asks for his forgiveness for all the cruel ways that she had toyed with him in the past. Finn forgives her completely, and the movie ends with them holding hands and looking out over the sea.",
      "writers": [
         "Charles Dickens",
         "Mitch Glazer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119223/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NzI4MTg3NF5BMl5BanBnXkFtZTcwOTM1NDAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ethan Hawke, Gwyneth Paltrow, Hank Azaria | See full cast and crew »"],
      "reviews": [
         "I have never read Dickens' \"Great Expectations,\" but I can tell you that this is one of the best movies I have ever seen. Let me clear something up right away. This is not a b-movie, a cheesy remake, or even a remake. It is my understanding that this movie is loosely based on the Dickens' book, but that it does follow the themes, just not the exact story. This is a great movie, it is a modern classic. The acting is excellent. Ethan Hawk is amazing, he really is a top notch actor. He's not just a young sexy leading man type who gets by on looks and a touch of acting (as I had previously thought since he looks like the typical Matt Dillion or a Lowe type). Gwyneth Paltrow is absolutely stunning and plays her role perfectly. De Niro has a nice, powerful role, and duh, he's awesome in this movie. Anne Bancroft was hauntingly superb in this movie, you'll see what i mean. Hank Azaria and Chris Cooper play great supporting roles. I think this movie was probably Chris Cooper's breakthrough role, and he was great. The movie was breathtakingly shot. The cinematography was better then even the recent crouching tiger hidden dragon. The movie gives you a feeling of awe and mystery because of it's settings. It's a work of art. The writing...based on a classic Dickens novel..come on it is superb. No cheesy lines; yes there are heartfelt beautiful lines, but none cheesy or over-emotional or over the top dialogue. The writing and actors clicked perfectly. Need I say the story was both interesting and intriguing (based on Dickens' Great Expectations). It may be loosely based or not, but it was GREAT. The directing pulled everything together and added some nice tricks to make this movie a Modern classic. And the way music was used to intensify this movie and when and where it was used was absolutely brilliant, and i suppose this is the director's job, WELL DONE. The music was almost as important as the acting in this movie. The musical score for this movie is one of the best I have ever encountered. It makes this movie move you. And just as good are the music (songs) the movie uses, how and when they are used. This is one of the few movies that thrives on sound (music) to help create it's mood, power and emotion and it is done masterfully. This movie is a masterpiece. Beautiful on the eyes, ears, heart, and mind. I feel sorry for you if you don't ever get to experience this movie, it is a MUST see.",
         "It is always going to be a challenge to take a classic novel and turn it into be a movie that will satisfy everyone, especially when the story is being changed and adapted to fit a modern setting. If what you want to find from this movie is an exact translation of the book you will be unimpressed. I personally loved this movie, it is completely stylish thanks to a brilliant soundtrack and the gorgeous leads Ethan Hawke and Gwyneth Paltrow (who is cast perfectly as the beautiful ice queen). They are helped along by a strong supporting cast of Anne Bancroft (wonderfully eccentric as Ms. Nora Dinsmoor), Chris Cooper and Robert DiNero. The problem, however, is that in trying to fit a story as long and complicated as �Great expectations' into a 90 minute movie you loose a lot of the development of the characters necessary to identify and have an emotional reaction to them. Rather than linger on these issues Alfonso Cuaron concentrated on the visual aspect of the movie and the result is a movie that is great to watch!",
         "I went into Great Expectations with high hopes. The story has always been one of my favorites and I couldn't wait too see what they had done with it. The film is beautiful. It is very rich in color and scope. The cinematography was outstanding and the direction was solid. The acting was brillant all around. Robert De Niro is in the movie only briefly, but brings respect to a role that could be just a flash in the pan for anyone else. Ethan Hawke and Gwyneth Paltrow are great and Chris Cooper turns in a very subtle but powerful performance as Finn's guardian. The film left me feeling good, what more could you ask for in a movie?",
         "For beginning, Alfonso Cuarón is one of my favourite directors; and this work of him puts together a great cast of actors: Gwyneth Paltrow, Ethan Hawke, Robert De Niro, Chris Cooper and Anne Bancroft. British novelist Charles Dickens's novel \"Great Expectations\" is the resource for this successful adaptation. I have read the novel, and it's an autobiographical drama and humour. I also saw the 1946 silver-screen adaptation, which was boring and indifferent than this novel; and I think it was indifferent on its own, as well. On the other hand, Alfonso Cuarón's Great Expectations is a transformation of a drama/comedy work of art into a romance. Besides, Alfonso Cuarón used his materials perfectly through matching the relations of these materials between each other: 1- Ms.Dinsmoor and her oath of revenge against mankind, that composes feminism 2- Estella and her enchanting beauty, falling the trap of pride 3- Finn and his pure emotions, falling the trap of loving an insensitive beauty 4- The mysterious benefactor of Finn who bears compunction of his past actions in his life and thus is laying down all of his possessions to Finn, whom he knows as a good-hearted little kid The screenplay is so powerful that solidifies the plot with new original features including surrealist drawings of Finn, that turns the movie a real work of art. Estella is the inspiration of Finn, of his love, of his work, of his success, of his life, ultimately of himself; that he finds and pursues the love of his life all the time. In addition, he stays loyal to Estella. There is the one great qualification of this movie that, lovers always stay loyal to each other. Although Estella has dated with rich businessmen and even married with them, she have always known that Finn was there waiting for her with complete determination and faith. They soon to come together to live happily ever after, like all the wholeheartedly love endings or non-endings. Read my synopsis for this movie, if you haven't got any chance yet to see it.",
         "Great Expectations is one of the few films that can incorporate stunning visuals, one of the best soundtracks to ever grace a film and simply characters that you truly care about by the end of the film. It's true that the character development on the character of Finn is a little weak, but the characters of Estella and the over flamboyant and heartbroken Miss Dinnsmore certainly make up for Finn's minor flaws. Personally i found the film very enjoyable and immersive, and the incredibly imaginative cinematography will certainly keep anyone's attention as well. This film is a stylish and brilliant remake of a classic and could almost be considered timeless compared to other recent attempts at \"updating\" the classics which fail in comparison(such as the recent failed attempt at romeo and juliet). Great Expectations is certainly worth a rental (or even purchase) for anyone that enjoys simply a good, immersive movie with some absolutely beautiful imagery.",
         "This movie, an absolute winner in many ways, lacked the recognition it deserved heavily, the wonderful green theme that runs throughout the movie makes it very pleasant for the viewing eye. Great Cinematography, Great Cast, Great music, add up to deliver a Great Movie which fulfils the viewers Great Expectations.",
         "Too many times we fall into the trap of comparing a movie with the book. Every director and every writer has a vision and we must judge that vision through their respective mediums. This film brings an unconventional theme to a society fascinated by what they cannot have. This film symbolizes just that. Standing on its own, this film was magnificent in its visual images and music and very many other areas. Do not be caught in that trap of comparing this film to the book. Dickens should never be compared to any screenwriter in the first place.",
         "Great Expectations (1998) ***1/2 Starring: Ethan Hawke, Gwyneth Paltrow, Anne Bancroft, Chris Cooper, Robert DeNiro and Kim Dickens Director: Alfonso Cuaron 111 minutes Rated R By Blake French: The only thing keeping \"Great Expectations\" from being one of the best films of the year is the dialogue, which is too proper. The characters act like the everything they do must be out of perfection. When in reality, some of the film's characters would be gruff, careless people. The movie is spellbinding from the first shot. That is undoubtfully because of the character development, which so many movies fail at these days. And not only are they adequately developed, they are engaging. The audience can relate to them as well as understand them. Now these are signs of a superb movie in the making. The movie opens with a small boy, about ten years of age, being overtaken by a man who we later learn is a death sentenced escapee. He orders the pedestrian to bring selected materials to him early the next morning, and never to tell a soul of his terrifying experience. He does as he is told. The boy is named Finnegan Bell, a poor, unfortunate child who lives with his older sister and her husband. The uncle, Joe, soon excepts a job from an extraordinarily eccentric mistress, Ms. Dinsmoor, and her spoiled daughter, Estella. Under circumstances, Finn is able to meet the young girls, about ten years of age as well, and later on becomes close friends with her and the woman Years pass, Finn is still inevitably attracted to Estella, despite her emotionless personality. Unfortunately, she leaves the state to study her future career. Finn is devastated. He gives up his wonderful talent of art and goes into cruise drive for the next seven years. An offer is made to him almost a decade later, to move to New York, where Estella lives at this time, and pursue a career as a professional artist. He excepts, and soon after he arrives, his paths cross with his love once again, but things aren't as they seem at first sight. Do Finn and Estella follow a life of marriage together? Is Estella still interested in Finn, or does she have other romantic plans? I will not revel the answers to these questions. I will leave it up to you to watch this masterpiece destined to become a romantic classic. However, I will say that if you are not familiar with this old tale from Charles Dickens, things are very unpredictable, and this is not you typical, run-of-the-mill love story. The performances are truly Oscar worthy, too bad I didn't see this movie when I came out. For I am reviewing it a year later, because I saw it on video, for free, that is. But I certainly would have paid full price to screen this gem, just to tell others how mesmerizing it is. I loved Anne Bancroft, as the crazy widow. She is gorgeous, breathtaking, and one of a kind, as is Paltrow, as Estella herself. Ethan Hawke performs a down-to-earth character with interest and convincing situation. Chris Cooper, Robert DeNiro and Kim Dickens all provide strong supporting role, especially De Niro, but none are on screen enough to make an actual mark. Another beautiful element in \"Great Expectations\" is the production design: in the houses the atmosphere is all lush, glamorous and interesting. It provides the characters with a firm foundation, which they certainly take advantage of. As a matter of fact, everyone involved with the creation of the film takes careful interest into everything they do. For this is one of the most luscious movies of the decade.",
         "I can't say enough about this movie....viewing should be required by law. It's absolutely amazing. I found the entire movie outstanding. Even the sex scenes were done tastefully. It is a great love story, a tragedy, and for me it offered excellent insight into my own life....something Hollywood rarely does.",
         "Hollywood and the movie industry have made many bold moves over the past decade in bringing to life old classics. None however have been done more boldly than the remoulding of William Shakespeare's Romeo and Juliet, and Charles Dicken's Great Expectations. Both are daring attempts to rebirth a storyline from the distant past, as a tale told in our modern times. I say attempt because in both cases, as good a job the cast and crew did, there was something lacking in these new renditions. Great Expectations, the movie, lacks many qualities that make the novel a success. It cannot be said to be a total loss, the basic elements are intact, it is only the embellishments Charles Dickens developed in the novel to make the story more realistic that are missing. One success, I must admit that I observed while watching the film was the rich visual setting. Although not taking presented in the same place, or era Great Expectations, the movie, is a feast for the eyes. It captivates the mind with beautiful shots of the rural Florida coast life, and yet still retains the jumbled, rundown atmosphere that is described of Pip's small birthplace in a small English town. These qualities of squalor are evident in the impoverished coastal fishing village of the movie. The best achievement in cinematography, is the in-depth views of Pardiso Perduto, a sister mansion to the decaying Satis house of the novel. Even the scenes of New York, the city of \"expectations\" for our youthful protagonist, Finn, has contrasting aspects of rich beauty and unsightly slums that the London of the nineteen century demonstrated. This is the most major achievement for the film; to capture on film a most ingenious modern equivalent of Charles Dicken's astute descriptions. Unlike some attempts to revamp literary successes the movie at least retains some of the dignity of Dicken's work. The core of his novel is intact within the screenplay. Also many ingenious ideas were used in some plot changes, and cinematography. Overall it is not a bad representation of the novel."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Art Linson Productions",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Based on Charles Dickens' timeless tale, this is a story of the love of a man for an unreachable woman. Updated to modern day New York City, the story concerns a man of modest background who falls in love with a rich girl. But when a mysterious benefactor greenlights the man to make his dreams come true, everything done has the ultimate goal of making Estella fall in love with him...",
         "An American update of the Dickens novel set on Florida's Gulf Coast and in the 1980's SoHo art world. Character's names have been changed from the source novel.",
         "Modernization of Charles Dickens classic story finds the hapless Finn as a painter in New York pursuing his unrequited and haughty childhood love."
      ],
      "budget": 25000000
   },
   "movielensId": 1735,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-19",
      "dvdReleaseDate": "2005-06-07",
      "directors": ["Alfonso Cuarón"],
      "runtime": 111,
      "movieId": 1735,
      "title": "Great Expectations",
      "mpaa": "R",
      "actors": [
         "Gwyneth Paltrow",
         "Ethan Hawke",
         "Chris Cooper",
         "Anne Bancroft",
         "Robert De Niro",
         "Hank Azaria",
         "Josh Mostel",
         "Kim Dickens",
         "Nell Campbell",
         "Gabriel Mann"
      ],
      "imdbMovieId": "0119223",
      "originalTitle": "Great Expectations",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["_slwSCPtiLM"],
      "plotSummary": "Loosely based on the Charles Dickens' classic novel, \"Great Expectations\" is a sensual tale of a young man's unforgettable passage into manhood, and the three individuals who will undeniably change his life forever. Through the surprising interactions of these vivid characters, \"Great Expectations\" takes a unique and contemporary look at life's great coincidences.",
      "tmdbMovieId": 9410,
      "avgRating": 3.26388,
      "releaseYear": "1998",
      "numRatings": 3439,
      "posterPath": "/9T1YxwFZcUjy60xWiZFsb0z0z1H.jpg"
   }
}