{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "jury",
            "id": 8881
         },
         {
            "name": "jurist",
            "id": 9465
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "jury duty",
            "id": 10639
         },
         {
            "name": "verdict",
            "id": 10640
         }
      ],
      "imdb_id": "tt0113500",
      "video": false,
      "title": "Jury Duty",
      "recommendations": [
         12475,
         13203,
         9536,
         14577,
         30963,
         13778,
         9308,
         13997,
         16096,
         36929,
         20759,
         18658,
         16094,
         31503,
         36807,
         13201,
         23945,
         14342,
         27202,
         12499
      ],
      "backdrop_path": "/344cRptIiOi0lwxBv7VzpHVLLUC.jpg",
      "revenue": 17014653,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tommy Collins",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a651f",
               "name": "Pauly Shore",
               "profile_path": "/rCoEeH3jmwpNjMHAVv9SchtnNJh.jpg",
               "id": 64998,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Monica",
               "gender": 1,
               "credit_id": "52fe47d09251416c750a6523",
               "name": "Tia Carrere",
               "profile_path": "/s2y4Hj7ZIuEMyE0W3o8WCVcHwiL.jpg",
               "id": 13445,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a6527",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a652b",
               "name": "Brian Doyle-Murray",
               "profile_path": "/fRLFXdb8UQvJs4euZ2sE6CpjbXn.jpg",
               "id": 1535,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Judge Powell",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a652f",
               "name": "Abe Vigoda",
               "profile_path": "/luWKPNb58IgJ2ovrtgPAzHGLLYL.jpg",
               "id": 3093,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jed",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a6533",
               "name": "Charles Napier",
               "profile_path": "/90flwc0xLUDvS4pSUimZzyme2PD.jpg",
               "id": 16119,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Skeets",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a6537",
               "name": "Richard Edson",
               "profile_path": "/7YegwxrBppretnwGEEMxEI453Ef.jpg",
               "id": 6396,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Principal Beasely",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a653b",
               "name": "Richard Riehle",
               "profile_path": "/fFFjfOX7BUsfBQQP54K8QEkkEC2.jpg",
               "id": 18262,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe47d09251416c750a653f",
               "name": "Alex Datcher",
               "profile_path": "/xg4kEX3uxf0wYAJMWwYyUX7YtFR.jpg",
               "id": 46924,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Nathan",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a6543",
               "name": "Richard T. Jones",
               "profile_path": "/ccELAB9yHvG4OxG8dURdUXznwJ8.jpg",
               "id": 55755,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Libby Starling",
               "gender": 0,
               "credit_id": "52fe47d09251416c750a6547",
               "name": "Sharon Barr",
               "profile_path": "/dhX62zpv8t5HKEhzqgEVGejTJ5b.jpg",
               "id": 94750,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Murphy",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a654b",
               "name": "Jack McGee",
               "profile_path": "/jSl2RKRaJvtRoS3T5HSw4xeNdwy.jpg",
               "id": 10489,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Richard Hertz",
               "gender": 0,
               "credit_id": "52fe47d09251416c750a654f",
               "name": "Nick Bakay",
               "profile_path": "/eBnRUdQEPFS3S0TUC9wl8KhbsTk.jpg",
               "id": 78435,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe47d09251416c750a6553",
               "name": "Ernie Lee Banks",
               "profile_path": "/tYcJFUQe0schqMP6vIiL0etqmeV.jpg",
               "id": 94752,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Mrs. Collins",
               "gender": 1,
               "credit_id": "52fe47d09251416c750a6557",
               "name": "Shelley Winters",
               "profile_path": "/zVg966M0RVK5kycHZUEDc51QULV.jpg",
               "id": 7632,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Heather",
               "gender": 1,
               "credit_id": "52fe47d09251416c750a656d",
               "name": "Siobhan Fallon",
               "profile_path": "/wVFa8GiY0xdOLFsvGygy9RMtcBc.jpg",
               "id": 6751,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Carl Wayne Bishop",
               "gender": 2,
               "credit_id": "57cb0dd6925141640f001061",
               "name": "Sean Whalen",
               "profile_path": "/lyuTKNHGCZueuIu7iBt6COzqIBj.jpg",
               "id": 9996,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Rose",
               "gender": 1,
               "credit_id": "57d9b1c2c3a368549000821e",
               "name": "Billie Bird",
               "profile_path": "/6RFp87vKu8CPWnNFEdMNk4pDC2f.jpg",
               "id": 140778,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "The Real Frank (uncredited)",
               "gender": 0,
               "credit_id": "57d9b205c3a3685493007ec7",
               "name": "Rick Ducommun",
               "profile_path": "/reHrybVr1GjF4pGXhtN9EUxS0zD.jpg",
               "id": 1538,
               "order": 18
            },
            {
               "cast_id": 26,
               "character": "Uncle Sal (uncredited)",
               "gender": 0,
               "credit_id": "57d9b436c3a36852e000718d",
               "name": "Andrew Dice Clay",
               "profile_path": "/1KzjDfy2r0Q8HUiEYfLvrOqVWH0.jpg",
               "id": 57906,
               "order": 19
            },
            {
               "cast_id": 27,
               "character": "Russell Cadbury",
               "gender": 0,
               "credit_id": "57d9b55e925141685100770e",
               "name": "Mark L. Taylor",
               "profile_path": "/uvqfJeuIQEHvbEDJWDZJcTBlzNy.jpg",
               "id": 78003,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47d09251416c750a655d",
               "name": "Yoram Ben-Ami",
               "profile_path": null,
               "id": 94753,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d09251416c750a6563",
               "name": "Steven L. Bernstein",
               "profile_path": null,
               "id": 94757,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d09251416c750a6569",
               "name": "John Fortenberry",
               "profile_path": "/bYGojVLiv38qcBmWTOHOlser6Dr.jpg",
               "id": 58316,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "545bce8cc3a368535d00204e",
               "name": "Neil Tolkin",
               "profile_path": null,
               "id": 254757,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "545bce970e0a26042c001e7e",
               "name": "Barbara Williams",
               "profile_path": "/5S02XyxT3CnZQWKFHIxUCeY18gG.jpg",
               "id": 35340,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "545bcea10e0a26042c001e80",
               "name": "Samantha Adams",
               "profile_path": null,
               "id": 177722,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.922911,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19326,
      "vote_count": 40,
      "budget": 0,
      "overview": "When jobless Tommy Collins discovers that sequestered jurors earn free room and board as well as $5-a-day, he gets himself assigned to a jury in a murder trial. Once there, he does everything he can to prolong the trial and deliberations and make the sequestration more comfortable for himself.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769,
         793
      ],
      "original_title": "Jury Duty",
      "runtime": 88,
      "poster_path": "/fOKuWVHR2M4xPjRwYl0bLHsdRHu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1995-04-12",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "For truth. For justice. For five bucks a day.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Fortenberry"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Barbara Williams",
         "Samantha Adams"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113500/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NTcyNjU1NF5BMl5BanBnXkFtZTcwNjk4MzQyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Pauly Shore, Tia Carrere, Stanley Tucci | See full cast and crew »"],
      "reviews": [
         "I think that Jury Duty was stupid but very funny. Pauly Shore is funny because he exists. There's room for anyone in comedy and he proves this point. I'm not sure if this movie damages brain cells, but I watched this movie alone and laughed my ass off. A little tasteless at times. I wonder if Pauly Shore wrote any of it. Andrew Dice Clay made an appearence, I think he's a good actor, very funny. Tia Carrere is a good actress also. It's a true comedy if you think about it, stupid, funny, there's only one part of the film that I didn't find funny. I'm pretty sure I read somewhere that Pauly Shore's mother runs the comedy circuit, so that's pretty funny in itself. Did he get on the big screen just by talent. You be the judge:)",
         "Typical Pauly Shore fare that has him stalling the verdict on a murder trial so he can stay in a plush hotel longer. Naturally he has cut a deal to be in the President's suite of a different inn than the other jurors. Anyway as time progresses, it appears that Shore might be on to something when he tries to convince the others that the case is not as cut-and-dried as it appears. Some outstanding performers (most notably Shelley Winters, Charles Napier, Tia Carrere and Stanley Tucci) somehow found their way on this downer. 2 stars out of 5.",
         "I can't understand why there are so many poor reviews of this movie. And some to say that this is the worst movie Pauley Shore has ever done. I've seen it about a million times, and I think it is just as hilariois nearly every time I see it. And, sure Pauley Shore's most classic movie may forever be Son in Law, but com'mon, I do not think this is the worse thing he's ever done. Jury Duty is largely a parody of Twelve Angry Men, and ...And Justice for All. Tommy Collin's (Shore) mom and her soon-to-be husband take their trailor and head off to Vegas for a quickie marriage. So, unemployed Tommy, in need of a place to stay, finds an opportunity for an extended stay at a luxury suite while serving jury duty on a high profile murder trial. The suspect is \"Drive Thru Killer,\" Carl Wayne Bishop (Whalen), and now his fate is to be determined by eleven jurors who just want to vote him guilty and go home, and one juror (Tommy) who wants to prolong the jury sequestering as long as he can. Eventually, it turns into a parody of Twelve Angry Men when Tommy, trying to prove Carl Wayne Bishop's innocence, must find a way to prove to the other jurors that reasonable doubt exists. If you know Pauley Shore, you know that going to be no easy task, but it is also going to be a hilarious endeavor. And the supporting cast of jurors are just as funny as they become ever more irritable as it seems like a verdict is never going to be reached, especially Richard Edson and Sean Whalen. So why all the negative reviews? It is such a stupid story, so stupid that it is funny. And it is Pauley Shore, doing what Pauley Shore does best, acting like a total nut and having a blast doing it. For a load of laughs and a waste of some time, Jury Duty is not a bad choice.",
         "JURY DUTY is exactly what you would expect from Pauly Shore: obnoxious, silly and ridiculous. Here, Shore plays a jobless boy who decides he can get himself a free hotel room by posing as a juror for a murder trial. Usually, I give movies what they deserve, but since Shore never made a good movie, I have to give him credit. I mean, here is another guy whose movies were successful at the box office, but had little or nothing to show for it. If you are a fan of Pauly, I doubt you will be disappointed. Others beware, for JURY DUTY will be a real trial to sit through. 1 out of 5",
         "This is one of the worst movies I think I've ever seen in my life. Who on earth spent money on this piece of junk. Whoever they are I am sure they are regretting it. I am not a Pauly Shore basher, I really liked Son In Law, but this movie is worthless. Do not see it, I'd say burn it and put it out of its misery.",
         "In the future people will not be able to understand the OJ Simpson references that are made in this movie. It is a timely comedy, set to a backdrop of a gruesome killing. The hero, a stupid man named Tommy Collins (Pauly Shore) exposes the jury system for what it is. Instead of making us laugh, it made me think, that courts actually decide the fates of men's lives by using juries. Who is to say who would make a good juror. Anyhow, if your in the mood for something light, pick this film up at your local video/DVD store and give it a chance. It's not too bad, and watching Pauly Shore in a g-string and a bottle of milk poured on him is likely to get even the most Anti-Shore laughing. Also look for guest appearance by Andrew Dice Clay as Pauly's uncle.",
         "I first saw this movie when I was in grade school, so naturally I wasn't too critical. It's a silly comedy and I got a few laughs at the time. I also didn't see what people hated about Pauly Shore. When you're 11 years old, you don't find a dude like that obnoxious. Now...he pretty much annoys the crap out of me. I'm not jumping onto the bandwagon of Pauly Shore-haters. As a matter of fact, I recall very few comic actors who hardly retain an ounce of merit. The thing that's jarring about Shore is he tries hard to hammer a laugh out of his audience, but he does it in such a dull, low-key manner. If you're gonna be obnoxious, flaunt your obnoxiousness. Obnoxious can be funny. Just look at Vince Vaughn's portrayal of Trent in \"Swingers.\" Shore is like that class clown who tries hard to annoy everyone in sight, yet at the same time tries hard to be liked. If Shore had charm, that might be possible. A guard dog has more charm than him. The cast is pretty much second-rate. Tia Carrerre would grab any script that's hurled in her direction, and so would Abe Vigoda. Sure, Vigoda was popular in his hayday, but that's the whole point. He was popular IN HIS HAYDAY. Andrew Dice Clay has an amusing cameo, though. And what in the world was Stanley Tucci doing in this film??!!! Yes, THE Stanley Tucci. The Stanley Tucci from \"Sidewalks of New York\" and \"Big Night.\" And here he is, playing a fanatical environmentalist. I can betcha 100 bucks this film is now crossed off his resume. Unless you're a die-hard Pauly Shore fan, this film is as boring as sitting in a jury for 4 straight hours--and the movie's only 90 minutes long! The only hints of wit are occasional references to \"12 Angry Men.\" My score: 3 (out of 10)",
         "There is a scene early on in \"Jury Duty\" when Pauly Shore stands on a bus and imitates a town tour guide. It is obvious that this scene was written to showcase Pauly Shore's comedic talents, however, he makes noises and is loud and generally obnoxious and unfunny. \"Jury Duty\" is the point where Pauly Shore officially abused his stay in movies. After this movie, he would forever be sanctioned to the lunch table in the corner with the smelly kid, Carrot Top and the Noid from the Dominoes commercials. But not until he showed the world his versatility in Bio-Dome. Jury Duty is bad. Not bad like \"In the Army Now,\" but close. There is little originality to the script, no amusing characters and about four funny lines. I did enjoy the scene where the witnesses from restaurants give testimonies in their respective fast food uniforms. There isn't much else here. It just isn't funny. Shore also lacks the wit his idiotic leading men contemporaries like Adam Sandler and Chris Farley showed in the 90s. These were all, more or less, bad versions of Steve Martin's wonderful \"Jerk\" character. All Shore shows in this movie is that he has the talent to bug you. Of course, not all the blame can be put on his shoulders. He has no script to work with. Nothing. I don't know why Stanley Tucci thought this movie would be good for him and or how the studio blackmailed him into being in it. I remembered both \"Encino Man\" and \"Son in Law\" were kind of funny in a stupid way. \"Jury Duty \" on the other hand is stupid in a very unfunny way.",
         "Well if you're not a Pauly Shore fan, skip this one, but if in facts, you appear to like him, this one might please you. I'm not very picky when it comes to movies, but I'd say this one was not bad at all. Lots funny parts and stuff, maybe you would like to rent it first though, but well worth the money!. Pauly Shore is of course a like it or not, the way he tries to sound annoying might offend you, but like I said earlier, I don't really care about it, as long as its funny! Too bad he stopped making movies! I give it an 8!",
         "See this film if you're not in the mood for something too heavy. Pauly Shore is his usual comical self, not doing anything that requires major mental work. Tia Carrere is hot and juicy... and Stanley Tucci does his thing once again to critical acclaim. The film came out when the OJ Simpson saga was transpiring on all of our television sets, so it is worth seeing to just remind you of that time in our recent history."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "TriStar Pictures",
         "Triumph Films",
         "Weasel Productions"
      ],
      "summaries": [
         "When jobless Tommy Collins discovers that sequestered jurors earn free room and board as well as $5-a-day, he gets himself assigned to a jury in a murder trial. Once there, he does everything he can to prolong the trial and deliberations and make the sequestration more comfortable for himself.",
         "Tommy Collins is an out of work male stripper living at home with his mother and her boyfriend...until they decide to go to Vegas to get married and take their mobile home with them and leave him behind. Before this happens he gets a letter summoning him to jury duty, which he initially throws away, but when he finds his only other option is to stay with some rather questionable relatives, he retrieves it and heads to jury duty. He makes it a point to get out of any trial that will be over quickly, then gets assigned to a murder trial which might take a few days. Even being sequestered into a dated hotel room in a historical wing that is being remodeled isn't so bad...until be finds he's rooming with his former high school principal...who likes to sleep to motivational cassettes cranked up full blast. In a desperate move, he manages to get down to the front desk and beg to be moved. Since business is slipping badly at the hotel, the manager makes a deal to use him as a marketing tool, and put him in a luxurious penthouse suite as compensation. All is well for him now. The trial is for a guy who is accused of murdering a number of people at a fast food restaurant, and he looks rather psychotic as well. This makes it seem to be an automatic slam dunk to all of the jurors. However, in fear of having nowhere else to go and of losing his pampered lifestyle, Tommy starts stalling and prolonging the deliberations by continuously going over the evidence. He ends up showing the case in a whole new light, and actually ends up changing the minds of his fellow jurors. Just when he finally won the respect and admiration from them, and they are about to find the defendant not guilty, his secret is found out by not just any juror, but a girl he has been infatuated with since day one. Has he lost her forever, or was his prolonging a blessing to everyone?"
      ],
      "budget": 0
   },
   "movielensId": 174,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-12",
      "dvdReleaseDate": "2003-12-09",
      "directors": ["John Fortenberry"],
      "runtime": 88,
      "movieId": 174,
      "title": "Jury Duty",
      "mpaa": "PG-13",
      "actors": [
         "Pauly Shore",
         "Tia Carrere",
         "Stanley Tucci",
         "Brian Doyle-Murray",
         "Abe Vigoda",
         "Charles Napier",
         "Richard Edson",
         "Richard Riehle",
         "Alex Datcher",
         "Richard T. Jones",
         "Sharon Barr",
         "Jack McGee",
         "Nick Bakay",
         "Ernie Lee Banks",
         "Shelley Winters",
         "Siobhan Fallon",
         "Sean Whalen",
         "Billie Bird",
         "Rick Ducommun",
         "Andrew Dice Clay",
         "Mark L. Taylor"
      ],
      "imdbMovieId": "0113500",
      "originalTitle": "Jury Duty",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["bdKOtQlUS6s"],
      "plotSummary": "When jobless Tommy Collins discovers that sequestered jurors earn free room and board as well as $5-a-day, he gets himself assigned to a jury in a murder trial. Once there, he does everything he can to prolong the trial and deliberations and make the sequestration more comfortable for himself.",
      "tmdbMovieId": 19326,
      "avgRating": 2.45065,
      "releaseYear": "1995",
      "numRatings": 2219,
      "posterPath": "/fOKuWVHR2M4xPjRwYl0bLHsdRHu.jpg"
   }
}