{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "diamond",
            "id": 1384
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "betrayal",
            "id": 10085
         },
         {
            "name": "jamaican",
            "id": 168663
         }
      ],
      "imdb_id": "tt0119988",
      "video": false,
      "title": "Caught Up",
      "recommendations": [
         143942,
         44862,
         70877,
         240881,
         256467,
         174344,
         49341,
         51490,
         14887,
         44032,
         177552,
         73963
      ],
      "backdrop_path": "/pQhBmwrC1po9mdjvQfwgAZqk4Rd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Daryl",
               "gender": 2,
               "credit_id": "54788602c3a3687f04000158",
               "name": "Bokeem Woodbine",
               "profile_path": "/OewCN9cV4xwvMwPwBw05kqKy2v.jpg",
               "id": 71913,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Trish / Vanessa",
               "gender": 1,
               "credit_id": "5478861092514104d8004f5e",
               "name": "Cynda Williams",
               "profile_path": "/jSbrK4y3JSboIs8yEiomlIF0pwj.jpg",
               "id": 87117,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Trip",
               "gender": 0,
               "credit_id": "5478861a92514104d8004f66",
               "name": "Damon Saleem",
               "profile_path": null,
               "id": 171293,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Security Guard",
               "gender": 2,
               "credit_id": "5478862ec3a3687aea000530",
               "name": "Jeffrey Combs",
               "profile_path": "/3dUeJgdLYu8Gb56MEgXsFaCyiqN.jpg",
               "id": 27993,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Kool Kitty Kat (as Snoop Doggy Dogg)",
               "gender": 2,
               "credit_id": "5478864092514141ad0012c2",
               "name": "Snoop Dogg",
               "profile_path": "/qj4dRFASr1LCxFvCg8hZ73ZlO2r.jpg",
               "id": 19767,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "BB",
               "gender": 2,
               "credit_id": "5478864f925141292f00095f",
               "name": "Michael Clarke Duncan",
               "profile_path": "/A0fXStrmFubDRFS8UeRW7xvcf6S.jpg",
               "id": 61981,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Roger",
               "gender": 2,
               "credit_id": "5478865d92514160e30095cb",
               "name": "LL Cool J",
               "profile_path": "/dyDxzZo3buNTntxWehyW66aS5Mo.jpg",
               "id": 36424,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "547885eb92514141ad0012b2",
               "name": "Darin Scott",
               "profile_path": null,
               "id": 57777,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "547885f1925141231c001e2a",
               "name": "Darin Scott",
               "profile_path": null,
               "id": 57777,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 0.999907,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 88863,
      "vote_count": 4,
      "budget": 0,
      "overview": "Daryl gets out of jail after 5 years. His mother has died, his girlfriend is married, and he can't find a job. His new girlfriend Vanessa, whom he meets when a gunman opens fire on them, gets him a job as a car driver. Hitmen are still after them, and Vanessa tells Daryl that this is her former lover Ahmad who wants revenge.",
      "similar": [
         357096,
         15069,
         984,
         26390,
         8090,
         4771,
         96,
         75780,
         948,
         807,
         445954,
         58625,
         21484,
         10651,
         11423,
         2275,
         2749,
         123109,
         18587,
         37645
      ],
      "original_title": "Caught Up",
      "runtime": 97,
      "poster_path": "/vZFQfuFDIOz3pKxdnrUT26CQyGj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Live Entertainment",
            "id": 285,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Heller Highwater Productions",
            "id": 11015,
            "origin_country": ""
         }
      ],
      "release_date": "1998-02-27",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "This game has only two rules. Do or die.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Darin Scott"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Darin Scott"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119988/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTk1MjIzMzExNl5BMl5BanBnXkFtZTcwMjc0OTgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bokeem Woodbine, Cynda Williams, Damon Saleem | See full cast and crew »"],
      "reviews": [
         "This is got to be one of the most confusing urban thrillers I have ever seen. A young man did a five year bid after being involved in a bank robbery thanks to his coke-head buddy. Daryl plans were to open a nightclub and had a major set back that sent him to prison because of the bank robbery. But when he got out he hooks up with a fortune teller that maybe change his life around. Though whenever they were together someone was out to kill him. Daryl played by Bokeem Woodbine had only wanted to get his life together so he can get back into his son's life and presume to open a nightclub. Through all the mayhem in the movie he still achieve his goal. Not a bad ending for a hood movie without the star dying.",
         "Director Scott's debut leads us through a well paced maze of mystery. He keeps our interest by injecting unpredictable twists and turns throughout. A brave effort that goes against the formulaic grain of the majority of Hollywood releases.",
         "It was basically a decent movie. The plots keep flipping on you. The first part is silly, but what can you say about the 'hood'? That acid on the head was a bit much though. And they never let us know how the fortune teller finds him. She had to know about him. Glad to see that he was able to finally open his club and get his son.",
         "I liked the movie, despite the critic's abhorrence toward the movie. I can see Bokeem Woodbine's acting potential stretched even further. Yet, Cynda Williams role in the movie may be the culprit for the critic's actions. I didn't like her all that much, and her acting was a bit off. Though, I believe that her purpose in the movie was to fulfill its \"Sex-sells\" promise. But, basically all she is was just a pretty face. This movie was pretty much all Bokeem Woodbine, as Daryl Allen's journey towards getting his life back together, without getting \"Caught Up\" of course.",
         "Gems sometimes crop up in the most surprising places. \"Caught Up\" provides the pleasures of a well-structured plot, especially the payoff one gets when something brought up earlier means something important (even clever) later, e.g. the identity of the hitman. Combine these tasty plot twists with good acting and good dialogue, and you've got a movie worth staying up to watch on cable",
         "\"Caught Up\" had that low budget feel but the low key and well paced mystery kept my attention. Bookem Woodbine (Daryl) was refreshing as a ex-convict trying to go straight but every turn in the road ahead seems to lead him closer back to jail. Bookem Woodbine has a very deep baritone voice like Earl Jones, and his delivery is rough at times but he was genuine. I thought this movie was going to be a yawner early on until the part where Daryl barks \"I ain't going down like no punk!\" That was a delivery of a one-liner comparable to \"I'll be back\" by Arnold. Cyndia Willams (Vanessa) was very pleasing to the eye as the mysterious, seductive woman that plays Daryl as the fool. She is the other reason to watch this movie. Also, some other notable guest cameo is made the Candy Man, Snoop Doggy Dog, and Ll Cool J of \"Deep Blue Sea\" (who didn't go down like a punk).",
         "I watched this movie because it was included in a four pack that I bought at Walmart for five dollars. I had been curious about this movie for quite some time and I remember seeing TV spots for it back in early 1998 and wondered what the movie was all about. I get the premise of a guy getting out of jail and wanting to go straight but couldn't because some things wouldn't let him. However, there were so many twists and turns that I was not sure who really was the main antagonist and when you do, it turns out to be a really minor character and while I get the motive and reasons (Sort of) about the true villain, it just doesn't relate to the main plot. The only thing that saved this movie was seeing Cynda Williams naked and the soundtrack was also better than the film. This movie sucked and I really wonder how this made it to theaters. As much as I respect Bokeem Woodbine as an actor, I don't really think he is cut out for lead roles and this movie shows.",
         "A very typical set up - ex-con with a kid, wants to make a new start. The main character's complete lack of bravado makes him an amiable enough lead, but it's not enough to save the film from clunky dialogue, and some clunkier acting. However, there are some cinematically nice moments, and it's worth the rental price just to see Jeffrey Combs' hysterical, and very... memorable... cameo.",
         "The general look of the film, set design, locale appear as cheap. That coupled with a poor plot line and weak acting made this somewhat uninteresting, with the exception of the acting of Cynda Williams. The obligatory sex-scene was not necessary. Her acting style was smooth and confident. All of the actors could have done better with a better script. Sorry.",
         "This was pretty nice, though absolutely everything is seen before. The plot thins out towards the end, after a bland start. Of the characters I'd like to pull out \"Vanessa\" for her good looks, and \"Billy\" for a good performance. The rastas are, on the other hand, just plain silly. Watch this movie if you have nothing better to do. 6/10"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Heller Highwater Productions",
         "Live Entertainment"
      ],
      "summaries": ["She caught his eye. He was caught off guard. Now Daryl Allen is caught in the line of fire. After six years behind bars, a reformed street hood(Bokeem Woodbine) puts down his gun and struggles to go legit. But when a beautiful, mysterious young woman gets him involved with a bag of stolen diamonds, corrupt cops and a Jamaican mobster, his dreams for an honest future are shattered by a hail of gunfire. Snoop Doggy Dogg and LL Cool J cameo in this gritty action-thriller, from the producers of \"Menace II Society\" and \"Tales from the Hood\"."],
      "budget": 0
   },
   "movielensId": 1742,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-02-27",
      "dvdReleaseDate": "2000-07-25",
      "directors": ["Darin Scott"],
      "runtime": 97,
      "movieId": 1742,
      "title": "Caught Up",
      "mpaa": "R",
      "actors": [
         "Bokeem Woodbine",
         "Cynda Williams",
         "Damon Saleem",
         "Jeffrey Combs",
         "Snoop Dogg",
         "Michael Clarke Duncan",
         "LL Cool J"
      ],
      "imdbMovieId": "0119988",
      "originalTitle": "Caught Up",
      "genres": [
         "Drama",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["QpOR_OTGeWE"],
      "plotSummary": "Daryl gets out of jail after 5 years. His mother has died, his girlfriend is married, and he can't find a job. His new girlfriend Vanessa, whom he meets when a gunman opens fire on them, gets him a job as a car driver. Hitmen are still after them, and Vanessa tells Daryl that this is her former lover Ahmad who wants revenge.",
      "tmdbMovieId": 88863,
      "avgRating": 2.37931,
      "releaseYear": "1998",
      "numRatings": 29,
      "posterPath": "/vZFQfuFDIOz3pKxdnrUT26CQyGj.jpg"
   }
}