{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0129758",
      "video": false,
      "title": "Arguing the World",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4b6e9251416c910da131",
            "name": "Joseph Dorman",
            "profile_path": null,
            "id": 656971,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.002356,
      "production_countries": [],
      "id": 154821,
      "vote_count": 0,
      "budget": 0,
      "overview": "A true story of four Jewish intellectuals born in New York and educated at City College during the 1930s, and their divergent paths over the next six decades.",
      "similar": [],
      "original_title": "Arguing the World",
      "runtime": null,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-01-07",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joseph Dorman"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Joseph Dorman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0129758/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxNTU4MTI1OF5BMl5BanBnXkFtZTcwOTI5NDA0MQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Daniel Bell, Nathan Glazer, Irving Howe | See full cast and crew »"],
      "reviews": [
         "I must agree with Antiwar.com columnist Justin Raimondo's appraisal of this epic: \"...The aforesaid... tout their own intellectual importance in what has got to be one of the most extravagant displays of narcissism since\u0085 well, since Narcissus.\" Boy! Do they ever! In the case of Irving Kristol, spiritual godfather of neoconservativism and bio-dad of \"Weekly Standard\" publisher William, this is truly disquieting, since his aberrant ideas helped detour and mutate our post-9/11 \"war on terror\" into a war of genuine Mideast imperialism (oil, you know) and to guarantee the hegemony of our brave li'l ally, Israel, apparently forever. Thanks for Iraq, Irving. Yep! It's broken. Uh-huh! Now we own it. Some neocons have droned on about \"unending war\" the way salon Marxists of the past jabbered about \"unending revolution\". So... how far have these sour apples rolled from their tree of \"inspiration\"? Neocons are \"progressive\" domestically and \"conservative\" internationally. Open borders, si! Two-state solution, no! Hmm. This movie is not for all tastes (like... anyone who favors straight talk about ANYTHING), but if self-aggrandizement was gold, this jackass collective would be Ft. Knox.",
         "I saw this movie for a Political Science class, and my professor was trying to make a good point. No matter what we think we are, or even think for that matter, things chance over time. Our experiences shape our thinking, and our thinking affects our experiences. The past can only be a guide, and even though we think something one way, does not make it permanent. However, the dedication these men showed towards their pursuit of discourse and political expression at CUNY is fascinating because it relflects the impressions of my class at the time. In a way, it is prophetic of us and of the pursuit of discourse: eventually, the discourse challenges those who pursue it. What happens after that, is up to each person. They can fold, stand tall, or accept and promote the challenge to others. But anything they do is for that great pursuit of political discourse.",
         "This documentary is especially useful and interesting for students and for progressive intellectuals coming into our \"age of reason\" perplexed by the ineffectual left. If you have read Hanna Arendt's *On Violence* and you wondered why she so pointedly critiqued the methods of the young student protesters (who were as appalled by totalitarianism as she was) this simple, if sentimental documentary goes a long way towards settling the score between 30s and 60s radicals. The once-members of the anti-stalinist communists who argued in the halls of City College talk about what it was like to be a young students who cared about learning and politics and their subsequent methods of coming to terms with the tragic ramifications of Stalinism. This documentary shows us how indelibly this disappointment marked the political minds of a radical generation, and how it essentially de-radicalized that generation. In the end it offers hope that there is the possibility of critiquing the failures of the left while at the same time respecting the real intellectual vigilance of those whose humility allowed that fascism could have many possible origins, and that we should never be so smug as to think our own actions could not give rise to it.",
         "This is about left-wing eggheads from the 30's who are now bureaucratic right wingers. They seem to beat-up on Tom Hayden because he was from the rock and roll 60's. At that time they were the professors and writers who wanted to ignore the Vietnam situation because it didn't relate to their life and career. They weren't draftable. I think this is a good display of what youthful ideals and enlightened self-interest are really about. I was from the 60's but wasn't a radical. The music, though, gave me a feeling of change that was possible in an America that had been cheated by following a tight-lipped closed-minded patriotism. The thing about communism and marxism is that dictatorship of the proletariat will never lead to full communism, altruism and brotherly love are not a basic human characteristic but greed and love of power is."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [
         "This documentary tells the story of a hotbed of Jewish intellectualism, New York's City College c. 1930, and in particular follows the careers of four of the greatest minds to emerge from that environment. In following the divergent paths of Bell, Glazer, Howe, and Kristol, the film serves as a powerful record both of American intellectual history and of the peculiar role of a generation of Jewish thinkers in riding and shaping that history.",
         "A true story of four Jewish intellectuals born in New York and educated at City College during the 1930s, and their divergent paths over the next six decades."
      ],
      "budget": 0
   },
   "movielensId": 1743,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-01-07",
      "dvdReleaseDate": "2005-03-22",
      "directors": ["Joseph Dorman"],
      "runtime": 0,
      "movieId": 1743,
      "title": "Arguing the World",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0129758",
      "originalTitle": "Arguing the World",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A true story of four Jewish intellectuals born in New York and educated at City College during the 1930s, and their divergent paths over the next six decades.",
      "tmdbMovieId": 154821,
      "avgRating": 3.41964,
      "releaseYear": "1998",
      "numRatings": 56,
      "posterPath": null
   }
}