{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "blindness and impaired vision",
            "id": 1741
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0120820",
      "video": false,
      "title": "Senseless",
      "recommendations": [
         14342,
         13203,
         19326,
         36807,
         12475,
         48232,
         14577,
         17207,
         9416,
         11511,
         10607,
         30963,
         9308,
         14425,
         20726,
         10406,
         9536,
         10723,
         13997,
         9101
      ],
      "backdrop_path": "/xrPA9smXA6dHSH3TH34qLSP4Qyr.jpg",
      "revenue": 13035599,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Darryl Witherspoon",
               "gender": 2,
               "credit_id": "52fe44f79251416c75047043",
               "name": "Marlon Wayans",
               "profile_path": "/yMBaTsPrthko9eYtSjfVduws5Cn.jpg",
               "id": 9562,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Scott Thorpe",
               "gender": 2,
               "credit_id": "52fe44f79251416c75047047",
               "name": "David Spade",
               "profile_path": "/tamKFAKdB1Q2mllHYHXxqg3YUXr.jpg",
               "id": 60950,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tim LaFlour",
               "gender": 2,
               "credit_id": "52fe44f79251416c7504704b",
               "name": "Matthew Lillard",
               "profile_path": "/gJsQkX20g0ABquHqVpBJzMXR2JF.jpg",
               "id": 26457,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Randall Tyson",
               "gender": 2,
               "credit_id": "52fe44f79251416c7504704f",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Janice Tyson",
               "gender": 1,
               "credit_id": "54f3b76f925141799f000932",
               "name": "Tamara Taylor",
               "profile_path": "/xmWWuOtEpeQP3ITTxqt4hTQesgh.jpg",
               "id": 39464,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Dr. Thomas Wheedon",
               "gender": 2,
               "credit_id": "54f3b78ac3a3681de40009a8",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c75047055",
               "name": "Greg Erb",
               "profile_path": null,
               "id": 72714,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c7504705b",
               "name": "Craig Mazin",
               "profile_path": "/c59ILZnJ8RHlVvRLzIm1Viu9l0k.jpg",
               "id": 35796,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c75047061",
               "name": "Don Carmody",
               "profile_path": null,
               "id": 8303,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c75047067",
               "name": "Eric L. Gold",
               "profile_path": null,
               "id": 35696,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c7504706d",
               "name": "Cary Granat",
               "profile_path": null,
               "id": 62598,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c75047073",
               "name": "David Hoberman",
               "profile_path": "/l63YjASljQOAB8ys4zR3DWUXltP.jpg",
               "id": 31710,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c75047079",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c7504707f",
               "name": "Boris Blank",
               "profile_path": null,
               "id": 57911,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c75047085",
               "name": "Daryn Okada",
               "profile_path": null,
               "id": 56324,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c7504708b",
               "name": "Ross Albert",
               "profile_path": null,
               "id": 66756,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f79251416c75047091",
               "name": "Penelope Spheeris",
               "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
               "id": 58448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f79251416c75047097",
               "name": "Bob Weinstein",
               "profile_path": "/hheuMcH8MnFGmatPvhdLUNnSOwm.jpg",
               "id": 1307,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.014656,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12538,
      "vote_count": 101,
      "budget": 0,
      "overview": "A student gets his senses enhanced by an experimental drug. But abuse is not an option.",
      "similar": [
         258480,
         370663,
         401898,
         12793,
         10735,
         244772,
         858,
         634,
         112160,
         437557,
         10818,
         43923,
         250124,
         513,
         11634,
         141,
         242224,
         376867,
         297762,
         27586
      ],
      "original_title": "Senseless",
      "runtime": 93,
      "poster_path": "/b7UPxxPlvFBNBx9ebpJuuQ2WtbY.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [{
         "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
         "name": "Dimension Films",
         "id": 7405,
         "origin_country": "US"
      }],
      "release_date": "1998-02-20",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "A secret experiment gave him super senses. Then came the side-effects.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Penelope Spheeris"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Greg Erb",
         "Craig Mazin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120820/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzM2ODc0NjY3N15BMl5BanBnXkFtZTcwMDczMTgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Marlon Wayans, David Spade, Brad Dourif | See full cast and crew »"],
      "reviews": [
         "Its easy for people to get hooked on the gross-out comedies like American Pie and Something about Mary, but when a comedy like this comes along and the actor is obviously having so much fun in the role that the jokes seem natural, its hard to pass 'Senseless' off as being anything but hilarious. Marlon Wayans really has come about as an actor since Mo Money and that other movie I think it was called 'Dont go dissin your homeboy while drinkin yo juice in the hood', however Mathew Lillard cant seem to break away from that surfer dude retro generation exxer persona that we see in most of his films. David Spade tries hard but Wayans upstages everyone. 9 out of 10",
         "Yes. This movie is predictable. You do not have to watch very long before you may guess almost everything that will happen, and sure enough, it does. No surprises anywhere. In addition, as in many other movies which Marlon Wayans appears in, a lot of the jokes is pretty juvenile and of \"low\" quality, focusing on stuff you thought were funny when you were five years old and very tired. The again, some of the jokes, still being juvenile, is actually funny. So, as it turns out, as a whole, the movie is entertaining. Not the best comedy ever made, but I have seen a lot worse too. Wayans does his stuff as can be expected, not raising any eyebrows (for his performance anyway) nor disappointing. However, personally, I hoped for David Spade to have a bigger role. In my opinion he is a very good comedian but does not have any chance to show it in this movie. To conclude, do not have the greatest expectations, sit back and enjoy. 5/10",
         "I think this movie was very well done. It had lots of laughs,an entertaining plot and good acting for the most part.It also had great actors in it (Matthew Lillard,Marlon Wayans, David Spade etc.) Wayans did an amazing job but i have to say that Lillard was the funniest, even though he didn't have a very big part. This definitely wasn't Spade's best movie though, because he came off very boring and quite annoying in most scenes. But overall, this movie was pretty good. I really liked it, and if your a Wayans or Lillard fan, I'm sure you will too. This movie is pretty much all about immature jokes, so if you are not looking for that kind of comedy, you should try a different movie.",
         "I don't believe the poor rating that this film has been given. This is one of the funniest films I have seen in a long time. If people watched it with an open mind and stopped trying to serious movie critics and analyse every film they see, they would realise that it is great fun and entertaining. I have recommended this film to lots of my mates and they all thought it was side-splittingly funny. Everybody out there who gave it a crap rating should watch it again, as I pity them for their lack of humour and understanding of a good comedy. I gave this film a ten and I think it was worth every point. Anybody else agree-let me know.Vote and lets get this movie up from the paltry score of 5.4(what an insult)ENOUGH SAID. WAYANS BROTHERS ROCK.",
         "Darryl Witherspoon is a senior economics major whose mother has been raising several children on her own in a bad section of New York City. He is very bright and has a good chance of getting out of that neighborhood. But he has bills to pay and may get kicked out of the apartment he shares with hockey player Tim. Darryl has a good chance at being the one junior analyst hired that year by the prestigious Wall Street firm Smythe-Bates. But his competition includes Scott Thorpe, whose father works for the firm. Scott belongs to the fraternity Darryl wants to join, and he thinks he is better than everyone else and that Darryl isn't good enough to be one of them. Darryl also can't make it as a hockey player. Impressing Smythe-Bates becomes less of a priority as Darryl looks for work just to keep his apartment. The university is testing an experimental drug which heightens the five senses. Despite the potential side effects, Darryl is determined to do whatever it takes to make the money he needs. One possible problem with the drug he is not told about: at too high a dosage, one of the five senses shuts down, followed by another, and another. It's not possible to predict which of the senses will go or when, but you can bet this will happen at the worst possible time. Darryl also wants to meet girls, and Janice is attractive, pleasant and intelligent. Can he win her love? Can he find a way to impress Smythe-Bates? This was very funny. I liked the concept--as in \"Smallville\", a shiny green liquid can give an ordinary person super powers, and it can also cause all sorts of trouble. But the movie wasn't just funny. The romantic scenes were also warm and touching. The writing was quite intelligent. Someone must have known how Wall Street operates and the economic principles that guide the financial industry. I'm surprised we haven't heard more from Marlon Wayans. Although he seemed like a silly clown at times, he really demonstrated comic abilities when Darryl struggled with the drug's problems. And he showed superior talent for both comedy and drama when the drug did what it was supposed to do. David Spade was somewhat less of a loser here than he usually is. He excels at playing jerk loser characters, but Scott had more dimension than the usual Spade type. Richard McDonagle was quite good as one of the top men at Smythe-Bates. And Tamara Taylor impressed as Janice. Esther Scott had a brief but effective performance as Darryl's determined mother. This was really worth seeing. Don't be misled by the title.",
         "Just like any one of a hundred fart-joke inspired comedies trundled out every year this movie has it's moments and is at times very funny. Wayans is pretty good mainly because he can be ridiculous without over-acting and therefore becoming annoying. However, there is nothing here that you haven't seen before and to know exactly what's going to happen before it happens becomes tiresome. If you want low-budget comedy you'd be better off watching the inspired Ski School 2 or Happy Gilmore and give this one a miss.",
         "I'd never even heard of Senseless, but it was recommended to me with high praise - so I gave it a shot. I was pleasantly surprised, well, I'm not saying it was fantastic - but I did laugh enough to make watching worth my while. It may help being a fan of one of the actors. I'm not a huge Wayans fan, any of the, how many of them are there? Anyway, nor am I a huge fan of Spade, although he has his moments. I am a huge Matthew Lillard fan, though (no, I'm not a 16 year old girl!) and I found his performance typically Lillard-esque - which is entertaining no matter what the role is - or how under-written his part is. Any fan of Matt will at least get something out of this movie. Keeping in mind I am not a huge Wayans or Spade fan, both gave good performances. Wayans had some great moments. Directed by Penelope Spheeris, (Wayne's World) - Senseless is overall a pretty good movie with a warm ending, which, being as it *is* a comedy, is a *lot* better than a cold ending! 6.5/10",
         "Darryl Witherspoon is a college student who wants to win annual junior analyst competition, which can land him a job in a big brokerage company. But because he hardly earns any money, and that of what he does, he gives to his family, he becomes a guinea pig for a drug developed at the college which is promised to heighten all senses by ten times.... The first thing you notice about watching any movie starring Wayans from Mo' Money, right up to The Heat, is the fact that the man doesn't age, and it can really put you off track when you are trying to follow the movie. Seriously though, the man has looked about twenty two for over twenty years. And that's about the most interesting thing about this generic, not very funny high concept comedy. Wayans is okay, but whilst watching it, I kept thinking Eddie Murphy would have done this better in 1988, and Akroyd would have been great as the Spade character. Plus it could have been the old sweary Murphy too. So hilarity ensues when Darryl starts to experience heightened sense. He sees women's derrières up close, he smells people's breath, and hears people on the toilet, you can tell where the rest of the humour goes. Spade though, is brilliant as the adversary, here ally oozes slime, and would have been better suited to this type of role, he's easily the best thing about this. The plot is predictable, and it turns out predictable. Just as things are going great for Darryl, something happens with the drug, and makes things go bad for a while, and then things get better again. Don't be fooled by the fact that its directed by the same person who did Wayne's World, That's all down to Mike Myers. This is generic toilet humour with very little going for it.",
         "\"Senseless\" used to be one of my favorite movies when I was a young boy. You know, in puberty era. Yesterday I happened to watch it again, and man, this movie doesn't feel that good anymore. Main plot is completely original, making me congratulate the writers for such creativity. Directing, although being predictable sometimes, never disappoints. Even thought I laughed in most scenes that had jokes, sometimes it feels like there's been too few comedy scenes. Marlon Wayans is what makes these jokes actually work. The scene in which Darryl tries to kiss that other girl and his \"member\" doesn't work used to be a lot funnier in past. Now, am I becoming bad humored or this kind of joke got old. Rest of the cast is just normal and there's nothing bad to say about them. \"Senseless\" is pretty much it, some laughs here and there, an original story with a clichéd yet ridiculous ending that Hollywood usually makes and nothing else.",
         "People, I'd say that was the best 'light' comedy I've seen for some time now! I didn't laughing like for a very long time... It is simply the best movie for the last year in my life of that ganre. It's worth seeing. You can take my word on that. And, it has SO many great phrases and moments, that we keep changing them months after the movie. Thank you very much!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Dimension Films",
         "Mandeville Films",
         "Gold/Miller Productions"
      ],
      "summaries": [
         "Darryl Witherspoon is a young black college student who wants to win annual junior analyst competition, which can land him a job in a big brokerage company. He becomes a guinea pig for the drug developed at the college which is promised to heighten all senses by ten times.",
         "A student gets his senses enhanced by an experimental drug. But abuse is not an option."
      ],
      "budget": 0
   },
   "movielensId": 1746,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1998-02-20",
      "dvdReleaseDate": "1999-12-31",
      "directors": ["Penelope Spheeris"],
      "runtime": 93,
      "movieId": 1746,
      "title": "Senseless",
      "mpaa": "R",
      "actors": [
         "Marlon Wayans",
         "David Spade",
         "Matthew Lillard",
         "Rip Torn",
         "Tamara Taylor",
         "Brad Dourif"
      ],
      "imdbMovieId": "0120820",
      "originalTitle": "Senseless",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["A6pM-4m7xQ0"],
      "plotSummary": "A student gets his senses enhanced by an experimental drug. But abuse is not an option.",
      "tmdbMovieId": 12538,
      "avgRating": 2.78887,
      "releaseYear": "1998",
      "numRatings": 476,
      "posterPath": "/b7UPxxPlvFBNBx9ebpJuuQ2WtbY.jpg"
   }
}