{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "puberty",
            "id": 1525
         },
         {
            "name": "first time",
            "id": 2201
         }
      ],
      "imdb_id": "tt0113540",
      "video": false,
      "title": "Kids",
      "recommendations": [
         9517,
         18415,
         7090,
         10683,
         10412,
         9430,
         11446,
         10692,
         884,
         1548,
         10894,
         476,
         12079,
         11229,
         10279,
         2293,
         2291,
         226,
         2255,
         12093
      ],
      "backdrop_path": "/ybCWrXmlmTo0KKWMAe0Za0jAuyI.jpg",
      "revenue": 7412216,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Telly",
               "gender": 2,
               "credit_id": "52fe44eac3a36847f80b1abd",
               "name": "Leo Fitzpatrick",
               "profile_path": "/cy5AHjW6fRCtdqNfOPpmiXPhA46.jpg",
               "id": 57387,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Ruby",
               "gender": 1,
               "credit_id": "52fe44eac3a36847f80b1ac5",
               "name": "Rosario Dawson",
               "profile_path": "/dEK1rMmSJAPGdc2t1XWdbqBmvEq.jpg",
               "id": 5916,
               "order": 2
            },
            {
               "cast_id": 27,
               "character": "Jenny",
               "gender": 1,
               "credit_id": "52fe44ebc3a36847f80b1b25",
               "name": "Chloë Sevigny",
               "profile_path": "/54k4DrrkDmYhA4rRVt57CUkrVS6.jpg",
               "id": 2838,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Casper",
               "gender": 2,
               "credit_id": "52fe44ebc3a36847f80b1b05",
               "name": "Justin Pierce",
               "profile_path": null,
               "id": 57389,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b09",
               "name": "Sajan Bhagat",
               "profile_path": null,
               "id": 1187713,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Stanly",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b0d",
               "name": "Billy Valdes",
               "profile_path": null,
               "id": 1187714,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Zack",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b11",
               "name": "Billy Waldeman",
               "profile_path": null,
               "id": 1187715,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Javier",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b15",
               "name": "Javier Nunez",
               "profile_path": null,
               "id": 1187716,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Luis",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b19",
               "name": "Luis Núñez",
               "profile_path": null,
               "id": 1187717,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Christian",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b1d",
               "name": "Christian Bruna",
               "profile_path": null,
               "id": 1187718,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b21",
               "name": "Alex Glen",
               "profile_path": null,
               "id": 1187719,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Deli Owner",
               "gender": 2,
               "credit_id": "52fe44ebc3a36847f80b1b29",
               "name": "Joseph Chan",
               "profile_path": null,
               "id": 131299,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Korean Guy",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b2d",
               "name": "Johnathan Staci Kim",
               "profile_path": null,
               "id": 1187720,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "Little Girl",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b31",
               "name": "Adriane Brown",
               "profile_path": null,
               "id": 1187721,
               "order": 14
            },
            {
               "cast_id": 31,
               "character": "Girl #1",
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1b35",
               "name": "Sarah Henderson",
               "profile_path": null,
               "id": 57388,
               "order": 15
            },
            {
               "cast_id": 33,
               "character": "Steven",
               "gender": 2,
               "credit_id": "57675d2c9251412a640007df",
               "name": "Jon Abrahams",
               "profile_path": "/8Ld44nC9fR5wOyKtLpezSJRCtT5.jpg",
               "id": 17866,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44eac3a36847f80b1acb",
               "name": "Michael Chambers",
               "profile_path": "/zLMWGEzMXS85f51L5iSLv5jQnrD.jpg",
               "id": 57392,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a36847f80b1ad1",
               "name": "Patrick Panzarella",
               "profile_path": null,
               "id": 57393,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eac3a36847f80b1ad7",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eac3a36847f80b1add",
               "name": "Cary Woods",
               "profile_path": null,
               "id": 5505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eac3a36847f80b1ae3",
               "name": "Lou Barlow",
               "profile_path": "/csOxrXILa4QWhLBdE1oplumJWum.jpg",
               "id": 57394,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1aef",
               "name": "Eric Alan Edwards",
               "profile_path": null,
               "id": 6389,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ebc3a36847f80b1af5",
               "name": "Christopher Tellefsen",
               "profile_path": null,
               "id": 5361,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44ebc3a36847f80b1afb",
               "name": "Harmony Korine",
               "profile_path": "/jIRFas9ht1GgRVuWKBWEDwgtnFU.jpg",
               "id": 51918,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ebc3a36847f80b1b01",
               "name": "Larry Clark",
               "profile_path": "/7JfnrUqvXafhqACvMewBVA3Klb.jpg",
               "id": 51917,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "563481c9c3a3681b61017b21",
               "name": "John Davis",
               "profile_path": null,
               "id": 1529606,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 9.285003,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9344,
      "vote_count": 360,
      "budget": 1500000,
      "overview": "A controversial portrayal of teens in New York City which exposes a deeply disturbing world of sex and substance abuse. The film focuses on a sexually reckless, freckle-faced boy named Telly, whose goal is to have sex with as many different girls as he can. When Jenny, a girl who has had sex only once, tests positive for HIV, she knows she contracted the disease from Telly. When Jenny discovers that Telly's idea of \"safe sex\" is to only have sex with virgins, and is continuing to pass the disease onto other unsuspecting girls, Jenny makes it her business to try to stop him.",
      "similar": [
         1631,
         7326,
         12689,
         1546,
         10190,
         166,
         334,
         595,
         866,
         14,
         88,
         297,
         1164,
         1278,
         9603,
         6620,
         10636,
         26550,
         10693,
         408
      ],
      "original_title": "Kids",
      "runtime": 91,
      "poster_path": "/gMuV7ORN8rRfQPMImby8KRGihO2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1995-07-28",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Larry Clark"],
      "runtime": 91,
      "synopsis": "In mid-90s Manhattan, the nihilistic Telly (Leo Fitzpatrick) is busy deflowering virgins. He doesn't just enjoy the sex and act of taking young girl's virginity though -- he believes that he can avoid STDs this way. After finishing with his latest conquest (Sarah Henderson), Telly bums around town with his friend Casper (Justin Pierce) looking for some kind of distraction . One of Telly's former sex partners, Jennie (Chloë Sevigny), and her friend Ruby (Rosario Dawson) receive mixed news at a public health clinic. The promiscuous Ruby is clean, but Jennie (who has only had sex once, with Telly) is HIV positive. The news devastates Jennie, who will spend much of the film searching for the wandering Telly. Telly & Casper have several adventures: buying weed in the park, shoplifting a \"40\" of malt liquor from a Korean Guy (Johnathan Staci Kim) of whom they make fun of, beating up a man who \"disses\" them, and finally winding up at a teen party that night. Eventually we find that Telly has seduced a thirteen year old girl, and is busy deflowering her. Jennie (who took a strange drug earlier) arrives and passes out on a couch. A drunken Casper takes advantage of the situation to rape Jennie, perpetuating the HIV cycle. The audience can hear Telly's voice-over explaining that without sex, his life has no purpose. The film finishes with Casper waking up the following morning and asking to no-one in particular, \"Jesus Christ, what has happened?\"",
      "writers": [
         "Larry Clark",
         "Harmony Korine"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113540/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MTExOTc0N15BMl5BanBnXkFtZTgwNjAwNTQxMDE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Leo Fitzpatrick, Justin Pierce, Chloë Sevigny | See full cast and crew »"],
      "reviews": [
         "Kids is one of the best movies I've ever seen. It's funny, horrific, but realistic. Despite the cast having no previous acting experience, the performances are all wonderful, especially Justin Pierce's (as Casper). The realistic story line, the classic dialogue, and the horrific finale are the film's best features. What bothers me is that many people discredit the film. Saying that the movie is exploitation, or something even more ridiculous. I think that people are unable to except the fact that Kids is accurate. Not all teenagers behave like Telly or Casper, but you'd be lying if you said that teenagers don't talk like that. Kids is not exploitation, but rather a brutally honest piece of social commentary. Kids is a deterrent for high risk sexual behavior. The film is also a wake up call for insensitive parents who take no responsibility for their children. Therefore, Kids is a truthful portrayal of urban life. it is not exploitation.",
         "Larry Clark has broken the boundaries with this film. Not only is it one of the realist depictions of our nation's youth, but it also brings the fear of the AIDS virus closer to home. This is not a piece of fictitious work, this is brutal honesty in its rawest form. While many will knock this film because of the pornographic nature, I saw past that and witnessed the birth of the next plague. Writer Harmony Korine has taken the world of our children and transferred it to the big screen. I never once saw this as a shock film or disgusting, I saw honesty and truth behind every scene. This is really what is happening in our backyards. Kids are not as young as they used to be, and are growing up in a world with more possibilities and distractions than ever before. This is the modern world, and these are the newest leaders. While this is not what happens with all of our youth, it does paint a beautiful picture of just a handful. This is not just a story about NYC, it is a message for every city. This is happening all over this country. In the wealthy, poor, and everything in-between, our children are experimenting without any form of education or realization of their actions. This is not a film that will leave a very good taste in your mouth, but then again it isn't supposed to. This is better and more honest than any reality program out there and it will scare the daylights out of you. This is our world, we must change it. Grade: ***** out of *****",
         "The first real thing anyone can do when watching an expose on certain aspects of American culture is to ask yourself a very hard question, \"Is this real?\" I had to do that with this film. Watching Larry Clark's 1995 film \"Kids,\" an authentic and frightening expose of some particularly callous and reckless teenagers in New York City, one cannot wonder if the film is a brilliant commentary on the state of America's youth or is a cleverly exploitive portrait of a corrupted culture. I believe the latter. It depicts, with stunning authenticity, the chilling underside to a culture that abides by its own standards while tossing away the teachings and hard-learned lessons of an elder generation. First of all, I wouldn't believe anyone who says that this movie is hogwash or offers nothing close to a solution. Well, the first question that people should ask themselves is, do they know anyone like the kids in the movie? I do. I recently graduated from high school and I knew several people who were quite like the kids in this film. This film set out to do one thing: to show American parents, \"Hey, these are your kids. Do you know what they do when you're not around?\" Thoughtful people will ask themselves that. This is a film that deserves a thoughtful audience as a thoughtful crew made it and took the risks associated with bringing such harsh subject matter to the screen. Like last year's \"Thirteen,\" \"Kids\" shows youth on the edge. These \"kids\" are perfectly amoral and addicted. These kids aren't all right; they're extremely dangerous. There isn't a whole lot to the story, other than it chronicles an eventful day in the life of Telly (Leo Fitzpatrick), his friend Casper (Justin Pierce) and their inner-circle of similar-minded, sex/drug-crazed associates. Telly has made it a duty to \"deflower\" as many girls as possible and later brag to his friends about his latest conquest; but by day's end, guaranteed, he would've done it again (a record for him to do two girls in one day). The main conflict of the story surfaces about 30 minutes in, when Jennie (Chloe Sevigny) discovers that she had contracted HIV from Telly during their first sexual encounter, and it becomes her mission to track him down before another young girl shares her fate. This is one powerful and dangerous film that is not for the faint of heart, as it is authentically bleak. There is no hope for the characters in the end; that is just how realistic this film is. The film is also filled with shockingly real images, and a wall of furious sound to drive home its key points. These are the kids of yesteryear, the forgotten generation; these kids are America's worst nightmare because they are young, dumb and just do not care; the fact that they do not care makes them especially dangerous. As I stated before, the imagery is extreme and frightening. If there ever was an honest thing these kids ever did, it would have to be willfully giving change to the less fortunate (a man with no legs who rides a skateboard on the subway). We also get images of younger children, swearing, drinking, smoking, talking like adults; trying to fit in with their peers who are not much older than they are. I was actually quite frightened by some baby pictures of our main character and then I see what's on screen. Then-newcomer Leo Fitzpatrick puts a face on a sleeping monster in America: the doomed generation of young people that disregard older generations completely and follow their own set of corrupted values. Telly is reckless and stupid; it is impossible to really sympathize with his character, even though we probably are. But it is difficult to do so, mainly because of his preference for deflowering girls younger than him (the first girl we see him with is only 12; he's about 15 or 16) and that could open up discussion for Telly possibly being a borderline pedophile. Where are the parents? One could very easily ask that question. Strangely enough, Telly lives with his mother and baby brother. She is the only parent in the film and she seems as every bit as irresponsible as her misguided son. Watching \"Kids,\" I couldn't believe how real it is, how it sucks the viewer into its dark, dangerous, and seductive world; it's easy to see how a weak person could believe that what goes on in this movie is cool. It begs the most fundamental question any responsible person could ever ask, \"Do you know where your children are?\" It is a question that every good parent should ask when their teenage son or daughter steps out that front door and into the \"real\" world. \"Kids\" \u0096 10/10",
         "I approached this expecting an explicit, controversial film for controversy's sake -- something disturbing and, let's face it, fabricated. I was surprised to find that yes, its aim is to make parents lock their children in their bedrooms for the next fifty years but also to truthfully examine modern-day childhood the way it really is. I knew kids like this, who talked like this, who listened to the Beastie Boys and who bragged about anything sexual they could think of. This movie follows the adventures and sexual pursuits of Telly, an AIDS-infected young teen who goes around taking advantages of virgins. We're led to believe Telly isn't aware of his disease but I think perhaps he does and gets off on possibly spreading it to others. One of his ex-girlfriends (Chloe Sevigny) becomes infected and spends the entire movie looking for Telly to warn him before he has sex with a young virgin. The end of the movie is pretty tragic and quite sad really. Yes, it is wrapped a bit too nicely in the sense that all this stuff happens to one group of kids within a period of a day or so, but by compacting many events into one scenario director Larry Clark makes quite a compelling little film/semi-documentary. One thing I should also mention is the dialogue, which I found to be the most realistic in any kid-starring film I've ever seen. He didn't just choose talented actors, he got the expressions, mannerisms and jargon perfected -- as a result it does come across as a very authentic, genuine film and even if you hate it, there's no denying it's pretty sickening. Whether you find that a good or bad thing is entirely up to you.",
         "This film struck me in the heart, it made me feel terrible after seeing it and any movie that can have a impact on me like that, I congragulate. The film is almost like a documentary of a group of kids in NYC. It probably isn't completely realistic but its believable. It is a frightening wake up call to America. If you want to be moved watch this film. The acting is great for a group of rag-tag kids, they make the story really believable and passionate. I do believe that Larry Clark has a strage obsession with teenage nudity, in every film I've seen of his there has been tons of teenagers having sex, sometimes it spoils the film. Overall the film is powerful and moving, watch it.",
         "I watched this movie with my dad. He did a bunch of stuff when he was younger, but kids weren't as amoral back then as they are now. The sad part for me was that nothing in the movie shocked me.I'd been there and done that in a few cases...but never to the extreme that those kids took it. I never hung out with people that acted like that, and i've never publicly exploited myself like many of those girls did. It was really sad for me to realize how accurate the movie was though. It makes the movie \"Thirteen\" look like a Disney movie. The movie makes me want to lock any future kids I end up having in a box, and not let them out until they are 30. It's definitely a movie parents should see. I've had way too many friends who's parents live this life of ignorance. They turn their backs and deny that their children could be doing anything wrong. It's true that you live and you learn, but the scary thing is is that not all of the kids grow up and wake up.",
         "Larry Clark has created a true masterpiece of its time. Kids is an insightful, poignant and harrowing depiction of the life of angst ridden teens in New York City. There's Tully, the smooth talking, de-flowering (and HIV positive) teen, Casper, the cool, hyped up and not all there teen, and Jennie, the girl who is full of depression and anger for the de-flower man. The film doesn't have much of a direct screenplay (mostly dialogue you would hear while around friends) which is good for the type of movie being made here. The film gains much controversy by stating whether its true to life, or just a mindless depiction of what could happen in the city. You could decide that for yourself, but for me, I think this film has more truth, heart and drama (including great dramatic acting and scenes) that most films I've ever seen.",
         "KIDS is a dead-on accurate portrayal of the troubled youth of our times. But what a lot of people don't realize is this problem exists not only in large cities like NYC, but is without a doubt a serious problem in small towns. Homemade drugs and some '40s' followed by a 'roll in the hay' is the favorite Friday night pastime in a lot of rural areas. In some ways, small town kids have a bigger risk because the free clinics and youth programs available to kids in urban areas don't reach out to the country. Kids and parents alike seem to share the mentality of \"that stuff just goes on in the cities\". I grew up in a town of less than 10,000, and there were kids exactly like Telly and Casper in my high school- from the lingo and behavior right down to the dirty, stretched out t-shirts. AIDS aside, what I think is the scariest part of the movie is when Telly and Casper go to Telly's house, and his mom is there. She takes her parental duty as far as asking \"where have you been?\"- to which Telly responds with a lie, saying they were out looking for jobs. The audience knows they are lying, obviously- but you can tell the mother doesn't really believe it either- she's just too lazy, or preoccupied to bother with the whole thing. Pretty common occurrence among today's parents. KIDS should be a part of the required curriculum in Sex Education classes for all high school freshmen. Any parent who believes the vulgarity and sex and drugs is exaggerated or glorified is in need of a serious wake up call. If it's not your kid doing these things, then it's the one sitting next to him in class. And don't be so sure it isn't your kid.",
         "Kids was an amazing movie. It portrayed real life crisis's that many do not like to even talk about. If you open your eyes, that movie in reality is what goes around everyday, everywhere. Kids showed the harsh reality of life, living with a disease that you do not even know you have, and if you have one also, this movie makes you feel a little more comfortable. \"But the truth is. I don't know any kids with AIDS. No one I know has ever died from that. It's like some weird make-believe story that the whole world believes.\" I personally believed that too, until i found out i had one, and once I did, everything changed. This movie may be very controversial but I urge people to watch it, because the lessons learned are endless.",
         "At first this just may seem like a pointless slice of 24 hours in a teenager's life, but upon closer viewing it's points become very clear. The sex scenes are rather drawn out and some of the situations are very disturbing and very graphic, but there really is kids like this in real life. Film manages to make important statements about safe sex or avoiding sex all together, rape, and parental involvement. It's raw and it's shockingly realistic in it's treatment. A very important film."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Guys Upstairs",
         "Independent Pictures (II)",
         "Kids NY Limited"
      ],
      "summaries": [
         "Disturbing, dark, low-budget independent film about teen-agers in New York City. The story focuses on Telly (Leo Fitzpatrick), a teen who has a goal to de-flower as many virgins as he can. When one of his old encounters discovers that she is H.I.V.-positive, after only one encounter with a guy, Telly remains undaunted.",
         "Kids follows a group young, unsupervised, not mature, but all-too-grown-up kids in New York. One girl has just been diagnosed with HIV and is trying to notify the boy who gave it to her, who is on a quest to sexually prey upon innocent girls. The film follows these characters and their friends through the day, hanging out, playing, carousing, and going to parties. Each scene is intriguing and disturbing -- conveying an urban reality that includes drugs, sex, guns, and disease; and yet never letting you forget these are *kids*, some of them barely in puberty.",
         "A controversial portrayal of teens in New York City which exposes a world which is deeply disturbing. The film focuses on a freckled boy Telly (Leo Fitzpatrick), whose idea of safe sex is to have sex with only virgins. But one girl from one of his past unprotected passion test positive for HIV, and soon finds him making love yet to another unsuspecting girl",
         "A disturbing portrayal of teenage life, AIDS, and the Kids of New York City. Controversial in its content, the film exposes the grim reality of a group of skate-boarders in the space of 24 hours. Primarily the story consists of Telly (Leo Fitzpatrick) a 17 year old slacker whose mission is to de-flower as many young girls as possible, whilst unprotected. Things turn bad when an old flame finds out she has tested positive for HIV and the only person she has had sex with is Telly. She chases through New York to find him but is too late as he has already de-flowered yet another innocent pre-teen.",
         "The movie Kids is a view of a city kids world. You watch Telly, a unsupervised teen in the streets of New York taking advantage of innocent young girls not knowing he has HIV but one of the girls he slept with a year before does. In knowing this she runs the streets looking for him while he plans to deflower another young girl. And in the midst of all this, you see kids as young as 10 or 11 using drugs and alcohol with some of the older kids. Kids is basically a movie that warns you what the hell could be happening to your very own child.",
         "A day in the life of a group of teens as they travel around New York City skating, drinking, smoking, and deflowering virgins."
      ],
      "budget": 1500000
   },
   "movielensId": 175,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-07-28",
      "dvdReleaseDate": "2000-11-17",
      "directors": ["Larry Clark"],
      "runtime": 91,
      "movieId": 175,
      "title": "Kids",
      "mpaa": "NR",
      "actors": [
         "Leo Fitzpatrick",
         "Rosario Dawson",
         "Chloë Sevigny",
         "Justin Pierce",
         "Sajan Bhagat",
         "Billy Valdes",
         "Billy Waldeman",
         "Javier Nunez",
         "Luis Núñez",
         "Christian Bruna",
         "Alex Glen",
         "Joseph Chan",
         "Johnathan Staci Kim",
         "Adriane Brown",
         "Sarah Henderson",
         "Jon Abrahams"
      ],
      "imdbMovieId": "0113540",
      "originalTitle": "Kids",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": ["U9a5tZSKDOU"],
      "plotSummary": "A controversial portrayal of teens in New York City which exposes a deeply disturbing world of sex and substance abuse. The film focuses on a sexually reckless, freckle-faced boy named Telly, whose goal is to have sex with as many different girls as he can. When Jenny, a girl who has had sex only once, tests positive for HIV, she knows she contracted the disease from Telly. When Jenny discovers that Telly's idea of \"safe sex\" is to only have sex with virgins, and is continuing to pass the disease onto other unsuspecting girls, Jenny makes it her business to try to stop him.",
      "tmdbMovieId": 9344,
      "avgRating": 3.52349,
      "releaseYear": "1995",
      "numRatings": 5747,
      "posterPath": "/gMuV7ORN8rRfQPMImby8KRGihO2.jpg"
   }
}