{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "meteor",
            "id": 5404
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "cybersuit",
            "id": 208870
         }
      ],
      "imdb_id": "tt0120478",
      "video": false,
      "title": "Star Kid",
      "recommendations": [
         7269,
         51321,
         20551,
         287940,
         63091,
         90030,
         3149,
         89762,
         78083,
         76297,
         20468,
         204904,
         22792,
         31281,
         61418,
         150889,
         61702,
         19214,
         39411,
         245589
      ],
      "backdrop_path": "/pCsBPlAUkBIrRQ1sKj1hMKNpS9c.jpg",
      "revenue": 7,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Spencer Griffith",
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2c3",
               "name": "Joseph Mazzello",
               "profile_path": "/zsBGvymDqB737PerJTqhS9dPuBd.jpg",
               "id": 4787,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Roland Griffith",
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2c7",
               "name": "Richard Gilliland",
               "profile_path": "/wGFWVVIFCluds0tvaPSAQ86zVGa.jpg",
               "id": 42169,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Janet Holloway",
               "gender": 1,
               "credit_id": "52fe4887c3a36847f816c2cb",
               "name": "Corinne Bohrer",
               "profile_path": "/i4U1Xg5173eoQbyEQklVy8pyCM3.jpg",
               "id": 74954,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cyborsuit",
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2cf",
               "name": "Alex Daniels",
               "profile_path": "/z3p1nleB90Fc7WGLB6i7S99OtNo.jpg",
               "id": 63935,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Manfred 'Turbo' Bruntley",
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2df",
               "name": "Joey Simmrin",
               "profile_path": "/rVqBJVaL8fWmUbbvXzXTTMguP0v.jpg",
               "id": 112085,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Broodwarrior",
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c2e3",
               "name": "Brian Simpson",
               "profile_path": null,
               "id": 180838,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Stacey Griffith",
               "gender": 1,
               "credit_id": "52fe4887c3a36847f816c2e7",
               "name": "Ashlee Levitch",
               "profile_path": null,
               "id": 181527,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Hank Bruntley",
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2eb",
               "name": "Jack McGee",
               "profile_path": "/jSl2RKRaJvtRoS3T5HSw4xeNdwy.jpg",
               "id": 10489,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Kevin, Stacey's Boyfriend",
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2ef",
               "name": "Danny Masterson",
               "profile_path": "/vBC0mHPEVHwhFZYzhXgoHzBKYyK.jpg",
               "id": 18972,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Michelle Eberhardt",
               "gender": 1,
               "credit_id": "52fe4887c3a36847f816c2f3",
               "name": "Lauren Eckstrom",
               "profile_path": null,
               "id": 155494,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Nadia",
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c2f7",
               "name": "Christine Weatherup",
               "profile_path": null,
               "id": 201169,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Rookie Cop",
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c2fb",
               "name": "Joshua Fardon",
               "profile_path": null,
               "id": 197872,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Trelkin / 'Nath'",
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2ff",
               "name": "Bobby Porter",
               "profile_path": null,
               "id": 18677,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2d5",
               "name": "Manny Coto",
               "profile_path": null,
               "id": 41795,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4887c3a36847f816c2db",
               "name": "Manny Coto",
               "profile_path": null,
               "id": 41795,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55312ea9c3a368222300005d",
               "name": "Justin Hammond",
               "profile_path": null,
               "id": 1455461,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.049944,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 54007,
      "vote_count": 18,
      "budget": 0,
      "overview": "Shy seventh-grader Spencer Griffith's life changes when the meteor falls into local junkyard and he finds a Cybersuit - the wise and strong robot from another galaxy. Spencer puts Cybersuit on and becomes a different kind of guy",
      "similar": [
         1924,
         1452,
         141052,
         8536,
         9531,
         13640,
         24428,
         11253,
         49521,
         99861,
         297762,
         299534,
         209112,
         30061,
         155,
         287947,
         251519,
         14011,
         65291,
         11411
      ],
      "original_title": "Star Kid",
      "runtime": 101,
      "poster_path": "/6oSBVuNDhROGGSSJScUMO6gUWu5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Trimark Pictures",
            "id": 4063,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Manny Coto Productions",
            "id": 39602,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-16",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "You know what they say, if the cyborsuit fits, go kick some alien butt!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Manny Coto"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Manny Coto"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120478/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzODI4ODQ2OF5BMl5BanBnXkFtZTcwMzAzNDUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joseph Mazzello, Richard Gilliland, Corinne Bohrer | See full cast and crew »"],
      "reviews": [
         "I remember seeing the preview to \"Star Kid\" when it came out in theaters and thinking, \"Man, does that look dumb.\" Last night it came on one of the movie channels--at 10pm, strangely--so I figured I'd let it play in the background while I did some work. I ended up watching the whole thing, and guess what--I really enjoyed it. Sure, there are some inevitably silly scenes, but then, at 37, I'm way out of the target demographic. I don't want to find fault with the movie because \"it is what it is.\" The actors are all decent, the effects are better than I had expected, and best of all, it has heart. I'm building a library of movies for our kids (when we finally have some), and said movies will need to be wholesome family entertainment that I won't mind watching, too. I will definitely include \"Star Kid.\"",
         "Following along the same lines of NEVER ENDING STORY where boy gets bullied at school, has a dysfunctional family and finds the meaning of his existence through some kind of adventure. This time through an Alien robot that happens to land on Earth. Our boy enters the Robot and takes control as they create chaos and save the world from doomsday.",
         "I got to admit I enjoyed STAR KID. The story works, the characters work, the monsters work. Everything basically works for this movie. I love the Cyborsuit, he is a clever character. The whole premise almost reminds me of FLIGHT OF THE NAVIGATOR a few years back. But not much. This is a fun movie that the whole family can get into, there plenty of action, humor and warmth so even Mom can like this movie. The guys will like all the cool alien monsters both good and bad. Now some of the dialog was weak at points and I think they spent to much time on Spencer before the Cyborsuit arrived. But other then that I think this is a fun flick that you can watch over and over again. 9 STARS.",
         "Far away from Earth the Trelkins are defending their planet from the invading Broodwarriors. On earth Spencer has his own problems - too shy to talk to girls, ignored by his single parent Dad and bullied at school. When a Trelkin Phase 1 Cyber Assault Suit lands in a nearby junk yard in need of bio-organism to interface with, Spencer concedes and finds himself in control of a 8ft robot. However when a Broodwarrior comes to capture the suit to help their invasion Spencer finds himself in a situation where he must face his fears. Yes, it's a kid movie where the `geek' comes good. The difference here is that it is actually pretty good fun for kids and adults. The story mainly revolves around the relationship between the suit and Spencer. This is handled well with the usual mis-communications (the suit responds to `this is cool!' by starting to heat the internal area to 1000C) and fish out of water jokes. The chemistry between the two is good and keeps the film fun. The other element where the Broodwarrior comes in, is also great. The fight between the suit, two kids and a huge alien may not be realistic but it's handled very well and is very enjoyable. Mazello manages to play the kid without being too feeble or too annoying (a rare thing in children!) and is very good throughout. Daniels is good as the suit despite being lumbered by a mechanical voice. The only weaknesses here are the poor suit effects - it looks like it was designed to be liked by children - and the inevitable showdown is a little unlikely. Mind you, most of the fights are really good and the Broodwarrior, although clearly a man in a rubber suit, looks great and is well designed. Overall it's very entertaining. It's not clever but the humour, spectacle and sense of fun save it from being for kids only.",
         "Star Kid is a typical 'loser kid' who gets back at everyone and in the end is respected and loved giving all the nerds and losers hope that one day this could happen to them and make their lives so much easier. Wouldn't that be nice? Such is the case in this film starring no one you or me will ever hear of until a major blockbuster film comes out in which they play a minor role and eventually make their way to the top. This story has a bit of a twist to the usual tale, the 'bully' teams up with the 'loser' and they together save mankind. The humor is kiddie and not very often funny. But, the plot is well constructed and fine by my standards.",
         "I watched this with my younger brother and he loved it. We-ll, I've seen these kind of movies since 7, and I know everything what goes on family movies. Let's see, there's a kid(sort of a nerd type) who is bullied by a *bad* kid, and he meets a new friend(eg.E.T or alien). They go round'n'round the journey and at the ending, the new friend has to go home. So, the kid cries, says goodbye, hugs the friend... I've seen this kind of movies SO many times. \"Star Kid\" is no exception, but the computer graphics and the special effects were great. I give this movie: 6 out of 10.",
         "This movie is about a kid who discovers a cybersuit after seeing a meteor crash in the local junkyard. After getting to know the AI inside the suit itself, he discovers the two battling alien races, and encounters one of the Brood Warriors so seeks to destroy earth. Armed with alien technology, Earth's defense rests on the shoulders on a single kid, and with the help of some unexpected allies, he manages to claim victory over the brood warrior, and saves Earth from future invasion. I'm personally shocked to see it got such a low rating. Awesome replay value if you like to watch movies over and over again. 10/10.",
         "12-year-old Spencer Griffith (Joseph Mazzelllo)is an intelligent introveterted kid, who's life couldn't get much worse. His beloved mom died a few years earlier, his dad ignores him,his sister is a jerk to him, and he's a \"dweeb\" at school. Spencer gets picked on and beat on at school by his school nemesis a couple years older than him, \"Turbo\", and he's too shy to talk to Michelle, the cute girl in school.His only escape is reading the comic book \"Midnight Warrior\" Salvation is on its way! When Spencer is at home alone, because his boy crazy sister goes out with her boyfriend (Danny Masterson from That 70's Show), a cybersuit lands in the junkyard, which he jumps into and names cy,short for \"cybersuit\" and teaches it human language, becomes it's friend, and gets revenge on Turbo, by scaring the crap out of him! Later he learns that broodwariors have come to destroy the earth, and it's up to the runty kid and Turbo, who becomes his friend to stop them. I loved seeing Joseph Mazzello be a superhero like figure, he was my favorite young actor, and he's usually in Hard hitting dramas that are often depressing, and didn't get much attention or scene steeling moments in the action films he was in.",
         "I've read quite a few reviews for this movie and was wondering what the problem was. Some people think the main actor, Joseph Mazzello, was wasting his time with this film, But I don't think it would have worked without him. I thought it was funny and enjoyable. Maybe the beginning was a little cheesy, but overall I would recommend this to watch.",
         "Joseph Mazzello. I like him very much. That is why I wanted to see this film, even though the plot wasn't especially promising. This isn't one of Joseph's best films. It is okay but quite flawed. No less true is that, without our idol Joseph, it would have been a lot worse. He takes the whole movie alone. The movie only works because of him. As usual, Joseph is wonderful on his part. The only strange and minor side of his acting here is that he spends a great deal of time inside a cybersuit. Nothing wrong with his acting, it's just that spending such a great amount of time inside of a cybersuit is a limitation that prevents him from doing other things he could do, even though he still goes far on this role despite the limitations implied. He's got some hilarious lines and he does some pretty funny faces as well (always so convincing and expressive). The things Spencer (Joseph's character) does in this movie with Cy (the cybersuit)... I bet this is how little Bobby from 'Radio Flyer' would have liked to make his brutal stepfather \"The King\" pay for everything he did to him. It's a fun film to watch, original and imaginative. Yes, it's silly, but worthy for Joseph Mazzello's fans precisely thanks to him."
      ],
      "genres": [
         "Adventure",
         "Sci-Fi",
         "Family"
      ],
      "productionCompanies": [
         "Manny Coto Productions",
         "Trimark Pictures"
      ],
      "summaries": ["Shy seventh-grader Spencer Griffith's life changes when a meteor falls into a local junkyard and he finds a Cybersuit - an exoskeleton with AI from another galaxy. Spencer puts on the Cybersuit and becomes a different kind of person."],
      "budget": 12000000
   },
   "movielensId": 1750,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-16",
      "dvdReleaseDate": "1998-05-27",
      "directors": ["Manny Coto"],
      "runtime": 101,
      "movieId": 1750,
      "title": "Star Kid",
      "mpaa": "PG",
      "actors": [
         "Joseph Mazzello",
         "Richard Gilliland",
         "Corinne Bohrer",
         "Alex Daniels",
         "Joey Simmrin",
         "Brian Simpson",
         "Ashlee Levitch",
         "Jack McGee",
         "Danny Masterson",
         "Lauren Eckstrom",
         "Christine Weatherup",
         "Joshua Fardon",
         "Bobby Porter"
      ],
      "imdbMovieId": "0120478",
      "originalTitle": "Star Kid",
      "genres": [
         "Action",
         "Adventure",
         "Family",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["gr6CoJ6sLz8"],
      "plotSummary": "Shy seventh-grader Spencer Griffith's life changes when the meteor falls into local junkyard and he finds a Cybersuit - the wise and strong robot from another galaxy. Spencer puts Cybersuit on and becomes a different kind of guy",
      "tmdbMovieId": 54007,
      "avgRating": 2.21984,
      "releaseYear": "1997",
      "numRatings": 373,
      "posterPath": "/6oSBVuNDhROGGSSJScUMO6gUWu5.jpg"
   }
}