{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "smoking",
            "id": 919
         },
         {
            "name": "company",
            "id": 6129
         },
         {
            "name": "marijuana",
            "id": 10776
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0120693",
      "video": false,
      "title": "Half Baked",
      "recommendations": [
         9988,
         39939,
         9900,
         14577,
         14013,
         10607,
         9536,
         10471,
         12277,
         10956,
         14342,
         13411,
         11017,
         2294,
         13997,
         13166,
         2293,
         8386,
         13595,
         10634
      ],
      "backdrop_path": "/eV13Pdc86X8zGTlWqZYdqG7TpsO.jpg",
      "revenue": 17460020,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Thurgood Jenkins / Sir Smoke-a-Lot",
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66a5",
               "name": "Dave Chappelle",
               "profile_path": "/qrJzigQLQ7FwrzYBLeDwvuPN63t.jpg",
               "id": 4169,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Kenny Davis",
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66b1",
               "name": "Harland Williams",
               "profile_path": "/yAJrKIKT2OgbdMSZvpDJ3p203MY.jpg",
               "id": 16846,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Scarface",
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66a9",
               "name": "Guillermo Díaz",
               "profile_path": "/hnWjRRud2n2rDI6NbaeSIeEOMcP.jpg",
               "id": 8695,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Brian",
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66ad",
               "name": "Jim Breuer",
               "profile_path": "/hHU8uCAnhsfXSdJCMFgUy4gAGAn.jpg",
               "id": 57690,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mary Jane Potman",
               "gender": 1,
               "credit_id": "52fe44fec3a36847f80b66b5",
               "name": "Rachel True",
               "profile_path": "/cVN934tgQcX5ZMHNBFLZpw2fNCH.jpg",
               "id": 19222,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Samson Simpson",
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66ed",
               "name": "Clarence Williams III",
               "profile_path": "/hDjTPLvUNDnoA6rHDX5JrftAWZa.jpg",
               "id": 15864,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Jan",
               "gender": 1,
               "credit_id": "52fe44fec3a36847f80b66f5",
               "name": "Laura Silverman",
               "profile_path": "/b3SpiezC9HSr0CIRF0DbkWfRGNt.jpg",
               "id": 99007,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Horse Cop",
               "gender": 2,
               "credit_id": "543fd27dc3a36841090000bc",
               "name": "David Mucci",
               "profile_path": "/qD1Acd4PngkCtUl2qmPAFdlyACM.jpg",
               "id": 3714,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Enhancement Smoker",
               "gender": 2,
               "credit_id": "57027729925141607f002e35",
               "name": "Jon Stewart",
               "profile_path": "/88UHrwCXTPOrrsG2A33G4fMvN62.jpg",
               "id": 12219,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Squirrel Master",
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66f1",
               "name": "Tommy Chong",
               "profile_path": "/9wdlcc5JS36OYd05XBuo8r6F1aq.jpg",
               "id": 63208,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "I'm Only Creative When I Smoke Smoker",
               "gender": 1,
               "credit_id": "590f0b689251414e8901f516",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Scavenger Smoker",
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66e9",
               "name": "Snoop Dogg",
               "profile_path": "/qj4dRFASr1LCxFvCg8hZ73ZlO2r.jpg",
               "id": 19767,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44fec3a36847f80b66bb",
               "name": "Tamra Davis",
               "profile_path": "/6bKtaisEKoCI6NcmTkJfGRngbc4.jpg",
               "id": 57691,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66c1",
               "name": "Dave Chappelle",
               "profile_path": "/qrJzigQLQ7FwrzYBLeDwvuPN63t.jpg",
               "id": 4169,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66c7",
               "name": "Neal Brennan",
               "profile_path": "/miW4O9BD19IMPfM4f5GkkLK7lbe.jpg",
               "id": 57692,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66cd",
               "name": "Robert Simonds",
               "profile_path": "/grmMtSd8FgIy3phR0pKVGABP97f.jpg",
               "id": 29015,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66d3",
               "name": "Dave Chappelle",
               "profile_path": "/qrJzigQLQ7FwrzYBLeDwvuPN63t.jpg",
               "id": 4169,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fec3a36847f80b66d9",
               "name": "Alf Clausen",
               "profile_path": null,
               "id": 47896,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fec3a36847f80b66df",
               "name": "Steven Bernstein",
               "profile_path": null,
               "id": 6899,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fec3a36847f80b66e5",
               "name": "Don Zimmerman",
               "profile_path": null,
               "id": 15005,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 8.649975,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9490,
      "vote_count": 213,
      "budget": 8000000,
      "overview": "Three lovable party buds try to bail their friend out of jail. But just when the guys have mastered a plan, everything comes dangerously close to going up in smoke.",
      "similar": [
         634,
         13243,
         858,
         8363,
         627,
         9352,
         273481,
         319,
         10189,
         39939,
         112160,
         437557,
         9781,
         43923,
         11455,
         13168,
         100,
         141,
         14,
         948
      ],
      "original_title": "Half Baked",
      "runtime": 82,
      "poster_path": "/wSCuqYd2MXxhRE98cTH9Gz7DCGD.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Türkçe",
            "iso_639_1": "tr"
         }
      ],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1998-01-16",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "They'll do anything to save their best bud.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tamra Davis"],
      "runtime": 82,
      "synopsis": "Thurgood (Dave Chappelle), Scarface (Guillermo Diaz), Brian (Jim Breur) and Kenny (Harland Williams) are childhood friends who discover marijuana. They grow up together and live in an apartment in New York. During a smoke, they send Kenny to get food. Kenny sees a horse, and starts feeding it treats. The horse dies (it's apparently diabetic), and Kenny goes to jail. His bail is set at $1,000,000. The guys get a lift home by a hot Mary Jane Potman (Rachel True), and Thurgood falls in love. Thurgood is given some medicinal marijuana by a scientist, and the guys decide to sell more of it to raise bail money. Meanwhile, Thurgood and Mary Jane go on a date, and Thurgood promises not to smoke. He fails. The weed sales go through the roof, and many customers partake (John Stewart, Snoop Dog, Willie Nelson, Stephen Baldwin, Jeneane Garofalo, Bob Saget and others). Scarface and Brian leave their jobs to spend more time selling. Thurgood tries to stay righteous as Brian and Scarface start spending their profits. When Mary Jane breaks up with Thurgood, he promises to stop smoking. Meanwhile, Samson, a rival drug dealer, discovers the guys and trashes their apartment. He demands a meeting with the guys and tells them to pay him half their profits. The Guy on the Couch (Steven Wright) suggests they rob the lab for weed, but get caught. Thurgood offers to set up Samson. The cops allow them to get high before the deal, and the cops get high and forget to make the bust. The guys defeat Samson's hench-women, and Brian summons the spirit of Jerry Garcia (David Bluestein) to defeat Samson. The cops honor the deal to release Kenny, and Thurgood reunites with Mary Jane, giving up pot for good. The end.",
      "writers": [
         "Dave Chappelle",
         "Neal Brennan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120693/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3MjE1OTM0M15BMl5BanBnXkFtZTYwMzQwMjg4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dave Chappelle, Guillermo Díaz, Jim Breuer | See full cast and crew »"],
      "reviews": [
         "After reading several negative reviews analyzing this and other stoner movies as being stupid, mindless and lacking in plot. HELLO!!! This is a stoner movie about stoners getting stoned. Who cares about plot or social messages or that other deep crap. You want depth go see a Bergman or a Fellini film, lighten up and smoke a joint. I'm glad to see stoner comedies back in fashion after suffering through pretentious, preachy, boring 80s anti-drug dramas that are never truly grounded in reality and where the characters always either predictably OD or just simplistically kick their addiction. So rent this movie (or watch it currently on cable), fire up one and enjoy",
         "Half baked is hilarious movie to me. Its a pothead manifestation film that doesn't take it self seriously and is pretty hilarious throughout. Dave Chapelle is very funny in the lead and to me is a better lead comedy actor than the likes of Martin Lawrence and even Chris Rock. Guillermo Diaz is also very good as Scarface. Rachel True provides good eye candy and decent performance as the female lead. This is not an Oscar film, but hilarious to watch with buddies and after watching it 3 times it doesn't get old. Its a funny screenplay, decent comedic direction and good performances, worth a look for any fan of comedy, pot or cinema.. 9/10",
         "Hilarious...or is it?...flick concerning an apartment full of pot-smokers who get themselves in trouble with the law and end up going on a series of the most funny adventures ever put to celluloid. This is a gas for the \"in\" crowd. Others probably won't get all the jokes, but it is still damn entertaining. I know people who worship this movie...of course, they've more than \"smoked themselves retarded.\" If you're \"feelin it,\" then you'll laugh your @ss off, I guarantee.",
         "Half Baked is funny for all the wrong reasons. We laugh at the antics of pot smoking dumb asses because they are doing all the wrong things. But, it is hilarious nevertheless. Especially with the funny acting of Jim Breuer, Dave Chappelle and Harland Williams. Even the cameos are humorous- including Jon Stewart, Snoop Doggy Dogg, Willie Nelson, and Tommy Chong (Chong is perfect as a small role in the movie). The plot seems kind of basic, but its spiced up for laughs and for people who know what being a dope head is like. Hilarious all around. A+",
         "I had never heard of this movie 'Half Baked' until I was channel surfing cable this afternoon and came across it. While I had heard the name Dave Chapelle because of the television show recently airing, I was not familiar with two of the other three main characters. The guy playing the character in jail I have seen before. In other words, I am not up on who these people are/were. I am of the Chech and Chong 'Up in Smoke' generation of drug themed flicks. Saw them all back in the day. However, I found this movie much funnier than those ever were. Much funnier. The Scarface character was hilarious, but I found the Brian and Thurgood parts funnier and quite believable in an over-abundant way. I have read here many stating the cameo parts were the film's highlight. Not in my opinion. The main characters owned this one. As an aside from a 40 something, it is nice to see that this country(USA)has come along the road far enough whereby having a couple white guys, a black dude and a Cuban sharing a habitat together doesn't come across as contrived. The stoner parts all looked familiar to me. Funny movie.",
         "My friend, (a known pothead), lent me this film and said it was funny, i was sceptical, a. becasue he is always stoned and once had a laughing fit at a commercial, b. because he thinks WWF wrestling is the best thing on t.v, but i watched it anyway, i'm glad i did, it was hilarious, i'd highly recommend this film to anyone, unless they are specifically looking for a good plot or if they are dead against drugs, i've read some of the comments on here and they haven't been that good, maybe you have to know someone like the people in this movie to get it. 8/10",
         "This movie is hilarious. Extremely stupid, but still hilarious. And even as unbelievable as it is, there are people actually like this, heck I know several of them. The thing that makes it so funny is the fact that a bunch of funny parts in the film actually happen. So if you want to see funny realism mixed with over the top fantasy, this is your film.",
         "The trailer for this movie looked really dumb, so I didn't see it in theaters. Then I heard about Bob Saget's cameo (and what he says), and just wanting to hear Saget say that made me rent the movie. Surprisingly, it's not a bad movie. Oh, it's dumb. It's sloppy. It's *obsessed* with marijuana. But I laughed several times in the movie, and the characters are very likable. Best watched with a group of friends who don't mind drug humor.",
         "Very funny movie. Of the recent 'stoner' flicks, this is probably one of the best. (Probably second in my book to Dude Where's My car?) Ejoyable, entertaining, and weird characters. Dave Chappell is hilarious as always. There are a ton of cameos by great and well known comedians throughout the piece, all paying their homage to the great herb. I myself am not a pot smoker but laughed my rear off anyways, even if I didn't get all of the 'inside' stuff that others may refer too. Chappell is great playing several outlandish characters in the movie. The situations they get themselves into are great and even better how they get out of them. There is ample potty humor as well as pot humor to boot. Well worth the rental fee and your time.",
         "Only a true pothead could have thought up the script for HALF BAKED. Tamra Davis is an underrated director, with other cool movies like BEST MEN and his other retarded comedy masterpiece, BILLY MADISON. Dave Chapelle, Jim Breuer, Guillermo Diaz, and Harland Williams all give incredible, insane performances. The spoofs on other films like JERRY MCGUIRE, DEAD PRESIDENTS, SUPERMAN, as well as the old \"Batman\" show, are perfectly weaved in. There are numerous cameos by tons of varied people: Snoop Dogg, Jon Stewart, Janeane Garafalo, Willie Nelson, Stephen Baldwin, Clarence Williams 3, Tommy Chong, Bob Saget, and others, they're all funny in their own ways. The Guy on the Couch was the most interesting character, for mysterious reasons."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Robert Simonds Productions",
         "Universal Pictures"
      ],
      "summaries": [
         "After Kenny accidentaly kills a cop's diabetic horse by feeding it the food he purchased from a munchie run, he is put in jail and is given a 1 million dollar bail. The rest of the group must bail Kenny out before Nasty Nate gets to him. The group decides to sell marijuana that Thurgood gets through his job as a janitor at a pharmaceutical lab. They become pals with rap star Sir Smoke-A-Lot and the rivals of dealer Samson Simpson. On the side, Thurgood seeks the love of Mary Jane, an anti-pot daughter of a dealer. What follows is typical pothead behaviour with a ton of cameos. Look carefully.",
         "The story of three not so bright men who come up with a series of crazy schemes to get a friend out of jail."
      ],
      "budget": 8000000
   },
   "movielensId": 1753,
   "movielens": {
      "languages": [
         "English",
         "Türkçe"
      ],
      "releaseDate": "1998-01-16",
      "dvdReleaseDate": "1998-06-30",
      "directors": ["Tamra Davis"],
      "runtime": 82,
      "movieId": 1753,
      "title": "Half Baked",
      "mpaa": "R",
      "actors": [
         "Dave Chappelle",
         "Harland Williams",
         "Guillermo Díaz",
         "Jim Breuer",
         "Rachel True",
         "Clarence Williams III",
         "Laura Silverman",
         "David Mucci",
         "Jon Stewart",
         "Tommy Chong",
         "Janeane Garofalo",
         "Snoop Dogg"
      ],
      "imdbMovieId": "0120693",
      "originalTitle": "Half Baked",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["My5wh3vr-_Q"],
      "plotSummary": "Three lovable party buds try to bail their friend out of jail. But just when the guys have mastered a plan, everything comes dangerously close to going up in smoke.",
      "tmdbMovieId": 9490,
      "avgRating": 3.27738,
      "releaseYear": "1998",
      "numRatings": 2812,
      "posterPath": "/wSCuqYd2MXxhRE98cTH9Gz7DCGD.jpg"
   }
}