{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "bar",
            "id": 1010
         },
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "surreal",
            "id": 3307
         },
         {
            "name": "dangerous",
            "id": 3851
         },
         {
            "name": "beer",
            "id": 4552
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "cigarette smoking",
            "id": 11732
         },
         {
            "name": "hong kong",
            "id": 12354
         },
         {
            "name": "drifter",
            "id": 13017
         },
         {
            "name": "bullet wound",
            "id": 14677
         },
         {
            "name": "city",
            "id": 14828
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "mysterious",
            "id": 197582
         },
         {
            "name": "detached",
            "id": 201125
         }
      ],
      "imdb_id": "tt0112913",
      "video": false,
      "title": "Fallen Angels",
      "recommendations": [
         11104,
         18311,
         18329,
         24163,
         844,
         40751,
         843,
         45706,
         16672,
         5910,
         56616,
         36265,
         17905,
         30959,
         47060,
         31217,
         31589,
         11710,
         43118,
         12493
      ],
      "backdrop_path": "/y67gSjT35QJEn3lfcfw3BZHBnYl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Wong Chi-Ming",
               "gender": 2,
               "credit_id": "52fe44139251416c750280e1",
               "name": "Leon Lai",
               "profile_path": "/uQob8ztWDmUL0GVaTJz9WfbfIcw.jpg",
               "id": 66761,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Killer's Agent",
               "gender": 0,
               "credit_id": "52fe44139251416c750280e5",
               "name": "Michelle Reis",
               "profile_path": "/sNtAs2OB4zJ0MiCJFCrG3U1DkD8.jpg",
               "id": 56816,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "He Zhiwu",
               "gender": 2,
               "credit_id": "52fe44139251416c750280e9",
               "name": "Takeshi Kaneshiro",
               "profile_path": "/ci0hluuIRGFGqSDp2kkqXczvywD.jpg",
               "id": 43661,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Charlie",
               "gender": 1,
               "credit_id": "52fe44139251416c750280ed",
               "name": "Charlie Yeung",
               "profile_path": "/li5TvQ8ySF7xmhEvUCZUU45nBpq.jpg",
               "id": 66762,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Blondie",
               "gender": 0,
               "credit_id": "52fe44139251416c7502811b",
               "name": "Karen Mok",
               "profile_path": "/hfxRryhoRtT05ukFa7ooSM8pDhN.jpg",
               "id": 57831,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Wu's father",
               "gender": 0,
               "credit_id": "54a0a620925141190d000293",
               "name": "Chan Man-Lei",
               "profile_path": null,
               "id": 12464,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Sato",
               "gender": 0,
               "credit_id": "57375901925141136e004411",
               "name": "Toru Saito",
               "profile_path": null,
               "id": 1619797,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Ah Hoi",
               "gender": 0,
               "credit_id": "5737590cc3a36840ec00263a",
               "name": "Benz Kong",
               "profile_path": "/2U2vzX4Ce6rRzJm10S3HgBHSG2M.jpg",
               "id": 1191766,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Forced to eat ice cream",
               "gender": 0,
               "credit_id": "54a0a61592514121270027ae",
               "name": "Chan Fai-Hung",
               "profile_path": null,
               "id": 999460,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Forced to buy vegetable",
               "gender": 0,
               "credit_id": "5734c3929251417b4d0000ce",
               "name": "Kwan Lee-Na",
               "profile_path": null,
               "id": 119877,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Forced to have clothes washed",
               "gender": 0,
               "credit_id": "57375947c3a3686f80000082",
               "name": "Wu Yuk-Ho",
               "profile_path": null,
               "id": 1619798,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44139251416c750280f3",
               "name": "Jeffrey Lau",
               "profile_path": "/uyHSy9QyXb9pwZPG2Rd4jI7fPIV.jpg",
               "id": 57617,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44139251416c750280f9",
               "name": "Jacky Pang Yee Wah",
               "profile_path": null,
               "id": 20475,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44139251416c750280ff",
               "name": "Roel A. García",
               "profile_path": null,
               "id": 68029,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44139251416c75028105",
               "name": "Christopher Doyle",
               "profile_path": "/u7xRErdN6ya9qzOG8PVa2QshZFC.jpg",
               "id": 1357,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44139251416c7502810b",
               "name": "Wong Ming-Lam",
               "profile_path": null,
               "id": 68649,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44139251416c75028111",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44139251416c75028117",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44139251416c75028121",
               "name": "William Chang",
               "profile_path": "/u1rSUvhCQSo0z7bPaDoi1pyntFb.jpg",
               "id": 45818,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44139251416c75028127",
               "name": "Frankie Chan Fan-Kei",
               "profile_path": "/jQ2wfYUiG5IGEB1eC5BmNxayBCJ.jpg",
               "id": 1011224,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "532ec22b9251413a850031ee",
               "name": "Mark Lee Ping-Bing",
               "profile_path": "/onbu25VDFwNshSdrgqQtFKA2XSb.jpg",
               "id": 232804,
               "department": "Camera",
               "job": "Camera Operator"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.106148,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 11220,
      "vote_count": 142,
      "budget": 0,
      "overview": "In this bifurcated crime narrative, a disillusioned hitman attempts to escape from his violent lifestyle against the wishes of his partner, who is infatuated with him, and an eccentric mute repeatedly encounters, then subsequently falls for, a depressed woman looking for the prostitute who supposedly stole her ex-boyfriend's affections.",
      "similar": [
         249070,
         682,
         390043,
         1620,
         1538,
         1903,
         10835,
         1948,
         101,
         27582,
         156022,
         154400,
         245891,
         667,
         787,
         336843,
         122906,
         9472,
         278924,
         1923
      ],
      "original_title": "墮落天使",
      "runtime": 96,
      "poster_path": "/tE2UnYtiVQddbZ4n1rM7ixQynsq.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Chan Ye-Cheng",
            "id": 22615,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jet Tone Production",
            "id": 540,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-06",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Kar Wai Wong"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Kar Wai Wong"],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0112913/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3NzI0MzQ3M15BMl5BanBnXkFtZTcwMzA0MDMzNA@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Leon Lai, Michelle Reis, Takeshi Kaneshiro | See full cast and crew »"],
      "reviews": [
         "The following was excerpted from a wonderful essay by Momus, and nicely highlights the themes that this film is all about (which are totally missed by the complainers here who called it boring). \"Isolated, impulsive heroes, nocturnal locations, cool music... a violent world in which sensitive people nevertheless continue to dream romantic dreams indifferent to the surrounding carnage. In 'Fallen Angels' this happens quite literally: Agent girl Michelle Reis moons and munches dreamily in the wideangle foreground while in the background a triad fight happens in slow motion. It's the Walkman syndrome, a thing you notice when you visit the orient. The bigger the population, the more busy the city, the more people develop the ability to retreat into an inner isolation, the space of a snackbar, a tatami mat, a computer screen, a song playing on headphones. In the next century we will all live like this. Wong Kar Wei maps out a perfectly postmodern, perfectly oriental psychogeography of small, busy places which nevertheless become the spawning ground of ultra-private obsessions and infatuations. Love in his films is more likely to be expressed by someone breaking into your apartment and tidying it, or by masturbation, than a healthy clinch. It is the mindset of ultrafetish, and cinematographer Chris Doyle puts it into images: a clear plastic sheath worn over a Chinese silk dress, a mute riding the corpse of a pig in an abattoir, a blow up sex doll with its head stuck in an elevator door, being kicked insanely by a couple of ultra-romantic maniacs. And there is the real star, the traum-city itself. Corridors, subways, neon, time lapse, travelators and low flying jets, trains, shopping arcades, Chung King Mansions stuffed to the gullets with sullen, sweating people cooled by antique electric fans, the scheming tattooed triads, outbursts of random violence, warehouses, chopping knives, video cameras, motorbikes speeding through tunnels, the multi-racial hand in hand with the super-commercial... Hong Kong insinuates itself into our imaginations as the ubertraumstadt, the place of ultimate nightmare and ultimate romance, where beauty is all the more poignant for its dark, cheap, pitiless setting and dreams are all the more necessary.\"",
         "Wong Kar-wai's Fallen Angels dives headfirst into the cultural alienation and milennial dread of modern-day Hong Kong. The film has a distinctly detached feeling about it that is certainly close to what its characters must feel. Some scenes are hypnotic and dreamlike, while others seem brutally real. The film's characters always seem to be wandering, or, perhaps, simply going through the motions of life. The voice-overs - which Wong uses as effectively as any director since the heyday of Terrence Malick - effectively add an extra dimension to the characters. The ending of Fallen Angels is one of the most beautiful, poetic, and true ever filmed. While this film's predecessor, Wong's Chungking Express is a wonderful, exceptional movie, Fallen Angels is ultimately superior - a masterpiece that Wong only surpassed with his last film, the astonishing In the Mood for Love. Still, while In the Mood for Love may be Wong's best film to date, Fallen Angels remains (as it probably always will) the quintessential Wong Kar-wai picture in that it perfectly embodies the bold, Godardian, recklessness that the name Wong Kar-wai immediately brings to mind. 10/10",
         "Wow. Fallen Angels really surprised me. I rarely read reviews or synopses of movies before viewing. So, I expected to see classic Hong Kong shoot 'em up gangsta film. Instead, I was intrigued and stunned by this incredible movie. The characters are the focus as they each tell their stories. Literally, the title \"Fallen Angels\" gives you an idea of their plight. The film doesn't glorify the criminal lifestyle and shows aspects like isolation and loneliness. It's funny how the killer even tries to imagine how happy he'd be trying to live a \"normal\" life working a 9 to 5. Unfortunately, life's placed him in his predicament and must deal with the ramifications of it. Add to it his agent (played by knockout Michelle Reis) who is really enigmatic in this one. Her scene at the jukebox is one that displays the pain, agony, and confusion that she is going through. Plus, that song is like joy and torture for her at the same time! Then, there is He. A man of few words who's story may be one of the most moving. Who could've thought a video could be so powerful and sentimental? This may be one of the most strangest, complex, yet fascinating characters I've ever onscreen. His silent nature, line of work (which is the oddest form of coercion I've ever seen!), and his struggles are really played well by Takeshi Kaneshiro, especially his scenes with his dad. Wong Kar Wai's direction really makes the film. I really loved the dark, trippy music soundtrack which helped glaze on a slick, surreal coating. It sounds like something that would've been produced by Tricky, Massive Attack, or Portishead. While this may not have a bloody, high body count, the story told here makes this such a worthwhile movie and can be appreciated after repeated viewings.",
         "Absolutely brilliant. When I first saw Chung King Express, it quickly became one of my favorite movies. It still is, but Fallen Angels is even better. It encompasses so much. There is such a potent mix of action, drama, humor, love, music etc. that it overwhelmed me and left me in a state not unlike post-orgasmic ecstasy. Since I've seen it four times now and the effect hasn't been diminished one iota, I'm convinced that this one oughta go down in the record books. My extreme gratitude to Wong Kar Wai for creating this masterpiece.",
         "I already wrote a comment on this one some years ago. A couple of months ago I ordered the Brand New digitally cleaned up Australian DVD (the French are also re-releasing, as part of a Kar-Wai box), and people, would you believe it! Despite having seen my VHS until it decomposed, reincarnated and went to live in a buddhist monastery for videotapes broken out of the circle of continuous play, it was a revelation. But I'm drifting off here. The thing is simple: This film is superb; the final 5 minutes are among the most gripping things ever translated into some perceptible entity. It would already suffice to make it a masterpiece. The rest of the film is bonuses bonuses. Don't miss, please.",
         "One thing is for sure - it is everything you have seen before and nothing like anything you have seen before. As a Wong Kar-wai junkie, I have to admit - it is getting harder and harder to find a favorite - Fallen Angels is among the top three. In one sense I really loved Fallen Angels because it is full of the same urban angst brought up in Chungking Express. There is something utterly and strikingly gorgeous about Wong Kar-Wai's movies. The mise-en-scene and backdrops his characters inhabit in that give each scene a particular almost brooding feeling. Wong Kar-Wai's are lost and lonely in a world that is dark and full of despair. Fallen Angels is no different. Fallen Angels' Hong Kong is alive in the evenings. One could argue that the cinematography captures a dreamlike state, pure urban neon, and erotic. In Fallen Angels we travel the gritty back alleys (reminiscent of Chunking Express) into underworld dives, dreary dive bars juxtaposed against a brightly-lit McDonalds. I have to say this... Wong Kar-wai does somewhat put me off with his product placement - but we have to finance our projects somehow, I guess. Leon Lai's is a lazy hired killer. His portrayal, it can be argues is weighty and conjures up a sense of gaudy (almost caddy) persona. I am reminded of Yuddy in Days of Being Wild. Lai is wonderful as a contradiction of apathy and poetry. Lai plays it with a languid air. Every move is deliberate - smooth. Conversely, Michelle Reis' is his doppelganger - his manager. She is obsessed with him, becomes emotionally attached to him. I would argue that a sense of betrayal set the stage for the hit man's final demise. A nighttime ride in the back of a motorcycle with He Zhiwu (Takeshi Kaneshiro) leads me wonder is she has comes undone. Love though, and its many forms of cruelty is a recurring theme with Wong Kar-wai. Oh that sweet betrayal... He Zhiwu is a potent character. The relationship He Zhiwu develops with his father is proof positive that even in the broken world of dysfunctionality there resides a lotus from the marshes. The videotape sessions, at first almost humorous, forms yet another center of love shattered - sometimes we need to really treasure what we have lest it slip by so suddenly... he Zhiwu is a symbol of the lyricism of youth. One has to admit, even after Chunking Express, Fallen Angels is different from any Hong Kong movie. Driven by inner monologue (much like the later much acclaimed The Follow from The Hire series) it draws one in. The languid tone and deeply erotic tale is one that will stand the test of time. Fallen Angels according to Teo takes over from where Chungking Express leaves of. I argue that it brought Chungking Express to a whole new realm. Fallen Angels is Chungking Express on steroids. Miguel Llora",
         "Wong Kar Wai's films are an acquired taste; either you like most or all or else you don't like them at all. Having said that, this is his best film and one of the greatest and most important films to come out of Hong Kong. It moves along at a faster pace (though still a little slow) than his other movies. Like his other movies, photography work is excellent and very stylish. He give you the feeling of being in Hong Kong without having to catch the plane. Fallen Angels features the story of a hitman as well as other restless people in HK. Leon Lai Ming is very good in this movie; his acting has come a long way since Wicked City. Overall, a 10 out of 10.",
         "Almost manga-like in camera style and story telling (I mean manga as in Akira and Ghost in The Shell). Very colorfull yet dark, explicit yet tender, soft and violent. Your sucked in by the nostrils, visually shaken about and taken for a very exciting trip into hyper-subreality. The daylight at the end has the same effect as the dishcleaning and lights on after a very good party. Very sobering. The movie leaves you with the feeling of having had a vigorous massage and wanting more. More Wong Kar-Wai.",
         "Spoilers herein. Fallen angels are those with extraordinary gifts of life who, through some accident, find themselves in incongruously irrational worlds. This filmmaker is extraordinary in his commitment to not just show us some events in such lives, but to bring the very experience to us. Here, we ourselves are simultaneously turned into angels by being given higher powers of observation than normal. We are thrust into an unfamiliar universe, one which sweeps us in unexpected ways. The blessing of hyperperception is where the real talent and skill is. Here we have four interweaving narratives. These are not just stories in the Andersen or Altman tradition, where we just passively observe. These are unconnected strong desires that we are roped into sharing. Each of these characters is less someone to watch than a vehicle in a thrill ride we inhabit. That this man is making films today enriches my visual imagination immensely. Welles, Kurosawa and Tarkovsky were able to largely invent. Or rather, they were reinventing theater in the new medium of film. Wong has the luxury of reinventing film, reacting to all the expectations we have when we enter the theater. So he can orchestrate cameras that linger too long, that slip off the frame, that switch color or resolution, that dice the pace in jarring ways. Cameras that go where no one expects or wants, and all this registers on us. `In the Mood for Love' exploited a single technique of the camera that couldn't stay pointed. It wandered as the characters wandered. The lack of deliberation is massively effective. In this film we have something more ambitious, a camera that slowly enters the film and becomes its own narrator. This is the most amazing of notions. Many self-referential films have been made but in this case the effect is unique because the whole project is about cameras not being where they are supposed to be. It is a camera operated by a voiceless man, someone whose `job' is to appropriate the work of others, someone who one he gets a customer it becomes his victim for excessive consumption of whatever is offered. It is, of course Wong. And this film is our birthday gift before we leave the world of obfuscation for another. I am tentatively making this a three, but may elevate it to a four on reseeing all his work. Ted's Evaluation -- 3 of 4: Worth watching.",
         "This is probably THE coolest film ever made. It has a real trippy soundtrack and is shot like no other film has been made before. The characters, such as killer and his partner, cruise around with an \"I don,t give a fudge\" attitude which works really well when Wong Kar Wai switches the pace into slow mo. With Wong Kar Wai he really shows you that even with a small budget film you can still match blows with the 100 million dollar films such as the matrix with only your imagination. \"Wong Kar Wai is the coolest film maker on the planet\" Quentin Tarantino"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Chan Ye-Cheng",
         "Jet Tone Production"
      ],
      "summaries": [
         "A disillusioned killer embarks on his last hit but first he has to overcome his affections for his cool, detached partner. Thinking it's dangerous and improper to become involved with a colleague he sets out to find a surrogate for his affections. Against the sordid and surreal urban nightscape (set in contemporary Hong Kong), he crosses path with a strange drifter looking for her mysterious ex-boyfriend and an amusing mute trying to get the world's attention in his own unconventional ways.",
         "Fallen Angels is the story of a professional killer in Hong Kong. It follows the in's and out's of his job and his partner in crime who he rarely sees. After 3 years of working together he wants out. Another sub-plot is about a mute (caused by eating expired cans of pineapples for a month, after he was heart broken) who breaks into restaurants, cafés and ice-cream trucks at night and forces people to buy his goods!"
      ],
      "budget": 0
   },
   "movielensId": 1757,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "普通话"
      ],
      "releaseDate": "1995-09-06",
      "dvdReleaseDate": "1998-09-22",
      "directors": ["Wong Kar-wai"],
      "runtime": 96,
      "movieId": 1757,
      "title": "Fallen Angels",
      "mpaa": null,
      "actors": [
         "Leon Lai",
         "Michelle Reis",
         "Takeshi Kaneshiro",
         "Charlie Yeung",
         "Karen Mok",
         "Chan Man-Lei",
         "Toru Saito",
         "Benz Kong",
         "Chan Fai-Hung",
         "Kwan Lee-Na",
         "Wu Yuk-Ho"
      ],
      "imdbMovieId": "0112913",
      "originalTitle": "墮落天使",
      "genres": [
         "Drama",
         "Action",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "GKgcF5Dg9kk",
         "KZda7nWftQI"
      ],
      "plotSummary": "A disillusioned killer embarks on his last hit but first he has to overcome his affections for his cool, detached partner. Thinking it's dangerous and improper to become involved with a colleague, he sets out to find a surrogate for his affections. Against the sordid and surreal urban nightscape, he crosses path with a strange drifter looking for her mysterious ex-boyfriend and an amusing mute trying to get the world's attention in his own unconventional ways.",
      "tmdbMovieId": 11220,
      "avgRating": 3.85424,
      "releaseYear": "1995",
      "numRatings": 590,
      "posterPath": "/tE2UnYtiVQddbZ4n1rM7ixQynsq.jpg"
   }
}