{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0128690",
      "video": false,
      "title": "Tainted",
      "recommendations": [
         59738,
         138097,
         115258,
         36217,
         121390,
         109473,
         69852,
         67729,
         122408,
         85567,
         111753,
         235746,
         99424,
         87905,
         26230,
         30996,
         92320,
         54133,
         36837,
         54132
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Slain",
               "gender": 0,
               "credit_id": "5446328cc3a3683e0500a02a",
               "name": "Jason Brouwer",
               "profile_path": null,
               "id": 1376291,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Stockboy",
               "gender": 0,
               "credit_id": "54463297c3a36836d4001707",
               "name": "T.J. Timon",
               "profile_path": null,
               "id": 1376292,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "5446327a0e0a26632d00a422",
            "name": "Brian Evans",
            "profile_path": null,
            "id": 138653,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.167017,
      "production_countries": [],
      "id": 281289,
      "vote_count": 3,
      "budget": 0,
      "overview": "A sarcastic comedy thriller about a vampire who sets out to infect the blood of a hospital and the twenty-something slackers who set out to stop him.",
      "similar": [],
      "original_title": "Tainted",
      "runtime": 108,
      "poster_path": "/px4IPRjwrYaDEXSr7TzEOfxXsRk.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-05-18",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "Dead End Jobs, A Drunk Ex-girlfriend, Psychotic Vampires: ONE HELL OF A NIGHT!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brian Evans"],
      "runtime": 108,
      "synopsis": "A man walks into a grocery store and notices another man looking at the red meat in the display case. Man 1 follows man 2, knocks him out, binds his eyes and mouth with duct tape, chains him to the top of his car, drains a quart of his blood into a bottle, drives a stake through his heart, and dumps the body into his trunk. Meanwhile, Ryan [Greg James] and J.T. [Sean Farley], best friends since grade school, have tickets to see Bladerunner after the closing of the video store where they work. The only problem is that J.T.'s car is in the shop, Ryan doesn't drive, and their driving buddy Mike just broke his leg, so they ask the new guy Alex [Dusan Cechvala] whether he'd be able to give them a lift. No problem...until Alex's radiator begins to overheat and the car stalls. They walk back a few blocks to a gas station, but it's closing and the attendant refuses to sell them any antifreeze. Alex suggests that they might get help from his ex-girlfriend Adia [Tina Kapousis], who lives a few blocks away. While walking there, however, they are attacked by two punks, one of whom stabs Alex in the stomach. As the punk gloats and Ryan and J.T. fear for their lives, Alex suddenly rises up and kills both punks by biting them in the necks. It is thus that Ryan and J.T. discover that Alex is a vampire. So is Adia. She's also an alcoholic, and she has taken up with a new guy, a vampire named Slain [Jason Bouwer], who works in a blood bank and who brings \"dinner\" every night. Slain is not there, so Adia loans Slain's car to Alex. While they drive to an open gas station to get antifreeze, the trunk on Slain's car comes loose. Alex stops the car to close it and finds in the trunk a body and an icechest of blood. Worse yet, the stake through the body's heart tells Alex that it belongs to a vampire. Furthermore, the blood in the bottles, all marked by blood type, is vampire blood (Alex can tell by the smell). It appears that the vampire Slain is killing other vampires for their blood. But why? More important at the moment is the fact that Slain is living with Adia, a vampire vampire-killer living with a vampire, so Alex hurriedly telephones Adia and warns her to get out of the house. Unfortunately, Slain has already come home and, knowing that Adia has loaned out his car, rewards her with a stake through the heart. Alex arrives and tries to revive Adia, but it's too late. As Alex is rifling through Adia's room, looking for information about Slain, he comes upon a list of names -- four vampires, three of whom are dead, and their blood types. Only Marcus Thoel remains. Assuming that Marcus Thoel is Slain's next target, the boys go looking for him. First stop is the local vamp bar (\"Bram Stoker's 'Cheers!'\") where Alex visits with Clyde [ Eric Jaan], the gay vampire who turned him. Clyde has not heard of Slain, but he is able to provide Marcus' address. When they arrive at Marcus' house, however, they find that Slain has already been there. Marcus is dead. Even worse, he was tortured before he was staked. Alex concludes that it was Marcus who turned Slain and that this killing was done out of revenge as much as for Marcus' type O blood. Suddenly, it all fits together in Alex's mind. Slain is a new vampire who is in pain because of being turned, so he is collecting blood from vampires in order to contaminate the blood at the blood bank and turn all recipients into vampires so that they can also feel his pain, just like an AIDS victim who goes around giving the virus to others. After figuring out at which blood bank Slain works, the boys head over. They get there just as Slain is tainting human blood with drops of vampire blood. Big fight in which Alex succeeds in staking Slain. Slain's last words: \"Thank you.\" Since it's only a little after 1 am, the boys head off to the theater. [Original Synopsis by bj_kuehl.]",
      "writers": ["Sean Farley"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0128690/",
      "coverLink": null,
      "actors": ["Stars: Jason Brouwer, T.J. Timon, Ronnie Walsh | See full cast and crew »"],
      "reviews": [
         "Seeing as how this was included as part of a Troma Triple B Header disc, I didn't expect a movie that was actually funny without being gross, had a well thought out storyline, and looked more to Linklater and Tarantino's talking bits than Fulci. Yes, it had it's moments of off acting (mainly from extras or bit characters) and is obviously an amateur effort, but it's an amateur effort made with love and care. After an opening sequence with such shaky camera work that I got nauseous and contemplated turning it off, things actually got much better really quickly. One of those \"it's the journey, not the destination\" films with more emphasis on the conversations of the guys than what they were actually trying to accomplish. Strangely reminded me of hanging out with some of my friends. I can see where with a bigger budget, better equipment, and more time, this could have really been something. As it is, I see lots of potential for development and I do not want my 105 minutes back, they were spent happily. The team who made the film just needs to not look to other's so much stylistically and go with their gut instincts and follow their own muse.",
         "The movie has some excess footage, but you have a fast-forward button, do you not? Other than that, this is an independent triumph of a film, taking everything we know about the vampire legend and twisting it into a truly intelligent and well-written film about, well, as the tagline states it, \"ONE HELL OF A NIGHT!\" Successful in a local run, this film was picked up by the tremendously trashy Troma team, and this may throw off some die-hard film buffs, but if people really know about this hilarious indie gem, they'll die to see it.",
         "I was looking for a good, cheap, vampire movie that was locally shot (in the Detroit area). Tainted (1998) seemed to be just the ticket to cap our Halloween celebration. While the movie opens with an exciting and well-orchestrated action sequence, the next half-hour of character development plays like the outtakes from Slackers. Don't get me wrong, I actually liked the humorous riffs from Slackers. However, this writer simply misfires every joke. Imagine a room full of 14-year old boys doing improvisational humor. Maybe the director was channeling the ghost of Ed Wood here, certainly the dialog could have been ghost written by Ed himself.",
         "This movie was horrid. Don't get me wrong, I love a lot of bad movies, and even have a few that I watch again and again. But this one really had few redeeming qualities. I got that we were supposed to see that the characters were pretentious, and thought a lot of themselves and their own opinions. Possibly we were even supposed to figure out that they were trying to sound impressive while having little substance to back it up. But I'm somehow doubt it. The entire film ended up reading like the characters themselves. The director seemed to have an exceedingly high opinion of his own dialog, but lacked the skill or insight to carry it off. And like another commenter stated, imagine a group of 14 year old boys winging it, and you've closely nailed the dialog level. The entire film consists of rapid-fire trite and bitchy dialog framing a fairly simple vampire story. While there are a few funny lines throughout the film, they didn't make up for the poor acting, horrid writing and plot holes the size of steamships. The 'vampire plot' had some interesting potential but didn't really explore any of the areas it touched on.",
         "My dear lord! Can movies possible get any worse than this. I am from Michigan and I can take pride in local folks making good, but I mean how can this be taken with pride? You know what I think? I think that someone here wanted to take a chance to rip-off Sean-Michael's \"Friday Night\" script. But that's just me. The acting is horrendous. The writing worse. The direction is so bad I wanted to kill myself halfway through it, no scratch that... I wanted to die before the opening scene was even done. My question is this, who would release this thing? Oh yeah, Troma. That makes sense. Well, I hate myself for paying the dollar to rent this. I give it a 1 only because I can't give it a zero.",
         "yes, i love indie films. yes, i respect anyone who has the guts and drive to make a film. and yes, i love my hometown of metro detroit. but after seeing 'tainted,' i'm ashamed that this is one of few films representative of my fair hometown. not only are we tortured endlessly with weak and horribly acted dialog (not even bad enough to be funny) and inside jokes, we have to wait the duration of a baseball game to see some actual gore or even a small piece of what might be an actual story. this was obviously made for the filmmakers' friends and selected 'inside' folks who may or may not recognise the 'cool' places around town they 'filmed.' the folks at Troma must have been conned into distributing this nonsensical bore as not a single soul (not friends with the director) would get past the first 15 minutes without crying with embarrassment felt for everyone involved. the 'positive' reviews given for this are undoubtedly from those with vested interests in this idiocy that even 'Mystery Science Theatre 3000' would adamantly reject. no story, no production value, no interest whatsoever and very little gore equals one of the least interesting 'films' ever made. budget $35,000?? it all went toward pizza for the cast and crew for a job miserably done. some words to get used to- 'let's get another take' as for me and all the others about to rent this 'film' graciously given to all video stores who would accept for free publicity- don't let the name 'Troma' mislead you, and please take a stand against drastically careless filmmaking and just ignore the box when you see it in your local store. or, for the new filmmaker, rent it and use it as a 'what not to do' guide or a really good self-esteem boost that this nonsense ever got picked up by the beloved Troma. YOU ARE WARNED!",
         "I know it is an indie film, I know it is a local film, but starting May 11th 1999 it won't be! The video release is finally happening, thanks are due to Troma for that. This film is wonderful, and definitely worth seeing. Shot on roughly a $35,000 budget, I was astounded when I first saw it. This film earns my highest commendations, and I order you to see it! Bug your local video stores, and when they won't say yes, bug them until they do. Personally, I'm buying my copy! I've had the opportunity to talk with the 'Am I Wrong?' Production team on several occasions, and to make things even better, they are wonderful people to be around. Rating: 9 out 10, losing one point only because of its necessary budget restrictions. The script, acting, and score are all great!"
      ],
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "productionCompanies": ["'Am I Wrong?' Productions"],
      "summaries": ["A sarcastic comedy thriller about a vampire who sets out to infect the blood of a hospital and the twenty-something slackers who set out to stop him."],
      "budget": 30000
   },
   "movielensId": 1764,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-05-18",
      "dvdReleaseDate": null,
      "directors": ["Brian Evans"],
      "runtime": 108,
      "movieId": 1764,
      "title": "Tainted",
      "mpaa": "",
      "actors": [
         "Jason Brouwer",
         "T.J. Timon"
      ],
      "imdbMovieId": "0128690",
      "originalTitle": "Tainted",
      "genres": [
         "Thriller",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A sarcastic comedy thriller about a vampire who sets out to infect the blood of a hospital and the twenty-something slackers who set out to stop him.",
      "tmdbMovieId": 281289,
      "avgRating": 2.65,
      "releaseYear": "1998",
      "numRatings": 20,
      "posterPath": "/px4IPRjwrYaDEXSr7TzEOfxXsRk.jpg"
   }
}