{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0119734",
      "video": false,
      "title": "Music from Another Room",
      "recommendations": [
         136984,
         397931,
         5248,
         70054,
         86913,
         36790,
         56919,
         44857,
         43079,
         64335,
         52147,
         50737,
         256546,
         34529,
         86531,
         266425,
         43664,
         268108,
         30767,
         80961
      ],
      "backdrop_path": "/zRsEgXyoNCa16IOphTbywY33WWR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Danny Kowalski",
               "gender": 2,
               "credit_id": "52fe47189251416c91069d71",
               "name": "Jude Law",
               "profile_path": "/4077Cyuo1mw53u1gNjLyQkqeZN0.jpg",
               "id": 9642,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nina Swan",
               "gender": 1,
               "credit_id": "52fe47189251416c91069d75",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Anna Swan",
               "gender": 1,
               "credit_id": "52fe47189251416c91069d79",
               "name": "Gretchen Mol",
               "profile_path": "/46mBoe7xf3pJgQLEYNw6Msniq3r.jpg",
               "id": 15370,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Karen Swan",
               "gender": 1,
               "credit_id": "52fe47189251416c91069d7d",
               "name": "Martha Plimpton",
               "profile_path": "/7lU1kci6OZMwZk5Kxfnz0u8B5l5.jpg",
               "id": 17495,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Grace Swan",
               "gender": 1,
               "credit_id": "52fe47189251416c91069d81",
               "name": "Brenda Blethyn",
               "profile_path": "/wp0tIM7dGDmc9TOrm9fgL7JkzQQ.jpg",
               "id": 4154,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Eric",
               "gender": 2,
               "credit_id": "52fe47189251416c91069d85",
               "name": "Jon Tenney",
               "profile_path": "/fiG1bW6DX1szsRDPIYjfIKPQ0kV.jpg",
               "id": 4602,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe47189251416c91069d89",
               "name": "Jeremy Piven",
               "profile_path": "/qtho4ZUcValnVvscTGgyWfUr4VP.jpg",
               "id": 12799,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Jesus",
               "gender": 2,
               "credit_id": "52fe47189251416c91069d8d",
               "name": "Vincent Laresca",
               "profile_path": "/1uONrRIcJqQCx7tfQppuqjfJIzA.jpg",
               "id": 1983,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Irene Swan",
               "gender": 1,
               "credit_id": "52fe47189251416c91069d91",
               "name": "Jane Adams",
               "profile_path": "/HbQfL01xmV1psnh0WvldIBzDg3.jpg",
               "id": 209,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Richard Swan",
               "gender": 2,
               "credit_id": "52fe47189251416c91069d95",
               "name": "Bruce Jarchow",
               "profile_path": null,
               "id": 53005,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Hank Kowalski",
               "gender": 2,
               "credit_id": "52fe47189251416c91069d99",
               "name": "Kevin Kilner",
               "profile_path": "/v2rYXeRrTkPI7hBk2uWDkYOPoxJ.jpg",
               "id": 114021,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Louis Klammer",
               "gender": 2,
               "credit_id": "52fe47189251416c91069d9d",
               "name": "Jan Rubeš",
               "profile_path": "/hrzcIOLEMhcnYiRbNYoqGJD1AwK.jpg",
               "id": 37422,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Clara Klammer",
               "gender": 1,
               "credit_id": "52fe47189251416c91069da1",
               "name": "Judith Malina",
               "profile_path": "/qOCwxL5hYhxdl0J1VJDh62mjLR6.jpg",
               "id": 119864,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Young Karen",
               "gender": 1,
               "credit_id": "559cc27bc3a3681bf0000d39",
               "name": "Sara Paxton",
               "profile_path": "/bJjI9jEmvk5Mmyo7LKKqkIK2mbr.jpg",
               "id": 60072,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47189251416c91069da7",
               "name": "Charlie Peters",
               "profile_path": null,
               "id": 65401,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47189251416c91069dad",
               "name": "Charlie Peters",
               "profile_path": null,
               "id": 65401,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47189251416c91069db3",
               "name": "Charlie Peters",
               "profile_path": null,
               "id": 65401,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.251752,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39424,
      "vote_count": 19,
      "budget": 0,
      "overview": "Music From Another Room is a romantic comedy that follows the exploits of Danny, a young man who grew up believing he was destined to marry the girl he helped deliver as a five year old boy when his neighbor went into emergency labor. Twenty-five years later, Danny returns to his hometown and finds the irresistible Anna Swann but she finds it easy to resist him since she is already engaged to dreamboat Eric, a very practical match. In pursuit of Anna, Danny finds himself entangled with each of the eccentric Swanns including blind, sheltered Nina, cynical sister Karen, big brother Bill and dramatic mother Grace as he fights to prove that fate should never be messed with and passion should never be practical.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         97630,
         101,
         205,
         141,
         339692
      ],
      "original_title": "Music from Another Room",
      "runtime": 104,
      "poster_path": "/gKjyiaUMDz4ElHJdcWFzdRBPK5I.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-04-24",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Their romance began the day she was born.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charlie Peters"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["Charlie Peters"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119734/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNjc1NTYxNl5BMl5BanBnXkFtZTcwNTQ5MjYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jude Law, Jennifer Tilly, Gretchen Mol | See full cast and crew »"],
      "reviews": [
         "Music From Another Room is the story of Danny (Jude Law), returning to his US hometown after spending over 20 years in England with his father, who has now passed away. By coincidence, he runs into the Swan family, who his father and himself used to be acquainted with, and especially one of the daughters, the beautiful Anna (Gretchen Mol), catches his attention. Before Danny moved to England, he helped setting Anna to this world by removing the chord that was twisted around her neck during her birth, and at that point, he exclaimed a wish to marry her someday... This is first of all a romantic comedy, with Danny's chase for Anna as the main plot, and quite a lot of interesting sub-plots and characters. It is most enjoyable, and in the end a real feel-good movie. The script is intelligent, and at times, extremely funny. Especially Danny's landlord, Mr. Klammer, has got some killer lines early on. The acting is also excellent. Jude Law is his usual self, well-acting and beautiful, Brenda Blethyn can do no wrong on the screen, it seems, and Gretchen Mol shows that she is more than just a pretty face. But the real stand-out performance is Jennifer Tilly as the blind sister Nina...I'm really wondering when she's going to go get the recognition she obviously deserves... A great cast all together. The film has a few flaws, the most notable being a rather predictable story, but excellent acting and witty writing more than make up for that. Overall, Music From Another Room is a highly recommendable romantic comedy, far better than most straight-on-video stuff.",
         "OK, if you're in the mood for a slightly nutty romantic comedy, go for this one. The subplot, with Jennifer Tilly's performance as a shy, sheltered blind girl, reluctantly coming out of her shell, is totally luminous (sorry 'bout the cliche, but no other word fits), without resorting to the corniness of \"A Patch of Blue.\" To me, it was actually a more affecting story than the main plotline. The other actors do a great job, especially Brenda Blethyn (what do they teach in British acting class?), Martha Plimpton, and Jayne Adams. The story moves along nicely, and one event seems to flow naturally into another. My guess is, if there had been an A-List Hollywood star on board, like, eg, Bruce Willis, this little film might have gotten quite a bit more recognition. But the chemistry would have been completely different. Bring a date and some popcorn, and enjoy.",
         "\"Music From Another Room\" is certainly recommended viewing, for what it is and despite what it fails to be. \"Writer\" Charlie Peters constructed as good a screenplay as you will ever find in the \"straight\" romantic genre. Unfortunately there is a failure in the execution as \"director\" Charlie Peters drops the ball in his casting decisions and in his efforts to extract the necessary performances from the two leads, Jude Law (Danny) and Gretchen Mol (Anna). And solid efforts from the supporting cast are not enough to make up for these key deficiencies. Peters' story was inspired by Tolstoy's \"Anna Karenina\". It is Danny's fate, shortly after arriving in town, to stumble across Grace Swan (Brenda Blethyn) and her family who he has not seen since he was five. \"Happy families are all alike; every unhappy family is unhappy in its own way\". At age five he had assisted his physician father in delivering daughter Anna (like the book the family's three daughters are named Anna, Karen, and Nina). Seconds after Anna's birth, 5 year-old Danny had vowed that they would one day be married. But there is no indication in the screenplay that the grown-up Danny has come to town for this purpose, on the contrary he came to be with another woman who he has fallen in love with but who dumps him and moves away shortly after his arrival. Peters should get credit for a great title, as \"Music From Another Room\" is a metaphor Danny uses to illustrate how he has felt in the past when he was in love. The idea being that love is like listening to a favorite song playing in the distance and coming back on the same beat of the song when it has been periodically drowned out by closer noises. He should also get credit for the originality of the two-headed coin flip sequence; which sets up the film's resolution according to the flip of a regular coin. The irony being the characters' ability to flip this device of randomness/destiny into an exercise of their free will. Although not a comedy, the film is has a lot of charm and some funny moments. Even with its flaws it is better than average but this does leave you regretting that Peters did not recognize his limitations as a director and bring in someone who could have better executed the ambitious vision of his screenplay. The problem is that the quirky and original elements, which make the screenplay so good, require exceptional performances from the lead characters who must non-verbally convey a whole lot of character motivation as well as several moments of profound revelation. For \"actors\" up to this challenge (and for a skilled director), the roles offer a wonderful \"acting for the camera\" opportunity. For Law, Mol, and Peters it is way too much to ask and the result is strained and unconvincing. Which means that the mixes of sadness and joy, fate and free will, ignorance and revelation never achieve the dimensionality they should have. The failure to fill in the blanks with behavioral information combined with elements that were deleted in the editing process introduces an element of incoherence that ultimate undermines an excellent story. Law (who has certainly demonstrated acting ability in most of his films)has stated that he regrets doing \"Music From Another Room\" and that he let himself be talked into the part. This may actually be true as he certainly gives very little of himself to the performance. The interesting thing is that the part actually has more potential than roles he has chosen and into which he has thrown a lot of energy. Brenda Blethyn and Jane Adams turn in great performances and one can only wish that Adams and Mol had traded parts. Then again, what do I know? I'm only a child.",
         "I had seen Jude Law in the Talented Mr. Ripley and was intrigued to find this little film on Cinemax one day. It is well acted and not slow or dragging. It is surrounded by a great cast and Law and Mol were both splendid. But this is a lot like Return to Me in that it's finale is predictable. But the film is so charming and easy to get interested in. The characters aren't boring but rather have quirks that make them watchable. Not a masterpiece, but if you catch it on cable sometime give it a look. 8/10.",
         "\"Music From Another Room\" is an interesting title. It doesn't make any sense until you see the film in which the phrase is part of a slightly silly metaphor about the nature of love. However, the title actually made me watch the film, along with the promise of well-known actors Jude Law, Jennifer Tilly and Brenda Blethyn. The film is funny at times and lovable in the way we expect from romantic comedies - the opening scenes of young Danny's participation in a baby's birth is a good example, full of sweetness and humanity from Brenda Blethyn and young actor Cory Buck. But this is basically not a very good film. The major problem is in the directing and the editing which are without elegance and with plenty of flaws. Too many parts of the film are unfunny. A large part of the latter half of the film is strained and repetitive. The intended mixture of sadness and joy is handled too unoriginally to be anything but indecision. On top, the storyline is incoherent: Danny's immediate crush on a girl he hasn't seen since her birth is not backed by anything other than Gretchen Mol's nice, but perhaps rather bland appearance. For the most part, the character is described as a closed and slightly dull personality, and Mol plays it with a stiffness to match. Jude Law is a splendid talent but his part much too romanticized and fundamentally uninteresting. Jennifer Tilly plays a blind girl who is provoked into experiencing life more than she has; she is good, but not excellent. In the end my favorite actors here are Brenda Blethyn and Jane Adams, both in fairly small parts.",
         "Just like the other comment above, I had never heard of this film before but saw it (twice!) on the in-flight entertainment of a long flight back from down under. The overall feeling of the film is a bit like a condensed John Irving novel (Hotel New Hampshire): a sprawling storyline concerning an eccentric family with delightful sub-plots involving the births, deaths and loves of the various members. But because the film works on a much smaller scale than a huge doorstop novel, the characters are developed very economically in the film. However, thanks to an absolutely inspired bit of casting, with the likes of Jeniffer Tilly and Brenda Blethyn as the dying mother, the film works extremely well. And of course the chemistry between the two leads, Jude Law and Gretchen Mol, is undeniable and provides much of the appeal of the film. An absolute must see love story which skips beautifully over the potential cliches of the genre, and will have you laughing and crying in equal measures.",
         "MUSIC FROM ANOTHER ROOM was written and directed by Charlie Peters: the film script would benefit from some judicious editing. Yet as a light love story it is fast moving despite diversions in the plot and in general gives some fine actors good screen time. Danny (Jude Law) as a five-year-old lad assisted in the complicated birth of his friend Grace Swan's (Brenda Blethyn) child Anna (Gretchen Mol) and at that moment declared he would marry Anna someday. Twenty five years later Danny returns to Los Angeles from his home in England and encounters the mature Anna who is now engaged to Eric (Jon Tenney), falls in love, returns to the neighbor family of his childhood where Grace greets him with effusive warmth. The family is a dysfunctional one: Anna's sister Nina (Jennifer Tilly) is blind and dependent on Anna; brother Billy (Jeremy Piven) is married to suicidal Irene (Jane Adams); cynical feminist sister Karen (Martha Plimpton) is a man-eater; and the father cares for Grace as she is stricken with a terminal illness. Anna resists Danny, but Danny's influence on the family is like 'music from another room', and results in positive changes in each of the family members: Nina finds love with Jesus (Vincent Laresca), a kitchen worker who introduces Nina to dancing, love, and independence; Grace opens her longing for Anna to experience passion instead of just caring for everyone; and the concept of fate and love and passion is stirred vigorously. Jude Law is his usual appealing self and makes his role credible. Jennifer Tilly does a fine job realizing Nina and her transformation, and Brenda Blethyn gives us a heady dose of Brenda Blethyn, which is always welcome. There are many problems with the film, the most significant one being Gretchen Mol who doesn't take her character beyond paper doll and certainly doesn't seem an adequate reason for Jude Law's unswerving attention. But as a film it works well enough and does provide some food for thought about the true meaning of love. Grady Harp",
         "When I first began to watch this movie, I thought, OH BOY this is going to be BORING! The plot did not make a whole lot of sense and the characters seemed to be picked out of nowhere. There was nothing cohesive about this movie at ALL!! Then, Jesus appears (the character named Jesus that is) and the audience is drawn away from the main romance (which at this point seems to be beyond any hope) to a side romance that is truer to life than anything I had ever seen. The instant and simple bond between Nina and Jesus was almost electric. It was not sensual or erotic, it was sweet and endearing. It was how love SHOULD be. Its the kind of romance/friendship/love that everyone looks for. One that is selfless and kind. It is worth watching this movie JUST to see the Nina/Jesus romance.... This movie proves that side romances are indeed the best, because they restore our hope in what seems to be an impossible goal.",
         "I found myself hating and loving this movie throughout the entire running time. Other than Gretchen Mol, there are some good performances, but the screenplay fails time and again to latch onto a real emotion or life-situation. I really like Jude Law but I think he was supposed to have turned this part down when it was offered. However, the movie was made for me by Vincent Laresca, who played Jesus. He was so unbelievably nice and loving to Jennifer Tilly's character that I cried at his performance. Thank you, Vincent, and congratulations on your career.",
         "This is a wonderful and touching movie. It made me cry without being too mushy. Jude Law is a beautiful creature, and made this film worth my time, since I had never heard of it prior. If you love love, fate, and destiny, then you will love this movie."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Orion Pictures",
         "Capella International"
      ],
      "summaries": ["Music From Another Room is a romantic comedy that follows the exploits of Danny, a young man who grew up believing he was destined to marry the girl he helped deliver as a five year old boy when his mother's best friend went into emergency labor. Twenty-five years later, Danny returns to his hometown and finds the irresistible Anna Swan but she finds it easy to resist him since she is already engaged to dreamboat Eric, a very practical match. In pursuit of Anna, Danny finds himself entangled with each of the eccentric Swans including blind, sheltered Nina, cynical sister Karen, big brother Bill and dramatic mother Grace as he fights to prove that fate should never be messed with and passion should never be practical."],
      "budget": 0
   },
   "movielensId": 1767,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-04-24",
      "dvdReleaseDate": "2003-01-07",
      "directors": ["Charlie Peters"],
      "runtime": 104,
      "movieId": 1767,
      "title": "Music from Another Room",
      "mpaa": "PG-13",
      "actors": [
         "Jude Law",
         "Jennifer Tilly",
         "Gretchen Mol",
         "Martha Plimpton",
         "Brenda Blethyn",
         "Jon Tenney",
         "Jeremy Piven",
         "Vincent Laresca",
         "Jane Adams",
         "Bruce Jarchow",
         "Kevin Kilner",
         "Jan Rubeš",
         "Judith Malina",
         "Sara Paxton"
      ],
      "imdbMovieId": "0119734",
      "originalTitle": "Music from Another Room",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["ZP12lveblKo"],
      "plotSummary": "Music From Another Room is a romantic comedy that follows the exploits of Danny, a young man who grew up believing he was destined to marry the girl he helped deliver as a five year old boy when his neighbor went into emergency labor. Twenty-five years later, Danny returns to his hometown and finds the irresistible Anna Swann but she finds it easy to resist him since she is already engaged to dreamboat Eric, a very practical match. In pursuit of Anna, Danny finds himself entangled with each of the eccentric Swanns including blind, sheltered Nina, cynical sister Karen, big brother Bill and dramatic mother Grace as he fights to prove that fate should never be messed with and passion should never be practical.",
      "tmdbMovieId": 39424,
      "avgRating": 3.1589,
      "releaseYear": "1998",
      "numRatings": 236,
      "posterPath": "/gKjyiaUMDz4ElHJdcWFzdRBPK5I.jpg"
   }
}