{
   "tmdb": {
      "original_language": "ru",
      "keywords": [{
         "name": "parent child relationship",
         "id": 970
      }],
      "imdb_id": "tt0119711",
      "video": false,
      "title": "Mother and Son",
      "recommendations": [
         129971,
         145147,
         86814,
         93500,
         126215,
         111152,
         385623,
         131792,
         247295,
         144994,
         385625,
         189727,
         148050,
         127759,
         256650,
         385624,
         227895,
         132161,
         126189,
         97517
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Son",
               "gender": 0,
               "credit_id": "52fe4685c3a36847f81038ef",
               "name": "Aleksei Ananishnov",
               "profile_path": null,
               "id": 134110,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mother",
               "gender": 0,
               "credit_id": "52fe4685c3a36847f81038f3",
               "name": "Gudrun Geyer",
               "profile_path": null,
               "id": 935025,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4685c3a36847f81038f9",
            "name": "Alexander Sokurov",
            "profile_path": "/kVNeNYXdRzrUZsa9bQyefgzQBTE.jpg",
            "id": 107762,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.331224,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "RU",
            "name": "Russia"
         }
      ],
      "id": 44361,
      "vote_count": 22,
      "budget": 0,
      "overview": "A slow and poignant story of love and patience told via a dying mother nursed by her devoted son. The simple narrative is a thread woven among the deeply spiritual images of the countryside and cottage.",
      "similar": [
         334,
         11631,
         2539,
         8272,
         393,
         8967,
         2288,
         4347,
         69,
         88,
         1164,
         2024,
         401,
         745,
         773,
         858,
         13,
         111,
         142,
         112160
      ],
      "original_title": "Мать и сын",
      "runtime": 65,
      "poster_path": "/29MrwgnFhRhXbHmH6PFxpCxDA2z.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lenfilm Studio",
            "id": 27593,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Severny Fond",
            "id": 93754,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zero Film GmbH",
            "id": 2511,
            "origin_country": ""
         }
      ],
      "release_date": "1997-02-20",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Aleksandr Sokurov"],
      "runtime": 73,
      "synopsis": "\"Mother and Son\" (1997) is a love story, not of the \"Romeo and Juliette\" or \"Tristan and Isolde\" type, but rather regarding the profound emotional ties that exist between a mother and her son. The film calls for amazing optical effects and sounds in order to develop a cinematographic poetry. \"Mother and Son\" is the first part of a trilogy that has for its subject matter the study of the drama in human relationships. It is followed by \"Father and Son\" (2003), and by \"Two Brothers and a Sister,\" the final installment, which is in its preliminary filming stage. The film opens on two human forms, which soon reveal themselves to be that of a young man and a frail, old woman. They recline in a silence penetrated only by whispers and indistinguishable noises. The young man is the son (Alexei Ananishnov) who is taking care of his exhausted, sick mother (Gudrun Geyer). Her illness is undefined and from time to time causes her great pain as she gasps for air. Her son combs her hair, feeds her, covers her with a coat, and takes her in his arms. She is totally dependent on him as he himself was once totally dependent on her. As the film progresses, the son carries his mother on a long journey, from her sick-bed to her death-bed. It is a circular motion, which travels a long walk through a dream-like landscape in the countryside, along winding dirt roads. At each of their brief stops on the journey is a moment of contemplation, caresses, and tender murmurs. These soft murmurs tell of the mother's love for her son when she was nurturing him and of the son's love for his mother as he opens for her the mysterious path to her death. They progress under the leaden and luminous ski of the Baltic, in totally isolated landscapes. From time to time, there is a far away train or a sail on the sea, emphasizing further their isolation from the rest of the world They return to the house. The son tenderly lowers his mother into her bed, which now seems to resemble a coffin. Both know that the end is nearing, although he tries to reassure her to the contrary. He leaves her for a time and goes for a long, solitary walk. When he returns, his mother may have died.",
      "writers": ["Yuriy Arabov"],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0119711/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwNTk4Nzk1MV5BMl5BanBnXkFtZTcwOTc0MDAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Aleksei Ananishnov, Gudrun Geyer | See full cast and crew »"],
      "reviews": [
         "I've never seen a film like Mother and Son and I think I've been looking for something like it my whole life. It is a hypnotic dream, part myth, part fairy tale, a sad reverie. It's hard to tell from critical response what kind of distribution it got in the West unless it was next to none. Obviously, the subject of death is not what they're looking for in Kansas. But in the few \"professional\" reviews there is a sense of respect about Mother and Son. Even the most negative of critics (\"maddeningly slow and self-conscious, the most rarefied, decadent, overripe kind of 'genius' elitist art\") remark about the visual and aural impact it makes. In Barry Lyndon, Kubrick held those beautiful scenes so the eye could luxuriate in ideal landscapes, the perfect counterpoint to Barry's character. Here Sokurov doesn't just pause but allows us to move into the scenes where faces, bodies, trees hillsides are distorted by life. My favorite scene in Mother and Son, is the one when the son decides to leave his mother on the bench as he returns home for a book of postcards. The son says to wait here. And that is what we do in what seems real time. We wait back in the forest with slumbering mother while the camera slowly adjusts our perspective. I wish I had the chance to be with my parents at their deaths. In a sense Sokurov has given me that opportunity in an idealized form.",
         "This relatively short film is about as far from mainstream cinema as you could get. It was reassuring for me to see that films like it are being produced somewhere, by someone -- especially after the experience of watching `Mission to Mars' on the same evening. An art-house goon like myself will at least have an idea of what he's getting himself into, but it's hard for me to imagine an habitual consumer of mainstream cinema watching it unless by accident or at the urging of others. If such is the case, however, and you find it confusing or uninvolving, please don't jump right into the act of declaring it `boring and pretentious.' At the very least, give it a day or two, try to think a bit about what you saw, and what others have seen in it. I hate to see a work of fine art dumped-on publicly because of a quick impression. While I wouldn't necessarily call `Mother and Son' entertainment, if anything can be called a work of art, I think it can. Just about every frame of this film is beautifully composed and rendered. It almost looks like a series of living oil paintings. For anyone who has ever drawn or painted, even as a hobby, it gives you an urge to try to make something as beautiful as what you're seeing. But the look, sound, and essential content of the film combine to make a powerful impression, if you're receptive to it. It is an especially strong and significant experience to anyone who has an elderly parent with whom they are still close, but it seems to me elemental to anyone human who cares for another human. I've often thought there is too much dialog in many modern films, making long stretches of them seem like some form of color radio instead of real cinema, which I think of as primarily a visual medium. `Mother and Son' speaks volumes with little talk, in the manner of some of the great silent film artists. Per the DVD, the actors in this film have almost no other film credits, and to me are completely unknown. No matter. I would love to have participated in the creation of a fine work of art like this once in my life. I wouldn't presume to recommend a film like `Mother and Son' to everyone, but if you've read the comments posted here and think you might be receptive to this film, as I did, see it by all means. You'll probably appreciate its power and beauty, as I did.",
         "Aleksandr Sokurov in MAT I SYN (MOTHER AND SON) has succeeded in capturing those brief, breathing moments that surround death, freezing them in an timeless mold like a shell in a crystal mass, something that goes beyond the passage of time and captures the essence of extended farewells. This brief film is one of the most probing and tender embraces of the meeting/meaning of life and death, of the continuity of a mother's soul in the form of her son, and most important, it is an elegy about the quiet power and beauty of nature. A son (Aleksei Ananishnov) comforts his terminally ill mother (Gudrun Geyer) with gentle caresses, combing her hair, sharing dreams that are identical, and providing solace in every way imaginable. The mother asks for a walk and the son carries her in his arms to a vantage of the sea and through the gnarled trunks of the woods, a path marked by poplars. He carries her back to the little house, and as she sleeps he walks by himself, observing a little train (a departure) in the distance, a sole ship (a departure) gliding on the ocean, and amidst all this natural beauty he clings to an old tree in a tearful embrace. He returns and his mother has died: the cycle of life is complete. Throughout this seemingly simple film Sokorov concentrates on silence, the little dialogue that is spoken is from the gentle script by Yuri Arabov. The 'actors' are appropriately not actors (Ananishnov is a Professor of Mathematics!). The sounds are of nature - rumbling thunder, wind in the trees - and the minimal music is appropriately by Mikhail Glinka and Otmar Nussio with original music by Mikhail Ivanovich. The cinematography by Aleksei Fyodorov is likely greatly influenced by Sokurov's vision: each frame is a still life of nature both with and without the two characters, and with the use of filters, mirrors and broken glass the images are indescribably beautiful. Filmed on the island of Rügen close to the coast of Germany the atmosphere is pure and unhindered by peripheral marks of civilization. Sokurov's 1997 film and his subsequent films OTETS I SYN ('FATHER AND SON') and RUSSKIY KOVCHEG ('RUSSIAN ARK') have established him as one of the most creative filmmakers of today. Highly recommended, especially for those who appreciate art, nature, and the humbling magnificence of the cycle of life. Grady Harp",
         "Mother & Son is a stunningly perfectionist yet tremendously moving piece of art. The plot as it is revolves around a son tending to his dying mother in a rural Russian setting. Whilst this situation is itself moving, the primary impact of the film is sensual. Sokurov goes to immense trouble to turn every extended take into a mesmerising image worthy in-itself, using intricate filters and in-camera techniques to create a stunningly original visual landscape. The dolby soundtrack is just as complex, mixing natural ambient recordings, sparse but precise dialog and occasional snippets of classical music mixed in at a nearly inaudible level. The soundtrack itself could stand alone. More importantly, perhaps, the style fits the subject matter. What Sokurov essentially does is kills the audience - the film has an immense hypnotic power that places the audience directly inside the gaze of the dying woman. Both times I saw this film, the entire audience was left sitting dazed and motionless for a number of minutes after the house lights had come up. The final triumph is the films short running time of 1 hr 15 minutes. The audience is given no time to lose concentration, and the film achieves all its goals in this time. Mother & Son must rank as one of the few recent films to qualify as a truly cinematic experience.",
         "There is very little in the movies today that is anything like Mother and Son. Certainly the slow movement, which mirrors life itself, is far away from any editing that we normally see. But what is there to prepare one for the absolute exquisite beauty, scene after scene. Because of the slowness, because of the beauty, because of the subject, it is painfully exquisite. One feels, at once, the heavy pain and suffering of this life and its beautifulness. The two seem to coexist like oil and water, pulling one in two directions at once. Of plot, in the normal sense, there is little or none. Everything is about the hiddeness and mystery of all things, all relationships, the blowing of the grass in the wind, a young man carrying his mother, Death. What more is there to say?",
         "I had completely forgotten about the film until I was chatting to a friend today and an image suddenly formed, unbidden in my mind, and I could perfectly see that wonderful scene where the son supports his mother and her skin seems almost translucent, and all that can be heard on the soundtrack is her laboured breathing, and those wonderful painterly scenes of verdant meadows. I doubt I will have a cinematic experience like watching this film again. Rushing home from work, I went out to meet a friend and see it. Sat in a beautiful cinema that smelled of red velvet, we got to see this film, where just for a second time stops and slows. All that matters is sensation, and beauty, and plot or character just fades away... the most wonderful film, so different and so fragile.",
         "After opening with a distorted tableau, Sokurov moves slowly into images of stones, grass; he's a naturalist who's addicted to nature; a humanist who's dedicated to the intimate. (The mother and son in his film are not characters or types or ciphers or \"performances.\") The camera movements are so beautifully slow that they're hard to describe -- imagine the precision of \"Ordet\" had it been made in color, those images still and hazy, like pastoral paintings with glowing hues of light. They're some of the purest images I've ever seen, comparable to \"Barry Lyndon\" and \"McCabe & Mrs. Miller.\" What is so startling is that the color makes the film seem modern -- and such a hazy yet lucid color, Maddin-like in its Expressionism and schemes: fable-like and emotionally incestuous. It exists outside time, its only indicator a train within the film; existential emptiness represented visually. The film passes by quickly, with the perpetual wind that sounds like the ocean. It's as if the film is a progression of the most beautiful visions imaginable, the various images of death. It is something different -- art should be unique, if we're talking about art in the vein of Picasso, Shakespeare, and Bach, shouldn't it be an experience like no other? In fact, this could easily be compared to Tarkovsky, the most obvious comparison. But for me it feels more like Dreyer without the self-conscious dialogue. It couldn't be said to be complex -- it's two characters talking rather simply. But what it lacks in complexity it makes up for in singularity. (The images are at times so rich that it's almost comical -- is this a film set or not?) It's the kind of film that's easy to make fun of, intruding on the most personal moments of this pathetic-looking mother and her son who constantly speaks in a hushed tone -- you imagine one of those \"Seinfeld\" Village Voice parodies. It isn't emotional or intellectual; I don't even know if it's profound. But it's a masterpiece, plain and simple. 10/10",
         "In just over an hour, Sokurov achieves in \u0091Mother and Son' a wholly satisfying balance between the aesthetic, emotional, and spiritual elements that inform this simple but extremely profound film. In many ways the film is reminiscent of Andrei Tarkovsky, but where Tarkovsky was more specifically Christian in his metaphysical leanings, Sokurov suggests a kind of \"humanist mysticism\", an elegiac hymn to the natural rhythms of life and death, and the fragile poignancy of human love. As a celebration of life in the face of death, \u0091Mother and Son' portrays the journey we must all eventually face with a simple naturalistic acceptance, and is perhaps the closest thing one might find in cinema to what I can only describe as a sort of \"non-religious sacredness\". Sokurov's approach here is very \u0091pared-down'. While the dialogue is kept to an absolute minimum, the soundtrack is extremely expressive and is an essential element of the work - the wind, the sea, the \"music\" of the earth, provide a brilliant counterpoint and commentary to what is seen. The look of the film is remarkable, inspired by the paintings of Caspar David Friedrich, but while the images are indeed beautiful, they are never merely \"picturesque\". From beginning to end, Mother and Son is a work of genius.",
         "The prior commentator went a little overboard. The film is surely not the greatest of all time. It is, perhaps, the greatest LOVE FILM of all time. The beauty of the landscape (note that this is Russia in deep summer -- deep winter would have produced a much different effect - but then the mother is dying, and the contrast between her physical state and the lushness of the fields and forests is necessary to keep one from being overwhelmed by sorrow ) is itself commentary on the beauty between these two. No pretty girl, no surging music, no reasons even for the love. It is just there. Titanic. Not tied to sex or gratitude. JUST EMOTION. The dialog is spare. There is no third person. Though everything moves very sluggishly, this fits perfectly. This is not a movie. It is a poem. Extremely fine too as an essay on what the core of love looks like.",
         "This film is about the relationship between a sick mother and her son. (surprise.) Surely, this isn't for the average viewer: narrative is slow, events nonexistent; the film consists mostly of painting-like \"still-lives\" with very little dialogue. The mother and son walk along the beautiful sceneries (the film is done on the island of Rügen, by the coast of Germany), approach each other, take contact by embracing and hugging. Nick Cave, the rock singer, said somewhere that this film is the most beautiful he has ever seen. I agree that it is maybe Sokurov's best: the twisted images of the landscapes, great camera work and almost meditative feeling are something I love to see in the cinema - if nothing else, just as an attempt this is a great film, instead of all the run-of-the-mill \"narratives\" we come across. Beautiful. Word."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Severny Fond",
         "Zero Film GmbH",
         "Lenfilm Studio"
      ],
      "summaries": ["A slow and poignant story of love and patience told via a dying mother nursed by her devoted son. The simple narrative is a thread woven among the deeply spiritual images of the countryside and cottage."],
      "budget": 0
   },
   "movielensId": 1768,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1997-02-20",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Alexander Sokurov"],
      "runtime": 73,
      "movieId": 1768,
      "title": "Mother and Son",
      "mpaa": null,
      "actors": [
         "Aleksei Ananishnov",
         "Gudrun Geyer"
      ],
      "imdbMovieId": "0119711",
      "originalTitle": "Мать и сын",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A slow and poignant story of love and patience told via a dying mother nursed by her devoted son. The simple narrative is a thread woven among the deeply spiritual images of the countryside and cottage.",
      "tmdbMovieId": 44361,
      "avgRating": 3.40816,
      "releaseYear": "1997",
      "numRatings": 49,
      "posterPath": "/29MrwgnFhRhXbHmH6PFxpCxDA2z.jpg"
   }
}