{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0114690",
      "video": false,
      "title": "Tokyo Fist",
      "recommendations": [
         25951,
         17991,
         33431,
         92989,
         71093,
         27276,
         105833,
         131964,
         36215,
         25660,
         25651,
         26040,
         118170,
         159185,
         134769,
         40974,
         79860,
         42721,
         72490,
         35648
      ],
      "backdrop_path": "/1QrZ9l7ZWOGHgTsVNYtlMB8sKDm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Tsuda Yoshiharu",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dca7f",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "order": 0
            },
            {
               "cast_id": 19,
               "character": "Hizuru",
               "gender": 0,
               "credit_id": "54c3cf92c3a36833380019fe",
               "name": "Kaori Fujii",
               "profile_path": null,
               "id": 1053788,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Kojima Takuji",
               "gender": 0,
               "credit_id": "52fe45d3c3a36847f80dca67",
               "name": "Kôji Tsukamoto",
               "profile_path": null,
               "id": 84045,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Haze",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dca6b",
               "name": "Naomasa Musaka",
               "profile_path": "/sqqaE4q48HDbQ9CsFCJBtqhuI2i.jpg",
               "id": 133886,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Shirota",
               "gender": 0,
               "credit_id": "52fe45d3c3a36847f80dca6f",
               "name": "Koichi Wajima",
               "profile_path": null,
               "id": 133887,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Tattoo master",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dca73",
               "name": "Tomorowo Taguchi",
               "profile_path": "/3Gf8GXzl2ZsvOQnW5DOi65Nsk16.jpg",
               "id": 67091,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe45d3c3a36847f80dca77",
               "name": "Nobu Kanaoka",
               "profile_path": null,
               "id": 126453,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Ohizumi",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dca7b",
               "name": "Naoto Takenaka",
               "profile_path": "/9mAwzOZCWvaqDNOT3a0cIZVByRw.jpg",
               "id": 68704,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "52fe45d3c3a36847f80dca8f",
               "name": "Akiko Hioki",
               "profile_path": null,
               "id": 555015,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "52fe45d3c3a36847f80dca93",
               "name": "Kiichi Mutô",
               "profile_path": null,
               "id": 555016,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45d3c3a36847f80dca59",
               "name": "Hisashi Saito",
               "profile_path": null,
               "id": 133885,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dca5f",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dca85",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dca8b",
               "name": "Shinya Tsukamoto",
               "profile_path": "/bl8guH7tvIg4fOiNZFweBjb93Ik.jpg",
               "id": 58608,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.744772,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 41577,
      "vote_count": 33,
      "budget": 0,
      "overview": "A businessman, Tsuda, runs into a childhood friend, Tajuki, on the subway. Tajuki is working as a semiprofessional boxer. Tsuda soon begins to suspect that Tajuki might be having an affair with his fiance Hizuru. After an altercation, Tsuda begins training rigorously himself, leading to an extremely bloody, violent confrontation.",
      "similar": [
         3134,
         11564,
         8810,
         281,
         2142,
         22323,
         948,
         298312,
         14433,
         12162,
         949,
         241,
         793,
         101,
         562,
         1359,
         681,
         281957,
         339692,
         59967
      ],
      "original_title": "Tokyo Fist",
      "runtime": 87,
      "poster_path": "/svAlY2ZBMtWLpVX6A3BFKTnJmRS.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [],
      "release_date": "1995-01-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Shin'ya Tsukamoto"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Hisashi Saito",
         "Shin'ya Tsukamoto"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0114690/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyNjY5NzIyNF5BMl5BanBnXkFtZTcwNTM2MjkxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Kaori Fujii, Shin'ya Tsukamoto, Kôji Tsukamoto | See full cast and crew »"],
      "reviews": [
         "Japanese film maker genius and multi-talent Shinya Tsukamoto's Tokyo Fist (Tokyo-ken, 1995) is as stunning and incredible experience as can be expected after seeing his two Tetsuo films in which a human body and metal (machine) became one with a horrific results. Tsukamoto's cinema is filled with hyper fast editing, shaking camera, fast forwards and every imaginable things to shock the viewer senses and make the weakest faint. Tokyo Fist is not any exception. Director himself plays Tsuda, a nerdish Japanese insurance salesman who has a beautiful girlfriend Hizuru (Kahori Fujii) whom with he lives seemingly peacefully and in love. But still it looks like Tsuda has some problems in his life and seems to be on the edge of his sanity. Soon his high school time friend Kojima arrives (played by the director's brother, Kôji Tsukamoto) and he is a professional boxer and very fierce one. When he starts to be interested in Tsuda's girl, all physical and mental hell breaks loose as Tsuda gets an obsession to start to box himself, too, and Hizuru starts to have some very severe habits of body piercing and self mutilation. The infernal ride has begun and the viewer is not recommended to take it granted that he'll/she'll stomach the ride till the end because this is Tsukamoto. That means incredible power and impact straight to your face. The film is perhaps even wilder at some points than the first Tetsuo (1988) as the message and imagery is really heavy this time and the film is in color, too. The fists, the punches and the mayhem is always aimed straight to the camera, the viewer and audience, so the viewer will be on the edge of the seat for the whole time, and it all is of course at its most powerful when seen on the big screen. Tsukamoto has the talent to hammer and force his things to the skull and spinal cord of the viewer and he does it all with the magic of editing and cinematography, and definitely not least of Chu Ishikawa's pounding and merciless soundtrack which is here as effective and wonderful as in Tetsuo. The visuals are impressive and every twisted camera angle has its purpose and meaning as well as every bit of mist and darkness that is shed during the ride. The effect when he shakes his camera is something truly unique and definitely much more powerful way to depict the feelings and mental states of the characters than any dialogue ever could. Fast edits and unconventional usage of camera can be very irritating and needless when used without any real reason or to make the film look \"stylish\", but they can also be heart stoppingly effective when they have a cinematic meaning and the director could just simply write on the paper what the edit or camera angle means inside the film. Tetsuo is another great example of this and its black and white scenery is no less powerful than the colors in Tokyo Fist. Tokyo Fist is extremely menacing as there hardly are any peaceful moments and there's all the time some element there to make it clear that it is not peaceful even though it may look like it. The film's theme is about human nature and its jealous and weak sides as the characters can't live without taking or producing physical pain. The smashed faces and the scenes of surreal gore spurting at nightmarish anger are really something to make us ask why do the characters do it. Why cannot human nature solve things in other way than physical force and violence and how many of us dares to admit the brute sides of ourselves and accept them? And then of course keep them away and on the background. The final image is kind of \"optimistic\" but definitely no character gets out without the result and payment of their deeds. The film is also a good example for those who think that in Japanese cinema females are often on the background and weaker than men as the lead female in Tokyo Fist practically (and quite passively!) makes, at first so powerful and dominating, Kojima as her submissive slave. The film begins as in our familiar world in modern day Japan but it is not so long before Tsukamoto gives us the first glimpses of his surreal visions that are taken at their extremes in the incredible blood soaked nightmare finale \"in the ring\", a finale that is so fierce, kinetic and merciless piece of film making it just makes me appreciate and love Japanese cinema even more with its many sides never or very rarely paralleled in other world cinema. The gore and violence is sudden and almost unbearably shocking at times but the blood geysirs are not realistic nor they're meant to be; they are from the film's own world and as symbolic and surreal as in the Japanese samurai classic The Baby Cart aka Lone Wolf & Cub series in the early seventies, the first two parts of that series edited also into one feature film as Shogun Assassin (1980). Still none of these films manages to give the kind of impact in their violence or any other element than Tokyo Fist, but the surreal depiction of physical violence is pretty similar with Tsukamoto and The Baby Cart pieces. Perhaps only negative point I can find in Tokyo Fist is that some of the characters seem to develop a little too fast and they should have been little more motivated and restrained. For example, Tsuda seems to be completely mad already and is capable to rape his girlfriend any time so these kind of things should be explained little more carefully in order to make the piece perfect and the characters more real. Still the characters are very good and the message and theme gets delivered very effectively through their acts and there's absolutely no question that the visual magic and impact of Tsukamoto's deserves nothing less than praising and moments of pure amazement. Shinya Tsukamoto is the kind of Master of Cinema that he really deserves his name in the thanks section of the end credits of every young film maker's film who has got inspiration from his work. His films have the ability to make people faint, shock, turn the head off the screen and stun in their power and it all is done practically by himself as he works as an editor, cinematographer, art director etc. in his own films and thus expresses his visions. His films would be totally unforgettable when seen at least once in the big screen but fortunately the effect is still very strong on television, too. Tokyo Fist is among the most fierce, angry and honest rides of cinema I've ever experienced and everytime I see something from its maker, I cannot help but feel confused and amazed in front of Japan and its invaluable gifts during the centuries to the world of cinema. 9/10",
         "Watching a movie by Shinya Tsukamoto is a bit like staring into the deepest pits of hell, or the darkest recesses of the male psyche, whichever way you want to put it. But then the two seem fairly synonymous, at least if the sheer visceral anger in Tokyo Fist is anything to go by. Those aware of Tsukamoto's feature-length debut Tetsuo (1988) will be familiar with the basic premise in Tokyo Fist; flawed relationship between man and woman is brutally disrupted by an outside element which challenges the protagonist to a potentially lethal, and eventually soul-destroying, duel. Similarly to other pioneers of horror (eg. Cronenberg, Miike), Tsukamoto chooses to use all kinds of repulsive visuals. Just to give you an idea, if a face almost literally falling off after a boxing match is too much for you, it's probably best to stay away from this film. However, the brutal imagery is not completely pointless. Tokyo Fist portrays male anger with such honesty that it is sometimes painful to watch, but that's really the point since violence is not something to be cooed at or to be admired (which is what many Hollywood movies seemingly aim to achieve, witness the way audiences are prompted to cheer for the good guy as he murders the baddie). The violence in Tokyo Fist is allegorical in nature, ie. it stands for something else than just simply fists flying: the inability between men and women (and, indeed, men and men) to understand each other ultimately leads to the kind of extreme violence we see on screen. This, ironically, makes Tokyo Fist a part of the great humanist tradition in Japanese cinema, alongside Rashomon and other such movies, because, even though it uses extreme imagery to make a point, it makes the same point all the same: if we relish in jealousy, revenge and anger we will only end up destroying each other, and ultimately ourselves. Does Hollywood ever deal with violence this eloquently? Also, as with Tetsuo, the characters in Tokyo Fist seem to live entirely in a world of their own. Many shots frame them either alone, or surrounded by an anonymous mass which fails to notice them or appreciate their presence (even as Tsuda stands in the middle of a shopping mall, his face beaten to a pulp). I can't think of another film-maker who sums up urban alienation as brilliantly as Tsukamoto does; the sheer contradiction of city life, in which a great mass of people are all huddled together at close range, and yet find themselves completely lonely and alienated from one another. For all intents and purposes, Tokyo Fist is a movie which requires a strong stomach and an open mind. But it's a great achievement all the same.",
         "I've seen Tsukamoto's Tetsuo films but here he has found a way to be almost as outre but infinitely more accessible and coherent. The film is about 3 people (two men and a woman caught in a triangle) whose lives suddenly become charged with transformative psychosexual and psychoviolent energies revolving around the world of Japanese boxing (but it is nothing like a 'fight' film). Actor/Editor/Cinematographer/Director Tsukamoto has found a way to give a high impact, extremely rhythmic (in both time and space) look and feel to his ideas that is very original and striking. The spatial rhythm of the lead characters boring ordinary 'day' life passed in high rise apartment complexes and the incredibly kinetic temporal rhythm of his alternate 'night' life provides a terrific cinematic contrast of these two worlds. The film is rather short and gains immensely thereby in both concentration and focus. I, too, thought about Raging Bull at times but probably Tsukamoto is more akin to David Cronenberg (the new flesh) in his concerns, not his approach, than Scorsese. It may not be for the squeamish, but it is strong, brilliant film making which you should definitely try.",
         "This is not a movie you experience with the brain, rather it's an assault on the senses. Some of my favourite cinema does that, and I'm always on the lookout for movies that call us to live through a certain experience, to vicariously sense the world as another person might. The ultimate joy is for me to be able to take out something that matters, an otherwise impossible view of the world in my livingroom that makes sense. The problem of Tokyo Fist is that it's packed with so much rage and annihilation yet aims it nowhere. The boxer characters are punching, but they're not punching outwards, at society, nor inwards at the soul, they're simply pummeling and being pummeled senseless. Senseless is an apt word here, for in Tokyo Fist the mind doesn't matter, and the human body is something to be destroyed, the senses torn from it and thrown in a bloody heap on a grimy floor. Tsukamoto can be seen beating his head in a bloody pulp against a wall, but that wall signifies nothing. The spurts of blood gushing from broken noses and deformed bonecheeks, the film celebrates with the comic verve of Sam Raimi. With time Tsukamoto would grow out of the techno angst of this period, but enabling the maturity of films like Vital, a certain youthful vitality had to be sacrificed in the process. I lament this because few directors dare make films like his, even Tsukamoto himself doesn't seem able to make them anymore. Fits of jealousy, miserable love triangles, personality changes, all these are trifle story points. What I take from Tokyo Fist is the aimlessness of violence, taken to the extreme because there's nothing to absorb it. Likely Tsukamoto grew up in a Japanese society of the 80's and 90's, like the rest of the world, stifled in the mire of apathy and complacency. People had the money to buy and the selection to buy from, but not the struggle with grand ideals. The resulting New Wave of his cinema is a New Wave of disillusionment turned against itself, a shell without a solid core to make it dream a better society. In this light, it makes sense to see Tsukamoto playing a young employee, fresh out of high school and already into a suit and a tie running errands for a faceless corporation, turning into a crazed animal for whom even love is a petulant obsession, another passing need to be consummated.",
         "lemme start out by saying that i enjoyed tetsuo one very much, to me it was like a live action anime. i was excited to see tokyo fist when i saw the directors name and by judging the comments on it here. I have to say that i really didnt understand what he was getting at 90 percent of the time. lots of cameras shaking up and down and blood spouting from peoples heads does not a good movie make. I dont understand one of the comments here, saying that it was \"infinitely more coherant\" then tetsuo. for one thing the dialogue was so badly translated that they could barely put the most simple of english words in the correct context. i dont mind a complete lack of plot, as long as the ride is interesting. this to me was not.",
         "Tsukamoto in this film strips away excess to reveal a animal emotions which are then stretched to excess. In this film anger, violence, pain and revenge drive the action. Tsuda and Kojima witness the murder of a girl they like and while both vow to find and punish the killers only Kojima holds on to the twisted dream to become a second rate boxer. Tsuda becomes a salaryman in a sexless relationship in which they spend the evenings watching old films (I spotted Metropolis and another which I can't place). A chance meeting between the two after many years awakens the anger that Kojima feels towards Tsuda, and the former begins making a play for Hizuru, Tsuda's girlfriend. This in turn leads Tsuda to become angry and he turns to boxing to get revenge on his former friend. Meanwhile Hikuru becomes a masochist, autonomous of both the males. The fairly graphic violence is mostly make up and is so over the top it is clearly to make the point mentioned in one of the other comments: violence is often the first recourse in a situation. However, as opposed to a film like Rocky where the violence leads to personal redemption, or an emotional force like Raging Bull, the violence is non-cathartic and meaningless. It is almost as if the characters are driven to behave in a certain way as a reflex reaction. Fast editing, powerful sound effects and blue colours mark the film out as Tsukamoto's style, and the transformation theme is another element that he returns to. Lots of fun for me, but the person I was with didn't have a clue what was going on. Make your own decision, but there is no relationship to Fight Club whatsoever: this is about human emotion, not social issues.",
         "The first ten minutes are awesome. The movie is very strong, but the quality varies a lot along its development until its bad end. Both the fast paced training scenes and the oppressive Tokyio city footage are very nice. Though, the bizarreness of the story bores. This is a live action film with an anime aesthetics (for anime fans perhaps the movie pleases more). It could be a great movie if it had developed better the main character's ordinary life as a white collar, the chaos of the city (the story does not explore the interesting way the town is shown), the dangerous boxer who tattooes the number of defeated challengers on his shoulder. Less emphasis in body horror and sneezing blood would also contribute to a more satisfactory outcome. The director's brother should be substituted by a better actor. A different and better story for the love triangle would be necessary too. To conclude, the director/writer/actor Shin'ya Tsukamoto has the skills, but lacks good taste and makes bad decisions.",
         "Boxing has long been something of a cinematic comfort zone, being a fairly simple plot device for getting across character motivations and \"overcoming the odds\" tropes and whatnot... not to mention boxing matches being an almost impossible thing to NOT make exciting on the big screen. Tokyo Fist is instead a brilliant subversion of typical boxing movie clichés, offering a bleak, cynical and hyper- violent view of the sport in trademark Tsukamoto fashion - the gradual mental (and physical) disintegration of the main characters is in direct proportion to the total number of pints lost. And yeah, you better believe there's a lot of blood lost in this movie too, but don't walk into this expecting a gore fest. I'd say it's more perfectly paced than gory - it crescendos in violence beautifully without spending too long messing around. But much like Tetsuo: The Iron Man, the main attraction of Tokyo Fist lies in its imagery rather than its storytelling (which is fairly basic stuff, at the end of the day). Tsukamoto shows a lot of maturity and confidence in his direction and cinematography since Tetsuo too - General chaos and rapid camera movements is still the main course of the day, but there are a lot more creative photography and great lighting on display throughout the entire movie. The soundtrack (by regular Tsukamoto collaborator Chu Ishikawa and his group Der Eisenrost) is also worth a mention - it goes together with the imagery like white-on-rice, actively improving the film a lot. I would totally incorporate those pounding, aggressive industrial beats into my work-out regimen",
         "It's Tokyo, the mid-Nineties and you fancy punching the poo-poo out of someone. That's how total cult directors Tsukamoto Shinya and Kitano Takeshi felt, at least. Coming a year apart - much like your mother's sex life - both made Tokyo-based films centred around boxing: 'Tokyo Fist' (1995) and 'Kids Return' (1996), both bringing their own unique flair to the art form. To start, the films are very similar: 'Tokyo Fist' starts with salaryman Tsuda bumping into an old school friend, Kojima, a part-time boxer. Likewise, 'Kids Return' begins with former best friends from school, Masaru and Shinji, happily bumping into each other on a Tokyo street, both recognising that their lives have taken a downward spiral since they last saw each other. However, due to the nature of both directors, the similarity largely ends there. 'Tokyo Fist' is very much along the lines of Tsukamoto's most famous work: 'Tetsuo: Ironman'. Focusing on ideas of revenge and aggression, Tsuda soon becomes paranoid that his old classmate might be knocking up his missus, Hizuru. His paranoia gradually drives Hizuru away, as their quiet life becomes loud, aggressive and full of blood-splattering scenes, with her ending up in the arms, and bed, of Kojima, played by Tsukamoto's brother, Koji. The anger and rage building inside him, exemplified by the ever-present loud music, Tsuda joins Koji's boxing gym, determined to beat him in the ring, much like Koji is doing to Hizuru. The film then becomes a loud, brash experience, with fast camera movements, editing and thrashing music, leaving the viewer out of breath just watching it. And, as ever, a confusion is created as to what exactly is going on, throwing in extreme moments to push things just that little further. Rage, obsession, and fetish are themes running throughout Tsukamoto's works, and 'Tokyo Fist' is no exception, working as a more polished version of 'Tetsuo: Ironman'. The special effects are still a little budget, but creative in the excessive blood pouring and Hizuru's new fetish for piercing any part of her body possible. Punch, punch, punch is the style for the boxing scenes, with Tsukamoto creating a work to seep into your mind and punch your brain into dazed confusion. But where Tsukamoto chooses to show graphic violence and gore, this is the very thing that Kitano often avoids. Since starting with 'Violent Cop', the violence is Kitano's films is more in the mind than on screen. The use of still cameras and editing means that actual acts of violence fall out of shot or are skipped for comic timing. The majority of punches thrown in 'Kids Return' are at punching bags or in sparring practise. 'Kids Return' is seen as Kitano's most autobiographical work, set in the part of Tokyo where he grew up and featuring events and job roles that he himself experienced while growing up. The two friends, Masaru and Shinji drift through school, seen as the ultimate prodigal sons by their teachers. Neither has much direction; simply wreaking havoc on the lives of their classmates. Meeting his match, Masaru decides to take up boxing, but soon realises he hasn't the discipline for the sport. His perennial sidekick, Shinji, however, does, and his talent is quickly spotted by the gym's coaches. Masaru then drifts away, becoming a low level yakuza. For Shinji, boxing is a sense of direction after days drifting, rather than an act of aggression. 'Kids Return' is all about direction when entering adulthood, mirroring roles taken by Kitano himself. Meek Hiroshi tries his hand at selling scales and driving a taxi on finishing school - two jobs Kitano had - but soon finds that neither provide him with what he wants out of life. Two students forming a school double act perform stand-up comedy to their classmates with a manzai act similar to that brought Kitano his initial fame. If anything, 'Kids Return' is quite a depressing film. On leaving school, hopes and ambitions are quickly lost for all characters, with all left feeling lost and abandoned by their seniors. Hiroshi is repeatedly criticised by the bosses of his various jobs; Masaru is expelled from his yakuza family for speaking out of turn; and Shinji's coaches give up on him once he is led astray by an older boxer who takes him drinking. The boxing in 'Kids Return' is exactly that: there is more emphasis on the sport, with more realistic bouts and styles. 'Tokyo Fist' goes down the Stallone-form of boxing with non-stop punch fests that would lead to permanent brain damage in seconds, but with blood spurting out of eye sockets, this is the only way Tsukamoto of the Nineties would work. Both made in the mid-Nineties, set in Tokyo and with boxing as a key element, the films are very different. Tsukamoto favours high-octane fight scenes and special effects to create a visually spectacular gore fest, while Kitano chooses a more mellow-paced drama. At a time when two former boxing film legends return for the undoubtedly terrible 'Grudge Match', 'Tokyo Fist' and 'Kids Return' are both blasts from the past that fall under the same weight class, but see a clash of styles.",
         "I feel it's sort of a shame for such a movie to have less than at least 100 reviews on its page. So here I go, helping it out with this 22nd review, if I recall it correctly... First time I read a review on Tokyo Fist on another site, I didn't quite know what to expect from this movie. I was deep down in Cronenberg horror, but this title's plot and atmosphere (as described by a rather insipid reviewer, I guess) simply eluded my intuition. Luckily, I decided to give this a try, and it was one good decision. Tokyo Fist stands at a fine border between black comedy (and also really dry), surrealism, action and plain existential malaise. Tsukamoto's cam angles and effects act perfectly coherently with his intent, from emphasizing the ridiculous monotony and isolation in Tsuda's life to highlighting the irrational ferocity of his old \"friend\" that almost seems to turn night into day and day into night. Now, diving a bit into the predictable Fight Club comparison, Tokyo Fist is the severe, restrained, Eastern cousin of Palahniuk's novel's adaptation. There is no noticeable trace of emotion (maybe except anger), pathetism, or nihilist verbosity in the discourse of Tokyo Fist's characters. It's as if their existence and the duty of assuming various roles (and subsequent failures) squeezed their sentimental tendencies out of them and sent them into an abyss. There is no \"love trio\" in this movie, no matter how tempting it would be to call it that way. Its three main characters remain as insulated as can be, until the very end - a brilliantly open and non-conclusive end to a small, powerful drama of people not able to manage their remorse or lack of meaning without showering themselves in suffering. Beyond the plot, there are some really nice hyperkinetic boxing scenes in this movie, and the generous to parodic flows of blood and bruises might seem chuckle and nausea-inducing at the same time. I am afraid, though, that what I have said doesn't give this film the aura that it deserves. If you are not necessarily an adrenaline freak yet not an instant puker either, and want to see something done artistically indeed, you ought to give this at least one punch with the eye."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Kaijyu Theater"],
      "summaries": ["A businessman, Tsuda, runs into a childhood friend, Tajuki, on the subway. Tajuki is working as a semiprofessional boxer. Tsuda soon begins to suspect that Tajuki might be having an affair with his fiancée Hizuru. After an altercation, Tsuda begins training rigorously himself, leading to an extremely bloody, violent confrontation."],
      "budget": 0
   },
   "movielensId": 1773,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": "1999-06-29",
      "directors": ["Shinya Tsukamoto"],
      "runtime": 87,
      "movieId": 1773,
      "title": "Tokyo Fist",
      "mpaa": "",
      "actors": [
         "Shinya Tsukamoto",
         "Kaori Fujii",
         "Kôji Tsukamoto",
         "Naomasa Musaka",
         "Koichi Wajima",
         "Tomorowo Taguchi",
         "Nobu Kanaoka",
         "Naoto Takenaka",
         "Akiko Hioki",
         "Kiichi Mutô"
      ],
      "imdbMovieId": "0114690",
      "originalTitle": "Tokyo Fist",
      "genres": [
         "Romance",
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A businessman, Tsuda, runs into a childhood friend, Tajuki, on the subway. Tajuki is working as a semiprofessional boxer. Tsuda soon begins to suspect that Tajuki might be having an affair with his fiance Hizuru. After an altercation, Tsuda begins training rigorously himself, leading to an extremely bloody, violent confrontation.",
      "tmdbMovieId": 41577,
      "avgRating": 3.24409,
      "releaseYear": "1995",
      "numRatings": 127,
      "posterPath": "/svAlY2ZBMtWLpVX6A3BFKTnJmRS.jpg"
   }
}