{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119548",
      "video": false,
      "title": "Little City",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "5914a28fc3a3683fb600efc5",
               "name": "Jon Bon Jovi",
               "profile_path": "/pqqJ2JN4vbXQBsjwzDDw8cSK2XL.jpg",
               "id": 32362,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Rebecca",
               "gender": 1,
               "credit_id": "5914a2a6c3a3683fb600efd5",
               "name": "Penelope Ann Miller",
               "profile_path": "/6wjG6NUBKc6Ca4KX6G6V4t6sU2.jpg",
               "id": 14698,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Nina",
               "gender": 1,
               "credit_id": "5914a2bcc3a3684269010879",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Landlord",
               "gender": 2,
               "credit_id": "59c8f23c9251415b24074a30",
               "name": "Joe Bellan",
               "profile_path": "/7138OJFEXogfoGLnaAPb83R8Kqm.jpg",
               "id": 548090,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Adam",
               "gender": 2,
               "credit_id": "59c8f270c3a368141e069cd4",
               "name": "Josh Charles",
               "profile_path": "/gO5zHbDQ38bZKJULUk9wIrFW1w4.jpg",
               "id": 2694,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Kate",
               "gender": 1,
               "credit_id": "5a66ff580e0a2619480091ec",
               "name": "Joanna Going",
               "profile_path": "/8wPmJGGj4HEUfaYzYjoL1AzOSlf.jpg",
               "id": 59662,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "5914a2e1c3a368426901089a",
            "name": "Roberto Benabib",
            "profile_path": null,
            "id": 1214449,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.074378,
      "production_countries": [],
      "id": 102732,
      "vote_count": 1,
      "budget": 0,
      "overview": "Best friends Adam and Kevin have a lot in common. Probably too much! In fact, Kevin is carrying on a torrid affair with Adam's girlfriend, Nina, on the side! And if this triangle wasn't crowded enough, the arrival of a seductive newcomer in town, Rebecca, promptly adds a whole new set of twists to an already tangled mix! Here's a hilarious look at how modern relationships have never been so complicated ... or so much fun!",
      "similar": [],
      "original_title": "Little City",
      "runtime": 90,
      "poster_path": "/fIynQQgyxWCs0kNJ7YHKTRNwaZI.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Bandeira Entertainment",
         "id": 377,
         "origin_country": ""
      }],
      "release_date": "1997-04-04",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "When your one and only... isn't the only one!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roberto Benabib"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Roberto Benabib"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119548/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MTY2MzUwNV5BMl5BanBnXkFtZTcwMzI5MTAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jon Bon Jovi, Penelope Ann Miller, Josh Charles | See full cast and crew »"],
      "reviews": [
         "1st watched 5/18/2003 - 8 out of 10(Dir-Roberto Benabib): Great little movie with brutal relationship honesty(aka. Is anything final?). Basically what this movie is about is people being involved with one another because they want sex, because they're obsessed, or because they want to be loved. It's all of these and then some for this twisted, topsy-turvy dramatic comedy. What makes this movie great will not sell DVD's but deserves a permanent part in movie history because of it's suttle unique & realistic storyline about life & love in an actual big city(San Francisco) that becomes little because of the intertwined relationships that occur throughout the movie. This movie doesn't need extras or anything else. It stands on it's own as a unique story with a good, what's going to happen next, finale. The players in this film are really good at just letting the story tell itself and not masking it with over-acting but just doing their job. This was definetly lost in the shuffle when it came out, but deserves to be recognized for what it is. A good movie.",
         "\"Little City\" refers to San Francisco of which much mention is made and many landmarks are shown in this film which features an ensemble cast of quality actors all comfortably engaged in sorting through the romantic vicissitudes of their characters lives. Lively, fun, and glib, \"LC\" is a little situational plotless and soapless \"chick flick\" with lots down-to-earth dialogue about relationships. A fun, light hearted watch for mature channel surfers, especially couples and San Franciscans.",
         "This was not a fast paced movie and as some say more of a chick flick. Basically it is a movie with a lot of dialogue that you might hear in your every day life. A look at the relationships of several friends as they navigate thru life. The cast consists of excellent actors Josh Charles, Joanna Going, Penelope Ann Miller, Annabella Sciorra, JoBeth Williams and Jon Bon Jovi. having seen the first 5 in movies over the years I knew they could make the characters believable but it is Jon Bon Jovi that I have seen a very rapid growth in his acting ability. He was very good and on the same level as the rest of the cast. If you want an action movie this is not the one for you but if you like the small movie that shows feelings and the things that people go thru then this might be worth seeing.",
         "I'm a big Jon Bon Jovi fan so the only reason I rented this video was because he was in it. But the movie turned out to be really good. Even if JBJ didn't have a part, I would have enjoyed it anyway. It's about the ups & downs of being single & looking for \"Mr./Ms. Right\" in the 90's.",
         "I thoroughly enjoyed the movie for the reasons above. The actors are all very good (which means the director was superb). Annabella Sciorra is a personal favorite of mine as she can tackle the most difficult characters and deals with them with great ease. There is a scene in which the character played by Ms. Sciorra is in a (catholic) church with her boyfriend of the moment. Sciorra tosses off lines with some rather explicit language and makes it seem natural. Later she and the boy friend indulge in some mutual shows of affection in the church and again it seems natural. The subject of lesbian relationships comes up at various times and once it again it is dealt with very well. If you don't yet love San Francisco you will at the end of the movie. If you don't yet love Annabella Sciorra you will at the end of the movie.",
         "What a great little film which didn't get enough attention. Yes, Bon Jovi is good, but all of the other performances are the ones to praise. Penelope Ann Miller and Josh Charles shine. Benabib wrote a very entertaining funny screenplay and should be very proud of his directorial debut. Hopefully, this film will gain some notoriety over the years.",
         "Being a little skeptical about movies with a singer in the main role (Bon Jovi), I must say \"Little City\" was beyond my expectations. It's a movie about people in platonic feelings, the usual \"when-i-care-for-you, you-don't-care-for-me\" situation that becomes \"now-that-i-was-accepting-it(with someone else) you-come-back\". Love becoming lack of interest becoming searching someone else becoming love again. The movie has regular performances, but a good screenplay, maybe a little slow at the beginning, but at the end is an acceptable result.",
         "Ok...I admit it. I'm totally in love with Jon Bon Jovi and I seen this movie that had him in it...so I had to see it. I didn't know if I would like it or not...I knew it was about love, but that's it. Well...I watched it and surprised...I actually liked it. It was a cute little film. It was kinda confusing at times, but I enjoyed it. And yes...Jon Bon Jovi HAS improved on his acting ability. I'd recommend the movie to people. :)",
         "It seems this movie gets watched either because of Jon Bon Jovi or in spite of him. I'm one of the latter - it was on TV right after my supper and i said ok, now i'll watch this movie even if JBJ is starring... i must say that my prejudice wasn't based on his acting, as i never watched him act - it's more that i find his music trash. But he turned out quite a ok actor. But even better was the movie overall - a smart relationships- and looking-for-love story with a nice plot revolving around 5-and-a-half characters and taking sharp turns every 10 minutes, with (almost) everything happening at wrong times. I did find the style of some of the main characters' various confessions slightly over-styled for the confidant at hand, but i did like the idea of every character having his own way of analysing him/herself aloud (confession booth, support-group, taxi-dispatcher, shrink, diary); but i also didn't mind the glitch in light of the rest of this witty, funny, honest, warm movie. I especially liked the acts of Josh Charles and Annabella Sciorra.",
         "I admit, I picked this up because I wanted a little Bon Jovi eye-candy, and didn't *really* expect the movie to be any good, but then I saw it had Josh Charles and Annabella Sciorra in it, and I think then I expected a little too much of it. Like a plot that *made sense.* It wasn't so much the overall theme of the movie that I disagreed with as it was the fact that the characters themselves were pretty shoddy. By this I don't mean that they were caricatures (though many were, particularly Bon Jovi's Kevin), but rather that the characters did not even make decisions consistent with how they supposedly acted and thought. The ending, particularly for Kevin and Nina, left me feeling as though miles of film that explained *how* and *why* these things were happening had been left on the cutting room floor. The acting was all right, and some of the dialogue was downright witty, but none of it was good enough to rescue a character-driven movie with flat characters and poor characterization."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Bandeira Entertainment",
         "Initial Entertainment Group (IEG)"
      ],
      "summaries": ["Adam is a painter who works as cab driver and blames his difficulties with women on his former girlfriend Kate who left him for lesbian Anne. As a result he doesn't pay much attention to his current girlfriend Nina, who leaves him for his best friend Kevin. New girl in town, Rebecca, who works in the same bar as Kevin, turns their lives into even bigger chaos."],
      "budget": 0
   },
   "movielensId": 1782,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-04-04",
      "dvdReleaseDate": "2001-01-23",
      "directors": ["Roberto Benabib"],
      "runtime": 90,
      "movieId": 1782,
      "title": "Little City",
      "mpaa": "R",
      "actors": [
         "Jon Bon Jovi",
         "Penelope Ann Miller",
         "Annabella Sciorra",
         "Joe Bellan",
         "Josh Charles",
         "Joanna Going"
      ],
      "imdbMovieId": "0119548",
      "originalTitle": "Little City",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Best friends Adam and Kevin have a lot in common. Probably too much! In fact, Kevin is carrying on a torrid affair with Adam's girlfriend, Nina, on the side! And if this triangle wasn't crowded enough, the arrival of a seductive newcomer in town, Rebecca, promptly adds a whole new set of twists to an already tangled mix! Here's a hilarious look at how modern relationships have never been so complicated ... or so much fun!",
      "tmdbMovieId": 102732,
      "avgRating": 3,
      "releaseYear": "1997",
      "numRatings": 42,
      "posterPath": "/fIynQQgyxWCs0kNJ7YHKTRNwaZI.jpg"
   }
}