{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "scam",
            "id": 11454
         },
         {
            "name": "cigarette smoking",
            "id": 11732
         },
         {
            "name": "writer",
            "id": 13028
         }
      ],
      "imdb_id": "tt0120782",
      "video": false,
      "title": "Palmetto",
      "recommendations": [
         268536,
         18192,
         55151,
         14864,
         49806,
         46105,
         63555,
         16148,
         90148,
         33222,
         4499,
         16156
      ],
      "backdrop_path": "/5xOcOKkzoQL0ak3tmfGDIb4dKYd.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Movies1234",
         "id": "5988de2ec3a36875170038fe",
         "content": "Liked everything about this movie. All the main players, Woody Harrelson, Elisabeth Shue, Gina Gershon and Chloë Sevigny were very good. Good story with a few twists and just a touch of comedy. And the scene with Harrelson and Shue in the bungalow was hot. I give it a 8/10.",
         "url": "https://www.themoviedb.org/review/5988de2ec3a36875170038fe"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Barber",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c115",
               "name": "Woody Harrelson",
               "profile_path": "/tFAngknlbFZebWVMaFFLFIsFvLE.jpg",
               "id": 57755,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nina",
               "gender": 1,
               "credit_id": "52fe444e9251416c9100c119",
               "name": "Gina Gershon",
               "profile_path": "/jaUQhGVmemkSyS5O0fcRkhGTOUq.jpg",
               "id": 11150,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mrs. Donnelly / Rhea Malroux",
               "gender": 1,
               "credit_id": "52fe444e9251416c9100c11d",
               "name": "Elisabeth Shue",
               "profile_path": "/44AaIXkbZFkdhSW1kRdzCbfYk6c.jpg",
               "id": 1951,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Donnely",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c121",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Odette",
               "gender": 1,
               "credit_id": "52fe444e9251416c9100c125",
               "name": "Chloë Sevigny",
               "profile_path": "/54k4DrrkDmYhA4rRVt57CUkrVS6.jpg",
               "id": 2838,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Felix Malroux",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c147",
               "name": "Rolf Hoppe",
               "profile_path": "/uTNYbd1ibnDwrmnb6LTv8aozkt4.jpg",
               "id": 6270,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "John Renick",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c14b",
               "name": "Tom Wright",
               "profile_path": "/AlBgY9VySrLBhVsOJXtUXuflOGG.jpg",
               "id": 55270,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Miles Meadows",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c14f",
               "name": "Marc Macaulay",
               "profile_path": "/eSNgzHn7NUX9iAbG1MLV41lqy14.jpg",
               "id": 6908,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Lawyer",
               "gender": 0,
               "credit_id": "52fe444e9251416c9100c153",
               "name": "Johnny Hickey",
               "profile_path": null,
               "id": 1080880,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Judge",
               "gender": 0,
               "credit_id": "52fe444e9251416c9100c157",
               "name": "Ralph Wilcox",
               "profile_path": null,
               "id": 83610,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c12b",
               "name": "Volker Schlöndorff",
               "profile_path": "/5os3QPgtEJANkN9tNyBYcR86gHD.jpg",
               "id": 10249,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe444e9251416c9100c137",
               "name": "E. Max Frye",
               "profile_path": null,
               "id": 68928,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c13d",
               "name": "Klaus Doldinger",
               "profile_path": "/cqXOVQf8dm7d5vDqVvudNVs9gv4.jpg",
               "id": 5240,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c143",
               "name": "Peter Przygodda",
               "profile_path": null,
               "id": 2309,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58b55e539251410a9000919d",
               "name": "James Hadley Chase",
               "profile_path": "/4oDEz1kPTzYaMwzzAovmhkqB5cz.jpg",
               "id": 115054,
               "department": "Writing",
               "job": "Book"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 3.796229,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 30949,
      "vote_count": 33,
      "budget": 0,
      "overview": "A recently released ex-con gets involved in a fake kidnapping scheme that turns very real.",
      "similar": [
         8067,
         4771,
         984,
         2149,
         11826,
         979,
         275,
         339692,
         507,
         74997,
         398175,
         2163,
         8012,
         562,
         9093,
         86838,
         1433,
         6075,
         1586,
         1948
      ],
      "original_title": "Palmetto",
      "runtime": 114,
      "poster_path": "/nwPZzUywExiwOZ8zyKrqGyoguuX.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Code Entertainment",
            "id": 14589,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rialto Films",
            "id": 8658,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-02-20",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "In a town this bad, it's hard to be good...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Volker Schlöndorff"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "James Hadley Chase",
         "E. Max Frye"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120782/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTk2MjE2NDY2NV5BMl5BanBnXkFtZTcwMTcxMTQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Woody Harrelson, Elisabeth Shue, Gina Gershon | See full cast and crew »"],
      "reviews": [
         "I think this is one of those modern-day film noirs (neo noir) that went under the radar. It is excellent, and few people know about it. It's a very underrated film. It had an interesting and unpredictable story with some very neat twists which a good noir might have. I'm not really sure I liked the very ending, but I sure enjoyed the rest of it. That entertainment included ogling a couple of sexy female leads, played by Elisabeth Shue and Chloe Sevigny and I loved the wonderful colors in this movie. Not only was the cinematography great, so was the soundtrack with some solid blues tracks. The guitar playing reminded me of the Ry Cooder's work in \"Midnight Run.\" The movie was labeled by some national critics as a \"poor man's 'Body Heat.'\" Well, that's fine with me because I liked \"Body Heat\" a lot, too. If you liked that, you should like this movie, too. Yes, there are a few holes in the story but nothing that damaged the storyline to any degree. Woody Harrelson was good in the lead and Gina Gershon and Michael Rapaport provided solid performance in supporting roles.",
         "This slick thriller is entertaining from start to finish. Harrelson plays Harry Barber an ex con who is lured by mega rich temptress Rhea Malroux (Elizabeth Shue) in to helping set up a straight forward bogus kidnap scheme involving her stepdaughter Odette (Chloe Sevigny) It seems simple, he can earn a lot of money for doing very little. As the plot thickens Harry finds out that things, and people, are not what they seem and that is where the trouble begins. Harrelson is convincing in the lead and Sevigny is very good as the rich kid, although Elizabeth Shue tends to overact her part. The biggest crime in this film is that of Gina Gershon, who seems wasted in a weak role as Harry's girlfriend. The film on a whole is good though, and because of this you can almost forgive a 'Batman' style ending!",
         "Apart from one central problem (Elisabeth Shue certainly has the body, but not the inherent tough-girl attitude her role requires; in other words, she's miscast), I personally cannot understand how anyone can claim to be a mystery fan and not like this movie. Absorbing storytelling (which takes its time), some tense moments (the body in the car trunk) and many great, totally unpredictable surprises that even the most hardened genre buffs will not guess. Riveting and interesting from beginning to end. (***)",
         "Although the characters lack credibility (it seems like every single woman in the history, all of them gorgeous, is dying to get into the underwear of the main male character as a matter of urgency). Nevertheless the plot is unusual and nothing is what it looks. All seems like a normal thriller in which the roles of everybody are the typical ones but the surprises that unfold in the last minutes make it a watchable twist around a theme many times explored before. The superb luscious ladies and the unusual plot make it a good watch,",
         "I think that \"Palmetto\" is going to be a cult movie some years from now. It has been clearly underrated. It is \"noir\", although located in sunny places. It has a sort of kinship relation with George Stevens' A Place in the Sun. And it has a quite good Woody Harrelson in the leading role. Sweat plays more than a role in the plot: characters are sweating all the time (mainly Harry Barber), for different reasons. May be that's why some people dislike it.",
         "This brilliantly-written film has everything a great film noir movie needs. First and foremost, the femme fatale Rhea Malroux, played with cunning accuracy by Elisabeth Shue, and the sucker who gets screwed over, Harry Barber, played by Woody Harrelson. Another important and necessary element is the sticky, hot Florida climate, that adds to the erotic atmosphere. The money is the object of everyone's desire as well. Because of all this and much more, \"Palmetto\" achieves what every film noir film shoots for. Thrills, surprises, murder and steam. Trailers and reviews made the film sound like a sex romp, when in reality there isn't one nudity shot in the whole thing. Because \"Palmetto\" is not about nudity. It's more than that, like any good film noir is. It's about TEASING. About strutting and never showing all the goods. Rhea Malroux struts her stuff alright, but never strips. And that's much better than gratuitous sex and nudity. Much better. The film focuses more on the plot, about a fake kidnapping scheme that is sure to please everyone...if it goes smoothly. And of course, it doesn't. Bodies turn up, and people are not who they seem. Harry Barber quickly realizes he's gotten too deep in something he never should have gotten involved in. But after serving two years of a four-year sentence in an 8X10 jail cell for a crime he didn't commit, he feels someone owes him. So he agrees to participate in a fake kidnapping that will get the wife of rich Felix Malroux 500,000 dollars and Harry a nice whopping 50,000. But because Harry is not naughty by nature, he doesn't do well disguising his innocence and his guilt comes through, sweating profusely when the DA Renick calls him in to act as reporter, Harry can't take the \"heat\". He attempts to call the whole thing off, but once told the money's already been delivered, he can't help it. He wants back in. E. Max Frye is the brilliance here, for his script says it all. Based on an old pulp novel \"Just Another Sucker\" by European author James Hadley Chase, the film is directed by Volker Schlondorff, who should also be commended. The acting is first rate, and purposefully over-the-top by brilliant Elisabeth Shue as the best femme fatale I personally have ever seen grace the silver screen. This is not a must rent, it's a must BUY!",
         "I saw this film for the second time yesterday and i enjoyed it just as much as the first time. It has everything a black thriller needs. Good plot, with a lot of plot twists, interesting scenes, great characters, and good acting (Woody Harrelson is really good as an ex-convict getting involved in a fake kidnapping). Still the action is slow in many moments. Very good ending. Vote: 7 out of 10.",
         "Most people I've talked with didn't enjoy this movie, but I clearly disagree I feel this film is one of the better I have viewed in sometime. Though Palmetto has more plot twist and story misdirection than a city slicker being lost in a small town, Palmetto sure leaves the viewer guessing and highly entertained. The setting of a small Florida town fits the storyline perfect thanks to Volker Schlondorff crafting it along with the James Hadley Chase novel. You finally figure the whole plot out in the end, and many like myself didn't like the ending it's like starting over as Harry Barber (Woody Harrelson) once again finds himself in prison. This proves the old adage wrong that you learn from your mistakes, but not in Harry Barber's case as he is once again screwed. Believe me you learn from experience, anyone should no better than to trust a cunning-beauty Mrs. Rhea Malroux (Elisabeth Shue) who plans a kidnapping scheme to good to be true. Because people who plan are only planning for their benefit. So Palmetto has some very basic moral meanings to it some like Harry Barber learn the hardway and remain in mediocrity, while others like Mrs. Donnelly aka Rhea Malroux crash in the end but to only drag others down with them. The twisting of the script and film's setting are probably Palmetto's better qualities. All good performances from Harrelson, Shue,and Gershon. Just to mention Gina Gershon and Elizabeth Shue have beauty and looks that would make any man foam at the mouth. I hope to continue to see Shue and Gershon in many films to come they were the two driving forces of Palmetto. I recommend this film to anyone, but remember you must pay close attention throughout the whole film or will you be as lost as city person in the wilderness.",
         "Woody Harrelson plays Harry Barber, a wise guy reporter who just did some jail time for a dirty deal that wasn't his fault. When he gets out of the slam, he just wants his life back. But bad breaks and shifty women soon send him right back into the seamy, sexy world of double deals and decadent rich folks, in a steamy Florida town called PALMETTO. The plot of this movie is okay, and the story moves along at a slow, but steady pace. But what really makes it work is the sexual subtext of a man fighting to maintain both his moral high ground and his sexual potency while surrounded by a trio of luscious, dangerous women. At first, Harry Barber's biggest problem is finding a job. When he gets out of jail, his loyal girl friend Nina (Gina Gershon) is waiting to meet him. Dark-eyed Nina is the ideal best pal -- friendly, loving, and supportive. Not only does she take Harry in, she's more than willing to pay for his expenses and keep him on as her \"assistant\" until he finds a job. The sizzling tension between them is that Nina wants a docile and submissive male concubine while Harry is too macho to accept the pleasures Nina can provide. He's clearly the kind of man who feels that it's emasculating for a woman to have too much money or power in a relationship. Still, Nina is so stunningly attractive and so clearly besotted with him that he almost unwillingly sinks into dependence. Watch the early morning scene where he makes coffee for Nina and tensely waits for her approval! It's pure Neanderthal male pride that drives Harry to accept a \"dirty job\" from blonde temptress Rhea Malroux. Elisabeth Shue has never, ever been more radiant than in this classic noir role of the black widow. The sex scenes are sizzling precisely because Rhea is using Harry and preparing to feed on him. Yet when her spoiled step daughter, Odette, appears, Harry is forced to pleasure not one but two of the most dangerous women in Palmetto! Frankly, the ending of this movie is not very satisfying -- Harry does not really triumph in the end, nor does he learn the value of Nina's loyalty and support. In the end it's more of a paranoid male fantasy than a real classic thriller, but still worth watching just for the sizzling sexual subtext between Harry and his three witches!",
         "Released from prison after being cleared of charges, Harry Barber tries to get his life back when he is approached by the beautiful Rhea Malroux with a proposition to make money. It's simple - Rhea's stepdaughter will pretend to be kidnapped, Harry will write the notes and Rhea will get $500,000 ransom money from her rich elderly husband without the police ever getting involved. Needless to say, things don't go totally to plan and, after Harry collects the money, things go badly wrong and he finds himself desperately trying to get out of the web he is caught up in. An ex-con gets approached by a gorgeous woman and is seduced into committing a simple crime - typical noir territory, cue a twisty thriller where things that are presented as facts turn out to be lies etc. The plot is quite good even if I was waiting for the twists rather than having them come out of leftfield at me. The lack of real surprises was a problem for me as it did turn the story into rather a workmanlike affair at times. The characters aren't great either. Aside from Harry all the others are basic cardboard cut outs of characters rather than being well scripted people. Harrelson does a good Harry, he has a sort of haggard yet oafish character here who is always one step behind and Woody can do that quite well. Shue is OK as the supposed femme fatale but I couldn't help feel that Gershon would have done a much better job, although at times Shue does look very sexy. Sevigny and Rapaport are both good young actors but neither is really given anything to do here - especially Rapaport who has bad dialogue throughout. Overall though this is watchable and isn't bad - just routine. It has weaknesses but it does well to ape the atmosphere and prerequisites of the genre well, although it is pretty run of the mill as far as the genre goes. Still worth seeing but if you've seen more than three examples of the genre then you'll know pretty much what to expect."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Code Entertainment",
         "Columbia Pictures Corporation"
      ],
      "summaries": [
         "After being released from prison on a bum charge, Harry Barber is out for some payback to regain the two years he has lost. He is hired by Mrs. Malroux to fake the kidnapping of her stepdaughter (the daughter of a dying millionaire). He discovers that he is being set up on multiple levels and will soon face a longer prison sentence if he does not prove the truth to the police.",
         "Harry Barber just can't catch a break. First, his refusal to take hush money and keep quiet after he discovers city hall corruption unjustly lands him in jail. He realizes that being a good guy doesn't pay. Later, when a golden opportunity presents itself, he decides to grab himself some payback. He's offered $50,000 to place a phone call, as part of a fake-kidnapping scam.",
         "A recently released ex-con gets involved in a fake kidnapping scheme that turns very real."
      ],
      "budget": 0
   },
   "movielensId": 1783,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Pусский"
      ],
      "releaseDate": "1998-02-20",
      "dvdReleaseDate": "1998-08-04",
      "directors": ["Volker Schlöndorff"],
      "runtime": 114,
      "movieId": 1783,
      "title": "Palmetto",
      "mpaa": "R",
      "actors": [
         "Woody Harrelson",
         "Gina Gershon",
         "Elisabeth Shue",
         "Michael Rapaport",
         "Chloë Sevigny",
         "Rolf Hoppe",
         "Tom Wright",
         "Marc Macaulay",
         "Johnny Hickey",
         "Ralph Wilcox"
      ],
      "imdbMovieId": "0120782",
      "originalTitle": "Palmetto",
      "genres": [
         "Mystery",
         "Thriller",
         "Drama",
         "Romance",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "_QPIAvJPBtE",
         "kBZJ2F88Ywc"
      ],
      "plotSummary": "A recently released ex-con gets involved in a fake kidnapping scheme that turns very real.",
      "tmdbMovieId": 30949,
      "avgRating": 2.89032,
      "releaseYear": "1998",
      "numRatings": 1363,
      "posterPath": "/nwPZzUywExiwOZ8zyKrqGyoguuX.jpg"
   }
}