{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0145302",
      "video": false,
      "title": "A Paralyzing Fear: The Story of Polio in America",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.001649,
      "production_countries": [],
      "id": 83593,
      "vote_count": 0,
      "budget": 0,
      "overview": "This is a very clear and personalized presentation of the history and human impact of a seriously debilitating disease - one which we in the western world are too often tempted to think of in the past tense.",
      "similar": [],
      "original_title": "A Paralyzing Fear: The Story of Polio in America",
      "runtime": 90,
      "poster_path": "/vixSXefeKdPSimIoTktc6TnoWpz.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-03-04",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nina Gilden Seavey"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Stephan Chodorov",
         "Nina Gilden Seavey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0145302/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0Mjg0NTg0MF5BMl5BanBnXkFtZTcwNjY0NjcyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Olympia Dukakis | See full cast and crew »"],
      "reviews": [
         "This is a very clear and personalised presentation of the history and human impact of a seriously debilitating disease - one which we in the western world are too often tempted to think of in the past tense. We're informed that a vaccine is considered \"successful\" if 85-90% of people acquire immunity as a result. So there is still ample room for polio to persist and do harm to individuals, but thankfully not on the scale that affected my parent's generation. We also gain an insight into the struggle between two passionate scientists each of whom were devoted to proving their theories for the benefit of mankind. On ABC Australian television we saw a 55 minute edited version, but it still packed a punch. It closed by pointing out that after decades of successful polio control in the western world, the vital need for vaccine in third world countries was only just starting to be addressed. I expect that the full length version of this film would have included mention of the condition \"post-polio syndrome\" which I friend of mine suffers. Every few years she endures recurring bouts of severe weakness and agonising pain - and the big obstacle to finding treatment is that very few hospital personnel even know that the condition exists.",
         "\"A Paralyzing Fear: The Story of Polio in America\" is a very sobering film. Today we've forgotten just how bad the disease is, as dead kids and iron lungs are mostly a thing of the past. However, in much of the 20th century, it was a horrible plague--and this film chronicles its impact and eventual eradication in the US. The first portion of the film is a combination of a history of the disease and also a discussion of the impact of the illness--with interviews with several folks who continue to live with the effects of the disease many decades after the vaccines were introduced. The second portion is the hopeful part--when Salk and Sabin separately developed vaccines to eliminate the virus. Sadly, the vaccines offered no help to those already suffering from the disease--but over time, it's something we SHOULD see eliminated completely. Now here I am going to get on my soap box for a bit. If you watch this film, I can't see how any clear-thinking person could rationally object to the notion of vaccines. Yet, sadly, some folks are using purely anecdotal and emotional support to encourage parents NOT to vaccinate. My answer to this...WATCH THIS FILM. If this doesn't convince you, nothing will. Seeing folks in iron lungs is enough to convince me...as well as that pesky thing called the scientific method."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["Few know the story of how polio came to America in 1916 and grew into the frightening epidemics of the 1940's and 50's when the diseases crippled tens of thousands of children every summer."],
      "budget": 0
   },
   "movielensId": 1787,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-03-04",
      "dvdReleaseDate": "2005-02-22",
      "directors": [""],
      "runtime": 90,
      "movieId": 1787,
      "title": "A Paralyzing Fear: The Story of Polio in America",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0145302",
      "originalTitle": "A Paralyzing Fear: The Story of Polio in America",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "This is a very clear and personalized presentation of the history and human impact of a seriously debilitating disease - one which we in the western world are too often tempted to think of in the past tense.",
      "tmdbMovieId": 83593,
      "avgRating": 3.12,
      "releaseYear": "1998",
      "numRatings": 25,
      "posterPath": "/vixSXefeKdPSimIoTktc6TnoWpz.jpg"
   }
}