{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ex-cop",
            "id": 8440
         },
         {
            "name": "retired",
            "id": 18115
         }
      ],
      "imdb_id": "tt0119594",
      "video": false,
      "title": "Twilight",
      "recommendations": [
         46027,
         32075,
         32074,
         31004,
         32077,
         10170,
         42176,
         67307,
         19429,
         31618,
         26261,
         25338,
         51515,
         27224,
         18835,
         13571,
         39140,
         24214,
         118991,
         36288
      ],
      "backdrop_path": "/9GWwEBppULimzFvuNlxqlkQxNCE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Harry Ross",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e04106f",
               "name": "Paul Newman",
               "profile_path": "/my0Blo9IBy1WZ0QKbuxUzS0QwV5.jpg",
               "id": 3636,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Catherine Ames",
               "gender": 1,
               "credit_id": "52fe44f7c3a368484e041073",
               "name": "Susan Sarandon",
               "profile_path": "/sT6zE3Bpa2HR5lAS44tB6rWDEtP.jpg",
               "id": 4038,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Jack Ames",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e041077",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mel Ames",
               "gender": 1,
               "credit_id": "52fe44f7c3a368484e04107b",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Lt. Verna Hollander",
               "gender": 1,
               "credit_id": "52fe44f7c3a368484e04107f",
               "name": "Stockard Channing",
               "profile_path": "/5UFMOfbzod42UiPUna59Ch1e37a.jpg",
               "id": 8893,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Raymond Hope",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e041083",
               "name": "James Garner",
               "profile_path": "/ek70DefEq6LZZX3JyUjJ125q63f.jpg",
               "id": 16896,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Reuben Escobar",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e041087",
               "name": "Giancarlo Esposito",
               "profile_path": "/d39hOi5lTfqekjFK4JKKPeuGNdW.jpg",
               "id": 4808,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Jeff Willis",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e04108b",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Gloria Lamar",
               "gender": 1,
               "credit_id": "52fe44f7c3a368484e04108f",
               "name": "Margo Martindale",
               "profile_path": "/4YmmVgOGKsDsGGLunCHmigj2TbV.jpg",
               "id": 452,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Capt. Phil Egan",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e041093",
               "name": "John Spencer",
               "profile_path": "/9sU5FEzlf921n6NxHmXgJB3994T.jpg",
               "id": 34691,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Lester Ivar",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e041097",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Verna's Partner",
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e04109b",
               "name": "Peter Gregory",
               "profile_path": null,
               "id": 42647,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e04105f",
               "name": "Robert Benton",
               "profile_path": "/wVaHC1VX9yBg9MIEC7POAJ0JlUo.jpg",
               "id": 6729,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e041065",
               "name": "Robert Benton",
               "profile_path": "/wVaHC1VX9yBg9MIEC7POAJ0JlUo.jpg",
               "id": 6729,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f7c3a368484e04106b",
               "name": "Richard Russo",
               "profile_path": "/5f8E92GAwyE7rb5u9rPqdnvgn3d.jpg",
               "id": 56566,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57edfaf3c3a3682a650009d2",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57edfafac3a3684e5a0023aa",
               "name": "Piotr Sobocinski",
               "profile_path": null,
               "id": 33238,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57edfb019251415daa000af2",
               "name": "Carol Littleton",
               "profile_path": "/wsQP1noRhkMRujRJ3uVntLXSFLf.jpg",
               "id": 9966,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "57edfb4ec3a3684e32002487",
               "name": "Ilene Starger",
               "profile_path": "/dVYmLCzLbFukPENgiQMvw4BnQoH.jpg",
               "id": 6493,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "57edfb559251415daa000b14",
               "name": "David Gropman",
               "profile_path": null,
               "id": 5329,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "57edfb5bc3a3682aa1000b91",
               "name": "David J. Bomba",
               "profile_path": null,
               "id": 437,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "57edfb609251416cd3003110",
               "name": "Beth A. Rubino",
               "profile_path": null,
               "id": 12258,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.750268,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26269,
      "vote_count": 45,
      "budget": 0,
      "overview": "A retired ex-cop and private detective gets mixed up in murder when he is asked to deliver blackmail money and walks into a 20 year old case involving the mysterious disappearance of an actress' former husband.",
      "similar": [
         2832,
         8810,
         1571,
         254904,
         245891,
         281,
         39514,
         241254,
         412000,
         10538,
         353070,
         204082,
         98357,
         2123,
         9355,
         291870,
         9271,
         13515,
         11826,
         9946
      ],
      "original_title": "Twilight",
      "runtime": 94,
      "poster_path": "/1G9PZLULbbIrb74H6BdhQGplCxf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cinehaus",
            "id": 761,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Scott Rudin Productions",
            "id": 258,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-03-06",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Some people can buy their way out of anything. Except the past.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Benton"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Robert Benton",
         "Richard Russo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119594/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMTM0OTkzNF5BMl5BanBnXkFtZTcwMDA1NDgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Newman, Susan Sarandon, Gene Hackman | See full cast and crew »"],
      "reviews": [
         "This movie didn't do well with the critics or at the box office but if you're in a nostalgic mood I'll think you'll enjoy it. The nostalgia is not just for the stars, Newman, Hackforth and Garner but for the whole private eye genre of the forties. All three stars show why they have been tops for so long. At 73 Newman can still make the action and the sex scenes creditable. It gives new hope to men of a certain age everywhere! It is a film that probably plays better on TV than in a movie house. The pace is leisurely but there is some nice sharp dialogue and atmospheric camera work. All this plus a moody score by Leonard Bernstein make for a highly professional entertainment. The more I think about it the more I like it.",
         "With all the action-schlock movies coming out of Hollywood, and all the obsession with special effects, it is nice to have a movie about real characters with some real acting. This is a great cast with Newman in his usual fine form, and Hackman, Sarandon, and Garner reminding us what real acting is all about. I don't know why this film reminded me of L.A.Confidential in the story line, but this film's characters have depth and texture, unlike the cardboard cutouts of that movie. The gritty plot, about past crime, betrayal, friendship, and loyalty, is not without its moments of sardonic humor, and Elmer Bernstein, who has been around forever, still churns out a great score. A grownup movie for grownups.",
         "I really liked this film, even though I never heard of it until it was on cable. I was afraid at the start that Newman was going to recycle his curmudgeon character from \"Nobody's Fool\" but instead he played a very different richly complex character. Kudos also to the rest of the nearly all-star cast. One important plot element absolutely jumped out at me, even though none of the characters seemed to notice, but aside from that I have no complaints. Reese Witherspoon was particularly beautiful here. Grade: A",
         "This won't ever be anyone's favourite movie. It sets its sights fairly low, so it doesn't have any difficulty in hitting its targets. Nevertheless, it will trump many other thrillers simply because of the sheer professionalism of its cast. Esposito is an irritation and Liev Schreiber is fantastically dull as ever, but the real joy comes from seeing the old pros, Newman, Hackman, Sarandon, Channing and Garner doing their thing. Authority oozes from the screen whenever any one of them is on, which fortunately is nearly all the time. Hackman is particularly fine, especially considering he has virtually nothing to do. This must be the oldest cast since Cocoon! 7 out of 10. It would be nothing without its principals.",
         "Have you ever imagined what would happen to Sam Spade and Philip Marlowe lived to be seventy? A genuine hard-boiled detective film forty years later. The myth behind Newman's accident is hilarious. A must see!",
         "Didn't expect much because of the cool reception by critics(esp.Ebert),but was very pleasantly surprised. The acting, writing, and photography are first rate.Was glad to see Richard Russo's film writing come off so well. This is worth renting!",
         "In a world where sex, violence, and sleaze in movies seems to dominate, it is refreshing to find a film that is the caliber of movies made from a much earlier decade, when cinema was intended to be a work of art. You could not ask for a better cast than in this movie. All are very well-respected for their acting abilities and their professional demeanor. The score is excellent; the story line captivating. Paul Newman is indeed more than believable in his role as a sexy, no-nonsense gumshoe. Susan Sarandon is sultry in the style of Susan Hayward and Lauren Bacall. Gene Hackman is, well, Gene Hackman. I only wish there were more movies coming out of Hollywood of this nature.",
         "This may be one of the most underrated movies ever. Robert Benton's sharp, smart, moving and funny tribute to the \"film noire\" genre was undeservingly scolded by most of the critics and it is a real shame. \"Twilight\" is one of a few movies I saw this year, that reminds us the taste of a really good cinema. It stars a team of Hollywood's greatest stars, it has a truly great script, it's relatively short (and you will be sorry it ended that fast) and it is a total enjoyment for any movie lover. And if it's not enough, there is an incredibly hot sex scene with an amazingly sexy Rhis Witherspoon. You shouldn't miss that, I guarantee you.",
         "The late actor Paul Newman portrays a fly in the ointment, the anti-hero version of Dick Tracy, herein Twilight. I've read some reviews of people wondering why widely acclaimed filmmaker Robert Benton has made this movie. A short answer: To provide screen experience to new starlets with veteran actors. There are 3 of those starlets in this film. First one is Reese Witherspoon. 1998 was an important milestone for her. She's been busy whole year long with Pleasantville and Overnight Delivery. Through 1998 summer she played in Twilight, thus she has bold scenes with Liev Schreiber. Even though she has a cameo role as Mel Ames in the film, her role includes the only nudity content of her box-office movies career. Yet, Twilight features its queen Susan Sarandon. For me, this is Sarandon's third best after Atlantic City and White Palace. She comes out of pool, starts walking in Eve outlook, looking for her Adam, then Newman comes by. The second starlet is Liev Schreiber. He plays Mel's date at Mexico. While Mel lies naked on a couch, she asks him \"Do you love me?\". He keeps his silence a bit while staring at her tits, and hinders himself from replying \"No, I just love your tits\". Thankfully Mel speaks before him: \"I mean it doesn't really matter you love me or not\". If all the movie critics thought the same way that Robert Benton has written the worst script of his life, they might be right. The third starlet is Patrick Malone. If you read this review right now, and don't know who Patrick Malone is, it's because herein Twilight he wasted his chance of a lifetime due to his imitation of Will Smith. A young actor in Hollywood must not copy other actors of same career level. I actually liked Malone's harmony with Newman playing his partner, if only he could have played his own style. He was one of the supporting actors in Lawrence Kasdan's Grand Canyon(1991). Even though the cast is rich on paper, the whole plot is turning around Paul Newman. No one is able to come closer to him, and he acts only with his self-belief. From my point of view, the main issue is not the script nor the cheapness of the story telling methods. Nobody but Benton and Newman, is in the mood of making a movie. Gene Hackman, James Garner, Stockard Channing spoil the story. So many stars make it darker. Only Newman and Sarandon could have been enough to fill the cast, since the storyline is so simple.",
         "The script is weak but the acting is another story. What a cast, even if Newman is getting a little long in the tooth to be playing a P.I. Hackman, Garner and Sarandan are all very watchable as a trio of conniving types hiding a deep, dark, 20-year-old secret. You can pretty much guess what it is early on, but the reason for seeing this thriller is not for the plot but to watch four veterans in action."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Cinehaus",
         "Paramount Pictures",
         "Scott Rudin Productions"
      ],
      "summaries": ["A retired ex-cop and private detective (Newman) who lives with a rich actor (Hackman) who is dying from cancer and his actress wife (Sarandon) gets mixed up in murder when he is asked to deliver blackmail money. He walks into a 20 year old case involving the mysterious disappearance of the actress's former husband. James Garner appears as another ex-cop who also does occasional errands for the couple."],
      "budget": 20000000
   },
   "movielensId": 1791,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-03-06",
      "dvdReleaseDate": "1998-10-07",
      "directors": ["Robert Benton"],
      "runtime": 94,
      "movieId": 1791,
      "title": "Twilight",
      "mpaa": "R",
      "actors": [
         "Paul Newman",
         "Susan Sarandon",
         "Gene Hackman",
         "Reese Witherspoon",
         "Stockard Channing",
         "James Garner",
         "Giancarlo Esposito",
         "Liev Schreiber",
         "Margo Martindale",
         "John Spencer",
         "M. Emmet Walsh",
         "Peter Gregory"
      ],
      "imdbMovieId": "0119594",
      "originalTitle": "Twilight",
      "genres": [
         "Drama",
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["aVpmXSFr-MU"],
      "plotSummary": "A retired ex-cop and private detective gets mixed up in murder when he is asked to deliver blackmail money and walks into a 20 year old case involving the mysterious disappearance of an actress' former husband.",
      "tmdbMovieId": 26269,
      "avgRating": 2.90559,
      "releaseYear": "1998",
      "numRatings": 572,
      "posterPath": "/1G9PZLULbbIrb74H6BdhQGplCxf.jpg"
   }
}