{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "obsessive love",
            "id": 159278
         },
         {
            "name": "actor",
            "id": 207716
         }
      ],
      "imdb_id": "tt0119574",
      "video": false,
      "title": "Love and Death on Long Island",
      "recommendations": [
         44657,
         195114,
         230951,
         190574,
         196534,
         195092,
         240636,
         14358,
         152611,
         25099,
         76297,
         83732,
         111883,
         94597,
         42134,
         31281,
         61418,
         43219,
         105560,
         19214
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Giles De'Ath",
               "gender": 2,
               "credit_id": "52fe4734c3a36847f8128ce5",
               "name": "John Hurt",
               "profile_path": "/rpuH2YRLpxJjMxHq4T1QdOSVtlN.jpg",
               "id": 5049,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Ronnie Bostock",
               "gender": 2,
               "credit_id": "52fe4734c3a36847f8128ce1",
               "name": "Jason Priestley",
               "profile_path": "/skXfFcbZWPOBomGBSTMfiyzgi6q.jpg",
               "id": 19143,
               "order": 1
            },
            {
               "cast_id": 1011,
               "character": "Mrs. Barker",
               "gender": 1,
               "credit_id": "547d02e6c3a3685b000042ac",
               "name": "Sheila Hancock",
               "profile_path": "/ex0nkKMoIFq1nsVHZsNmSGWafkt.jpg",
               "id": 93839,
               "order": 2
            },
            {
               "cast_id": 1010,
               "character": "Irving 'Irv' Buckmuller",
               "gender": 2,
               "credit_id": "547d02c792514123ef002101",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Audrey",
               "gender": 1,
               "credit_id": "547d027592514123ef0020f0",
               "name": "Fiona Loewi",
               "profile_path": "/V6F6CQtdT5dH5lMjCtwfcYJgMY.jpg",
               "id": 55153,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Lou",
               "gender": 2,
               "credit_id": "547d02999251412d75003716",
               "name": "Harvey Atkin",
               "profile_path": "/nH8qRU3GHTsTzOZnokPDpY5ko2B.jpg",
               "id": 108890,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Henry",
               "gender": 2,
               "credit_id": "547d02a8c3a36841e10009f8",
               "name": "Gawn Grainger",
               "profile_path": "/bcQy1lg4RGPamA6EGULQy20rXDR.jpg",
               "id": 189427,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "Mrs. Reed",
               "gender": 0,
               "credit_id": "547d02b59251412d7f003d5f",
               "name": "Elizabeth Quinn",
               "profile_path": null,
               "id": 1392527,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4734c3a36847f8128cdd",
               "name": "Richard Kwietniowski",
               "profile_path": "/vVuTaLd2h29Hc1ieLHBhUq9nWA6.jpg",
               "id": 228797,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4734c3a36847f8128ceb",
               "name": "Gilbert Adair",
               "profile_path": "/eWobvNyIPhrJ8kTf59jJqgxylAB.jpg",
               "id": 16333,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4734c3a36847f8128cf1",
               "name": "Richard Kwietniowski",
               "profile_path": "/vVuTaLd2h29Hc1ieLHBhUq9nWA6.jpg",
               "id": 228797,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.511207,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 47452,
      "vote_count": 14,
      "budget": 0,
      "overview": "Giles De'Ath is a widower who doesn't like anything modern. He goes to movies and falls in love with film star, Ronnie Bostock. He then investigates everything about the movie and Ronnie. After that he travels to Long Island city where Ronnie lives and meets him, pretending that Ronnie is a great actor and that's why Giles admires him.",
      "similar": [
         28468,
         1024,
         24420,
         27066,
         1259,
         1903,
         38,
         1643,
         316021,
         158907,
         705,
         20024,
         9769,
         23949,
         49950,
         2470,
         10995,
         12531,
         17612,
         19913
      ],
      "original_title": "Love and Death on Long Island",
      "runtime": 93,
      "poster_path": "/ajcYe8jGil6NSyUQ6KkMIcNUXBI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Screen Productions",
            "id": 12745,
            "origin_country": "GB"
         }
      ],
      "release_date": "1997-01-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Kwietniowski"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Gilbert Adair",
         "Richard Kwietniowski"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119574/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0MDUwNjM3N15BMl5BanBnXkFtZTcwMjg0NTkxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: John Hurt, Jason Priestley, Fiona Loewi | See full cast and crew »"],
      "reviews": [
         "Anonymous (that prolific author) of Swarthmore (see below) has ably dealt with the plot line. Suffice to say that, echoing \"Death in Venice\" and \"Lolita,\" stuffy old English haute culture writer Giles De'Ath (John Hurt) becomes obsessed by American teen junk movie starlet Ronnie Bostock (Jason Priestley) and goes to Long Island to seek out the gorgeous creature in its habitat. And, unlike Gustav in Venice who perved from afar, Giles actually befriends the creature and its girlfriend. Despite Giles's (comparative) intellect, it's not terribly likely that even a dim heterosexual lad like Ronnie is going to be persuaded to go off into the setting sun with Giles who is an old 60 and crusty with it, but it's fun watching Giles trying to make it happen. There are some interesting interchanges - a touch of Nabokov as European high culture brushes with American pop culture, largely in mutual incomprehension, though Ronnie is pointed to a little useful American culture (Walt Whitman) by his unexpected English visitor. John Hurt, once a creepy Caligula in the 1970's TV version of \"I, Claudius\" and later the protagonist in \"The Elephant Man\" does a perfect Giles with wild emotion just in check beneath the old fogey exterior. He looks and acts very much the same as another great English actor, Michael Gough did as Ruskin, another literary panjandrum barely able to contain himself. I was also reminded of the late Sir Kingsley Amis, an angry young man and an engaging writer in his day who became a rather sorry figure in old age, bereft of his talent and full of spleen and booze. Giles, though, is much more controlled. Jason Priestley of \"Beverley Hills 90210\" is also perfectly cast, though he doesn't have to do more than be Brandon, the nice all-American male bimbo. As Ronnies' girlfriend Audrey, Fiona Loewi does a subtle job. Initially appearing to be no brighter than Ronnie, Audrey reads the situation much more quickly than he does. Or at least her turf protection instincts are pretty acute. There are nicely observed minor roles from Sheila Hancock as Giles's housekeeper, Elizabeth Quinn as a motel proprietor and Maury Chaykin as Irv, chef at the local Diner. Locationwise, this film is a bit of a fraud. Having promised us Long Island in the title (and storyline), the producers gave us Halifax, Nova Scotia instead, in return apparently for a bit of government film corporation money. Well, it looks the same as Long Island, but if I were the Nova Scotia film corp. people I'd feel a bit foolish. What's the point in using public money to promote your local landscape and character when people think its somewhere else? It's true most films can be made anywhere (look what comes out of Fox in Sydney) but in some films the geography is crucial. I just hope they don't make \"Shipping News\" in Long Island instead of Newfoundland.",
         "What a wonderful piece of acting John Hurt gives us as Giles a naive English writer visiting Long Isalnd for the first time. Completely obsessed with the discovery of all the modern electronic gadgetry, he purchases TV and video equipment, shuts himself away and enters a new and exciting world. He becomes besotted with the image of a handsome young actor Ronnie Bostock (Jason Priestley) a favourite among teen-age movie-goers. It's as if he is starting a completely new life with a new warmth he has never known before. The urge to help Ronnie in his career so that he will always be close to him is the predominant theme of the film. John Hurt's performance as the older man restraining his true feelings for a handsome young man of another generation is faultless and truly absorbing. Conversations between the two men are the highlights of the film and the confession scene extremely moving. Ronnie Bostock's girl friend Audrey ( Fiona Loewi) is both charming and beautiful and adds a sweet touch to the story. She is responsible for bringing the writer and actor together. The story is punctuated with little episodes of wry humour brought about by people who live entirely different lives. Altogether a very satisfying film that shows how some of us live in a cocoon unaware of the extreme joy and subsequent disappointment that lies beyond.",
         "After viewing this film I wished it was 20 years ago, back when you were allowed to just stay in your chair and see the show a second time. John Hurt is astounding as an English author who discovers beauty the last place he'd expect to find it - in an American \"B\" movie actor's performances. Hurt's character, Dr. De'Ath, is a true original, totally out of step with the 20th century. He simply had no need nor interest in modernizing his ways. He stumbles upon the work of Ronnie Bostock (Jason Priestley, in a heckuva good, self-effacing performance) and sees in him talent and passion. That's about all I can say without going too far into plot - but if I were able to physically compel people to see it, I certainly would. It's a lovely piece of work.",
         "Teaming a veteran like John Hurt with Jason Priestley would seem to be a casting director's nightmare. Surprisingly, this film takes that premise and runs with it - very convincingly. John Hurt plays a tired, lonely writer (Giles) who is completely out of touch with the modern world, and Jason Priestley, in a touching and thoughtful performance (keep in mind that part of his performance is self-parody), is the object of Hurt's desire. Hurt first comes across Priestly as, \"Ronnie Bostock,\" a forgettable, hunky presence in Grade-Z cinematic atrocities like, \"Hotpants College II.\" Some viewers have mistakenly seen this film as a reworking of Mann's, \"Death in Venice,\" but this film is different: while retaining the poignancy of old age (Hurt), it injects new life into Pristley's character, and allows the viewer to think of him as much more than an object, fruitlessly pursued. There is a key scene at a roadside café late in the film, where Hurt makes an offer he has no right to offer, and Priestley is confronted with a choice he shouldn't have to make. It is a key moment in the film, beautifully handled by both actors, and illustrates the simple power of human drama, devoid of a $100,000,000 special effects budget. And there is, thank God, no happy, artificial, manufactured resolution. This is a film for connoisseurs, and is well worth a look. One last note: the explicit \"gayness\" of John Hurt's character brought out the worst in some homophobic critics. Their whining only validated John Hurt's performance. Giles is paranoid and defensive because he's never been offered an alternative. Society has not treated Giles with either civility or decency, and he bears the scars of that mistreatment. A life lived in the closet is a waste, and Giles' insular life, uncontaminated by humanity, is a brutal commentary on the destructiveness of such an existence. Both Ronnie and Giles, one straight man and one gay man, are prisoners of society and the quality of their lives, to society's discredit, have been needlessly compromised and diminished. A wonderful film and a deeply disturbing commentary.",
         "\"A puerile romp without a single redeeming feature.\" That's what an imaginary Sight and Sound review gives the trashy teenage exploitation film Hotpants College 2. However, for \"erstwhile fogey\" and famous English writer Giles De'Ath (John Hurt) this Porky-esque flick, which he watches purely by accident (he meant to see an E.M Forster adaptation) has one very redeeming grace. It contains the love of Giles' life \u0096 Ronnie Bostock (Jason Priestley). This witty and poignant film, which divides itself between London and Long Island, may have faltered badly if it had been left in lesser hands than John Hurt. However, Hurt is simply mesmerising. He is one of the few actors who never shies away from making the audience utterly ill at ease \u0096 watch 1984, the monster shooting out of his stomach in Alien or The Elephant Man for confirmation. Self-exiled from the modern world in his stuffy flat, with a picture of his recently deceased wife by his writing desk, and a fussy maid (Sheila Hancock) tending to his every whim, Giles' emotions are thoroughly repressed. Until, that is, fate lends a hand and exposes Giles to, amongst other things, terrible American teenage movies, video stores, fax machines, One Man and His Dog, and, finally, to his own sexual desires. Love and Death in Long Island is brimming with quirky cameos, including weirdo diner owner Irv (Maury Chaykin), a motel manager (Elizabeth Quinn) reminiscent of Shelley Winters in Lolita, and a surprisingly good Priestley (lampooning his \"bimbo\" soap background much like Maxwell Caulfield in The Real Blonde). However, it is ultimately a \"warts and all\" performance from Hurt that holds our gaze. Dignified, perplexed and slightly tragic, Hurt makes Giles one of the most touching \"stalkers\" in film history. Much like James Mason's Humbert in Lolita, Giles is a man of culture finding beauty in youth, in coarseness - in \"all that I myself have never been.\" Ultimately, a slow, witty work with one outstanding feature.",
         "John Hurt is a great actor, and his performance in this film shows just how great. There have been plenty of reviews here that detail the plot and the essential characteristics of Giles De'Ath. What struck me even more on seeing the film a second time is what an extraordinary balancing act Hurt pulls off. De'Ath could so easily have been a caricature, a bumbling old fogey; Hurt shows that, while he is indeed out of touch, he is also highly intelligent and unapologetic about his fusty ways - and he also has the imagination to broaden his horizons. There were some lovely scenes showing other people's amused reactions to his naivety about modern ways, particularly those with his agent. I've never seen Jason Priestley in anything else (hey, does that mean I'm like De'Ath, an old fuddy-duddy?), but he certainly holds his own in the face of an acting titan, just as Brendan Fraser did in Gods & Monsters - and yes, there are a LOT of similarities between the two films. And I really enjoyed Fiona Loewi's performance as his girlfriend - what else has she done? The smaller roles were extremely well cast (as others have noted, Maury Chaykin is a treat), even De'Ath's sister-in-law, who is only in one brief scene, but conveys a lot about how highbrow and inaccessible his novels are considered to be. I'm also not the only one who has noticed echoes of Death in Venice, not only in the title and the storyline, but also, I'll swear at one point there was a Mahler symphony playing on the soundtrack - was that another nod? Then there is the artistic convention of the older mentor and the younger muse, which is explicitly raised in the film. There are a lot of interesting ideas about the nature of love, and about how even the most set in their ways can suddenly find a new lease of life. This is a film that rewards more than one viewing. See it if only for a truly majestic performance from John Hurt, a masterclass in subtlety, defiance and thwarted passion.",
         "\"Do you own a word processor?\" \"I WRITE. I do not PROCESS words.\" Giles De'Ath is a frail man on the verge of suffocating on high 19th century culture: he is sheltered within cafes, cigars, E.M. Forster, and presentations of lectures like \"The Death of the Future.\" As one radio commentator asks him, \"Does the 20th century play ANY part in your life?\" Giles is utterly changed by witnessing truly LOW culture on the big screen, the film Hotpants College II that he mistakes for E.M. Forster's Eternal Moment. Upon going for a second viewing, Giles is ashamed of even saying the name of the movie at first. He is mesmerized by the image of one Ronnie Bostock, Mikey in the film, a waiter who gets pushed around and finally shoved onto a restaurant counter and covered with ketchup, making Mikey a Christlike martyr for the Porky's generation. When the movie fades to black and the end credits come up, the name RONNIE BOSTOCK literally shines through the eyes of Giles De'Ath. So begins Giles' reluctant but determined search for this Bostock. He's seen all Ronnie's films and is transfixed by his image (indeed, Ronnie's movies are the first thing he's ever seen on a TV or a film screen.) The second act of the movie takes Mr. De'Ath to Chesterton, Long Island- the home of Ronnie Bostock. De'Ath learns little by little about the modern American culture as he amusingly stalks his way into Ronnie's home. He offers his devotion to the career of Ronnie Bostock, who has decided he wants to be taken seriously as an actor. Giles introduces him to an idea for a movie: a deaf-mute who has never been outside in the real world, who in fantasy is surrounded only by white, empty space, has in his possession a television to look outwards. After enough images, this childlike deaf-mute wants to experience the real world and must do it through fulfilling the quest of falling in love. Bostock loves the idea, but he just doesn't GET it about Giles. That's DE'ATH's story. (It's strange when seeing the vision of Priestley in that script. I found myself wondering the effect of Teletubbies upon children, who may be both deaf and mute in certain ways and learn how to reach out towards reality through surreal television images. It's both troubling and poignant...) Giles De'Ath is in love with the image of Ronnie Bostock: regardless of how low his movies are, Ronnie has a \"file of smiles\" for different emotions, \"a permanence\" in his look. His martyred state on the counter resembles old paintings. His film work is what Shakespeare would have done as both his comedies and Hotpants College 2 were made \"for the rabble in the pit.\" However, Giles, somewhere along the way, realizes that he is ALSO \"completely, desperately\" in love with Ronnie Bostock. I won't give away the ending. The film is low-budget, short, and it has basically only two developed characters. It doesn't have much of an effect afterwards, but it has real poetry to it, especially in Hurt's transformation from high culture shelter to low culture inspiration. I'm still not sure if this is a high-culture indie making fun of low culture, or a low culture movie trying to justify itself, as Giles tries to do for Ronnie. One reason I hated Boogie Nights, among many, is that it wanted us to sympathize with Mark Wahlberg's porn star but also allowed us to distance ourselves from him and laugh AT him anytime we wanted: that's cheating. This film gets it right- it's not sarcastic about Ronnie's work, though certainly we have reasons to laugh at it. We have to draw our own conclusions about these characters, about the LOVE we see that Giles has for the star. Is this REAL love, or is it even more than that? I'm a lover of film, and there are images that I see that I will pause, and play in slow motion, especially now with quicktime clips on the Mac: the poetry of a certain face, like that of Jodhi May(Alice) in Last of the Mohicans right before she jumps off the cliff. There's a love there for her, for her image, that is indescribable for me, so I can appreciate and truly relish the story of a man enamored by an image. I'm also always glad to see a film about a man who finds inspiration in modernity. We know by the end that Giles is entering a new kind of life: perhaps \"The De'Ath of the Future\" is somebody who accepts all culture. He sees the low in the high and the high in the low, and he makes no distinction between the \"art\" of images in the art gallery and those of your everyday teen flick.",
         "John Hurt just doesn't get the credit he deserves, I think. He's a consistently great actor who often adds so much more to a film than many other bigger names would. This film is a prime example of him taking a role and truly making it his own. Hurt plays Giles De'Ath, a most formal English author who, as a radio interviewer puts it, doesn't have much use for the 20th century. He would have even less use for a movie named 'Hotpants College II,' except that when he accidentally happens to view it, he's struck like a thunderbolt by the vision of an actor on the screen, Ronnie Bostock, played by Jason Priestly. From that moment on, De'Ath comes to life in his obsession for the young man and his elaborate plans to meet him. Having been taken care of by a housekeeper these many years, De'Ath struggles with the most ordinary tasks as he lives out his obsession. He buys teenage girls' magazines at the newsstand and furtively disposes of them lest anyone find out his secret. He purchases a videocassette recorder to watch Ronnie's films, not realizing that a television is also necessary for their viewing. Then when he goes to Bostock's home town on Long Island in hopes of tracking him down, he's almost like The Man Who Fell to Earth, being alone in such an alien culture. His behavior is as obsessive as any stalker, but he must be the most genteel stalker there ever was. Watching Hurt go through this routine during the movie's first half is so fascinating and so entertaining that the film actually hits a bit of a stall when he finally does meets the object of his desire, but it rights itself quickly and comes to a nice conclusion. Some might hope for a more wildly dramatic ending, but I was satisfied. Jason Priestly does a fine job here in what is basically a thankless role, in that by this film's nature, he's constantly upstaged by Hurt's performance, like Othello is by Iago, or Nick Nolte was by Eddie Murphy in '48 HRS.,' if that's not too jolting of a comparison. I found it fascinating, what some might call a \"little\" film except that it displays some large talents.",
         "Locked out of his apartment, old-fashioned writer Giles De'Ath (John Hurt) almost reluctantly decides to take in a movie. Accidentally wandering in to see Hot Pants College II instead of the E.M. Forster adaptation for which he bought a ticket, the lonely man becomes transfixed by the sight of a hunky actor (Jason Priestley) and begins an obsession that makes for a thoroughly satisfying and entertaining story. First-time director Kwietniowski expertly observes the wildly disparate natures of these two men while keeping both of them entirely credible and believable. I particularly enjoyed Giles' compilation of Ronnie Bostock clippings from teeny-bopper magazines, carefully arranged and titled \"Bostockiana\" before being securely locked away in a desk drawer.",
         "In the climax scene when John Hurt finally confesses to Jason Priestley why he's insinuated himself into his life, Hurt brings up such couples as Paul Verlaine and Arthur Rimbaud, Jean Cocteau and Raymond Ratiguet. Watching the film I thought of another of Cocteau's famous same sex liaisons, Cocteau and actor Jean Marais. It seems closest to what Hurt fantasizes for himself with Priestley. With an obvious bow to Thomas Mann who wrote about a similar story in Rome, Love And Death On Long Island concerns a middle aged writer with the gruesome name of Giles De'Ath played by John Hurt. He's a cultured gay man who lives alone and has pretty much let life pass him by. He does without television, a computer, but is persuaded to go to the cinema in London which he hasn't visited in over 20 years because an adaption of one of E.M. Forster's stories is on the bill. Instead he buys a ticket for a teen sex comedy flick, Hot Pants College II and is struck dumb by the physical beauty of one of the cast members, Jason Priestley. It happens to all of us be it the same or the opposite sex, but Hurt decides he has to get close to him and never mind those pesky laws about stalking. He researches his love object from, where else, those adolescent teen magazines. And finding out he lives in the Hamptons out in Suffolk County, Hurt goes to America and then takes that long ride from Penn Station out to the Hamptons to see if he can arrange an 'accidental' meeting. It works beyond Hurt's wildest expectation, though Priestley's girl friend, fashion model Fiona Loewi doesn't know quite what to make of Hurt. How it all ends you have to see the film for. Jason Priestley certainly didn't have to do much research to play teen idol Ronnie Bostock. He was fresh from 90210 as Brandon Walsh and certainly his life was its own research. He could have played it shallow and that would have been an easy and acceptable way out, but Priestley taps some deeper emotions in his performance. Love And Death On Long Island was shot on Nova Scotia which certainly passes for the Hamptons. This review is dedicated to that duo that Hurt had aspiration of emulating, Jean Cocteau and Jean Marais."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "British Broadcasting Corporation (BBC)",
         "British Screen Productions"
      ],
      "summaries": [
         "Giles De'Ath is a widower who doesn't like anything modern. He goes to movies and falls in love with film star, Ronnie Bostock. He then investigates everything about the movie and Ronnie. After that he travels to Long Island city where Ronnie lives and meets him, pretending that Ronnie is a great actor and that's why Giles admires him.",
         "Giles De'Ath, a widower, stuffy British author, gets locked out of his house one day and opts to see an E.M. Forster adaptation at a local cinema to pass the time. He mistakenly goes into the wrong theater and, as he is about to leave the puerile American film, notices a young actor who immediately strikes his fancy. From there, we go on a journey with Giles as his obsession with the mediocre young actor goes from slight interest to a real obsession. This evolution ultimately brings him to Chesterton, Long Island, home of the actor. His miraculous encounter with the lad in some ways pushes the reserved Brit's emotional threshold over the top."
      ],
      "budget": 0
   },
   "movielensId": 1794,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["Richard Kwietniowski"],
      "runtime": 93,
      "movieId": 1794,
      "title": "Love and Death on Long Island",
      "mpaa": "",
      "actors": [
         "John Hurt",
         "Jason Priestley",
         "Sheila Hancock",
         "Maury Chaykin",
         "Fiona Loewi",
         "Harvey Atkin",
         "Gawn Grainger",
         "Elizabeth Quinn"
      ],
      "imdbMovieId": "0119574",
      "originalTitle": "Love and Death on Long Island",
      "genres": [
         "Drama",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": ["6_QbBvZ_Prc"],
      "plotSummary": "Giles De'Ath is a widower who doesn't like anything modern. He goes to movies and falls in love with film star, Ronnie Bostock. He then investigates everything about the movie and Ronnie. After that he travels to Long Island city where Ronnie lives and meets him, pretending that Ronnie is a great actor and that's why Giles admires him.",
      "tmdbMovieId": 47452,
      "avgRating": 3.51435,
      "releaseYear": "1997",
      "numRatings": 1254,
      "posterPath": "/ajcYe8jGil6NSyUQ6KkMIcNUXBI.jpg"
   }
}