{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "climbing",
            "id": 8624
         },
         {
            "name": "imax",
            "id": 156395
         },
         {
            "name": "mountain climbing",
            "id": 159212
         },
         {
            "name": "mountaineering",
            "id": 160177
         },
         {
            "name": "mount everest",
            "id": 192779
         }
      ],
      "imdb_id": "tt0120661",
      "video": false,
      "title": "Everest",
      "recommendations": [
         90582,
         41288,
         9977,
         21710,
         35555,
         71905,
         52906,
         68213,
         14278,
         49721,
         16151,
         90873,
         15932,
         18116,
         81899
      ],
      "backdrop_path": "/5M1N9DZJseKjwWPwYfcpyDbn69Q.jpg",
      "revenue": 76447420,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe4425c3a368484e012035",
               "name": "Liam Neeson",
               "profile_path": "/9mdAohLsDu36WaXV2N3SQ388bvz.jpg",
               "id": 3896,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Summit Team Leader, USA",
               "gender": 2,
               "credit_id": "52fe4425c3a368484e012039",
               "name": "Ed Viesturs",
               "profile_path": "/osvNB4z05NqhAONWAKlQMIEhmVO.jpg",
               "id": 135673,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Summit Team, USA",
               "gender": 2,
               "credit_id": "52fe4425c3a368484e01203d",
               "name": "David Breashears",
               "profile_path": null,
               "id": 86557,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mountain Climber",
               "gender": 1,
               "credit_id": "52fe4425c3a368484e012041",
               "name": "Tracy Pfau",
               "profile_path": null,
               "id": 136283,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "53aa6eb8c3a3684cf5000f7f",
               "name": "Lhakpa Dorji",
               "profile_path": null,
               "id": 239171,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4425c3a368484e012025",
               "name": "David Breashears",
               "profile_path": null,
               "id": 86557,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4425c3a368484e01202b",
               "name": "Stephen Judson",
               "profile_path": null,
               "id": 90225,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4425c3a368484e012031",
               "name": "Greg MacGillivray",
               "profile_path": null,
               "id": 90223,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4425c3a368484e012047",
               "name": "Tim Cahill",
               "profile_path": null,
               "id": 90224,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4425c3a368484e01204d",
               "name": "Stephen Judson",
               "profile_path": null,
               "id": 90225,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59382b209251414ccd000b32",
               "name": "George Harrison",
               "profile_path": "/3U4WXM0pNb7ob7gvQCnZ3sJYgB9.jpg",
               "id": 10593,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 6.642215,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21736,
      "vote_count": 23,
      "budget": 0,
      "overview": "An international team of climbers ascends Mt. Everest in the spring of 1996. The film depicts their lengthy preparations for the climb, their trek to the summit, and their successful return to Base Camp. It also shows many of the challenges the group faced, including avalanches, lack of oxygen, treacherous ice walls, and a deadly blizzard.",
      "similar": [
         16436,
         253412,
         9350,
         30329,
         11678,
         17700,
         46636,
         318279,
         50081,
         57612,
         59248,
         133441,
         23282,
         36123,
         195124,
         78394,
         18493,
         370362,
         90056,
         92837
      ],
      "original_title": "Everest",
      "runtime": 44,
      "poster_path": "/jZxTpFz6mbJrr3Y8pjK6TnBWBgE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MacGillivray Freeman Films",
            "id": 2753,
            "origin_country": ""
         },
         {
            "logo_path": "/yBdvUlunhXyUowuy0XaEPuBtYTo.png",
            "name": "IMAX",
            "id": 3447,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arcturus Motion Pictures",
            "id": 4157,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Polartec",
            "id": 4158,
            "origin_country": ""
         }
      ],
      "release_date": "1998-03-06",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Towering above everything you have seen before.",
      "adult": false,
      "homepage": "http://www.everestfilm.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "David Breashears",
         "Stephen Judson"
      ],
      "runtime": 44,
      "synopsis": null,
      "writers": [
         "Tim Cahill",
         "Stephen Judson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120661/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwNzA0ODg1OV5BMl5BanBnXkFtZTcwMzA3MDUxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Liam Neeson, Lhakpa Dorji, Dorje Sherpa | See full cast and crew »"],
      "reviews": [
         "A lot of times I browse through other reviews when contemplating what I want to say about a movie, and never have I been more disturbed than by reading people's reviews of this film. One IMDb reviewer placed a post on the page for Everest (2005) in which he attacked Jon Krakauer, author of the spectacular novel Into Thin Air, not only of selfishly misrepresenting the actions of people on the mountain, but also of sleeping away in his tent while people were stuck outside freezing. Bruce Kirkland, writing for Jam! Movies, stupidly claims that Araceli Sgarra was in the movie simply as sex appeal and, even worse, that 'members of at least one climbing team just crawled back in their tents and ignored the crisis.' Normally this wouldn't be such a big deal. So a bunch of boneheads completely missed the point and clearly have no idea about what really happened on the mountain, and are just writing reviews pretending like they have some right to criticize events and actions that they don't understand, right? Wrong. First of all, Mr. Kirkland displays a prodigious capacity for ignorance, apparently having managed to sit through this entire film and still not realize that no climber on earth could make it to the top of Everest without massive climbing skills. So much for that ridiculous little 'sex appeal' theory. The first Spanish woman ever to reach the summit of Everest, and this moron can do nothing but call her sex appeal. Please. Second, there is nothing worse than people making accusations when they clearly have not read Krakauer's book. The IMAX expedition simply coincided with the tragic events that unfolded on Mt. Everest in May of 1996, it is not a documentary of those events. This is why the movie does not go into detail about what happens besides Liam Neeson describing them briefly in the voice-over, and is also why we now have so many people posting scathing reviews about a tragedy that they know nothing about. I would love to see the expression on one of these people's faces if they were asked why May 1996 was the deadliest month in the history of Everest, and yet given the statistics, actually had less deaths than the average year. The people that 'just crawled back in their tents and ignored the crisis,' a group of people which included Jon Krakauer himself, did so for three reasons. First, because they were literally freezing to death. Frostbite had long since begun to set in, they were in the middle of a high-altitude storm, and the wind-chill was such that it would make short work of warm-blooded humans stuck in it. Second, because they were so exhausted that they could barely move. Please remember that these people, at that altitude, could only take a few steps before having to lean over their ice-axes, panting for breath in the dangerously thin air. It does not require a cognitive workout to realize that for people who can hardly stand up to attempt a rescue effort would do nothing but add themselves to the death toll. Third, and most importantly, they didn't even know that there was a tragedy unfolding outside. It is more than a little difficult, Mr. Kirkland, to 'ignore' events that you don't even know are occurring. In Into Thin Air, tragedy does not begin to unfold until almost 300 pages into the book, the IMAX movie passes that point in less than 15 minutes. The point was not to document the tragedies that unfolded, but to give viewers an unparalleled look at Mt. Everest itself, a monumental task at which it is hugely successful. I just wish there was more stock footage and less re-enactments, because there were scenes immediately recognizable from the book that were clearly not shot on location or during the actual events, like the conversation with the stranded Rob Hall. I have no illusions. I'll probably never even set foot in Nepal, and would never make it to the top of Mt. Everest even I did. Director David Breashears not only went to the top, but brought along an IMAX camera so the rest of us could see it, too. In a startling act of heroism, when he and his team learned of the tragic events occurring at higher altitudes, as they were on their way up, they immediately abandoned their $5.5 million IMAX project to participate in the rescue effort, providing their more than 300 pounds of oxygen canisters to whoever needed them. It was not until the rescue effort had saved as many lives as they could that the IMAX team regrouped to decide whether they should still try to salvage their film project. While I was not able to see Everest at an IMAX theater, I was still impressed with it on the small screen, probably because I had read Into Thin Air literally the day before I watched this film, and was able appreciate what these people went through on their expeditions. There are a lot of reviewers on the IMDb who say the movie is pointless to watch on a small screen, but it is only pointless if your imagination is so small that a smaller presentation is not enough for you to understand the sheer magnitude of the event. I could have done without the Jurassic Park music throughout the film, because it only tries to add to the greatness of the mountain, the expeditions, and the people involved, when no augmentation was necessary. It is not because the screen is small that the music seems trite, but because it's not necessary. Everest's soundtrack could have been nothing but wind across the microphone and it would have been more than sufficient. Since I had read the book so soon before I watched the movie, I had an unfair expectation to see more coverage of the events that I had read about, because Jon Krakauer goes into stunning detail, covering every aspect of the expedition. It was not until I read some reviews of Everest, particularly on the IMDb, when I really appreciated the quality of the film and was startled by the idiocy of the people writing about it. The film is marketed by its connection with Into Thin Air, but unfortunately its association with that book only detracts from the movie because of its separation from it. Associating it with the book gives the impression that it will cover some of the same events, which it does with unfortunate brevity, and worst of all, the association of the film with Krakauer's book gives some viewers the impression that they know what happened on the mountain just because they have seen this film. No one who has not read Into Thin Air has any right whatsoever to criticize anything that happened on Mt. Everest in May 1996.",
         "Some of the camera work in this IMAX feature is absolutely stunning. And the mere fact that the crew was able to lug a bulky, heavy IMAX camera and film to the summit of Everest is a testament to sheer guts and determination. Unfortunately, the end result is somewhat of a mixed bag. There are moments of great emotional intensity (most notably, the miraculous Beck Weathers rescue), but, like a few others here, I got the feeling that much of the potential of the IMAX format simply went to waste. IMAX is, after all, an overwhelmingly visual medium, so why waste so much time on trying to create a Hollywood style `story' out of it? I mean, if I had gone to all the effort of getting that camera to the top, I'd have damned well given the audience some spectacular panoramic shots of the view from the summit instead of wasting valuable footage on two climbers hugging each other (a scene that would have worked just fine if shot on plain old videotape). In summation, this film has some truly amazing moments, but as a whole, it seems the creators failed to use the IMAX format to the maximum potential. PS: The DVD version contains lots of good supplementary material, in fact, the `making of the film'",
         "I thought this was an amazing movie, whether viewed on IMAX or at home. People who have said they are interested in seeing the story of the Sherpas or how the movie was made should check out the special features on the DVD, Broughton Coburn's book \"Everest,\" or Jamling Norgay's book \"Touching My Father's Soul\"; they are all about the climb, Norgay especially devotes time and pages to the Sherpas, considering he is also ethnically a Sherpa, who someone mistakenly said were Tibetan; in fact they are Nepalese. This was an interesting movie in its own right. I don't understand why some reviewers did not enjoy the back stories and time devoted to the climbers' emotions and personal lives...would you rather watch a movie about people you didn't empathise with, care about, or even know? I do not think so. Developing the characters of the lead climbers was very important to the movie, I felt. Also, insulting Ed Viesturs is just incomprehensible to me. He is the prominent North American mountaineer of our times, and since the movie was made has ascended all 14 8000 meter peaks without the use of oxygen, a climbing skill he has acquired over many years and excels at. He doesn't do so because he 'likes the challenge' as one reviewer says, but merely because he feels it is a better way of climbing. It should be noted that whenever Viesturs guides mountains he uses oxygen so he can 'be there' for his clients. Viesturs did not have to coerce his wife into coming to Base Camp; she'd been on the mountain before and I believe enjoyed the atmosphere and the climbers. She was worried, of course, about Ed, but since he really had no one to worry about but himself, and I don't think anyone can dispute that Edmund Viesturs can take care of himself, she trusted him to return safely. (There would have been a considerably lower death rate on the mountain if only experienced climbers looking after themselves had climbed that season.) Ed Viesturs WAS a hero of the movie, although he is extremely humble about it, he did considerably assist in the rescue of Makalu Gau and Beck Weathers, as well as coordinating rescue attempts from Camp II, and I have no doubts that had Viesturs been at Camp IV on May 10/11, he would have climbed up and searched for missing climbers himself (most likely using oxygen). If you are not a professional climber yourself, I do not think you have the right to insult the personal practices of a mountaineer like Viesturs, especially when his choices (such as using or not using oxygen) affect, in the long run, only himself, as he was not guiding the peak or responsible for any other climbers at the time. I loved the movie; every time I see it I get chills at the stunning Breashears images of the mountain. I definitely recommend seeing this movie. It represents both the darker, dangerous side of mountaineering and the light, triumphant side.",
         "Typical IMAX movie: impressive mountains, impressive views, impressive falls... very impressive. However, I didn't care about the \"story\", or any of the people in there... In fact, the true heroes in my opinion are the people who went all the way up the Everest *carrying* the IMAX camera... However, you hardly hear about them...",
         "This superb documentary contains beautiful shots of Mt. Everest and its surroundings, as well as discerning cinematography to make us aware of the challenges involved in scaling it. Great on IMAX, without a doubt! \"Everest\" insists on making us know how much oxygen is an issue as well as weather and temperature. There are, of course, other challenges. As to the tragic parties: \"Everest\" does a good job in presenting the logistical problems they faced as their fates were being sealed. Up and down the mountain, at different stations and spots. Though the climbers are obviously brave, their recklessness limits the sympathy we feel for them. But perhaps the most noteworthy thing to take from this film is that it is simply crazy to want to climb Mt. Everest, at least for me. What a great risk of death or permanent bodily harm! More than just a high climb straining your legs!",
         "I have to disagree, I found this amazing to watch, I mean come on! All you have to do is See Mount Everest and I get all googly-eyed. I thought the photography was incredible, and the information on how they get there and why they are helping the geologist is fascinating to a \"civilian\" like me, which is who the movie is for. If you are a true climber then sure I can imagine it might disappoint, but I'm not sure why. This isn't supposed to be the final word on what Everest is like, it's a picture of the ascent of one team, and what it takes to get there. After seeing this gorgeous film I want to try for Everest myself in a few years. Rarely do movies inspire me, but this one did. Go Imax!",
         "I saw this recently at the Space Museum in Hong Kong, and thought it was stunning. The photography was superb, making full use of the whole FOV image possible with IMAX equipment. The documentary was emotive and compelling and the scenes breathtaking. Those scared of heights should probably skip this one!!",
         "Wow, this movie is amazing, I saw it in the IMAX theater and was stunned. the graphics blew me away. The fairly well known story, that was depicted in 'Into Thin Air' is brought to new heights (quite literally) and a new understanding of just how dangerous this mountain is. I liked this movie because of the courage shown by the climbers, the have to face challenge after challenge, but they persevere. Also what really grabbed my attention is how the climbers not only document the story, but also their thoughts for you to see. I have seen many climbing movies, but this just blows them all away, taking mountain filmography to never-before-seen perfection. The scenes and the people are amazing, they have inspired me and I hope they will inspire you also. *Fox*",
         "Human Body at its best.... Endurance, perseverance, and beauty of height on planet Earth. It is a world worth visiting while your stay on planet Earth. Thanks and Regards. Sam Rupani Houston, Texas, United States of America.",
         "I had the opportunity to see this historic achievement in film while it was playing at a near-by IMAX screen. This film is as close as I EVER care to get to that mountain of death. The filmmakers have captured images that are unlike anything ever imagined before. And while most of the story is already well known (through best sellers THE CLIMB and INTO THIN AIR) the film still manages to keep you on the edge of your seat (and on the edge of a crevice). What else could one want? An IMAX movie on how this camera crew shot this film. Prepared to be astounded and blown away!"
      ],
      "genres": [
         "Documentary",
         "Short"
      ],
      "productionCompanies": [
         "Arcturus Motion Pictures",
         "MacGillivray Freeman Films",
         "Polartec"
      ],
      "summaries": ["An international team of climbers ascends Mt. Everest in the spring of 1996. The film depicts their lengthy preparations for the climb, their trek to the summit, and their successful return to Base Camp. It also shows many of the challenges the group faced, including avalanches, lack of oxygen, treacherous ice walls, and a deadly blizzard."],
      "budget": 0
   },
   "movielensId": 1797,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-03-06",
      "dvdReleaseDate": "1999-12-07",
      "directors": [
         "David Breashears",
         "Stephen Judson",
         "Greg MacGillivray"
      ],
      "runtime": 44,
      "movieId": 1797,
      "title": "Everest",
      "mpaa": "G",
      "actors": [
         "Liam Neeson",
         "Ed Viesturs",
         "David Breashears",
         "Tracy Pfau",
         "Lhakpa Dorji"
      ],
      "imdbMovieId": "0120661",
      "originalTitle": "Everest",
      "genres": [
         "Adventure",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An international team of climbers ascends Mt. Everest in the spring of 1996. The film depicts their lengthy preparations for the climb, their trek to the summit, and their successful return to Base Camp. It also shows many of the challenges the group faced, including avalanches, lack of oxygen, treacherous ice walls, and a deadly blizzard.",
      "tmdbMovieId": 21736,
      "avgRating": 3.88787,
      "releaseYear": "1998",
      "numRatings": 2020,
      "posterPath": "/jZxTpFz6mbJrr3Y8pjK6TnBWBgE.jpg"
   }
}