{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "horse",
            "id": 2673
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "fall",
            "id": 6201
         },
         {
            "name": "borderline personality disorder",
            "id": 6846
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "domineering mother",
            "id": 157722
         }
      ],
      "imdb_id": "tt0118744",
      "video": false,
      "title": "Hush",
      "recommendations": [
         23570,
         149553,
         30500,
         73952,
         31083,
         46717,
         37722,
         37234,
         27303,
         31700,
         37431,
         79649,
         30072,
         17770,
         46924,
         69719,
         64523,
         42274,
         161495,
         13440
      ],
      "backdrop_path": "/cEVDBACZSze7LPatlOIpY6tnDxH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Martha Baring",
               "gender": 1,
               "credit_id": "52fe47549251416c750958ed",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Helen Baring",
               "gender": 1,
               "credit_id": "52fe47549251416c750958f1",
               "name": "Gwyneth Paltrow",
               "profile_path": "/8x3jpWD7DEvyMXO1FOjwNdd1UZT.jpg",
               "id": 12052,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jackson Baring",
               "gender": 2,
               "credit_id": "52fe47559251416c750958f5",
               "name": "Johnathon Schaech",
               "profile_path": "/kHB3nmTs5e4QK6f2QoIMxlGPeJ0.jpg",
               "id": 51670,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Alice Baring",
               "gender": 1,
               "credit_id": "52fe47559251416c750958f9",
               "name": "Nina Foch",
               "profile_path": "/jd5qWtnZdEvfwuo57CpJVzazYc0.jpg",
               "id": 13026,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe47559251416c75095909",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sister O'Shaughnessy",
               "gender": 1,
               "credit_id": "52fe47559251416c7509590d",
               "name": "Kaiulani Lee",
               "profile_path": null,
               "id": 140344,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gavin",
               "gender": 2,
               "credit_id": "52fe47559251416c75095911",
               "name": "David Thornton",
               "profile_path": "/jDcmAwRCUYd3QSVEVc9Xq2Yi9Xf.jpg",
               "id": 76526,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dr. Franklin Hill",
               "gender": 2,
               "credit_id": "52fe47559251416c75095915",
               "name": "Hal Holbrook",
               "profile_path": "/snyV5pdXbLxyvf2jJhWFxzuvX0a.jpg",
               "id": 11066,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Hal Bentall",
               "gender": 2,
               "credit_id": "52fe47559251416c75095919",
               "name": "Richard Lineback",
               "profile_path": "/xJCHIMBmigiTcs0wempCfO573yf.jpg",
               "id": 3205,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Clayton Richards",
               "gender": 0,
               "credit_id": "52fe47559251416c7509591d",
               "name": "Richard Kohn",
               "profile_path": null,
               "id": 1167499,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Georgina Richards",
               "gender": 0,
               "credit_id": "52fe47559251416c75095921",
               "name": "Faith Potts",
               "profile_path": null,
               "id": 1167500,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Priest",
               "gender": 0,
               "credit_id": "52fe47559251416c75095925",
               "name": "Tom Story",
               "profile_path": null,
               "id": 115521,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Church Warden",
               "gender": 0,
               "credit_id": "52fe47559251416c75095929",
               "name": "Jolene Carroll",
               "profile_path": null,
               "id": 1167501,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Usher",
               "gender": 0,
               "credit_id": "52fe47559251416c7509592d",
               "name": "Jacob Press",
               "profile_path": null,
               "id": 1167502,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe47559251416c75095931",
               "name": "Joe Inscoe",
               "profile_path": null,
               "id": 20166,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47559251416c75095905",
               "name": "Jonathan Darby",
               "profile_path": null,
               "id": 974699,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5936d6c1c3a368287f000ce8",
               "name": "Jonathan Darby",
               "profile_path": null,
               "id": 974699,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.962473,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17941,
      "vote_count": 63,
      "budget": 0,
      "overview": "Jackson and Helen are in love and about to have their first child when they move in with Jackson's mother, Martha, in order to take care of the family estate. But all is not well in this household. Martha is jealous of her son's affection for Helen, and, despite her Southern smile, she's starting to act strangely. As Helen tries to create a happy home life, Martha attempts to divide the family so that Jackson will become hers alone.",
      "similar": [
         949,
         189,
         298312,
         336843,
         241848,
         654,
         1939,
         8834,
         10285,
         72784,
         9272,
         1923,
         9022,
         2163,
         9411,
         1645,
         313922,
         521,
         302,
         9631
      ],
      "original_title": "Hush",
      "runtime": 95,
      "poster_path": "/wg4QwknfZag1sg7M2biuLJoXAks.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1998-03-06",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Don't breathe a word.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Darby"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Jonathan Darby",
         "Jonathan Darby"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118744/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2OTY1MjY3Nl5BMl5BanBnXkFtZTcwMDYyODcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jessica Lange, Gwyneth Paltrow, Johnathon Schaech | See full cast and crew »"],
      "reviews": [
         "I am quite frankly astonished by the low imdb average for this film. I thought it was a more than respectable suspense thriller. It definitely kept me riveted throughout. Gwenyth Paltrow, who was offered Kate Winslet's part in Titanic at the time she committed to this project, devles into her role as the unsuspecting fiancee with grace and down to earth affability. But this is clearly Jessica Lange's film. Her psychotic mother-in-law is one of the most disturbing characters I have come across in any film. In my opinion this film rates an 8/10.",
         "From the low score it has got from the IMDB users, i didn't expect too much. I only watched it to see Gywneth Paltrow. Indeed, the first half of the film was not too impressive. The scenes tended to be fragmented. As more of the plot was unveiled, the film became intense and engaging. I think this film deserves slightly more points than it has got.",
         "Jonathan Darby is credited with the writing/directing of this misconceived movie. As an auteur, Mr. Darby, doesn't bring anything new to the medium. \"Hush\" proves to be a total waste as it appears Mr. Darby had nothing in the way to control the over the top campy performance of Jessica Lange. Ms. Lange is at her worst as Martha, the evil mother behind all the scheming in the film. Her love for her son, and hatred for her daughter-in-law, gives the actress an opportunity to do some of the worst emoting in any film in recent memory. Gwyneth Paltrow must be questioned for her choice of material. Didn't she smell the aroma in reading the script? Oh well, let's hope she was able to ask for millions of dollars for appearing in this turkey. Jonathan Schaech doesn't fare better. Nina Foch is the only one who comes out the best in her small role of Alice, Martha's wise mother-in-law who has seen right through what's going on. This is a film to watch with friends after having a few drinks, then one might enjoy the \"masterpiece\" some avid fans thought \"Hush\" was.",
         "Though this movie was somewhat slow and predictable it brings out the worst side of Jessica Lange. She had an outstanding performance as the evil Mother-In-Law to Gweneth Paltrow. I have never seen her in a role as evil as this one. I believe that Gweneth showed the strength and heart of her character. She lost both her parents, was mugged in her own home and then stands up to her Mother-In-Law to prove to her husband what an evil person his mother is. Way to go!!! Personally I liked this movie. What the movie doesn't bring out right away is the lengths that \"Martha\" will go to take the baby and keep her son on the farm. This movie is one of the best suspense movies that I've seen in a while.",
         "This film is quite disappointing, especially considering the big names in its cast. Paltrow is good as always, and Lange is convincing too. But the weakest part is the plot. It lacks any coherence and cannot really convince, even if you watch the film without too much attention (like I did). **Warning: major SPOILERS ahead!** The end is the worst: Jackson got very close to his mother - then one morning Helen tells him she tried to kill her, and he immediately believes her, changes his mind and decides to leave. Even worse: having found out that the woman is a deranged murderer who already killed her husband, they just leave her there without doing anything about it (what about calling the police!?), and go on to leave happily ever after. I give it 4 out of 10.",
         "Everybody should just relax and enjoy watching a red hot, middle aged Momma's sexual jealousy over her beautiful daughter in law. The photography was great, loved the rural location (without the stupid horses), and Gwyneth and Jessica look as good as they ever have. The problem is that the director tried too hard for believability, and that resulted in a very average, plodding, sometimes laughably bad movie. If they had taken it over the top, like what you find in good novels, (torture, perversion), then we would have had a classic. Its a shame they held back because Jessica and Gwyneth looked amazing. Who cares if their performances weren't great? Their screen presence made up for it. They were ripe for a deliciously violent, twisted older woman/younger woman B-movie and the director blew it. (Check out Piper Laurie and Sissy Spacek in \"Carrie.\" They set the standard for over the top, twisted mother-daughter action.)",
         "Jackson Baring takes his girlfriend Helen to his family's horse farm Kilronin. Jackson's mother Martha has been running the place but would like her son to take over. Jackson and Helen are living together in New York City and are reluctant to leave that life. But Helen somehow gets pregnant, even though she was using birth control, and the two get married and eventually do take over the farm. Jackson blames himself for his father's death when he was 7. Martha knows the truth but won't tell him, and she seems to have an unnatural relationship with her son. It's almost as if she sees his father and wants to be with him in that way. And she sees the baby as a means of continuing the legacy, but not a child to be loved, at least not in the way most people would. Her treatment of Helen is strange, as if Helen is only useful until the baby is born, and then she will be in the way. The ending is exciting and sort of creepy at the same time. Jessica Lange does a fine job here as Jackson's overly controlling and demented mother. However, Nina Foch gives the standout performance as Jackson's grandmother, who is kept in a fancy nursing home because only she knows the truth about how her son died. I think all the leading actors did a good job here. I usually can't stand Debi Mazar, who was a co-worker to Helen and possibly her boss, but I would like to have seen more of her here. But if Helen had to move out of New York, I guess keeping her job was out of the question. I suppose my favorite scene was the one where Helen gets out of bed naked and meets her mother-in-law for the first time. That one was edited for TV in such a way it seemed kind of jerky and I didn't get to see much, but a lot depends on how one sees this movie. It's not typical of what I like in a movie, but still entertaining.",
         "Jessica Lange commenced her career by following in the (admittedly light) footsteps of Fay Wray. She seems determined to end it by stomping in the heavier footfalls of middle-period Joan Crawford. As the cyclonic star of this film, Lange runs the gamut. She flings her arms around, tugs at her hair, reverts to that coy, sideways glance that implies she's only about, oh, forty five, bellows out in growling chest tones, sobs hysterically - she does, to state it simply, the lot. Which leaves her co-stars understandably bewildered. Gwyneth Paltrow manages to look more annoyed than frightened, and when, in the best Scooby Doo manner, she neatly ties up the loose threads of the plot, annoyance gives way to abject boredom. With her dead fish eyes and droning monotone, Gwyn obviously wants the whole thing over with more than we do. Quite an achievement. And few could blame her. Of all the silly premises that have been put on film, the monster mother is surely the silliest. Its mighty hard to believe that Jessica's Ken doll son has managed to go thirty years without once telling the old cow to put a sock in it. Perhaps I'm a bit obtuse but I still don't quite get the bit about the murder with the suction pump (or whatever it was.) At any rate if some post natal, gormless drip can figure it out surely it shouldn't be taxing the police too much to make an arrest. That would imply real life of course, and Hush has nothing to do with that. If you're in the market for an aged, raging southern belle then you can't go past this, but have a look at the genuine article - Joan Crawford in \"Queen Bee\" - first.",
         "This stands out as a camp classic of the Joseph H. Lewis variety: there's even a threatening gadget, in this case a steam cabinet. Don't go into this expecting a deep movie and you'll have a lot of fun with the deliberately over-the-top characterizations",
         "I don't know whether they give Oscars for casting, but if that is the case, the person responsible for casting for this film must be at least a nominee. I'm just amazed how such established actresses as Lange and Paltrow have been agreed to take part in this 'plot is thinner than silk-paper'-film (blackmailing? ;->). Every scene is predictable and the story itself has been told thousand times. There aren't any camera-angles that make you say 'wow, nobody thought of that before' either, so the end-result is very average. I'm all too aware about the existence of bad mother-in-laws, so this one just didn't cut it for me... 3 out of 10."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["TriStar Pictures"],
      "summaries": [
         "Helen is the young girlfriend of good-looking Jackson Baring. When Helen gets pregnant and marries Jackson, they decide to move to his hometown, Kilronan, and have a baby there. But his mother Martha, who lives there, starts to do weird things, and obviously she's not too friendly to Helen.",
         "Handsome Jackson Baring, heir to grand Southern horse farm Kilronan, choose to build a life in New York while it's run by his domineering mother Martha. When Jackson returns to present his Yankee bride Helen, the young couple gets lured into staying for the Christmastide, then to help Martha save the farm from financial trouble or at least until Jackson son's birth. As cripple grandmother Alice Baring suggested, Martha is playing a ruthless game, just as she lied about the seven year old, traumatized Jackson's father Jack's deadly fall."
      ],
      "budget": 0
   },
   "movielensId": 1798,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-03-06",
      "dvdReleaseDate": "1998-09-15",
      "directors": ["Jonathan Darby"],
      "runtime": 95,
      "movieId": 1798,
      "title": "Hush",
      "mpaa": "PG-13",
      "actors": [
         "Jessica Lange",
         "Gwyneth Paltrow",
         "Johnathon Schaech",
         "Nina Foch",
         "Debi Mazar",
         "Kaiulani Lee",
         "David Thornton",
         "Hal Holbrook",
         "Richard Lineback",
         "Richard Kohn",
         "Faith Potts",
         "Tom Story",
         "Jolene Carroll",
         "Jacob Press",
         "Joe Inscoe"
      ],
      "imdbMovieId": "0118744",
      "originalTitle": "Hush",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["-4ND1MUvcXA"],
      "plotSummary": "Jackson and Helen are in love and about to have their first child when they move in with Jackson's mother, Martha, in order to take care of the family estate. But all is not well in this household. Martha is jealous of her son's affection for Helen, and, despite her Southern smile, she's starting to act strangely. As Helen tries to create a happy home life, Martha attempts to divide the family so that Jackson will become hers alone.",
      "tmdbMovieId": 17941,
      "avgRating": 2.55747,
      "releaseYear": "1998",
      "numRatings": 348,
      "posterPath": "/wg4QwknfZag1sg7M2biuLJoXAks.jpg"
   }
}