{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parrot",
            "id": 3478
         },
         {
            "name": "research",
            "id": 3664
         },
         {
            "name": "thief",
            "id": 9727
         },
         {
            "name": "girl",
            "id": 14659
         },
         {
            "name": "mexican american",
            "id": 164253
         }
      ],
      "imdb_id": "tt0125454",
      "video": false,
      "title": "Paulie",
      "recommendations": [
         6283,
         3587,
         11894,
         18188,
         15489,
         15170,
         36259,
         17414,
         17007,
         33660,
         36929,
         42158,
         34390,
         30709,
         39479,
         80346,
         29098,
         11497,
         42010,
         9745
      ],
      "backdrop_path": "/nAHxNZwNlttHYvjOi2LmmppSUZE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ivy",
               "gender": 1,
               "credit_id": "52fe45f39251416c910440ed",
               "name": "Gena Rowlands",
               "profile_path": "/kRHNvkcJlwBr1Xb9XREiZob29NX.jpg",
               "id": 4800,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Misha Vilyenkov",
               "gender": 2,
               "credit_id": "52fe45f39251416c910440f1",
               "name": "Tony Shalhoub",
               "profile_path": "/jXzlVxS8u64XEZUoNPiuhGcQXDW.jpg",
               "id": 4252,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ignacio",
               "gender": 2,
               "credit_id": "52fe45f39251416c910440f5",
               "name": "Cheech Marin",
               "profile_path": "/efuXbXg7JpORy5hPDU7Zityq3k3.jpg",
               "id": 11159,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Reingold",
               "gender": 2,
               "credit_id": "52fe45f39251416c910440f9",
               "name": "Bruce Davison",
               "profile_path": "/kYFBIffblcsbLMITDZYHhVf5c9f.jpg",
               "id": 52374,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Adult Marie Alweather",
               "gender": 1,
               "credit_id": "52fe45f39251416c910440fd",
               "name": "Trini Alvarado",
               "profile_path": "/mBXnTuUlllTWiGbJfbkw63WxV2U.jpg",
               "id": 17187,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Benny / Paulie (voice)",
               "gender": 2,
               "credit_id": "52fe45f39251416c91044101",
               "name": "Jay Mohr",
               "profile_path": "/6HGBa7y15h6Xrg55Wr8BepS363R.jpg",
               "id": 12217,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Artie",
               "gender": 2,
               "credit_id": "52fe45f39251416c91044105",
               "name": "Buddy Hackett",
               "profile_path": "/oOysYfFKgCHe1TUGa3wC743KFrx.jpg",
               "id": 67393,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marie Alweather",
               "gender": 1,
               "credit_id": "52fe45f39251416c91044109",
               "name": "Hallie Kate Eisenberg",
               "profile_path": "/hKxnAGbWiiMzOiZKwrbJIul8DTH.jpg",
               "id": 15674,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Warren Alweather",
               "gender": 2,
               "credit_id": "52fe45f39251416c9104410d",
               "name": "Matt Craven",
               "profile_path": "/atUkssC0DowpBbFvsnRf92cEf9y.jpg",
               "id": 13525,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Virgil the Janitor",
               "gender": 2,
               "credit_id": "52fe45f39251416c91044111",
               "name": "Bill Cobbs",
               "profile_path": "/cP2ETKFdk93z4e1oXZVG0utI3IM.jpg",
               "id": 8854,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Ruby / Lupe (voice)",
               "gender": 1,
               "credit_id": "52fe45f39251416c91044115",
               "name": "Tia Texada",
               "profile_path": "/2V1VybaTz8VxJoKBkXSlPL7zzZi.jpg",
               "id": 68430,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f39251416c910440e9",
               "name": "John Roberts",
               "profile_path": null,
               "id": 120218,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "547a340c9251417bd7000cd0",
               "name": "Laurie Craig",
               "profile_path": null,
               "id": 83749,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.512782,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36568,
      "vote_count": 111,
      "budget": 0,
      "overview": "Paulie, an intelligent parrot who actually talks, relates the story of his struggle to a Russian immigrant who works as a janitor at the research institute where he is housed and neglected. Paulie's story begins many years earlier when he is given as a gift to a little girl who stutters. Eventually, he teaches the girl to speak correctly but is taken away by her father because he believes the girl cannot distinguish fantasy from reality because she believes the bird can talk. Paulie goes through a series of adventures with a pawn shop owner, an aging widow, a Mexican-American troubadour and a would be thief before being taken to the institute where he now lives",
      "similar": [
         2034,
         10471,
         9702,
         35056,
         11886,
         9388,
         812,
         5236,
         345915,
         9552,
         205584,
         500,
         298,
         699,
         949,
         436827,
         526,
         300669,
         127493,
         1844
      ],
      "original_title": "Paulie",
      "runtime": 91,
      "poster_path": "/lAxYiGccdBgfMGwbJYzR9o3yabu.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mutual Film Company",
            "id": 762,
            "origin_country": ""
         },
         {
            "logo_path": "/jCwNupLautLSk6iB28VXrDPUqD8.png",
            "name": "DreamWorks",
            "id": 7,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-04-17",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The Bird is the Word",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Roberts"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Laurie Craig"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0125454/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzk4MDA0ODc4M15BMl5BanBnXkFtZTcwNzU4MzA3NA@@._V1_SY317_CR16,0,214,317_AL_.jpg",
      "actors": ["Stars: Gena Rowlands, Tony Shalhoub, Cheech Marin | See full cast and crew »"],
      "reviews": [
         "Somehow, this movie manages to be invigorating, bittersweet, and heartwarming at the same time. Stars like Tony Shalhoub (from Providence) bring the tale to life. The story itself is inspiring. We see a desperate, up-and-down life through the most innocent eyes imaginable: a bird's. Paulie begins his life as a baby parrot given to a little girl (played by Hallie Eisenberg, also known as the Pepsi girl) with a speech impediment. While she learns to speak correctly, so does Paulie. However, unlike most birds, he can speak and understand everything being said. The military father doesn't like the bird, so he is sent to a pawn shop and bought by an aging artist, Ivy. She teaches him manners, etc., while traveling across the country to find Paulie's owner. The movie continues with several twists of fate, until Paulie ends up at a laboratory where he is eventually hidden away in a basement, and found by a Russian custodian, who is touched by the bird's story. the plot is in keeping with the simple, metaphorical theme that language is a gift, and a curse. I would like to say that the soundtrack is astounding. A beautiful mixture of flute, digital base, and horns enhance the movie to the point of pure ecstasy. The sweeping camera angles and breathtaking scenery beautify the story even more. And, as a final remark, the puppetry is entirely believable. (Unlike in star wars, where Yoda resembles a Muppet) This film is one of my favorite movies, with the added remark that my wonderful parakeet of four years died recently. Overall, I give this movie **** out of four stars, two thumbs up, and a big hug.",
         "Something about \"Paulie\" touched my heart as few movies do. It is a witty, funny yet emotional movie. I'm a late comer in becoming a fan of this movie. I didn't see \"Paulie\" until May, 2004 and have since ordered the Widescreen DVD from a seller at eBay. The special effects of showing Paulie talking are superb. My son asked me how the bird knew so many phrases.Probably my favorite part of the movie is when Paulie is in Gena Rowlands (Ivy's) company followed by Cheech Marin (Ignacio). Tony Shalhoub (Misha) plays an excellent part as the good hearted human. You root for him all the way through the movie. You can't go wrong renting or buying this movie!!",
         "I have seen this film numerous times and for the life of me, I cannot understand why some people compare this to BABE. This film is not about the secret life of ALL animals who secretly can talk. Instead, it is about a Parrot who learns to talk to help his owner, a little girl with a serious stammer, overcome her speech impediment only to be separated from her in a heart-wrenching scene early on. Then the great journey begins. Paulie the Parrot sets out to try and find his one great friend, Marie. Along the way, he meets several wonderful people and numerous nasty people. He falls in love with a girl parrot and loses her. He gets conned into a life of crime and then captured by a bad scientist who wants to exploit him. He recounts his tale to a sympathetic Janitor in the Lab who agrees to help him escape and find his beloved Marie. Tony Shaloub shines as the kindly Janitor who has an open mind and big heart and who determines to help little Paulie despite the risks. Jay Mohr plays the voice of the Parrot AND one of the seedy characters he comes across. There is a little suggestive language but this film is appropriate for most kids and even more so if the parents join in on the fun and watch too. It is a witty, clever, epic animal-adventure story and ultimately a great love story about a Bird and his little girl. He search for Marie ends with a quite an unexpected surprise for most people who don;t know much about Parrots. Kids who have seen the wild Green Parrot Tribes in Los Angeles and Pasadena will especially benefit from seeing this film and understanding that Birds, especially Parrots are not disposable pets. All children everywhere, will see that Pets form deep attachments themselves and that the love and loyalty of a dog or parrot is a gift to be treasured. so no BABE here, more of an incredible journey with a twist. Enjoy and try no to tear up during the sad parts.",
         "Paulie is a \"feel good\" film about the life of an amazing parrot and the lives he touches. He starts out as the friend of a young girl, then lives with a dying woman, an Hispanic performer and a con man. He finally winds up as the subject of experiments at a laboratory, where he is befriended by an introverted Russian immigrant, played by the wonderful Tony Shalhoub. I won't give away the end of the film, but it'll bring tears to your eyes. You won't believe you are crying about a parrot! A nice little movie that'll make you laugh and cry and give you a feeling of hope!",
         "Some people might call \"Paulie\" a kids' movie, but I wish to assert that it's more than that. Probably more than anything else, this movie successfully goes to great lengths to show the plight of immigrants in the United States - topical given the recent debates. Portraying a parrot telling a Russian immigrant janitor (Tony Shalhoub) of how he searched America for his original owners, the movie tells several stories. There's the elderly woman (Gena Rowlands) whom he befriends, then a Mexican immigrant (Cheech Marin), and others. All in all, it's a very well done movie. I usually don't expect much from these sorts of movies, but this one is a treat. I certainly recommend it. Also starring Jay Mohr, Buddy Hackett, Bruce Davison, Hallie Eisenberg and Trini Alvarado.",
         "This is a really heart-warming family movie. It has absolutely brilliant animal training and \"acting\" (if you can call it like that) as well (just think about the dog in \"How the Grinch stole Christmas\"... it was plain bad training). The Paulie story is extremely well done, well reproduced and in general the characters are really elaborated too. Not more to say except that this is a GREAT MOVIE! My ratings: story 8.5/10, acting 7.5/10, animals+fx 8.5/10, cinematography 8/10. My overall rating: 8/10 - BIG FAMILY MOVIE AND VERY WORTH WATCHING!",
         "I'm no fan of newer movies, but this one was a real pleasure to watch. Adults and children could watch it together - how unusual! My aunt liked it, too. It had laughter, tears, love, adventure, special effects, good actors - and a talking parrot. It reminded me of a favourite, The Wizard of Oz. The hero, Paulie, an intelligent parrot, is separated from his home and family and goes through many adventures, temptations and disappointments, always keeping in mind his resolution to find his friend, Marie. Highly recommended.",
         "I was very surprised with this film. I was touched with the lives that paulie touched along his way to find his \"marie\" the little girl he was separated from. The humor was also very good and it did not hurt the story as i thought it would probably do. Actually i was expecting \"paulie wants a cracker\" jokes to hurt this film but even that was done in a very humorous scene that turns very touching when paulie is in the research lab press room conference. So if you wish to see a good \"animal that talks\" film check this one out, much better than Dr. DOLITTLE in my opinion. PAULIE also has a surprised twist in the end that is done very nicely as well.",
         "The story of a talking parrot and the adventures he has while trying to return to the little girl he misses. This movie is an adventure of the heart which will take the viewer through the full gamut of feelings from soul-rending desperation to bone-tingling joy.",
         "Paulie is a loveable parrot who is owned by a little girl (Maire Kate Eisenbierg), they love each other dearly. But one day Paulie is blamed for an extreme accident and gets taken to a pet shop. Paulie breaks away and searches for the little girl, and all this becomes \"Paulie : A Parrots Tale.\" You'll love this film, and you'll fall in love with Paulie. My rating : 8/10."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "DreamWorks SKG",
         "Mutual Film Company"
      ],
      "summaries": [
         "Paulie, an intelligent parrot who actually talks, relates the story of his struggle to a Russian immigrant who works as a janitor at the research institute where he is housed and neglected. Paulies story begins many years earlier when he is given as a gift to a little girl who stutters. Eventually, he teaches the girl to speak correctly but is taken away by her father because he believes the girl cannot distinguish fantasy from reality because she believes the bird can talk. Paulie goes through a series of adventures with a pawn shop owner, an ageing widow, a Mexican-American troubadour and a would be thief before being taken to the institute where he now lives.",
         "Paulie, a talking parrot, recounts his travels looking for his original owner to a Russian janitor who helps him to the end of his journey."
      ],
      "budget": 23000000
   },
   "movielensId": 1806,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1998-04-17",
      "dvdReleaseDate": "1999-07-06",
      "directors": ["John Roberts"],
      "runtime": 91,
      "movieId": 1806,
      "title": "Paulie",
      "mpaa": "PG",
      "actors": [
         "Gena Rowlands",
         "Tony Shalhoub",
         "Cheech Marin",
         "Bruce Davison",
         "Trini Alvarado",
         "Jay Mohr",
         "Buddy Hackett",
         "Hallie Kate Eisenberg",
         "Matt Craven",
         "Bill Cobbs",
         "Tia Texada"
      ],
      "imdbMovieId": "0125454",
      "originalTitle": "Paulie",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["AGV8nB_EEAU"],
      "plotSummary": "Paulie, an intelligent parrot who actually talks, relates the story of his struggle to a Russian immigrant who works as a janitor at the research institute where he is housed and neglected. Paulie's story begins many years earlier when he is given as a gift to a little girl who stutters. Eventually, he teaches the girl to speak correctly but is taken away by her father because he believes the girl cannot distinguish fantasy from reality because she believes the bird can talk. Paulie goes through a series of adventures with a pawn shop owner, an aging widow, a Mexican-American troubadour and a would be thief before being taken to the institute where he now lives",
      "tmdbMovieId": 36568,
      "avgRating": 2.8326,
      "releaseYear": "1998",
      "numRatings": 1138,
      "posterPath": "/lAxYiGccdBgfMGwbJYzR9o3yabu.jpg"
   }
}