{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "kansas",
            "id": 7658
         },
         {
            "name": "single father",
            "id": 33479
         },
         {
            "name": "baskeball",
            "id": 209065
         }
      ],
      "imdb_id": "tt0120642",
      "video": false,
      "title": "A Cool, Dry Place",
      "recommendations": [
         41589,
         117553,
         30068,
         38554,
         18475
      ],
      "backdrop_path": "/75XYYGIKwVCjpQoumTg2ajmAv04.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Russell Durrell",
               "gender": 2,
               "credit_id": "52fe46399251416c9104d585",
               "name": "Vince Vaughn",
               "profile_path": "/r6ISnWjO5fA9QA1BTWUGaqdPyxE.jpg",
               "id": 4937,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kate Durrell",
               "gender": 1,
               "credit_id": "52fe46399251416c9104d589",
               "name": "Monica Potter",
               "profile_path": "/eHLvw07VvLiqDkacrsMhMj2lNzp.jpg",
               "id": 2140,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Beth Ward",
               "gender": 1,
               "credit_id": "52fe46399251416c9104d58d",
               "name": "Joey Lauren Adams",
               "profile_path": "/hQqqcyUvLQwnqBYCdpGZIfKOpmO.jpg",
               "id": 16484,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Noah Ward",
               "gender": 2,
               "credit_id": "52fe46399251416c9104d597",
               "name": "Devon Sawa",
               "profile_path": "/jur7ijuplTyNWItmXuFhCcUffd6.jpg",
               "id": 50398,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Charlotte",
               "gender": 1,
               "credit_id": "52fe46399251416c9104d59b",
               "name": "Siobhan Fallon",
               "profile_path": "/wVFa8GiY0xdOLFsvGygy9RMtcBc.jpg",
               "id": 6751,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Calvin Durrell",
               "gender": 0,
               "credit_id": "550df0f592514176240011e9",
               "name": "Bobby Moat",
               "profile_path": null,
               "id": 1443624,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Bob Harper",
               "gender": 2,
               "credit_id": "550df11ac3a3684874007b30",
               "name": "Todd Louiso",
               "profile_path": "/e4PTxmKUB0qGBusuNjqMvhjGELK.jpg",
               "id": 3230,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46399251416c9104d593",
               "name": "John N. Smith",
               "profile_path": null,
               "id": 60295,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54808202c3a36829a7002c24",
               "name": "Matthew McDuffie",
               "profile_path": null,
               "id": 223613,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5672dceec3a3680714002e00",
               "name": "Michael Grant Jaffe",
               "profile_path": null,
               "id": 1550228,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "5672dd1992514163bf002bfe",
               "name": "Katie Jacobs",
               "profile_path": "/kdn9llKconxaMhZYFDExnZlW2fR.jpg",
               "id": 41424,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5672dd2c92514163bc002b83",
               "name": "Gail Mutrux",
               "profile_path": null,
               "id": 5164,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5672dd3e92514158ae00071c",
               "name": "Curt Sobel",
               "profile_path": null,
               "id": 63906,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5672dd4fc3a3680714002e0b",
               "name": "Jean Lépine",
               "profile_path": null,
               "id": 33459,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5672dd5f92514163b9002bc0",
               "name": "Susan Shipton",
               "profile_path": null,
               "id": 35332,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5672dd7092514163c8002b40",
               "name": "Debra Zane",
               "profile_path": null,
               "id": 495,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5672dd83c3a368070a0028e4",
               "name": "Donald Graham Burt",
               "profile_path": null,
               "id": 20209,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5672dd9492514163c2002b68",
               "name": "Vlasta Svoboda",
               "profile_path": null,
               "id": 1463199,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5672ddacc3a368070e004148",
               "name": "Carol Lavoie",
               "profile_path": null,
               "id": 7802,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5672ddbfc3a3680712002efc",
               "name": "Denise Cronenberg",
               "profile_path": null,
               "id": 13551,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5672ddd892514158ae00072c",
               "name": "James Halpenny",
               "profile_path": null,
               "id": 1531900,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5672de28c3a3680721002c54",
               "name": "Jennifer Essex",
               "profile_path": null,
               "id": 1278613,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "5672de3ec3a368070a002903",
               "name": "Jeffrey Harlacker",
               "profile_path": null,
               "id": 66513,
               "department": "Editing",
               "job": "First Assistant Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.983311,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37272,
      "vote_count": 10,
      "budget": 0,
      "overview": "A single father balances his work as an attorney with the care of his five year old son and his work as a high school basketball coach in rural Kansas, where he moved after his wife abandoned him in Chicago. Just as he starts to develop a new relationship with a veterinarian's assistant, his ex-wife suddenly reappears and wants to re-assert herself in her husband and son's life. On top of the romantic conflict, he is also suddenly presented with the opportunity of a lifetime to join a major firm in Dallas.",
      "similar": [
         1903,
         382591,
         713,
         19913,
         2898,
         289,
         194,
         11631,
         544,
         38,
         1213,
         1402,
         1578,
         2270,
         42888,
         222936,
         157336,
         599,
         1278,
         116
      ],
      "original_title": "A Cool, Dry Place",
      "runtime": 97,
      "poster_path": "/a1TJ0Cm1p7SWksvrn2wtQUympNr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jacobs/Mutrux",
            "id": 70166,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-29",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "love, sex and starting over...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John N. Smith"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Michael Grant Jaffe",
         "Matthew McDuffie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120642/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzU4NDc2MjYxM15BMl5BanBnXkFtZTcwNDUzOTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Vince Vaughn, Monica Potter, Joey Lauren Adams | See full cast and crew »"],
      "reviews": [
         "Vince Vaughn is very convincing as a single father in this film! The most intriguing feature of this film is Vince out of funny! This is my first experience with him not trying to make me laugh, and yes, he did make me cry! Torn between new love, new job, old feelings and a child, his character took me on a roller-coaster ride that didn't end until the credits rolled!!! If you see no other Vaughn movie this one is a must! Not only is the story great, but Vince is gentle and compassionate; a father that takes his job as a parent most seriously. The angst in his day-to-day struggle as a parent and a man will leave you thinking about parenthood long after the movie has ended!",
         "Russ (Vince Vaughn) has moved to a little town on the prairie. Once a hotshot Chicago lawyer, he lost his job when his wife took off and left him the sole provider for his five year old son. Now a country lawyer with a big house and yard, Russ and wee Calvin are learning to adjust. Calvin is making friends and loves the wide open spaces while Russ starts dating a nice veterinary assistant named Beth (Joey Lauren Adams, looking very lovely). But, unhappily, the ex-wife, Kate (Monica Potter) suddenly returns and wants time with her son, messing with Russ's mind. Then, too, Russ believes he needs a higher profile job to feel complete. How will it all end? This is an excellent movie about a single-parent father and his young son. But, alas, the film's cover and description lead one to believe it is a love triangle story, with hardly a mention for the darling little boy. Not so. The movie is about finding out what is important in life and what is not, with most of its footage devoted to the special relationship between a parent and a child. Vaughn is excellent as the caring father, just excellent. If you are a fan of his comedic talents, you might be surprised by the depth of his acting range. Adams is likewise very attractive as a small town girl with a big heart while Potter delivers a fine performance in a thankless, complex role. The rest of the cast is up to par as well, the costumes well-chosen and the grassland setting most beautiful. In short, you may never have heard of this film but it is richly rewarding and deserves a large audience. You will not be in a \"high and dry\" situation if you bring this film home tonight.",
         "'A Cool, Dry Place' is not a bad film by and means and I think Smith's intentions were genuine but there's just something about it that doesn't make the film stay in mind. Perhaps it's the too familiar plot. The film is a little on the mellow side but enjoyable and has some very funny moments and gives a warm feeling. The location of the setting is refreshing and the score adds well to the country mood. Both Joey Lauren Adams and Monica Potter do well. Adams's performance is more natural while Potter's effort is sincere (she did have the harder part) but it is Vince Vaughn's film. The actor is outstanding. All the actors share a good chemistry that shines on screen. On the whole this 'A Cool, Dry Place' is a nice warm film but it's not one that stayed after ending. Perhaps I should give it another chance.",
         "It is funny that I had just a couple of days ago watched a Cooler Climate with Sally Field and Judy Davis and it made me think that I hadn't seen A Cool Dry Place in a while and low and behold I am flipping the channels and there it is! Vince Vaughn does a great job at playing a man that is suddenly forced into being a single parent after his wife leaves him. He has to reorganize his life in order to raise his son. This movie shows what sacrifices you have to make as a single parent in order to raise your kids. Fans of Vince Vaughn will be pleasantly surprised by this movie. It shows a different side of him, a side that I hope he shows more of in other movies.",
         "Vince is great. The story is funny and touching. There're some great bits, especially about the kid. So what is so fundamentally wrong with this movie? I couldn't figure it out, but something is missing. I figure the only answer is a general lack of film making imagination. It boils down to a made-for-TV look to the movie. There's a lack of any good musical score or interesting songs. The direction is at best described as mediocre. It's saving grace lies in the actors and a good story. It's too bad they couldn't save this movie completely.",
         "I enjoyed \"A Cool Dry Place\". I found it to be a mellow but entertaining drama about a man's life. It'a very true to life story. Separated Man is out of work, man finds job he isn't happy with, man's ex-wife wants another go just as he finally starts dating a girl he really begins to love, man gets offered a \"dream job\" but must travel to take it, man's son is stuck in the middle of this. It's well-wtitten, for the most part, but I didn't like the pace. Vince Vaughn is capable of being a funny guy(see Swingers), but they gave his character virtually no sense of humor. I found myself giggle only ocassionally, and never busting out with laughter..while it was a drama, and not meant to be comedic, slow-moving dramas like this could benefits from some laughs. The acting is mostly good, even by child actor Bobby Moat. I'd like to see him take more child roles, as he seems very mature and understands the art of acting well for a child of his age. Vince Vaughn, who's quickly becoming one of my favorites, is well-cast but his talent is underused in this movie. His two love interests, Joey Lauren Adams, and Monica Potter are both nice to looks at, but the only the former seemed comfortable with her role. Joey is a pleasure to watch, while her voice may annoy some, I think it's just part of her charm, a charm that is abundant in this one. On the other hand, Monica Potter seemed nervous and on edge her whole on-screen performance. She doesn't show the true emotion seen in Vaughn, and Adams. Monica has done much better work than this. Like i said, the acting was good, the script was pretty good, the plot was good, but the screenwriter never gave us a climatic moment. This was my problem with the film, which was the same problem I had with \"The trigger effect\". It's a splendid movie, entertaining usually, but there's never that moment of climax that keeps you glued to the tube. While I found myself liking the movie, and finding it very interesting, I also found myself having a difficult time paying attention about half-way through. It's definitely worth-watching though..check it out.",
         "This movie did not have a wide release in New Zealand. I had to have the film couriered from the other side of the country, and it was well worth it. A Cool Dry Place is a movie that leaves you feeling warm. Its sensitive, and funny and even a little sexy. The storyline is believable, and the calibre of Vince Vaughns acting shows through in his scenes with Bobby Moat who plays his son Calvin . Vince Vaughn does not have children but you would never believe it after watching this movie. Joey Lauren Adams and Monica Potter also both shine in this movie. Joey Lauren Adams character Beth is reminiscent of her character in Chasing Amy, tough and sassy but ultimately sweet. Monica Potters Kate is someone we like to hate, such a vast difference to her role in Patch Adams. I urge people to watch this movie, its beautiful and I loved every minute. After watching this movie, you'll fall in love with Vince's character Russ, and end up falling in love with Vince Vaughn too.",
         "Watching this film for the second time I found it wasn't as good as i'd initially remembered. Vince Vaughn is excellent in a straight dramatic role and his performance really carries the film, his interaction with his son is the main selling point. Joey Lauren Adams, although not given a whole lot to do, is very charming but remains two dimensional. Monica Potter does OK with a fairly thankless role but like Adams, her character's moods and motivations are never really explored. As a examination of the relationship between father and son the film does its job, however the various subplots are neglected and give the feeling of being there solely to pad the runtime. Overall not a bad way to spend an hour and a half, just don't expect to be blown away by it.",
         "Our daughter came to visit and brought the DVD with her. She recently found out that a friend of hers wrote the book that this movie is based on, so we all settled in this Sunday afternoon, in our own cool, dry place, the living room, and watched it. I was particularly pleased with the performance of Vince Vaughn as Russell Durrell, attorney and single dad that settled in a small, semi-rural community to work and raise his 5 year old son. By all indications he was doing a good job. We don't find out much about mom until a bit later, but she is alive and well, sort of. Monica Potter, Cleveland native and blonde Julia Roberts look-alike is Kate Durrell, the mom who apparently left almost two years earlier and never came back. The son, Calvin (cute Bobby Moat) doesn't even remember her. The love triangle is completed by Joey Lauren Adams as Beth Ward, young and interesting local girl who is divorced and has a younger brother living at home with her. He happens to be a basketball player on the high school team that Russ is coaching temporarily. So, the movie is pretty good, it is about Russ and Calvin trying to make it in spite of the difficulties. SPOILERS FOLLOW. Mom shows up, Russ thinks she might want to get back together, he still loves her, but she admits she never loved him and has someone else. She didn't say as much, but we assume she is there partly to get a divorce. Russ decides to take a big job in Dallas, do courtroom work that he misses, and let young Calvin stay with gramps. But mom takes Calvin to her sister in Cincinnatti, Calvin is scared, Russ realizes family is more important than the job, and turns down the Dallas job, he and Calvin go back to the small town.",
         "vince vaughn does a great great job of acting in this; especially since he doesn't usually play a serious part. i was very impressed by the story line and reality of this movie, and would recommend it to everyone. i think joey lauren adams and monica potter do excellent jobs as well. i saw it this Sunday on TV, when i was flipping channels, and i ended up watching the entire movie, and hating the commercials in between. it was so realistic and so much what life is really like for couples and when you have a child- i really got into it. i even called my mom and sis and told them to watch it. a cool dry place is an excellent movie, and i am going to try and buy it soon!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Fox 2000 Pictures",
         "Jacobs/Mutrux"
      ],
      "summaries": ["A single father balances his work as an attorney with the care of his five year old son and his work as a high school basketball coach in rural Kansas, where he moved after his wife abandoned him in Chicago. Just as he starts to develop a new relationship with a veterinarian's assistant, his ex-wife suddenly reappears and wants to re-assert herself in her husband and son's life. On top of the romantic conflict, he is also suddenly presented with the opportunity of a lifetime to join a major firm in Dallas."],
      "budget": 0
   },
   "movielensId": 1807,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-29",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["John N. Smith"],
      "runtime": 97,
      "movieId": 1807,
      "title": "A Cool, Dry Place",
      "mpaa": "PG-13",
      "actors": [
         "Vince Vaughn",
         "Monica Potter",
         "Joey Lauren Adams",
         "Devon Sawa",
         "Siobhan Fallon",
         "Bobby Moat",
         "Todd Louiso"
      ],
      "imdbMovieId": "0120642",
      "originalTitle": "A Cool, Dry Place",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["4A3QQrJ-75g"],
      "plotSummary": "A single father balances his work as an attorney with the care of his five year old son and his work as a high school basketball coach in rural Kansas, where he moved after his wife abandoned him in Chicago. Just as he starts to develop a new relationship with a veterinarian's assistant, his ex-wife suddenly reappears and wants to re-assert herself in her husband and son's life. On top of the romantic conflict, he is also suddenly presented with the opportunity of a lifetime to join a major firm in Dallas.",
      "tmdbMovieId": 37272,
      "avgRating": 3.14826,
      "releaseYear": "1998",
      "numRatings": 172,
      "posterPath": "/a1TJ0Cm1p7SWksvrn2wtQUympNr.jpg"
   }
}