{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "white house",
            "id": 833
         },
         {
            "name": "usa president",
            "id": 840
         },
         {
            "name": "presidential election",
            "id": 2946
         },
         {
            "name": "scandal",
            "id": 3692
         },
         {
            "name": "george w. bush",
            "id": 6375
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0119942",
      "video": false,
      "title": "Primary Colors",
      "recommendations": [
         9452,
         12280,
         2107,
         9422,
         12518,
         12772,
         12596,
         10442,
         11004,
         6472,
         11566,
         9401,
         10631,
         8012,
         21991,
         11060,
         14170,
         10023,
         9409,
         9087
      ],
      "backdrop_path": "/5dr51JtcVDwBhBzkrugSEbhV2je.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Jack Stanton",
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b77",
               "name": "John Travolta",
               "profile_path": "/6CKR08ipxM8d2xOB26ja7OlXx7H.jpg",
               "id": 8891,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Susan Stanton",
               "gender": 1,
               "credit_id": "52fe44f7c3a36847f80b4b7b",
               "name": "Emma Thompson",
               "profile_path": "/cWTBHN8kLf6yapxiaQD9C6N1uMw.jpg",
               "id": 7056,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Richard Jemmons",
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b7f",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Libby Holden",
               "gender": 1,
               "credit_id": "52fe44f7c3a36847f80b4b83",
               "name": "Kathy Bates",
               "profile_path": "/pwHCkfIBeDdz93RlcmDWqXefozi.jpg",
               "id": 8534,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Henry Burton",
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b8d",
               "name": "Adrian Lester",
               "profile_path": "/oeTSuzejXQ6vpzKdLRFO2SHiLXp.jpg",
               "id": 76215,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Daisy Green",
               "gender": 1,
               "credit_id": "52fe44f7c3a36847f80b4b91",
               "name": "Maura Tierney",
               "profile_path": "/sG8ZxJtdMoNlBOOkMZVABxSH5F0.jpg",
               "id": 16307,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Gov. Fred Picker",
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b95",
               "name": "Larry Hagman",
               "profile_path": "/40PVsGp5Wp5kbUhAefLHqjqbarc.jpg",
               "id": 6840,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Mama Stanton",
               "gender": 1,
               "credit_id": "52fe44f7c3a36847f80b4b99",
               "name": "Diane Ladd",
               "profile_path": "/slgKANTJWP5vStwKimuEGwpMr4S.jpg",
               "id": 6587,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Izzy Rosenblatt",
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b9d",
               "name": "Rob Reiner",
               "profile_path": "/2zw9Iq9uo4vZiTQNQWdNFwbA1TA.jpg",
               "id": 3026,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Miss Walsh",
               "gender": 1,
               "credit_id": "52fe44f7c3a36847f80b4ba1",
               "name": "Allison Janney",
               "profile_path": "/cDcB8mKP1GiIeoM3Qe7GIucs0iv.jpg",
               "id": 19,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Dewayne Smith",
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4ba5",
               "name": "Mykelti Williamson",
               "profile_path": "/8TTxzpuvvpw2tB8xZBCDslYupNU.jpg",
               "id": 34,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Jennifer Rogers",
               "gender": 1,
               "credit_id": "580dac3092514171a3017a78",
               "name": "Stacy Edwards",
               "profile_path": "/3FBtBFrmjUx0W0bbKYqW2gpgIkI.jpg",
               "id": 43372,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Howard Ferguson",
               "gender": 2,
               "credit_id": "580dac5392514171a3017a9c",
               "name": "Paul Guilfoyle",
               "profile_path": "/vQRNg8D5jeUHGKeFzMuwFaAFnzZ.jpg",
               "id": 925,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Norman Asher",
               "gender": 2,
               "credit_id": "58111c81c3a368747700b859",
               "name": "Robert Klein",
               "profile_path": "/aONhw3dZwlvXF1tjtZUshripyf8.jpg",
               "id": 26715,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Eddie Reyes",
               "gender": 2,
               "credit_id": "58111c8fc3a368795500cd85",
               "name": "Tony Shalhoub",
               "profile_path": "/jXzlVxS8u64XEZUoNPiuhGcQXDW.jpg",
               "id": 4252,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Lucille Kaufman",
               "gender": 1,
               "credit_id": "5901091792514155d6001e33",
               "name": "Caroline Aaron",
               "profile_path": "/9v9h9bR4CX6MrpZFgEktTHFIlgT.jpg",
               "id": 1910,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Charlie Martin",
               "gender": 2,
               "credit_id": "595ff98f9251410b860aa768",
               "name": "Chelcie Ross",
               "profile_path": "/gtUOc36bK5MrjdRPQJi1b0cc0LT.jpg",
               "id": 10486,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b49",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f7c3a36847f80b4b4f",
               "name": "Elaine May",
               "profile_path": "/M7oaIKjniVFr0rXWX1FFS2yGVV.jpg",
               "id": 58251,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b55",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b5b",
               "name": "Neil A. Machlis",
               "profile_path": null,
               "id": 8880,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b61",
               "name": "Ry Cooder",
               "profile_path": "/jDeoNWlT6ZTdjdOkgbccb3nFH8H.jpg",
               "id": 6918,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b6d",
               "name": "Michael Ballhaus",
               "profile_path": "/pMto0iHZb67YaSP9cTgKbAPcaYU.jpg",
               "id": 3769,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a36847f80b4b89",
               "name": "Jonathan D. Krane",
               "profile_path": null,
               "id": 14093,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59ca6bce92514123c100ce47",
               "name": "Arthur Schmidt",
               "profile_path": null,
               "id": 38,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.436773,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9440,
      "vote_count": 114,
      "budget": 65000000,
      "overview": "In this adaptation of the best-selling roman à clef about Bill Clinton's 1992 run for the White House, the young and gifted Henry Burton is tapped to oversee the presidential campaign of Governor Jack Stanton. Burton is pulled into the politician's colorful world and looks on as Stanton -- who has a wandering eye that could be his downfall -- contends with his ambitious wife, Susan, and an outspoken adviser, Richard Jemmons.",
      "similar": [
         10523,
         66,
         9386,
         586,
         75,
         376866,
         13969,
         9772,
         390061,
         301348,
         11499,
         11566,
         17795,
         842,
         14844,
         9895,
         10187,
         10858,
         9776,
         9087
      ],
      "original_title": "Primary Colors",
      "runtime": 143,
      "poster_path": "/6ojWGOU5BcjZHDOwBOtxDhTWxJf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mutual Film Company",
            "id": 762,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-03-20",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "What went down on the way to the top.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Nichols"],
      "runtime": 143,
      "synopsis": "Well acted drama, adapted from a novel by Joe Klein; has a terrific first half and then falters horribly in the final half hour- almost completely killing the entire movie. Travolta is dead-on as southern Governor Jack Stanton (a thinly veiled charicature of Bill Clinton), who is running for President. The film is shown from the perspective of a young, African-American man named Henry Burton, who is Stantons campaign manager. Through his eyes we spend intimate moments with the candidate, his wife and family and the various people working on his campaign. We also meet the other contenders for the office and get a rare inside glimpse of politics at work, which can be a ruthless and conniving game. Its fascinating material and the film hits the ground running, using a mostly good natured, humorous approach. The campaign must deal with the various and not unusual attacks by the opponents and must constantly dream up new strategies and schemes. Billy Bob Thornton is the man in charge of that department and he is all aces as Richard Jemmons, a ruthless, foul mouthed PR man. When even he cant refute some of the attacks on Stantons character (like an alleged affair with a hairdresser), Mrs. Stanton turns to Libby Holden (a terrific Kathy Bates). Libbys a quirky and unstable (shes been recently released from a mental hospital) defender of the Governor; whos reckless tactics actually get results. But she has a strict moral code that none of the others operate by. She will only go so far- and while she will defend attacks from other candidates she refuses to dig up dirt to attack another candidate first. It turns out that Governor Stanton is a genius player of the political game but also a tremendous philanderer who just may have had an affair with a 17 year old African-American girl and gotten her pregnant. Through some slick manipulation, he is able to disprove this. Then one of his opponents suffers a paralyzing series of heart attacks and is out of the race only to be replaced by a seemingly impeccable do-gooder. It turns out that he has a past history of drug abuse and homosexuality. The breaking of this news could seal the deal for Stanton but Libby is adament that he not go through with it. This is where the film breaks down, in a show of heavy handed moralizing and then a melodrmatic suicide that throws everything off course. The film has an open ending, never telling us flat out that Stanton wins and goes on to become President of the United States but the answer isnt difficult to surmise. This really is a good movie, enriched with great performances from a terrific cast and plenty of inspired moments of wit and outrageousness. It also has some heartening moments, as well and these are a constant reminder of how and why Bill Clinton got elected in the first place. Nichols does a fine job of directing and Elaine May does a pretty faithful adaptation of Kleins novel. Though his story is fictional, it is really a thinly disguised look at the 1992 Presidential campaign of Bill Clinton. Klein worked for Newsweek as a reporter and columnist during the 1992 Presidential election and also followed Clinton on the road and got to see a lot of things first hand. Youll see them in the movie and although most of it isnt that shocking, if you think about it, some of it really is- or at least, should be. This film does make you think and it raises some pretty frightening conclusions. After all that we do see going on, imagine what we dont see behind the scenes and probably never will. All of the wheeling and dealing and manipulation that is politics, as usual. Fascinating, even though not entirely successful.",
      "writers": [
         "Joe Klein",
         "Elaine May"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119942/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTE1NTI0MDUwN15BMl5BanBnXkFtZTcwNzk0NTcyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: John Travolta, Emma Thompson, Kathy Bates | See full cast and crew »"],
      "reviews": [
         "The much under-rated Primary Colors represents the zenith of its genre: a consistently excellent political satire armed with a stellar cast, an involving, intricate plot, and some of the finest direction in recent times from the sporadic (yet always reliable) Mike Nichols. John Travolta's portrayal of a Clinton-esquire Southern governor with a weakness for women and doughnuts is note perfect, encapsulating the flawed yet undoubtedly brilliant Jack Stanton with effortless flair and charisma. Travolta is ably supported by English character actors Emma Thompson and big screen debutant Adrian Lester, as well as an Oscar nominated Kathy Bates, Billy Bob Thornton and a resurgent Larry Hagman. The film is, in essence, a chronology of Stanton's rise of the political ladder and the struggles encountered by his vibrant team in keeping their man in the race, despite numerous setbacks and tragedies along the way. The script gives Travolta a perfect platform to express the very human emotions that both constrain and encourage us: his early speeches (particularly at an adult literacy centre) are punctuated by salient (yet entirely falsified) anecdotes, and were are given equal insight into Stanton the man and Stanton the politician. Thus the film's fundamental paradox arises: the audience is clearly conditioned to sympathise with Stanton as a result of his remarkable eloquence, yet we are frequently undercut by revelations of sex scandals, endless untruths and the often heartless pragmatism he embarks upon. This conflict for the audience is superbly manipulated so that, at the film's conclusion, we are unsure as to what our own emotions should be. Few films manage to pull this off: fewer with the nuanced skill of Nichols' political odyssey. I want to add a few words about the female performances in the film. Emma Thompson, as the Hilary Clinton of the the cast, nails both the accent and mannerisms of her model with a convincing determination. Her character is often the mediator among the campaign team, yet there is a ruthlessness about her, a quiet conviction in her actions that her husband is clearly sustained by. Kathy Bates is the unhinged lesbian media consultant who is drafted in to nullify the potent threat of negative media reporting. She clearly gets all the best lines (a prize shared with the equally crazy Billy Bob Thornton character) including a memorable reference to Stanton's string of lovers as \"sorry trash bins\": scrupulous editing on my part here. At the film's conclusion, Bates comes to the fore, spelling out the impossible conflict between what is politically right and what is humanly right with an intensity that few actors could accomplish. Her subsequent Oscar nomination was well deserved and she was unlucky to be pitted against a triumphant Judi Dench in the Best Supporting Actress category. That said, this is Travolta's movie. This is a career-defining performance from an actor unfortunately sullied by a series of mind-numbing duds (Battlefield Earth, anyone?), yet had he chosen his roles more wisely (as, say, Pacino has done) a more creditable media image would most certainly have been forthcoming. Don't be put off by its subject matter: this is film making at its best and is a credit to its highly talented cast and crew. 10/10",
         "Having heard the book was an unbridled attack on Clinton, I was afraid this film would be the same, but it wasn't. \"Primary Colors\" was definitely better than I thought it would be. First, there was Elaine May's script: Funny, well-written, lean, tender at moments, never taking things to the camp level, like so many modern Hollywood movies do when it doesn't work. And it wouldn't have worked for this movie. The thing that kept me watching was that, like Henry, I *did* believe in Jack Stanton, or at least I wanted to. The tender moments, like those at the beginning in the literacy class, kind of endeared me to the Stanton character and made me understand how Burton was drawn in so irrevocably. Then, there was the acting: marvelous. Travolta, Thompson, Bates: need I say more? Thompson's underlying, clipped accent adds a brittle note to her delivery that fits right in with Susan's repression and humiliation. Travolta was just nice enough to make you believe in him (although, in my opinion, he was ultimately unable to fully portray that \"je ne sais quoi\" that Clinton possesses, which makes him so charming to many). Bates was riveting and harrowing as the faded liberal clinging to her ideals. But in addition to the \"name actors\" there were others who were fantastic: Adrian Lester, as the tortured campaign aide, wants to believe but feels unsure of Stanton's worth as a candidate. Maura Tierney (best known as the wife in \"Liar Liar\") as the bubbling, funny sidekick to Lester (probably based on Dee Dee Myers), lights up every scene she's in. Larry Hagman, in a wonderful cameo, plays Stanton's opponent and his foil in the morals department. Billy Bob Thornton plays the James Carville role, and I wasn't sure what he added to the film. Since I constantly compared his character unfavorably to James Carville (the Thornton character was shown as a real rotter, sexually harassing aides, etc.), I'm not sure if my dislike of Thornton was more my dislike of his character than that of his acting. The production of this film also added to its wonderful feel: the Governour's Mansion, the local ribs place, the constant red/white/blue theme (sometimes it seemed like a Kieslowski film), all of it added to the ambiance. I was not surprised to learn that the Michael Ballhaus, the cinematographer, also filmed the sumptuous \"Age of Innocence.\" Quality tells. Mike Nichols's directing was also effective: in one especially harrowing scene, Emma Thompson's tormented face fills up the foreground, while Bates's character (in the background) rips into the Stantons' morals. I almost felt like I was at the theater. This film made me think about Clinton as well as politicians in general. What is admirable, what is not acceptable, what is it we really *want* in our public officials? I don't think \"Primary Colors\" will change anyone's opinion of the Clintons (in the final analysis, it isn't about them at all) -- but it is a very funny as well as thought-provoking look at modern American politics.",
         "A thinly disguised couple, one of the most famous couple of the last decade. They carry the \"come as you are\" kind of attitude, apparently, so, yes, at least apparently. Looking at it from where I'm standing in 2007 she may become the first USA woman president and he was, for 8 years, one of, if not the most popular American president since JFK and with the benefit of hindsight, he was probably a much more talented politician than JFK. I'm not necessarily a Democrat but I became, eventually, pro Clinton. Junk food and \"momathons\" infidelity and at times right down vulgarity doesn't blur the intentions of the couple and a couple is what they are. It may not have been John Travolta's most popular performance but for my money it's his best. Emma Thompson deals with Elaine May's superb and telling dialog with all the depth and poignancy, let alone fun, that the character deserved. She is magnificent. Kathy Bate's time bomb character is an unnerving fun to watch. Her Libby is a close relative of her \"Misery\" Mike Nichols keeps it really domestic. The most important things take place in Motels or kitchens. She wears yellow plastic gloves to do the dishes when big decisions are taken and cleanses her skin with a tissue in front of the preppy Adrian Lester the first time she meets him. They are ordinary southern folks with an extraordinary destiny. She's the one with a sense of history. Imagine that. See it now, again or for the first time before the next elections. It's a very good movie too.",
         "I thought \"Primary Colors\" (1998:***) was pretty good. It appears to be a lot easier on \"Jack Stanton,\" the Clinton surrogate played by John Travolta, than the book reportedly was. The movie presents \"Stanton\" as flawed but essentially decent (at least as decent as any politician running for high office can be). Travolta's imitation of Clinton is OK for a \"Saturday Night Live\" sketch, but it sometimes gets in the way of his performance over the 2-1/2 hour length of the film. However, he's often effective, and Emma Thompson is first-rate as \"Susan Stanton\", by turns pragmatically worldly-wise and fiercely supportive. Actually, the focal point of the film is not that of the Stantons but the young, black grandson of a highly regarded civil rights leader, who gets sucked into Stanton's roller-coaster campaign and has his idealism sorely tested. He's well-played by an actor named Adrian Lester. There are also great turns by Kathy Bates, Larry Hagman and Billy Bob Thornton, among many others. For me, the only big drawback of the picture was the melodramatic suicide of a key player in the drama (I won't say who). I thought it was something this particular character would never do. Otherwise, \"Colors\" is absorbing and funny and moving nearly all the way. Good moment: The Stantons do a \"60 Minutes\"-like reaffirmation of their marriage, but as soon as the cameras are turned off, she yanks her hand out of his in a flash.",
         "Now that the Monica Lewinsky/Bill Clinton circus has played itself out, I finally saw Elaine May's excellent, under-appreciated rendering of the tale of a thinly disguised American politician and his campaign to become President of the United States. The performances in \"Primary Colors\" are remarkable. John Travolta does an astonishing impersonation of Clinton without being a Saturday Night Live caricature. Emma Thompson is perfect as his long-suffering wife, always waiting for the other shoe to drop revealing his indiscretions. Kathy Bates deserved her Academy Award nomination as his public relations trouble-shooter. Her not quite over-the-top performance is the heart of this opus. Last, but not least, Adrian Lester is the idealist young African American in charge of his campaign. This impassioned portrayal bodes well to a successful future in films. Mike Nichols has directed Miss May's script with intelligence and humor. See it now, after all the gossiping has died down, for an insightful, entertaining glimpse into the world of politics.",
         "It's said that only the very best actors can compete with children and animals, and to this should be listed bright-eyed, cute-as-a-button young newcomers like Adrian Lester, who steals every scene he's in as an idealistic young aide until a larger-than-life Kathy Bates steamrolls her way onto the crowded scene. This film, based on Clinton's 1990 campaign for the Democratic Presidential nomination, is a fictionalized, not factual, view of the man and his character and ideals, and quite simply one of the best films ever made about the confusing maze that is American politics. Just as the American media, spurred on by the Republican witch-hunters, rubbed our noses in the dirt surrounding Clinton's indiscretions, the movie doesn't spare Jack Stanton for his moral weaknesses and poor personal judgements, but makes the point that the dirt grubbing and trivializing media are equally immoral in seeking to denigrate a man's political ideals because of his sexual peccadillos. The media is one Enemy of Truth, but the real Enemy of the People, lurking, malevolent and unseen, in the murky shadows at the edges of this film, is the Republican Party, and it's interesting that it takes a British director to take such a decisive stand, as Hollywood has always been reticent to take sides in the Democrat/Republican debate. The point made here, from the testimony of the battle-scarred \"true Believers\", from the idealistic young party aides, from the would-be President's wife (an uncanny portrayal of Hillary by a dynamic Emma Thompson) and Stanton himself (although physically unlike Bill Clinton, John Travolta gives a very believable performance), is that the President needs to be a man of the people, to be able to understand the people, and to be able to communicate with the people, despite the lies of his opponents and the mud slinging of the media. If America doesn't always get the President it deserves, it's because these very qualities are often blocked by his political enemies and a sensation-seeking media, particularly the television networks. An uninformed Democracy is no Democracy at all, and it's a mark of the inherent strength of the American people and their political system that it has withstood these obstacles, despite the many mediocre Presidencies we have seen in our times.",
         "As (I think it was) Yogi Berra said, \"It's deja vu all over again!\" On this, the weekend after the release of the Starr report, the movie rings so true. Travolta was great in por- traying the manic pathology of Stanton/Clinton. And of course, Kathy Bates was superb as Libby, who in the end was unable to reconcile her loyalty to Stanton with her loyalty to the truth. If Stanton was flawed by his weakness of the flesh, Libby was flawed by her strength - by her inability to give up the best part of herself to the moral malaise that so pervaded the Stanton candidacy. How ironic that the film ends with the inauguration ball, with Stanton and wife whirling in triumph across the ballroom floor, without a hint of what was to come... I have seen this film labeled a comedy. I cannot see it as anything other than a tragedy, in the Greek sense - a man who with the best of in- tentions, but whose flaws finally undo him.",
         "This was a truly great commentary on politics in the modern world. John Travolta pulls off one of the best Bill Clinton impressions I've been priveleged enough to witness. Emma Thompson is witty, and real, a true testament to her skill and brilliance in her craft. But my favorite performances were delivered by the supporting characters in the film. To begin, the oft ignored Maura Tierney. She's charming, versatile, talented, and downright adorable. Daisy is horribly underwritten for an actress of her talent, but nevertheless a great and appealing character. Billy Bob Thornton's Richard Jemmons is hilarious and brilliant. He represents the truest example of the hardened believer. Finally came the eloquent and insane Libby Holden given breath in this mortal coil by the infallible Kathy Bates. I couldn't even begin to describe the beauty of this character's idealism. I would love to see more of it in our government. Good movie. Lots of fun, and lots of heart.",
         "WARNING: POSSIBLE SPOILERS!!! (There may not be any here, but I'll always, during comments, put this up to be safe) I felt that Primary Colors was a pretty good movie. I felt that Adrian Lester's Henry Burton was superbly played, a man thrust unknowingly into managing the campaign. Henry feels or wants to believe in Stanton's campaign and in Stanton himself, but he continually feels dismayed at the methods he is told to use in order to protect Stanton, literally becoming sick of one job. He becomes friends with Gov. Stanton's wife Susan Stanton (Emma Thompson, who is also good, particularly at dropping her English dialect to play an American here), a woman who is genuinely (certainly when compared to her husband) interested in people and a believer in the campaign, but is as disgusted as Henry is in the latest sexual revelation involving her husband. The interesting theme that Mike Nichols examines is the contradiction that while Stanton's campaign workers struggle to keep the campaign going in the face of Stanton's sexual affairs, the workers ALSO become sexually involved with each other. Sex permeates and dominates Stanton's campaign. Daisy (Maura Tierney)becomes involved with Henry; Libby Holden (Kathy Bates,(who is hard-nosed and wonderful here)becomes a lover of Jennifer, a campaign worker at Stanton's headquarters. Other good performances include Travolta's Jack Stanton, who at first tries hard to imitate President Clinton but soon slips comfortably into the role; Larry Hagman's Gov. Picker, a flawed but moral man who truly feels the sting of the past, unlike Stanton, and who wants to take the contest to a higher level. In summation, a pretty good film about the \"attack the enemy, protect oneself, and ignore the issues\" state of campaigns today, and certainly worth a look.",
         "I was never a big fan of the novel by Joe Klein that this movie is based on. Like Clinton, it seemed more slick and facile than satirical and insightful. There was a good story trying to get out, but it didn't. The movie manages to bring more of that story to the forefront, like the idea that even a nominee with good ideas and good heart needs to do dirty deeds to get elected because of how screwed up the American system is. I think Kathy Bates also deserves all the praise she's been getting, and Emma Thompson, Billy Bob Thornton, and Maura Tierney are also good. Travolta was a problem. Considering how much the filmmakers tried to distance themselves between their story and Clinton's real-life troubles, this seemed little more than a slick impression, and I found it distracting. I also found missed some of the stuff they cut from the novel, like Thompson's indiscretion with Adrian Lester's character, and the relationship between him and Tierney didn't have the context here that it did in the novel. And again, I was left wondering, \"If you hate him that much, why stay?\" Overall, an admirable effort, and maybe I'll be more receptive once this whole impeachment garbage fades from memory, but I still found it wanting."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Award Entertainment",
         "British Broadcasting Corporation (BBC)",
         "Icarus Productions"
      ],
      "summaries": [
         "Jack Stanton is running for president. The election is seen through the eyes of young Henry Burton. Along the way Stanton must deal with a sex scandal.",
         "This work is the barely fictionalized account of candidate Bill Clinton in 1992 via the character Southern Governor Jack Stanton. Joe Klein joined Newsweek as a political reporter and columnist during the 1992 US Presidential race, and followed then candidate Bill Clinton on the road. As such, Klein dutifully conveys the youthful exuberance for a new candidate, along with the sense of awe at his determination, drive, and intelligence. All along, he also displays the shocking lack of personal morals of a \"natural\" candidate for the office. Further, he shows the inner deal-making that everyone connected with the campaign makes to achieve the vision they started with, no matter how ugly the cheating, talented candidate gets on his road to the election. Klein tells the story from the 1st person perspective of a sophomorish campaign manager, Henry Burton, that just happens to be a grandson of a black civil rights leader. They join the Southern Governor at a talk given on adult education, in which Gov. Stanton cries as he tells the students how they were braver than his uncle--a World War II veteran that earned the Medal of Honor, but went home and never took a job because he was too embarrassed to tell anyone he was illiterate. We next find out this story is not true! Despite this, Burton decides to join the campaign, and works many of the standard issues--such as fighting off scurrilous attacks by opposing candidates, and captured and doctored cell phone conversations, etc. Burton walks into the campaign headquarters (a hotel suite) to find the Governor coming out of a bedroom not completely dressed, and a disheveled librarian they had just met at a school they had attended. Of course, Susan Stanton, the Governor's wife, is nowhere to be found. The team flies to another destination to meet up with Mrs. Stanton, as she has been campaigning for her husband among their party elite in that state. Burton is eventually introduced to Libby Holden, whose job is to defend the President by combating the attacks from all comers. She does so with ruthless abandon, but also with a strict moral code: There apparently is something noble about stopping the attacks of others, but it is almost reprehensible about digging up the dirt on others -- essentially attacking them first. We come to know that Gov. Stanton is a philanderer of extraordinary magnitude, but an inspired genius at politics. Unfortunately, this extends to sleeping with a 17-year-old babysitter, the librarian they just recently met, a long-term affair with another woman, and the list goes on.",
         "A man joins the political campaign of a smooth-operator candidate for president of the USA."
      ],
      "budget": 65000000
   },
   "movielensId": 1810,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-03-20",
      "dvdReleaseDate": "1998-09-09",
      "directors": ["Mike Nichols"],
      "runtime": 143,
      "movieId": 1810,
      "title": "Primary Colors",
      "mpaa": "R",
      "actors": [
         "John Travolta",
         "Emma Thompson",
         "Billy Bob Thornton",
         "Kathy Bates",
         "Adrian Lester",
         "Maura Tierney",
         "Larry Hagman",
         "Diane Ladd",
         "Rob Reiner",
         "Allison Janney",
         "Mykelti Williamson",
         "Stacy Edwards",
         "Paul Guilfoyle",
         "Robert Klein",
         "Tony Shalhoub",
         "Caroline Aaron",
         "Chelcie Ross"
      ],
      "imdbMovieId": "0119942",
      "originalTitle": "Primary Colors",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "llEsfNtE4iQ",
         "WCtnouR_r4Y"
      ],
      "plotSummary": "In this adaptation of the best-selling roman à clef about Bill Clinton's 1992 run for the White House, the young and gifted Henry Burton is tapped to oversee the presidential campaign of Governor Jack Stanton. Burton is pulled into the politician's colorful world and looks on as Stanton -- who has a wandering eye that could be his downfall -- contends with his ambitious wife, Susan, and an outspoken adviser, Richard Jemmons.",
      "tmdbMovieId": 9440,
      "avgRating": 3.47388,
      "releaseYear": "1998",
      "numRatings": 4230,
      "posterPath": "/6ojWGOU5BcjZHDOwBOtxDhTWxJf.jpg"
   }
}