{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pharmacist",
            "id": 1983
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "tourette syndrome",
            "id": 10217
         },
         {
            "name": "doll",
            "id": 33630
         },
         {
            "name": "pharmacy",
            "id": 159546
         }
      ],
      "imdb_id": "tt0119780",
      "video": false,
      "title": "Niagara, Niagara",
      "recommendations": [],
      "backdrop_path": "/y4qOHPGH3g3gsdMPTYWRdRhaiim.jpg",
      "revenue": 168462,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marcy",
               "gender": 1,
               "credit_id": "52fe4852c3a36847f816176f",
               "name": "Robin Tunney",
               "profile_path": "/oQGr5vfYbkarmJQmhGmSpIhSapL.jpg",
               "id": 17346,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Seth",
               "gender": 2,
               "credit_id": "52fe4852c3a36847f8161773",
               "name": "Henry Thomas",
               "profile_path": "/6d3C0i9Dpc4T9BEjYUw3pbb4BlJ.jpg",
               "id": 9976,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Walter",
               "gender": 2,
               "credit_id": "52fe4852c3a36847f8161777",
               "name": "Michael Parks",
               "profile_path": "/54P22YwbYCwfjJWT1jbiHN77TD.jpg",
               "id": 2536,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Claude",
               "gender": 2,
               "credit_id": "52fe4852c3a36847f816177b",
               "name": "Stephen Lang",
               "profile_path": "/tqF6ibURpLvRPlgvLRvjCQqWaa2.jpg",
               "id": 32747,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Seth's Father",
               "gender": 2,
               "credit_id": "547a3df2c3a36835be00056c",
               "name": "John MacKay",
               "profile_path": null,
               "id": 170991,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Sanitation Lot Cop",
               "gender": 0,
               "credit_id": "547a3e00c3a36848e3000a0d",
               "name": "Alan Pottinger",
               "profile_path": "/f2VT3ZqnZQ10W3S2NHr2H15e8kZ.jpg",
               "id": 1391363,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pawnbroker",
               "gender": 0,
               "credit_id": "547a3e0f9251414c650002e5",
               "name": "Sol Frieder",
               "profile_path": null,
               "id": 1178327,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Sally",
               "gender": 1,
               "credit_id": "547a3e1ac3a36848e3000a12",
               "name": "Candy Clark",
               "profile_path": "/6pGZGgHa09ktPwEcFWNAU3PLFdi.jpg",
               "id": 12407,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Convenience Store Clerk",
               "gender": 1,
               "credit_id": "5a7ddaa2c3a36817b20018cd",
               "name": "Clea DuVall",
               "profile_path": "/lNCDz75IsCKIPhr295OBk1SHv2J.jpg",
               "id": 20387,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4852c3a36847f8161781",
               "name": "Bob Gosse",
               "profile_path": "/llN8u0k6hvctIt8bhb8jbaB0GIC.jpg",
               "id": 36187,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4852c3a36847f8161787",
               "name": "Matthew Weiss",
               "profile_path": null,
               "id": 147283,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4852c3a36847f816178d",
               "name": "David L. Bushell",
               "profile_path": null,
               "id": 56759,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.183826,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 53092,
      "vote_count": 10,
      "budget": 0,
      "overview": "\"Niagra, Niagra\" begins quietly in a drugstore in Poughkeepsie, where Marcie, the film's disarming heroine, likes to shoplift. She literally crashes into Seth, a quiet outsider, also on a shoplifting spree. Marcie invites Seth to accompany her to Canada to find a black hairstyling head. They set off in Seth's beat-up station wagon, destined for a toy store in Toronto. While on the road, Marcie confides to Seth that she has Tourette's syndrome, necessitating a series of detours to liquor stories and pharmacies along the roads of upstate New York.",
      "similar": [
         4771,
         11423,
         26390,
         281,
         75780,
         2142,
         58625,
         1266,
         12143,
         7007,
         15069,
         101,
         395834,
         357096,
         3580,
         96,
         193893,
         1939,
         445954,
         1923
      ],
      "original_title": "Niagara, Niagara",
      "runtime": 93,
      "poster_path": "/mT46iyYXAgCJIt73qk1T3f13Sgv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Shooting Gallery",
         "id": 1596,
         "origin_country": ""
      }],
      "release_date": "1997-08-30",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "Love can't be controlled.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bob Gosse"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Matthew Weiss"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119780/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMzk3NjQ0OV5BMl5BanBnXkFtZTcwNTk2NTAyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Robin Tunney, Henry Thomas, Michael Parks | See full cast and crew »"],
      "reviews": [
         "Like many others, I watched this movie on one of the indie movie channels on TV, mainly intrigued by the opening sequence (the shots of the characters shoplifting reminded me of the Breakfast Club for some reason--I think it was the trenchcoat and hi-tops) and unusual description. I didn't go into it with very high expectations, I guess because it was hard for me to get past \"The Craft\" in my mind. But I was truly shocked, and touched, by this film. At first, the two characters seemed so strange, it was like they were trying TOO hard to be bizarre. But as the film progressed, their behavior took a backseat to the story that emerged--simply that of a star-crossed love, and the difficulty of being different in a society that has no place for you. In a story that seems most familiar, the two go from one locale to another, seeking medicine, and comfort, but are turned away. The only friendly face they find is a self-ostracized woodsman, a self-confessed chicken lover. Just see it and you'll understand. There were a couple of Harold and Maude references, including the final scene over Niagara Falls. It was just so powerful, the tension building to a moment you knew would be devastating...but it's almost impossible to accept how devastating it becomes. Left my crying for a good fifteen minutes. But it wasn't all sad. Marcy's disorder provides intentional comic relief at times, proving that sometimes laughing at the situation you're in is the only way to keep from going mad. I will rent and watch again.",
         "The film explores a couple of rejects, one rich with psychological problems, and the other poor with a messed up home, who go on a quest. Kind of the antithesis of 'It Happened One Night', the characters (main and supporting) are all tortured in their unique ways.",
         "Henry Thomas, and Robin Tunny, are a couple of the most underrated performers in the business. It's beyond me as to why they haven't received more recognition than they have. This movie is a perfect example of how boundless their abilities are. Acting out the lives of folks who could be referred to as a bit odd seems to be their speciality, and if these characters ain't odd, I'm at a loss to find anyone who is. The story is funny, romantic, dramatic, complicated, and tragic. I hated the ending, but if I hadn't, I wouldn't have loved the story as a whole. So there ya go.",
         "Perhaps it is the fact that I have seen too many \"commercial\" movies released in conjunction with a line of action figures, fast food merchandise, and pop music laden soundtracks that I was so drawn into Niagra Niagra. Furthermore, it could be the aforementioned that leaves me wishing that I could see Niagra Niagra again. While other films leave you in awe of Dolby/THX theatrical sound, or CGI special effects, Niagra Niagra leaves you with something the commercial releases have lacked for years...a thought. How rare is it that we can see a well acted, directed, and written film that leaves us asking questions about ourselves and not heading out to a fast food chain for the toys of the week? Niagra Niagra follows two castaways from society that take to the road together in hopes of finding their way to Niagra Falls, Ontario. Along the way we are treated to snippets, excerpts as it were of our own behaviour, or rather lack thereof. As a young woman tormented by Tourettes syndrome finds no sympathy save that of her fellow castaway. Together they find more than a road to take them to Canada, and find a way to tell us how understanding and empathy appear to be on the endangered species list. Winding along ribbons of asphalt together, we find a lot of ourselves and others in these castaways and ultimately a great reflection of that endangerment of human understanding driven home through a pair of incredible performances that are not to be missed. Niagra Niagra is an incredible film which is a MUST see, and don't worry about being \"sold\" the latest line of merchandise. All you need to do is enjoy the film as it is, the enjoyment and message will come naturally.",
         "Niagara, Niagara is a stunning and heartbreaking story about the two outsiders Seth and Marcy. Robin Tunney gives a fantastic performance as Marcy suffering from Tourette's Sydrome, getting sicker and sicker as the movie progresses. This movie is not very optimistic and it's very hard emotional, but at the same time very romantic. It's hard to explain, but see it and find out for yourself. It's definitely worth it.",
         "Wow! I caught this on IFC recently after I watched But Im A Cheerleader. Id never heard of this movie but the description sounded remotely interesting. I went in with low expectations and now I must say this is one of the best love stories ever in film. Robin Tunney does an excellent job portraying a person with tourettes. The relationship between the two and just the slightest details in the film are so acurate and believable. I usually hate \"romance\" and love films but this movie truly touched me. I so recommend this movie to anyone with the ability of vision.",
         "There are many things to admire about this film, but the thing that got me above all others was the part of an eccentric recluse, the sort of role that Hollywood loves & romanticizes but which here is absolutely convincing & unlike any character I've encounterd in film or in life. Also a very convincing & disturbing depiction of Tourete's syndrome",
         "This is a little-remembered film from the 90's starring the types of characters from Drugstore Cowboy, Natural Born Killers, and True Romance, except for one has Tourette's syndrome. Their interest in each other gets them caught up in chaotic scenarios and ultimately puts their relationship in peril, even if one of them has a lot of crazy life stories to tell to future children or something. The characters were sort of bland, Gen-Xer, 90's models of 20-somethings who had niche interests in petty theft and living life outside of the local rules. Robin Tunney gives a good performance as the Tourette's girl (name forgotten), but Henry Thomas' character, her significant other, was dull and not bright at all\u0085a real pain to watch. The worst part about the film was the missing logic during most of the characters' encounters with people along their journey to Canada. So many awkward experiences could have been avoided if the guy just explained her mental condition in a calm manner to others. Overall, it's a memorable film, to me, but it gets lost in the shuffle between the aforementioned movies and films like Girl, Interrupted which explore more mentally-challenged characters on a deeper, more logical level. It feels more middle-of-the-road, which is why I give it a 5 star rating. A better ending would have boosted that rating up a notch, as well.",
         "This is one of my favorite movies of all time! The acting by Robin Tunney was fantastic, especially considering the unique difficulties with playing this role. I won't divulge many secrets, but she plays the role of a strong girl named Marcy, who is half frustrated and half apathetic/jaded about the serious problems in her life and finds a way to spontaneously escape her surroundings with a new friend played by Henry Thomas, who is reserved in a semi-endearing way and tries to be a peace-keeper during Marcy's outbursts. I couldn't give the movie 10 starts as it's slightly over the top with the emotional guidance attempted by Bob Gosse, almost in a Spielberg-ish kind of way, but 9 stars in accurate.",
         "I tuned in to this movie because there was nothing else to watch. I was immediately sucked in by the characters. Robin Tunney is nothing less than spectacular in this film. Her portrayal of a mentally ill woman is both moving and 100% believable. Really, this sort of thing is not easy to do. She pulls it off fantastically. We know early on this film is going to end tragically, but you cannot take your eyes off of it. The characters do stupid things, but unlike most Hollywood movies where people do stupid things because the plot demands it, these people do stupid things because the are not right in the head - and the things they do are completely consistent with their characters. This is just a great example of film making IMHO. Great writing, great acting, great directing. A film for people who think film can be more than mindless entertainment."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Shooting Gallery"],
      "summaries": [
         "\"Niagra, Niagra\" begins quietly in a drugstore in Poughkeepsie, where Marcie, the film's disarming heroine, likes to shoplift. She literally crashes into Seth, a quiet outsider, also on a shoplifting spree. Marcie invites Seth to accompany her to Canada to find a black hairstyling head. They set off in Seth's beat-up station wagon, destined for a toy store in Toronto. While on the road, Marcie confides to Seth that she has Tourette's syndrome, necessitating a series of detours to liquor stories and pharmacies along the roads of upstate New York.",
         "Two misfits - Marcy and petty thief Seth meet shop-lifting in their upstate New York hometown. Marcy wants to get a hold of a black Bobbi head doll that their hometown does not carry so they take off to Toronto searching for it. Marcy needs pills to calm her muscle spasms. So on the way to Toronto, they stop at a pharmacy where the pharmacist thinks she is a junkie and refuses to fill her forged prescription. Later that night they come back to the pharmacy where they break in and steal the pills she needs. Before they can leave, the pharmacist from earlier arrives with a shotgun and shoots Seth in the leg. They make a run for Seth's car sitting outside. Marcy hops in the driver seat while Seth lays out in the back, with Marcy's bra wrapped around his wound. Due to Marcy's intoxication, she flips and totals the car off-road. The next morning they are picked up by lonely widower, Walter, who drives and old beat-up tow truck. Walter is very kind to both of them: tending to Seth's gunshot wound, teaching him to fish, and even covers for them when the sheriff stops buy to inquire Walter of the pharmacist thieves. While Seth is sleeping, Marcy and Walter begin to feed his chickens. Marcy has one of her \"attacks\" and ends up beating Walter unconscious (not purposefully). She wakes up Seth, who is very upset at what she did, considering how kind Walter was to the both of them. Seth yells at Marcy to get in Walter's truck and they drive off, leaving Walter there on the ground while they continue their journey to Canada. They arrive at the toy store where the is only one black Bobbi head doll left, and it is on display. Seth climbs to the top of the shelf where the display doll is chained. An employee walks by asking Seth to get down from the shelf and calls for his manager. The manager tells Seth the they will not sell the display doll, and Marcy has another \"attack.\" The police get called. Marcy begins to wrestle with the store security guard and takes his gun. Though she is just playing around, the police officers that show up beg to differ.",
         "An outsider and a young woman plagued by Tourette's syndrome meet and together journey to Canada."
      ],
      "budget": 0
   },
   "movielensId": 1811,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-30",
      "dvdReleaseDate": null,
      "directors": ["Bob Gosse"],
      "runtime": 93,
      "movieId": 1811,
      "title": "Niagara, Niagara",
      "mpaa": "R",
      "actors": [
         "Robin Tunney",
         "Henry Thomas",
         "Michael Parks",
         "Stephen Lang",
         "John MacKay",
         "Alan Pottinger",
         "Sol Frieder",
         "Candy Clark",
         "Clea DuVall"
      ],
      "imdbMovieId": "0119780",
      "originalTitle": "Niagara, Niagara",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Tjlmto66K0Y"],
      "plotSummary": "\"Niagra, Niagra\" begins quietly in a drugstore in Poughkeepsie, where Marcie, the film's disarming heroine, likes to shoplift. She literally crashes into Seth, a quiet outsider, also on a shoplifting spree. Marcie invites Seth to accompany her to Canada to find a black hairstyling head. They set off in Seth's beat-up station wagon, destined for a toy store in Toronto. While on the road, Marcie confides to Seth that she has Tourette's syndrome, necessitating a series of detours to liquor stories and pharmacies along the roads of upstate New York.",
      "tmdbMovieId": 53092,
      "avgRating": 3.2191,
      "releaseYear": "1997",
      "numRatings": 89,
      "posterPath": "/mT46iyYXAgCJIt73qk1T3f13Sgv.jpg"
   }
}