{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0120793",
      "video": false,
      "title": "A Price Above Rubies",
      "recommendations": [
         35852,
         168128
      ],
      "backdrop_path": "/t6ojY60WLVkN2ugU1nhwlKEWbt.jpg",
      "revenue": 1081957,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sonia Horowitz",
               "gender": 1,
               "credit_id": "52fe4683c3a36847f8103227",
               "name": "Renée Zellweger",
               "profile_path": "/aeUnfem148WrhpQcmiUuSRGhCYU.jpg",
               "id": 9137,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sender Horowitz",
               "gender": 2,
               "credit_id": "52fe4683c3a36847f810322f",
               "name": "Christopher Eccleston",
               "profile_path": "/9zI0Ed8aGxLPdTQeV0He9Rl0eSX.jpg",
               "id": 2040,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "52fe4683c3a36847f810322b",
               "name": "Julianna Margulies",
               "profile_path": "/cnYT0hvQe5Ue6qDf16AvQoPGKto.jpg",
               "id": 25654,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ramon Garcia",
               "gender": 2,
               "credit_id": "52fe4683c3a36847f8103233",
               "name": "Allen Payne",
               "profile_path": "/xJtew7b2oZRZjIzocnBZgkVlWWt.jpg",
               "id": 32486,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mendel Horowitz",
               "gender": 2,
               "credit_id": "5a0b4f07c3a36821090210fa",
               "name": "Glenn Fitzgerald",
               "profile_path": "/cPMVT0AclKYbUvB3ZI8bTSVSoTK.jpg",
               "id": 10694,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Rebbitzn",
               "gender": 1,
               "credit_id": "5a0b4f14c3a36820fa022a27",
               "name": "Kim Hunter",
               "profile_path": "/nB44EysedphcIWftSqyyG2qBYk8.jpg",
               "id": 10539,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Rebbe Moshe",
               "gender": 2,
               "credit_id": "5a0b4f25925141310f0227c1",
               "name": "John Randolph",
               "profile_path": "/r3HirIBplq3hjYYvO7JtyGP4SrF.jpg",
               "id": 18649,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Schnuel",
               "gender": 2,
               "credit_id": "5a0b4f34c3a36820fa022a75",
               "name": "Peter Jacobson",
               "profile_path": "/zOyIUOFNmb15I7QbB3E9kw48LXl.jpg",
               "id": 31514,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Feiga",
               "gender": 1,
               "credit_id": "5a0b4f3e9251413121021908",
               "name": "Edie Falco",
               "profile_path": "/3cPF1o5oag20UXtCYkZeCTtcTFx.jpg",
               "id": 36190,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Young Hassid",
               "gender": 2,
               "credit_id": "5a0b4ed8c3a368218a026462",
               "name": "Michael Stuhlbarg",
               "profile_path": "/d5gyuiv43sZQT88HhYzgSeQP3RE.jpg",
               "id": 72873,
               "order": 9
            },
            {
               "cast_id": 7,
               "character": "Lady Vendor",
               "gender": 1,
               "credit_id": "564e7be99251414b070017a2",
               "name": "Ching Hoh-Wai",
               "profile_path": "/dqaBlhsdF5VEQlGki8yaus7q4RN.jpg",
               "id": 1269910,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4683c3a36847f8103239",
               "name": "Boaz Yakin",
               "profile_path": "/4NL3F6iwVlwdWvBKue5H8OpZrp2.jpg",
               "id": 52358,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4683c3a36847f810323f",
               "name": "Boaz Yakin",
               "profile_path": "/4NL3F6iwVlwdWvBKue5H8OpZrp2.jpg",
               "id": 52358,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a86a0110e0a26540c033058",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.988447,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 44308,
      "vote_count": 9,
      "budget": 0,
      "overview": "About a young woman who is married to a devout Jew and the problems that trouble their marriage because of the woman wanting something more out of her life.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "A Price Above Rubies",
      "runtime": 117,
      "poster_path": "/i2dr4UrvhgXNp6fIG5H4fVnF3C1.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1998-03-26",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Boaz Yakin"],
      "runtime": 117,
      "synopsis": "A young Hasidic Jewess, trained as a jeweler, is unhappily married to a very religious scholar. She has a mystical bent which is manifested by ongoing dialogue with her deceased younger brother and by encounters with a mysterious but wisdom-dispensing older woman. After her brother-in-law offers her a job as his jewelry buyer in his jewelry business, she embarks on an unfullfilling sexual relationship with him. She loves her new job and meets a talented Puerto Rican jewlery maker whom she encourages to continue his trade. Her jealous lover thinks she is having an affair with the jewelry maker and destroys her life. Abandoned by everyone, she finds a new life in the ashes and sets out to pursue her dreams.",
      "writers": ["Boaz Yakin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120793/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgwMDA3MDk2MV5BMl5BanBnXkFtZTcwNTMxMDMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Renée Zellweger, Christopher Eccleston, Julianna Margulies | See full cast and crew »"],
      "reviews": [
         "I was Sonia. I lived a life in many ways similar to her's - i.e., married a 'yeshiva buchor', supported him, rebelled (emphatically!), was ostricised and found the whole thing stifling, intollerant, conformist (woe betide to those who dared to be a bit different), suppressive and above all 100% hypocritical (I don't look Jewish and if I had a penny for the number of 'orthodox' men who tried to pick me up, I could retire!). Mendel's brother's behaviour wouldn't surprise me in real life one bit. I was absolutely amazed how authentically the characters in this film portrayed the yeshiva going community - to the point where I actually read the credits at the end to see how many of the actors were Jewish! Although Judaism is supposed' to be a lot of things (i.e., the man is 'encouraged' to see to his wife's pleasure), it is in fact quite often the opposite. As is often said, the religion is fine, it's the people who leave a lot to be desired. And that came across so clearly in this film. Sonia was ostracised for not conforming (yup, that sounds about right), her husband was so 'devout' (a tzadik) he was ashamed of his - and her - sexuality that he tried to repress it (yep, right again), the yentas (busy boddies) in the community had a lot to say (um hmmm) - absolutely everything about the movie was so spot on it was eerie - even down to the Yiddish-isms, accents and dress. It brought back a lot of unpleasant memories...but that is only a testament to how authentic the film really was. In terms of storyline, content, acting, music - I thought it was excellent, hence the 10* rating.",
         "The self-imposed standards regarding matters of faith to which an individual must adhere, the priorities one sets, and giving precedence to one matter of importance at the expense of another are issues addressed in `A Price Above Rubies,' written and directed by Boaz Yakin and starring Renee Zellweger. After the birth of her first child, a son, a young New York City woman, Sonia Horowitz (Zellweger), struggles with emotional and sexual frustration as she attempts to cope with the extreme ideals of her husband, Mendel (Glenn Fitzgerald), an Hasidic Jew who holds God above all things, including his wife and their marriage. Mendel is a good man, a holy man, but in his youthful zeal to please God and live according to His Word, he woefully neglects Sonia, a fact to which he has been blinded by his religious fervor. His devotion to God is so all consuming that he is not only unable to meet, but is unaware of, the needs of his wife. Sonia is a good wife and mother, a good person who loves God, but is simply incapable of effecting Mendel's degree of devotion and sacrifice. His concerns are of a spiritual nature, while hers are more immediate. Increasingly discontent and striving for a means through which she can rise above the stature of non-entity bestowed upon her by Mendel, her life takes a turn only when her brother-in-law, Sender (Christopher Eccleston), intercedes on her behalf. A jeweler by trade, Sender sees a value in Sonia that he likens to a price above rubies, but his efforts soon prove to be a mixed blessing for her, as ultimately her life becomes more complicated than ever. Yakin is to be commended for his objective approach to this story; any judgment of those involved is left to God and the audience. He neither condemns Mendel for his-- what may be deemed by some-- excessive piety, nor does he absolve him of it's implications. By the same token, he neither condemns nor absolves Sonia for her actions. And by avoiding any subjective judgment of the characters, it heightens the impact of the film in that it forces the involvement of the individual viewer, who must then decide if what has transpired is appropriate or not. It's a very subtle and effective way of drawing in the audience, wisely employed by Yakin, as it maintains a balance in the film while allowing the actions of the characters to speak for themselves. As Sonia, Zellweger turns in an excellent, understated performance, through which she makes you feel the exasperation of this woman in need of self-esteem and acknowledgement. There's something of Ibsen's `A Doll's House' in this story, for Sonia (like Ibsen's Nora) is not motivated by selfishness, but by the desire for her family to be able to function as a whole, and to be, herself, an invaluable part of that whole. It's a selfless pursuit for recognition and equality, rather than an ego driven quest for autonomy, and because of this it is easy to empathize with her. Zellweger does not play Sonia for sympathy, though it would be the easy road to take with this character; she opts instead for credibility in her actions and reactions, and succeeds with an honest portrayal that makes her entirely believable. Fitzgerald also gives a solid performance as Mendel, a man you are neither able to like nor dislike, mainly because Fitzgerald does such a good job of maintaining the integrity of the character. And as Sender, Eccleston does a notable turn, as well, and again the filmmaker's objectivity in presenting the relationship between the brothers adds that ring of truth that makes the contrast between the two convincing. The supporting cast includes Julianna Margulies (Rachel), Allen Payne (Ramon), Kim Hunter (Rebbitzn), John Randolph (Rebbe Moshe), Kathleen Chalfant (Beggar Woman), Edie Falco (Feiga), Shelton Dane (Yossi) and Jackie Ryan (Young Sonia). Yakin's delicate handling of the sensitive subject matter, as well as the unqualified non-judgmental tone of the film, puts the value of `A Price Above Rubies' at a cut above the usual drama that seeks to deal with the issues of religious ardor. The ending of the film may not resolve the matters at hand to every viewer's satisfaction, but it's honest, and consistent with the rest of the story. What minor flaws the film may contain can be easily overlooked in light of Zellweger's memorable performance, and the fact that it proffers an emotionally complex and involving experience, especially for the discerning viewer. I rate this one 8/10.",
         "Having come from a similar background to the main character, Sonia Horowitz, I was able to empathize with her plight. Although there is much to be admired in the world of Orthodox Judaism, and Hasidism in particular, it is a community with a narrow, ethnocentric perspective with little latitude for behavior outside the philosophical norm. Many in the community who strive to exceed the acceptable boundaries find themselves isolated and ostracized for their non-conformal attitude. Sonia's journey, though not typical, had some of the elements I have personally experienced. I must note, however, that the sexual intercourse scene between Sonia and Mendel, where they perform the act fully clothed, is not technically correct. Jewish law actually expects that the couple be completely unclothed. It places the burden upon the husband to satisfy his wife to the best of his ability. I realize to what purpose the scene was done the way it was, but it incorrectly portrayed a very private and sacred part of Jewish life. I was deeply affected by this independent film targeted to a fairly limited audience. Renee Zellweger, a Catholic/Episcopalian Texas native, turned in a remarkable performance, and got many of the nuances right, as did many of the other performers.",
         "The cast is remarkable. Rene Zellweger gives the performance of her life hovering between wanting to be respectful and to blossom as a business woman and mother. She is so much smarter than her husband and wants so much more than she has that your heart aches for her. By the end of the movie the bright caterpillar is on its way to being a butterfly. The movie accurately depicts the present condition of the Hasidic movement in New York and Brooklyn and shows its strengths and weaknesses. The jewelry business is depicted as neither black nor white, but a series of grays. This is a great film and Rene Zellweger should be toasted for risking much and achieving more. Carol Kane was wonderful in Hester Street and Amy Irving likewise in Crossing Delancy. But Rene Zellweger soars.",
         "An ode to unconformity, the all-time human right to be different. The heroine Sonia is a member of an apparently highly traditional Jewish society. Traditional values and ethics are an every-day practice, the 'law' everyone lives by and to which everyone abides without questioning. Hence a break from the norm is considered high treason. However Sonia finds it difficult to conform. Although a fierce battle rages inside her, she has to live with her identity and consider the people she loves before trying to free herself from rules and commitments.",
         "A carefully and compellingly rendered drama of a contemporary woman's stirring discovery of self, \"A Price Above Rubies\" is set in the context of a Hasidic Jewish/American community. Beautifully photographed, this film's acting sparkles -- and renders a reasonably accurate portrait of an easily caricatured community. In a role played well before her current celebrity (circa Jerry Maguire), Renee Zellweger establishes herself as a talent of unlimited possibilities. That she doesn't \"look Jewish\" (by the stereotype) does not make her less convincing.... The film's feminist perspective is gracefully realized without belittling all guys -- which greatly enhances the film's power! (And lowers my blood pressure!) While compelling in the early going, the plot becomes a bit overly complex. But the film remains very well worth watching throughout. Production design is exceptional! Those Orthodox Jewish critics who are angered by this film's portrayal of Jewish Orthodoxy might have us believe that the world of Orthodoxy is monolithically benign. It is not. ... Traditional thought and practice -- orthodoxy in many settings -- has its beauties and strengths, and -- like most things human-- it has its dark, shadow side as well. I've personally experienced both the light and the dark, and know they both exist. \"A Price Above Rubies\" depicts the delicate balance gone awry. For a very different, also wonderful film which depicts both light and shadow sides of American Jewish traditionalism, but less critical of Orthodoxy, try \"The Chosen\" (1982) (adapted from Chaim Potok's book), with Robby Benson (quite good in this film, to my surprise), Rod Steiger and Maximillian Schell. For me \"The Chosen\" is a \"ten\", and among my all-time top 10 films!",
         "A moving film about religious fanatism (and not against Jewry) and emancipation with convincing actresses and actors. Very recommendable!",
         "I just want to mention that sequence where the old head rabbi dies in the arms of his wife after making love to her. He was inspired to do this after he heard the Zellweger character articulate the heat inside her that would not be satisfied.... At the memorial ritual ceremony, the newly widowed woman smiles in rapture at Sonia. Very telling sequence as it shows the essence of the passion in the Sonia character. This is one of those movies that is riveting upon seeing it again - even if only in parts on TV - years after the initial theatrical release which I saw years ago. I need one more line of text here so let me state that I had to check to see if Renee Zellweger is Jewish in real life. She is not. Goes to show you how well she played this role. Thanks to all those who made such a brilliant film.",
         "Well, I thought this was a great film. A tale of desperation in a young woman's personal search, this film offers an intense experience for the viewer. Sonia embarks on a search for not only herself but also her place in the world and for the duration of the film Renee Zellweger gave Sonia the precise dignity and emotion that the role deserved. The supporting cast were strong, Juliana Margulies certainly showing that she's doesn't always play the 'nice girl'. Christopher Eccleston was convincingly wicked and Glenn Fitzgerald puts in a credible performance as Mendel, capturing the essence of the role commendably. Yakin, although sometimes a little predictable juxta positioned shots poetically and dealt with the depths of the situation with a suitable depth of character investigation. I think definitely a 'chick flick', generally the issues dealt with in the movie were of a feminine nature and I would think that the emotional dominion, would have it seldom appeal to a male audience. It's recommended viewing although it is a deep movie so make sure you're in the mood. 3.5-4 out of 5",
         "I would like to comment on Renee's portrayal of the character Sonia--she was absolutely incredible! So many of her roles have been in the \"cutesy\" genre. This role was devoid of being \"cutesy\" at all. She was gutsy, believable and did a very good Brooklyn accent. I had never heard of this movie for one reason or another, and I'm glad I caught it on cable. A very, very good movie. One other comment: I am a Protestant, and I know very little about the Jewish faith. This movie peaked my curiosity for more knowledge about Hasidic followers of Judaism. I Googled and read about the beginning of the Hasidic beliefs. Once again, the cinema has enlightened me about a subject I previously had no knowledge of."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "GreeneStreet Films",
         "Lawrence Bender Productions"
      ],
      "summaries": [
         "About a young woman who is married to a devout Jew and the problems that trouble their marriage because of the woman wanting something more out of her life",
         "Sonia is a member of a closed Hasidic community, who doesn't feel comfortable about religious rules and restrictions, and constantly breaks them, upsetting her relatives."
      ],
      "budget": 0
   },
   "movielensId": 1814,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1998-03-26",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Boaz Yakin"],
      "runtime": 117,
      "movieId": 1814,
      "title": "A Price Above Rubies",
      "mpaa": "R",
      "actors": [
         "Renée Zellweger",
         "Christopher Eccleston",
         "Julianna Margulies",
         "Allen Payne",
         "Glenn Fitzgerald",
         "Kim Hunter",
         "John Randolph",
         "Peter Jacobson",
         "Edie Falco",
         "Michael Stuhlbarg",
         "Ching Hoh-Wai"
      ],
      "imdbMovieId": "0120793",
      "originalTitle": "A Price Above Rubies",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["ANPal6lLtQk"],
      "plotSummary": "About a young woman who is married to a devout Jew and the problems that trouble their marriage because of the woman wanting something more out of her life.",
      "tmdbMovieId": 44308,
      "avgRating": 3.394,
      "releaseYear": "1998",
      "numRatings": 250,
      "posterPath": "/i2dr4UrvhgXNp6fIG5H4fVnF3C1.jpg"
   }
}