{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "housewife",
            "id": 3451
         },
         {
            "name": "boarding school",
            "id": 6271
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "infatuation",
            "id": 34262
         },
         {
            "name": "new england",
            "id": 41393
         },
         {
            "name": "multiple sclerosis",
            "id": 209223
         }
      ],
      "imdb_id": "tt0119049",
      "video": false,
      "title": "Eden",
      "recommendations": [],
      "backdrop_path": "/jdyjmEKdME5kEJpaiB2RPjdz8rr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Helen Kunen",
               "gender": 1,
               "credit_id": "52fe4ab5c3a368484e162d49",
               "name": "Joanna Going",
               "profile_path": "/8wPmJGGj4HEUfaYzYjoL1AzOSlf.jpg",
               "id": 59662,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Bill Kunen",
               "gender": 2,
               "credit_id": "52fe4ab5c3a368484e162d4d",
               "name": "Dylan Walsh",
               "profile_path": "/6rOQgNjIJUqXDiM06K2hrL68Eky.jpg",
               "id": 21043,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dave Edgerton",
               "gender": 2,
               "credit_id": "52fe4ab5c3a368484e162d51",
               "name": "Sean Patrick Flanery",
               "profile_path": "/1xgb9WblosYkvTGoh0yDuZII9ok.jpg",
               "id": 54789,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dithy",
               "gender": 1,
               "credit_id": "52fe4ab5c3a368484e162d55",
               "name": "Anna Faris",
               "profile_path": "/b9o0qGfRqaQqehSiVw3VHfDmlP8.jpg",
               "id": 1772,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rick",
               "gender": 0,
               "credit_id": "5489cea8c3a3686f5b001ace",
               "name": "Sean Christensen",
               "profile_path": null,
               "id": 1397903,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sonny",
               "gender": 0,
               "credit_id": "5489ceb3c3a3686f52001b9d",
               "name": "Edward O'Blenis",
               "profile_path": null,
               "id": 1397904,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ab5c3a368484e162d45",
               "name": "Howard Goldberg",
               "profile_path": null,
               "id": 122458,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5489ce92c3a3686f4e001c6d",
               "name": "Howard Goldberg",
               "profile_path": null,
               "id": 122458,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.418021,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 124821,
      "vote_count": 1,
      "budget": 0,
      "overview": "Story of a New England boys' school and of one of the students who is infatuated with an instructor's wife who has Multiple Sclerosis. The woman struggles to show her strict husband how love rather than demands helps the student to blossom, but finally she falls into a coma. While she is able to have some 'looking down' awareness of what is happening, her coma is what brings her husband to an understanding of the needs of others.",
      "similar": [
         9475,
         52449,
         1807,
         18148,
         77949,
         233063,
         810,
         437670,
         400928,
         59861,
         103663,
         22302,
         7340,
         9276,
         140,
         14069,
         35052,
         10092,
         1259,
         13466
      ],
      "original_title": "Eden",
      "runtime": 106,
      "poster_path": "/2ITpYeIsc2K4FsSJSX4tV2ph7xe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Front Street Pictures",
            "id": 3958,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "BMG Independents",
            "id": 38567,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Edenstreet Productions",
            "id": 41052,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Let your spirits soar.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Howard Goldberg"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Howard Goldberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119049/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MzY0ODM4M15BMl5BanBnXkFtZTcwOTY5NTcxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Joanna Going, Dylan Walsh, Sean Patrick Flanery | See full cast and crew »"],
      "reviews": [
         "This was an incredibly moving film. I had heard about it when it was at Sundance and waited to see it when it came out in theatres, but it never came to my area. Then, there it was at Blockbusters. I rented it and was thrilled. It was a moving and spiritual film with incredible performances (especially Joanna Going). It is a perfect evocation of the era (60s). The story, of a woman who has MS and starts to believe that she can leave her body when she sleeps, is a beautiful metaphor. Her dreams start to become almost like a heroin addiction -- a way for her to be able to deal with her life that she can't seem to come to grips with when she's awake. See it. I highly recommend it.",
         "I watched this film this morning. What I saw was a woman finding the courage to live after the stoic \"stay tough\" attitude of her husband had pushed her so deep into herself she couldn't fight any more. The husband's lack of understanding was so real to me, I too am married to someone physically disabled and it has been a struggle for me to get past that sometimes. I wish there were more films about this subject, I don't feel quite so confused now...and I maybe I have a little bit more understanding of how he may feel sometimes. To me, that's what a movie like this is supposed to do, give us insight into our own emotions and enhance our understanding a little.",
         "This is a beautiful film about a woman escaping into a cycle of involuntary astral projection experiences and making the difficult decision of coming back to her body and her life. For anyone who has suffered through the limitations of physical disability or disease, this film is a gift. And it's recommended viewing for anyone who wishes to gain an understanding of illness and death. Should be seen by every medical practitioner in the country.",
         "I recently saw the film myself on The Movie Channel. I thought it was moving, intelligent, and strangely artful in the depiction of person struggling with MS. I did find some editing moments, particularly the end when the police arrive to arrest Dylan Walsh's character crosscutting with Joanna Going character's rebirth, a little raw but for a first feature, the dirth of moods, characters, and setting was commendable. Can't wait for Mr. Goldberg's next feature.",
         "One of the most beautiful Films I've ever seen. Every scene is a piece of pure artwork. It's great seeing some of these great actors during this time in their careers. Brilliant directing & cinematography. The screenplay/writing is substantive, honest and heart-felt. Anyone who loves movies should see this film. Very imaginative considering the subject matter. I love the setting and era oriented backdrops, still remains fresh and relevant for today however.Really cool! I see why this was selection at Sundance! Seem like there might be a basis for a TV series here. a clinic in film-making.Im not too macho to admit...I cried. Bravo!",
         "I recently discovered this film gem. It is a stunning portrait of a woman trapped both in her body and life circumstances--caged physically (by Multiple Sclerosis) and spiritually (by the constraints of pre-feminist 1960's social expectations). It takes place at a New England all-boys prep school (rendered here better than Dead Poets' Society). All three leads (Joanna Going, Dylan Walsh, and Sean Patrick Flannery) give performances they have yet to repeat. Howard Goldberg's writing is whip smart, yet his direction has a delicate touch which, no doubt, adds to the actors' superb, nuanced performances. This film can't help but resonant with any owner of a human soul, but certainly has acute resonance for anyone who has ever felt anchored to this earth by a physical challenge; an uncooperative body or a life path chosen in youth, haste, or simpler times. There is a caged bird metaphor which in the hands of someone less smart and perceptive as Goldberg could seem ham-fisted, and yet here literally and figuratively soars. There is nothing not wonderful about this film. I could not recommend it more highly. After seeing it, I felt that giddiness you feel when you feel like you and you alone have discovered something sublime.",
         "This movie could be a hit if they'd edit out the kids and the crow... I watched it on TIVO sped through it the first time (gave it one thumbs down). For some odd reason (guess the description caught my attention) I TIVOd it again. This time I let it run on a Sunday afternoon whist cooking an early dinner...sorta like company. When the scene where Joanna describes the human body as a vehicle (I like container) caught my eye/ear I began to pay attention. From that point forward, I found that Helen (Going) and Dave (SPF) interactions to be quite engaging. I finally sat down to eat when Helen asked the boys if they'd ever seen their bodies from above. I relaxed, ate my steak and watched the rest of the movie. I loved the ending line so much I played it a couple of times and decided to \"watch\" Eden a third time. I found that I was speeding through the painful and superfluous family footage stopping only for the interactions of Helen and Dave. As a video editor, it was clear to me that a really great, interesting spiritual movie could be cobbled together using the existing cut. Simply by editing out the kids and the crow a terrific movie would emerge..try it yourself. There are so many great monologues and dream sequences in this movie it'd be worth the effort just to get the message out.",
         "Decent acting. Keeps you wondering where the spiritual part of the movie is going- I am still wondering. Sympathy for a beautiful woman cut down in the prime of life. Good character development except for the father whose acting was one dimensional). Gives a kind of better understanding of the effects of MS and how the rest of us take daily living chores for granted. Also the two background college boarders (friends of Edgar)were unconvincing and did not convey any feelings across the screen that I could discern.",
         "SPOILERS!! Normally, I would never waste may time writing a review, however, I imagine if I can save even just one poor soul from this movie, my life will be of value. The entire movie appears to have been written as a high school project. There is absolutely no connection or fluidity of the scenes. One minute, \"Dave\" is french kissing his teacher's wife in front of his teacher. The next minute, \"Dave\" and his teacher are sharing a brewski at the kitchen table before another 180 degree turn of emotions occurs. There was not a scene that could not be predicted a mile away. When the teacher pulls the plug on his comatose wife, I only felt envy that she might be able to escape this movie's cruel grasp.",
         "A good premise and nice photography. As a person with MS, I was excited to finally see a movie about someone with the disease. The problem is that Joanna Going can't act worth a lick. I believed she had MS about as much as I believe George Bush is contrite about the failings in New Orleans. The biggest problem with her performance is that she didn't become the role. She obviously never researched what it's like to have MS. And she obviously never paid attention in acting class. It just goes to prove that a pretty face is more important than talent in Hollywood. \"Eden\" could have been a good film: the story, the premise, the characters all probably looked good on paper. It's a shame that the producers settled for someone with a pretty face rather than someone who could actually carry the story."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "BMG Independents",
         "Edenstreet Productions",
         "Front Street Pictures"
      ],
      "summaries": ["Story of a New England boys' school and of one of the students who is infatuated with an instructor's wife who has Multiple Sclerosis. The woman struggles to show her strict husband how love rather than demands helps the student to blossom, but finally she falls into a coma. While she is able to have some 'looking down' awareness of what is happening, her coma is what brings her husband to an understanding of the needs of others."],
      "budget": 0
   },
   "movielensId": 1815,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": null,
      "directors": ["Howard Goldberg"],
      "runtime": 106,
      "movieId": 1815,
      "title": "Eden",
      "mpaa": "",
      "actors": [
         "Joanna Going",
         "Dylan Walsh",
         "Sean Patrick Flanery",
         "Anna Faris",
         "Sean Christensen",
         "Edward O'Blenis"
      ],
      "imdbMovieId": "0119049",
      "originalTitle": "Eden",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["dzYCTejXbx0"],
      "plotSummary": "Story of a New England boys' school and of one of the students who is infatuated with an instructor's wife who has Multiple Sclerosis. The woman struggles to show her strict husband how love rather than demands helps the student to blossom, but finally she falls into a coma. While she is able to have some 'looking down' awareness of what is happening, her coma is what brings her husband to an understanding of the needs of others.",
      "tmdbMovieId": 124821,
      "avgRating": 2.94118,
      "releaseYear": "1996",
      "numRatings": 17,
      "posterPath": "/2ITpYeIsc2K4FsSJSX4tV2ph7xe.jpg"
   }
}