{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120219",
      "video": false,
      "title": "Storefront Hitchcock",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Robyn Hitchcock",
            "gender": 2,
            "credit_id": "52fe4689c3a368484e096081",
            "name": "Robyn Hitchcock",
            "profile_path": "/tQIuW5rsKV8SOps95hjInc14Y2y.jpg",
            "id": 73913,
            "order": 0
         }],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4689c3a368484e096087",
            "name": "Jonathan Demme",
            "profile_path": "/17dEjoWccPf9NDm43XP44vhSTEd.jpg",
            "id": 16294,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.120189,
      "production_countries": [],
      "id": 62695,
      "vote_count": 1,
      "budget": 0,
      "overview": "Live performance by Robyn Hitchcock, in... well, a storefront.",
      "similar": [],
      "original_title": "Storefront Hitchcock",
      "runtime": 77,
      "poster_path": "/sfIBZrFMGKwF23dgXKFueWm6qnx.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-03-27",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Demme"],
      "runtime": 77,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120219/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDI5MzczMzU4N15BMl5BanBnXkFtZTcwNjEzNzAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robyn Hitchcock, Deni Bonet, Tim Keegan | See full cast and crew »"],
      "reviews": [
         "A beautiful film starring one of modern music's most endearing (and brilliant) cult artists. It's interesting to compare \"Storefront Hitchcock\", recorded late 1996, with his 1985 concert with backing band The Egyptians, captured on the video \"Gotta Let This Hen Out!\" - great, if weird rock, the subjects may be mordid, but the tone is optimistic. Zoom to 1996 and the boyish cult star has become a greyhaired, matured solo-artist, offering introspective, haunting tales of death and despair. There's an almost majestic sadness to songs like \"Glass Hotel\", \"You and Oblivion\". Highly recommended.",
         "How wonderful to see a film that aims an unforgiving eye on one of our greatest modern free-style poets & he comes through it all without a blemish! This artists is one of the few that didn't sell out, burn out or become an aging impersonator of himself, like so many of his peers! He is the modern day Dali of the spoken word & you can gather that from any project he's released to date. (Though I highly recommend for starters \"Insanely Jealous\" From The Soft Boy's \"Underwater Moonlight\" LP) Thank you for doing this film! Now how about a book of lyrics & drawings....?",
         "Robyn Hitchcock is an eccentric, literate, musical survivor. His elliptical lyrics shrink his potential audience, and his success as a musician requires an effective connection between performer and audience. This film steps in to enhance that connection, boosting the effectiveness of Hitchcock's music in exactly the right way. This is an intimate performance that requires concentrated attention. Where Talking Heads stimulate your brain while activating your dancing shoes, Hitchcock teases, confounds, and animates your brain while stealing your heart. He's also an entertaining acoustic and electric guitarist. Mr. Demme, may I humbly suggest a Jazz Butcher film next?",
         "When Jonathan Demme made the Talking Heads concert movie Stop Making Sense in 1984 he set a standard that no director since has been able to match. The stark visuals and unique music of the band along with an amazing performance by main man David Byrne created an experience that many consider to be the last word in \"rockumentary\" film making. Fourteen years on Demme returned to the genre with StoreFront Hitchcock, a concert movie of arguably one of Englands finest, certainly one of it's most idiosyncratic, singer/songwriters Robyn Hitchcock. Filmed over two days StoreFront has Hitchcock performing his music in a NYC shop window, a bizzare concept but totally in touch with the singers famously \"unusual\" sensibilities. Demme films Hitchcock, along with Violinist Deni Bonnet and Bass player Tim Keegan, with their backs to the window as bemused passers by stare in (look out for producer and regular Demme cameo player Kenneth Utt!) As in Stop Making Sense we can hear the audience but not see them, instead sharing their Point of view to give us the feeling of being part of the live experience. Hitckcock himself is far less a visual performer than David Byrne which may be part of the reason Demme gives him an ever changing New York street as a backdrop. Instead of big suits and stage acrobatics, inbetween songs, Hitchcock includes some of his bizzare monologues and surreal observations. These tend to grate after a while although some are quite amusing. And there's always the knowledge that they're probably going to be followed by a fabulous, if completely unconnected, song. Many of these are taken from Hitchcocks then current Moss Elixer album with a few oldies and some of his work with The Egyptians thrown in. For those of us who feel that Hitchcocks music always sounded at it's best in it's most pared down, stark incarnations this is a joy. The fact that this is in essence an \"unplugged\" session brings his voice to the fore and it's rarely sounded better. A good example is the version of \"The Yip Song\" - that insanely manic number with it's \"Vera Lynn\" chorus appears here as a far more melancholic piece, aided by an on-screen dedication to Hitchcocks father Raymond. Maybe comparing this film to the Talking Heads movie is a little unfair. Demme may have used a similar technique but it does have it's own distinct flavour, perhaps unsuprising considering it has such a colourful artist as its subject. It never reaches the exhilarating levels of seeing Stop Making Sense in a movie theatre but Demme should be congratulated for having the smarts, ability and just plain good taste to bring such a unique talent to the big screen. Miles Pieri",
         "I finally saw the movie today. It was on the Sundance Channel. I love Robyn's music and have had the good fortune to seem him twice in concert. This replicated those experiences. You can't truly appreciate Robyn by just listening to a CD. He has such a unique outlook on everything and tells the most interesting stories. That's what makes the movie valuable as a chronicle of Robyn. It captures his music and some of his stories. Fantastic!",
         "Yes, Awful. Dated by the time I see this. Our singer in a self indulgent rant about things gone by. Thankfuly warned ahead of time by our opening credits that there will be 15 songs. Better to have been sung in his personal shower. Off key voice that cracks and scratches it's way through some of the most awfully written lyrics. The music in a basic form, any high schooler could follow. Not impressed to say the least, a complete waste of my time. Smallish, unseen audience, must be close family and friends because someone is clapping after the songs. The onlookers in the background are amusing, but then the curtain closes and we see Hitchcock in a dark, candlelight setting rambling on about who knows what, and then you start to miss the actual entertainment from the street side of things. Hair whipping? Really? His hair is short and has enough hairspray to hold back a gale force wind, yet he's trying to flip something from his face? His in between song ramblings I could clearly do without. Is this some kind of British humor? I just didn't get it. His tidbits of personal reflection I could do without. Could have shaved off painful minutes if it was left on the cutting room floor. I can clearly see why I've never heard of this guy and his act. And why it grossed $3,000 at a box office? Must have been that set of close family and friends watching the movie to see if they were in it? Sorry, this one's a loser.",
         "If you've only heard his albums you're missing most of the experience. Here's a chance to get a good idea of the joy that is a Hitchcock show.",
         "English singer songwriter Robyn Hitchcock (no relation to Sir Alfred) became a cult performer in the 1980s through the American college radio circuit. He made during that time some good, though perhaps overrated, records. Their lyrics were odd and eccentric, the music somewhat reminiscent of the rock of the late 60s (Pink Floyd legendary founder Syd Barrett is a name that came up in many profiles about him). In 1998, he decided to make a concert film, directed by none other than Jonathan Demme, who has directed the Talking Heads' widely acclaimed Stop Making Sense. Unfortunately, this movie is really disappointing, a concert film as dull as it can possibly be. We have a single camera fixing at Robyn blurting out his songs with an acoustic guitar and without much interest in a stage set in a deserted shop (thus the title, I guess). There is no audience inside, but wee see the people on the street outside passing by, occasionally stopping and looking what is going on inside. The songs are punctuated by some unfunny and rambling comments by Robyn. Unless you are a committed Robyn fan, you can safely skip this."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": ["Clinica Estetico"],
      "summaries": ["Rock-music lover and feature-film director Jonathan Demme takes on eccentric British singer-songwriter, Robyn Hitchcock, in an ambitious concert film. Setting up a stage in a New York storefront, Hitchcock plays with his back to the glass, while an audience looks on inside and passersby view the action through the window."],
      "budget": 0
   },
   "movielensId": 1819,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-03-27",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Jonathan Demme"],
      "runtime": 77,
      "movieId": 1819,
      "title": "Storefront Hitchcock",
      "mpaa": "",
      "actors": ["Robyn Hitchcock"],
      "imdbMovieId": "0120219",
      "originalTitle": "Storefront Hitchcock",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Live performance by Robyn Hitchcock, in... well, a storefront.",
      "tmdbMovieId": 62695,
      "avgRating": 3.36538,
      "releaseYear": "1998",
      "numRatings": 26,
      "posterPath": "/sfIBZrFMGKwF23dgXKFueWm6qnx.jpg"
   }
}