{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "female friendship",
            "id": 5248
         },
         {
            "name": "grief",
            "id": 9872
         },
         {
            "name": "death of husband",
            "id": 175421
         }
      ],
      "imdb_id": "tt0113851",
      "video": false,
      "title": "Moonlight and Valentino",
      "recommendations": [
         50116,
         9892,
         25697,
         24811,
         40480,
         19076,
         12616,
         2625,
         63020,
         41590,
         45712,
         47608,
         20545
      ],
      "backdrop_path": "/cxjWlycgV3kerpaUE3qBDQfVMHY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Rebecca Trager Lott",
               "gender": 1,
               "credit_id": "52fe478bc3a368484e0cce2d",
               "name": "Elizabeth Perkins",
               "profile_path": "/bkdWnnrMADJcFpKAOitMjQH3uEQ.jpg",
               "id": 20,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Lucy Trager",
               "gender": 1,
               "credit_id": "52fe478bc3a368484e0cce31",
               "name": "Gwyneth Paltrow",
               "profile_path": "/8x3jpWD7DEvyMXO1FOjwNdd1UZT.jpg",
               "id": 12052,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Alberta Trager",
               "gender": 1,
               "credit_id": "52fe478bc3a368484e0cce29",
               "name": "Kathleen Turner",
               "profile_path": "/jM1gpAt7vsn81NsvWqJGVLhD8As.jpg",
               "id": 3391,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Sylvie Morrow",
               "gender": 1,
               "credit_id": "52fe478bc3a368484e0cce25",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "54fdc1029251413aa000790f",
               "name": "Jon Bon Jovi",
               "profile_path": "/pqqJ2JN4vbXQBsjwzDDw8cSK2XL.jpg",
               "id": 32362,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jenny Morrow",
               "gender": 1,
               "credit_id": "545f9845c3a3680b5a000b39",
               "name": "Shadia Simmons",
               "profile_path": "/9pVeJa7yDnNkH37Q51slZVToLfW.jpg",
               "id": 104799,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Drew Morrow",
               "gender": 1,
               "credit_id": "545f98580e0a262ca2000577",
               "name": "Erica Luttrell",
               "profile_path": "/dfhPbYlGg9fjYMJAUsrttsVfzpT.jpg",
               "id": 1217865,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe478bc3a368484e0cce21",
               "name": "David Anspaugh",
               "profile_path": null,
               "id": 44847,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545f9823c3a3686cbb004413",
               "name": "Ellen Simon",
               "profile_path": null,
               "id": 53275,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "545f98280e0a26042c0090cf",
               "name": "Ellen Simon",
               "profile_path": null,
               "id": 53275,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.50635,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 68274,
      "vote_count": 15,
      "budget": 0,
      "overview": "Four women who discover untapped strength within themselves when they finally let go of what divides them",
      "similar": [
         332872,
         15705,
         10443,
         16619,
         16859,
         1587,
         866,
         13885,
         82702,
         322,
         43074,
         114150,
         55721,
         122081,
         110415,
         334541,
         452507,
         345938,
         10625,
         4327
      ],
      "original_title": "Moonlight and Valentino",
      "runtime": 100,
      "poster_path": "/wLwkTj5DRVNUnKSsNHdoka4QPLF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/cifwIG2aVR1dRis6yoiilq4qeIh.png",
            "name": "Working Title Films",
            "id": 10163,
            "origin_country": "GB"
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-29",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Virginity, sex, the big cry, and other salty topics.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Anspaugh"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Ellen Simon",
         "Ellen Simon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113851/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5MjI3MDcyM15BMl5BanBnXkFtZTYwMzkyNDI5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Elizabeth Perkins, Whoopi Goldberg, Kathleen Turner | See full cast and crew »"],
      "reviews": [
         "I'm not one to usually admit I was teared up during a movie but this movie got me at least three times. That alone should give it a 7 rating but I added one more. I guess I really understood Lucy in the movie since those are the type of women I would date. Once you get to know them all, all 4 that is, you can really understand this complex relationship. I will not go into too many details but this is a must watch movie and not a perfect 10 but pretty darn good. I cannot believe that this has under a 6 rating not true at all. So i have to add a few more lines. OK then vote for this movie with your heart not from a spectacularly sensational Hollywood standpoint.",
         "You have to be in the right mood for this movie. Fortunately the night I watched it I was in the right mood. I enjoyed this movie. It wasn't brilliant but it wasn't awful. The plot was believable. Husband dies tragically, wife bottles up feeling, friends help her through tough times, she helps friends through tough times, her feelings finally come out etc etc. Sounds like a bad soap but is actually quite good. The best bit of the movie for me was Elizabeth Perkins. For years I have suspected she could act quite well but previous parts haven't given her the chance to show it. This movie did! Elizabeth Perkins did a superb job of pulling off the part of the wife struggling to come to terms with her husbands death. The scene near the end of the movie where she finally broke down was a piece of brilliance on her behalf. Surrounded by three other popular actresses she shines through! I'm glad I watched it! 7/10.",
         "Moonlight and Valentino is the sincere attempt to portray a grieving woman.When I saw the film for the first time I was amazed by the acting abilities of Elizabeth Perkins. The rest of the cast was also great. (Gwyneth Paltrow,Kathleen Turner, Whoopi Goldberg give all great performances)Unfortunately the film is not coherent enough and the ending is also very flat.So it was not a great movie but at least entertaining with great and charming actresses. 6/10",
         "\"Moonlight...\" is a slightly massaged and sanitized but insightful and warm look at a woman (Perkins) coping with grief with help from a distaff trio of family/friends. A beautifully crafted piece of work at all levels, this dialogue-intensive film spares us much of the usual mourning melodrama and gets right into the healing process with humor, charm, and sensitivity while exploring the principal's relationships and not lingering too long on the central grief issue. Overall, an entertaining piece which, IMHO, was scored too low by IMDB.com users because of the male side of the jury. Recommended for more mature audiences... and Ebert, wake up and smell the roses.",
         "This movie surprised me. I had gotten it ONLY for Jon Bon Jovi as I am a big fan and wanted to see one of his first movies. I thought he was very good as well as irresistable as The Painter. But then I got into the movie and enjoyed the interaction between the women played very well by Elizabeth Perkins, Whoopi Goldberg, Kathleen Turner and Gwyneth Paltrow. Altho a female I am not usually into chick flicks but this was worth seeing.",
         "Since the first time I saw \"Big\" (one of my favorite movies) with the beautiful red-headed Elizabeth Perkins, I knew that as an actress she had some real potential. She just needed a little push and the right part and she could have the audience in the palm of her hand, crying right along with her. This movie is getting her there. When Rebekah (Perkins) loses her husband in an accident, turns to her abnormal sister Lucy (Gwenyth Paltrow in an annoying role) her best friend Sylvia (Whoopi Goldburg is adorable!) and her ex-step-mother Alberta (Kathleen Turner has aged beautifully). The three try to help the vulnrable woman back on her feet. In a few scenes we see how vulnerable and sad Becky really is...And those scenes were the most touching. In other scenes we see how sisters interact and how one sister tries to hold off on Alberta for fear of losing another loved one. It's complicated but overall, it's good. I didn't quite understand if abortion was a topic here...It seemed like it during the last segment. Does anybody have a clue? That's the only thing I hate; When they don't make it all the way clear in the movie then you know they could've improved. If you want to see some good acting see this movie. Elizabeth Perkins is gorgeous!",
         "A Young English professor (Elizabeth Perkins) loses her husband while an anxiety ridden best friend (Whoopi Goldberg), a quirky younger sister (Gwenyth Paltrow), and an attached ex-stepmother (Kathleen Turner) help her come to terms with life and love. First lead role I've seen Perkins take charge, Gwenyth in a new light a role that made me love her even more, Goldberg in the same light as Boys on The Side (1996), and Kathleen Turner pulls off a successful business mother vying for the affection of a daughter that doesn't belong to her, a beautiful thing. Joining the cast are a few of films sexiest men Jeremy Sisto and Jon Bon Jovi. Definitely worth the watch!",
         "I thought that Moonlight and Valentino was a good film. The cast was terrific and brought life to the \"talkiness\" of the movie. A widowed woman relies on her friends and a hot painter to get her through the rough time. Jon Bon Jovi is exciting in his first Big Screen role as \"the painter\". Good climax but it leaves you feeling like it's missing something.",
         "This movie had me laughing, crying and riding the emotional rollercoaster ride one deals with when faced with the death of a loved one. A \"womans\" movie as I would call it, with the strength to reach out to the inner emotions and bring them to a head. A movie which could allow me to relate to my own life experiences. I LOVED IT. Very much on a par with the likes of Steel Magnolia and How To Make An American Quilt. Just loved it.",
         "It's hard to rate this movie because it had such a terrific cast. The script was dreadful, stupid, silly. You shouldn't actually have to lose a husband to see the absolute falseness of the script. But to cast these great actresses in that story and require that they say those lines was an appalling waste. It is a tribute to their skill that the movie was even possible to watch at all. They did the best they could, but I found it painful to watch, not because I found the story touching but because it was so embarrassingly shallow. You can be sad and funny without being trivial. There are plenty of movies out there to prove it."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Polygram Filmed Entertainment",
         "Working Title Films"
      ],
      "summaries": [
         "College poetry professor and poet Rebecca Trager Lott's husband Ben Lott has just died in a freak accident. Rebecca's support during this difficult time consists of her best friend Sylvie Morrow, her sister Lucy Trager, and her ex-stepmother Alberta Trager. Earth mother Sylvie is dealing with what she sees as the probable end of her own marriage to her husband Paul Morrow. Chain smoking Lucy is a directionless and insecure woman who is still mourning their mother's death fourteen years earlier from cancer. And Wall Street executive Alberta, who Lucy in particular doesn't like in her life (especially as Alberta and their father have since divorced) is a domineering but admittedly efficient woman who treats her personal life as an extension of her professional life. As time progresses and each woman deals with her own issues while trying to help Rebecca, a hunky house painter who they have nicknamed \"Valentino\" enters their collective lives. \"Valentino\" profoundly affects each of their lives, at the same time that Rebecca, the only one who is seen as having had the perfect marriage, provides what they hope is sage advice for their issues. What comes into question is the appropriate time that Rebecca is allowed to feel sorry for herself. She makes an admission about her marriage and about \"Valentino\" that may provide the answer.",
         "A young widow still grieving over the death of her husband finds herself being comforted by a local housepainter."
      ],
      "budget": 0
   },
   "movielensId": 182,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-29",
      "dvdReleaseDate": "2001-02-06",
      "directors": ["David Anspaugh"],
      "runtime": 100,
      "movieId": 182,
      "title": "Moonlight and Valentino",
      "mpaa": "R",
      "actors": [
         "Elizabeth Perkins",
         "Gwyneth Paltrow",
         "Kathleen Turner",
         "Whoopi Goldberg",
         "Jon Bon Jovi",
         "Shadia Simmons",
         "Erica Luttrell"
      ],
      "imdbMovieId": "0113851",
      "originalTitle": "Moonlight and Valentino",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["EP2jMPtwKKg"],
      "plotSummary": "Four women who discover untapped strength within themselves when they finally let go of what divides them",
      "tmdbMovieId": 68274,
      "avgRating": 3.08159,
      "releaseYear": "1995",
      "numRatings": 717,
      "posterPath": "/wLwkTj5DRVNUnKSsNHdoka4QPLF.jpg"
   }
}