{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parish",
            "id": 4637
         },
         {
            "name": "sterility",
            "id": 5097
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "miscarriage",
            "id": 17986
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0120108",
      "video": false,
      "title": "The Proposition",
      "recommendations": [31945],
      "backdrop_path": "/ktCT4mwGS5BOvMDiJXssfrIC0b0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Father Michael McKinnon",
               "gender": 2,
               "credit_id": "548874e2925141520d0016c3",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Eleanor Barret",
               "gender": 1,
               "credit_id": "548874f0c3a3682d01000097",
               "name": "Madeleine Stowe",
               "profile_path": "/jqd70MNVUs3nTbxn3B3G6UNV4Oc.jpg",
               "id": 289,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Arthur Barret",
               "gender": 2,
               "credit_id": "548874fd92514151f8001a7f",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hannibal Thurman",
               "gender": 2,
               "credit_id": "5488750892514151fd001954",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sister Mary Frances",
               "gender": 0,
               "credit_id": "54887516c3a36841450018af",
               "name": "Bronia Wheeler",
               "profile_path": null,
               "id": 397047,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Roger Martin",
               "gender": 2,
               "credit_id": "54887548c3a3682d010000a5",
               "name": "Neil Patrick Harris",
               "profile_path": "/3GJBcsLf6Kfy0x5DeSXKsIqcctP.jpg",
               "id": 41686,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Syril Danning",
               "gender": 1,
               "credit_id": "5488755592514151fd00195f",
               "name": "Blythe Danner",
               "profile_path": "/vGv4EMRcy7xrRt8OvDzSuXohXjv.jpg",
               "id": 10401,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Wayne Fenton",
               "gender": 0,
               "credit_id": "54887562925141520d0016dc",
               "name": "Ken Cheeseman",
               "profile_path": "/veFInhz0ITqaRHRAXBjLPn3ZvTl.jpg",
               "id": 164004,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Torrey Harrington",
               "gender": 2,
               "credit_id": "55a661b1925141099e00125d",
               "name": "Thomas Downey",
               "profile_path": "/bibK5lsyc4WbEmw1v6QDzXHfiB0.jpg",
               "id": 30067,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44c09251416c9101b90d",
               "name": "Lesli Linka Glatter",
               "profile_path": "/8F13UPsRnXWTDcp8iA3ZXMtfJa3.jpg",
               "id": 15798,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c09251416c9101b913",
               "name": "Rick Ramage",
               "profile_path": null,
               "id": 64808,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55a6605492514109a10012db",
               "name": "Ted Field",
               "profile_path": "/qmB7sZcgRUq7mRFBSTlSsVXh7sH.jpg",
               "id": 9196,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55a6606ac3a3682bba00136c",
               "name": "Scott Kroopf",
               "profile_path": null,
               "id": 9184,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "55a6607ec3a3682bad0011f3",
               "name": "Diane Nabatoff",
               "profile_path": null,
               "id": 24052,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55a6609192514109a4001364",
               "name": "Stephen Endelman",
               "profile_path": "/1ey21aHi5U3FS5iZeVwvnodwSrX.jpg",
               "id": 21276,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "55a660a3c3a3682baa00134f",
               "name": "Peter Sova",
               "profile_path": null,
               "id": 11958,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "55a660bac3a3682bbf001354",
               "name": "Jacqueline Cambas",
               "profile_path": null,
               "id": 33830,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "55a660cc925141099b0011ba",
               "name": "Elaine J. Huzzar",
               "profile_path": null,
               "id": 7731,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "55a660de9251410996001237",
               "name": "Johanna Ray",
               "profile_path": null,
               "id": 3686,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "55a66107c3a3682bb200124e",
               "name": "David Brisbin",
               "profile_path": null,
               "id": 6391,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "55a6611e92514109a4001374",
               "name": "Anna B. Sheppard",
               "profile_path": "/q4XKRDuAeHtBsuYDq8gLgr75bCN.jpg",
               "id": 6688,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "55a77fe69251411e060015d2",
               "name": "Kate Lewis",
               "profile_path": null,
               "id": 1402123,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.360469,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32144,
      "vote_count": 7,
      "budget": 147773,
      "overview": "Father Michael McKinnon goes from the UK to Boston circa 1935. For unknown reasons, he avoids at all costs the most prominent parishioners, Arthur and Eleanor Barret. Meanwhile Eleanor and Arthur desperately want to have a child, but Arthur is sterile, so they hire Harvard law student Roger Martin to impregnate Eleanor, but unfortunately Roger falls in love with her.",
      "similar": [
         258480,
         27586,
         112160,
         858,
         141,
         244772,
         634,
         401898,
         242224,
         145,
         370663,
         43923,
         340485,
         250124,
         437557,
         297762,
         376660,
         129139,
         2255,
         11216
      ],
      "original_title": "The Proposition",
      "runtime": 110,
      "poster_path": "/zIPmvZyWLHOTZgpPXgnKgO2pvM0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Interscope Communications",
            "id": 10201,
            "origin_country": ""
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "1998-03-26",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "One man gave up everything he owned. The other, everything he believed in.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lesli Linka Glatter"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Rick Ramage"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120108/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MTg2ODUxNl5BMl5BanBnXkFtZTcwNjg1NTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kenneth Branagh, Madeleine Stowe, William Hurt | See full cast and crew »"],
      "reviews": [
         "Fortunately for me, I stumbled on this film with absolutely no expectations--didn't even know the title until I looked it up on the IMDb! But it kept me watching, fascinated, for two hours (including commercials), and at the end I felt like I wanted to spend more time with it. It has romance, elegant atmosphere, a surprising plot, intriguing themes, and good actors...so, while the pacing and direction sometimes seem a touch stilted, I'd definitely watch it again. I'm a bit baffled that everyone who finds fault with this film picks on the story. For me, the story was the strong point: it had some truly surprising twists and grew from the complexities and relationships of a range of fully drawn characters--a luxury most films, with their flat cardboard characters, don't offer. And the references to Virginia Woolf, also singled out for criticism by many viewers, actually served to enrich and illuminate the ways the film dealt with the tragic inability of a woman to escape the double standard. In the world of the film, where even a seemingly perfect husband could with no warning transform into a tyrant, even a woman who thought she had it all could be trapped by a paucity of choices. That makes it sound like a preachy feminist movie, which it isn't. In fact, those who enjoy good old-fashioned murder mysteries will get a kick out of it. Perfect it isn't, but I can think of far worse ways to spend a lazy evening.",
         "As another reviewer said--either you love it or you hate it. I loved it. A well acted movie--somewhat far fetched in the storyline. Very intense deep story and you really get caught up in it. I do not think a lot of the comments from other reviewers really see the value of the movie, or look at it from all of the character's points or motives. William Hurt as Barret is totally selfless in his quest for a family and Madeline Stowe as his wife is also very convincing. The big surprise comes from Blythe Danner, although I really cannot figure out exactly what her role was--is she secretly in love with Hurt? Hard to say. But the acting is fine and Kenneth Branaugh does a terrific and convincing job. He is a good actor and this role suits him splendidly. I do recommend this movie.",
         "Kenneth Branagh, as expected, performed very well. What was difficult to absorb as \"possible\" were the Catholic religious elements depicted. They were wrong and inaccurate. For example, the Mass vestments were not correct. The conversations and characterizations of the pastor and the young priest, for that period of time (Boston in the late 30s, early 40s) were off key, to say the least. The plot was interesting, but the film was too long, and there was too much \"symbolism\", and the \"next move\" was always predictable. With such a fine cast, and a great story, the producers and the directors should have taken time to be more accurate and correct about details. Another example of the lack of care was the scene where the young priest is seen administering \"Anointing of the Sick\" [formerly called \"Extreme Unction\"] to a corpse about to be buried. This never happens and is actually forbidden in the RC Church. Dead people cannot receive \"sacraments.\" Attention must be paid. Details, details, details. The truth is in the details. However, I did enjoy it. I think most people would find this film interesting and entertaining.",
         "Easily the worst film of all involved, this ridiculous film makes \"Days of Our Lives\" look like \"Citizen Kane.\" The overly complicated plot involves rich and popular couple Madeleine Stowe and William Hurt. They are successful in their 1930's Boston world in everything except having children. Enter Doogie Howser, I mean Neil Patrick Harris, as a young law school graduate who is hired to sire an offspring with Stowe for Hurt. Harris is hired by Robert Loggia, who wisely leaves the picture about midway through. Harris has some \"comic\" moments that make \"Road Trip\" look down right Algonquin, and eventually Stowe conceives. Talk about your co-inkydinks, new priest Kenneth Branagh comes to Boston, not wanting to meet with rich parishioners Stowe and Hurt. Why? In a plot twist worthy of a Harlequin novel, Branagh turns out to be Hurt's estranged brother's son. He is kicked out by Uncle William, and goes back to his life at the church. Stowe, now pregnant, visits him, and in a plot twist worthy of a Harlequin nov...wait, I used that...anyway, Stowe happens upon Branagh burying an anonymous dead man- Harris, who was murdered. Stowe falls into the open grave and miscarries. Let me repeat that- Stowe falls into the open grave. Hurt makes himself scarce through the middle of the film, away on business, and Branagh and Auntie Madeleine become closer. Blythe Danner, Hurt's mother figure (huh?) suggests nature take its course, and Stowe could give birth to Branagh's child and then Hurt would raise it. That would make Hurt's child his actual first cousin once removed, or would that be second cousin, or... Major league spoilers ahead: Branagh and Stowe give in to their earthly desires, and Stowe is impregnated. She gives birth to twins and dies during labor. Branagh is ready to raise the boys as his own, when he overhears Danner confess to murdering Harris, which I forgot occurred since it is repeated just twice more after the swan dive into the open grave. Branagh gives the boys to Hurt, and blesses them every Sunday. The entire film is a flashback told by Branagh to Loggia, who should have been privy to the plot but I guess was hiding under the craft services table during shooting. The impressive name cast is terrible. Danner is Hurt's mother figure. Branagh is the young priest, and Hurt's nephew. It does not help that all these actors look the same age. Danner's role in the family is not mentioned until over half way through, in the meantime she comes off as a nosy servant with no social life. Stowe plays an early women's libber, and I doubt this film will make it onto the top ten NOW film list. Stowe supposedly rights scandalous novels about women's property rights, yet we have no real indication of this. She mostly hops into bed a little too quickly to give Hurt a son. The couple starts the film lovingly, yet there are too few scenes to indicate why they loathe each other toward the end, or why Stowe keeps giving in to these stupid men, considering her social cause. Harris goes from intelligent law school graduate to overheated sex machine goof in approximately three minutes screen time. Branagh and Hurt spend many scenes looking at each other, as if trying to figure out what the other is doing in this mess. The film touches on everything from Nazi sympathies to women's lib to surrogate fatherhood to foreign trade to the stock market. The only thing not touched on is a decent screenplay and adequate direction. If you are looking for yet another Hollywood attack on organized religion, this is your cup of swill. If you are looking for something to get your mind off those complicated daytime soap operas, here you go. If you are looking for a few Oscar winners and nominees going through the motions of a dumb script and embarassing dialogue, we have a winner. If you are looking for a copy of this film, check the dumpster behind the video store. They said I had to return it by Friday, but they did not say where on the premises. Pass on this one and rejoice in your intelligence. This is rated (R) for some profanity, some sexual content, sexual references, and adult situations.",
         "Though there may have been some inconsistencies to real life, I enjoyed the movie and so did my friends and acquaintances...I was taken by the snowball effect...though some scenes could have been done differently...I accept it for exactly what it is...movie drama, not real life...some scenes were predictable and some I never saw coming...I was impressed with the job interview...the job...and then the transition from BOY to MANHHOOD and then the snowball effect that changes the lives of all persons involved including the priest...for me personally...the movie was well done...I am sure it could have been better but so could every movie once it has been seen and critiqued...GOOD JOB!",
         "I was looking for the Australian western of the same name and the Sundance credits writer got it wrong and roped me into this 1930s Boston Catholic melodrama. I still want to see the western, but this was not a bad misdirection. Whoever cast A History of Violence had to see this film as William Hurt plays the same character in both films - marvelously, I might add. He is a rich Catholic businessman here instead of a mobster, but the basics are the same. He wants to give his wife (Madeleine Stowe in a great performance) a child and Viagra was not yet invented, so he hires someone (Neil Patrick Harris) to do the job. His only mistake was picking a 24-year-old who couldn't just take the money and walk away. OK, so we have a moral question here, but we ignore that for the movies sake. Into his parish comes a new priest (Kenneth Branagh) and he jumps the Rabbit-Proof Fence, uses The Magic Flute, and we have an Alien Love Triangle. Didn't Richard Chamberlain do that naughty priest bit in The Thorn Birds? There is a lot of Catholic malfeasance, guilt and remorse and penance and symbolism here, but don't let that turn you off as it doesn't interfere with the story. And, no children were hurt in the making of this film. There are some fine performances and an interesting story. You should check it out.",
         "This movie is visually stunning and very well acted by the WHOLE cast. I think it is better seen at home where you can go back and watch portions over again, because in some scenes you must hear every word and pay attention to body language and expression quite closely or the plot can easily lose you. Bad acting or directing would have made this movie impossible to understand, because the writing is extremely subtle. I think the directing and acting is amazing because of what it conveys without language. (Some of the negative reviews were written by people who did not pay attention to key things are explained in few or no words, once, and once only, or to things that were shown only through non-verbal language. You must look and listen the whole time.) It does have the tragic-amazingly-coincidental stuff going on, but so what? It is entertainment, for goodness sakes, not a documentary! Apparently someone who was involved in making it is embarrassed, because it is impossible to get it on DVD in American format, which is a real shame. I love this movie, and am very sad not to be able to watch it since my VHS player broke. It always absorbs me and lets me forget about my own life for a few hours. I like to watch it once or twice a year, and enjoy sharing it with friends who have not seen it. It has been enjoyed by many people I know, but some did say that my pointing out key scenes was necessary for them to follow the plot. A few friends really did not like it, but none of those particular friends like tragic drama in general. I will continue to look for it on DVD every several months, and I will be looking to fix or replace my VHS player just so I can watch this and one other movie that I also love and can't get on DVD.",
         "Love it or hate it, and the opinions seem to be pretty evenly divided, this is a compelling film because of the performances of three fine actors--Kenneth Branagh, Madeline Stowe, and William Hurt. The story is incredibly far-fetched but, a la Six Feet Under, because it deals with emotions and fantasies we've all felt, it works in some sort of quirky way. Madeline Stowe is absolutely radiant--confused, vulnerable, strong, passionate. William Hurt perfectly combines the ruthless Wall Street professional and the condescending tenderness of a man of his time. Branagh is a cypher whose screen charisma makes him riveting. Some of the nitpicking in earlier reviews seems wrong to me. The Mass vestments are exactly right for the solemn high mass of that period, as is Branagh's demeanor. Extreme Unction can in fact be administered for a short period after death, though not, of course, on a corpse in a coffin. In fact, the only reason to open the coffin before burial is so that Eleanor can see who it is that's being buried.",
         "Great actors, good story - what went wrong? Kenneth Brannagh as a priest was an inspired choice of casting (If only all my priests were that ruggedly handsome & masculine, I would never miss confession!). William Hurt's presence, however, always seems to blur the edges of the characters he portrays. I never know where the character starts and the typical William Hurt begins (he did a great job though, I was almost convinced). Madeline Stowe is both brilliant and radiant as Eleanor (a pleasant surprise from her typically subdued ingénue roles!). Blythe Danner is a gem (as usual) even though she is horribly miscast, this lady is really foxy - far from the matronly and bitter spinster she plays. Neil Patrick Harris is always a treat (it's hard to forget him as \"Doogie\", he could play a cab driver and still be endearing and sweet). It's amazing how art reflects life. The movie deals with death and I couldn't help grieving because this could have been such a great film. The story had (at the risk of being corny) all the timeless symbolism and core themes of love and life. I was excitedly anticipating to see how these themes (such as that of human creation, as dealt with through the issue of \"baby-making\", or the relationship between religion and gender etc. etc.) were fully explored. Stowe and Brannagh make a tantalizing pair. They remind me of some sort of \"fully ripe\" Adam and Eve! (their love scene could have been sooo much better). Like I said, I kept wondering \"What went wrong?\" : The actors were exemplary (probably to overcompensate for the movie's weaknesses). The story itself was quite good but the plot line was seriously flawed. The cinematography was exquisite, but the scenes were poorly set up (there's one where saucy family secrets are revealed - where else? but in a soup kitchen!). I don't know much about the art of movie-making (movie-watching, maybe) but I think even a seasoned film professional will watch this movie with tears after seeing such a great cast and good concept go to waste. (Like I said, the movie is sad, unfortunately because of reasons other than it intended). I propose that this movie be redone and soon! (With Brannagh, Stowe and everyone in it, except Hurt and Danner)- yeah right! The other option is for it to remain as a prime example of when great acting meets a good movie idea, but the sparks just don't fly. Watch it for the actors, and weep for the film.",
         "How can you hate a movie that has Kenneth Branagh, as a Catholic priest, who has given in to the weakness of the flesh, saying, \"I began to know God thru Elenore...it was she who taught me about faith.\" Or Kenneth Branagh saying to William Hurt, \"You know you needen't feel guilty about this, THE SUN SHINES HERE TOO.\"(italics, mine) All kidding aside, the cast could have sleepwalked thru this somewhat cliched drama of a wealthy, staid older millionaire, resorting to having a jerk impegnate his beautiful young wife to keep the family line going, having the jerk end up dead, and the beautiful wife meets a charming local priest,,,and then...you know ..and so forth. Get the idea? But what saves the movie, are the acting \"chops\" of this steller cast: Branagh, William Hurt, the beauteous Madeline Stowe, and Blythe Danner. You can see they're not taking this film lightly. Branagh gets better with every film. He will surely inherit Olivier's mantle very soon. William Hurt definitely has acting greatness in him. His career seems to be on hold. He should be doing big, serious films. Madeline Stowe's beauty is so far above the average anorexic, thong, Barbie Doll, MTV sexpot, as to make them the jokes they have become. She doesn't weigh 27 lbs., AND she can really act. Where is her presence in major filmaking? Blythe Danner works steadily on Broadway and surely deserves an award for a lifetime of top level acting, on the stage, and in the movie house. All in all I enjoyed this film and recommend it to fans of the above great performers. If you like movies based on Dad's boss making him take in the boss's chimp for the weekend, just when the hated insufferable in-laws are coming for a barbeque, and the kids decide to dress up the chimp as Ben Laden, and the fox terrier next door tries to mate with the chimp and start a REAL family, even if the local DA says chimp /terrier unions are heretical to the basic man/women setup, and... and. If you like that kind of movie, \"The Proposition\" is not for you."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Interscope Communications",
         "Polygram Filmed Entertainment"
      ],
      "summaries": ["Father Michael McKinnon goes from the UK to Boston circa 1935. For unknown reasons, he avoids at all costs the most prominent parishioners, Arthur and Eleanor Barret. Meanwhile Eleanor and Arthur desperately want to have a child, but Arthur is sterile, so they hire Harvard law student Roger Martin to impregnate Eleanor, but unfortunately Roger falls in love with her."],
      "budget": 0
   },
   "movielensId": 1820,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-03-26",
      "dvdReleaseDate": null,
      "directors": ["Lesli Linka Glatter"],
      "runtime": 110,
      "movieId": 1820,
      "title": "The Proposition",
      "mpaa": "",
      "actors": [
         "Kenneth Branagh",
         "Madeleine Stowe",
         "William Hurt",
         "Robert Loggia",
         "Bronia Wheeler",
         "Neil Patrick Harris",
         "Blythe Danner",
         "Ken Cheeseman",
         "Thomas Downey"
      ],
      "imdbMovieId": "0120108",
      "originalTitle": "The Proposition",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["F22makMRAKs"],
      "plotSummary": "Father Michael McKinnon goes from the UK to Boston circa 1935. For unknown reasons, he avoids at all costs the most prominent parishioners, Arthur and Eleanor Barret. Meanwhile Eleanor and Arthur desperately want to have a child, but Arthur is sterile, so they hire Harvard law student Roger Martin to impregnate Eleanor, but unfortunately Roger falls in love with her.",
      "tmdbMovieId": 32144,
      "avgRating": 3.00694,
      "releaseYear": "1998",
      "numRatings": 72,
      "posterPath": "/zIPmvZyWLHOTZgpPXgnKgO2pvM0.jpg"
   }
}