{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "strip club",
            "id": 3688
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "dominatrix",
            "id": 7089
         },
         {
            "name": "cat fight",
            "id": 156854
         }
      ],
      "imdb_id": "tt0119905",
      "video": false,
      "title": "The Players Club",
      "recommendations": [
         28121,
         8291,
         29464,
         20322,
         16097,
         22067,
         25462,
         37964,
         16158,
         16162,
         27322,
         22314,
         16161,
         14805,
         33644,
         13960,
         29461,
         21915,
         12888,
         39349
      ],
      "backdrop_path": "/fnlwpsDCaXi24rG0x0uq5uTBGl1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Diamond (as Lisa Raye)",
               "gender": 1,
               "credit_id": "52fe47f49251416c750ab099",
               "name": "LisaRaye McCoy",
               "profile_path": "/cQex5h9GuQnHU7kLthyB0e8MpMI.jpg",
               "id": 105880,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mr. Armstrong",
               "gender": 2,
               "credit_id": "52fe47f49251416c750ab09d",
               "name": "Dick Anthony Williams",
               "profile_path": "/wibb1X9fvfiLADMFtfwuTb9UIUI.jpg",
               "id": 1911,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mrs. Armstrong",
               "gender": 1,
               "credit_id": "52fe47f49251416c750ab0a1",
               "name": "Judyann Elder",
               "profile_path": "/o5swKKUwN4oCf44OhowICmjZncg.jpg",
               "id": 77033,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Ronnie",
               "gender": 1,
               "credit_id": "56b0d733c3a36862060002ef",
               "name": "Chrystale Wilson",
               "profile_path": "/nkil2lcV1ViVW3kaJQPNtS6KIbj.jpg",
               "id": 582888,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tricks",
               "gender": 1,
               "credit_id": "52fe47f49251416c750ab0a9",
               "name": "Adele Givens",
               "profile_path": "/3vy6EP5HXSL6uMAdiAr3tj2Zhvo.jpg",
               "id": 141603,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dollar Bill",
               "gender": 2,
               "credit_id": "52fe47f49251416c750ab0ad",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "L'il Man",
               "gender": 2,
               "credit_id": "52fe47f49251416c750ab0b1",
               "name": "Anthony Johnson",
               "profile_path": null,
               "id": 83101,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Ebony",
               "gender": 1,
               "credit_id": "52fe47f49251416c750ab0b5",
               "name": "Monica Calhoun",
               "profile_path": "/yS9qr06QmFwgYNJR55vbPsNGvfK.jpg",
               "id": 32646,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Tina",
               "gender": 1,
               "credit_id": "52fe47f49251416c750ab0bd",
               "name": "Tracey Cherelle Jones",
               "profile_path": "/2e28ZU2nQEaxOu1js0DUiAhkS3u.jpg",
               "id": 66131,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "K.C.",
               "gender": 2,
               "credit_id": "52fe47f49251416c750ab0c1",
               "name": "Terrence Howard",
               "profile_path": "/MZeLxOH0PgL7xcvt865WVBvQDw.jpg",
               "id": 18288,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Brooklyn",
               "gender": 2,
               "credit_id": "56d6493bc3a3681e3901850d",
               "name": "Charlie Murphy",
               "profile_path": "/emMzTjrwhrPr1m8gepw1bvqJb6A.jpg",
               "id": 17840,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "59e392ec9251410b670000e2",
               "name": "Jamie Foxx",
               "profile_path": "/cDRGXCNrwf1p9jouw9GzhU2vWP7.jpg",
               "id": 134,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 2,
               "credit_id": "59e392ec9251410b670000e4",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f49251416c750ab08f",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47f49251416c750ab095",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.121854,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19848,
      "vote_count": 18,
      "budget": 0,
      "overview": "Young single mother Diana struggles to provide for her child and pay for her college education. She ends up working at a shoe store, but meets two strippers from a nearby gentlemen's club who convince her there's fast money to be made stripping. At the Players Club, however, Diana faces danger and heartbreak.",
      "similar": [
         182560,
         12163,
         9005,
         9879,
         77930,
         35056,
         96,
         161,
         15092,
         9737,
         755,
         189,
         50456,
         90,
         13009,
         437375,
         17740,
         9696,
         84174,
         34647
      ],
      "original_title": "The Players Club",
      "runtime": 104,
      "poster_path": "/wcLhljCphk92Pw4j7bjy1RagFEN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1998-04-08",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Here, we get down and dirty.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ice Cube"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Ice Cube"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119905/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0NDgwNzg4Ml5BMl5BanBnXkFtZTcwNzg3NTU0NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: LisaRaye McCoy, Dick Anthony Williams, Judyann Elder | See full cast and crew »"],
      "reviews": [
         "Unremarkable but ambitious story from writer-director Ice Cube. A young woman recalls her emotionally wrenching experiences while working at a raunchy black strip club. More specifically, she remembers the burden of dealing with sleazy customers, reprehensible rivals, and wild parties on the side, all the while doing her best to maintain her dignity while working to better her life. Intriguing story is accompanied by a talented cast, powerful moments, and some fine performances, but too often resorts to familiar plot twists and lame stereotypes. Not a bad piece of work for first time director Cube, but would have benefited from more creativity. **",
         "\"An Ice Cube film\"\u0085Wow, that's already big enough. Not that Ice Cube is the biggest celebrity of the planet, but he is an actor I appreciate; too much. He is honest, simple; pure. He is a rapper, a musician who writes songs for films, and is good at it, besides being a low profile artist. Plus, he is a very good actor who does what he pleases and likes to and never disappoints. With the production company he has, he could have the highest ego, but he continues on doing his job. In 1998, he got his chance to direct his movie; his first and only up to date. He wouldn't do the stupid gangster films the other rappers do because he takes the job seriously; so seriously he wrote his own neighborhood and people story, which is unexpectedly touching in its most impressive moments. He had done that type of film before, with independent man John Singleton, among others in that film I regret not seeing yet, \"Boyz N' the Hood\". Whether he got inspiration from there or not, I don't care, but the screenplay is his. In his tale, where he also allows a role for him, we meet Diana (a powerful and gripping performance by Lisa Raye), a young girl and aspiring journalist with a lot of problems that drive her towards working on a strippers club, to get money and become Diamond. In Dollar Bill's (original Bernie Mac) club, \"The players club\", she is not the typical stripper, dancing with all the others; she has a special number, and some clients. Every day she deals with cousin Ebony (Monica Calhoun), who lives with her and has more than two times her problems; her unfaithful boyfriend and the different people in the club, including DJ Blue (a calm portrayal by Jamie Foxx), who likes her. Like in any other story, these are not the only ones in Cube's vision\u0085There are lots of them and each of them has their own thing that relates to another thing. However, Cube always keeps the story focused in its center point. His gift as a director (because he could have sucked) comes with the importance he gives to the camera. He has a desperate need to show things as real as possible, even if it is a fiction story, so his camera moves like eyes most of the times, like afraid of watching what's waiting on the other side, so the impact is harder when we seed alongside the camera. It is a very effective technique. What is also captivating and remarkable, is how much of him we can see in the film. Like directors of the league of Scorsese or Oliver Stone, Ice Cube tries to makes us see what he sees. There are a few scenes with enormous violence; glasses that break, shootings, people hurt\u0085We feel it, and it is hard to watch. I was thinking about Spike Lee, and how personal his movies are. I was shocked with the ending of \"Do the right thing\", but I understood it was just Spike Lee expressing himself. I don't know what exactly the message Lee wanted to give was, I don't know what was going through his mind at the time, just as I didn't know what was Ice Cube thinking, so he could end up showing \"The players club\" in flames during the first frames of his movie.",
         "This is basically a black, very superior version of \"Striptease\" and \"Showgirls.\" It's not as sexy as \"Showgirls,\" but what I really looked for was a better plot. This had one. LisaRaye gave an impressive debut performance as a college student trying to make ends meet. Bernie Mac can make the most dramatic piece of dialogue into stand-up comedy with his extraordinary vocal strength and stamina. I was very impressed with Ice Cube, his writing-directing debut, because, honestly, I didn't know he was capable. I like how he staged the scenes and built suspense. The great thing about it is that there is a considerable amount of violence, but no one is killed. For once, a black film where everyone lives. Another thing, this movie has the best, most vicious catfight I have ever seen.",
         "Dear Reader, I think the movie Players Club had a good story line. The situation that Diana was in can be related to many young women's situation in today's world. So many women in search for independence like Diana have used Strip Clubs as a means to an end. However many ignorant individuals think that all strippers are whores and forget that maybe this job is a temporary position for some of these women. I think Lisa Raye did a good acting job and I hope Hollywood considers her for other roles. Ice Cube should be applauded for an exciting movie.",
         "This film is actually interesting at several levels. It is serio-comical so it has good contrast. Lisa Ray is delicious with her obvious attributes, mesmerizing eyes, and just perfect voice. Dollar Bill, the character played by Bernie Mac is simply funny. To the extent that there is a theme, it is one of black exploitation by other blacks, the operative color being the green of money, and it was refreshing to see the absence of non-African Americans so that the themes and action were not framed within the usual, tired aria of white economic oppression, and rather the interactions between the characters are the focal point. The criminals portrayed with the guns are more cartoonish than not, yet the real and abhorrent predators become apparent as the ones victimizing Ebony. Not an academy award winner, but good entertainment. Gets a 7 in my book.",
         "Fair B quality movie depicting slice of black American strip club life in southern USA.Story is good social commentary on said lifestyle's evils and dangers but the movie suffers from a rushed directorial style and lackluster performances even by pro actors who have displayed better in the past.This was probabably caused by lack of directorial discipline on Ice Cube's part due to budget constraints.You can realy tell the veteran actors were not paid properly and just cruised along as a favor for Cube.Too bad for the movie's story was a good idea,setting up for great drama,action,comedy,sex,social commentary and entertainment much like the winning formula of SHOWGIRLS.I vote for a proper remake of this one!But as of now,avoid this movie unless you really want a peek into that lifestyle or are a big fan of any of the lead actors.Do not expect much sex scenes though for the focus on this one is social commentary......",
         "In an ideal guided tour about freakishly bad movies from 1977 onwards, The Players' Club should deserve a stop. It's got a terrible storyline that, along with the not-so-subtle clinging onto (or blatantly ripping off) the tradition of blaxploitation, makes up for a trite, short-living revival of that genre. But also it's one of those bad movies that are so bad you can't take your eyes off of it. Watch out for the (so fake it hurts) catfight scene between the \"good\" stripper Lisa Raye and the \"bad\", lesbian, vicious, bleached blonde, whatshername stripper. The small part of Ice Cube himself as the stereotype bad guy and the obvious \"you can make all the money you want, but don't let money make a slave out of you\" message (you're gonna hear it so many times throughout the movie it's gonna ring in your head like a f***ing bell for hours afterwards !) top it all. Rent it, but only if you know how much it's gonna suck.",
         "by Dane Youssef YOU CAN MAKE A LOT OF MONEY IN THE STRIPPING GAME. And in the film industry. But movies on the stripping game don't seem to. They never seem to be well-made, or much fun. Why? What's going on here? The characters and plot are so non-existent, they fall under the category of pornos without sex. And who wants to see that? Such on the form as \"Showgirls\" made one wish the makers had followed pornography by example and not tried to have plot. Good readers, take a deeep breath of relief that \"The Players Club\" has slightly higher-quality of strip than glitzy dives like \"Showgirls\" and \"Striptease.\" Not quite the British Oscar contender level of \"The Full Monty\"... but not quite a \"Striptease.\" Written and directed by old-school rap superstar Ice Cube, \"The Players Club\" is a posh, yet harsh feature dealing with women needing big money really fast and giving themselves over to this way in order to get it. Stripping changes who you are all over. Inside-and-out, Diana says. But hey--everybody needs money. Everyone wants more. Even if you're Trump, every single dollar... just isn't enough. We've all heard of the girl who turns trick in order as last resort. There are women who get into stripping 'cause they want worship, adoration. To control every man in the room--and her career. But there are those who just need to make mad money mad fast. When we meet Diana (LisaRaye), she's just had a fight with father over college. He throws her out. She leans on a guy for support. He gives her more than that. He gives her a child. Then he leaves her. Single black woman raises baby on her own, no means. Such a sad, familiar story. To make ends meet, she gets at a shoe-store job. Some strippers come in and tell her there are ways of making more money--much, much more. In high demand. You're in charge of your career, your clientèle, yourself. Diana, you're suddenly in charge of life. The \"The Players Club,\" a ritzy men's club it Atlanta. The place is always hopping like a horny-toad on hop with the kind of people you'd like to know. \"Players\" has a lot of the gimmicks as \"Striptease.\" One can only wonder... did The Ice see that movie... just before he wrote up this? A lot is pretty warmed-over. But despite blaxploitation roots and intentions, \"The Players Club\" boasts an A-list cast and production values, thanks to the powerful status name of The Ice Cube and New Line. Bernie Mac gives in his plum of the \"Players Club\" owner \"Dollar\" Bill. A eccentric cartoon who dresses like a pimp, promotes himself like Don King with that philosophical wisdom that one picks up on the street, from the school of hard knocks. Business, yet ghetto. John Amos and Faizon Love are a pair of sorta dirty-cops who frequent. They got that Amos and Andy-shtick with Amos playing it straight and Love going for laughs. Oscar-winner Foxx of \"Ray\" fame got his start in the biz as stand-up and here as Blue, it might've served him (and the freakin' movie) better had he done some of his act. You'd think the DJ at a strip club wouldn't be important (Bill even tells Blue that to his face at one point), but he proves to be the very thing that Diana needs--even pulling it all together in the final act. Looking at all this, I kept waiting for Pam Grier to pop up in some cameo (where she at least keep her clothes on). \"Players Club\" does make a lot of its characters colorful and eccentric while keeping a lot of them fairly human. Cube tries to juggle, not making it a specific genre--but a \"life film.\" His movie is comedy, drama, a thriller, and action flick... As a filmmaker, Ice dons the indie hat here--as screenwriter, executive producer, director and bit-player. Though at times, Cube's stuff feels tired, underdeveloped. He's credited also as exec producer, which I think means he green-lit his own project. It pays to have an objective eye. Could Cube's old director from \"Boyz 'N' The Hood\" Singelton have come down to give former \"Doughboy\" some sage advice? Despite it's blaxploitation roots, \"Club\" mostly tries to sidestep a lot of opportunities to make the whole thing really, really campy, going for the \"so bad, it's good\" laughs that helped the earlier \"white-stripper\" movies get some viewers. But there is some camp here and there--all unintentional, I'm sure. Cube ain't Spike Lee. He doesn't make all the women into the kind of creatures they seem to be in their act. He doesn't make all their customers into crazed rioting monkeys. Oh, no. No, no. The Ice has more respect for this than all that. And doesn't just fall back on the easy crutch of just peddling shots of naked flesh from near beginning-to-end. I wished Cube's partner-in-crime Chris Tucker from \"Friday\" had popped- up. Tucker is on-par with Eddie Murphy and Martin Lawrence as comic presence. Such talent, he's can bring even the deadest scene to life. Ol' Smokey made \"Friday\" a must-see, he could've made this all the better. There are times when Cube doesn't capture energy he needs to. As director, he seems to be just recording. The camera is on auto-pilot rather than capturing mood. No classic, no AFI's 100 Best, no one's absolute fave of all time--no. Still worth seeing. And blaxploitation is still alive, still thriving... somewhere in this world. Not thriving like the stripping game, or the world's oldest profession. But yeah, it's there... --A Believer in Big, Bad Black Cinema, Dane Youssef",
         "Ice Cube probably will never be as revered or respected as much as his cohort, the late Tupac Shakur, when it comes to rapping or acting, but he's getting there. I liked his performances in Friday, Next Friday, Three Kings, and especially in Boyz 'N The Hood. Now the Cube attempts to direct a film, and this is his first project. Every Black American I've known has seen this movie; they have pride in seeing their brothers make films. Although this one is not great; it's watchable and it's quite good in spots. The story is about a young lady named Diana who comes from a well-off family. She had a child out of wedlock. Her parents want her to go to their alma mater, but she wants to go to another school that the parents disapprove. They get into a big fight, so she leaves them to go to her university of choice. Of course, she doesn't have enough money to go to school and raise her child, so she decides to become an exotic dancer at a black club. The club is owned by a man who is in big trouble with loan sharks. Later, a cousin comes to visit for the summer, and seeing Diana working there, decides to get a job there, too. Unfortunately, Ebony is drawn to the seediness of the people, and Diana must monitor her closely, because she's underage (18-19) Of course, all the usual stereotypes are here, the fat stripper who's booed of the stage, the outlandish show-offy dancers, the slow-witted stalkers, just like how it was done in \"Striptease\", but it's not played for laughs. There is one funny scene in which the loan sharks stick Jamie Foxx's head in the car and drive around with him still on his feet when he tells them he doesn't know where the club owner (Bernie Mac) is. The acting is either weak or over-the-top. LisaRaye, as Diana, is not a good actress, but she does look good. The others are either weak as well or go way overboard. The ambience, though, is quite good. The direction is decent, but the script is filled with cliches and other Black sayings that have been done to death. Why did I compare it with the A-Team? Despite the extreme violence stemming from beatings, arson, assaults, etc. no one dies! Just like how The A-Team and the bad guys have balletic shoot-outs, no man is ever shot and killed. Not a single person is killed in this film, which at least is a positive thing; that every one gets a second chance to amend themselves. If you're a fan of Ice Cube; this isn't bad, but I'd rent it on the cheap if you've seen everything else.",
         "I felt that the plot for Player's Club just barely held water. The second to last scene was a joke. A wheel chaired gangster with a tommy gun and a rocket launcher in the deep south was too much for me. The last scene with the beat up cousin was too much. How do you go job hunting days after being attacked. Even Al Bundy doesn't want a beat down ex-stripper pushing his wares. However as an Ice Cube fan and a fan of local \"players clubs\", the movie wasn't a total waste. It was the supporting characters that deserve credit for carrying this movie. All and all it's worth renting."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["New Line Cinema"],
      "summaries": [
         "Diana, a young mom working at a shoe store meets two strippers, Tricks and Ronnie. They tell her that she should work at The Playa's Club for big money. The woman accepts and soon introduces her cousin into the club. Then she finds out that her cousin is doing housecalls which Tricks bribed her to do. One day Diana returns to her house after almost being raped by an obsessed fan and finds her cousin sleeping with her ex-boyfriend. She kicks her cousin out and starts dating Blue, a DJ at the club. They go out one night and Diana's cousin calls asking her to pick her up from a bachelor party. Diana refuses and soon after her cousin is raped. Now she has only one option, to put Tricks in her place.",
         "An unwed mother's struggle to get her college degree leads her to dancing at The Player's Club, a seedy Southern strip bar filled with criminal mischief.",
         "Diana, a young, unwed mother struggles to make enough money to pay for her college education. Diana ends up working at a shoe store, when she meets Ronnie and Tricks, two evil strippers that work at a sassy strip club. Tricks tells Diana that she should \"use what God gave her\" and make some fast money. Diana goes to the hip and saucy \"The Players Club\". Dollar Bill, the owner of the club allows Diana to work and gives her the name......Diamond. Diamond's cousin, Ebony wants to work at the Players Club and gets caught up in the fast life. One night, when Diamond comes home, an obsessed fan attacks her. Diamond runs in and finds her boyfriend and Ebony in bed together. Diamond kicks her out and breaks up with her boyfriend. Ebony has been gone alot and Diamond finds out that Ebony has been doing \"other\" things than stripping. Ronnie makes Ebony go to Ronnie's brother's bachelor party. Ebony is raped and left to die. Diamond and Blue find her and call the cops. Diamond goes to The Players Club and confronts Ronnie. The two women end up getting into a catfight. Hair-pulling, name-calling, punch-throwing, these girls are going for blood.",
         "A woman must contend with rival strippers and her boss in an attempt to make a legitimate living."
      ],
      "budget": 4500000
   },
   "movielensId": 1825,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-04-08",
      "dvdReleaseDate": "1999-09-14",
      "directors": ["Ice Cube"],
      "runtime": 104,
      "movieId": 1825,
      "title": "The Players Club",
      "mpaa": "R",
      "actors": [
         "LisaRaye McCoy",
         "Dick Anthony Williams",
         "Judyann Elder",
         "Chrystale Wilson",
         "Adele Givens",
         "Bernie Mac",
         "Anthony Johnson",
         "Monica Calhoun",
         "Tracey Cherelle Jones",
         "Terrence Howard",
         "Charlie Murphy",
         "Jamie Foxx",
         "Ice Cube"
      ],
      "imdbMovieId": "0119905",
      "originalTitle": "The Players Club",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["BM_rc2rO-E0"],
      "plotSummary": "Young single mother Diana struggles to provide for her child and pay for her college education. She ends up working at a shoe store, but meets two strippers from a nearby gentlemen's club who convince her there's fast money to be made stripping. At the Players Club, however, Diana faces danger and heartbreak.",
      "tmdbMovieId": 19848,
      "avgRating": 2.72026,
      "releaseYear": "1998",
      "numRatings": 227,
      "posterPath": "/wcLhljCphk92Pw4j7bjy1RagFEN.jpg"
   }
}