{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120598",
      "video": false,
      "title": "Barney's Great Adventure",
      "recommendations": [
         19975,
         33838,
         60823
      ],
      "backdrop_path": "/sbaH1Zbgd1z7DcBUn3mZJneT4Fz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe473b9251416c750921ff",
            "name": "Steve Gomer",
            "profile_path": null,
            "id": 104507,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Family",
         "id": 10751
      }],
      "popularity": 1.117735,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17644,
      "vote_count": 9,
      "budget": 0,
      "overview": "Mom and dad dump son Cody, daughter Abby, her best friend Marcella and a baby on the farm with Grandpa and Grandma. Purple dinosaur Barney soon appears to entertain kids, and when a large colorful egg deposited on a farm by a shooting star is accidentally carted off, Barney and kids start their chase for it",
      "similar": [],
      "original_title": "Barney's Great Adventure",
      "runtime": 76,
      "poster_path": "/rvIlEKdi6ghMn6Q3ZshEYjkfyLd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lyrick Studios",
            "id": 91005,
            "origin_country": ""
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-01",
      "vote_average": 2.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Barney Collection",
         "id": 350402,
         "poster_path": "/qFwdOXTAf8ydwYinlNKogPNK47e.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Gomer"],
      "runtime": 76,
      "synopsis": null,
      "writers": [
         "Stephen White",
         "Sheryl Leach"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120598/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDc5MTYxMzEyNl5BMl5BanBnXkFtZTcwMjQ4NjQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: George Hearn, Shirley Douglas, Trevor Morgan | See full cast and crew »"],
      "reviews": [
         "Unlike the TV show, which is quite good for kids 2-4, this film is inappropriate for just about anybody. Very young children will be lost in the plot. And I don't really want to subject my child to slapstick humor (e.g. the sullen boy accidentally stepping on a cow pie).",
         "Barney the Dinosaur on television is tolerable. At least it has some educational value. This film, however, smokes the proverbial pole like few other children's films ever have. It is almost as if the producers wanted to see what an entire movie made of first takes would look like. The children are insipid, the adult actors were probably hired from casting calls at community theaters or special needs living facilities and the Dino-characters are more annoying than the squeakiest Pokemon you could imagine. This is a perfect example of an opportunity to make a good film out of an already successful television character squandered by lazy production and lack of funding. You would likely get more use from 5 dollars by eating it than spending it on this DVD.",
         "I know it's cool to hate Barney, but this really is a bad movie. The TV show, as dumb as it is, at least entertains kids. This movie actually frightened my four year old daughter. She didn't enjoy the movie and only watched it to make sure everything was okay by the end. She was sad and anxious most of the movie. The \"plot\" is nothing but a serious of perilous events, one after another, with the occasional (and out of place) Barney song interlude. Adults will hate everything about this movie. The movie is also very dark and hard to see much of the time. I would not recommend this movie to anyone, even Barney fans.",
         "What can I say about Barney the purple dinosaur ? Lots of things and none of them good . Apparently Barney is a role model for young children and shows them how live , should behave and how to do the right thing . According to Barney creator Kathy Parker a young child woke her family after a fire broke out since an episode of BARNEY AND FRIENDS warned children about the danger of fire . I'm just sort of guessing that human beings have an instinctive fear of fire so the credit of a child waking her family should be down to her basic instinct - Not something she saw on a television show As you imagine this feature length film starts with a sugary sweet sequence of young children and a baby being driven to their grandparents house and the story continues in the same vein . \" Oh little children . Aren't they sweet . Isn't life wonderful etc \" is the expected response from the parents watching this but any person child or adult with critical faculties will be telling asking themselves \" Are we being manipulated here ? Are we supposed to enjoy it because it's so innocent ? \" to which the answer is a resounding YES . We're being emotionally blackmailed and if you don't like this patronising crap then you must be an evil person , you're not allowed to criticise the pathetic and badly choreographed song and dance numbers or the fact that that for a film with the word adventure in the title there's nothing resembling adventure I have to be honest and say that I feel very , very sorry for children whose parents make them watch this . My own childhood adventure revolved around Saturday nights when I watched DOCTOR WHO and I think I can speak for everyone in the western world when I say sadistic monsters made out of condoms by the BBC are far more interesting than a man dressed up as a purple dinosaur",
         "This is probably one of the worst so-called \"movie\" ever! It barely has a plot. It isn't funny or humorous, or barely educational. Barney is very active in this film like he was having some serious coffee, high in caffiene. Actullay, none of the characters were lethargic. Cody is a butthole, Barney is doltish, B.J. is frightening and the rest are stupid eggheads. There was only a few good parts, and they were mediocre. My Film Rating: 1.5/10 My MPAA Rating: PG for some mild thematic elements involving an annoying dinosaur and brief violent images. MPAA Rating: G",
         "How I see the film, Barney's Great Adventure, it was DOWNRIGHT horse**** (sorry about the profanity). The Songs where like listing to Justin Bieber's song \"Baby\" (the fact that I can't stand the song), the film barely has any adventure, it just has nothing but chasing a rainbow egg and also having a fallen tree suddenly turn into a wooden airplane, by \"imagination\" and Barney, is just annoying and gay, if your some who enjoys this (no offense) you've hit the jackpot. Also this kid named Cody in the film said about Barney that, \"real dinosaurs don't talk and real dinosaurs don't laugh\" he's right, in fact he's a good example of maturity, (despite the fact that he's a total jerk in the film) well until Barney changes him. To me how I can see the reality of dinosaurs, if you've scene the film \"Jurassic Park\", they'll show you what dinosaurs do, they kill people and were awesome and real and were computer-generated, and don't have some guy inside a frigging dinosaur costume and have it sing annoying songs. I've heard that it got a poor rating on Rotten Tomatoes along with some other negative reviews, as well as, being nominated two golden Razzies, for \"Worst New Star\" to Barney (who is not real) and \"Worst Original Song\" for the opening song, \"Barney\" (Hooray, it's a dream come true!). Also, if you've read the trivia on this website, what It mention was, South Park co-creator, Trey Parker volunteered to direct this film but was declined, which is a good thing that he'd directed something better than this. Also the funny thing about this is that if he'd directed this then he would have Cartman to use as Cody, that would be funny. If your a parent who hates this film and thinks this film looks really awful, throw it in the trash and show your child a real G-rated musical, with better songs than the ones from Barney's Great Adventure, like for instance, \"The Lion King\" or \"The Hunchback of Notre Dame\".",
         "I know this is a kids film but I have to judge it from my own perspective: Oh, the horror, the horror. I will be dreaming nightmares about this big purple #&@$%½£ (the kind of strong language that this deserves is forbidden on IMDb). I never saw Barney the *beep* *beep* dinosaur before but good God is he annoying. His squeaky voice, the stupid look on his face and the conceited morals about dreams and whatnot that he keeps shoving in your face all come together to form an incredibly obnoxious whole. Added to this is the fact that the gigantic stuffed animal has an ability to disappear like he's a *beep beep* ninja. It's like no reasonable grown up (crazy circus people don't count) never see him until the end of the film and tat really pisses me off. One of the kids even says that he wouldn't just disappear but, guess what kid, he just goes away when you need him the most. The contrived plot, poor visual effects and so on are nothing compared to Barney himself. After seeing this I have come to fear for our future, I believe kids to be smarter than this, seeing Barney the dinosaur at an early age will probably dumb the kids down until the only possible future is that of Idiocracy (http://www.imdb.com/title/tt0387808/). The film ends with Barney singing \"I love you, you love me, we're a happy family. With a great big hug and a kiss from me to you, won't you say you love me to?\" My reply: NO!",
         "Utter Crap. First of all, when I was a kid, I used to enjoy Barney when it aired on PBS. Nowadays, I can't believe how moronic this movie is. The plot is nothing more than a lot of bore. The characters are all babyish. Cody is the least favorite 'cause I think he's a jerk. In the beginning, his sister and her best friend act like a couple of mini-teenagers. And Barney, YES Barney, is, pardon my language, the crappiest crap in the history of crap if it were dumped on by a pile of horse crap, the crap will be too heavy if you try to pick up the crap with a crap scooper. If you want something that defines the meaning of the word \"adventure\", Indiana Jones and the Temple of Doom would be an excellent choice. I'm sure it's got more action(and I mean it!) than \"Barney's Greatest Adventure\". -100 stars out of 100.",
         "I have seen lots of bad movies, but this is one of the WORST things to ever exist! I've only seen a clip from the film, and that was enough to make my eyes bleed! Why anyone direct, write, produce, or even be involved in such torture like this? I don't know what I hate more about this \"movie\", whether its barney's ear torturing voice, the hideous costume designs, the story, the acting, or the soundtrack, because everything, and I seriously mean EVERYTHING about this \"movie\" is just shockingly painful to watch! the TV series is just as god-awful, and this takes the cake. This \"movie\" is an insult to every child's intelligence! if you are a parent, do NOT let your kids watch this! this \"film\" is the reason why so many people have mental problems and eye cancer, that's how unbearable this disaster of a film is, save your money, and use it for something better! overall, if you hate awful films, then this \"movie\" is a serious form of torture. DO NOT WATCH THIS MOVIE! unless you are really that much of a masochist or a barney fan-boy. I am not even going to give this a 1 out of 10, because it deserves a much lower rating than a zero. below 0 out of 10! worst \"film\" ever made, DO NOT WATCH!",
         "At 18 I cannot stand the show, I mean I loved it as a kid, but now re-visiting like I like to do with some of my childhood favourites, I was surprised at how childish, simplistic and annoying it was. I was told that the movie Barney's Great Adventure was worse, so I gave it the benefit of the doubt and went ahead and watched it. After watching it, it is marginally better than the show, but that isn't saying much. As I have said, if you are expecting for more than just an extended episode of the TV show, you may find yourself disappointed. This leads to my first criticism, and it is that the story structure is very simplistic and episodic, it really did feel that it was an extended episode of the TV show. The script is awful, made up of truly banal and childish writing, no improvement whatsoever on the show's writing, and the multicoloured sets look flat and dull. To make things worse the choreography in the song and dance routines is very basic, and the songs themselves are forgettable at best, complete with cringe worthy lyrics and out of tune singing. The characters I couldn't relate to at all and as the film progressed I cared about them less and less, Barney is even more annoying than he is in the show, which is a hard feat considering how he is one of the most annoying characters ever. The children have dull-as-dishwater personalities, the grandparents are underused and BJ is just as annoying as Barney. It is pretty much the same with Baby Bop, who I admittedly found cute once upon a time, but other than one or two cute parts where she is trying to find \"her yellow blankee\" she is annoying and she is sickly sweet in alternative to naturally sweet. The acting is really not great, and the voice acting of Barney and BJ especially is really uninspired. The child actors are dull, like their characters and can't do anything with the script. Not even the underrated George Hearn, who was so brilliant in Sweeney Todd: The Demon Barber of Fleet Street, can save this film, with his character being so underused it is not hard to see why. In fact, for me the only redeeming quality is the magical scene in the hot-air balloons. Overall, a bad movie, it isn't the worst movie I have ever seen, and while kids will love it, adults won't most likely. It doesn't help that the show isn't the best inspiration to work from and that is an understatement in itself. 2/10 Bethany Cox"
      ],
      "genres": [
         "Adventure",
         "Family"
      ],
      "productionCompanies": [
         "Polygram Filmed Entertainment",
         "Lyrick Studios Video",
         "Lyons Group"
      ],
      "summaries": [
         "Mom and dad dump son Cody, daughter Abby, her best friend Marcella and a baby on the farm with Grandpa and Grandma. Purple dinosaur Barney soon appears to entertain kids, and when a large colorful egg deposited on a farm by a shooting star is accidentally carted off, Barney and kids start their chase for it.",
         "Mom and Dad dumps their son Cody, (all sunglasses and high-tops, a study in carefully choreographed cool, has no use for such childish folly). Their daughter Abby, her best friend Marcella and a baby on the farm with Grandpa and Grandma for a couple of days. Meanwhile a Purple talking dinosaur Barney. But Barney and his pals and Cody included (since he had to join forces with them for the first time), takes a trip and find that a magical egg--which is due to hatch any moment--is missing and it was no ordinary egg which people eat for breakfast it's a dream maker which has a creature inside. And it's up to Barney and the others to get the egg back in the farm before sunset."
      ],
      "budget": 15000000
   },
   "movielensId": 1826,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "2002-11-05",
      "directors": ["Steve Gomer"],
      "runtime": 76,
      "movieId": 1826,
      "title": "Barney's Great Adventure",
      "mpaa": "G",
      "actors": [""],
      "imdbMovieId": "0120598",
      "originalTitle": "Barney's Great Adventure",
      "genres": ["Family"],
      "youtubeTrailerIds": [],
      "plotSummary": "Mom and dad dump son Cody, daughter Abby, her best friend Marcella and a baby on the farm with Grandpa and Grandma. Purple dinosaur Barney soon appears to entertain kids, and when a large colorful egg deposited on a farm by a shooting star is accidentally carted off, Barney and kids start their chase for it",
      "tmdbMovieId": 17644,
      "avgRating": 1.20475,
      "releaseYear": "1998",
      "numRatings": 442,
      "posterPath": "/rvIlEKdi6ghMn6Q3ZshEYjkfyLd.jpg"
   }
}