{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "airport",
            "id": 822
         },
         {
            "name": "narration",
            "id": 2398
         },
         {
            "name": "ohio",
            "id": 2494
         },
         {
            "name": "protest",
            "id": 4108
         }
      ],
      "imdb_id": "tt0124295",
      "video": false,
      "title": "The Big One",
      "recommendations": [
         35555,
         1779,
         193041,
         79462,
         13070,
         20328,
         43023,
         86726,
         26765,
         35120,
         27623,
         26120,
         43120,
         89662,
         52480,
         106121,
         79008,
         76080,
         44591,
         41313
      ],
      "backdrop_path": "/j6o3p8QHoqBux9tVX706V9jtzLg.jpg",
      "revenue": 720074,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4314c3a36847f8038a2f",
               "name": "Michael Moore",
               "profile_path": "/b44FupQ50ND6CpNCYkGRRu5THv4.jpg",
               "id": 17087,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Herself - Random House Media Escort",
               "gender": 0,
               "credit_id": "52fe4314c3a36847f8038a33",
               "name": "Elaine Bly",
               "profile_path": null,
               "id": 557874,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4314c3a36847f8038a37",
               "name": "Jim Czarnecki",
               "profile_path": null,
               "id": 46430,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4314c3a36847f8038a3b",
               "name": "Brian Danitz",
               "profile_path": null,
               "id": 553646,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4313c3a36847f8038a2b",
            "name": "Michael Moore",
            "profile_path": "/b44FupQ50ND6CpNCYkGRRu5THv4.jpg",
            "id": 17087,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.734877,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 1774,
      "vote_count": 30,
      "budget": 0,
      "overview": "The Big One is an investigative documentary from director Michael Moore who goes around the country asking why big American corporations produce their product abroad where labor is cheaper while so many Americans are unemployed, losing their jobs, and would happily be hired by such companies as Nike.",
      "similar": [
         1701,
         278,
         107846,
         38234,
         9291,
         5925,
         1368,
         1429,
         708,
         76640,
         5503,
         7191,
         7443,
         8077,
         6075,
         1991,
         10193,
         11778,
         769,
         1281
      ],
      "original_title": "The Big One",
      "runtime": 91,
      "poster_path": "/3wwTvMxQfyyuvXaXLmLXnG2Dp3Z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dog Eat Dog Films",
            "id": 26137,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mayfair Entertainment International",
            "id": 34237,
            "origin_country": ""
         },
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         }
      ],
      "release_date": "1997-09-06",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://dogeatdog.michaelmoore.com/tbo.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Moore"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Michael Moore"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0124295/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxNDgzNTMyNF5BMl5BanBnXkFtZTcwODM3NTYyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Moore, Elaine Bly, Dan Burns | See full cast and crew »"],
      "reviews": [
         "As one user before said, he feels the film to be more of a time capsule today, since the impacts and importance of downsizing has been overwritten by other issues like terrorism, homeland security, 9/11 etc. Well, I live in Europe and I can just say that here in Europe the film just comes out on DVD (I saw it only yesterday, July 15th, 2004 on TV) at the right time for Europe (if not a little too late). Economical matters are getting worse here in Europe day by day, and the patterns CEO's use to make their companies \"profitable\" (which should just always correctly read: \"MORE profitable) are just the same as CEO's use in the USA. In fact, the only idea that comes to their minds is: downsizing, laying off people and transferring labour into countries with extremely cheap labour-cost. That's all. Surprisingly there is just very little resistance to these tendencies, even though Europe is (in most countries) far better organised as far as Labour Unions are concerned. People are told by politicians that reforms are necessary, and people just sit back and accept it and continue to suffer. In this context, \"The Big One\" by Michael Moore just comes at the right time here in Europe, even though I think that not many of the concerned people will actually see it. But it's worth watching it, even though sometimes I questioned myself how I could laugh over such sad facts. But this is the virtue of Michael Moore and this film: it doen't leave you desperate, it gives you a laugh at the time and maybe, if we're all lucky, it will lead to a better organisation of the people concerned and to more resistance against the 1 percent of the rich keeping the rest in poverty.",
         "Yet more excellent work from documentarian Michael Moore as he hits the road in 1996 for a 47-city tour to promote his new book \"Downsize This\". Funded by Random House Publishing, with that company having no idea that Moore is not just going to sign books, the all-world film-maker pulls no punches as he gets to the heart of corporation down-sizing just as some of the biggest money-makers in the U.S. start to have all-time record high profits. We see regular folks laid off by monsters like Pay Day (the candy bar company), Procter & Gamble, General Motors, Johnson Controls and Pillsbury. National corporations leaving the U.S. to pay lesser fees to employees in third-world countries is explained in great detail and Moore even has a unique conversation with Phil Knight, the CEO of Nike (also the only CEO brave enough to verbally spar), and needless to say Moore comes out looking much better than his opponent. \"The Big One\" shows the lack of political choices for the general public (the film makes it blatantly clear that the Clinton/Dole race of 1996 was a no-win vote) as blue-collar, middle-class workers fall in the work-place due to the lack of government control on power-mad corporations that only look at the bottom line and constantly talk about competition in their industry (this makes the big-wigs look even sillier in reality). The main theme from \"Pulp Fiction\" late during Moore's run of metropolitan areas ends up setting the overall tone of this exceptional documentary feature. 5 stars out of 5.",
         "The movie is frequently reminiscent of Letterman, visiting corporate headquarters with silly stunts - there's no way for the victims to win; even when they play along, as Phil Knight tries to, there's no room for rational argument. Moore is pretty engaging and energetic, but it soon becomes apparent that his movie has little ambition other than to string together such diverting moments and to hammer away at the main anti-downsizing theme. Astonishing that everyone makes the opposing case so poorly - it's a walk over; an overwhelming victory for the Forces Of Good. But Moore doesn't address the broader revolutions that would be required to make his ideas stick - the corporate heads are surely culpable, but if they didn't play along they'd be fired: it's investment-obsessed America (Beardstown Ladies and all) that keeps this crazy cycle going. Moore has a great gift for getting into the middle of activity and is a great raconteur, but for someone so relentlessly pure on hammering at the same anti-capitalist drum he leaves his own success conspicuously unexamined. The ragbag style is always entertaining though and the film has an appealing zippy pace - reservations aside, the uncertain encounter with Knight makes for a good climax.",
         "Michael Moore's The Big One is a typical Michael Moore documentary. By this post-Bowling for Columbine and present Fahrenheit 91I time period, much of America and the world know of Moore's feet first documentaries. With Moore becoming the funnier Mike Wallace of the '90s and shoving a microphone in the face of corporate and political bad guys at every turn, Moore again stirs up the corporate status quo in The Big One, released in 1998. The film covers the most threatening aspect to the American way of life at the time: corporate downsizing. The setting is the Midwest and Moore travels to small midwestern cities, most often the ones hit hardest by the factory closings and layoffs of the late '90s. While not as focused or even as serious as Moore's most recent efforts, this film is still reminiscent to his others in that it is both funny and thought provoking. Most likely unintended by Moore when filming, this film feels more like a time capsule than anything else. While factory closings and layoffs have continued into the 2000s, the impact the closings of the'90s had on America are far greater than the layoffs of today. A documentary on corporate downsizing today would be lost amongst the far more serious issues of U.S foreign policy and all it is related to, including terrorism, the Patriot Act and homeland security, Iraq, and Afghanistan. Factory closings and plant layoffs in exchange for higher corporate profits are an important issue, but when viewed six years later, this film seems almost insignificant. The Big One covers American politics as an extension of corporate America in that both elite politicians and elite CEOs are essentially the same type of person. In one segment, Moore covers the most recent presidential campaign, and in a series of interviews, many people say that they refused to vote because both candidates in 1996 were the same person; the only difference was their political party name. Today, America is so polarized politically that the idea of refusing to vote based on the fact that the candidates are too similar is not only incorrect, but also outlandish. However, one must remember that Moore was first a journalist, and his films are news-based, and by the hand, are not meant to have the longest of shelf lives. At their best, they are perfect time capsules of various issues facing America at a certain time period. Moore is highly visible in this film as he was in 1989's Roger and Me, only using his interview subjects to further his story and cause. While he does allow the characters to speak for themselves, they are only backing up his claims and not necessarily adding any more to the film than mere quotes. Moore's feelings and political motives are what make up this documentary, and they come through 100% to the viewer as Moore makes a convincing case for his cause. The film's use of humorous stock footage, broadcast news reports, and stand-up comedy scenes with Moore behind the microphone make for entertaining segments that either divert the viewer from the story and provide for some comic relief, or conversely, further the story when the footage has a sharp political undercurrent. Moore's juxtaposition of serious-minded news reports as the build up with one of his narrated comments as the punch line are entertaining and part of what make his documentaries fun to watch as well as informative. The Big One, while it does not necessarily have as solid of a story as Moore's other films and may be criticized for coming off as a 90-minute commercial for Moore's book, Downsize This, does manage to string together a few interviews with humor and a serious issue to effectively promote Moore's cause. Although we know Nike CEO and Moore interviewee Phil Knight would never put a Nike shoe factory anywhere in the US, much less in Moore's hometown of Flint, Michigan, the fact that Moore asked Knight to do so concisely summarizes Moore's message and wish: that US-owned companies stop closing factories and outsourcing to cheaper foreign markets and start giving US workers their jobs back. Anyone who has taken an international business course or even perused the Wall Street Journal knows outsourcing will continue. Moore's ability to increase the public's awareness is his best trait as a filmmaker, not his attempt to single handedly change the entire face of US and international business. The soundtrack, like other Moore films, is mostly there for humorous purposes. Moore lets the most serious moments in his films go without any sound other than the person weeping or ranting for maximum effect. That being said, his use of humorous songs including Americana classics pace the film and add to its quick nature. Moore only uses scene titles sparingly, as his narration divides the film verbally. The use of scene titles is not necessary when Moore is walking his viewers through the film. Funded by the British Broadcasting Company, Moore's budget is much more than his contemporaries', but even a large budget cannot save this film. His choice of story topic is not lasting enough to appeal to viewers not living with the economic divisions between rich and poor of the late 1990s. Also, if Moore had let the story lead him to various locations across the country instead of his book tour navigating, maybe he would have found out more information and created something better than The Big One. Additionally, perhaps if Moore had narrowed his ideas of what he wanted to cover before he started filming ('The Big One' refers to the US as the 'big' country) instead of attempting to cover American politics, the economy and sagging social standards all in one 90-minute documentary, his ideas would have came across even clearer than they already do. This is where Moore succeeds in his later films, especially Bowling For Columbine, which strictly focuses on a single issue with minimal sidebars. Sources of tension in this film go from the comedic sources ('media escorts,' i.e. middle age blonde women who cannot handle Moore's independent spirit) to the most serious ones (the US government and big business). He tries to grapple too much in The Big One, and that is where this film ultimately fails.",
         "The earliest of Moore's films I've seen so far, this is definitely not his best work... technically, this is the least impressive of the ones I've seen(the others are Bowling For Columbine and Fahrenheit 9/11). The editing, pacing and presentation just isn't as sharp or clean as the other two. The score isn't as ironic or fitting either. The humor, tone and 'direction' is just as good, though. This time, Moore takes a clean shot at corporate America, and clearly exposes the indifference of the common man's fate displayed by all executives. Several times in the documentary we're introduced to companies that, despite of high profits and no problems with their workers are laying people off, closing and moving factories... putting people out of work, effectively robbing them of their livelihood. As usual, it's done in Moore's fashion of outlining the facts that support his cause and denying or ignoring the ones that do not. Of course, he gets so many laughs throughout that you barely notice it... and what he says is true, at least to a certain extent. The interviews in which Moore asks all the right questions, usually very controversial and direct are inter-cut with what appears to be a stand-up performance by him, which adds a sense of closeness that means a lot for the effect of the film. Not as memorable and interesting as Bowling or Fahrenheit, but most definitely worth watching. I recommend this to any fan of Michael Moore and humorous documentaries. 8/10",
         "I saw this movie about a month ago on TV in its entirety (uncut). Having already seen \"Bowling for Columbine,\" this movie was a thorough disappointment. As some reviewers have already noted, it seems more like a plug for his book than an honest critique of society. Beware, logical fallacies abound: I cringed when Moore attempted (in vain) to draw a connection between terrorism and unemployment (\"which then leads to crime, depression, and suicide, so isn't that terrorism?\" as he compares pictures of the Oklahoma City bombing to some burnt-out factory). While I could connect with a lot of the messages (about gun control and the like) of \"Bowling for Columbine,\" this movie feels like a topsy-turvy ride from one logical mistake to the next as Moore whisks along the viewer in an attempt to hide the shortcomings in his message. Even in one of the final scenes where Moore was dared by the CEO of Nike to bring so many hundred workers for a possible factory construction, Moore uses sly camera work to hide the fact that only 30 or so showed up, half of them not even working age. Instead, he goads several \"protesters\" to address the camera directly--strangely, a pan shot of the \"protest\" is never shown. Part of me wishes the Nike CEO would have accepted the trip to see the Nike factories overseas so that Michael Moore could actually see these \"sweatshops\" he degrades all movie. Instead, Moore glances over the weak spots and instead focuses on the problems without ever enlightening the audience of possible solutions. Much more so than \"Bowling for Columbine,\" \"The Big One\" feels like a classic game of smoke and mirrors.",
         "I applaud Michael Moore for addressing gnarly, difficult subjects that other commentators and especially the news media are too chicken to tackle. This 1997 BBC documentary follows his '96 book tour promoting \"Downsize This!\". In the film, Moore travels to small town and Rust Belt America -- places often ignored by other social critics in favor of big cities and glamor locations. The realism and problems of ordinary, middle class, Middle Americans is one of the highlights of the film. This is an honest look at the economic problems in the US circa the 90s. One of Moore's strengths and weaknesses is just how funny he is -- he's a skilled speaker and essentially a talented stand-up comic, whose material is politically skewed and occasionally self-deprecating. This is disarming, and also plain, laugh-out-loud funny. I watched this film recently with a group of people who were in stitches, even though some of the material (in 2005) is a bit outdated by recent historical events. Some of Moore's funniest material is when he confronts executives or stone faced PR honchos, and waits for their predictable, canned, nonsensical remarks designed to give little information and obscure the issue at hand. It's powerful stuff, watching the rich and selfish defending their privileges, and a scathing commentary on economic inequality in what we like to think is the freest, richest, most egalitarian society in the world. HOWEVER -- Moore often weakens his own arguments by using shoddy and overly simplistic examples. Comparing a torn-down factory in Flint Michigan to the Oklahoma City bombing is very tacky, and not even a good analogy -- the loss in Oklahoma was human life, including many pre-school children...the loss of the Murrah building itself is insignificant. Unemployed workers in Flint do actually have other options, like moving elsewhere for work. It's a cheap shot. Another lame effort occurs when Moore challenges the president of Nike to build a shoe factory in Flint, over his objections that \"American's don't want to make shoes\". Moore claims he will get 100 workers together who do want to produce footwear for Nike -- then the film shows a pitiful rally of a couple dozen folks, many of whom are small children. Closeup photography obscures the fact that Moore could NOT find 100 willing workers in Flint, despite all the well-publicized poverty...is it true that Americans are unwilling to manufacture shoes? We'll never know. Another flaw is that Michael Moore is not especially honest about his own status in all this. He's a very successful pundit and filmmaker (although this movie was made years before the phenom of \"Fahrenheit 911\"), and had already published several books and had a TV series. He's wealthy by the standards of most Americans, a celebrity and immune to the economic realities that he is describing. That tends to make his criticism rather facile. For example, he fails to explain how (as in the example above) Americans earning even minimum wage, about $5 per hour, can possibly compete in manufacturing with Third World workers who make 50 cents an hour...no matter how hardworking or willing those Americans are. This is the hard reality facing both employees and employers, and it's curiously left on the table here without discussion...except perhaps to suggest (vaguely) that companies should make business decisions on charitable grounds, rather than economic ones. Still with all it's flaws, I find this (and other) Moore documentaries a valuable contribution to National debate, especially along Red State/ Blue State lines. The most valuable historical information in \"The Big One\" is whenvoters (talking about the '96 Clinton/Dole presidential race) say that \"both candidates are the same\" and \"turnout will be historically low\" and \"who cares who is in office\". Those comments are truly astonishing in light of current events and political atmosphere, and this is only 8 years later. The world has been turned on it's axis by current events! Yet it's important to realize how recent that change has occurred, and extremely valuable to look at evaluate the political and economic changes of just the last decade. In conclusion: a challenging and interesting documentary, with some flaws, but extremely funny. Worth watching.",
         "The Big One is a well rounded accomplishment for Michael Moore. This film is almost like watching an autobiographical documentary. The movie highlights the notable events surrounding Michael Moore's book tour for Downsize This!. The feel of a rushed and improvised tour schedule sets the pace for scenes of public speeches, crew activity, and corporate inquisition. The film shows that Michael Moore reveals his humanitarian instincts in even the most hectic of environments. The direction of developing plot is specific to each of the cities that Moore goes to on his tour. The story that surrounds Nike, Inc. is absolutely worth watching. Corporate business is analyzed throughout this film and Michael Moore makes it a point to have the audience think about what they are watching. Highly recommended for fans of Bowling for Columbine, Fahrenheit 9/11, Sicko and admirers of Michael Moore.",
         "From the back of the DVD cover of \"The Big One\": \"If Fortune 500 companies are posting record-setting profits, why do they continue laying off thousands of workers?\" That's the fundamental question this movie poses to the viewer. In \"The Big One,\" filmmaker Michael Moore goes on a Random House book tour promoting \"Downsize This! Random Threats from an Unarmed American.\" In a hilarious whirlwind tour across the United States that takes him from Milwaukee, to Philadelphia, to Ft. Lauderdale, to Rockford, to Des Moines, to Harvard University and finally to his hometown of Flint, Michigan, Moore asks that fundamental question while also exposing corporate corruption and callous politicians in the Clinton-era America of the mid-1990s, and also playing good-humored pranks on the assorted media escorts hired to keep him out of trouble. Moore's book tour travels are mixed with blazing stand-up comedy and visits with out-of-work or soon-to-be out-of-work employees at these major companies that are making record-setting profits but continue to lay off their workers, when they should be hiring more workers. He also talks clandestinely with employees at a Des Moines Borders who were forced out of a book-signing and also had money being taken out of their paychecks to pay for a doctor as part of an out-of-state health care plan. These same workers were also trying to organize a labor union. He also meets a woman at a book-signing who was laid off earlier that day and she wanted desperately to meet him. We are also quite startled to learn that TWA has found cheap labor in prison convicts for their phone-answering services. At the end, he's granted with his first (and only) interview with the C.E.O. of Nike, which has a company in Indonesia that hires underage workers. Moore offers numerous challenges to which the chairman turns them all down - exposing his callousness and greed - and the C.E.O. finally caves to donate $10,000 to Flint, Michigan's struggling school system. \"The Big One\" is perhaps Moore's most underrated feature. Of course the film seems like a time capsule 11 years later since corporate downsizing and corruption have taken a backseat to terrorism, America's simultaneous conflicts with terrorists in Afghanistan and Iraq, and the global War on Terror. But I also have to say that \"The Big One\" is perhaps Moore's funniest film to date (my personal favorite is his 2004 anti-Bush \"Fahrenheit 9/11,\" and I have yet to read \"Downsize This!\"). But underneath the biting comedy, there is also a strong sense of anger and sadness that Moore delivers with some pretty strong passion. Some bits of \"The Big One\" are just downright depressing. He knows something's wrong with all the big corporations that continue making record profits but lay off the workers when they should be hiring more. While the movie is incredibly funny, Moore has been criticized for not offering solutions to all the people he encounters. The answer is simple, he just doesn't have any. There's nothing he can do to change the minds of greedy executives who would send jobs abroad rather than keep them here in America because they don't have to pay the workers as much. He's only one man who has been the ire of corporate America for nearly 20 years now, and it doesn't seem like he's any closer to winning his crusade. \"The Big One\" is Moore's \"Big One,\" all right, full of humor and satire aimed at his one true enemy, corporate America. It's not his best movie, but it proves that he still has the ability to expose corruption everywhere he sees it and show us that something is indeed wrong in this Land of the Free. 10/10",
         "The Big One fails on the two levels it aims at: political consciousness and entertainment. First the entertainment level. Michael Moore's \"documentaries\" are meant as half entertaining, half political much like his show \"TV-nation\" (BBC). The entertainment often takes the shape of embarrassing his enemies in front of the camera by confronting them with suggestive questions for which they are usually unprepared. This can be funny but a lot of times I just felt sorry for the people who were confronted by his blunt questions. Often it was like the Charlton Heston visit in Bowling for Columbine which was the weakest part of that documentary. I thought the majority of the DVD was boring and lacked structure. The first half I was wondering, what is this about? The Big One was all centered around Michael Moore's book tour, promoting his latest book. Who even cares about that stuff? I wanted to see him confront high-level executives from large corporations or government officials, with sharp questions, but I got to see none of what I had hoped for. The other level The Big One fails at is political consciousness. It lacks depth. The corporate management people he visits are always lower management (except for the Nike official), who don't have any authority on strategic decisions that force their plants to shut down locally and move to cheaper countries. Despite that, these people show themselves quite capable of defending their company's policies with rational arguments: they need to stay competitive in their market to survive, they are not charity after all. But Moore never really listened to them or even thought about their arguments. He just tried to keep waltzing over them repeating cheap suggestive questions like \"how do you live with yourself\" etcetera. Moore did have a point criticizing the government paying welfare to companies but failed to focus on one simple subject. He could have focused on just that one issue, or the Nike factories in Asia, or the factories that were shut down. That way he might have been able to put the finger on the REAL problems in all those cases, but I doubt it. I'll give it my two cents: -The main problem with companies that downsize is that they don't hurt the people that can take the biggest blows because they make the most money in those companies: the UPPER MANAGEMENT. -The other problem with companies that fire their people despite profits is they usually communicate badly and don't give enough time and compensation to the people that are sacked. The \"right to have a job\" is an outdated communist notion. Let these people look for a new job, just help them finding it! -Having factories in third world countries, even when they have a dictatorial regime, is NOT \"unethical\". These people would be off much worse without those factories. In fact in those countries most people are jealous of the people that do work in Nike factories because they can help support entire families. The people that have to get by with their own farms and other \"native\" means of making money have far more miserable lives and have to work even harder. The only thing that I would agree on is that Nike should hire more people and let them work less hours (keeping their costs the same), while improving working conditions. If you like Michael Moore: Fahrenheit 911 and particularly Bowling for Columbine are far superior. Despite their flaws (often presenting fiction as fact) they are entertaining and serve a purpose in broadening people's perspectives by displaying a different view on the subjects of terrorism and violence than most of the media."
      ],
      "genres": [
         "Documentary",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Mayfair Entertainment International",
         "British Broadcasting Corporation (BBC)",
         "Dog Eat Dog Films"
      ],
      "summaries": [
         "Our intrepid defender of the working man, Michael Moore, documents his 1996 \"Downsize This!\" book tour across the USA. Shot on-the-cheap with a video camera, we once again watch our hero interview the working man at yet another plant closing, while also trying to get past corporate security guards to interview the millionaire CEOs.",
         "On his book tour, Michael Moore exposes more wrongdoing by greedy big businesses and callous politicians around America."
      ],
      "budget": 0
   },
   "movielensId": 1827,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-06",
      "dvdReleaseDate": "2004-09-28",
      "directors": ["Michael Moore"],
      "runtime": 91,
      "movieId": 1827,
      "title": "The Big One",
      "mpaa": "PG-13",
      "actors": [
         "Michael Moore",
         "Elaine Bly",
         "Jim Czarnecki",
         "Brian Danitz"
      ],
      "imdbMovieId": "0124295",
      "originalTitle": "The Big One",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["Fm21JY7WhyY"],
      "plotSummary": "The Big One is an investigative documentary from director Michael Moore who goes around the country asking why big American corporations produce their product abroad where labor is cheaper while so many Americans are unemployed, losing their jobs, and would happily be hired by such companies as Nike.",
      "tmdbMovieId": 1774,
      "avgRating": 3.74633,
      "releaseYear": "1997",
      "numRatings": 1090,
      "posterPath": "/aFLY07Lf4lCLj8sN5LUp5jyZyRj.jpg"
   }
}