{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0118851",
      "video": false,
      "title": "Chinese Box",
      "recommendations": [
         35151,
         38731,
         37922
      ],
      "backdrop_path": "/3hAYaWMDHAaGymJlzTbYqqlKt4s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe44089251416c91002ae9",
               "name": "Jeremy Irons",
               "profile_path": "/9AWphjIgGX7JjTrwrx3tsTZlUgv.jpg",
               "id": 16940,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Vivian",
               "gender": 1,
               "credit_id": "52fe44089251416c91002aed",
               "name": "Gong Li",
               "profile_path": "/dgGWKMAP5vbgACkXTazZXt3JQoT.jpg",
               "id": 643,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jean",
               "gender": 1,
               "credit_id": "52fe44089251416c91002af1",
               "name": "Maggie Cheung",
               "profile_path": "/eT5HNJT307Zg2PyMsgKdrtIlG3u.jpg",
               "id": 1338,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Chang",
               "gender": 2,
               "credit_id": "52fe44089251416c91002af5",
               "name": "Michael Hui",
               "profile_path": "/cKKqbkDBfvd4BXZF1jPZHXOouug.jpg",
               "id": 105940,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jim",
               "gender": 2,
               "credit_id": "52fe44089251416c91002af9",
               "name": "Rubén Blades",
               "profile_path": "/5J86KHFqEEFgMAdWfUqdpAD3sjV.jpg",
               "id": 2049,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "William",
               "gender": 2,
               "credit_id": "52fe44089251416c91002afd",
               "name": "Jared Harris",
               "profile_path": "/96vCepP4GoFZdylBqn4aPRQPPHK.jpg",
               "id": 15440,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "58ce10489251415a7401808c",
               "name": "Josie Ho",
               "profile_path": "/lbKcMciswqKaG6Sz6RylyoeGkoo.jpg",
               "id": 78429,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44089251416c91002b03",
               "name": "Wayne Wang",
               "profile_path": "/wtw5Cg8dWy9N7Fvn9SWvboibWek.jpg",
               "id": 39819,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44089251416c91002b09",
               "name": "Jean-Claude Carrière",
               "profile_path": "/nlJZcRlzQKo17GuZ2vSMRdag4iV.jpg",
               "id": 9747,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54dfb433925141195a003b25",
               "name": "Christopher Doyle",
               "profile_path": "/u7xRErdN6ya9qzOG8PVa2QshZFC.jpg",
               "id": 1357,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.568423,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 30265,
      "vote_count": 11,
      "budget": 0,
      "overview": "The story of Hong Kong, from New Year's Day to June 30th, 1997, when the British left their colony and turned it over to the People's Republic of China.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "Chinese Box",
      "runtime": 99,
      "poster_path": "/uhBgCcj0rnqUevY4pRtIEbixhPf.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/oA5OLrPPlfbaskzPAo7J4uLydzD.png",
            "name": "Canal Plus",
            "id": 104,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Trimark Pictures",
            "id": 4063,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-04",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wayne Wang"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Jean-Claude Carrière",
         "Jean-Claude Carrière"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118851/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1NzY1OTM5MF5BMl5BanBnXkFtZTYwMzM0MzY5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeremy Irons, Li Gong, Maggie Cheung | See full cast and crew »"],
      "reviews": [
         "For starters, it would be fair to say that I have seen this movie at least ten times. I was never bored... In fact, the magical atmosphere of the movie makes it beautiful to watch, and makes you enjoy every minute of it, even with the story aside. The cast is excellent, and the way that the actors 'ignore' the camera really makes you believe the story. The story has many layers, all of them viewed from an aspect of a dying man, packed with emotion, all masks down. The handover of Hong Kong and a love story, with all the cultural differences and barriers, is captured from a very close range. It's done almost like a documentary and strongly effects any spectator. The characters are complete, the story also, and everything else in the movie (from the photography and the music to the actual footage of HK and its people) only makes it more powerful. A beautiful movie.",
         "This is the first time I watched a movie and thought that it had all the perfect subtleties and symbolism of a book. The characters were both real and yet surreal enough that you can see that every character interaction was both meant to represent individual struggles and the struggles of whole cultures. Like literature... sometimes you must learn to read between the lines to appreciate what the author/creator of the book/movie is trying to say. No this isn't just the type of movie you just sit there and watch and expect to do all the work. If you want low-maintenance movies then look elsewhere. Just like not all books are for light reading which just have gratuitous violence and smut... not all movies are made for the sole purpose of entertaining the viewer with the same type of stuff. Look at the name of the movie! It starts there. So many things are going on at once but I did not find it difficult at all to feel the emotions that were intended. So much suppressed emotions... very much like the people of Hong Kong worried about suppression of their freedoms. Each shot of the movie included something symbolic. I think that no matter how many times I watch it I will see one more thing that was meant to be said. Social, political, and individual... I truly admired this movie and the captivating web it has weaved.",
         "I don't know why, but people on imdb and elsewhere have been very critical of this film. Personally, as someone living in Hong Kong, I think it is both a well made and important film. At the end, the analogy of Gong Li's character starting again, as Hong Kong is starting again, worked well. I think perhaps the only drawback is Maggie Cheung's character, as it seems a little pointless. However, I like nearly everything Jeremy Irons is in - he is really one of the world's best actors. His characters are always people that I can somehow empathise with - they're always very believable and he really carries the film's themes. The idea of setting the film in the six months leading up to Hong Kong's July 1, 1997 handover works well. As Irons' character dies, so does British sovereignty - the Union Jack goes down, the last Governor cries, Gong Li shakes off her long-time sugar daddy. It's a captivating and well-told story of which the Director should be proud, although I read an interview with him a while ago, and he didn't want to talk about the film, since it's upset some people in Hong Kong, I think. This film is certainly better than most rubbish that's made in Hong Kong. I urge you to find a copy and see it.",
         "This is, without a doubt, one of the most hauntingly beautiful works of cinematography ever made. The story is sublime - yet powerful. This is one of the only films I have ever viewed that left me in tears... the emotional impact was immense. The beautiful cinematographic experience this film imparted is something that I will never forget. The characters were incredibly real, and like all humans - imperfect. The final scenes that this movie builds up to are nothing less than genius - I would say that the director of this film has been able to pull off a near perfect piece of storytelling. Even if this movie is (as another reviewer states) historically and culturally inaccurate, the fact remains that the story it tells contains incredible truths about human nature. This is, in my opinion, one of the best statements on the human condition that has ever been encoded in film. In short, this movie was a bitter-sweet nostalgic vision of the handover of Hong Kong - containing one of the most \"humanly\" accurate stories ever put to film.",
         "I don't know if Wayne Wang is into photography or painting as a hobby, but just like his last two films, SMOKE and BLUE IN THE FACE, this movie reminded me of a mosaic or a photo album. I can see how some people had problems with it, since it's not a plot-driven film, but rather one of mood and atmosphere. I was moved by the images I saw, not just of the city and the changes it went through, but also of the actors. Irons is so often celebrated for the way that he uses his voice (justly, I might add) that you forget how well he's able to act with his face, and he does a terrific job here, communicating his sadness, his will to live even as disease ravages him, his agony over his unrequited love for Gong Li, and his curiosity and attraction to Maggie Cheung. I haven't seen much of Cheung that I remember, but I've seen a few of Li's films. Both of them are excellent, Li especially in a role that's a lot more complicated than it might first appear. You really do feel that deep down, if circumstances allowed, she'd love Irons back. Cheung's role is mostly a symbolic one, but she handles it well. Not an easy film to watch, but moving.",
         "I was unprepared for the wonderful experience this film affords. The metaphor is striking and acceptable. Wang catches the bittersweet essence of the changeover, both at the specific and the generic level. Li, Irons, and Cheung are superb. The movie is a cornucopia of visual delights. In fact, it probably requires repeat viewing to fully absorb the totality of its impact. Thank you, Mr.Wang, for a truly unusual piece of work. sasmd2@pol.net",
         "The world is changing around the characters in 'Chinese Box'. The screen time focuses on the six months between the New Year 1997 and the end of the British rule in Hong Kong. It's also the time that is left for John, the principal character of the film, a freelance journalist trying to store on film and in words the transition and dying of leukemia. It is the time when not only the world is changing in an unknown direction, but also when John may or may not find the fulfilling of his great love to Vivian, a beautiful Chinese bartender with a dubious past, herself in love with a third, Chinese man. The story is a combination between culture clash movies intertwined with love stories a la 'Shogun' with love stories in the shade of a crumbling world as in 'Casablanca'. It is to the credit of the director that despite a little too simplistic and explicit romantic intrigue he succeeds to bring to screen and combine a little of the charm of both genres in the right dosage. One may wonder where did Wayne Wang's career go lately and why he rather picked to do trashy films as 'Maid in Manhattan'. The strength of the film and what makes it survive well the decade since its realization resides however in the rendition of the city, of its infinite colors and smells, of the crowd and the noise, of its hopes, fears and dreams in the wake of the falling under Communist rule. Jeremy Irons is perfect as he will ever be, Li Gong is an enigmatic Chinese Hepburn, and Ruben Blades and Maggie Chang fill in two memorable supporting roles and another lateral story that fits well in the mosaic. 'Chinese Box' catches both a moment to remember in history and a beautiful love story to remember as well, on the background of a world in transition to an unknown destination.",
         "I have seen this film three times now and it just seems to get better. Gong Li and Jeremy Irons were fabulous along with Maggie Cheung who played a fascinating character. The street scenes I thought really enhanced the ambience of the film and plot. Congrats to all who were involved in this film.",
         "I don't know what's wrong with you people, or where stupid Hong Kong nationalism comes into this. I see movies that show lousy parts of Boston, and I don't go whining about it on web sites. The story is extremely moving, Hong Kong seemed fascinating, there was amazing imagery and chemistry between Irons and Li. I was blown away both times I saw it. I highly recommend Chinese Box.",
         "I enjoyed this drama and romance movie 'Chinese Box' immensely and was Intrigued by the characters. I can't really say what attracted me to this movie so much, but hope you enjoy. The movie was interesting in capturing a time period that was hugely felt mostly in a region we are unfamiliar with. (most people) OK, the women were very nice looking. This would be a must watch for any lover of film, the director really made you get in touch with reality. Chinese Box is a film that I loved to watch and hope you like it too"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+",
         "NDF International",
         "Pony Canyon"
      ],
      "summaries": [
         "John is an English photojournalist who has spent over a decade in Hong Kong; his friend Jim often crashes in his cramped apartment. John's unrequited love is Vivian whom he aches for but has not the nerve to possess. Concurrent with England's transfer of Hong Kong back to the Chinese, John discovers that he has a rare form of leukemia and has only months to live. So John, Jim, and the disfigured proto-hippy Jean grab a digital video camera and prowl the streets, seeking to document the \"real\" Hong Kong one last time.",
         "The story of Hong Kong, from New Year's Day to June 30th, 1997, when the British left their colony and turned it over to the People's Republic of China."
      ],
      "budget": 0
   },
   "movielensId": 1829,
   "movielens": {
      "languages": [
         "English",
         "普通话"
      ],
      "releaseDate": "1997-09-04",
      "dvdReleaseDate": "2003-09-09",
      "directors": ["Wayne Wang"],
      "runtime": 99,
      "movieId": 1829,
      "title": "Chinese Box",
      "mpaa": "",
      "actors": [
         "Jeremy Irons",
         "Gong Li",
         "Maggie Cheung",
         "Michael Hui",
         "Rubén Blades",
         "Jared Harris",
         "Josie Ho"
      ],
      "imdbMovieId": "0118851",
      "originalTitle": "Chinese Box",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of Hong Kong, from New Year's Day to June 30th, 1997, when the British left their colony and turned it over to the People's Republic of China.",
      "tmdbMovieId": 30265,
      "avgRating": 3.07534,
      "releaseYear": "1997",
      "numRatings": 292,
      "posterPath": "/byd7OWctbkTjlwJ6H6YqGxU5Otw.jpg"
   }
}