{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Julian Stone"],
      "runtime": 0,
      "synopsis": null,
      "writers": ["Julian Stone"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119139/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxODE3Mzc4Ml5BMl5BanBnXkFtZTcwMTAwMjkwOA@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Cudlitz, Ray Porter, Dion Luther | See full cast and crew »"],
      "reviews": [
         "I haven't seen this movie since 1997 and I just remembered it last evening. Now I'm frantically looking for some place to buy or rent it. It's a very obscure film, not many people know of it. When I saw it, I was pleasantly surprised! This movie has great dialogue, hilarious characters and is an all around GREAT movie! Give it a try! You won't be sorry!",
         "Very funny movie. It's so much like my life, except they distilled all the funny stuff down to two hours. I wish they'd find a way to put this in general release so my poker buddies could see it.",
         "I thought this a very funny and clever movie. The title is unfortunate with the word \"Bitch\" when it merely means the word \"Queen\" in a card game. Maybe that is why the movie did not get a nation wide distribution. I enjoyed especially the dynamics between the lead male character and the lead female character who taught the former a lesson in the card game. In gaining his respect for her, he clearly was beginning to admire her and a possible future romance was indicated. While there is some adult language, there is no nudity. It is just too bad that the movie was not more widely seen and the scriptwriter given more credit. I would like to have a copy so I could see it again. Anybody know how I could get one?",
         "I haven't seen this movie since it first came out,when i went to a screening of the movie with my English class in high school, and we got to meet the cast. But i remember it was one of the funniest movies I've ever seen, even though after i saw it i never heard of it again. I was very surprised to find it here on this website even. I don't even know if you can rent this movie, but if you can, DO IT!!! you will laugh more than you ever have before. I got a t shirt at the screening and i still have it. I'm never throwing it away, just in case this movie does get mass released someday and it's worth a lot of money but that's beside the point....Julian Stone is a genius, you must see this movie!!!",
         "A movie for guys, about guys, with a great twist. Funny, provocative and full of surprises. It'll make you think twice every time you order a pizza!",
         "Whatever happened to this movie? I saw it in San Diego with some of my UCSD friends and it was great! I told everybody I knew about it but nobody outside of California has ever heard of it. Although I guess there's the web site (heh ... followthebitch.com). Very funny.",
         "As a woman, it was great to see the inner workings of the male mind. The timer scene reminds me of all of the men I went to high school with. I couldn't stop laughing. I hope that Julian Stone writes more films of this genre."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Pennant Productions"],
      "summaries": ["A group of single guys meet for their weekly, all male, all-night poker game. One of the regulars invites a woman (Liz) to join and she turns out to be a very good player. Things get more complicated when two of the guys (Ty and Gordon) confide to a third (Andy) that they're having affairs with each other's girlfriends. The host (Bill) tries to keep his weekly ritual intact as it begins to crumble around him."],
      "budget": 120000
   },
   "movielensId": 1830,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-03-27",
      "dvdReleaseDate": null,
      "directors": ["Julian Stone"],
      "runtime": 0,
      "movieId": 1830,
      "title": "Follow the Bitch (1996)",
      "mpaa": null,
      "actors": [
         "Ray Porter",
         " Melissa Lechner",
         " Dion Luther",
         " Michael Cudlitz",
         " David Teitelbaum",
         " Thomas Napier"
      ],
      "imdbMovieId": "0119139",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 2.78571,
      "releaseYear": "1998",
      "numRatings": 14,
      "posterPath": null
   }
}