{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "japanese",
            "id": 907
         },
         {
            "name": "bank",
            "id": 974
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "on the run",
            "id": 10562
         }
      ],
      "imdb_id": "tt0119272",
      "video": false,
      "title": "Heaven's Burning",
      "recommendations": [],
      "backdrop_path": "/sryt9fFBNDBA6dQhZnMtoV3rlWV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Colin",
               "gender": 2,
               "credit_id": "52fe4801c3a368484e0e4e83",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Midori",
               "gender": 1,
               "credit_id": "52fe4801c3a368484e0e4e87",
               "name": "Youki Kudoh",
               "profile_path": "/dQHHbR7spJQXp2bi2YQQkMPk3H3.jpg",
               "id": 16145,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Yukio",
               "gender": 0,
               "credit_id": "52fe4801c3a368484e0e4e8b",
               "name": "Kenji Isomura",
               "profile_path": null,
               "id": 558906,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Cam",
               "gender": 2,
               "credit_id": "52fe4801c3a368484e0e4e8f",
               "name": "Ray Barrett",
               "profile_path": "/5fi1hkUfaKO1A9ukQqmO8rnWfKu.jpg",
               "id": 34657,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Mahood",
               "gender": 2,
               "credit_id": "54776b8b9251415e1c000963",
               "name": "Robert Mammone",
               "profile_path": "/aDtHgVRqkCw0H46db8oYtS2y3VE.jpg",
               "id": 83769,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4801c3a368484e0e4e79",
               "name": "Craig Lahiff",
               "profile_path": null,
               "id": 558905,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4801c3a368484e0e4e7f",
               "name": "Louis Nowra",
               "profile_path": null,
               "id": 55597,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.482775,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 70581,
      "vote_count": 5,
      "budget": 0,
      "overview": "In Sydney, the newly married Midori is honeymooning with her husband, Yukio. She does not love him and fakes her own kidnapping to escape the marriage. Her lover is supposed to meet her, but fails to appear. She goes to a bank to get some cash, only to become a hostage in an unfolding robbery, until the getaway driver, Colin, saves her from his fellow robbers. They hit the road together, with the cops, her husband and the robbers in pursuit.",
      "similar": [
         49530,
         24420,
         4588,
         979,
         1903,
         627,
         968,
         106646,
         1643,
         1259,
         276,
         226,
         9472,
         38,
         28178,
         13,
         50546,
         86331,
         72105,
         46705
      ],
      "original_title": "Heaven's Burning",
      "runtime": 96,
      "poster_path": "/i4pzKlDY9EYWOAd1YshlHYvt4GJ.jpg",
      "spoken_languages": [
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Duo Art Productions",
         "id": 21379,
         "origin_country": ""
      }],
      "release_date": "1997-09-04",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Vengeance takes no prisoners.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Craig Lahiff"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Louis Nowra"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0119272/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NzE4NzE1M15BMl5BanBnXkFtZTcwMzI3MzMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Russell Crowe, Yûki Kudô, Kenji Isomura | See full cast and crew »"],
      "reviews": [
         "I first saw this movie in a late night slot on a satellite movie channel. The movie has a more than interesting cast of quirky and disturbing characters that appear throughout is length, in some respects quite similar to a Coen brothers film. The two central characters meet in the most unusual of circumstances and have more than one reason to hide themselves from their respective pursuers. The film portrays a different side to Australia, especially with the mixture of cultures presented. There are enough action scenes within film to keep the pace up and is accompanied with a good soundtrack. I thoroughly enjoyed this movie and would recommend it.",
         "Ok, so this isn't your typical shoot them up movie or a romantic comedy or drama in any way. It's a combination of everything, and for me it is quite effective. The story is told very well. There are funny moments, touching moments, and enough action/violence to keep the viewer interested throughout. I didn't expect anything before I saw it so I was pleasantly surprised. Obviously it is no Gladiator, but as a Russell Crowe fan I gotta say once again he does not disappoint.",
         "Admittedly I'm a dedicated Crowe fan and have almost all his old movies but when I first got Heaven's Burning I found it a bit odd and would have said - well all great actors have to put in time on mediocre movies before they get to the top stuff. However after watching it again today for about the sixth or seventh time, I have to say that it really is very watchable. Even those awful sideburns. But thanks for not inflicting them on us again Russell. Yes its a road movie crossed with Bonnie & Clyde,Aussie version, but the tender little love story, the fast pace, the violent bits and the collection of grotesque characters met on the way make for an interesting ride.",
         "First of all, I'd like to say that this is a very unique, but also important film that is making a social commentary on the oppression that (specifically, but not exclusively,)many Japanese women suffer at the hands of their domineering and quite often abusive husbands. Because of their ancient cultural structure and social and familial pressures, these women are forced into marriages that are probably not always fulfilling, and this incredible Australian? director has tackled the telling of this poor woman's predicament, which alot of Asian women may be able to relate to, without being able to speak up about it for themselves. At the same time, this director, by bringing Russell Crowe, and a plot that revolves around a bank robbery gone awry, with plenty of action and gore, is probably going to attract viewers who otherwise wouldn't really care about the problems Japanese women face. He is therefore challenging those people to take a look at this human rights issue, and bringing it to light, which is good for everybody. The inter-racial romance is an added entertaining element, but if that's all that viewers see, then they're missing the point. Let's face it,inter-racial relationships between Japanese women and foreign men have been going on since the early days of exploration by Europeans. The director of this film, along with everybody involved must be commended for taking a gamble on a topic that obviously can be touchy, and at the same time misunderstood by the typical, shallow public. To top it off, he also manages to make an homage to the classical composer Richard Wagner, first with the guy in a wheelchair, played by the ex-Men at Work singer (forgot-his-name),who should get an Oscar for his Heroic performance, and then again with the music from Tristan and Isolde at the very end! A really Cool Flic!",
         "Well, I watched this again after seeing Russell Crowe in The Insider. THE reason to watch this movie, in my mind, is the last five minutes. If you've read the title, I don't think I'm giving anything away when I say that it's the sort of poetically cataclysmic ending you'd expect from the best of film noir...bringing to mind a vague connection with Kiss Me Deadly...and the only way to end any good road movie. That said, the rest of the movie is pure B...true to the noir roots...and whether or not the mistranslations and boom mike shadows were intentional is somewhat irrelevant. You may laugh, you may not, but at worst it's a quirky, passably interesting vehicle to the \"good\" part. As for Crowe, well, fans may enjoy, but no one's really given enough time or lines to shine in this movie. Or establish believable relationships for that matter. They're grim characters on a silent march to their doom, leaving a path of carnage and (I must insist quite relevant) dead bystanders in their wake.",
         "I love movies that take me totally by surprise. Turned on the TV, saw a Russel Crowe movie I'd never heard of was starting in a minute and decided I'd give it a whirl. For the next 100 minutes, I don't remember breathing. What could be described as a formulaic detective, on the lam movie was packed with the little things that make movies worth watching. It has a stellar leading cast who evolve in totally unpredictable ways over a very short period. Throw in your typical colorful Aussie characters, tribal Afghan crazies, and Japanese you'd never see act that way in Japan and let the bullets fly. Maybe I also really enjoyed it because in a cast of misfits and crazies, the one who turned out to be the craziest (who starts off the sanest) is driving around the countryside on my motorcycle, a beautiful black Triumph Thunderbird (although it could have been a bonnie, but I don't think so). But I really enjoyed the subtle things that separate good movies from bad. There are thematic (and landscape) shifts, accurate and slightly ugly social commentary, a little philosophizing, Afghan woman with hijaab as computer hacker, and tasty Aussie back-country scenes (the corner country bar, B&S dance), and some father/son dynamics to go with typical on the lam love developing. So see this movie, I bet you'll find things you like about it too.",
         "It takes a while to figure out where this movie's headed, but you'll probably be hooked by the time it gets there. Mix \"A Life Less Ordinary\" with \"Reservoir Dogs\" and throw in a dash of \"Mad Max\" and you'll come pretty close. It starts out looking like a drama, quickly turns into a crime thriller and frequently delivers elements of black comedy - with a nice little love story running through the middle of it all. The funny walk-ons (especially Colin Hay and his accordian) make the movie, and once you realise that you shouldn't take it seriously it's highly enjoyable. Wierd but worth watching.",
         "When I was reading other users' comments it occurred to me that the film is a \"cruel romance\". What Nick Cave did with his \"Murder Ballads\", but on the screen. I believe, the film has something in common with \"Night Cowboy\", \"Knocking on Heaven's Door\", but it has neither the raw prose of life of the former, nor the sentimental appeal of the latter. It's meant to be viewed with a touch of irony, a touch of \"stepping aside\". It's intentionally overdone here and there, but it doesn't spoil the story, it's the mark of the genre. Personally I welcomed this Australian variety of \"cruel romance\", it's a rest from sickeningly earnest Hollywood stuff.",
         "I picked this up at the local video store recently as I am always looking for something that might not have been first run but still might turn out to be interesting. I wasn't disappointed with this noirish little flick that featured a rather sweet love story between Russell Crowe (Colin) and Youki Koudoh (Midori)as the lovers on the lam from just about everyone - the cops, the Afghan gangsters and Youki's husband Kenji Isomorua (Yokio). The film is essentially a road movie as the two ill-fated lovers come together after Midori leaves her husband and Colin becomes a driver for the Afghan gangsters in a robbery that goes awry resulting in Midori been taken as a hostage. What follows is chase across the Australian Outback as the naive Midori falls for the quiet Colin and they try to elude their chasers to reach their paradise on the beach. There is some lapses of logic as the chasers find the ill-fated lovers as well as some jarring violence but this tidy little Australian film is a worthy addition to the noir genre. Worth seeing.",
         "This is a wild fun Austrailian movie that is well worth the ride The action dominates the movie with a collection of odd broken characters that you so often find in Australian movies. The story sometimes borrows themes from other 'road movies' which are fairly familiar, but the unique characters in the movie make this road movie unique in its own very strange way. Russell Crowe a la sideburns is still very cool, yet he does not dominate each scene as he has done in every movie he has made in the past 5 years. His somewhat understated presence allows his co-star Yidori (?) shine - a wonderful Japanese actress whose ingénue childlike looks contrast sharply with her bizarre change or metamorphosis from the gentle opening scenes. The classical musical romantic score is placed in a wild funny contrast to the plot,sometimes in a very campy way--yet it still works. This is not a great movie or a classic--but it has the zany features of movies like \"TRUE ROMANCE', (a cult classic) I would highly recommend this movie for what it it is -- a wild action packed funny bizarre ride with a good run of crazy people--- This movie may be a 10 if you view it the Austrailian way --with a keg of good beer--wish I 'd seen this movie on the big screen but I don't recall this movie in the theater years ago-Enjoy--there are even a few good lines that will make you want to go back to it someday so a DVD purchase would not be wasted...."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Duo Art Productions"],
      "summaries": [
         "\"Heaven's Burning\" tells the story of a man and a woman who are inexplicably thrown together, amid violence and chaos. They quickly find themselves on the run from many adversaries, but find time to fall in love along the way.",
         "After a botched bank job, a gang takes a hostage, Japanese girl on the run from arranged marriage, and escapes. Their wheelman saves the girl from them and the two go on the run with the cops, the gang and her psycho father on their tail."
      ],
      "budget": 0
   },
   "movielensId": 1832,
   "movielens": {
      "languages": [
         "日本語",
         "English"
      ],
      "releaseDate": "1997-09-04",
      "dvdReleaseDate": "2000-11-07",
      "directors": ["Craig Lahiff"],
      "runtime": 96,
      "movieId": 1832,
      "title": "Heaven's Burning",
      "mpaa": "R",
      "actors": [
         "Russell Crowe",
         "Youki Kudoh",
         "Kenji Isomura",
         "Ray Barrett",
         "Robert Mammone"
      ],
      "imdbMovieId": "0119272",
      "originalTitle": "Heaven's Burning",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["MRuA1X7Lf_4"],
      "plotSummary": "In Sydney, the newly married Midori is honeymooning with her husband, Yukio. She does not love him and fakes her own kidnapping to escape the marriage. Her lover is supposed to meet her, but fails to appear. She goes to a bank to get some cash, only to become a hostage in an unfolding robbery, until the getaway driver, Colin, saves her from his fellow robbers. They hit the road together, with the cops, her husband and the robbers in pursuit.",
      "tmdbMovieId": 70581,
      "avgRating": 2.67647,
      "releaseYear": "1997",
      "numRatings": 51,
      "posterPath": "/i4pzKlDY9EYWOAd1YshlHYvt4GJ.jpg"
   }
}