{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "road trip",
            "id": 7312
         },
         {
            "name": "wedding date",
            "id": 178923
         }
      ],
      "imdb_id": "tt0120773",
      "video": false,
      "title": "The Odd Couple II",
      "recommendations": [
         18080,
         19809,
         39997,
         29098,
         68665,
         26962,
         27047,
         84152,
         74101,
         36859,
         12759,
         61716,
         197481,
         20983,
         20468,
         19433,
         52263,
         26958,
         36992,
         75531
      ],
      "backdrop_path": "/5GaQFLZg516tso8tf3cwoBNXovm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Felix Ungar",
               "gender": 2,
               "credit_id": "52fe454cc3a368484e0523df",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Oscar Madison",
               "gender": 2,
               "credit_id": "52fe454cc3a368484e0523e3",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Detective",
               "gender": 2,
               "credit_id": "52fe454cc3a368484e0523e7",
               "name": "Richard Riehle",
               "profile_path": "/fFFjfOX7BUsfBQQP54K8QEkkEC2.jpg",
               "id": 18262,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Brucey Madison",
               "gender": 2,
               "credit_id": "52fe454cc3a368484e0523eb",
               "name": "Jonathan Silverman",
               "profile_path": "/khx8B9Ln5isYyag7gG48DogOHHx.jpg",
               "id": 55265,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Hannah Unger",
               "gender": 1,
               "credit_id": "54294ba50e0a265566004f38",
               "name": "Lisa Waltz",
               "profile_path": "/2LdFAcGDB9MTMixXSkaKofNbfOl.jpg",
               "id": 1224165,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe454cc3a368484e0523db",
               "name": "Howard Deutch",
               "profile_path": "/68Vae1HkU1NxQZ6KEmuxIpno7c9.jpg",
               "id": 26502,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe454cc3a368484e0523f5",
               "name": "Neil Simon",
               "profile_path": "/qZ5iSAEcV7hCVYIOrOD4CI2J5Wi.jpg",
               "id": 584535,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 4.322349,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27472,
      "vote_count": 35,
      "budget": 0,
      "overview": "30 years after the first film, Oscar and Felix embark on a road trip together, to attend the wedding of Oscar's son to Felix's daughter.",
      "similar": [
         773,
         13523,
         83770,
         340485,
         11282,
         41733,
         50456,
         100042,
         19908,
         291870,
         212778,
         138832,
         920,
         158,
         2898,
         296099,
         7453,
         8275,
         11637,
         9285
      ],
      "original_title": "The Odd Couple II",
      "runtime": 97,
      "poster_path": "/7Beh3AbbD6hYNUa2EXKilSFTLOl.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1998-04-09",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": "/kY2nJgcvBgjLuAJxygbXYv1el2h.jpg",
         "name": "The Odd Couple Collection",
         "id": 221966,
         "poster_path": "/iSRzUpJBro5vgskqVlCNOvXNxjh.jpg"
      },
      "tagline": "Some arguments stand the test of time",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Howard Deutch"],
      "runtime": 97,
      "synopsis": "30 years later... Oscar has settled in Sarasota, Florida, where he reports on a weak minor league baseball team and plays cards with other senior citizens. His son notifies him from California that he's getting married in a few days, to the daughter of Felix Ungar. Oscar and Felix happily reunite at the Los Angeles airport, 17 years after living together in New York City, but having not seen each other since then. They rent a car and drive off together, promptly teasing each other about their annoying differences: Felix was always fastidious and clean, Oscar was always unkempt and casual. Oscar soon gets irritated with Felix for needing to stop to pee, and later needing to stop for food, and to take pills. Felix laments that his third wife left him a few years earlier. Within a couple hours of driving, the two lose the directions to the wedding, realizing that Felix's suitcase was left back at the car rental agency. Making matters worse, the empty rental car rolls down a hillside and explodes. Felix and Oscar set off on foot along the desert highway, and no other cars come by for hours. They finally get picked up by a Mexican farmer, who asks them to drive his truck to a nearby gas station. They are soon stopped and arrested by a phalanx of police who find many illegal immigrants in the back of the truck. The local sheriff deduces that the two are not criminals and lets them go. Felix calls relatives at the wedding site and learns that they are five hours off course, so he and Oscar decide to spend the night in their current town. Felix and Oscar go off to a local bar, where Oscar charms a couple ladies somewhat younger than they are, named Thelma and Holly, and Felix goes along. The two couples dance, until the ladies suddenly need to leave. The next morning, they get a ride with an older man who is heading to the town where the wedding is being held. Alas, he soon dies after driving the car very slowly for a few miles. Police show up and take Felix and Oscar back to town, where the same sheriff from before again deduces they have committed no crimes and lets them go. Felix and Oscar get a bus out of town, and Felix says he feels happy and youthful. Along a stop, Thelma and Holly get on the bus, but soon after, the ladies' husbands hijack the bus and take all of them hostage on a wild car ride. Soon the police stop them and take them back to the same town where the same sheriff from before becomes so frustrated that he offers to transport Oscar and Felix to the wedding by a regional airline. While getting on the plane, Felix meets a friend of Oscar's named Felice, whom he is sure is his soulmate. Oscar convinces Felix to chat up Felice, and the three continue on to the wedding. When they arrive, they immediately learn that Oscar's son-- the groom-- has gotten cold feet and is hiding on the roof. Oscar tries to talk him out of getting married, in reverse psychology that convinces his son to go through with the wedding. After the service, Felix dances with Felice. Oscar gives his son extremely valuable baseball cards as a gift. That night, Felix tells Oscar that he plans to spend some time in San Francisco with Felice. Felix and Oscar depart at the airport with restrained emotion. Back in Sarasota, Felix shows up at Oscar's house to tell him that things did not work out with Felice. Oscar is hesitant, but agrees that Felix can stay with him for a while. As Felix begins cleaning the place, Oscar goes back to playing poker with his old friends.",
      "writers": ["Neil Simon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120773/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTExMjE1ODg3OF5BMl5BanBnXkFtZTcwNTU3NjAwMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Walter Matthau, Richard Riehle | See full cast and crew »"],
      "reviews": [
         "Okay, so the sequel was pretty absurd, but it was Jack Lemmon and Walter Matthau doing what they do best (it was also their final teaming). In this case, Felix Ungar (Lemmon) and Oscar Madison (Matthau) are driving to their son's and daughter's wedding in San something, California, experiencing various unpleasant situations along the way. Most of the movie's strength lies in its one-liners, most of which show just how much both men are seething. I think that my favorite scene is when they stop out in the middle of the desert, and...well, you have to see it. Somewhere up in that great retirement home in the sky, Oscar and Felix must still be getting on each other's nerves. They were truly great.",
         "This has got to be one the funniest film I've seen with the grumpy old men, unfortunately their last, but those two are and forever will be the funniest duo ever. There quotes and acts are hilarious and unforgettable and their acting is excellent, they make Laurel and Hardy look dull, but I love them too. Anyways, in this one they go into a crazy road trip to their children's wedding and the reunion is almost heart warming but funny and they haven't changed a bit, I like especially the part with the ride they had with another old guy. That was classic. Oh, those two, they might've been old but the jokes and humor in their films were fresh. Recommended to all fans of the two, thank Walter Matthau, thank you Jack Lemmon, I'll never forget you, you two are funniest duo on the movies.",
         "It is sad to think that we will not have any more gems from either of these two screen legends. Lemmon was a great actor, as can be seen in any one of his many films (particularly, \"Days of Wine and Roses,\" \"Glen Garry Glen Ross\"). He had a broad range, and could play comedy with the best of them (\"Mr. Roberts,\" \"How to Murder Your Wife,\" etc.) Matthau was a breed apart, having done many dramatic roles in is early career (\"The Kentuckian,\" \"Fail Safe\"), but it was light comedy where he truly shined. He was one of those true \"naturals.\" So, after the \"Grumpy Old Men\" successes, they are paired for \"The Odd Couple II.\" From the broad range of commentary here, there are those who celebrate this film, and those who think it is lame. I feel it has good performances in a so-so plot, but it think it was a bad choice. They were both great in the first \"Odd Couple,\" but who can deny that they abdicated the roles of Oscar and Felix to two consummate professionals, Jack Klugman and Tony Randall on TV? They polished those roles to perfection, and they had done all that could be done with them. It was pointless for Jack Lemmon and Walter Matthau to go there again. For me, \"Grumpy Old Men\" is how I would like to remember them. That film had a good story, and was supported by a great team of veterans, Burgess Meredith in particular. In that film, even the out-takes are great. \"The Odd Couple II\" reminds me in many ways of \"Tough Guys.\" Both films had legends, both as teams and as individual actors, so when Kirk Douglas and Burt Lancaster appear together for the last time, you want for them to have something really special. That is what we wanted for Jack Lemmon and Walther Matthau. These films are okay, but only because the actors are in them. They are not good enough movies to honor their memories.",
         "It is hard to believe it was only eight years ago that this, the last of the Lemmon and Matthau (or Matthau and Lemmon) films was made, and within four years both stars would be gone. One only wishes that their last film together had been more of a success. They had done first rate sequels before with GRUMPIER OLD MEN, but that film had been done within two years of GRUMPY OLD MEN, and a natural momentum carried the stars (and supporting casts) to the finish line. That is not the case with THE ODD COUPLE II. It came out thirty years after the original THE ODD COUPLE, and while they are reunited with the play's creator (Neil Simon) on the screenplay, the momentum - the push - is lacking. Not that this is a boring film. Far from it. We always wondered how Oscar Madison and Felix Unger would have behaved as elderly men. Of course, Felix looked like he and Gloria were going to settle their differences and return together in the first play/movie. Indeed, in the television series Tony Randall did get back to his wife. But here it is obvious it did not work at all. Both men have remained divorced, and both men remain essential the same: Felix the compulsively organized neatnik and Oscar the incorrigible slob. They also have given each other a wide birth if possible. But they find themselves drawn back into mutual orbit. Oscar's son is getting married - and to Felix's daughter. So the pair are headed for the wedding, and that means jointly showing up. What happens is a series of joint misadventures on the way to the wedding, especially involving two rather fun young women that they meet (Christine Baranski and Jean Smart) with their jealous boyfriends. This leads to several, increasingly odd, run-ins with the sheriff of a small town they can't seem to successfully leave. Indeed, in one case they get a lift out of town in a beautiful white classic Rolls Royce, which moves more slowly than a pair of people on bicycles. The situations are all quite amusing. But the unity of the film is not there - it is like a series of skits involving Felix and Oscar, that are vaguely united because the two characters are familiar to us, and they are supposed to get to the wedding. Still the two stars give it their all, and with Baranski, Smart, and the late Bernard Hughes it works well enough as an entertainment. But for me, the wackiness and variety of OUT TO SEA make that film a better final film for the pair.",
         "Jack Lemmon and Walter Matthau appear in their final film together here after years of acting together (Matthau died recently). Here, they team up once again as Felix and Oscar. This time, they are on a road trip to their son and daughter's wedding (it's Felix's daughter and Oscar's son) and during the trip their are plenty of funny scenes and one-liners, but it just doesn't hit as well as the original. Good effort anyway. Written again by Neil Simon.",
         "Despite poor reviews from critics, this follow-up to the \"Odd Couple\" delivers quite a few big laughs. Both stars are in top form, although it looks as if old age is begining to damper (just slightly) ol' Walter Matthau's style. I enjoyed many of the sight gags, especially one with Bernard Hughes as a man planning to live to \"120\" as he drives them cross-country. Howard Duetch, who also directed the hilarious \"Grumpier Old Men\", does a fine job switching between the dramatic and comedic moments. Not a great film, but an entertaining one with quite a few guffaws. It's biggest downfall: It reminded me more of the \"Grumpy Old Men\" films than the original \"Odd Couple\".",
         "Any movies with old dudes fighting like my old man is funny. I'm serious. This movie might not be the biggest thing ever but it certainly made me laugh. Its a classic in my list. There's no deep message but its a damn good movie. Watch it with your old folks. They'll like it. Many dudes i know says it's just a movie about old men complaining. They're right, but they're funny old man with funny complaints. It's a good kind of movies that the \"seniors\" would like. It's a shame the two old guys won't be making anymore movies. It was the only movie my old man would watch as a comedy. This movie is my girlfriend's favorite among those two old guys. Anywho...It's a good movie and you should watch it (kudos to you dad)",
         "In my view, there are two ways to judge this film. The first is by looking it as a \"stand-alone\" movie. In that way it doesn't stand up that well. The plot is okay -- a buddy road trip on the way to a wedding...only for a change it's senior citizens. The situations are HUMOROUS, but not laugh-out-loud funny. The principal actors (Jack Lemmon and Walter Matthau) do their jobs, while the supporting actors and actresses also do theirs. It's an amusing movie. And, if you don't know much about Lemmon and Matthau, that's all it will be to you. The other way to judge this film is by looking at it as the closing act of a REAL buddy team of two actors who have shared a big part of their lives together, both professionally and personally. Then it doesn't matter if the film is as outwardly funny as it is charmingly humorous. You sit there thinking of their first film together -- the first \"The Odd Couple\" -- and you reminisce. Their first outing with \"The Fortune Cookie\", their most memorable romp in \"The Odd Couple\", the hilarity of \"The Front Page\", their renaissance in \"Grumpy Old Men\" and \"Grumpier Old Men\", and even their not so great \"Out to Sea\" and \"Buddy Buddy\". You admire them for what they meant individually and collectively to American cinema. And as you watch the scene of them parting at the airport, just maybe you think of Spencer Tracy and Katherine Hepburn in that scene in \"Guess Who's Coming Together\" where they both know the end is almost upon them...not in film, but in real life. And you see the wistfulness of the parting scene between Lemmon and Matthau, probably realizing that this is the last film together. So, how to judge this film? Factually or sentimentally? For me, more the latter, because it's a hearty farewell and thank you both for the laughs you have given me.",
         "Unfortunately, I've never seen any version of the play except for the original movie, so I have little idea about the original play and the shows. But to me this movie is exactly like every other movie Matheau and Lemmon did since 1990, and it lacks the simplicity of the 1968 original which made them popular as a comedy/film duo. While the original was mainly performance and character driven, which is what made it so innovative, this one has little to do with the actual characters of Felix and Oscar and their bad chemistry together. It is more plot driven, which is what kills it. In fact, it could have been any two people with the exact same plot and nothing would change, whereas in the original the character's behaviour would have effected the plot a bit. Not only that, but there's no more satire and comments on marriage and divorce except the little bit at the end, which I felt was out of character for the play. You would think there would also be a comment on growing old and dying together, but there isn't because the plot gets in the way. Some may say that movies now have to be more plot driven and not as simplistic as they were 50 years ago, but I'd have to say they're wrong. A plot can still ruin a movie while one which is simply performance based can still make it today. Anyhow, the original is still much more popular.",
         "It was good, I don't know why the critics didn't like it, well I did, and thats' that."
      ],
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Cort/Madden Productions"
      ],
      "summaries": [
         "It has been seventeen years now since Oscar and Felix saw each other for the last time. Oscar is living in Florida, Felix in New York. One day, Oscar is called by his son Brucey who invites him to his wedding to Felix' daughter Hannah next Sunday in California. Oscar and Felix meet again at Los Angeles International Airport and take a rental car in order to go to San Malina for the wedding. The trip develops into an odyssey, starting with Oscar forgetting Felix' suitcase at the Budget station, going over to the complete loss of the directions (and the car), several difficulties with the police, a dead person, a toupee, underwear and revenge-hungry Cowboys and ending up with Felix meeting the \"one and only\" woman. But the wedding has to be reached on time.",
         "Oscar and Felix take a road trip to their son and daughter's wedding."
      ],
      "budget": 0
   },
   "movielensId": 1837,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1998-04-09",
      "dvdReleaseDate": "1998-10-21",
      "directors": ["Howard Deutch"],
      "runtime": 97,
      "movieId": 1837,
      "title": "The Odd Couple II",
      "mpaa": "PG-13",
      "actors": [
         "Jack Lemmon",
         "Walter Matthau",
         "Richard Riehle",
         "Jonathan Silverman",
         "Lisa Waltz"
      ],
      "imdbMovieId": "0120773",
      "originalTitle": "The Odd Couple II",
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": ["BSsjfuxlTu0"],
      "plotSummary": "30 years after the first film, Oscar and Felix embark on a road trip together, to attend the wedding of Oscar's son to Felix's daughter.",
      "tmdbMovieId": 27472,
      "avgRating": 2.68519,
      "releaseYear": "1998",
      "numRatings": 594,
      "posterPath": "/7Beh3AbbD6hYNUa2EXKilSFTLOl.jpg"
   }
}