{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "dracula",
            "id": 3633
         }
      ],
      "imdb_id": "tt0110620",
      "video": false,
      "title": "Nadja",
      "recommendations": [
         40562,
         125034,
         350362,
         104043,
         257249,
         82269,
         159153,
         33766,
         35642,
         308423,
         68201,
         84278,
         25985,
         70011,
         86233,
         58467,
         57022
      ],
      "backdrop_path": "/bQBTw0rkkCROFzLKlkGz8CaeG4W.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nadja",
               "gender": 1,
               "credit_id": "52fe456c9251416c91031d11",
               "name": "Elina Löwensohn",
               "profile_path": "/24ugmbBd3zFeg6bwp7gC4fIYNQR.jpg",
               "id": 17257,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dracula / Dr. Van Helsing",
               "gender": 2,
               "credit_id": "52fe456c9251416c91031d15",
               "name": "Peter Fonda",
               "profile_path": "/dgorN06SQ9ZNL2NY3I7BNxg93lc.jpg",
               "id": 8949,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Morgue Receptionist",
               "gender": 2,
               "credit_id": "52fe456c9251416c91031d19",
               "name": "David Lynch",
               "profile_path": "/3xMyM3kvPqrIgcFQsHT7hVmIwwf.jpg",
               "id": 5602,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Edgar",
               "gender": 2,
               "credit_id": "545f9d62c3a3680b58000ad8",
               "name": "Jared Harris",
               "profile_path": "/96vCepP4GoFZdylBqn4aPRQPPHK.jpg",
               "id": 15440,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Jim",
               "gender": 2,
               "credit_id": "55f7373fc3a3680a0d00bd82",
               "name": "Martin Donovan",
               "profile_path": "/bNS43B8maD5A4UYSWy4UjgHru1a.jpg",
               "id": 42993,
               "order": 5
            },
            {
               "cast_id": 24,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "5a27f9579251410336101b67",
               "name": "Galaxy Craze",
               "profile_path": "/pyOjHFCpelmGrHFRSrKzDDsUv7E.jpg",
               "id": 1936113,
               "order": 6
            },
            {
               "cast_id": 25,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "5a27f988c3a3680b9a10d09f",
               "name": "José Zúñiga",
               "profile_path": "/uD8aacPO6Zqsr4f3yAkqgT6G4wS.jpg",
               "id": 10963,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe456c9251416c91031d1f",
               "name": "David Lynch",
               "profile_path": "/3xMyM3kvPqrIgcFQsHT7hVmIwwf.jpg",
               "id": 5602,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe456c9251416c91031d25",
               "name": "Amy Hobby",
               "profile_path": null,
               "id": 66593,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe456c9251416c91031d2b",
               "name": "Mary Sweeney",
               "profile_path": null,
               "id": 5604,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe456c9251416c91031d37",
               "name": "David Leonard",
               "profile_path": null,
               "id": 112576,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe456c9251416c91031d3d",
               "name": "Kurt Ossenfort",
               "profile_path": null,
               "id": 112577,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe456c9251416c91031d43",
               "name": "Simon Fisher-Turner",
               "profile_path": null,
               "id": 32804,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe456c9251416c91031d49",
               "name": "Prudence Moriarty",
               "profile_path": null,
               "id": 112578,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe456c9251416c91031d4f",
               "name": "Andrew Fierberg",
               "profile_path": null,
               "id": 66594,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe456c9251416c91031d55",
               "name": "Michael Almereyda",
               "profile_path": "/oiMAcT7GwLXBKTYWLl9FDBqrwHX.jpg",
               "id": 54469,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "545f9d30c3a3685362008d8b",
               "name": "Michael Almereyda",
               "profile_path": "/oiMAcT7GwLXBKTYWLl9FDBqrwHX.jpg",
               "id": 54469,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5515300692514153b2000c8e",
               "name": "Jim Denault",
               "profile_path": null,
               "id": 2864,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "561ba48ac3a3682256000caa",
               "name": "Kerry Barden",
               "profile_path": "/zb3khdNgVHerkFz4esvjSZHnbDW.jpg",
               "id": 5328,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561ba49c9251415a6e000cdc",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561ba4b29251415a62000c83",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "561ba4fb9251415a72000ce3",
               "name": "Dina Waxman",
               "profile_path": null,
               "id": 1521769,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.71772,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34574,
      "vote_count": 18,
      "budget": 0,
      "overview": "This ultra-hip, post-modern vampire tale is set in contemporary New York City. Members of a dysfunctional family of vampires are trying to come to terms with each other, in the wake of their father's death. Meanwhile, they are being hunted by Dr. Van Helsing and his hapless nephew. As in all good vampire movies, forces of love are pitted against forces of destruction.",
      "similar": [
         7131,
         6404,
         138,
         22440,
         36647,
         36648,
         6114,
         49017,
         10577,
         17102,
         277,
         8698,
         12437,
         622,
         628,
         755,
         252171,
         653,
         29778,
         24021
      ],
      "original_title": "Nadja",
      "runtime": 93,
      "poster_path": "/bRz2J0jlMgczJptX0Atzo9l70Bd.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Kino Link Company",
         "id": 37897,
         "origin_country": ""
      }],
      "release_date": "1994-09-13",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Unseen. Unforgiving. Undead.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Michael Almereyda"],
      "runtime": 93,
      "synopsis": "Count Voivoide Arminius Chousescu Dracula dies with a stake in his heart,and his daughter Nadja [Elina Löwensohn] shows up to claim the body, hoping that his death will free her from the life her father has forced on her. She has the body cremated and prepares to take the ashes to Brooklyn and pay a visit to her twin brother Edgar [Jared Harris] whom she hasn't seen for a long time. Before she leaves, however, she stops for a drink and meets Lucy [Galaxy Craze]. Lucy is also feeling a sense of emptiness, so she takes Nadja home. They appear to cheer each other up, and they wind up having sex together. So, who killed Dracula? Van Helsing [Peter Fonda], of course. And Helsing's nephew Jim [Martin Donovan], who also happens to be Lucy's husband, has to bail him out of jail. Helsing knows that, if Dracula's body is not destroyed properly, he'll be back. When Helsing learns that Dracula's body has been removed from the morgue, he enlists Jim's help. Meanwhile, Nadja goes to visit Edgar and meets his nurse and live-in lover Cassandra [Suzy Amis]. Edgar is sick. Nadja pursuades Cassandra to move Edgar to her apartment where she can help him by transfusing him with plasma from the blood of shark embryoes, which is what Nadja uses to stay healthy. Edgar revives enough to drink some of Nadja's blood. However, Lucy has fallen under Nadja's mesmerism. She leads both Jim and Van Helsing to Edgar's house where Nadja is staying with her renfield. Edgar awakens long enough to warn Cassandra to leave the house, as she is in danger. Cassandra, who just happens to be Van Helsing's daughter, attempts to escape, with Nadja pursuing her, Lucy pursuing Nadja, and Jim pursuing Lucy. Cassandra runs into a gas station where it looks like two burly mechanics are going to protect her, but Nadja mesmerizes them and kills one of them. The other one shoots Nadja in the abdomen. Edgar is improving. He unites with the Helsings to stop Nadja. He receives a \"psychic fax\" from Nadja, telling him that she is injured and must return to Transylvania. She also mentions that she's taking Cassandra with her, so Edgar and the Helsings high-tail it to Transylvania, too. As they approach the castle, Nadja begins a transfusion of Cassandra's blood while Cassandra sleeps. While Jim fights with Nadja's renfield, Edgar and Helsing drive a stake through Nadja's heart. Lucy is released, Nadja is destroyed, and Cassandra wakes up. However, not all is as it seems. Nadja narrates the epilogue: \"They cut off my head...burned my body...no one knew...no one suspected that I was now alive in [Cassandra's] body. [Edgar and I] were married at City Hall...there *is* a better way to live.\" [Original Synopsis by bj_kuehl.]",
      "writers": ["Michael Almereyda"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110620/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NTE5MDI4MV5BMl5BanBnXkFtZTcwODM4MDMzMQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Elina Löwensohn, Peter Fonda, Nic Ratner | See full cast and crew »"],
      "reviews": [
         "I've just read all of the reviews on this film on this site and nobody even mentions what this film is really about. Like any \"good\" horror story it works on different levels. Like the Zombie films of George Romero there's an underlying message to this film that has nothing to do with it's horror exterior. But you have to think about what Michael Almereyda is trying to say with this story. This isn't just true of this film, but of all good horror. Dr. Jeckyle and Mr.Hyde-Addiction to substances, Frankenstein-Man playing at being God, Dracula-Hate poisoning the mind and soul. The main theme of this film is wanting to change your life but not being able to escape your old habits and break loose. It's even mentioned outright several times during the film by different characters. There's a lot of philosophical discussions by different characters on this through the film. This film has black humor, meaning of life philosophy, camera work that serves a purpose to enhance the story and heart felt dramatic performances by all of the actors and actresses. One of the things that I really like about this film, (and one of the things that many people didn't understand or like) was the use of the toy camera pixel-vision effect. I found it to be a perfect way of economically expressing the intoxicating effect of being under the influence of a vampire. If you watch the film and think about the scenes where it's employed it will be obvious. It isn't just a random attempt to be arty as many of the reviewers seem to think. It's a visual depiction of the impaired state of mind that you might experience if a vampire was psychically manipulating a mortal. And it enhances the film it doesn't detract from it. Whether you like it or not, film-making is an art. Just like painting, drawing, writing or any other form of expression. Some filmmakers just don't have any sense of art, they only wish to mindlessly entertain. That's why people say things like TV rots your mind. Well, I guess that if you watch anything in a mindless manor that could be true. But film that has something to say, something to think about is a worthwhile use of time and intellect. I have a fairly large collection of \"horror\" films and \"Art House\" and I can tell you that Nadja is one of my all time favorites. Every time I watch it I see something new, get a different little joke or notice different connections that I didn't get before. I also enjoy many of the \"Mindless entertainment\" variety of Vampire films,and so a quote from the writer David Goyer who wrote the screenplays for Blade, \"Sometimes you just want to see somebody kick some ass!\". Most people don't realize how huge the genre of Vampire Cinema really is. Dracula is the definitely the most filmed character in film history, and the greater tree of Vampire films in world cinema is so big that it almost impossible to accurately list. Of the Art House and Vintage, comedy and Vampire Hunter categories I would recommend checking out some of my favorites. Many Vampire films are a hybrid of two or more of these categories,but they all have different points that I find attractive,humorous, exciting, entertaining and thought provoking. Again, I haven't seen but a small selection of the huge list of Vampire cinema, so it's likely that I'll be leaving out many excellent selections and maybe some of your favorites in this list. I'm giving this list because the film Nadja could very well be enjoyed if you like some of the films that I like and have been entertained by. Art House and Vintage: Nosferatu 1922 (The original granddaddy Vampire film from the silent era. The Kino Version is worth paying for with an excellent soundtrack option featuring musicians from Art Zoid), Nosferatu the Vampyre (Werner Herzog), Shadow of the Vampire (a fun comedy-fictional story based around the making of F.W. Murnau's Nosferatu-1922), Vampyr (Carl Theodor Dreyer's atmospheric masterpiece, even though part's of the film were created by accident!),Dracula (1931), The Hammer Dracula series (feartuing the great Christopher Lee), Dracula-Pages from a Virgin's diary (a modern silent film of a Canadian Ballet company filmed by Guy Madden), Blood for Dracula (also known as Andy Worhol's Dracula), Immortality, Ganja and Hess, Habit, Near Dark, Salem's Lot (Based on the novel by Stephan King-the original mini-series, I haven't seen the newer remake) Bram Stoker's Dracula (The love it or hate it classic by F. Coppola). Some of my favorites from the Vampire Hunter sub-genre: The Blade Series (Again one of those \"Love it or hate it\" series for some.), John Carpenter's Vampires (This one is hard to classify, lots of comedy too.), The Captain Kronos-Vampire Hunter films by Hammer studios, The Forsaken, and the British TV series \"Ultraviolet\" (an X-Files type mini-series). Also worth mention is the Japanese-Anime films Vampire Hunter D-Bloodlust (You'll forget that you're watching a cartoon, the story's that good!), and Blood-The last Vampire (A short but well done film). Some of the comedy genre: Innocent Blood, Modern Vampires, The Breed, Dusk to Dawn (I've only seen the first one, a hybrid of Tarantino's crime style and Robert Rodriguez's horror style), Vampire's Kiss, and Interview with the Vampire (I find this Ann Rice film quite comedic), and Lost Boys (A local favorite being that I live in Santa Cruz). Nadja is one of the jewels of my collection because it is truly a multi-faceted piece of film-making that defies categorization.",
         "This film received its fair share of support from critics and fans alike. However, despite good reviews and a loyal following it is still a vastly underrated film. Michael Almereyda has crafted a film which will have to endure time to receive the appreciation it deserves. A Dracula-esque modern day myth with subtle humor and shades of Poe this film is truly a work of genius. The story is remarkably tight and the characters around which it revolves are rendered in incredible depth. Wry humor lends to the tale with brilliance. At one point a title card reads: \"Transylvania\" and to illustrate the location a small boy hops around with a Mickey-Mouse hat on his head. Not quite the wolf-ridden moors you expected, but still... Elina Löwensohn shines as the title character, it is not every actor who can so elegantly work with dialogue such as this. She delivers with a candor that is almost absent from films of the last few years, the major ones at least. Galaxy Craze shines brightly opposite Martin Donovan. Peter Fonda is perfect as the Van Helsing character. Suzy Amis, Jared Harris, and Karl Geary do not fail to impress. Look for Jim Denault's lush 35mm cinematography. He deals out light sparingly to accomplish with sheen and brilliance what most cinematographers dream of. An image so seeped in mood that any one still-frame contains such power as to function independently from the whole. \"Nadja\" transcends the limitations of its medium to become something that is truly rare in the modern cinema landscape... A work of art.",
         "Nadja is a very refreshing version of the redundant vampire movies out there. It had beautiful and intriguing cinematography that at times seemed like a livening photograph. Although the average viewer that is used to watching \"spoon-fed\" movies that do not require any viewer intellect or imagination may find this movie to abstract for their taste, It will Certainly be their loss for this movie is a must see if you are any kind of a movie aficionado. I am very happy to have added this movie to my movie history repertoire. Enjoy.",
         "A strange, disarming feeling sits over this film, as if everyone is in a semi-comatic haze. That's a good thing. While a bizarre mix of humor, horror flick, and psychodrama, it also draws from (and pokes fun at) the vampire flick tradition. Full of highlights, not the least of which is a ratty haired Peter Fonda.",
         "It's a gorgeous film. Elina Lowensohn is amazing, Peter Fonda has to be seen to be believed--all the performances are excellent--and the dialogue is somehow equal parts profound and hilarious. It's profound in an almost but not quite tongue-in-cheek way that makes it cool rather than cheesy. And it's hilarious in a highly intelligent way rather than a wacky way. Every scene is a treat. The pixellated scenes are done with a toy Fisher Price camera and they look great. The music is powerful, moody, perfect. Smart, interesting, compelling, beautiful, cool--what more do you want? Genius! I saw this in the theater and completely loved it from the first three seconds into it, and it never let me down after that. I'll admit I'm on the obsessive end of the spectrum with this film--I went back and saw it seven more times that week. I've been waiting for the DVD for three years and my prayers have recently been answered.",
         "A striking departure from the Wes Craven/Tarantino vampire treatment of vampirism of late, Almereyda's artful black and white piece gives us intimate psychological portraits of the count's wayward son and daughter, and their sexual exploits - specifically as they involve a married couple whose terminal ennui is exploded by the entrance of Nadja - dracula's twin daughter, who falls in love with Galaxy Craze's (am I the only one who finds this name a little disturbing, and slightly reminiscent of porn-names)character and abducts her to Transylvania. Peter Fonda does a brilliantly and comically paranoid Van Helsing and Dracula himself. David Lynch, whose wife Mary Sweeney produced the film, has a cameo and much of the film's heady cutting and profusion of cigarette-smoke seems to echo Lynch's work - definitely qualifies for an amazon.com-style \"Customers who bought \"Blue Velvet\" also bought \"Nadja\". Criticisms would include a slight over-reliance on fairly blatant visual puns (Martin Donovan's character is asked \"can you picture that\" and responds \"yes, I can picture that\" to visual accompaniment, and this device is repeated), and perhaps gratuitous use of smoke machine technology, but on the whole a fresh, artful evocation of one of the more encrusted thematic territories in film.",
         "Nadja is not your ordinary vampire film. Though it builds upon the foundation of the classic Bram Stoker Dracula story, it is more about post-modernism, the state of modern spirituality, and the alienation and emptiness of modern life. Avant-garde cinematography combined with music by Portishead and others frame near surreal dialogues that more philosophical than horrifying. At the same time, the confused and frenetic pace of the movie is almost comical at times. Altogether a great film if you are a fan of film as art. If you prefer gore and sex over mood and introspection than you'll probably be disappointed.",
         "\"Nadja\" falls into a category of films I would describe as 'vampire movies for adults.' Viewers seeking an action-packed gorefest along the lines of \"From Dusk Till Dawn\" (1996) or \"Blade II\" (2002) should bypass \"Nadja\". Moody, opiated, and dreamily ethereal, it is similar in this respect to Guy Maddin's more recent \"Dracula: Pages from a Virgin's Diary\" (2002) and not most other modern vampire flicks. Its emphasis on the emotional and evocative rather than physical aspects of the genre puts it in the company of Tony Scott's \"The Hunger\" (1983) and Po-Chih Leong's \"Immortality\" (aka \"The Wisdom of Crocodiles\") (1998). Shot on black-and-white film, a dying art form, with a good musical score by Portishead, it avoids sinking into pretentiousness with occasional, self-parodying irony (example: \"He says he's dying ... for a cigarette.\"). A major drawback to the film is director Michael Almereyda's overuse of the Pixelvision camera, a technology he has used in the past and should have left there. The acting is spotty, but that's of little importance in a film emphasizing atmosphere over character portrayal. Elina Lowensohn in the title role and Peter Fonda as Dr. Van Helsing (played as he has never been played before) do stand out from the rest of the cast. I'd rate this as 'must see' for aficionados of vampire films, if only to take a break from the less imaginative schlock that overwhelms the genre. Rating: 7/10.",
         "Dracula's daughter Nadja wanders New York City,melancholy and driven by her need for blood.She seduces and drinks from the depressed Lucy.Meanwhile Lucy's husband Jim is asked to help his friend Van Helsing who has been arrested for staking Dracula.But then the two of them realize that Nadja is drinking from Lucy.As they try to hunt her down,Nadja and her self-described 'slave' Renfield flee back to Rumania.\"Nadja\" is a post-modern vampire flick which is actually a black-and-white reworking \"Dracula's Daughter\"(1936).The film was produced by David Lynch who also played a small cameo as a morgue attendant that gets hypnotized by Nadja.The film is splendidly photographed in a glorious black-and-white and offers tons of mesmerizingly dreamy atmosphere.Overall,\"Nadja\" is much better than overrated and too philosophical \"The Addiction\".The soundtrack by Portishead and The Verve is fabulous too!",
         "Low-key, off-beat, somber, existential, avant-garde modern retelling(partially)of Dracula's Daughter has the exotic beauty of Elina Löwensohn put to good use as the Romanian Count's predatory vampire daughter, Nadja, roaming New York City for fresh victims, finding a potential love interest in melancholy Lucy(Galaxy Craze)whose unhappily married to her gloomy alcoholic husband Jim(Martin Donovan). Jim and Lucy love each other but never display an appropriate affection or fireworks which truly exhibit on the outside, if anything their relationship seems destitute and glum. But, once Nadja initiates a spark with Lucy after meeting her in a bar, their love and marriage will be tested as the vampire wishes to conquer her, capture her very soul through the draining of her very life-source, the blood. Thankfully for Jim, he knows Dr. Van Helsing(Peter Fonda, in a very kooky performance, clearly enjoying his role's chance for eccentricity), the very one who thrust the stake in Count Dracula's heart. Van Helsing's desire to end Nadja's existence, ridding the world of a bloodsucker who has been draining New York of it's citizens through her various rendezvouses with male victims, opening the possibility of sexual activity, shutting the door on such opportunities by killing them. Nadja travels with her human slave Renfield(Karl Geary;very different than the countless nutty incarnations of the character whose often molded after Dwight Frye, young and attractive, quite laconic and mysterious, yet can be quite dangerous when provoked)as they pursue and hunt. NYC provides quite a backdrop for Nadja, a vast supply if she so wishes to feed. Löwensohn's face is glamorously shot by director Michael Almereyda's cinematographer Jim Denault, and the dialogue, often spoke by the actress as a vampire who is having quite an experience in a city of such diverse and eclectic people, is quite thought-provoking and poetic. The film's narrative shifts somewhat once Nadja finds her ill brother Edgar(Jared Harris)and his beloved nurse Cassandra(Suzy Amis). Nadja wishes for Edgar to join her and takes an interest in Cassandra. Van Helsing needs to kill Nadja so that Lucy can be spared and to remove possible danger from Cassandra, his niece. The aspect of director Michael Almereyda's style that rather left me cold was his use of a camera which pixilates image, specifically during Nadja's vampiric activities. I thought the gorgeous B&W photography was fine on it's own and gave this film an alluring look to match it's titular female vampire. All the performances, the characters, remain subtle, almost zombie-like and distant..this might drive traditional and casual horror fans away and seems to reflect a society of lost souls, emotionally empty and depressed. The music score is quietly haunting and seems to fit the mood of the characters and their stories. This is definitely an art film, with the director giving the vampire genre a different flavour and tapping into contemporary themes that traditional horror fans might find ponderous and pretentious. I liked this a lot probably because of Löwensohn and it's refreshing change of pace from the normal brand of storytelling in regards to the vampire genre, which is oftentimes artificial, predictable and by-the-numbers. While this film does operate using themes associated with vampires(..needing blood to sustain life, not adept to sunlight, with a stake to the heart killing them), I like how Nadja is given a chance to show that she has feelings and often expresses herself with others regarding life and love. I appreciated the additional scene featuring Lugosi(..from White Zombie), lending his face to the Dracula spoken of by her siblings in the film. Fonda, with long hair, plays Van Helsing as if he were an oddball(..the way he should be portrayed, I think, because of his knowledge in \"strange things most humans wish not to know about\"), an outcast of society who lives, it seems, to serve mankind in ridding the world of dangerous vampires. Martin Donovan and Galaxy Craze play their roles rather sullen and without emotion, which is probably what the film calls for considering their supposed to be aloof."
      ],
      "genres": [
         "Drama",
         "Horror"
      ],
      "productionCompanies": ["Kino Link Company"],
      "summaries": ["This ultra-hip, post-modern vampire tale is set in contemporary New York City. Members of a dysfunctional family of vampires are trying to come to terms with each other, in the wake of their father's death. Meanwhile, they are being hunted by Dr. Van Helsing and his hapless nephew. As in all good vampire movies, forces of love are pitted against forces of destruction."],
      "budget": 1000000
   },
   "movielensId": 184,
   "movielens": {
      "languages": [
         "Deutsch",
         "English"
      ],
      "releaseDate": "1994-09-13",
      "dvdReleaseDate": "2002-04-30",
      "directors": ["Michael Almereyda"],
      "runtime": 93,
      "movieId": 184,
      "title": "Nadja",
      "mpaa": "",
      "actors": [
         "Elina Löwensohn",
         "Peter Fonda",
         "David Lynch",
         "Jared Harris",
         "Martin Donovan",
         "Galaxy Craze",
         "José Zúñiga"
      ],
      "imdbMovieId": "0110620",
      "originalTitle": "Nadja",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["3L5f9EXKE5I"],
      "plotSummary": "This ultra-hip, post-modern vampire tale is set in contemporary New York City. Members of a dysfunctional family of vampires are trying to come to terms with each other, in the wake of their father's death. Meanwhile, they are being hunted by Dr. Van Helsing and his hapless nephew. As in all good vampire movies, forces of love are pitted against forces of destruction.",
      "tmdbMovieId": 34574,
      "avgRating": 3.11527,
      "releaseYear": "1994",
      "numRatings": 347,
      "posterPath": "/bRz2J0jlMgczJptX0Atzo9l70Bd.jpg"
   }
}