{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "to shoot dead",
            "id": 4277
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "lawyer",
            "id": 10909
         }
      ],
      "imdb_id": "tt0119196",
      "video": false,
      "title": "The Gingerbread Man",
      "recommendations": [
         40739,
         110598,
         3119,
         65796,
         55261,
         66488,
         21955,
         25944,
         34462,
         32615,
         28455,
         63472,
         82686,
         206537,
         115039,
         58733,
         33988,
         74241,
         115332,
         65016
      ],
      "backdrop_path": "/p35jkcWeOraNq7ZnWvrYIhjxK1J.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rick Magruder",
               "gender": 2,
               "credit_id": "52fe44eb9251416c750457ed",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mallory Doss",
               "gender": 1,
               "credit_id": "52fe44eb9251416c750457f1",
               "name": "Embeth Davidtz",
               "profile_path": "/gmc4nZtGc6bge9DnriR57VYq0dA.jpg",
               "id": 6368,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Clyde Pell",
               "gender": 2,
               "credit_id": "52fe44eb9251416c750457f5",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lois Harlan",
               "gender": 1,
               "credit_id": "52fe44eb9251416c750457f9",
               "name": "Daryl Hannah",
               "profile_path": "/4LLmp6AQdlj6ueGCRbVRSGvvFSt.jpg",
               "id": 589,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Pete Randle",
               "gender": 2,
               "credit_id": "52fe44eb9251416c750457fd",
               "name": "Tom Berenger",
               "profile_path": "/gueEBgqv1sWFemMXyI4TJ2peuMA.jpg",
               "id": 13022,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Leeanne Magruder",
               "gender": 1,
               "credit_id": "52fe44eb9251416c75045801",
               "name": "Famke Janssen",
               "profile_path": "/9wHWq6Mnfpn8L1diMxjr26ReZWl.jpg",
               "id": 10696,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Libby Magruder",
               "gender": 1,
               "credit_id": "52fe44eb9251416c75045805",
               "name": "Mae Whitman",
               "profile_path": "/1QxlJQ1LmfxFQJEZSwwlabRr6a6.jpg",
               "id": 52404,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Jeff Magruder",
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045809",
               "name": "Jesse James",
               "profile_path": "/pRhPAFeMr0waquHAUz0gQoSrT2o.jpg",
               "id": 10135,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Dixon Doss",
               "gender": 2,
               "credit_id": "52fe44eb9251416c7504580d",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045813",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045819",
               "name": "Clyde Hayes",
               "profile_path": null,
               "id": 72462,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eb9251416c7504581f",
               "name": "Todd R. Baker",
               "profile_path": null,
               "id": 72463,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045825",
               "name": "Mark Burg",
               "profile_path": null,
               "id": 2145,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c7504582b",
               "name": "Jeremy Tannenbaum",
               "profile_path": null,
               "id": 72464,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eb9251416c75045831",
               "name": "Glen Tobias",
               "profile_path": null,
               "id": 72465,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c75045837",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eb9251416c7504583d",
               "name": "Gu Chang-Wei",
               "profile_path": "/eezHOkQN2FowBSiviMle0nziixt.jpg",
               "id": 66169,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44eb9251416c75045843",
               "name": "Geraldine Peroni",
               "profile_path": null,
               "id": 1808,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 4.169676,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12488,
      "vote_count": 50,
      "budget": 0,
      "overview": "Savannah lawyer Rick Magruder is at a party celebrating his courtroom victory defending a cop killer when a member of the catering staff, Mallory Doss, discovers her car has been stolen. Having had a few drinks, Magruder offers to give her a lift home, a decision that turns into a one night stand. Rick soon learns that her nut-case father, Dixon, seems to have begun threatening her again. Rick puts the force of his law firm behind Mallory, who he barely knows, has Dixon picked up by the police, and subpoenas the girl's belligerent ex-husband, Pete, to testify against the old man. Dixon is put away in an asylum. However, he soon escapes, putting the lives of everyone who conspired against him in jeopardy.",
      "similar": [
         1645,
         956,
         9800,
         389,
         242,
         14869,
         452507,
         314365,
         3597,
         10999,
         7972,
         11560,
         11975,
         8834,
         445954,
         1427,
         49519,
         634,
         101299,
         329103
      ],
      "original_title": "The Gingerbread Man",
      "runtime": 114,
      "poster_path": "/pUjmmETuh6S4ObgyiUi4Huz8jZZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Island Pictures",
            "id": 3492,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Enchanter Entertainment",
            "id": 69984,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-23",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Altman"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "John Grisham",
         "Clyde Hayes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119196/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NTg5ODg3NV5BMl5BanBnXkFtZTcwNTUwODgxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Kenneth Branagh, Embeth Davidtz, Robert Downey Jr. | See full cast and crew »"],
      "reviews": [
         "With this movie, it's all about style, atmosphere, and acting. True, I didn't believe all of the plot developments, but it didn't matter- the terrific acting, the unexpected plot twists, and the wonderful atmosphere sucked me right in, and carried me along for the ride, and I had a great time. Kenneth Branagh is not only a great actor but a master of accents, and he proves it once again with a flawless Georgia accent. He's surrounded by so much talent in supporting roles (Robert Downey, Jr., Embeth Davidtz from Schindler's List and Fallen, Tom Berenger, Daryl Hannah, and Robert Duvall) that I was simply blown away. I recently bought a copy of this movie, and I never tire of watching it. Simply one of the best thrillers of the year. If you've ignored this movie (and chances are you have), then I suggest you check it out.",
         "******SPOILERS****** Film Noir type movie set in Savannah Georgia that tries hard to stay afloat but it's waterlogged plot sinks it in the last fifteen minutes. \"The Gingerbread Man\" is not at all a boring or bad movie it really holds your attention and you want it to deliver the goods via a surprise and film noir like ending. The movie like \"Hurricane Geraldo\" that lashes the Georgian coast during the entire film instead just sinks under it's wind swept waves. \"Gingerbread Man\" has all the right ingredients for a film noir classic. It's directed by legendary director Robert Altman but it's story gets so muddled and confused that by the end instead of packing a wallop it just fizzles out like a balloon with a hole in it. The chance meeting and later relationship between Rick Magruder, Kenneth Branagh, and Mallory Doss, Embeth Davidtz, at the start of the film is incredibly unconvincing and contrived that you can easily sense that Rick is being set up to be used for some unknown purpose. You can see Mallory constantly staring and trying to get close to Rick at the party before they meet outside in the rain. Mollary's crazy and religious father Dixon Doss, Robert Duvall, who is being manipulated to be the villain in the film also doesn't seem at all that convincing of a being a heavy. If anything Dixon seems to be more normal then most of the people in the movie, like he so perfectly made clear to the court at his sanity hearing. And it doesn't surprise anyone that he like Rick is being set up for some reason known only by the villain or villains in the film. Kenneth Branagh is very good as the person who's being used to unwittingly do the dirty work to clear the way for a 10-15 million dollar grab of fifteen acres of valuable black walnut trees. So is Robert Duvall as the person who they belong to and are the main reason for the crimes being committed in the film. Besides the top stars in the movie there are also very good performances by Tom Berenger, Pete Randel, as Mallory's ex-husband and Famke Janssen, Leeanne, as Rick's ex-wife as well as Daryl Hannah, Louis Harlan, as Rick's law partner. Robert Downey Jr.,Clyde Pell, sparkles is a small but important role as the detective that works for Rick's law office. Still the illogical and contrived ending in the movie as well as some of the sub-plots that lead to it wastes their efforts and spoils what could have been a very good crime/mystery film.",
         "It takes real talent to make a real lemon, and Robert Altman, a most talented director, has succeeded brilliantly here. He made things difficult for himself miscasting Kenneth Branagh as a boozy Savannah lawyer but the attempt to replicate the feel of a town in the grip of a hurricane really finishes things off. The last 20 minutes in the rain is truly appalling, with the audience reduced to guessing about what is going on. The lighting is awful throughout, the more so that it was done on purpose. Maybe we were supposed to experience the confusion of the lead character as he stumbled towards an answer but this does not make for entertainment. In this film noir genre to achieve tension at crucial moments the audience must know just a little more than the protagonist, not a lot less. The story, though completely derivative, is actually quite tight, well plotted, and has a convincing resolution, but the lack of light and general confusion make it difficult to follow. Anyway, an absolute shocker, gross waste of talent and apparently a box office flop (there's some justice). Altman has since put this turkey behind him with the luminous Gosford Park but I am left wondering why on earth he did it.",
         "Robert Altman shouldn't make a movie like this, but the fact that he did- and that it turns out to be a reasonably good and tightly-wound thriller in that paperback-tradition of Grisham thrillers- shows a versatility that is commendable. In the Gingerbread Man he actually has to work with something that, unfortunately, he isn't always very successful at, or at least it's not the first thing on his checklist as director: plot. There's one of those big, juicy almost pot-boiler plots where a sleazy lawyer gets caught up with a desperate low-class woman and then a nefarious figure whom the woman is related with enters their lives in the most staggering ways, twists and plot ensues, yada yada. And it's surprising that Altman would really want to take on one of these \"I saw that coming from back there!\" endings, or just a such a semi-conventional thriller. But it's a surprise that pays off because, oddly enough, Altman is able to catch some of that very fine behavior, or rather is able to unintentionally coax it out of a very well-cast ensemble, of a small-town Georgian environment. The film drips with atmosphere (if not total superlative craftsmanship, sometimes it's good and sometimes just decent for Altman), as Savannah is possibly going to be hit by a big hurricane and the swamp and marshes and rain keep things soaked and muggy and humid. So the atmosphere is really potent, but so are performances from (sometimes) hysterical Kenneth Branaugh, Embeth Davitz as the 'woman' who lawyer Branaugh gets caught up with, and Robert Downey Jr (when is he *not* good?) as the private detective in Branaugh's employ. Did I neglect Robert Duvall, who in just five minutes of screen time makes such an indelible impression to hang the bad-vibes of the picture on? As said, some of the plot is a little weak, or just kind of standard (lawyer is divorced, bitter custody battle looms, innocent and goofy kids), but at the same time I think Altman saw something captivating in the material, something darker than some of the other Grisham works that has this standing out somehow. If it's not entirely masterful, it still works on its limited terms as a what-will-happen-next mystery-Southern-noir.",
         "I don't understand the low 5.7 rating on this film. It's a delight for people who like a strong suspense plot and dark atmospherics. The tone is reminiscent of Midnight in the Garden of Good and Evil, down to the locale (Savannah). The acting is strong, and I was amazed at the verisimilitude of Kenneth Branagh's southern accent. Famke Jansen is great, Robert Duval is effective in a small part, and Embeth Davitz is the BOMB. Great full nude scene of her,too. The plot is fairly standard but effectively executed.",
         "A Savannah, GA attorney, Rick Magruder (Kenneth Branagh), has a partly accidental one night stand fling with a rain-drenched caterer, Mallory Doss (Embeth Davidtz). Immediately, he becomes infatuated with her & simultaneously aware that her violently psychotic father, Dixon (Robert Duvall), is terrorizing Mallory. Magruder calls in his private detective, Clyde Pell (Robert Downey, Jr.), to hunt down the extremely deranged Dixon (Duvall). However, both Magruder & Pell soon realize Dixon is so cunning that even Magruder's law partner, Lois Harlan (Daryl Hannah), will be involved to the degree of risking her own life as Magruder extends the full force of his law firm in defense of his under-statused mistress Mallory. Once Dixon is arrested, the law firm subpoenas Mallory's ex-husband, Pete Randle (Tom Berenger), to testify, as a very reluctant witness, against Dixon. Dixon is ordered into an asylum, then escapes, fueled with more fury for violence against everyone involved. The thriller doesn't stop there, but my summary does! \"The Gingerbread Man\" is a Southern Gothic Thriller par excellance. Clyde Hayes rewrote John Grisham's novel into the screenplay that Robert Altman aptly directed. The cast is too experienced & talented to fail either the novel or the screenplay. Branagh, who usually plays in more classical roles, like Shakespearean characters, quite capably takes the leading role & steals the show with it. Due to depictions of violence, terror, deranged psychosis & adult language, this motion picture is not suitable for children or the faint at heart. It will keep a lover of Gothic thrillers on the edge of their seat, time & again. Plus, when you believe it's over, it's not.",
         "The promising first half-hour is let down by the failure to develop the characters and thus waste a great cast. Downey Jnr is a fantastic actor but is given very little to work with, same goes for Hannah, Berenger and Janssen (who seems to have no purpose in the film whatsoever). Davidtz would've been great if her character had grown, but instead all she got to do was mope around for the whole movie. Majority of the bog-standard material here is given to Branagh, and although he is by no means poor, he just does not get the viewer involved in his battle. The direction, for me, was the film's only virtue. Altman creates a wonderfully dark and intriguing atmosphere, it's just a shame neither the story nor the undercooked characters are equally dark and intriguing. With more complex characters, more of Downey Jnr and Jansenn, and more explosive dialogue, I could've easily overlooked and forgiven the silly plot turns and contrivances, but sadly they stick out like a sore thumb. Disappointing sub-noir thriller. 4/10",
         "This is a wonderful Film Noir thriller, liked by the critics but hated by the public (as often with Altman). One of the reason people don't get it might be because they don't know film noir well enough and therefore miss the wonderful homage Altman makes in this film. I have also seen people complain that it is too slow to be a thriller. Well, I like my thrillers that way. Enough time to get to know the characters and the setting, and a slow built up tension. It does not harm that the film is also well acted and has a beautiful cinematography. This is one of Robert Altman's most underrated film, along with Popeye (1980). We can only hope that time will correct the harsh judgment this small gem got from the public. Who knows, maybe the rising star of Robert Downey Jr. might help to get a little re-appreciation of The Gingerbread Man.",
         "Robert Altman has succeeded where other directors have failed: he has taken a John Grisham story (writing the screenplay himself under a false name) and made it a truly entertaining, engrossing and evocative film. The Altman/Grisham Savanna, GA locale is thoroughly believable. I came out of the viewing of this film feeling that I had actually been soaked by Hurricane Geraldo. As the movie storm intensifies, so does the intrigue and suspense. Great casting. Kenneth Branagh's Georgia accent is right on (I know, I'm from South Alabama). Robert Downey's is just as good. If you've seen other Grisham based films and come away empty. This one will fill you up.",
         "I expected more of Kenneth Branagh. It is a decent movie, on the low side of watchable. I prefer my suspense movies not to be predictable from the outset, which this was! We saw it for two reasons--Branagh and John Grisham. My final opinion was that Grisham wanted to try his hand at writing a screenplay, and he had the clout to get it produced. I hope his next screenplay will benefit from his first errors, as his subsequent novels have gotten better as his experience as an author grows."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Enchanter Entertainment",
         "Island Pictures"
      ],
      "summaries": ["Lawyer Rick Magruder has a one-night-stand affair with caterer Mallory Doss. He becomes hooked on her, and when he learns her nut-case father Dixon is threatening her, he puts the weight of his law firm behind Mallory, has Dixon arrested and subpoenas her ex-husband Pete to testify against Dixon in court. Dixon is sent to an asylum, but escapes from there and the lives of many people are in danger."],
      "budget": 25000000
   },
   "movielensId": 1841,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-23",
      "dvdReleaseDate": "2002-08-13",
      "directors": ["Robert Altman"],
      "runtime": 114,
      "movieId": 1841,
      "title": "The Gingerbread Man",
      "mpaa": "",
      "actors": [
         "Kenneth Branagh",
         "Embeth Davidtz",
         "Robert Downey Jr.",
         "Daryl Hannah",
         "Tom Berenger",
         "Famke Janssen",
         "Mae Whitman",
         "Jesse James",
         "Robert Duvall"
      ],
      "imdbMovieId": "0119196",
      "originalTitle": "The Gingerbread Man",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["xSMT-ysb_EU"],
      "plotSummary": "Savannah lawyer Rick Magruder is at a party celebrating his courtroom victory defending a cop killer when a member of the catering staff, Mallory Doss, discovers her car has been stolen. Having had a few drinks, Magruder offers to give her a lift home, a decision that turns into a one night stand. Rick soon learns that her nut-case father, Dixon, seems to have begun threatening her again. Rick puts the force of his law firm behind Mallory, who he barely knows, has Dixon picked up by the police, and subpoenas the girl's belligerent ex-husband, Pete, to testify against the old man. Dixon is put away in an asylum. However, he soon escapes, putting the lives of everyone who conspired against him in jeopardy.",
      "tmdbMovieId": 12488,
      "avgRating": 2.95727,
      "releaseYear": "1998",
      "numRatings": 784,
      "posterPath": "/pUjmmETuh6S4ObgyiUi4Huz8jZZ.jpg"
   }
}