{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0118229",
      "video": false,
      "title": "Illtown",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dante",
               "gender": 2,
               "credit_id": "52fe4a149251416c750dcf79",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Micky",
               "gender": 1,
               "credit_id": "52fe4a149251416c750dcf7d",
               "name": "Lili Taylor",
               "profile_path": "/pIJ4Enx6kIC9srLkDfGpEzfNlDZ.jpg",
               "id": 3127,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gabriel",
               "gender": 2,
               "credit_id": "52fe4a149251416c750dcf81",
               "name": "Adam Trese",
               "profile_path": "/hVPP0r2q2kk8rVJ8m7KYqNTBAvG.jpg",
               "id": 27858,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Francis (Cisco)",
               "gender": 2,
               "credit_id": "52fe4a149251416c750dcf85",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lilly",
               "gender": 1,
               "credit_id": "52fe4a149251416c750dcf89",
               "name": "Angela Featherstone",
               "profile_path": "/ubE9z8bDrIy06IKaSLI5LN551vR.jpg",
               "id": 15276,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "D'Avalon",
               "gender": 2,
               "credit_id": "52fe4a149251416c750dcf8d",
               "name": "Tony Danza",
               "profile_path": "/zuGqT0ZJQFm0GMUnEa32jYu75Fy.jpg",
               "id": 18298,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe4a149251416c750dcf91",
               "name": "Isaac Hayes",
               "profile_path": "/4igh7emwzt4xBLw1r05gCUHxwzD.jpg",
               "id": 6542,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Pool Boy",
               "gender": 2,
               "credit_id": "5514f25f925141070100c675",
               "name": "Oscar Isaac",
               "profile_path": "/cY6ail3ebXDx9FCoZMgVGAbmBus.jpg",
               "id": 25072,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a149251416c750dcf75",
               "name": "Nick Gomez",
               "profile_path": "/mpV7F62c83IcRNjm4ei6ZMwRtfQ.jpg",
               "id": 17278,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5ac40451c3a3682d9a03e9d2",
               "name": "Nick Gomez",
               "profile_path": "/mpV7F62c83IcRNjm4ei6ZMwRtfQ.jpg",
               "id": 17278,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5ac404590e0a260c390428e6",
               "name": "Jim Denault",
               "profile_path": null,
               "id": 2864,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5ac40461925141601507c222",
               "name": "Tracy Granger",
               "profile_path": null,
               "id": 2865,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5ac4046e925141601807bc15",
               "name": "Brian Keane",
               "profile_path": "/6d8tVaRljVzWUZ9MW507Q4uyu0c.jpg",
               "id": 72184,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.0597,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 98499,
      "vote_count": 1,
      "budget": 0,
      "overview": "Dante and his girlfrend Micky run a very profitable drug operation in a seaside town, aided and abetted by a host of teens who sell the smack at discos around town, as well as by Lucas, a corrupt cop who's on the take. Their downfall comes when they suspect one of the boys, Pep, of ripping them off, and his accidental death causes disloyalty among the teens, who suspect Dante offed them. All of this is perfect for the return of Gabriel, a one-time partner of Dante, who has just been released from jail, and has an almost angelic demeanor and the certainty that he can fix everyone's lives.",
      "similar": [],
      "original_title": "Illtown",
      "runtime": 103,
      "poster_path": "/lweN1gRGw4yb2hW3wKSuXTSHOl1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-07-09",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Gomez"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Nick Gomez",
         "Terry Williams"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118229/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3NjMwODA4MF5BMl5BanBnXkFtZTYwMzI3Njg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Michael Rapaport, Lili Taylor, Adam Trese | See full cast and crew »"],
      "reviews": [
         "Sporting an excellent cast and appealing stylistic elements, ILLTOWN visits the theme of what happens when people trapped in a life of crime they began as kids are drawn by the normal maturation process to middle-class values. Like much good storytelling, this film starts with vagueness and confusion but gradually gels into a coherent story. The problem is that it falls apart again in the last third, and we are never sure what really happened to the characters at the end. Still, the film is eminently watchable, and if you can handle the irresolution, I would recommend it for rental.",
         "Illtown's a startling 180 from the documentaryish \"Laws of Gravity\", from the same director and much of the same supporting cast...this is a dreamlike, strangely structured film about drug dealers that sets up an expectation of a typical revenge flick, but by the end we don't quite know who's the \"good\" guys or the \"bad\" guys, and despite the narrative setting up one set of characters as the protagonists, the antagonist ends up in many ways as sympathetic, if not more, for this is a film that doesn't fill us in on the backstory for some time...watch it for Corrigan's great monologue about his wife three quarters of the way in, just one of many great moments in this truly weird, violent, unsettling film...",
         "Man, I can't believe I stayed up until 1am watching this mistake on IFC. I really enjoyed Laws of Gravity (granted I saw it almost 10 years ago and my opinion may be quite different if I saw it today), so I figured Illtown would be at worst an engaging if not unique film. The thing is, it's not a extremely bad film, it's just drops the ball in alot of places, is pretentious in many others and is a mess and a failure at the end. I mean, to start with, Gomez seems to equate putting vague segues, low talking and excruciating overused slo-mo with standard crime film cliches as great film making. The talent is there with Rappaport (Wigger #1, my man!), Taylor and Corrigan, the cinematography is creative, and the story, while not unique, is engrossing enough to make you want to spend 90 minutes on. The pacing is tolerable at first and the quiet slow dialog between Rappaport and Taylor is captivating for about 45 minutes, but then cliches, unrealistic criminal behaviour and TONY DANZA derail this into what ultimately is a failure, and an irratating one at that. The characters, Gabriel and D'Avalon in particular, are portrayed as too \"cool for words\", as if we are suppossed to be impressed with them because the filmatic cues instruct us to. Gabriel is terribley overacted, his motives are legit but his execution of his plan is absurdlly plotted, confusing and devoid of the tension Gomez seems to think we'll allow him without earning it. People are killed left and right in what is suppossed to be shockinging casualness but comes off more comical and absurd (aparently the only cops beside the corrupt one are the ones in flashbacks.) It's like Gomez picked the top 5 most public places to NOT commit a murder and just offs people without consequence. That isn't shocking, it's dopey. \"Hey, I'll kill one of my crew out of tough guy spite in my girlfriend's apartment like it was ordering a pizza!\" Ooooooooh, how Tarantino. Rappaport is OK (he isn't bad at all, rather likeable, but is kind of trapped in a crummy movie), Taylor is actually quite good (and as a cheap \"guy\" aside, she's actually kinda cute in this movie. After seeing her in one too many \"ugly duckling/manly psycho\" roles this was refreshing). It was nice to see her character as business equal, not just \"minor drug lord's girlsfriend\". I really liked Corrigan who's occasional overblown performance seems more a result of a cliched script than his ability. But really, the absurdity of absurdities is DANZA. Poking holes in a Tony Danza performance is like shooting fish in a barrel then stomping on them in jackboots on the driveway, so I feel pretty cheap doing this. The roles as it appears he was directed and dictated by ridiculous dialog (drug lord dialog 101) would be terrible if it was Pacino, for Godsake, but with Danza it's atrocious. Hey, I'm all for reinventing youself (I still applaud Stallone for Copland and I still foolishly root for the never-materializing Great Jim Carrey dramatic role). The man simply had no clue how to approach this already cliched character, so he did what he thought would come off as \"important\": he spoke low, added a bit of lame fey (oooh, the drug lord is gay, so I'll play him like a angry dandy), started every scene with a disarming non-sequitor . . . ugh. What a pretentious pile of crap. Questions abound: Why didn't Gabriel just kill Dante? How was the corrupt cop in Florida and Boston? Why do bodies lie undiscovered for days? Where is everyone in this city? Why doesn't Gabriel look anything short of an chiseled underwear model after getting beat with a pool cue and strangled (not a damn mark on him after loosing teeth and turning purple)? What the HELL is the deal with Isaac Hayes? And DOES DANTE DIE? Is the abiguity suppossed to impress me? It just comes off as stupid.",
         "After being completely blown away by \"Laws of Gravity\" and \"New Jersey Drive\" I had great expectations for this bigger-budget, bigger-talent movie. Unfortunately this effort fails to achieve what Gomez's earlier offerings did so successfully. I think the biggest problem with the film is the pacing. All of the heroin-induced deadpan dialogue just wears the momentum out of the story. The talent here is just wasted in a cloudy disembodied attempt at a realistic portrayal of the world of heroin in Miami. My advice, stick with Gomez's earlier films and hope for future success from this very talented director.",
         "As the title says, I find this to be sort of the 'heroin' version of Scarface though the stories are not identical, but when you see the ending, you might know what I mean. The movie features strong actors who can be seen in movies/shows like True Romance, American Pie, The Sopranos, The Substitute, Ransom, etc. The movie is trippy/surreal so in some ways it's comparable to David Lynch's directing style. The story revolves around drug dealers and an ex-dealer getting out of prison and trying to reclaim his place in the drug world in Florida. i don't want to give the story away, but you can assume from the aforementioned summary of the plot, that there will be friction, and deaths. strong movie, obviously from the rating, it's poorly underrated.",
         "...artistic, cultural and intellectual oriented toward the liberation of the mind by emphasizing the critical and imaginative faculties of the \"unconscious mind\" and the attainment of a state different... the \"sur-real\", or \"more than real\". Drug dealing and dirty cops are confusing...the movie reflects it. It's no tour de force! It is a series of vignettes often presented out of sequence. George(aka Isaac Hayes) = racial undertones. Needless to say this movie is not about race. Or is it? Inner city youth dress, speak and display \"Illtown\" attitude(s). FINAL ANALYSIS: this production has the players, enablers, misguided youth and violence that is expected in the genre. The film is not likable because it is top heavy with editorial and special effects that are not needed to depict the morass of drug abuse. Just say NO!",
         "I enjoyed \"Laws of Gravity\" and figured this would be as good. I like watching Michael Rappaport, and this was no exception. Tony Danza was a surprise heavy and the rest of the cast held their own. Kevin Corrigan was excellent as was his delivery of the story about his wife. All in all, a film whose characters kept you involved in their life of crime, the criminal's own concepts of honor and their delivery of retribution. The youth gang standing around after Dante's payback for Cisco didn't make much sense, unless you are to suppose they were merely robots and did not act unless directed accordingly. Neither did the casual attitude about bodies laying around until the requisite characters in the film got their 'look see'. Poetic justice? OK. But that ending was the most confusing in a long time. It just leaves me unsatisfied with any spin I've put on it. That ending golf cart sequence sure didn't help clarify anything either <G>. Fore!!!",
         "This film lacks credibility, but it is certainly worth watching. Though not nearly as good as \"Laws of Gravity\", it is well paced and flows along dreamily like the heroin trip it portrays. Lili Taylor delivers a decent performance, though Michael Rapaport is a bit stale.",
         "I felt this was a movie that was well acted. The story was very good. Until you have been in that element you do not realize how true that story can be. The story about Trese's character's wife is great. Tony Danza was also good.",
         "Though a deliberately confusing ending ultimately undermines this film's potential, an excellent cast and unique storytelling approach make it well worth the time for anyone not expecting a straight-forward crime picture. Director Nick Gomez, also responsible for \"Laws of Gravity\" and \"New Jersey Drive,\" once again proves that he refuses to be predictable. The former plays like an updated \"Mean Streets\" overseen by the ghost of John Cassavetes and the latter like a straight-forward entry in the \"Boyz in the Hood\" sub-genre. \"Illtown,\" on the other hand, is an ultra-stylized revenge/crime thriller mixed with a character drama mixed with wierd surrealism. The only thing I can think of to compare it to, at least on some levels, is Sergio Sollima's equally slow-paced and dreamy \"Violent City.\" The Florida locations fit the mood perfectly. The protagonists are a bunch of laid-back, golf playin' smack dealers one would genuinely enjoy serving in a restaurant or at a ticket counter; the stereotpyes normally attached to their way of life are conspicuously absent. The final shoot-out between Rappaport and Trese is all style and no substance, but in such an oddly good way, it had me gawking with awe. Lili Taylor, Adam Trese and Kevin Corrigan, all relative unknowns (which irks me), are all great here. Michael Rappaport, while somewhat over-exposed at this point, was also under-appreciated at the time of this film's release. He, Gomez regular Saul Stein, and even the oft-annoying Tony Danza all rise to the material, for which they are aptly cast. Like I said, the end left me frustrated, but the overall experience is well worth it."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Shooting Gallery"],
      "summaries": ["Dante and his girlifrend Micky run a very profitable drug operation in a seaside town, aided and abetted by a host of teens who sell the smack at discos around town, as well as by Lucas, a corrupt cop who's on the take. Their downfall comes when they suspect one of the boys, Pep, of ripping them off, and his accidental death causes disloyalty among the teens, who suspect Dante offed them. All of this is perfect for the return of Gabriel, a one-time partner of Dante, who has just been released from jail, and has an almost angelic demeanor and the certainty that he can fix everyone's lives."],
      "budget": 0
   },
   "movielensId": 1842,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-07-09",
      "dvdReleaseDate": null,
      "directors": ["Nick Gomez"],
      "runtime": 103,
      "movieId": 1842,
      "title": "Illtown",
      "mpaa": "R",
      "actors": [
         "Michael Rapaport",
         "Lili Taylor",
         "Adam Trese",
         "Kevin Corrigan",
         "Angela Featherstone",
         "Tony Danza",
         "Isaac Hayes",
         "Oscar Isaac"
      ],
      "imdbMovieId": "0118229",
      "originalTitle": "Illtown",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Dante and his girlfrend Micky run a very profitable drug operation in a seaside town, aided and abetted by a host of teens who sell the smack at discos around town, as well as by Lucas, a corrupt cop who's on the take. Their downfall comes when they suspect one of the boys, Pep, of ripping them off, and his accidental death causes disloyalty among the teens, who suspect Dante offed them. All of this is perfect for the return of Gabriel, a one-time partner of Dante, who has just been released from jail, and has an almost angelic demeanor and the certainty that he can fix everyone's lives.",
      "tmdbMovieId": 98499,
      "avgRating": 2.94,
      "releaseYear": "1996",
      "numRatings": 25,
      "posterPath": "/lweN1gRGw4yb2hW3wKSuXTSHOl1.jpg"
   }
}