{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kids",
            "id": 161155
         },
         {
            "name": "sea lion",
            "id": 208874
         }
      ],
      "imdb_id": "tt0120213",
      "video": false,
      "title": "Slappy and the Stinkers",
      "recommendations": [
         66923,
         42407,
         22102,
         19580,
         8854,
         10081
      ],
      "backdrop_path": "/j8fl0KQujnEagYZ2hYwHmMjVvjb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Morgan Brinway",
               "gender": 2,
               "credit_id": "52fe480d9251416c9107e80d",
               "name": "BD Wong",
               "profile_path": "/w7Hs9m6ocS2qlibvrLOvmyCKbAN.jpg",
               "id": 14592,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Harriet",
               "gender": 1,
               "credit_id": "52fe480d9251416c9107e811",
               "name": "Jennifer Coolidge",
               "profile_path": "/jOVVWdfxLQ9MOumqM3VxiwAlT9a.jpg",
               "id": 38334,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Roy",
               "gender": 2,
               "credit_id": "52fe480d9251416c9107e815",
               "name": "Bronson Pinchot",
               "profile_path": "/hGaFZsohQbRIskmkLtNbwJNgLPN.jpg",
               "id": 4689,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sonny",
               "gender": 2,
               "credit_id": "52fe480d9251416c9107e819",
               "name": "Joseph Ashton",
               "profile_path": "/gqYsCiW2HtHVjzopA3nPs0YYLED.jpg",
               "id": 24525,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Aquarium Information Woman",
               "gender": 1,
               "credit_id": "52fe480d9251416c9107e81d",
               "name": "Jamie Donnelly",
               "profile_path": "/skTjfWWRX3CXCwIDLDFQBhNgJQy.jpg",
               "id": 8899,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe480d9251416c9107e809",
               "name": "Barnet Kellman",
               "profile_path": null,
               "id": 121829,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "547768d492514104d80026db",
               "name": "Robert Wolterstorff",
               "profile_path": null,
               "id": 1235203,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "547768e79251412c3b00811e",
               "name": "Mike Scott",
               "profile_path": null,
               "id": 1390108,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.412781,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 81367,
      "vote_count": 16,
      "budget": 0,
      "overview": "Five 2nd-grade kids who don't follow strict rules by their school principal Brinway are dubbed \"Stinkers\" by him. On the class visit to an aquarium the Stinkers decide that a sea lion called Slappy doesn't feel too good there, \"free\" him, and plant him into Brinway's hot-tub.",
      "similar": [
         585,
         1370,
         20352,
         150540,
         101299,
         62211,
         342473,
         394823,
         43959,
         9472,
         1124,
         10404,
         15373,
         44214,
         55721,
         114150,
         86130,
         8328,
         3600,
         2395
      ],
      "original_title": "Slappy and the Stinkers",
      "runtime": 78,
      "poster_path": "/d2gjvvtmhtL2AVAJDqUI5G35jjK.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1998-01-23",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Five Kids. One Sea-Lion. No Rules.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Barnet Kellman"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "Robert Wolterstorff",
         "Mike Scott"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120213/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2NjI4MzkzNV5BMl5BanBnXkFtZTcwMTE0MzcyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: BD Wong, Bronson Pinchot, Jennifer Coolidge | See full cast and crew »"],
      "reviews": [
         "This movie is the type of good clean adventure kids today need. Happy endings are rare these days and kids need to experience HAPPY !! A group of kids take on the responsibility of Slappy The Seal after being found mistreated. Again, I think children need to see more of this......the need for humans to have compassion and sympathy for others, and a desire to do the right thing. Soon Slappy becomes an integral part of their group and the movie depicts their adventures (imagine how hard it is to keep a seal from being discovered by your parents for example). Predictable, yes......a little thin plot-wise, yes, but sweet and lighthearted just the same.",
         "Slappy and the Stinkers is one of my 10 favorite all-time movies. My grandchildren and I have watched it over and over. In these days of sex, violence and objectionable language, it is so refreshing to find a movie that one can feel comfortable sharing with others, especially children. Slappy is a delightful and funny seal, being hidden (and disguised) by a group of youngsters, trying to protect him from those who would do him harm. A strict and unfeeling school master, along with gardener (Branson Pinchot) add to the enjoyment. Watch as once again good triumphs over evil! Clean, wholesome and upbeat comedy, a good addition to one's video library.",
         "I watched this movie four times already and counting when I babysit a little guy and I actually thought this was quite good, it was not perfect but it did have a lot of good scenes. However, the only good actors in that movie were B.D. Wong and Scarlett Pommers.",
         "After watching only 10 minutes of this movie with my 5 year old son, all I need to know is that he was laughing out loud almost continually, not to mention his mother. The child acting is not Oscar worthy. The adult acting is child like but for a kids movie it is perfect but none of that matters. The seal is a scene stealer. If you have a child who likes to see bad people do bad things stupidly and good triumph over ineptitude along with fart jokes and so on, then this is the movie for you! The script is packed jokes and situation comedy. I was apprehensive about watching it but I'm glad I did. Overall, I think this is worth a watch when you have over watched Up, Cars, How to train your Dragon and so on. PS, the dog deserves his own movie.",
         "I watched this movie when I was 11 on TV and it was really, really funny. It was a fun, adventurous film following the adventure of Slappy and The Stinkers. The ending was great and I loved how the teacher got what he deserved. My favourite character was the kid with the allergies (I can't remember his name :-( ) People say the acting was bad but they were a bunch of 7-year-olds, you can't expect too much. I actually thought the acting from the kids was pretty good. Sure, the situation was a bit unrealistic, but the adventures of the average 7-year-old would not be very exciting. Over all I give it a 10 because it's a fun family film.",
         "Man. This movie has got it all. Cute kids. Fart jokes. A sea lion. What more do you need? I used to wonder if B.D. Wong had the chops to pull of a subtle comedy like this, and this movie proves he's got what it takes. Jennifer Coolidge shows she's more than just the dramatic actress so beloved in those Christopher Guest pseudo-documentaries and knocks this one out of the ballpark. That accent? Hilarious. Bronson Pinchot proves that he's more than just a one-trick pony with his portrayal of Roy. You can barely even detect his Meposian accent. Wow! And without going into too much detail, I'll just say that these kids worked great as a team. Move over, Li'l Rascals. There's a new group of youngsters in Cute City. Why these kids didn't get a series (Hello! \"Slappy & the Stinkers: the Weekly Show\") or at least a few MacDonald's ads is beyond me. Whatever. Sometimes I don't know what goes on in Hollywood to let talent like this slide. See this movie!",
         "This is by far the worst movie I have ever seen, and I enjoy watching bad movies. There wasn't one scene were I can walk away saying: 'Well, that wasn't too bad.', because I can't lie in this review. First off, the child actors are by far the worst possible, the casting crew was either drunk or mentally handicapped. They probably cast them if they looked the part. Secondly, there are enough clichés found in this 'movie' to make a grown man sick. There is really nothing else I can say about this movie. You really have to see it for yourself. There is much entertainment found in this movie; but not in the way the makers intended. In summary; a steaming pile of feces'",
         "I cannot understand the critics of this film. It clearly has an unbelievable plot and all the characters are caricatures of goodies or baddies, inept adults and triumphant kids - but that is where the humour lies. From start to finish it stands in the old fashioned slap stick and manic situation comedy movie genre. The fact that you can see some of the jokes coming does not stop them being funny at the moment of delivery. There are some superb slap stick movie moments. Mayhem abounds. It is not meant to be taken seriously. It does not pretend to be great cinema. It is not cool or sophisticated comedy. Woody Allen would and could not have made it. It should be seen for what it is, a wonderful, old-fashioned, family comedy which makes us laugh again and again and which can be enjoyed by all ages. I grew up on Jerry Lee Lewis and St. Trinians. I loved it.",
         "Maybe I'm just a softy but I thought this was a wonderful (and believable!) family film. The expressions on the children's faces when they first see Slappy was priceless -- and the final scene was nothing but laughs. I'm a literature college professor so I've read and seen my share of \"stinkers\". This one smells good!",
         "Due to a friends Birthday coming up in a few weeks time,I decided to search around on Amazon UK for any Home Alone-style family movies that they would enjoy watching.With having been a big fan of the groundbreaking HBO TV series OZ,I was pleased to spot on the second page of Amazon's listings a film starring former Oz cast member B.D. Wong,which led to me deciding to find out if the \"stinkers\" really do stink. The plot: Being deeply embarrassed by a gang of his students allowing a remote control aeroplane to go out of hand and almost hit his car,second grade teacher Morgan Brinway decides to punish the group by calling their little gang \"Stinkers\" and also to ignore almost anything that any member of the gang says to him.Placed at the back of the bus,as the whole school heads off for a visit to Springville aquarium,the \"Stinkers\" decide to take a closer tour of the aquarium,when they spot Brinway being completely distracted. Keeping an eye out for Brinway,the gang quietly look round behind the scenes of the aquarium,which leads to them catching a glimpse of a man attempting to steal a sea lion called Slappy from the aquarium.With Brinway having told them all that he would ignore anything that they tell him,the \"Stinkers\" decide that the only way to save Slappy,is for them to do it all on their own. View on the film: Focusing on the \"Stinkers\" for most of the movie,the screenplay by Bob Wolterstorff and Mike Scott sadly fails to build any supported feelings that the viewer may have for the gang,by making each member of the group very annoyingly and also lacking any distinctive personalities. Whilst sadly only having supporting roles in the movie,B.D. Wong and Jennifer Coolidge each give charming performances,with Wong showing a keen hand for slapstick as Brinway,and Coolidge also giving the movie an unexpected bit of class as assistant teacher Harriet.Along with Wong and Coolidge,director Barnet Kellman gives the movie a real boast by including some delightful spoof moments of other movies,which help to thankfully stop this film from \"stinking\" as much as it easily could."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Bubble Factory, The",
         "TriStar Pictures"
      ],
      "summaries": ["Five 2nd-grade kids who don't follow strict rules by their school principal Brinway are dubbed \"Stinkers\" by him. On the class visit to an aquarium the Stinkers decide that a sea lion called Slappy doesn't feel too good there, \"free\" him, and plant him into Brinway's hot-tub."],
      "budget": 0
   },
   "movielensId": 1843,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1998-01-23",
      "dvdReleaseDate": "2005-01-04",
      "directors": ["Barnet Kellman"],
      "runtime": 78,
      "movieId": 1843,
      "title": "Slappy and the Stinkers",
      "mpaa": "PG",
      "actors": [
         "BD Wong",
         "Jennifer Coolidge",
         "Bronson Pinchot",
         "Joseph Ashton",
         "Jamie Donnelly"
      ],
      "imdbMovieId": "0120213",
      "originalTitle": "Slappy and the Stinkers",
      "genres": [
         "Adventure",
         "Family"
      ],
      "youtubeTrailerIds": ["QJZJmdbJCDk"],
      "plotSummary": "Five 2nd-grade kids who don't follow strict rules by their school principal Brinway are dubbed \"Stinkers\" by him. On the class visit to an aquarium the Stinkers decide that a sea lion called Slappy doesn't feel too good there, \"free\" him, and plant him into Brinway's hot-tub.",
      "tmdbMovieId": 81367,
      "avgRating": 2.45652,
      "releaseYear": "1998",
      "numRatings": 46,
      "posterPath": "/d2gjvvtmhtL2AVAJDqUI5G35jjK.jpg"
   }
}