{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0120906",
      "video": false,
      "title": "Zero Effect",
      "recommendations": [
         10729,
         22318,
         10608,
         9844,
         40562,
         20306,
         9401,
         10388,
         45225,
         14578,
         10668,
         77469,
         9452,
         11229,
         21991,
         10744,
         11004,
         26618,
         29193,
         60994
      ],
      "backdrop_path": "/hYem57ZFPvxOfMjw0RLLCdhmOTZ.jpg",
      "revenue": 1980338,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Daryl Zero",
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f943",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Steve Arlo",
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f947",
               "name": "Ben Stiller",
               "profile_path": "/o9M2PyoF7QDSMq1OwW0D892fIkV.jpg",
               "id": 7399,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gregory Stark",
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f94b",
               "name": "Ryan O'Neal",
               "profile_path": "/fTqIq5voXV1hQd3Ol4VtnUWy7j2.jpg",
               "id": 31070,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gloria Sullivan",
               "gender": 1,
               "credit_id": "52fe46aa9251416c7507f94f",
               "name": "Kim Dickens",
               "profile_path": "/yIXBljS46WXvRk2gma3ravVBBgU.jpg",
               "id": 21165,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jess",
               "gender": 1,
               "credit_id": "52fe46aa9251416c7507f953",
               "name": "Angela Featherstone",
               "profile_path": "/ubE9z8bDrIy06IKaSLI5LN551vR.jpg",
               "id": 15276,
               "order": 4
            },
            {
               "cast_id": 25,
               "character": "Bill",
               "gender": 2,
               "credit_id": "576724fe9251413e160007dc",
               "name": "Hugh Ross",
               "profile_path": "/rHgVnIopP5D8t2Qsxr8MpCF8HIx.jpg",
               "id": 1638387,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Daisy",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f95b",
               "name": "Sarah DeVincentis",
               "profile_path": null,
               "id": 79649,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Kragan Vincent",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f95f",
               "name": "Matt O'Toole",
               "profile_path": "/kNWX5D3SU9Z666M8OcOy5QUF3my.jpg",
               "id": 79651,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Maid",
               "gender": 1,
               "credit_id": "52fe46aa9251416c7507f963",
               "name": "Michele Mariana",
               "profile_path": null,
               "id": 79653,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Gerald Auerbach",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f967",
               "name": "Robert Katims",
               "profile_path": null,
               "id": 79654,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Staffer #1",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f96b",
               "name": "Tyrone Henry",
               "profile_path": null,
               "id": 79657,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Staffer #2",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f96f",
               "name": "Aleta Barthell",
               "profile_path": null,
               "id": 79659,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Firefighter",
               "gender": 0,
               "credit_id": "52fe46ab9251416c7507f973",
               "name": "Tapp Watkins",
               "profile_path": null,
               "id": 79661,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Motel Clerk",
               "gender": 0,
               "credit_id": "52fe46ab9251416c7507f977",
               "name": "Wendy Westerwelle",
               "profile_path": null,
               "id": 79662,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Little Kid",
               "gender": 0,
               "credit_id": "52fe46ab9251416c7507f97b",
               "name": "Lauren Hasson",
               "profile_path": null,
               "id": 79663,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ab9251416c7507f981",
               "name": "Jake Kasdan",
               "profile_path": "/1jmlwJ7Y0a7fp28bJLr73u12wbv.jpg",
               "id": 51851,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ab9251416c7507f987",
               "name": "Jake Kasdan",
               "profile_path": "/1jmlwJ7Y0a7fp28bJLr73u12wbv.jpg",
               "id": 51851,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ab9251416c7507f98d",
               "name": "Jim Behnke",
               "profile_path": null,
               "id": 79664,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe46ab9251416c7507f993",
               "name": "Naomi Despres",
               "profile_path": null,
               "id": 79665,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe46ab9251416c7507f999",
               "name": "Lisa Henson",
               "profile_path": null,
               "id": 79666,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ab9251416c7507f99f",
               "name": "Jake Kasdan",
               "profile_path": "/1jmlwJ7Y0a7fp28bJLr73u12wbv.jpg",
               "id": 51851,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe46ab9251416c7507f9a5",
               "name": "Janet Yang",
               "profile_path": null,
               "id": 21015,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ab9251416c7507f9ab",
               "name": "The Greyboy Allstars",
               "profile_path": null,
               "id": 79667,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "55528587c3a368426f005400",
               "name": "Bill Pope",
               "profile_path": null,
               "id": 9341,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.445032,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16148,
      "vote_count": 68,
      "budget": 5000000,
      "overview": "Daryl Zero is a private investigator. Along with his assistant, Steve Arlo he solves impossible crimes and puzzles. Though a master investigator, when he is not working, Zero doesn't know what to do with himself. He has no social skills, writes bad music, and drives Arlo crazy. In his latest case, Zero must find out who is blackmailing a rich executive, and when his client won't tell him, why.",
      "similar": [
         4771,
         96,
         75780,
         984,
         10651,
         11423,
         11564,
         910,
         15069,
         8090,
         10900,
         4638,
         949,
         1586,
         9679,
         320,
         281,
         807,
         395834,
         357096
      ],
      "original_title": "Zero Effect",
      "runtime": 116,
      "poster_path": "/qmgUyhyJQwHzZ7ulaYCJLBon7gG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Manifest Film Company",
            "id": 20719,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-01-30",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The world's most private detective.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jake Kasdan"],
      "runtime": 116,
      "synopsis": null,
      "writers": ["Jake Kasdan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120906/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2NzYxMzI5Nl5BMl5BanBnXkFtZTcwMjkzMzMyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Pullman, Ben Stiller, Ryan O'Neal | See full cast and crew »"],
      "reviews": [
         "This was a really pleasant surprise. I didn't know what to expect before watching this film, but what I got was a great movie that featured some really good performances. Stiller and O'Neal are solid, but the always-likeable Bill Pullman is the real standout here. There are lots of great moments in this film, many of them comedic, and except for an occasionally slow pace during the second half, I was greatly entertained throughout. Definitely worth checking out this movie.",
         "I loved ZERO EFFECT and would heartily recommend the film to anyone who enjoys a great story told with great style and wit. Jake Kasdan is in his early 20's and has written and directed a wonderful film that belies his age and relative inexperience. I take my hat off to him. On this evidence he is a major talent and I can't wait to see what he does next. When I heard about the plot of ZERO EFFECT, the story of an eccentric and reclusive, private detective and that this part would be played by Bill Pullman, I was sold on the film immediately. Bill Pullman is a wonderful actor who I admire greatly and is always a joy to watch on screen. The part of Daryl Zero is a very tricky one and very few actors could pull it off, but Bill was simply brilliant. The scene where we hear Daryl playing his guitar and singing a song but don't actually see him for about three minutes was perhaps the most wonderful introduction of a character I've seen in any film. Ben Stiller provides sterling support as Daryl's right hand man and Ryan O'Neal (nice to see him again) and Kim Dickens are also terrific. There are so many great lines in the film, particularly those where Daryl is explaining his methods of deduction and surveillance. His explanation of the best way to follow someone is priceless, as is his explanation on how to find things ! This film is a pure joy and very refreshing. Go see it !",
         "Bill Pullman is a very underrated actor, and this film he totally steals the show as the reclusive, quirky but 'greatest detective in the world', Daryl Zero. He certainly suited the part in Zero Effect! Ben Stiller, Ryan O'Neal and Kim Dickens all provide great support in this different but interesting comedy. It had a very good story, some interesting social commentary and observation. Not quite a thriller but for its acute observation, realistic characters and storyline, Ill give this a ***1/2 out of *****!!!",
         "Excellent story and dialog. Certainly underrated. The film has great performances by Bill Pullman and Kim Dickens, as well as Ben Stiller. This one seems to have gone unnoticed by most people, but it was clever and entertaining. The plot moves and has plenty of twists, but the plot twists are not what makes the film great. The characters and their development are what make this movie unique. Daryl Zero is one of the most memorable private detectives I have ever seen and his relationship with Gloria Sullivan (Kim Dickens) is well developed. Daryl's sidekick, Ben Stiller, is interesting too as his loyalties are tested throughout the film. At first it is difficult to determine how astute Daryl is--is he really the \"most observant\" person in the world? Or is he a bumbling fake? As the story develops, you see how adept Daryl Zero is. Even the soundtrack is good with a great song by Nick Cave.",
         "OK, I thought this was an excellent movie. Having said that, where is the credit to Arthur Conan Doyle? When movies are based on the works of Shakespeare, such as modern day versions of Hamlet and Macbeth they always credit Shakespeares works. Compare Zero Effect to A Scandal in Bohemia. Compare the character Zero to Holmes: 1. both use drugs 2. both play a musical instrument 3. both apply astounding powers of observation to solve cases 4. both use disguises 5. both are loners who rely on their intermediaries (Watson/Arlo) In Zero Effect, Arlo deals with conflicts between his romantic life and Zero's need of him to function. In A Scandal In Bohemia, Watson has recently married and Holmes and Waston must deal with the issue. The first line of A Scandal In Bohemia reads: \"To Sherlock Holmes she is always THE woman.\" Guess what, in the end Sherlock doesn't get the girl and he admires her as his most capable adversary. I guess Doyle must have a copy of Zero Effect stashed away somewhere. Again, I will say I thought is was a fantastic movie. I'm not always a big fan of Pullman, but he was excellent in the role. If you are considering not watching this movie because you don't like Ben Stiller, well don't let that stop you. He takes his normal persona down a couple notches. Don't expect to see any traces of Zoolander or Meet the Parents.",
         "As soon as the \"Zero Effect\" finished, my wife and I turned to each other and said, \"that's one of the best movies we've seen.\" Bill Pullman shows why he is one of the best, if often overlooked, actors. He plays the very private detective Daryl Zero who is uncannily insightful on the job, but otherwise is a mess. We laughed so hard at times that we had tears in our eyes. And it isn't just funny - there is a very well-woven story involving murder and blackmail. For its cleerness, acting, story, and directing, I give it a solid \"9\" of \"10\", and one of my all-time favorites.",
         "A brilliant film!! Bill Pullman finally steps out of the Spaceballs/Independence Day cloud and proves he's got the acting chops. Kasdan's script is AMAZING, and his directorial style only adds to the greatness of this flick. Stiller turns in his usual unique comic performance with a more laid-back feel, and the remainder of the cast (Kim Dickens particularly) compliments Pullman perfectly. Why didn't this get any Oscar nods?",
         "The cast in this movie is well thought out!! Bill Pullman plays Detective Daryl Zero, and he is a consortium of unorthodox emotions!! Your initial perception of him being one whereby he is an amphetamine freak, who chants like a castrated country rock singer, and drinks 68 cans of Tab in a single day!! Concocting irrational conclusions for everything is Daryl Zero's favorite hobby, and, all of his ersatz proclivities, which unalterably require a necessary detachment, are peculiar enough to put him in either Belvue or Believe it or Not!! He can astutely characterize a white collar criminal, and speak six different languages, yet, he is incapable of filling out a tax form!! With regard to something or someone being hazardous, Daryl Zero should come with a personalized warning label which reads: Compared to this guy, arsenic seems like an innocuous and palatable beverage!! The movie starts off with Gregory Stark, (Ryan O'Neal) who is the anonymously wealthy guy. Stark has now become the aggrieved recipient of blackmail!! Steve Arlo, (Ben Stiller) plays Detective Zero's business manager, Steve (Ben Stiller) manufactures a mystique about Detective Zero through a bastardized affidavit containing a bevy of counter culture mannerisms!! Arlo (Ben Stiller) presents a cogent case to Gregory Stark (Ryan O'Neal) that Daryl Zero's doggerel of accomplishments consists of numerous radical approaches and techniques which serve as a means of being the most effective method to \"cracking the case\"!! Desperate and annoyed by pecuniary depletion from a petty (yet stinging) series of blackmail tactics,Gregory Stark (Ryan O'Neal) is ready to give way to the unconventional!!! Consummation of this deal opens up the floodgates for an onslaught of nuances to surface which everyone in the movie becomes besieged with.. Daryl Zero's prescience is profound in his ability at pinpointing the perpetrator to this blackmail crime!! This film provides a precarious pontification to many different ideological premises for all parties concerned!! More importantly, it should be established that the trivial details and innate intricacies of everyone's sordid human nature, are far more significant to the plot of this movie, than the overall complications which pertain to this film's resonating end results!! The two OB's; observation and objectivity, guide Detective Zero in the direction of satiating his desires to resolve everything... This acute homogenization of deductive logic is what is referred to in this film as the \"Zero Effect\"!! This movie is loaded with talent, the writing is particularly well thought out, and the innovative genre to this film makes it intellectually gratifying to watch!!! All is well, but ends well, however, it is not manifested in the proverbially neon accented format that people are accustomed to when viewing a film with a happy ending.. Everyone's aggravated afflictions are related to their environment, and, Detective Zero's concluding jeremiad, which establishes a mandatory closure on the whole blackmail issue, winds up getting categorized accordingly!! That being said, let's put it behind us, it's over, so why not just go sky diving, or attend someone's funeral or something!! Extremely well made film. It is Crazy with a capital \"C\". I am very glad that I saw it!!!",
         "A lot can be said about the superb writing that this film contains. It is also very well acted. But one thing that has always shocked me is just how emotionally involving it is. Darryl Zero's budding relationship with the woman, Kim Dickens, is so well written and acted that I believed every moment of it. Kim Dickens' character goes through some very difficult situations, and they all work. Ben Stiller's problems ring true, also. And I'd like to point out that his girlfriend is the woman Bruce Campbell has to defend in S-Mart at the end of Army of Darkness. There are only a couple of criticisms I have of the film. The first ten or fifteen minutes seem to contain an entirely different style of comedy than the rest of the film. With Darryl Zero's horrendous guitar stylings and fridge full of TAB and tuna, I expected it to be an off-the-wall comedy or spoof of a detective film or something. The first time I saw the film, I was told how funny it was, and after I saw the ridiculous first ten minutes or so, I was constantly expecting the film to use slapstick and other such jokes. The film is funny, but if you go in expecting a comedy, or only a comedy, anyways, you're going to miss the emotional cues. Also, some of the discoveries and some of the trivia that Darryl Zero exhibits is a bit ridiculous. I mean, Sherlock Holmes, who was actually based on a real person, a college professor at Oxford, I believe, had amazing powers of deduction, but not even he could guess which bus Kim Dickens was going to tell her victim to get on. And I would also think that someone who does have the abilities that Darryl Zero supposedly has would never make up a job and tell that to one person, and forget that job and make a new one to give to someone else who frequents the same place as the first one!",
         "I didn't see this in theaters because most critics up here were dismissive of it, so I checked it out when it hit video and what I wanted wasn't available. I should have ignored the critics. Even if, like me, you're not well versed in Sherlock Holmes (which this film is inspired by), you should enjoy this movie. Bill Pullman is wonderful as Daryl Zero, who lives his professional life by the two \"obs; observation and objectivity.\" He's quirky without being overly eccentric, and he's very believable and touching. Ben Stiller is a nice foil as his front man. Kim Dickens proves after PALOOKAVILLE and this that she's a talent to watch. I even liked Ryan O'Neal, whom I'm not a fan of. I'm definitely looking forward to Jake Kasdan's next film; he looks like he may be as talented as his father."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Columbia Pictures Corporation",
         "Manifest Film Company"
      ],
      "summaries": [
         "Daryl Zero is a private investigator. Along with his assistant, Steve Arlo he solves impossible crimes and puzzles. Though a master investigator, when he is not working, Zero doesn't know what to do with himself. He has no social skills, writes bad music, and drives Arlo crazy. In his latest case, Zero must find out who is blackmailing a rich executive, and when his client won't tell him, why. The only problem with this case is Zero has done something he's never done before: got emotionally involved.",
         "Daryl Zero is an enigma. In his personal life, he is a paranoid, anti-social recluse whose sole interaction is with his business associate. In his professional life, he is the most famous and best private investigator in the world who can command any fee he desires. His anti-social behavior extends to his work, which means that all his transactions are conducted through his exasperated representative and sole field agent, former lawyer Steve Arlo, who often wonders if it is worth working for who he considers a total freak for the price of his sanity. Zero can often solve his cases from the comfort of his own home using his extraordinary powers of deduction - which he attributes to two associated \"obs\": objectivity and observation - but when he is required to do field work, he always does so incognito, he convincingly assuming whatever role required. His latest client is Portland based timber baron Gregory Stark, who is being blackmailed ($700,000 which Stark has thus far paid out, with no end in sight to the payments), with the blackmailer also having stolen a key to Stark's safety deposit box. Stark refuses to disclose the nature of the supposed dirt the blackmailer has on him, or the contents of the safety deposit box, which he states has no bearing on the case. Arlo believes Zero is required to go to Portland himself to work on this case. Zero quickly finds out who the blackmailer is - a paramedic named Gloria Sullivan - but wants to find out the reason for the blackmail before Arlo divulges the information to Stark. In the process of finding out the reason, which takes a little longer than usual just because he is finding it difficult to read Gloria's motivations, Zero begins to lose one of his obs for the first time and brings into question if Stark or Gloria is the true victim. It also threatens to turn Zero into somewhat of a normal human being.",
         "Daryl Zero is a private detective. His latest assignment is a blackmail case involving businessman Gregory Stark. Zero's assistant, Steve Arlo is told little of the case by the client, but Zero sets up a sting operation to trap the blackmailer that leads him to Gloria Sullivan.",
         "Daryl Zero is a psuedonym taken by a paranoid genius. His ability to make observations and then relate them into facts is remarkable. He has curried this ability into a small fortune solving seemingly unsolvable detective cases in inhumanly short periods of time. He is no less than a private investigator savant. While his paranoia requires him to use a front man for all contact with his clientelle, he performs all the actual sleuth work himself, albeit undercover. His tortured relationship with his front man and his first romantic involvement, met while performing his investigations, both serve to distract him from solving a blackmail case. In a nice twist, he falls in love with a woman every bit the genius that Daryl is.",
         "Shifty timber tycoon Gregory Stark is being systematically blackmailed and the use of regular private detectives have proved ineffective. Stark decides to call upon the services of the renowned, reclusive Daryl Zero, supposedly the world's greatest detective. Stark is very surprised to find himself discussing the intimate details of the case with Zero's amiable associate Steve Arlo who explains Zero's propensity for never meeting with clients. Zero, using his two 'obs' of objectivity and observation, quickly discovers the identity of the blackmailer but continues the case in order to discover exactly why the seemingly ordinary Gloria Sullivan is attacking Stark in this fashion. As Zero becomes more engrossed in the case and, even worse for him, becomes personally involved with Gloria he is forced to decide between the blackmailer and his client!",
         "The world's greatest detective Daryl Zero aided by his associate Steve Arlo investigates a complex and mysterious case of blackmail and missing keys for shady tycoon Gregory Stark who is less than forthcoming about what is really happening!"
      ],
      "budget": 5000000
   },
   "movielensId": 1845,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-30",
      "dvdReleaseDate": "1998-07-14",
      "directors": ["Jake Kasdan"],
      "runtime": 116,
      "movieId": 1845,
      "title": "Zero Effect",
      "mpaa": "R",
      "actors": [
         "Bill Pullman",
         "Ben Stiller",
         "Ryan O'Neal",
         "Kim Dickens",
         "Angela Featherstone",
         "Hugh Ross",
         "Sarah DeVincentis",
         "Matt O'Toole",
         "Michele Mariana",
         "Robert Katims",
         "Tyrone Henry",
         "Aleta Barthell",
         "Tapp Watkins",
         "Wendy Westerwelle",
         "Lauren Hasson"
      ],
      "imdbMovieId": "0120906",
      "originalTitle": "Zero Effect",
      "genres": [
         "Comedy",
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["eSH8Y3h5j-g"],
      "plotSummary": "Daryl Zero is a private investigator. Along with his assistant, Steve Arlo he solves impossible crimes and puzzles. Though a master investigator, when he is not working, Zero doesn't know what to do with himself. He has no social skills, writes bad music, and drives Arlo crazy. In his latest case, Zero must find out who is blackmailing a rich executive, and when his client won't tell him, why.",
      "tmdbMovieId": 16148,
      "avgRating": 3.70055,
      "releaseYear": "1998",
      "numRatings": 2533,
      "posterPath": "/qmgUyhyJQwHzZ7ulaYCJLBon7gG.jpg"
   }
}