{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "violent husband",
            "id": 2320
         },
         {
            "name": "underclass",
            "id": 4042
         },
         {
            "name": "class",
            "id": 6069
         },
         {
            "name": "drug scene",
            "id": 6691
         },
         {
            "name": "addiction",
            "id": 6782
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "cult film",
            "id": 34117
         }
      ],
      "imdb_id": "tt0119792",
      "video": false,
      "title": "Nil by Mouth",
      "recommendations": [
         25476,
         33994,
         17300,
         57978,
         48885,
         41160,
         220854,
         17278,
         69040,
         17627,
         66488,
         22913,
         27857,
         139058,
         18803,
         127408,
         33988,
         23750,
         107321,
         77368
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe4411c3a368484e00da6f",
               "name": "Ray Winstone",
               "profile_path": "/kLh8zKA9M8dCOvr44dGdczxMoz4.jpg",
               "id": 5538,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Valerie",
               "gender": 1,
               "credit_id": "52fe4412c3a368484e00da73",
               "name": "Kathy Burke",
               "profile_path": "/vqCHCywlp7HfoKBW6ZzCuQmnJx9.jpg",
               "id": 37759,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00da77",
               "name": "Charlie Creed-Miles",
               "profile_path": "/2T4DYXNCDInWCfpxURVLQdKIgwK.jpg",
               "id": 8397,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Janet",
               "gender": 1,
               "credit_id": "52fe4412c3a368484e00da7b",
               "name": "Laila Morse",
               "profile_path": "/4xgBkYU7Y6iV3lq0wm1pKlWemHq.jpg",
               "id": 113523,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Kath",
               "gender": 1,
               "credit_id": "52fe4412c3a368484e00daa9",
               "name": "Edna Doré",
               "profile_path": null,
               "id": 72316,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Paula",
               "gender": 1,
               "credit_id": "52fe4412c3a368484e00daad",
               "name": "Chrissie Cotterill",
               "profile_path": "/gElwVefRTA1NbNhXPsagK1veIiu.jpg",
               "id": 113528,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Angus",
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00dab1",
               "name": "Jon Morrison",
               "profile_path": null,
               "id": 113529,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00dab5",
               "name": "Jamie Foreman",
               "profile_path": "/kjheuaxB6RBqBKIysWamFzor3OD.jpg",
               "id": 3543,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00dab9",
               "name": "Steve Sweeney",
               "profile_path": null,
               "id": 991,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Schmuddie",
               "gender": 2,
               "credit_id": "5967cf4592514132e1007367",
               "name": "Neil Maskell",
               "profile_path": "/12dDCWSE8GXrhnzHuaEWxNJFfrN.jpg",
               "id": 30433,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Peter, pool player",
               "gender": 0,
               "credit_id": "5967cf6892514132e1007383",
               "name": "Ronnie Fox",
               "profile_path": "/a2J5u7o4ORsEes25HRXqOArQwnv.jpg",
               "id": 76945,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00da81",
               "name": "Gary Oldman",
               "profile_path": "/tofLS5A6lBXNjeROGvgpfe2JwaT.jpg",
               "id": 64,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00da87",
               "name": "Gary Oldman",
               "profile_path": "/tofLS5A6lBXNjeROGvgpfe2JwaT.jpg",
               "id": 64,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00da8d",
               "name": "Gary Oldman",
               "profile_path": "/tofLS5A6lBXNjeROGvgpfe2JwaT.jpg",
               "id": 64,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00da93",
               "name": "Douglas Urbanski",
               "profile_path": "/pISbMb3NbOb6meKgl4GrKLp7hUo.jpg",
               "id": 113526,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00da99",
               "name": "Luc Besson",
               "profile_path": "/2TzRsqSx0xb1DK3HsEQKSXhRGcu.jpg",
               "id": 59,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00da9f",
               "name": "Eric Clapton",
               "profile_path": "/5Y9eRWlz7AMR4eofCm6OVSZkc1s.jpg",
               "id": 2585,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "52fe4412c3a368484e00dabf",
               "name": "Hilary Dwyer",
               "profile_path": "/2K6ptsGJjDzKqHzrB96WaWly2Ze.jpg",
               "id": 108641,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00dac5",
               "name": "Ron Fortunato",
               "profile_path": null,
               "id": 7492,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5967cff9c3a3687767007085",
               "name": "Adam Bohling",
               "profile_path": null,
               "id": 61578,
               "department": "Production",
               "job": "Unit Manager"
            },
            {
               "gender": 2,
               "credit_id": "5967d0389251413175007528",
               "name": "Michael Dreyer",
               "profile_path": null,
               "id": 23449,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5967d04cc3a3686f60007a84",
               "name": "Charlie Vogel",
               "profile_path": null,
               "id": 1795417,
               "department": "Crew",
               "job": "Post-Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5967d0bac3a368791a006fba",
               "name": "Finn McGrath",
               "profile_path": null,
               "id": 1767780,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5967d0e1925141329c007468",
               "name": "Mary Soan",
               "profile_path": null,
               "id": 1537557,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "5967d0f8c3a36875e9007672",
               "name": "Daniel Toland",
               "profile_path": null,
               "id": 553096,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5967d111c3a36875e900768b",
               "name": "Ken Tuohy",
               "profile_path": null,
               "id": 1541285,
               "department": "Directing",
               "job": "First Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "59de4c08c3a3686227087ff6",
               "name": "Brad Fuller",
               "profile_path": null,
               "id": 1106909,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.416576,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 21252,
      "vote_count": 47,
      "budget": 9000000,
      "overview": "The family of Raymond, his wife Val and her brother Billy live in working-class London district. Also in their family is Val and Billy's mother Janet and grandmother Kath. Billy is a drug addict and Raymond kicks him out of the house, making him live on his own. Raymond is generally a rough and even violent person, and that leads to problems in the life of the family.",
      "similar": [
         627,
         111,
         100,
         10474,
         8363,
         948,
         9352,
         115,
         319,
         39939,
         527,
         624,
         796,
         396940,
         429733,
         179144,
         23949,
         1696,
         8064,
         75761
      ],
      "original_title": "Nil by Mouth",
      "runtime": 128,
      "poster_path": "/hZEviFHmShyAqz4hvbNOj6gmGh5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "SE8 Group",
         "id": 5507,
         "origin_country": ""
      }],
      "release_date": "1997-05-08",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gary Oldman"],
      "runtime": 128,
      "synopsis": null,
      "writers": ["Gary Oldman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119792/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0NzIzMTAyOF5BMl5BanBnXkFtZTYwNzU1MTY5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ray Winstone, Kathy Burke, Charlie Creed-Miles | See full cast and crew »"],
      "reviews": [
         "This is far from an easy movie to watch and is not really a good definition of `entertainment' (although it is disturbingly compelling). It's got about as much hilarity as `Monster's Ball', `Dancer in the Dark' and `Requiem for a Dream'. There's not really a plot here. What we're looking at is a family in council housing - a poor, distraught family, torn apart by the people. Kathy Burke is Valerie, the long suffering wife of Ray (Ray Winstone). Ray is a drunken abusive man, haunted by his demons. He fights regularly with Valerie's heroin addicted brother, who cannot escape his own life style. Over this watches Valerie's mother, Janet, in a resigned fashion, lost to any real hope of something different. We get to spend some time with these characters, seeing how their lives develop. Unlike traditional movie structures we're not really building to a giant convergence of plot lines, a climatic final scene. Real life is not like that - it's a series of events, marked by occasions. This is the view the movie takes and it works well because it makes it far more credible than a final showdown involving a gun and a murder. What's even more interesting is that while Ray is `bad' he could not be quite considered evil - there's a darkness in him that he's fighting against. There's a great scene involving a telephone which brilliantly highlights how torn apart these characters are and how nothing is ever quite as simple as you would like to believe. The acting is astonishing. I can't praise either Burke or Winstone enough. One of the reasons this movie is so unnerving is that the characters are believable - and this is due to the actors behind them. When Winstone's face becomes animated with range it really seems like he is ferocious, full of venom. You would race across the other side of the street from him, seeing the fury inside this man. Burke herself could have just played the demure wife but she adds far more complexity. Yes she is suffering, but there's a great hint of steel beneath her - shown in the delivery of a dialog, or the turn on a face. By not distracting us with pretty faces, director Gary Oldham manages to deliver actual characters. The energy - unflinching - delivered by them makes them seem horribly like people you know can exist within miles of your home. Oldham himself shows a good directorial view. The movie uses a lot of hand-cameras (and presumably some unusual film stock) to get a grittier realism. This is aided by some excellent cinematography - the lighting is bleak, subdued, in keeping with the movie. Even the sunshine is pale, as if there's never really any hope to be had. The sound design is crisp, and generally minimalist - instead letting the camera and acting tell the story rather than forced manipulation via a composed piece. The set design also deserves a nod - the house around which a lot of the movie resolves has a real `lived in' feel. Too often Hollywood directors décor their house in a few luxury sofas and leave it at that. Here there's a real sense of a home with condiments and grit engrained in the walls. It all adds up the power. Ultimately though it is Oldham's unflinching depiction of the events that stands in the movies favour - the camera is close, it's there, you cannot escape through some banal metaphor (which is typical of most movies). `Nil By Mouth' is more of an `experience' movie. It's a wrenching, arresting viewing that is sometimes very difficult to watch because you know there's a horrible shade of truth to it. It's not necessarily something you'd watch repeatedly (unless you've a shade of masochism to you), but it is something that will leave a little indelible mark on you as something to muse on. Definitely worth seeing - but be prepared. 8.1/10.",
         "The words \"gritty\", \"British\" and \"drama\" usually and rightfully condemn a film to the Guy \"Windsor\" Ritchie hall of excrement . Having seen these terms applied to Oscar contenders like \"Goodbye Charlie Bright\", \"Rancid aluminium\" and \"Love, honour and obey\", I wasn't really expecting much from this film. Saying I was wrong would be a huge understatement. \"Nil by Mouth\" is an awesome achievement. A razor sharp dissection of a working class south London family that delivers the required punch on so many levels that you need to have a wash after watching it. It covers a vast spectrum of emotions that will see you (especially if you're British) laugh, cry and more often than not, hold your head in despair at witnessing an all too true account of what it is to be at the bottom of the British class system. It is unflinchingly brutal and somewhat depressing, yet at the same time shows how with guts, determination and a healthy sense of humour, people can survive even the most bleak and hopeless of situations. Kathy Burke is outstanding and Ray Winstone is dependable as ever, but Gary Oldman's screenplay and direction are the stars of the show. This script could stand on it's own as a fine social commentary on par, and not dissimilar from John King's \"The Football Factory\" and \"Headhunters\". Thankfully Oldman has also realised that in terms of direction, \"gritty\" does not have to mean the static, cold and quite frankly boring as hell style that so many British films have. The camera moves with a documentary feel energy, yet the slick cinematography keeps it from ever looking cheap. Quite simply one of the greatest British films of all time. 9/10",
         "In Sturges' classic \"Sullivan's Travels,\" a swank film director announces to his butler: \"I'm going out on the road to find out what it's like to be poor and needy, and then I'm going to make a film about it.\" The butler snorts: \"It you permit me to say Sir, the subject is not an interesting one. The poor know all about poverty, and only the morbid rich would find the topic glamorous.\" Love it or hate it, Nil by Mouth digs deep inside and never lets you go. Unlike Sullivan, Oldman had only to look inside himself to find his subject. He does an honest and remarkable job. Of course a film of this type is not going to win any Oscars - Oldman didn't make it to please anyone. Most will find this nihilistic and depressing, and they're right. Suffice to say, Oldman is a natural craftsman. If he continues to follow his heart and gut, who knows what else he might accomplish. A remarkable debut.",
         "This is hellish domestic drama from director/writer Gary Oldman. It feels real because, for him, it was real, it was his life growing up in South London. Ray Winstone as the abusive Ray is amazing, as is Kathy Burke as Ray's wife and full time punching bag Valerie. Oldman employs a rough and ready style and gives the actors lots of room to move and react within the frame. The result is an incendiary experience, a film that leaves you gasping for fresh air and in awe of the superb performances, sharp cutting, great sound design and unapologetic subject matter. It doesn't angle for simple solutions to its powerhouse issues and isn't all misery, either. It's about strength and the the power of personal responsibility. Superb.",
         "I have a very hard time watching this movie. This is not a movie to put in for a relaxing night at home, as its very painful to watch. This is reality. These are situations that are happening right now in homes across the world. This movie is extremely powerful in its portrayal of a working class British family, as the struggle with problems such as drug and domestic abuse. The acting is simply amazing. It practically transcends acting and you feel that you are watching real people struggle through these things. Its a reality show in which the people don't know they're being watched. This film is a tough journey to take, as its very painful and emotional, but it is ultimately rewarding to sit through it and reach the conclusion. Very highly recommended, but be warned, this movie pulls no punches and shows you life as it is.",
         "I WAS (allegorically) the Lil girl on the stairs watching it all, this film had me in tears literally, if you have been lucky enough NOT to have lived through this kind of abuse, rock on, but for those of us who have been there this is a shockingly accurate depiction, I cried all the way through (I used to have every Monday off school to get a new set of false teeth for my mother). This film is so close to the heart it is unbelievable, and I am only padding this out to make the minimum review length why should i need 10 lines of text why should i need 10 lines of textwhy should i need 10 lines of textwhy should i need 10 lines of textwhy should i need 10 lines of textwhy should i need 10 lines of text",
         "This is a piece of debutant film making at its best. Oldman set about to create a gritty and colourful portrayal of the rough end of life in Saafff Lhaandan and in that respect he was f**kin sucessfull you bunch ah chaaaants! The camera work is disjointed and initially appears clumsy, but the expertly chosen angles and focuses soon become enthralling. It is nicely gritty and rough around the edges. Take a special note of the excellent sound design - it really adds to the overall atmosphere of the cityscape Olman so expertly creates. The narrative progression is pretty much non-existent. Like all realist films its not really about what is happening, but the broader issues exposed by smaller events within the film. These include some brutal moments from Winstone and also some heavy drinking/clubbing binges. The acting is so good and so believable that I forgot I was watching a film - it is almost a documentary and those not familiar with the actors within the film may be fooled into thinking that is what they were watching. Olman also introduces some subtle symbolism (the moment with the red balloon for example) but is never heavy handed or distracting. Winstone and Burke really are stunning in this film, and the ending is a brilliant piece of ambiguity and hope. CHeck out Winstone's subtle touching moments with his daughter - it brings a tear to the eye. Classic in the modern sense of the word.",
         "I liked this films' authentic look. I have middle class friends who describe this film as \"depressing\". To me it was uplifting. It was great to see all these working class characters, even the horrible one, portrayed with a feeling of dignity and sincereness. Not your average plastic movie. Real life, real emotions. I liked it, because it at last portrayed the life of the modern underclass with realism. The characters take over the story in this film, so if you like that, take a look. Thank you, Gary Oldman.",
         "Kathy Burke portrays the battered wife extremely well - taking it as part and parcel of being an east-end wide-boy's other half. It is inenvitable that she will go back to him (Ray Winstone) after her severe beating as that's the life she knows and as she holds traditional family views of marriage she wants her child to be raised by a mother and a father. She believes in love.The extended family plays a major role in supporting her, her mother (Leila Morse) is a hardened woman but with a heart. They are not shocked by the going-ons of the destruction caused by alcohol and drug addition. They just get on with it and this is a powerful message that with family, love and support, you can conquer any mountain.People see it as a depressing and disturbing film but the final gestures and actions of all the characters suggest otherwise. Gary Oldman has done a great job in directing this film and it was brave of him and his sister to tackle a very difficult subject which has obviously affected their lives so deeply.",
         "this film is incredibly harsh. it took a while for me to get into it - accent barrier and a little too close to reality make it a tough one to watch. but it really is a great film - horrifying and depressing. i don't think i could ever watch it again, it is too hard. kathy burke is great as is her terrifying husband. cheers to gary oldman for doing good quality work."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "SE8 Group",
         "EuropaCorp"
      ],
      "summaries": ["The family of Raymond, his wife Val and her brother Billy live in working-class London district. Also in their family is Val and Billy's mother Janet and grandmother Kath. Billy is a drug addict and Raymond kicks him out of the house, making him live on his own. Raymond is generally a rough and even violent person, and that leads to problems in the life of the family."],
      "budget": 9000000
   },
   "movielensId": 1846,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-05-08",
      "dvdReleaseDate": "2003-12-23",
      "directors": ["Gary Oldman"],
      "runtime": 128,
      "movieId": 1846,
      "title": "Nil by Mouth",
      "mpaa": "",
      "actors": [
         "Ray Winstone",
         "Kathy Burke",
         "Charlie Creed-Miles",
         "Laila Morse",
         "Edna Doré",
         "Chrissie Cotterill",
         "Jon Morrison",
         "Jamie Foreman",
         "Steve Sweeney",
         "Neil Maskell",
         "Ronnie Fox"
      ],
      "imdbMovieId": "0119792",
      "originalTitle": "Nil by Mouth",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["_BsPLaS0ksg"],
      "plotSummary": "The family of Raymond, his wife Val and her brother Billy live in working-class London district. Also in their family is Val and Billy's mother Janet and grandmother Kath. Billy is a drug addict and Raymond kicks him out of the house, making him live on his own. Raymond is generally a rough and even violent person, and that leads to problems in the life of the family.",
      "tmdbMovieId": 21252,
      "avgRating": 3.53528,
      "releaseYear": "1997",
      "numRatings": 326,
      "posterPath": "/3H3lsEnlskAVjA2l3JMSFPmYsAG.jpg"
   }
}