{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sword",
            "id": 1938
         },
         {
            "name": "prince",
            "id": 3071
         },
         {
            "name": "camelot",
            "id": 3966
         },
         {
            "name": "viking",
            "id": 5895
         },
         {
            "name": "princess",
            "id": 7376
         },
         {
            "name": "knight",
            "id": 10466
         },
         {
            "name": "king",
            "id": 13084
         },
         {
            "name": "excalibur",
            "id": 177128
         }
      ],
      "imdb_id": "tt0119947",
      "video": false,
      "title": "Prince Valiant",
      "recommendations": [28482],
      "backdrop_path": "/6halxGW0s21XvK3WPlxykJZ7FIO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Prinz Eisenherz",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1bd",
               "name": "Stephen Moyer",
               "profile_path": "/h8z7sJVA4txhKvuvfLeomhOdmAJ.jpg",
               "id": 32203,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Princess Ilene",
               "gender": 1,
               "credit_id": "52fe4448c3a36847f808d1c1",
               "name": "Katherine Heigl",
               "profile_path": "/jK74TisptrF6dg6E1V9DOEZacRz.jpg",
               "id": 25541,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Thagnar",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1c5",
               "name": "Thomas Kretschmann",
               "profile_path": "/sAGn557s6oJ74SycAV2DPb26Vqn.jpg",
               "id": 3491,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "King Arthur",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1c9",
               "name": "Edward Fox",
               "profile_path": "/iNk3GvWMWm37PjsidHY9M6Unmwm.jpg",
               "id": 9126,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Sligon",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1cd",
               "name": "Udo Kier",
               "profile_path": "/sTNpaKOBNi7WUJw7jPDrsbGAL4O.jpg",
               "id": 1646,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Morgan Le Fey",
               "gender": 1,
               "credit_id": "52fe4448c3a36847f808d1d1",
               "name": "Joanna Lumley",
               "profile_path": "/2RFXqaFpeN9WmhfAyNaumz0rZUV.jpg",
               "id": 34901,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Boltar",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1d5",
               "name": "Ron Perlman",
               "profile_path": "/xZyrXT2iEmSOokQRc1hedmxrbTi.jpg",
               "id": 2372,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Pechet",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1d9",
               "name": "Warwick Davis",
               "profile_path": "/4LjgmjD9nKOgL3gGRhIS5EkI0a.jpg",
               "id": 11184,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Prince Arn",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1dd",
               "name": "Ben Pullen",
               "profile_path": null,
               "id": 48968,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Erik the Old",
               "gender": 0,
               "credit_id": "52fe4448c3a36847f808d1e1",
               "name": "Walter Gotell",
               "profile_path": "/1VZFqeruev1IQBIKmUpgo5DGBA9.jpg",
               "id": 6610,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Prince Gawain",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1e5",
               "name": "Anthony Hickox",
               "profile_path": "/tWAG2uZS9B9QTSzZJRTgWHFlbOs.jpg",
               "id": 48965,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Sir Kay",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1e9",
               "name": "Zach Galligan",
               "profile_path": "/u06Txf30YaDkr0qENUbSp4DGab3.jpg",
               "id": 16170,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Sir Eckar",
               "gender": 0,
               "credit_id": "52fe4448c3a36847f808d1ed",
               "name": "Hamish Campbell-Robertson",
               "profile_path": null,
               "id": 48969,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Tiny",
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1f1",
               "name": "Marcus Schenkenberg",
               "profile_path": null,
               "id": 48970,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "King Thane",
               "gender": 2,
               "credit_id": "52fe4449c3a36847f808d213",
               "name": "Gavin O'Herlihy",
               "profile_path": "/brFrEXHx5vaeWJmqhQJMEaZhUHl.jpg",
               "id": 12660,
               "order": 15
            },
            {
               "cast_id": 29,
               "character": "Stable Boy",
               "gender": 0,
               "credit_id": "52fe4449c3a36847f808d21b",
               "name": "Chesney Hawkes",
               "profile_path": null,
               "id": 590480,
               "order": 17
            },
            {
               "cast_id": 30,
               "character": "Sergeant Rollins",
               "gender": 2,
               "credit_id": "57ac47e292514157ee000ae3",
               "name": "Maldwyn Lloyd",
               "profile_path": null,
               "id": 1664563,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1a7",
               "name": "Anthony Hickox",
               "profile_path": "/tWAG2uZS9B9QTSzZJRTgWHFlbOs.jpg",
               "id": 48965,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4448c3a36847f808d1ad",
               "name": "Hal Foster",
               "profile_path": null,
               "id": 48957,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1b3",
               "name": "Michael Frost Beckner",
               "profile_path": null,
               "id": 21203,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1b9",
               "name": "Anthony Hickox",
               "profile_path": "/tWAG2uZS9B9QTSzZJRTgWHFlbOs.jpg",
               "id": 48965,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a36847f808d1f7",
               "name": "David Bergeaud",
               "profile_path": null,
               "id": 21418,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4449c3a36847f808d1fd",
               "name": "Roger Lanser",
               "profile_path": null,
               "id": 48971,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4449c3a36847f808d203",
               "name": "Alexander Berner",
               "profile_path": null,
               "id": 1851,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4449c3a36847f808d209",
               "name": "Lee Ann Groff",
               "profile_path": null,
               "id": 48972,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4449c3a36847f808d20f",
               "name": "Carsten H.W. Lorenz",
               "profile_path": null,
               "id": 19657,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.580999,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 6264,
      "vote_count": 11,
      "budget": 0,
      "overview": "An Arthurian legend of young Prince Valiant, son of the King of Scandia. After the King is exiled by an evil leader, the Prince travels to Camelot to secure the aid of King Arthur in helping restore his family to power and prevent a plot by the Black Knight.",
      "similar": [
         10882,
         809,
         762,
         808,
         810,
         38319,
         6520,
         10144,
         11224,
         1417,
         10674,
         82702,
         10140,
         10020,
         37430,
         274857,
         150689,
         10191,
         2270,
         224141
      ],
      "original_title": "Prince Valiant",
      "runtime": 91,
      "poster_path": "/vU52RklOeJjPeXlOUbfNFf4FFFi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Celtridge",
            "id": 55103,
            "origin_country": ""
         },
         {
            "logo_path": "/53JWq1rzbAXzbh1rnFo3XdqsAUh.png",
            "name": "Constantin Film Produktion",
            "id": 5755,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Babelsberg Film",
            "id": 19481,
            "origin_country": ""
         }
      ],
      "release_date": "1997-07-24",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "He who holds the sword, rules the world.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Hickox"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Hal Foster",
         "Michael Frost Beckner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119947/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzg5ODQwMzc5MF5BMl5BanBnXkFtZTcwODY2NTA0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Stephen Moyer, Katherine Heigl, Thomas Kretschmann | See full cast and crew »"],
      "reviews": [
         "\"Prince Valiant\" is, apparently, based upon a comic strip, although I must confess that I had never heard of it before seeing the film. The story is set in Arthurian Britain. The king's magic sword Excalibur has been stolen by a gang of Vikings from the kingdom of Thule, so Valiant, a young squire, is sent to recover it. On the way he falls in love with the beautiful Princess Ilene (a name which can be pronounced either as \"Eileen\" or \"Elaine\", depending upon which character is speaking) and discovers that he himself is in fact none other than the long-lost heir to the crown of Thule, which has been usurped by the current incumbent, the villainous Thagnar. The Arthurian legends have not always transferred well to the cinema screen. In recent years we have had the decidedly average romance \"First Knight\" and the decidedly below-average epic \"King Arthur\". \"Prince Valiant\", however, falls so far below average that it almost falls off the bottom of the scale. It is not a would-be epic along the lines of \"King Arthur\", but rather a sword-and-sorcery adventure along the lines of \"Conan the Barbarian\", \"Red Sonja\" or (to take a more modern example) \"The Scorpion King\". Stephen Moyer makes a particularly dull hero, acting as though he were recovering from a serious charisma bypass operation. Katherine Heigl makes a pretty but equally uncharismatic heroine as Eileen/Elaine; on the evidence of this film she may have had the looks to succeed as a Hollywood star, but not the talent, so I was rather surprised that she has gone on to star in successful television series and films like \"Gray's Anatomy\" and \"Knocked Up\".Edward Fox, who stars here as Arthur, is a talented actor who should have known better than to sign up for rubbish like this. The one exception to the generally low standard of acting is Joanna Lumley, still splendidly seductive in her fifties as Arthur's evil half-sister Morgan Le Fay, but this only made me wonder why Joanna, who is one of Britain's most popular television actresses, seems to make so many bad choices when she ventures into the cinema. There have been occasional exceptions, such as her cameo in the excellent \"Shirley Valentine\", but too many of her films have been awful ones- \"Don't Just Lie There, Say Something\" and \"The Satanic Rites of Dracula\" are other examples. Even worse than the standards of acting are the action scenes and special effects. The fight scenes were all clumsily handled and those alligators were ludicrously unconvincing. The storyline was often confusing and difficult to follow and the lighting was so gloomy as to make me think that the film-makers were interpreting the phrase \"Dark Ages\" absolutely literally. \"Prince Valiant\" is billed as a British/Irish/German co-production, which only goes to show that there is at least one field, the tenth-rate fantasy epic, in which the European film industry can hold its own against American competition. I can only assume that the film's European origins were the reason that it was overlooked for a well-deserved Razzie nomination. 2/10",
         "I liked the panoramic artwork which is very like the painstakingly done quarter of a quarter broadsheet spread frames of the syndicated Sunday comics supplements of the '50s. The special effect used to make those artworks seem to melt into reality is awesome. This is rarely, if ever, done now because of economies of print production and advertising. That, by the way is one of the reasons, the cartoonist responsible for the hugely popular Calvin and Hobbes, quit making the offbeat funny series. The Valiant here is a very competent knight unlike the one portrayed by Robert Wagner in the 1954 film who was nothing short of a bumbling fool who managed to have accidents just when he seemed to be getting the upper hand (e.g. losing his hold on a cliff as he was espying the traitorous transactions of the Black Knight with Norse marauders). Only the superb acting of James Mason as the villainous Black Knight made that older version interesting. The fight scenes in this Prince Valiant were well executed. Kudos to the arms master for the handsome suits of armor and weapons. The actress who portrayed Princess Ilene is stunning.",
         "Beautiful sets, great costumes and makeup. Run of the mill script. Mediocre acting. Bad special effects and stunts,and bad film-editing. The special effects were truly terrible. Just stop-the-movie awful. Alligators that don't move and clearly are not alive. One alligator, clad in plate mail (huh?), shoots vertically out of the water into the air and descends down onto the stonework beside the water, where it doesn't move -while characters run about, pretending to be fearful of the clearly-lifeless, unmoving armor-clad alligator. And lots of characters swinging Tarzan-like on ropes, slamming feet first into the villains. Except the actors are clearly hanging on ropes being moved by an overhead crane. And the ropes move slowly, as if there was great concern on the set about hurting the actors. In these scenes the villain conveniently stands in one spot until the slow-swinging good guy finally collides with him. This isn't a one-time screw-up; the slow-swinging Tarzan-bit happens over and over again. The film editing is bad enough that it makes it hard to follow the story at spots. And the stunts and special effects kept blowing up the suspension of disbelief. There is plenty of no-brainer action, though, and high production values on the sets and costumes. This could have been fun if it was better made.",
         "This is one of those movies getting trashed by people without any good reason (just like Showgirls and Last Action Hero, which I both consider to be very entertaining movies). I've watched it a second time last night and was pleasantly surprised at how good it (still) is. The acting is pretty good. There are no major plot holes. The number one \"bad guy\" wasn't just some 1 dimensional asshole, but actually a well fleshed-out character, who was actually smarter (strategically) than the good guys. Also, he effects weren't bad at all for a movie with this kind of budget. And, another good reason for watching this, I got a good look at Katherine Heigl's bare ass. :) I wasn't bored for a single moment while watching Prince Valliant, and really what more could I ask for? All in all, a very enjoyable movie, and I highly recommend watching it.",
         "Spectacular adventure with a lot of colorful pageantry and old-fashioned action , concerning on King Arthur and Prince Valiant , though the movie falls short . It packs a non-sense blending of joky modern dialog and Dark Ages action , as the screenwriters don't get the appropriate touch . The whole cast is far too distinguished to be appearing in this sort of caricature of Medieval legends . It deals with King Arthur who governs in the legendary citadel that is Camelot . His Knights of the Round Table commit acts of derring-do and spend their spare time jousting and enjoying feasts . There young orphaned Valiant (chubby Stephen Moyer) is the squire to Sir Gawain (the same director Anthony Hickox) , one of King Arthur's (Edward Fox who steals the acting honours) knights . He is given the task of escorting princess Ilene (Katherine Heigl who is inappropriate here , holding an excessive ironic tone) to her home in Wales and naturally the young twosome fall in love . Meantime , the sword Excalibur has been robbed by Viking king usurper (Udo Kier) , an evil tyrant , and villainous leader Thagnar (Thomas Kretschmann). Then Ilene gets kidnapped and it's up to Prince Valiant to rescue both Ilene and Excalibur . As young Valiant set off to save princess away from risks and of course rides into it . As Valiant brushes aside bangs and journeys to Thule to look for his lover . There Valiant along with a group of outlaws (Warwick Davis , Ron Perlman) attack the Viking stronghold . This is a Medieval tale with adventures , full-bloodied action , unspeakable dialog , villainy , terrific jousting , romance and heroism in the grandeur of Scope although in television set loses splendor . The movie displays breathtaking battles , being ambitious in scope with epic confrontation and a striking final climax for a mortal duel . Handsome story , being regularly written and contains some awkward narrative elements . Excellent settings , monumental castles ,outdoors and tournaments or jousts are well staged . However this spectacular film never takes off as it should despite pomp and circumstance showed , so you'll be excited and embarrassed alternately . In any case , filmmaker does some breathtaking set pieces and the attack of a Viking castle colorful and vividly thrilling . This is the classic story of romantic adventure come to life enriched by glamorous color and impressive battles . Wooden protagonist duo , Stephen Moyer and Katherine Heigl , both of whom future TV stars with ¨True Blood¨ and Grey's anatomy¨, respectively . Supporting cast is frankly good though wasted , employing such notorious players and not building them roles with which to make a considerable impact , as the screenplay never give them a chance , there appears great stars as Edward Fox , Ron Perlman , Joanna Lumley as Morgana Le Fey , Walter Gotell's last final and Thomas Kretschmann who wields an ax with vigour . The movie was re-cut by the German producers, while the director was away on Christmas vacation. They wouldn't fly him back to Germany to finish the film. Four key scenes setting up its humorous tone and all religious aspects were removed. This is another attempt to literally transfer a comic-strip about the Arthurian saga to the screen , the first and the best was ¨Prince Valiant¨(1954) by Henry Hathaway with Robert Wagner , Janet Leigh , Victor McLagen , Donald Crisp , Sterling Hayden and Debra Paget . Other movies on the matter of legends of Arthur resulted to be : (1953) the classic ¨Knights of the Round Table¨ (by Richard Thorpe) , the musical ¨Camelot¨ (Joshua Logan), the fantastic ¨Excalibur¨ (John Boorman) , ¨First Knight¨ (Jerry Zucker) and recently ¨King Arthur¨ (Antoine Fuqua) . The picture will appeal to aficionados with chivalric ideals and epic movies fans , it is a passable production that will lose much on small television screen . .",
         "These nice, unpretentious movies should get better press when compared with junk AAA+ budget kolossals. Someone complains about the 'cartoon strips' inserted here & there in the movie...they didn't delight me, either...but I guess it was a way scriptwriters had to signal they were filming the adaptation of a COMIC STRIP...and in turn another poster here complains they haven't read the story at all... I find this movie just fine. I won't write about it in my memories, but it's DEFINITELY better than many AAA+ actors/AAA+ budget productions...at 1/12 the cost. Of course you don't have Kenneth Branagh, Lawrence Olivier or Katherine Hepburn here, but they aren't needed, either. It is the next rendition of ages old fairy tales made of sorcery, supernatural swords, pretty princesses in distress and apprentices on a quest, who discover they are the long lost sons on good kings murdered by evil tyrants. Photography is good; locations are good; acting is satisfactory, for this kind of movies...(not JULIUS CAESAR with John Gielgud ); the storyline is also good. It helps remembering that people who harshly criticize these modest movies in favor of high-fidelity to whatever 'spirit of the thing' wouldn't be the first to sit through a classic theatre play. To watch at least once.",
         "Surprisingly good with quality acting, including up and coming beauty, Katherine Heigl.Adventures of a squire pretending to be a knight escorting a beautiful princess home,while the rest of England is about to go to war with the Scots over the stolen sword, Excalibur.Valiant and Princess Ilene soon discover that the Vikings are the true culprits in the larceny of Excalibur.Certainly won't boor you, but still has a predictable outcome.",
         "this was a lovely film on a great cartoon. It completely delivers in full. Stephen Moyer played I fantastic Valiant, and I like the modern edge on the princess. Joanna Lumley made an evil Morgan Le fay come to life.It was funny, had plenty of action and just the right amount of romance. I thought it was cool and well worth watching. I'd recommend it to anyone Jaivien@hotmail.com",
         "For fans of Harold Foster's Prince Valiant it is a bit disappointing, but very suitable for children. Despite his homo haircut the original Valiant is very masculine, philosophical, and smart. He does not perform foolish acts or show inability with the sword, ever. In the movie he looks too young, shy, messy and foolish. The cast is inadequate, the camera trembles and the fight scenes are unacceptable... but again, not for the children, there are nice places to be viewed causing the correct time effect. There are not enough elements to make a good movie, lacks of art direction, continuity, actor performance and specially edition. The movie was pretty bad edited. Beside the gorgeous naked back of the princess coming out of the bad, the castles, the open air scenes make a very pleasant environment worth to be seen. Ron Pearlman's performance is great as usual but do not save the picture. Maybe i would like too much to see this movie under the view of Ridley Scott, stronger characters, something more close to the original personality and the meaning of Prinz Eisenherz.",
         "Romance is not dead yet. In Prince Valiant romance and adventure is very much alive. I highly recommend this to everyone in the mood for comedy, adventure, romance, and fantasy. I hope you will enjoy it as much as I did."
      ],
      "genres": [
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": [
         "Constantin Film Produktion",
         "Babelsberg Film",
         "Celtridge"
      ],
      "summaries": ["In a time now lost in the mists of memory, the great King Arthur rules in the legendary citadel that is Camelot. His Knights of the Round Table commit acts of derring-do and spend their spare time jousting, much to the delight of the local citizens and especially to Princess Ilene, a guest at Camelot. Watching her from afar is a young, inexperienced squire called Valiant, and when the young Welsh princess is sent home to marry Prince Arn, Valiant contrives to accompany her masquerading as Sir Gawain. Meanwhile, the evil sorceress Morgan le Fey, sister to King Arthur, has convinced the tyrannical Sligon, ruler of the Viking kingdom of Thule, that he should steal Arthur's sword, the powerful and magical Excalibur, knowing that its loss could bring about Arthur's downfall. So into the fray comes Sligon's unstable and psychotic brother Thagnar, who manages to steal the sword. Pandemonium reigns. But Valiant is having problems of his own - kidnappers attempt to steal away the Princess, and after various skirmishes, including one with a mysterious character who lives in a cave and purloins treasure, women and other things of value, Valiant manages to return the Princess to her homeland - although he also manages to have a duel with the Princess' jealous fiancé, Prince Arn. All things converge as Valiant is finally informed of his heritage by the stranger from the cave... Boltar of Thule. He informs the lad that he is Prince Valiant, rightful heir to the kingdom of Thule, and with his help, Valiant returns to the land of his birth to rightfully claim what is his."],
      "budget": 0
   },
   "movielensId": 1849,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-07-24",
      "dvdReleaseDate": null,
      "directors": ["Anthony Hickox"],
      "runtime": 91,
      "movieId": 1849,
      "title": "Prince Valiant",
      "mpaa": "PG-13",
      "actors": [
         "Stephen Moyer",
         "Katherine Heigl",
         "Thomas Kretschmann",
         "Edward Fox",
         "Udo Kier",
         "Joanna Lumley",
         "Ron Perlman",
         "Warwick Davis",
         "Ben Pullen",
         "Walter Gotell",
         "Anthony Hickox",
         "Zach Galligan",
         "Hamish Campbell-Robertson",
         "Marcus Schenkenberg",
         "Gavin O'Herlihy",
         "Chesney Hawkes",
         "Maldwyn Lloyd"
      ],
      "imdbMovieId": "0119947",
      "originalTitle": "Prince Valiant",
      "genres": [
         "Adventure",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An Arthurian legend of young Prince Valiant, son of the King of Scandia. After the King is exiled by an evil leader, the Prince travels to Camelot to secure the aid of King Arthur in helping restore his family to power and prevent a plot by the Black Knight.",
      "tmdbMovieId": 6264,
      "avgRating": 2.35714,
      "releaseYear": "1997",
      "numRatings": 56,
      "posterPath": "/vU52RklOeJjPeXlOUbfNFf4FFFi.jpg"
   }
}