{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0130019",
      "video": false,
      "title": "I Love You, Don't Touch Me!",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Katie",
               "gender": 0,
               "credit_id": "52fe48a89251416c750af0ef",
               "name": "Marla Schaffel",
               "profile_path": null,
               "id": 1000950,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Ben",
               "gender": 2,
               "credit_id": "5357adfbc3a3685601002ab1",
               "name": "Mitchell Whitfield",
               "profile_path": "/xvLWnBsTbUmW9KcDkH7pvi5W6v0.jpg",
               "id": 19505,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Richard Webber",
               "gender": 2,
               "credit_id": "52fe48a89251416c750af0f7",
               "name": "Michael Harris",
               "profile_path": "/eKUvQvW9VlSfw2MSHBRphF8xrf6.jpg",
               "id": 98950,
               "order": 2
            },
            {
               "cast_id": 1,
               "character": "Janet",
               "gender": 1,
               "credit_id": "52fe48a89251416c750af0e5",
               "name": "Meredith Scott Lynn",
               "profile_path": "/xs7Z9eymnmNu8Z1Wab9U3ccxepn.jpg",
               "id": 151384,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lou Candela",
               "gender": 2,
               "credit_id": "582f3260c3a3683e2c0046b6",
               "name": "Jack McGee",
               "profile_path": "/jSl2RKRaJvtRoS3T5HSw4xeNdwy.jpg",
               "id": 10489,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jones",
               "gender": 2,
               "credit_id": "582f3269c3a3683eda004304",
               "name": "Darryl Theirse",
               "profile_path": "/f9G34HNIscaPu74OamkFyfeX2dd.jpg",
               "id": 157405,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mom",
               "gender": 0,
               "credit_id": "582f32729251417f8c0042a2",
               "name": "Julie Ariola",
               "profile_path": "/tfecEx72CKtsN2Ry2lm6kK6QJyY.jpg",
               "id": 1219831,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "582f327bc3a36844b100d226",
               "name": "Nancy Sorel",
               "profile_path": "/eeQRBmJDEBZWvFNJgGSA4M1gAAZ.jpg",
               "id": 74366,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "582f328fc3a3683fa6003e6d",
               "name": "Julie Davis",
               "profile_path": "/tVU970tt5og2GQCvAwGGTc5nNNV.jpg",
               "id": 87033,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Ben's Dream Date",
               "gender": 1,
               "credit_id": "582f329d92514102070043f1",
               "name": "Shannon McLeod",
               "profile_path": "/1IEQeoYDINVgds7QooivB9o1JGJ.jpg",
               "id": 1291648,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe48a89251416c750af0eb",
            "name": "Julie Davis",
            "profile_path": "/tVU970tt5og2GQCvAwGGTc5nNNV.jpg",
            "id": 87033,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.067442,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 90414,
      "vote_count": 1,
      "budget": 0,
      "overview": "The story of a 25 year old virgin girl, looking for the right boyfriend, not realizing that \"the one\" has been next to her for many years.",
      "similar": [
         258480,
         370663,
         401898,
         12793,
         10735,
         27586,
         244772,
         3981,
         858,
         112160,
         634,
         437557,
         17130,
         10818,
         43923,
         250124,
         513,
         11634,
         141,
         297762
      ],
      "original_title": "I Love You, Don't Touch Me!",
      "runtime": 86,
      "poster_path": "/bpAvWB2rP2fHPLGmYN5IEMEnOkB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-01-21",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Just Your Typical Boy-Loves-Girl Who Doesn't Love Boy Till He Loves Other Girl Story",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julie Davis"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Julie Davis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0130019/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MTk0MDk2N15BMl5BanBnXkFtZTYwMTA5Mjg5._V1_.jpg",
      "actors": ["Stars: Marla Schaffel, Mitchell Whitfield, Michael Harris | See full cast and crew »"],
      "reviews": [
         "I can't believe there are people out there that don't like this movie. It's great! I saw it on a lark and it's wormed it's way into my heart as being among my top 10 favorites. A lot of people compare Julie Davis to Woody Allen. Yes, that's true. But I also think she's a lot like Susan Seidelman. If you've ever seen Smithereens or Desperately Seeking Susan, you'd know what I'm talking about. The film has it all-comedy, great singing and heartfelt emotion. Yes, a lot of what this girl says and does contradicts itself-but that's life and that's what makes this film realistic. This film has an independent feel and is not \"Hollywood\" at all. The ending is a little pat, but I forgive it that. I anxiously await Ms. Davis next movie! If you see this on cable, watch!!!!!!!!!!!!",
         "I turned this film on the other night on a pay channel and while I usually am a notorious channel surfer-I really stopped to watch this one. It is a typical story as the tag line indicates. We always don't love the one we \"should\" love, but you know, I think it's a \"typical\" story because it's one a lot of women, present company included, can identify with. I kept watching because I could really identify with this girl's conflicting feelings. And the topper to this film as far as I'm concerned is the star's voice. Iin the film she is a singer and she does a few numbers because she is auditioning. I was absolutely BLOWN away by her voice and by the beautiful songs she sang. If for this reason only, watch! A real treat!",
         "This is an original comedy from a woman's point of view. The characters are all very real, not like in most movies where they feel written to be a certain way, here they seem like people who actually exist. Low budget, but still better than most romantic comedies out there. Good dialogue and great music.",
         "This romantic comedy has excellent characters and dialog, and interesting relationships. While some of the plot situations are familiar (guy in love with girl who's not in love with him), the writing really sets this film apart from others of its genre.",
         "..but not quite. A clever look at contemporary relationships, focusing on a young, virginal woman who refused to compromise herself to the rest of society's one-nighter sex standards. Filled with witty observations and dialogue alike, but the film still occasionally relegates itself to the licentious lifestyle it decries, which undermines the film and prevents it from scoring a direct hit. The ending is somewhat predictable but heartwarming nonetheless, save for the last sentence of dialogue. **1/2 out of ****.",
         "This movie was absolutely DELIGHTFUL!!! To me, the fact that the first-time young writer-director, Ms. Julie Davis, has not received greater acceptance (i.e. WORK) in Hollywood, is a veritable TRAGEDY of Wellesian proportions!!! (i.e. \"Wellesian\" as in \"Orson\") The same holds true for the lead actress, Ms. Marla Schaffel. I especially enjoyed reports that Ms. Davis was promoting this movie at the Sundance Film Festival by passing out underwear visibly imprinted with \"I Love You\", but also imprinted with an \"invisible\" glow-in-the-dark \"Don't Touch Me\". (What a WONDERFUL sense of humor!!) This movie beautifully captures the essence of our search for true, meaningful love, with all of its pitfalls and dead-ends. How anyone could fail to LOVE it totally escapes me. The fact that per one reviewer, it was based in part on Ms. Davis' actual life experiences, only ADDS to its fascination. I used this movie as a \"litmus test\" for prospective mates: I would rent it, show it to her, and if she didn't like it, the affair was OVER!",
         "Here's another of those comedy/dramas about a single twentysomething woman wondering why her relationships don't work and why her life isn't what she wants. If that doesn't sound like your type of film I'd stay away because if anything our heroine in this one seems a little more neurotic than usual. But if it does sound like your thing, stick with this one, it gets better as it goes along. Katie (Marla Schaffel) is 25 and conflicted, to say the least, about her desire to terminate her virginity. Writer/director Judy Davis leads us through all the ups and downs on her rocky road, and it's a mostly fine effort.",
         "Regardless of what some of the more jaded and pseudo sophisticated critics may say this little film is not only charming, but it has a significant message to impart. A woman, who believes that she should care enough about herself not to give her virtue away to any or every Tom, Dick and Harry, is faced with the dilemma that life is passing her by while she awaits the man of her dreams. She's 25 and has not yet surrendered her virginity despite the fact that she feels passionate about wanting to find someone who cares about her and who she cares about, too. Furthermore, the element of physical attraction must also be present, in the equation, otherwise she knows it just won't be right. One can blame Disney's romantic renderings, of the happily-ever-after prince and princess fairy tales, for the high standards this woman has. However, by the same token, morals enter into her viewpoint, as well, when dealing with married men who hit on her. She's simply an idealist who writes and performs music, with longing and intensity, about what she wants and doesn't want to have to settle for less than the beauty of true love. Experiencing one fiasco after another she begins to see how impossible the perfection she's seeking is to achieve. She learns the lesson: \"Be careful what you wish for,\" first hand. And it finally dawns on her that the man she was searching for is not the dramatically handsome, charismatic type, oozing with finesse and savoir-faire, but -instead- the somewhat nondescript and stalwart, supportive friend she's loved all along... The ensemble of actors are uniformly real and believable in their parts. Michael Harris, in particular, playing a famous composer who equates women with food, is very attractive and sensitively seductive as the engaging cad who deflowers the leading lady. The tunes and lyrics, to the songs Marla Schaffel sings, are soulfully written and performed movingly, with great pathos. I highly recommend this film to everyone who has ever yearned for love and for those who continue to do so.",
         "What happened to the end of this movie? Did the money suddenly run out? We're left hanging and there's no reasonable conclusion to the story. Had this unbelievable oversight been corrected, the movie could have merited at least another star, or perhaps two.",
         "The 1998 film, \"I Love You, Don't Touch Me\" should have changed it's name to \"I'm Garbage, Don't Watch Me.\" Despite this movie's flaws, it did manage to become, unquestionably, one of the worst films I have ever seen in my life...ever. Bad acting, horrible direction, and clichés every few lines of dialogue about the feminist female psyche make \"I Love You...\" not only bad, but painstakingly unwatchable as well. But hey, at least it had robotic, unfunny, campy dialogue working for it, right? Oh wait."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Big Hair Productions",
         "Westie Films LLC"
      ],
      "summaries": ["The story of a 25 year old virgin girl, looking for the right boyfriend, not realizing that \"the one\" has been next to her for many years."],
      "budget": 0
   },
   "movielensId": 1850,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-21",
      "dvdReleaseDate": "2005-08-23",
      "directors": ["Julie Davis"],
      "runtime": 86,
      "movieId": 1850,
      "title": "I Love You, Don't Touch Me!",
      "mpaa": "",
      "actors": [
         "Marla Schaffel",
         "Mitchell Whitfield",
         "Michael Harris",
         "Meredith Scott Lynn",
         "Jack McGee",
         "Darryl Theirse",
         "Julie Ariola",
         "Nancy Sorel",
         "Julie Davis",
         "Shannon McLeod"
      ],
      "imdbMovieId": "0130019",
      "originalTitle": "I Love You, Don't Touch Me!",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of a 25 year old virgin girl, looking for the right boyfriend, not realizing that \"the one\" has been next to her for many years.",
      "tmdbMovieId": 90414,
      "avgRating": 2.95327,
      "releaseYear": "1997",
      "numRatings": 107,
      "posterPath": "/bpAvWB2rP2fHPLGmYN5IEMEnOkB.jpg"
   }
}