{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119508",
      "video": false,
      "title": "Leather Jacket Love Story",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Kyle",
               "gender": 0,
               "credit_id": "552afe95c3a368565f004430",
               "name": "Sean Tataryn",
               "profile_path": null,
               "id": 1453447,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Mike",
               "gender": 2,
               "credit_id": "552afead92514121d6001e4e",
               "name": "Christopher Bradley",
               "profile_path": "/efLSQiHOkueOjVGu4muU26eYFKm.jpg",
               "id": 182600,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Ian",
               "gender": 0,
               "credit_id": "552afec6c3a3681f56005832",
               "name": "Geoff Moody",
               "profile_path": null,
               "id": 1453448,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sam",
               "gender": 2,
               "credit_id": "552afedcc3a368565f004440",
               "name": "Héctor Mercado",
               "profile_path": "/2BmyPcb1nh3Vtyq7flIBRqaL0WP.jpg",
               "id": 105106,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Madge",
               "gender": 0,
               "credit_id": "552aff1092514121d6001e57",
               "name": "Stephen J. McCarthy",
               "profile_path": null,
               "id": 1453449,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Charella",
               "gender": 0,
               "credit_id": "552aff239251417c290002ba",
               "name": "Erin Krystle",
               "profile_path": null,
               "id": 1453450,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Amanda",
               "gender": 0,
               "credit_id": "552aff34c3a36859cf0050c9",
               "name": "Craig Olsen",
               "profile_path": null,
               "id": 1389799,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Martine",
               "gender": 1,
               "credit_id": "552aff44c3a368565f004448",
               "name": "Mink Stole",
               "profile_path": "/ew1Ro2VvDR1YjaJAvO7ZjTNe7oK.jpg",
               "id": 9292,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Jack",
               "gender": 2,
               "credit_id": "552aff53c3a36859cf0050cc",
               "name": "Nicholas Worth",
               "profile_path": "/ohKOmHwBEyIrAUYSNQY2uNbSznN.jpg",
               "id": 100461,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Julian",
               "gender": 2,
               "credit_id": "552aff7bc3a36830d40012ce",
               "name": "Nicholas Worth",
               "profile_path": "/ohKOmHwBEyIrAUYSNQY2uNbSznN.jpg",
               "id": 100461,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Youth",
               "gender": 0,
               "credit_id": "552aff93c3a3681f56005896",
               "name": "Dennis Larkin",
               "profile_path": null,
               "id": 1453451,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Zana",
               "gender": 2,
               "credit_id": "552affadc3a36859cf0050d4",
               "name": "Daniel Escobar",
               "profile_path": "/sLo1FlkDNL53ItgrgR7vX9zdpit.jpg",
               "id": 143331,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Grandma",
               "gender": 0,
               "credit_id": "552affbf9251416b3e000409",
               "name": "Sophie Poster",
               "profile_path": null,
               "id": 1453452,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Mom",
               "gender": 1,
               "credit_id": "552affcfc3a36858d6004456",
               "name": "Arlene Golonka",
               "profile_path": "/70esvtnNyb5LYOdJQZaSRo3lV8K.jpg",
               "id": 22494,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Silver Lake Cafe Patron",
               "gender": 2,
               "credit_id": "5687028092514169d000bf5b",
               "name": "Nicolas Pajon",
               "profile_path": null,
               "id": 208056,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d469251416c75135ce5",
               "name": "David DeCoteau",
               "profile_path": "/nFOFizArK1Vwoo2v4HRKdKXJlrl.jpg",
               "id": 97618,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "552afe38c3a3683e52003e1b",
               "name": "David DeCoteau",
               "profile_path": "/nFOFizArK1Vwoo2v4HRKdKXJlrl.jpg",
               "id": 97618,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "552afe48925141265f0026b4",
               "name": "Jerry Goldberg",
               "profile_path": null,
               "id": 1453445,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "552afe60925141265f0026bb",
               "name": "Rondo Mieczkowski",
               "profile_path": null,
               "id": 1453446,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "552afe71c3a36830d40012b7",
               "name": "Rondo Mieczkowski",
               "profile_path": null,
               "id": 1453446,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.071819,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 188870,
      "vote_count": 2,
      "budget": 67000,
      "overview": "Kyle is 18, an aspiring poet hoping to find inspiration by moving to the arty Silver Lake neighborhood of LA, and maybe love too. On day one, he finds a funky coffee shop, where he hopes to do some writing, but instead meets an older hunk.",
      "similar": [],
      "original_title": "Leather Jacket Love Story",
      "runtime": 85,
      "poster_path": "/2lPg2KrCqkDCwOf1QsMlI1dXMaR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Here Studios",
            "id": 51084,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Leather Jacket Productions",
            "id": 51085,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Goldeco Pictures",
            "id": 51086,
            "origin_country": ""
         }
      ],
      "release_date": "1998-02-20",
      "vote_average": 9,
      "belongs_to_collection": null,
      "tagline": "A Twink Meets Hunk Romance",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["David DeCoteau"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "David DeCoteau",
         "Jerry Goldberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119508/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMzIxODEzMl5BMl5BanBnXkFtZTcwOTM2MjkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sean Tataryn, Christopher Bradley, Geoff Moody | See full cast and crew »"],
      "reviews": [
         "This is a low-budget, sweetly motivated gay romance, written, directed and seemingly 98% acted by amateurs. This is not a criticism, just a warning not to expect polish. The one total acting professional is Christopher Bradley, who manages to both anchor the film with his sexy Mike, and carry the film's message -true committed monogamous love conquers all - by being the only character in the film who must change in order for us to have a happy ending. Sean Tataryn, whose career in films was quite brief, sensitively plays the 18 year old poet, Kyle, who moves to Silver Lake to find that love. Mike, depending on your taste, is practically an icon of what a gorgeous, masculine, assured gay man should be. He is still immature, however, in that he's still actively promiscuous and even his \"mate,\" whether ex or on again-off again, is bored and tired of Mike's playing around. The twist here is that the 18 year old Kyle is more mature in his outlook on life than the more life experienced Mike, while still being the hopeless romantic. The eventual happy ending, whether plausible or not, gives one hope. Bradley gives his finest performance since his Vince Coll in MAD DOG COLL. Mike is sexy and assured on the surface and both confused and unsure inside. His smile melts at twenty paces. I can't imagine how the film would have fared, had another amateur been cast as Mike- probably would be dismissed and forgotten by now. It is Bradley's creation that lifts LEATHER JACKET LOVE STORY out of the mundane and into the winner's circle. He carries us with him and keeps us interested in the unfolding love story. There is nudity - full frontal - and it's very easy on the eyes. Both leads may thank Mother Nature. The sex is more of a turn on than most gay porn, so there's something there for everyone. If you're gay, check it out. If not, still see it, but have a gay friend to talk to afterwards. You're liable to have LOTS of questions!",
         "This is a very light, very fluffy movie. I enjoyed seeing the great bodies of all these guys and I thought the drag queens were very funny. What took me by surprise is the particularly good acting of the two leads who play Kyle and Mike. They were utterly convincing as two guys, one young and idealistic, the other older and a little cynical, who fall in love after a hot one night stand. Kyle is young and idealistic and believe in falling in love forever with just one person. Mike, who's dated alot, is cynical, but yet drawn to the sweetness of Kyle. There is a little tension along the way as Kyle is jealous when he sees that Mike has a roving eye. But in the end, true love wins out! I was extremely touched when the movie ended with these two beautiful men simply embracing each other with love in their faces. This is a really sweet movie for gays and for the others who'd like to believe in true love.",
         "See this movie if only for the hunks that appear in it. Written by Rondo Mieczkowski and directed by David DeCoteau, the story isn't really that much. Young wasp kid, Kyle, played by cutie Sean Tataryn, who lives to write poetry, moves into Silver Lake to find another life experience. He does just that by meeting Mike, a biker hunk, played by Christopher Bradley. They get it on right away and sparks fly on the screen when these two let loose. Bradley isn't lacking where it counts, believe me. And Tataryn is a close second. It totally turned me on. But then our hero is an innocent young boy believing in first love being the only love. While the biker is an experienced rover with eyes for many. However, Kyle gets under his skin, in more ways than one. And soon we see that there is a heaven after all. Supporting actors all seem okay in their roles. The three campy drag queens have some funny lines and play it to the hilt. There is the older queen and his [girl] friend at the Cafe who reads his work [very badly] with a touch of melodrama. And Kyle's friend that eventually leads him to the baths where we have some very hot scenes, including our hero being ravished by not two but four naked guys at the same time. There isn't a spot on his adorable body that gets overlooked. And let us not forget the stripper at the club that unveils his most spectacular assets. Oh my! But love wins out the night Kyle finally gets to read his poem. Of course, it's all about Mike. I give this movie high ratings because it's great fun and would be a nice icebreaker on a late first date.",
         "A sweet may-december romance between an ugly young poet and sexy well-hung biker into kink and of course, leather.There is a lot of nudity with well-hung muscular men and some very ugly smart ass young guys too.Thank God for Older men.The movie moves in two directions at once,featuring the wild sex that the older man is used to...There is a stripper with a nice body and lots of Uh hum....reason to be proud of his body.Then there is the sappy poetry the young kyle writes.A nice turn by the drag queens as defenders of the community and Mink Stole as usual steals the show.",
         "This movie is a charming, very sexy love story between a cute blond valley boy and an older leather biker type. It's a simple story, endearingly told and well directed. Sean Tatyran and Chris Bradley are excellent. The black and white filming gives the movie a nice arty house/50's feel. A rare film in which a gay relationship is treated with the same normality as a straight one.",
         "When you consider this was made in 1997, it was a rather ground breaking film. I enjoyed the story, the cast, and consider it a little gem of a work. I particularly liked \"Kyle\" - strong acting from a young beginner. The sex scenes are still amazing, and probably shocking for the day (1997). Sorry for those who prefer colour, but the mood of the film is perfectly suited for the film. Thoroughly enjoyable film. Well written, and strong cast including \"Kyle\". I enjoy Independent Film, and this is no exception. A hidden gem. If you're looking for a very re:watchable film this works! It's a charming, warm film. And never mind about the B&W :)",
         "I've just seen this film, 15 years after the event. It begins with the usual tedious clichés of gay-themed films: scene queens, bad drag and dull hunks. Once we get to see the young hero, a beautiful young actor by the name of Sean Tataryn, the plot evolves well. He falls for leather jacketed Christopher Bradley and the show goes from there. I see that one reviewer (who clearly needs glasses) thought the young man ugly. Dear God, he was one of the loveliest kids I've ever seen on the screen, more, he could act, turning in a sensitive and touching performance. I am truly sorry his career didn't develop.The film is a few beats better than most gay-themed films, and it was Sean who lifted it for me from a 4 to a 6.",
         "I have to admit, I have never been a big fan of romance films, gay or straight. This was what I would call a \"cute\" movie, the filmmakers did well on a low budget. It was just too predictable, as most romance films are. I rented it because I will watch anything Mink Stole is in. The three sassy drag queens were fantastic, and finally a movie with gratuitous male nudity!",
         "LEATHER JACKET LOVE STORY Aspect ratio: 1.37:1 Sound format: Stereo (Black and white) An aspiring young poet (Sean Tataryn) relocates from the Valley to LA's Silver Lake district where he's distracted by drag queens, sex clubs, gay bashers and a hunky older stud (Christopher Bradley) with whom he falls in love. Inspired by Jean-Luc Godard's MASCULIN-FEMININ (1966), David DeCoteau's ultra-low-budget drama is something of an acquired taste. After toiling in the lower echelons of the exploitation movie business (BEACH BABES FROM BEYOND, TEST TUBE TEENS FROM THE YEAR 3000, etc.), DeCoteau commissioned screenwriter/poet Rondo Mieczkowski to write the gay drama he had always dreamed of directing, and it took a year for the project to finally come together. But all good intentions are scuppered by threadbare production values (it was shot in 16mm black and white on a $60,000 budget) and a reckless shooting schedule (10 days), all of which is wholly characteristic of DeCoteau's directing 'style'. Furthermore, the central romance isn't remotely believable, because - at the risk of sounding crude and disrespectful - Tataryn isn't attractive enough to warrant all the attention (he was chosen for no other reason than his willingness to perform the nudity and sex scenes!), and he plays the character as little more than a socially awkward débutante, completely at odds with Bradley's experienced older guy, with whom he appears to have little in common. Howard Wexler's low-tech cinematography struggles to maintain the fairy tale ambiance suggested by Mieczowski's ambitious script, and as usual, DeCoteau allows too many dialogue scenes to continue well beyond the limits of endurance. Hilariously, the director has chided critics who trashed his 'feel-good' approach in favor of the 'heavy dramas' which he himself seems to dislike, refusing to countenance the idea that some viewers simply weren't taken by his amateurish scribble of a movie! There are minor compensations: Mieczkowski's script may be dramatically uninspired, but his dialogue is smart and colorful, and he manages to prick the bubble of pomposity which informs his company of eccentric Silver Lake characters. Similarly, the cast is a mixed bag of newcomers and cult favorites: Bradley is an experienced actor (\"Urbania\", \"Billy's Hollywood Screen Kiss\", etc.) and director of animated shorts (BACKSTAGE WITH LITTLE LORENZO), and he has the kind of dazzling good looks which can stop any movie dead in its tracks (his full frontal nude scenes here are genuinely impressive!). Exploitation fans will be surprised to see Nicholas Worth (THE LAST HOUSE ON THE LEFT) stealing the show as an ultra-theatrical gay poet - his poem-readings are a hoot! - while fashion model Geoffrey Moody makes his only screen appearance to date as Tataryn's best friend, a sluttish pretty boy with a penchant for rough sex. Indeed, Moody would have been an ideal choice for the lead role (he performs an enthusiastic sex scene around the film's midway point), were it not for his aversion to full frontal nudity, though this could have been accommodated without compromising the film's erotic potency. Joe Dallesandro was considered for a major supporting role, but he couldn't be found in time! Also starring Andy Warhol/John Waters favorite Mink Stole (PINK FLAMINGOS, DESPERATE LIVING) and veteran gay activist Morris Kight. Watch out for a truly memorable stripper (Dennis Larkin), and a hilarious cameo from Bob Prest as an irreverent doctor who pierces nipples and other body parts for a living!",
         "Kyle, an aspiring young (18) poet and knockout gorgeous falls for Mike who arrives with a friend on a motorcycle and wearing the leather jacket of the title. Kyle meets Mike in a cafe in Silver Lake. Their courtship/romance is sensitively portrayed while the director carries the viewer to the limit of tasteful eroticism. The others in the cast help to move the story along and provide opportunities for humor and philosophy. The Black and White photography could be better. It seems uneven at times. Color may have been nice but this provides an opportunity for imagination to play a role."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Leather Jacket Productions",
         "Goldeco Pictures",
         "Here Studios"
      ],
      "summaries": [
         "In this gay romantic comedy tinged with a bit of fetish, teen Kyle (Sean Tataryn) is a hopeful poet who, bored with his superficial life and West Hollywood friends, decides to move to the Silver Lake area of Los Angeles, an area which he thinks is edgier and more artistic. Just after moving, Kyle discovers a neighborhood coffee shop, where he is hoping to get his poetic juices flowing, but instead meets a motorcycle riding 30-year-old carpenter (Christopher Bradley). Will their one night stand turn into something more?",
         "Kyle is 18, an aspiring poet hoping to find inspiration by moving to the arty Silver Lake neighborhood of LA, and maybe love too. On day one, he finds a funky coffee shop, where he hopes to do some writing, but instead meets an older hunk."
      ],
      "budget": 67000
   },
   "movielensId": 1851,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-02-20",
      "dvdReleaseDate": "2003-02-04",
      "directors": ["David DeCoteau"],
      "runtime": 85,
      "movieId": 1851,
      "title": "Leather Jacket Love Story",
      "mpaa": "NR",
      "actors": [
         "Sean Tataryn",
         "Christopher Bradley",
         "Geoff Moody",
         "Héctor Mercado",
         "Stephen J. McCarthy",
         "Erin Krystle",
         "Craig Olsen",
         "Mink Stole",
         "Nicholas Worth",
         "Nicholas Worth",
         "Dennis Larkin",
         "Daniel Escobar",
         "Sophie Poster",
         "Arlene Golonka",
         "Nicolas Pajon"
      ],
      "imdbMovieId": "0119508",
      "originalTitle": "Leather Jacket Love Story",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Kyle is 18, an aspiring poet hoping to find inspiration by moving to the arty Silver Lake neighborhood of LA, and maybe love too. On day one, he finds a funky coffee shop, where he hopes to do some writing, but instead meets an older hunk.",
      "tmdbMovieId": 188870,
      "avgRating": 2.88889,
      "releaseYear": "1998",
      "numRatings": 18,
      "posterPath": "/2lPg2KrCqkDCwOf1QsMlI1dXMaR.jpg"
   }
}