{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "alan smithee",
         "id": 214956
      }],
      "imdb_id": "tt0118577",
      "video": false,
      "title": "An Alan Smithee Film: Burn, Hollywood, Burn",
      "recommendations": [
         28305,
         75454,
         98209,
         105401,
         49231,
         297727,
         26740,
         48490,
         18856,
         153998,
         24365,
         94540,
         112969,
         137528,
         280127,
         77785,
         91217,
         74006,
         27855,
         25088
      ],
      "backdrop_path": "/qRDcBSawVgHz6jQ4j6zSBWo9NL5.jpg",
      "revenue": 45779,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Jackie Chan",
               "gender": 2,
               "credit_id": "56784fcf9251411187000319",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Sylvester Stallone",
               "gender": 2,
               "credit_id": "5908e11fc3a368583b011ff3",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Whoopi Goldberg",
               "gender": 1,
               "credit_id": "595c1099c3a36825e8058ea1",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Alan Smithee",
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a71",
               "name": "Eric Idle",
               "profile_path": "/8bIEjD3ZNRdveo6avslTX6PB22U.jpg",
               "id": 10713,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "James Edmunds",
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a75",
               "name": "Ryan O'Neal",
               "profile_path": "/fTqIq5voXV1hQd3Ol4VtnUWy7j2.jpg",
               "id": 31070,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a79",
               "name": "Coolio",
               "profile_path": "/kzxoKNAq2hyfC9jdlKL9uxyphUy.jpg",
               "id": 35549,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a7d",
               "name": "Chuck D.",
               "profile_path": "/8h3r2hLmAomNFsFOkRK901oNyvE.jpg",
               "id": 61109,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Jerry Glover",
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a81",
               "name": "Richard Jeni",
               "profile_path": "/bCzgi4PBLf4TTllLP75YRqVykXn.jpg",
               "id": 53402,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Michelle Rafferty",
               "gender": 1,
               "credit_id": "52fe498fc3a368484e131a85",
               "name": "Leslie Stefanson",
               "profile_path": "/wOufWgSUAXgXaSuDWPEU4PhVZVT.jpg",
               "id": 21474,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Sam Rizzo",
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a89",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Ann Glover",
               "gender": 1,
               "credit_id": "52fe498fc3a368484e131a8d",
               "name": "Sandra Bernhard",
               "profile_path": "/nYCnCtbbWjrMsmbanQLGhRM3FXh.jpg",
               "id": 3664,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Myrna Smithee",
               "gender": 1,
               "credit_id": "52fe498fc3a368484e131a91",
               "name": "Cherie Lunghi",
               "profile_path": "/z4KvEdYUxhZyQZTAMZe8wgyTwok.jpg",
               "id": 20768,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Allessandra",
               "gender": 0,
               "credit_id": "52fe498fc3a368484e131a95",
               "name": "Dina Spybey-Waters",
               "profile_path": "/rA6gMWarWOpxUCFsfYFz4Gcok7o.jpg",
               "id": 56567,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Billy Bob Thornton",
               "gender": 2,
               "credit_id": "5908e1369251416492012641",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe498fc3a368484e131a61",
               "name": "Alan Smithee",
               "profile_path": null,
               "id": 55948,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a67",
               "name": "Joe Eszterhas",
               "profile_path": null,
               "id": 10492,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe498fc3a368484e131a6d",
               "name": "Arthur Hiller",
               "profile_path": "/irrSj7cAn2ByM7hhu2emkMdFOai.jpg",
               "id": 133259,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5735232ac3a368024c000678",
               "name": "Nancy Foy",
               "profile_path": "/blCkmS4dqNsbPGuQfozHE6wgWBw.jpg",
               "id": 4952,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.889724,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 78149,
      "vote_count": 13,
      "budget": 10000000,
      "overview": "Filmmaker Alan Smithee finds himself the unwilling puppet of a potentially bad, big budget action film which he proceeds to steal the reels and leave the cast and crew in a frenzy.",
      "similar": [],
      "original_title": "An Alan Smithee Film: Burn, Hollywood, Burn",
      "runtime": 86,
      "poster_path": "/bYk9C1vIsX127vNTmtGEFfBeTXB.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cinergi Pictures Entertainment",
            "id": 1504,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1998-02-20",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Arthur Hiller"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Joe Eszterhas"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118577/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MTk0MzAyNl5BMl5BanBnXkFtZTcwNjY3MTUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ryan O'Neal, Coolio, Chuck D. | See full cast and crew »"],
      "reviews": [
         "I disagree with the people here saying this is one of the worst films ever made. I'm somewhat of a connosieur of bad films, and that just isn't the case. It's competently put together from front to back, but the script definitely could have used another draft or two. At its worst, it's just unfunny, not mind-bendingly horrible as some would have you to believe. Certainly if you know nothing about the inner workings of Hollywood you won't understand the references and almost none of it will be funny. I'm sure there were lots of references I didn't understand -- I get the feeling people working in Hollywood would get more out of this movie than the rest of us. One odd reference is the repeated name of \"Michael Ovitz\" throughout the movie. It appears in the song \"I Wanna Be Michael Ovitz\" in the soundtrack, there's a \"Paging Dr. Ovitz...\" in the background in a hospital, etc. It's not quite clear what writer Eszterhas's feelings toward Ovitz are -- does he hate him or look up to him? Another thing I don't understand is why director Arthur Hiller felt he had to change his credit to \"Alan Smithee\", except that it's amusingly appropriate. Looking at the film, I can't imagine that it was changed too radically in the editing, except perhaps the ultra-acidic put-downs on the title cards that introduce new characters.",
         "This film is actually a rather intelligent, if cynical, satire of the shallow and idiotic nature of Hollywood. More cameos than you can shake a stick at. Ryan O'Neal is great as an amoral producer. Eric Idle is even better as an unfortunate director named Alan Smithee whose movie is corrupted by the studio. He wants to remove his name from the movie, but since Alan Smithee is the pseudonym used for directors who want to remove their name from a picture, he is out of luck and becomes... unbalanced. Very dry, but very amusing. If you liked Last Action Hero and Purple Rose of Cairo, you'll probably like this.",
         "Why did I buy this movie? Because several (British) friends of mine were discussing it passionately, declaring it a masterpiece satire full of wit and irony that Americans (and Germans) would probably never understand. And because the cast list looks like a dream collection of funny actors: Jackie Chan, Sylvester Stallone, Whoopi Goldberg, Eric Idle, Ryan O'Neall.... And then this. My friends were right. If there is any humour, I did not get it. The movie tells of film-editor Alan Smithee, who has been given a chance at directing for the first time. An action blockbuster of unseen proportions (and budget). Seeing this movie, I could not help suspecting that it depicts quite accurately what might have happened behind the set of \"M:I-2\", with a kind director being overrun by his star's and producer's egos. Unfortunately, the story isn't told linearly, but in flashbacks, and in interviews, and with the trailer for the blockbuster. It wants to be a mockumentary. Like \"Bob Roberts\". But it just isn't all that funny. And Eric Idle is wasted, as he only ever gets to run around screaming manically during most of the few scenes he has. To some it might be a classic. For me it was agonizing....",
         "If you are in the feature film industry, what makes this picture so funny is the close parody... some of the characters appear to be modeled on real people. It would not be too far a stretch of the imagination to believe that two of the characters are parodies of Peter Guber and John Peters of Sony Pictures. Read the true story of these two guys' careers, documented in the book, Hit and Run, then watch Burn Hollywood Burn again. You will probably find the film twice as entertaining as the first time you watched it. After having last watched the film 7 years ago, I bought the DVD this week because I wanted to see if I could grab the title track that I liked, and I also clearly remembered (and liked) the graffiti art that was drawn for the movie title. Once I got the DVD in my hands, though, I watched the film all the way through again, and enjoyed it every bit as much as the first time I saw it.",
         "I can't believe the negative quotes for this movie. Sure, it isn't the fastest paced movie in the world, but for sheer parody of Hollywood it works quite well. Especially the Whoopie, Stallone and Jackie Chan parts.",
         "I saw this movie like, three years ago on HBO, or something, and I thought it was awesome. So I decided to see what people on the net had to say about it, and I was shocked. Apparently everyone and there mother hates this film. I don't know why. Sure it's no masterpiece, but only a handful of movies are. When Roger Ebert said it was worst than Showgirls, he went too far. At worst, I expected reviews like 2/5 stars, or 4.5/10 points. Instead I got things like 0 stars, something I didn't even know existed. I could see people didn't like the way the actors looked at the screen (even though it was a mockumentary), or the way you can't care too much for any one character (even though it's a satire, in which society as a whole should look bad). The movie has an odd flow to it (is that bad?), which I found cool. I Don't see why people can praise films like \"Memento\" (which told a story in an unconventional way, just like \"Burn\"), or \"Spinal Tap\" (which has no real plot, just like \"Burn\"), and not give this movie, and at least average review. If you can find it, watch it and decide for yourself, don't take the word of these flakers and perpetrators.",
         "If you work in the film industry, you'll probably find it very funny. Or at least quite amusing. If you are employed in some other fashion, you will likely think this film ridiculous. It is not, however, in the same league as The Player or S.O.B. (from which this film seems to have \"borrowed\" one basic story concept).",
         "Real life director Alan Smithee is an editor by trade but is signed up to direct the action movie `Trio' starring Whoopi Goldberg, Sly Stallone and Jackie Chan. However when the producer's final cut leaves it, in Alan's opinion, a mess, he steals the master negative and runs. This documentary follows the story of what happens when a director is forced to watch his art turned into a poor money spinner. I hadn't really read the very negative reviews of this film before I watched it and am a little surprised by the strength of feeling from the majority of the critics. Having said that, I can understand why this film is so hammered \u0096 as it really isn't very good. It started well and I thought it had potential \u0096 it seemed that people were making fun of themselves and that it would be a good satire on the industry and in particular, studio execs. However after a certain point it doesn't really do very much other than be flabby, repeating, self indulgent and silly. After Alan actually takes his film and seeks refuge with the Brothers Brothers, the film is very messy and not very funny at all. The documentary approach had worked well up till this point but from here it was a strange mix of action and documentary. It gets increasingly silly and increasingly less clever and funny. It had a few laughs but satire is meant to be funny \u0096 not just taking easy pot shots with crude characterisations and jokes. I still maintain it had potential but it is a good idea crying out for a better script and director (I notice it is directed by Smithee \u0096 I don't know if that's a joke or if the real director really did disown it). So from a good idea it goes nowhere \u0096 the little touches are nice but the total plot is rubbish. In away it is both made worse and more bearable by the actors, who are a mixed bunch. Eric Idol is awful and he simply doesn't suit the material \u0096 watch the scene where he turns his hat sideways and says `cool' and you'll see what I mean. Chuck D should really have known better than to deliver a meaningless performance here \u0096 although I totally expect that from Coolio! However, Stallone, Goldberg and Chan are all quite funny and make fun of themselves quite well. O'Neal and colleague as the producers are quite good but are dumbly stretched to extremes for the sake of humour. For the majority of the cast there seems to be a problem gelling \u0096 it feels like every single person thinks they are in a cameo and thus add to the feeling of this not being a film so much as a cobbled together affair. The support cast is good for names but the quality of delivery isn't really that high. Overall I'd stop short of adding to the list of boots that have been put into this film, but I'd be lying if I told you I didn't feel like I'd waste 90 minutes \u0096 I do. It started with a good idea but the script was nowhere near sharp enough and the majority of the cast (certainly those required to carry the film and not just be cameos) are just not up to the job. Could have been a fun satire but instead is an unfunny messy affair that doesn't really have anywhere to go beyond taking easy shots at the producers.",
         "I am willing to bet that when the principle players in the making of AN ALAN SMITHEE FILM: BURN, H0LLYW00D, BURN got together and read the script they probably found it hilarious. But they were probably drunk, stoned or deep into jet lag at the time. But somewhere between that first reading and the film's release, someone surely must have sobered up and noticed just how badly this film fails to deliver. The film is bad not just because it is bad, but because it coulda/shoulda been pretty good. Joe Eszterhas's script is sophisticated and savage and full of inside jokes. The direction by Arthur Hiller/Alan Smithee cleverly juggles ideas and viewpoints. And most of the cast give credible performances, even the nonprofessionals who contribute cameos. Obviously, everyone thought they were making a pretty good movie. In the end, the film is smart and pointed and even insightful, but it is never, never, never, never even remotely funny. It is hard to pinpoint just why the film ends up being so depressingly blah, but a good guess would be that it is a matter of attitude. ALAN SMITHEE is just so insultingly smug. Everybody involved is basically making fun of themselves, but not in jovial, lighthearted way. The self-deprecation is condescending: \"See,\" they all seem to be saying, \"I called myself a bastard before you had a chance. Nyah, nyah, nyah!!! I beat you to the punch.\" I mean what is the point of self mockery if it is intended to belittle someone else? Even the most mean-spirited of satires require a degree of innocence; a posture that allows the audience to find the humor and the hypocrisy for themselves, rather than to have it force fed to them. For instance, the film's structure, basically a series of talking head interviews, demands that the interview blurbs seem spontaneous, not preprocessed and rehearsed. Hiller skillful stages these little snatches of interviews as though they are being given on the fly, in different places and at different times, but they still seem canned. Even the characters' insincerity should seem sincerely insincere, not like tossed-off one-liners at a Friars Club roast. Even though everyone involved is obviously in on the joke, they shouldn't appear to be. And a major inexplicable problem is the whole black thing the film seems to be doing. This is a satire about a British director and bunch of Beverly Hills/movie studio suits, so why does the film feature rap music, African-American themed title credits and references to black directors? Is black cinema supposed to be the new New Wave or avant-garde? Is it supposed to be like references to beatniks in the fifties and hippies in the sixties, a clumsy attempt to make the squares seem hip and to make the story seem relevant (when ultimately it will only make the film seem quickly dated)? The film can't fake sincerity, why do the filmmakers think they can fake soul? In the end, ALAN SMITHEE seems to be little more than a home movie, a gag reel to be played at the office Christmas party. If that were the case, I suspect that all involved would still find the material funny. But, what happens at the Christmas party should stay at the Christmas party, otherwise it can just be too embarrassing.",
         "I thought that this film was utterly hilarious. What a concept! Watching it late at night on Starz!, I woke my entire family up laughing. The actors are great, the documentary style footage is wonderful, but when it flashed \"Linguist\" under Jackie Chan's name, I lost it. 7 out of 10. Funny stuff, in the same ballpark as MST3K: The Movie."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Cinergi Pictures Entertainment",
         "Hollywood Pictures"
      ],
      "summaries": [
         "Director Alan Smithee comes to Hollywood to make a movie. Due to a variety of factors, he decides to disown it and direct it under a pseudonym. Unfortunately, the Director's Guild requires that if a director disowns a movie in this fashion, he *must* use the official Director's Guild pseudonym...which happens to be Alan Smithee.",
         "Acclaimed film editor Alan Smithee's dream comes true when Challenger Films contracts him to direct a new action-adventure, \"Trio.\" The fledgling filmmaker jumps at the chance to direct Whoopi Goldberg, Jackie Chan, and Sylvester Stallone. Little does he realize that he is but a puppet - the company president and executive producer have hired him just to pull his strings. From the first \"Roll 'em\" to the final cut, the bigwigs keep Smithee out of the loop. To his utter dismay, he finds his name attached to a monster-piece! What's more, he can't even hide behind a fake name because he really IS \"Alan Smithee,\" the pseudonym that disgruntled filmmakers use to replace their own on movies bad enough to destroy their reputations. In desperation, Smithee swipes the master reels and goes into hiding. Aided by the Brothers Brothers, black filmmakers replete with indie cred but short on major studio deals, Smithee faces the ultimate challenge: to negotiate an agreement to re-edit the movie in his own style, or burn the film and his own career along with it.",
         "When a rookie filmmaker with the unfortunate name Alan Smithee realizes he's an unwitting studio puppet, being forced to make a big-budget action film he knows is horrible, he steals the master reels and tries to make a deal."
      ],
      "budget": 10000000
   },
   "movielensId": 1853,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "1998-02-20",
      "dvdReleaseDate": "2004-04-06",
      "directors": [
         "Alan Smithee",
         "Arthur Hiller"
      ],
      "runtime": 86,
      "movieId": 1853,
      "title": "An Alan Smithee Film: Burn, Hollywood, Burn",
      "mpaa": "R",
      "actors": [
         "Jackie Chan",
         "Sylvester Stallone",
         "Whoopi Goldberg",
         "Eric Idle",
         "Ryan O'Neal",
         "Coolio",
         "Chuck D.",
         "Richard Jeni",
         "Leslie Stefanson",
         "Harvey Weinstein",
         "Sandra Bernhard",
         "Cherie Lunghi",
         "Dina Spybey-Waters",
         "Billy Bob Thornton"
      ],
      "imdbMovieId": "0118577",
      "originalTitle": "An Alan Smithee Film: Burn, Hollywood, Burn",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Filmmaker Alan Smithee finds himself the unwilling puppet of a potentially bad, big budget action film which he proceeds to steal the reels and leave the cast and crew in a frenzy.",
      "tmdbMovieId": 78149,
      "avgRating": 1.93195,
      "releaseYear": "1998",
      "numRatings": 169,
      "posterPath": "/bYk9C1vIsX127vNTmtGEFfBeTXB.jpg"
   }
}