{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "single parent",
            "id": 641
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "expedition",
            "id": 1963
         },
         {
            "name": "professor",
            "id": 1992
         },
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "circumcision",
            "id": 7540
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "jungle",
            "id": 10787
         },
         {
            "name": "anthropology",
            "id": 10983
         },
         {
            "name": "monkey",
            "id": 15149
         },
         {
            "name": "lecture",
            "id": 156181
         },
         {
            "name": "lost tribe",
            "id": 163088
         },
         {
            "name": "faked footage",
            "id": 172715
         },
         {
            "name": "hoax",
            "id": 173117
         },
         {
            "name": "papua new guinea",
            "id": 193173
         },
         {
            "name": "new guinea",
            "id": 208365
         },
         {
            "name": "circumcision ritual",
            "id": 216936
         }
      ],
      "imdb_id": "tt0120725",
      "video": false,
      "title": "Krippendorf's Tribe",
      "recommendations": [
         40562,
         38554,
         17745,
         21433,
         83489,
         18856,
         12312,
         48287,
         47608,
         23945,
         8986,
         33657,
         45225,
         9458,
         41779,
         42158,
         26258,
         13203,
         18417,
         18975
      ],
      "backdrop_path": "/4RIPoXAflLrfvWyDW16Tvkt6XEz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Prof. Krippendorf",
               "gender": 2,
               "credit_id": "52fe446a9251416c9100feb3",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Veronica",
               "gender": 1,
               "credit_id": "52fe446a9251416c9100feb7",
               "name": "Jenna Elfman",
               "profile_path": "/lY4pLueI0eMmgBXVfw5xw9jysHM.jpg",
               "id": 40279,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sulukim",
               "gender": 2,
               "credit_id": "52fe446a9251416c9100febb",
               "name": "Zakes Mokae",
               "profile_path": "/sxzqrmSm7Kd7eSHzos7UeiT0mke.jpg",
               "id": 47458,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lori",
               "gender": 1,
               "credit_id": "52fe446a9251416c9100fec5",
               "name": "Siobhan Fallon",
               "profile_path": "/wVFa8GiY0xdOLFsvGygy9RMtcBc.jpg",
               "id": 6751,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Shelly",
               "gender": 1,
               "credit_id": "52fe446a9251416c9100fec9",
               "name": "Natasha Lyonne",
               "profile_path": "/8rhl25eCPQQFhv1Mvqe9eMP3MpS.jpg",
               "id": 10871,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "52fe446a9251416c9100fecd",
               "name": "Gregory Smith",
               "profile_path": "/h13wfMQQrcyg98Gxg8Ult3vCSR9.jpg",
               "id": 20814,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ruth Allen",
               "gender": 1,
               "credit_id": "52fe446a9251416c9100fed1",
               "name": "Lily Tomlin",
               "profile_path": "/eVEt45q7QIEoZQwINx7RfTE6Sk6.jpg",
               "id": 10437,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Gerald Adams",
               "gender": 2,
               "credit_id": "52fe446a9251416c9100fed5",
               "name": "Stephen Root",
               "profile_path": "/sceCvLiv8xe2jQzrVn39wvosVHG.jpg",
               "id": 17401,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Irene Hargrove",
               "gender": 1,
               "credit_id": "52fe446a9251416c9100fed9",
               "name": "Elaine Stritch",
               "profile_path": "/4QGJE8HwbJXdb7MrsINR8zJtDzp.jpg",
               "id": 36802,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Abbey Tournquist",
               "gender": 1,
               "credit_id": "52fe446a9251416c9100fedd",
               "name": "Mila Kunis",
               "profile_path": "/6Lp9qPkMO740Hcp8NBYZZLWWvJF.jpg",
               "id": 18973,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Henry Spivey",
               "gender": 2,
               "credit_id": "52fe446a9251416c9100fee1",
               "name": "David Ogden Stiers",
               "profile_path": "/zngM0eXq6RuYZmdocsAY2AMKUja.jpg",
               "id": 28010,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5458bebfc3a36839a0001988",
               "name": "Todd Holland",
               "profile_path": "/47QCGbek61AJwlNIwCQYZ1OEIy4.jpg",
               "id": 1213162,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "562419299251413ded00090f",
               "name": "Charlie Peters",
               "profile_path": null,
               "id": 65401,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.734309,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31220,
      "vote_count": 33,
      "budget": 0,
      "overview": "After squandering his grant money, despondent and recently widowed anthropologist James Krippendorf must produce hard evidence of the existence of a heretofore undiscovered New Guinea tribe. Grass skirts, makeup, and staged rituals transform his three troubled children into the Shelmikedmu, a primitive culture whose habits enthrall scholars. But when a spiteful rival threatens to blow the whistle on Krippendorf's ruse, he gets into the act as well.",
      "similar": [
         278927,
         8065,
         600,
         13,
         157336,
         314095,
         11004,
         13363,
         181886,
         8741,
         245,
         284293,
         11237,
         1073,
         43949,
         340611,
         9975,
         65496,
         9062,
         29787
      ],
      "original_title": "Krippendorf's Tribe",
      "runtime": 94,
      "poster_path": "/4pnYmoz8TnxHOMQPk4FNGcjyJa0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1998-02-27",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "He's discovered the wildest tribe in his own backyard!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Todd Holland"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Frank Parkin",
         "Charlie Peters"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120725/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MzUzNDc2M15BMl5BanBnXkFtZTcwMTM4NTMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Dreyfuss, Jenna Elfman, Natasha Lyonne | See full cast and crew »"],
      "reviews": [
         "I laughed a lot at this film! I have always loved Richard Dreyfus, and Jenna Elfman plays her role in this movie with a Lucille Ball-like zaniness. Like Dreyfus she has the ability to play drama as well as comedy. I can't understand how some of the other reviews are so harsh. Maybe you need to know what to expect when you sit down to watch this movie. Don't try to take the story too seriously. For example, if you're an anthropologist in real life, don't try to compare it to reality. Separate yourself from your day job, and don't take the jokes personally. It is a wild and crazy movie that is no more about the real life field of anthropology than \"Scrubs\" is about medicine. Lighten up, have a beer, relax, and you will enjoy this movie. Slapstick comedy has its place in the entertainment field. Don't spoil it for the rest of us who still enjoy this genre.",
         "Dreyfuss has always been a master of high humor and KT is another enjoyable vehicle for it. Elfman is funny and vivacious, as well as lovely to look at. Both stars work well together. I laughed throughout; appreciating the movie for what it was meant to be: good comedy. I recommend this film for anyone wanting a lot of good laughs.",
         "I cannot disagree with the previous summary more. Whoever they are, they have no pulse! Just watched the movie last night with my family, and everyone had a great time - and laughed themselves silly. After a bit of a slow start, we find ourselves faced with one of the most inventive families ever - and one begins to lose track of how many lies have been told. The movie also lampoons fads in general. It is truly bizarre what can capture the public mindset, but when fashions are created upon a fictitious tribe, you know they've lost the plot. Jenna Elfman practically Xeroxed her Dharma character from Dharma & Greg, but she was more than welcome. Her charm and energy are infectious. Richard Dreyfuss was at his sarcastic best as well. And the Shelmickedmu? Hamamas! (If you want to know what that means watch the movie). It was a crying shame it was hard to find on DVD, but if you can pick up this gem, you won't regret it. And you'll find yourselves coming back for more.",
         "Krippendorf's Tribe has achieved something special, an incredible balance of fun and smarts accessible to all. There's a bit of exaggeration that will hold the interest of those who want primal fun, but little enough as not to displease those who do not want to be submerged by unrealistic situations. The intelligent humor of the dialogs and scenario will easily enthused those who need smarts to appreciate a comedy, but not so much as to rebuff those who do not want to work their brains to laugh. The acting is without reproach, even if a few of the secondary characters are a bit caricatured. The photography, soundtrack, and editing are as perfect as they are invisible, yet remarkable. The story is without logical flaw. A must see, easily enjoyable by anyone.",
         "I think this is a great film for anthropology students. It demonstrates many of the hypocricies that exist within academia as well as the types of pressures that many professionals feel within the field. I also think it's a great introductory example for anthropology students regarding ethics, structures of cultures, and the nature of our own culture (how we justify normally taboo items). I show it to my Introduction to Anthropology students every year. They laugh, they ask questions, and they appreciate the film. I recommend it. I've used it for years in Anthropology classes - I have students analyze the Shelmikedmud and come up with more cultural traits. I then follow by having them simulate the type of cultural creations that scifi writers do - creating their own alien cultures.",
         "If this movie can be accepted as is (a comedy), it is funny. If totally unbelievable plot and situations are ignored it can still be a laugher. A few of the better instances were Lilly Tomlin (?) in the jungle, the television interview, and the banquet scene.",
         "Dreyfuss at his manic best. This is literally one of a very few comedy films I've watched where I absolutely fell off of the sofa laughing. The funniest part of the movie is the filming of the fake tribe by Dreyfuss' character using a love interest who, being rendered involuntarily drunk, has no idea what is going on. Lily Tomlin adds greatly to the mix playing an uptight, administrative bore. The rest of the supporting cast, who are currently not especially well known actors, blends beautifully with Dreyfuss and Tomlin. The movie has great timing. The plot and characters are plausible enough to create an additional humorous dimension. I would rank this as one of the best movies Richard Dreyfuss has made to date. I would marry, on the spot, any woman who finds this movie as entertaining and funny as I do. As long as she is rich and beautiful, of course.",
         "Richard Dreyfus. An anthropologist creates a fake New Guinea tribe to further his career. This sounded like it would be painful to watch, and in some places, it is just that. but overall, this bears an endearing tone, and a genuine humor, which consistently colors the work, throughout. Dreyfus's character, Krippendorf, is a frantic/manic anthropologist who tries to seem as though he is calm and collected, on the surface of the deception he has laid. Dreyfus is a phenomenal actor, who needs another Jaws/Close Encounters to revitalize his career. I wonder if Spielberg is listening? His performances come off as direct projections from the heart, no matter how low the budget they allow him, or what horrendous costars they saddle him with. This work features a quirky story line with quirky subplots, and quirky characters, but none as enigmatic as Krippendorf himself. This is a great way to spend a couple of hours, but as a Disney movie? Disney rewrites known history to suit its ends, and usually does so with great panache, but the return to ethnocentrism is potentially damaging to the field of anthropology. However, if you can suspend belief, which you must do to enjoy any Disney movie, then you may find the enjoyment from it that I did, but as usual, I'm in the minority. It rates a 7.1/10 from... the Fiend :.",
         "University professor anthropologist James Krippendorf (Richard Dreyfuss) returns after failing to find the undiscovered tribe of New Guinea and the death of his wife. Veronica Micelli (Jenna Elfman) is an eager young professor and a fan of his work. She begs to join his team and he relents. Ruth Allen (Lily Tomlin) is a jealous rival. The university expects a lecture after giving him the grant. He decides to fake a tribe named Shelmikedmu for his children Shelly (Natasha Lyonne), Mickey (Gregory Smith) and Edmund to avoid jail time for misuse of grant money. Krippendorf is an unfunny grumpy character. The only thing remotely comical is his relative height to the towering Jenna Elfman. There are no good laughs for most of the movie. There are a few chuckles like showing the circumcision scene in the lecture. However the lie annoyed me for some reason. That diminished any fun from the comedy. It tries to turn into a screwball comedy but I don't actually like Krippendorf.",
         "I like Richard Dreyfuss, and he does not disappoint in \"Krippendorf's Tribe\". We get practically the same character he played in \"What About Bob\", only this time he is an anthropology professor instead of a psychiatrist. Both films display Dreyfuss's angst as regards the family unit. Both are comedies, although \"What About Bob\" is a far superior film. The problem with \"Krippendprf's Tribe\" is that it is essentially a one joke movie hung on an amusing, though not very believable hoax. The film gradually runs out of steam, and some judicious editing might have helped. Nevertheless for fans of Richard Dreyfuss, this is familiar and entertaining ground. - MERK"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Dreyfuss / James Productions",
         "Touchstone Pictures"
      ],
      "summaries": [
         "A university professor is paid to find the last undiscovered tribe of New Guinea. When he fails to find the tribe, he comes home, and rather than admitting that he's failed, he gives a lecture about the Shelmikedmu tribe (named after his children: Shelly, Mike, and Edmund) and then has his family dress like \"Shelmikedmus,\" so that he can film them as proof of his discovery.",
         "An anthropologist creates a fictitious lost New Guinea tribe using his family members to cover-up for his mis-use of grant moneys."
      ],
      "budget": 0
   },
   "movielensId": 1855,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-02-27",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Todd Holland"],
      "runtime": 94,
      "movieId": 1855,
      "title": "Krippendorf's Tribe",
      "mpaa": "PG-13",
      "actors": [
         "Richard Dreyfuss",
         "Jenna Elfman",
         "Zakes Mokae",
         "Siobhan Fallon",
         "Natasha Lyonne",
         "Gregory Smith",
         "Lily Tomlin",
         "Stephen Root",
         "Elaine Stritch",
         "Mila Kunis",
         "David Ogden Stiers"
      ],
      "imdbMovieId": "0120725",
      "originalTitle": "Krippendorf's Tribe",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["ZBqnBoQlD54"],
      "plotSummary": "After squandering his grant money, despondent and recently widowed anthropologist James Krippendorf must produce hard evidence of the existence of a heretofore undiscovered New Guinea tribe. Grass skirts, makeup, and staged rituals transform his three troubled children into the Shelmikedmu, a primitive culture whose habits enthrall scholars. But when a spiteful rival threatens to blow the whistle on Krippendorf's ruse, he gets into the act as well.",
      "tmdbMovieId": 31220,
      "avgRating": 2.28337,
      "releaseYear": "1998",
      "numRatings": 854,
      "posterPath": "/4pnYmoz8TnxHOMQPk4FNGcjyJa0.jpg"
   }
}