{
   "tmdb": {
      "original_language": "fa",
      "keywords": [
         {
            "name": "muslim",
            "id": 789
         },
         {
            "name": "driving",
            "id": 180307
         },
         {
            "name": "iranian new wave",
            "id": 209997
         },
         {
            "name": "tehran",
            "id": 232122
         }
      ],
      "imdb_id": "tt0120265",
      "video": false,
      "title": "Taste of Cherry",
      "recommendations": [
         97513,
         30017,
         42112,
         83761,
         16672,
         49964,
         26782,
         44065,
         216,
         37239,
         109398,
         125602,
         130314,
         40427,
         36877,
         4495,
         18333,
         25504,
         690,
         55848
      ],
      "backdrop_path": "/gWTgAJmTrVOFGPlS3WTfVTFLLTe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mr. Badii",
               "gender": 0,
               "credit_id": "52fe43f49251416c9100030b",
               "name": "Homayoun Ershadi",
               "profile_path": "/iJ7Oukp3TVfoTYdqkoVXg8ZEleJ.jpg",
               "id": 117528,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mr. Bagheri",
               "gender": 0,
               "credit_id": "52fe43f49251416c9100030f",
               "name": "Abdolrahman Bagheri",
               "profile_path": null,
               "id": 117529,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Soldier",
               "gender": 0,
               "credit_id": "52fe43f49251416c91000313",
               "name": "Afshin Khorshid Bakhtiari",
               "profile_path": null,
               "id": 117530,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The soldier",
               "gender": 0,
               "credit_id": "52fe43f49251416c91000317",
               "name": "Safar Ali Moradi",
               "profile_path": null,
               "id": 117531,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "The seminarian",
               "gender": 0,
               "credit_id": "52fe43f49251416c9100031b",
               "name": "Mir Hossein Noori",
               "profile_path": null,
               "id": 117532,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43f49251416c91000325",
               "name": "Ahmad Ansari",
               "profile_path": null,
               "id": 554586,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43f49251416c91000321",
               "name": "Abbas Kiarostami",
               "profile_path": "/bK2PXoGS1hcCzGd9OoIkTnJyEYX.jpg",
               "id": 119294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f49251416c9100032b",
               "name": "Abbas Kiarostami",
               "profile_path": "/bK2PXoGS1hcCzGd9OoIkTnJyEYX.jpg",
               "id": 119294,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f49251416c91000331",
               "name": "Abbas Kiarostami",
               "profile_path": "/bK2PXoGS1hcCzGd9OoIkTnJyEYX.jpg",
               "id": 119294,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f49251416c91000337",
               "name": "Homayun Payvar",
               "profile_path": null,
               "id": 554587,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f49251416c9100033d",
               "name": "Abbas Kiarostami",
               "profile_path": "/bK2PXoGS1hcCzGd9OoIkTnJyEYX.jpg",
               "id": 119294,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.993424,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IR",
            "name": "Iran"
         }
      ],
      "id": 30020,
      "vote_count": 92,
      "budget": 0,
      "overview": "A middle-aged Tehranian man, Mr. Badii is intent on killing himself and seeks someone to bury him after his demise. Driving around the city, the seemingly well-to-do Badii meets with numerous people, including a Muslim student, asking them to take on the job, but initially he has little luck. Eventually, Badii finds a man who is up for the task because he needs the money, but his new associate soon tries to talk him out of committing suicide.",
      "similar": [
         369655,
         369651,
         257678,
         369550,
         369709,
         369648,
         783,
         60243,
         107846,
         210479,
         21575,
         157849,
         46738,
         17295,
         375315,
         314634,
         1883,
         79777,
         26842,
         9882
      ],
      "original_title": "طعم گيلاس",
      "runtime": 95,
      "poster_path": "/ct8iXbyRXHnPtRMXWBP4eFfysgo.jpg",
      "spoken_languages": [{
         "name": "فارسی",
         "iso_639_1": "fa"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kanoon",
            "id": 11459,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Abbas Kiarostami Productions",
            "id": 2938,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CiBy 2000",
            "id": 7832,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-28",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Searching for the Reason to Live",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Abbas Kiarostami"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Abbas Kiarostami"],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0120265/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDcwMjI2NDc2OV5BMl5BanBnXkFtZTcwMjQzOTMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Homayoun Ershadi, Abdolrahman Bagheri, Afshin Khorshid Bakhtiari | See full cast and crew »"],
      "reviews": [
         "The film follows the ways of Mr Badii on what is probably the last day of his life. We can see him drive around in his jeep, in a wasteland near Tehran. He stops from time to time, in order to ask people if they would like to do a little job for him. But even the money he eagerly offers does not help him to inspire their confidence: People are on their guards against this queer middle-aged man, who is obviously just looking for a homosexual pick-up. It takes a whole while until he finally reveals his secret: He is determined to commit suicide and has already dug a hole in the earth where he wants his body to be buried. The only thing that worries him now is that he needs somebody to fill up his grave. Now that we know what he is after our interest must inevitably concentrate on the reasons for his death wish. But, strangely enough, none explanation whatsoever is offered. Such a contravention of audience expectation has led to a massive rejection of the movie. Even renowned critics like Roger Ebert find it \"excruciatingly boring\" and rather helplessly ask themselves whether it wouldn't help to know more about Badii. But doesn't the mere fact that, for most of the movie's running time, we just see a \"car driving in the wasteland\" give us a clue about its signification and therefore the answer we are looking for? This wasteland is a barren landscape, its dusty vastness inspires nothing but sadness. Its dryness is the opposite of life; fertility seems impossible in such an arid and joyless desert. It is therefore the ideal background for any suicide attempt. As we do not get any psychological information about Badii and the reasons for his death wish are not revealed, we must look for other means of expression. The significance of a true work of art is not necessarily to be found in explicit words. If the main character does not speak we therefore must have a closer look at the landscape that surrounds him in order to find a hidden meaning. In the first part of the jeep's journey we can only notice its utter desolation. Then, when Badii has finally found a man that seems to be willing to cooperate, a surprising change takes place: Green trees and bushes emerge and, along with the now audible twittering of birds, give sign of life. At the same time the man in the car, who only accepted Badii's offer because of economic reasons, sings life's praises in order to make Badii discover not only \"the taste of cherries\" but also renounce his suicide plan. The portrayal of landscape seems to reflect the inner state of the characters: the desolate hopelessness of a suicide candidate is followed by an uncompromisingly positive attitude to life. And, significantly, this replacement is actually provoked by the picked-up man, as it was him who told Badii to take the detour. The same contrast is also present in the penultimate scene. We see Badii lying down in his grave, and then the screen is invaded by complete darkness. This must definitely be the end, we feel, Badii's death wish after all has triumphed. But once again Kiarostami wondrously succeeds in surprising us. We hear the noise of rain, it is flooding down upon the dry wasteland. And although the movie in the end does not offer a clear answer, there is at least a ray of hope: This rain may come just in time to instil new life into a dried up human soul.",
         "One of the best films in the history of the big screen. Full stop. A man, preparing to kill himself for reasons we shall never be told, is looking for help. He won't find any by the army, for no manifestation of strength shall be able to solve any problem permanently. Nor will he find help under the wings of religion, based as it is on faith, a principle too abstract to heal concrete suffering. Help will come, instead, from nature, its colors and smells. An old man, who shared the same unhappiness as a youngster, shall show the aspirant has-been that nothing deserves such an extreme decision: even the sight of a happy couple crossing the road can change your attitude towards life. Shot on the bare but wonderfully colored hills of Iran, which often recur in Kiarostami's environments, I felt dizzy looking at the scene where the protagonist tries to foresee his underlife by projecting his shadow under a fall of sand and stones unloaded from a camion: this scene alone is worth the Oscar!",
         "My first taste of Kiarostami, whom I've read about for years. I was worried that, as a filmmaker, Kiarostami would be as inaccessible as Godard in the 80s. I was pleasantly surprised by A TASTE OF CHERRY. It's a linear narrative, and the film's early ambiguity concerning the driver's quest kept me guessing (I knew nothing about this film going in, which was a real plus). The film's unusual visual style, particularly the long unedited takes, works surprisingly well for this type of story. I can understand why traditional American filmgoers would be bored to tears by A TASTE OF CHERRY, but for fans of independent and foreign film, it's a worthwhile investment of your time. It probably works better with an older audience that can identify with the world-weary characters.",
         "Quiet and unassuming, Abbas Kiarostami's meditation on connection and charity has a lulling rhythm that becomes so hypnotic that any sudden movement--and there's only one--jolts you almost as much as a fright in a horror film. Kiarostami uses a simple cinematic style consisting of real-time long takes and basic cutting between two characters (the only conversations are between two people at a time) but his camera always seems to be in the exact place it needs to be, capturing both the close-up nuances of the actors and their smallness against the Iranian landscape. (Many of the exterior shots are of a lone Range Rover driving on the outskirts of an unnamed city.) The elegant story concerns a man (Mr. Badii, played with a haunting lyricism by Homayon Ershadi) wishing to commit suicide and trying to find someone who will assist him by arriving the next day to see if he is alive or dead. He selects only men he determines to be in a state of financial crisis and who are dedicated to their families or their religion and to whom payment will bring relief. Each man rejects the notion of suicide, representing, in turn, fear of the unknown, religious and moral conviction, and faith in the goodness of life; and although Mr. Badii gives no reason for his desire to die, irregardless of his unhappiness it's clear he wishes to return to the earth which has borne humankind. Kiarostami refuses to pass judgment against his gentle characters' decisions, giving each person respect and dignity even when they're unable to put their convictions into meaningful words: they're good men asked to assume an enormous responsibility they do not understand. The film concludes with subtle, beautiful ambiguity (we never learn Mr. Badii's fate and the coda is an odd excerpt of the filmmakers at work) and its power is a result of the reflection that comes afterward. A unique experience, not to be missed.",
         "I was prepared to dislike this film. Instead, I wound up fascinated. The state can't help Mr. Badii, the church can't help him...and even though nature, in the form of Mr. Bagheri, tries, we do not know if it succeeds. Absolutely fascinating. It shows that a director doesn't need $200,000,000 and a raft of special effects and explosions to make a good film. As for the shot-on-video ending, it's entirely possible that it's there to appease the Iranian censors. \"Look! Here's Mr. Badii! Alive and well. It's just a movie!\" Another subtle commentary on the state of affairs in Iran today, I'll wager. At least, that's how I chose to see it. It seems to me that the title reflects Douglas Adams' techniques for flying--fall, and then distract yourself so that you don't hit the ground. It's not that the taste of cherry makes life worth living, per se, it's that simple things can distract you from your cares. This movie was well-shot, well-directed, well-acted, and well-written. Highly recommended.",
         "Abbas Kiarostami has not only been critically lauded by film critics and theorists, but also by some of the greatest directors, from the late Akira Kurosawa and Atom Egoyan to the legendary 'Film God' Jean-Luc Godard. This is probably of his fresh use of ideas and spiritual/humanism way to directing and writing his films. His work, according to the director himself, is reminiscent of Andrei Tarkovsky (who had made the most spiritual films ever made), Hou Hsiao-Hsien, Theo Angelopoulos and Frederico Fellini (although I would also add directors like, Yasujiro Ozu) who want the audience to let the film live in their minds soons after, letting them fill some details of the story. This technique reminds me both of the short stories of Anton Chekhov and South-Asian Minimalism, such as the 'Palm-Hands Stories' of Yasunari Kawabata (Nobel-Prize laureate), where less is more. His methods of rubbing the line between fiction and nonfiction is an excellent way, a common theme in his films. Taste of Cherry is one of his best films (then again, I have only seen four of them). It is also very demanding, especially the ending, which might be a disappointment (he did made a alternate ending, though, without that video thing at the end, as an experiment in one festival screening). There are many things to notice in this film: (1) The helicopter sounds in the background (some spiritual metaphor?) (2) Earth and Naturalism (there's a lot of earth and dust in this movie, and the far shot of the grave reminded me of a painting by Manet). (3) The acting. The actor remainds almost stone-faced throughout the movie, again showing by concealing. Trivia: The actor, Mr. Badii, was not actually face-to-face with most of his passengers. For the first passenger, the soldier was face-to-face with Kiarostami himself for the whole segment (you never see Mr. Badii and the Soldier in one same shot). In fact, none of the passengers, at the beginning (except probably the taxonomist) knew that he was in a movie. Kiarostami revealed that only to them later (except for the soldier, who actually did ran off). The seminarian actually believed truly that Kiarostami was going to kill himself. Overall, this is an excellent movie. But, it is not the sort one can compare its quality with others (just like one cannot compare the works of David Lynch with others), since it has its own style to it. However, I was confused at one point when the taxonomist said 'Mulberry' instead of 'Cherry', but then again, perhaps he wasn't actually refering to the same thing.",
         "Kiarostami strikes again with another provocative film, very much in the same vein as his others: drawn out films that involve a very introspective soul-searching of all of the character's involved, and in so doing, finding some more meaning to the idea of what life is all about. From the beginning to the end, Kiarostami gives us a complex script of characters that we come into contact with, and as we learn about each one, we learn more about the idea of life. What makes the film very interesting for a Western viewer is that I find closer to Kiarostami's Iran after each of his films that I watch, and become more informed to it. We learn intimate details about the lives of several Iranians. Throughout the film I found that, although like many of his films it was quite slow-paced, it contained the extraordinarily rich dialog that is expected of a Kiarostami film. His films advance through their rich dialog while using the dusty Iranian landscape as their backdrop. I found a lot of the cinematography to be terrific, viewing the city from a distance and looking into the dusty foot-hills on the outskirts of Tehran. It is more than poetic to see a man at the end of his rope searching through the dust and faces of Tehran's poor laborers for answers about life and death. In many ways, the film is a large metaphor for the human state of affairs. The film culminates very well, and we all eventually find our own taste of cherry in the film. I always feel as if Kiarostami's films are a very philosophical experience, and are quite personal. In this sense, Kiarostami's films are amongst the best that I have seen. However, they are undoubtedly slower paced than other films, and they require the viewer to detach himself from any western stereotypes that he has about film. This would not be a good film for somebody expecting action or a typical Western film, but rather, this would be a film that I would recommend only to those who are in the mood for an insightful, philosophical film that shows an alternative view of life. Overall, it was an emotionally powerful film that will stick out in my memory as all Kiarostami films do.",
         "I have watched many films dealing with the theme \"life & death\". But this is the greatest one. The story is simple (even incomplete) but I think Abbas tells us too much. Through the dialogue between different people from different classes, everyone has his own attitude about \"life & death\". I think we can't say which is right & which is wrong. Abbas only gives it to us & let us think for ourselves. Every scene is simple & ordinary, but has a certain strange fascination. I have seen \"Through The Olive Trees\" before (also directed by Abbas). To be honest, I don't like it, although it's said to be a good film. But this one is different. \"Go see it\" is what I want to say.",
         "I watched the Criterion DVD a few days ago and I thought this film was incredible. It's amazing to me that such an incredible film could be made without the use of tracking shots, multiple camera angles, tilts, pans, and all the other camera techniques that most countries use in their films. Iran has a very young film industry that doesn't have the money or resources that many other film industries have. For what the Iranian film industry has at its disposal, this film is an exceptional achievement! This film is a great example of how the expression of human beings' feelings and ideas cannot be held back by censorship. Kudos to Kiarostami for creating a very heartfelt commentary on the effects of oppression on the human soul.",
         "This is film at its simplest: pure cinema. And then he pulls out the rug from underneath you. The director removes the event from the film, in doing so calls attention not to what the protagonist's action will be, but rather the reason for the action. Nor does he make the reason specific, though the concerns are human, universal, which transcends the specific. Foremost this film is about cinema, cinema and the what it means to be, to exist."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Abbas Kiarostami Productions",
         "CiBy 2000",
         "Kanoon"
      ],
      "summaries": [
         "Middle-aged Mr.Badii is planning to commit suicide and desperately seeks anyone to assist him - he has already dug out the grave in the mountains, but the assistant will have to bury him when he will do the deed. He asks Kurd soldier, Afghan seminarian, but everyone refuses by some reason. Finally he finds an old Turkish taxidermist, who has a sick son and previously attempted suicide himself, and he agrees to assist Badii.",
         "Middle aged Iranian Mr. Badii is searching for someone to carry out an unusual but well paying (200,000 tomans, the equivalent for most laborers of six month's wages) ten minute long job for tomorrow morning: go to a hole in a specified location, call his name twice, if he answers back, help him out of the hole, and if he doesn't answer, shovel twenty spadefuls of dirt on top of him. In other words, Mr. Badii is attempting to commit suicide and wants someone to bury him if he does. Mr. Badii is not looking for just anyone, but someone who seems trustworthy, that needs the money, and may be compassionate toward his goal. As Mr. Badii drives around the outskirts of Tehran looking for that someone, he has to take those he approaches to the precise location of the hole, and ultimately to broach the sensitive issue. Just as he has his own personal moral reasons for wanting to die, Mr. Badii learns that his potential candidates also have their own moral reasons for helping or not helping him.",
         "Well... Adding to what an anonymous user has mentioned... This film has no climax. The guy goes and sleeps in that hole and then you know nothing of the plot. Did he actually die to got off that hole later.. Did the old man came or not. What was the reason he wanted to die? or what made him change his mind he didn't die?... the end seems to left at user discretion.",
         "The Taste of The Cherry is the story of the last day in the life of Mister Badii. He is going to Teheran, where he wants to find somebody to bury him, after he has killed himself. It is an easy job, just shovel some earth on him, and besides, it is well paid. First he wants to persuade a young soldier who does not say much, feels more and more uncomfortable and then runs away. The second man he talks to is a seminarist, who gives a lecture about suicide and guilt but does not help either. The third guy is an old teacher, who will do the job, but who tries to persuade Badii that it is not a good thing to do. He tells him a joke about some ill-feeling Kurd to make Badii change his attitude, and says the taste of the cherry kept him from suicide once.",
         "An Iranian man drives his truck in search of someone who will quietly bury him under a cherry tree after he commits suicide."
      ],
      "budget": 0
   },
   "movielensId": 1859,
   "movielens": {
      "languages": ["فارسی"],
      "releaseDate": "1997-09-28",
      "dvdReleaseDate": "1999-04-27",
      "directors": ["Abbas Kiarostami"],
      "runtime": 95,
      "movieId": 1859,
      "title": "Taste of Cherry",
      "mpaa": "",
      "actors": [
         "Homayoun Ershadi",
         "Abdolrahman Bagheri",
         "Afshin Khorshid Bakhtiari",
         "Safar Ali Moradi",
         "Mir Hossein Noori",
         "Ahmad Ansari"
      ],
      "imdbMovieId": "0120265",
      "originalTitle": "طعم گيلاس",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["XDSQLTtGZE0"],
      "plotSummary": "A middle-aged Tehranian man, Mr. Badii is intent on killing himself and seeks someone to bury him after his demise. Driving around the city, the seemingly well-to-do Badii meets with numerous people, including a Muslim student, asking them to take on the job, but initially he has little luck. Eventually, Badii finds a man who is up for the task because he needs the money, but his new associate soon tries to talk him out of committing suicide.",
      "tmdbMovieId": 30020,
      "avgRating": 3.64901,
      "releaseYear": "1997",
      "numRatings": 453,
      "posterPath": "/ct8iXbyRXHnPtRMXWBP4eFfysgo.jpg"
   }
}