{
   "tmdb": {
      "original_language": "nl",
      "keywords": [{
         "name": "law and ethics",
         "id": 3683
      }],
      "imdb_id": "tt0119448",
      "video": false,
      "title": "Character",
      "recommendations": [
         42238,
         148050,
         227289,
         148068,
         139772,
         148118,
         97714,
         147159,
         147312,
         90228,
         20105,
         222226,
         105715,
         97954,
         178535,
         187864,
         28527,
         130842,
         22592,
         111793
      ],
      "backdrop_path": "/fvuQwst94zewUnu5QEQpJVTOLnx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Dreverhaven",
               "gender": 2,
               "credit_id": "52fe47099251416c7508bcb3",
               "name": "Jan Decleir",
               "profile_path": "/BXOa9XkagvzafGgdmq0kshR0uG.jpg",
               "id": 13514,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Katadreuffe",
               "gender": 2,
               "credit_id": "52fe47099251416c7508bcb7",
               "name": "Fedja van Huêt",
               "profile_path": "/fTlflMjAfAtncVrkgZktwVtdDPv.jpg",
               "id": 45754,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Joba",
               "gender": 1,
               "credit_id": "52fe47099251416c7508bcbb",
               "name": "Betty Schuurman",
               "profile_path": "/zQ5NmsP8NqAsQFi71veLZUaHiox.jpg",
               "id": 79448,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lorna Te George",
               "gender": 0,
               "credit_id": "52fe47099251416c7508bcbf",
               "name": "Tamar van den Dop",
               "profile_path": "/lIgVn6xL7yOAydxpITG4WttIu9I.jpg",
               "id": 143010,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47099251416c7508bca3",
               "name": "Mike van Diem",
               "profile_path": null,
               "id": 123150,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47099251416c7508bca9",
               "name": "Ferdinand Bordewijk",
               "profile_path": null,
               "id": 143009,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe47099251416c7508bcaf",
               "name": "Mike van Diem",
               "profile_path": null,
               "id": 123150,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.496379,
      "production_countries": [
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         }
      ],
      "id": 17139,
      "vote_count": 34,
      "budget": 4500000,
      "overview": "J.W. Katadreuffe is the son of Joba Katadreuffe and A.B. Drevenhaven. Though fully neglected by Joba, Dreverhaven ensures the succesfull career of his son. Mostly unseen, though he sues his son a few times. The son Katadreuffe succeeds, but at great costs.",
      "similar": [
         492085,
         14600,
         259781
      ],
      "original_title": "Karakter",
      "runtime": 122,
      "poster_path": "/gSJgxWyuAfligoPjw395ea9ZD3v.jpg",
      "spoken_languages": [
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "First Floor Features",
            "id": 938,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Almerica Films",
            "id": 3259,
            "origin_country": ""
         }
      ],
      "release_date": "1997-04-17",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike van Diem"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Ferdinand Bordewijk",
         "Mike van Diem"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0119448/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4OTA5NjU4Nl5BMl5BanBnXkFtZTcwMTMyMzkyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Pavlik Jansen op de Haar, Jan Decleir, Fedja van Huêt | See full cast and crew »"],
      "reviews": [
         "Karakter is quite stunning on several levels. The cinematography is gorgeous - without the use of any noticeable special effects or surrealistic dream sequences. The quality of the filming surpasses that of most movies. One of the best things for me (as an American) about watching foreign films is not knowing who most of the actors are, and this makes it easier to completely accept them as the characters they play. The two leads were outstanding, and the supporting characters (particularly Betty Schuurman as Joba, and Nans Kesting as Jan Maan) were very effective. I found the story to be engrossing and - more than anything, the pacing amazed me. A person accustomed to reading classic novels would probably appreciate the way this film unfolded. There is a desire to reach the end, but no hurry. For sure, this film wouldn't interest everyone, but I rank it among my favorite films. It deserved to win the Academy Award for Best Picture last year: for the story, for the performances, for the direction ... it's rare that one finds a movie so well-put together.",
         "How is it possible for a boy, whose parents are devoid of normal humanity, to grow up to be loved and respected? The film, Character, presents a credible demonstration. It has the darkness of Ingmar Bergman or Charles Dickens, is slow-moving, thoroughly engrossing and it left me emotionally drained, which always elicits a high rating from me. Dreverhaven is apparently an evil man: a bailiff who is quite willing to evict people in a terrible storm. He embodies two Nietzschean concepts: 1. the will to power (he entered into power struggles with anyone whom he felt he could dominate) and 2. that a life becomes better by becoming stronger through adversity (he did everything in his power to bring adversity to his son, believing that that would strengthen him--and in many ways it did). His internal struggle between the will to power over his son and his desire to strengthen him is the prime mover of the film; his son's reactions to that are the core. Dreverhaven is also totally fearless; the question arises whether it is caused by bravery or just being tired of life. The film opens with his son, Jacob Katadreuffe (Fedja van Huêt), coming home, all bloody, only to be arrested as a suspect in the murder of Dreverhaven. He then tells the two interrogators a most amazing story. Since he is describing his own life, one might suspect that he is embellishing the story in his own favour but I believe that he was totally candid. The story is too complex to dwell on but certain aspects must be mentioned. Jacob's mother, Joba (Betty Schuurman), was a servant to Dreverhaven. On one and only one occasion he may have raped her: it is not made clear if she resisted. As soon as she discovered that she was pregnant, she left him and tried to sever all ties. For a long time, however, Dreverhaven repeatedly proposed marriage and was refused. His motivation is ambiguous (propriety or affection) and Joba was apparently determined not to allow Dreverhaven to beat her in a power struggle. Because of his Mother's silence, young Jacob believed that she did not like him and, being a pariah because he was illegitimate, he turned to books for solace. Through this he developed a love of learning and a willingness to work hard and he advanced rapidly in a law firm, winning the respect and admiration of most of his colleagues, especially De Gankelaar (Victor Löw), who hired him. De Gankelaar, a man with a huge underbite and a heart to match, became Jacob's mentor, adviser and protector. Denied access to his son, Dreverhaven began a game of terror against Jacob through legal channels. The film is a study of character and characters. Their motivations are subtly hidden by consistent and superb acting. In my attempts to understand this dysfunctional family (if it can be called a family) I was forced to think. The slow movement allowed time for that. I want to see the film again, expecting that each viewing will bring a closer understanding. Even the evil Dreverhaven was more an object of pity rather than despicable; his actions were caused more by ignorance of human sensitivities, a dogmatic respect for the law and an unusual philosophy rather than by malice. The film is open-ended. What will Jacob do with the rest of his life?",
         "In this film we are confronted with a perfect script if there ever was one! Once again, talented screenwriters have proved that a fine novel can be transformed into a great film, without losing any depth in philosophical understanding or psychological subtlety. In 'Character', the paired tension between pride and guilt, as well as between pride and love, or guilt and love, or love and power, gives birth to an astounding and magnificent lesson in human character and behavior. The fact that Mike van Diem and Laurens Geels, two of the film's three writers, were at the same time -respectively- its director and producer, plays no small role in the success of the script, since the novel by Bordewijk was read -and rewritten- from the perspective of cinema, and not the other way around. The psychological themes are treated as variations in a symphony, presented in one of the characters and later developed in another, or presented in one form and then transmuted into another, as the brilliant treatment given to the self-destructive tendencies in the Dreverhaven character, or the extreme laconism in the mother-son relationship. Seen at a tropical country as Ecuador (my own), surrounded by a teenage audience that was led to expect something else; an audience which was only very slowly won by the tense and restrained 'northern', 'iceberg' pace of the film, 'Character' transformed the screen into a gigantic and painful mirror filled with reflections of the sorrows and sufferings of human nature. And finally those teenagers stopped crunching chips and sipping sodas, and started thinking. A '10' by any standard.",
         "This is one of the best movies that I've seen till now. I was reluctant at first to see this movie, because it was not a \"Hollywood\" product, but after so many times seeing the trailer at the theater it picked my curiosity. The story was set in Netherlands, and it develops unfolding the relationship between a father and his son. This was one of the best movies I've seen in a long time, because it touches the bottom of our hearts making thinking us (the public) about our own -sometimes- conflictive relations with our parents. The two main stars gave us a duel as I've never saw before in a film, and to top all of this, the supporting characters were all believable as well as the magnificent locations. This films really told a story, reflects well its age and overall has a well developed timing so you'll never lose interest in what is next, and has so many twists that your interest never decays. But I really liked the final one. This one only scene pays all the money and time you spent seeing it. OUTSTANDING!!",
         "Character is one of the best period films I have ever seen, and the enormous quantity of very interesting aspects in it make it worth watching. I saw this film with the natural curiosity that a best foreign film Academy Award arouses in many people, and I was really delighted and surprised (Altough, I must admit I had hoped Spain's Secrets of the Heart would win). The story is quite beautiful, and Mike van Diem created a very solid screen play based on well known Ferdinand Bordewijk's novel. The film has some extraordinary moments; I must say that the one that impressed me most was the final scene of the film, a scene of great visual impact and also of an incredibly big narrative content; it is the scene that reveals the mystery behind the cruel A.B. Dreverhaven's behaviour. The performances given out in this film are simply spectacular especially Jan Decleir's as Dreverhaven. I also think Betty Schuurman as Jacob's mother and Victor Löw as De Gankelaar are terrific. One more thing, the art design is beautiful; the image the film gives us of the 1930's Amsterdam is very powerful and very beautiful. Not only is it a great film then, but it is a story that carries a lot of feelings, and will take you on quiet an emotional ride. I can only say this: enjoy it!",
         "Many people describe the movie as distant and cold. But that's exactly what the makers were aiming for to stay congruent with the 2 novels of Bordewijk where Karakter / Character is based upon. Bordewijk's style is often described as Nieuwe Zakelijkheid (best translation: New Objectivity, think Sinclair Lewis), a counter movement to the upcoming Expressionism in the 20s of the last century. Instead of the idealism of Expressionists more emphasis was put on reality, objectivity and facts in a sober and distant form with little room for frivolity, superficial beauty, sentimentality or explaining behavior. Not only does the style of the novels reflect this, the world the characters inhabit has the same characteristics. Viewed from this standpoint they made an amazing adaptation from a novel, correct in both style and content. But the movie defines more than an art movement, because the characters portrayed tell a lot about the Dutch in general, and this in a way also defines Dutch national identity. The story itself is about perseverance. Jacob is the son of a relation without love. His parents never marry, the mother leaves soon after she finds out she is pregnant. His mother is stubborn, his father a man without compassion working as a bailiff. Both parents push their son in their own way, his mother almost drives him out of her home, his father lends him money thus starting a battle over the upper hand in their relationship. The father brings adversity to his son in the hope to make him stronger. In line with the style of the novel none of the characters ever experience love. In fact the whole movie contains not one passionate scene. The only character showing emotion (De Gankelaar, an excellent role played by Victor Löw) leaves the country. It has a Nietzschian philosophical angle with the debate of lightness and weight: Jacob's burdens give his life a meaning, but are the sacrifices worth it? Location scouts did a wonderful job here, because Karakter recreates pre-war Rotterdam, a city almost totally flattened by the Nazis (There is a harrowing photo of the city after the bombardments with only the main church still standing). The production and art departments made the sets with their darkish colors fitting the form and content of the movie. The camera is used in a way to create some fluidity in the scenes: It almost never is static as with so many character dramas. Fedja van Huêt as Jacob and Jan Decleir as Dreverhaven seem to understand what's going on here and act accordingly. Tamar van den Dop as Lorna is probably the greatest weakness in the movie, with a terrible diction and limited body movement she's miscast here. Mike van Diem makes only one movie, wins an Oscar, and disappears almost from the earth. Although rumor has it he does some script doctoring in Hollywood, with his current production rate he will surpass even Malick. As for now, this is by far the best Dutch movie ever made.",
         "This is a movie that grips right away. While it has a dark setting, sparse but classic, the characters are rich. The love and care that Mike van Diem and the actors put in this film is visible. Thanks to significant contributions from both Dutch and Belgian TV stations, this movie is a rare treat, which is for once not spoiled by overly commercial requirements from demanding advertisers... As i understand, the film company First Floor Features had this film for decade(s?) in the planning, and it is a happy coincidence that it was realized the way you can enjoy it now. It has thus become a monument honoring the fabulous writer F. Bordewijk, the Dutch life and mind of the beginning 1900's, the craftsmanship of a dedicated cast, and a generous producer. Jan Declair as the stony-hearted usher Dreverhaven is a character you won't forget for a long time. His softer side is time and again rejected by taciturn Joba, his former housekeeper who became pregnant in one lonely weak moment of them both. For several years, he offers her to marry her, or at least to contribute for the upbringing of his illegitimate son Kattedreuffe. She as many times rejects: 'We do not need anything.' On a precarious occasion, Dreverhaven denounces Jacob Kattadreuffe nevertheless, and from that moment on, father and son have a harsh relation as well. - Masterfully, fate intertwines their lives, as the story unfolds. Real gems are present everywhere, the scenery is breathtakingly picturesque, partly filmed in Rotterdam harbor, and in other places like Poland. The movie constantly plays with time, but in a plausible way. As an example, when Kattedreuffe has an appointment at a bailiff's office after being framed into bankruptcy, the name plate blinks at once with his own name on it. And indeed, he starts a career in this very office that same day. For a while, the lives of father and son seem only occasionally to coincide, but it is a silence before the storm. Every picture draws to the dramatic end which was glimpsed as the opening scene: Did Kattadreuffe murder Dreverhaven? Many instances shown would allow this conclusion, as the two fatally attract each other to fulfill their inner tragedy. Dreverhaven as this hard and desperate 'keeper of the law' who can not express love, and Kattadreuffe as the one who had to fight his whole life to arrive in a higher position, and then stands empty-handed, his love unreturned through his own stupidity (even his mother sees that Lorna Te George / Tamar van den Dop was an exquisite relation missed). To kill (!) each other would suddenly seem like the best possibility and a liberation in such a dark hour, but the end has a surprise. The last minute smooths all the giant waves, and allows for a satisfying and ingenuous end scene. - Maybe you have to see this movie more than once to uncover the many hidden treasures, i strongly recommend to get it for yourself on DVD. The music of 'Paleis van Boem' enhances perfectly the impressive scenery. It is an artwork that has more than earned the Oscar it has got as best foreign film in 1998, along with several other awards. And i am proud to have been asked to participate with calligraphy and handwritten material, although it is only clearly visible in the last half minute when (my) hand writes the last words of the testament, undersigning with - (see for yourself!).",
         "It's no wonder that this Dutch drama got the 1997 Academy Award for the best foreign country movie in the year of \"Titanic\". It tells the rise-and-fall-story of a young man in the Netherlands of the 1920's who's working hard to escape from the ghetto and to become an idealistic lawyer. Unfortunately his brutal an tyrannic father fights against him in any possible way, and at the end father and son are facing in a hard fight for life and death. The story is great, the characters (sic!) of the plot even more, and the acting is pure adrenaline-driven. The whole atmosphere, supported by the dark filming locations of Amsterdam, Belgium, Germany (the Speicherstadt in Hamburg) and Poland, is disturbing and depressing. A great psycho drama and insight into the human psyche with a powerful performance by Jan Decleir as villain Dreverhaven that can easily compete with Anthony Hopkins' Hannibal Lecter movies!",
         "It is not too frequent that we get Dutch programmes of films or TV-minis in this corner of Europe, and when they do appear it is thanks to the regional Basque TV Station `EITB'. Indeed over two years has passed since seeing the excellent mini `Charlotte Sophie Bentinck' (1996) (qv) and seeing the very interesting `Karakter' recently. Set in the 1920's this film has excellent mise-en-scéne wonderfully photographed, mostly in Holland and Belgium, but with some scenes shot in Wroclaw, Poland, with street-cars of the times, in which the darkened almost greyish brickwork of the tenement buildings and the industrial port areas takes on an intense protagonism in the film's development. Palais van Boem's musical contribution is mostly just right, though at times seemed to be a little boorish. A young, illegitimate boy grows up with his unmarried mother, whilst the father, Dreverhaven, continuously appeals to her to marry him, but always rejected. However, the father seems to do everything possible to disrupt the young man's life, as his mother becomes more and more detached and uncaring. It would seem that Dreverhaven is playing out a real-life game of chess around his son Jacob, as if trying to corner him into submission and apathy, but which the young man manages to survive. The psychological impression is that one or the other would undo his `bitter foe', but that despite the father's vast fortune and power the struggle of will would rebound against him.But as the Dutch saying goes: \u0091De één zijn dood, is de ander zijn brood' This is no `thriller' in the ordinary sense, more a psychological suspense which requires attention throughout. The acting is magnificent: both Fedja van Huêt and Jan Decleir play out their parts with just the right touch, especially Decleir, and Lou Landré as Rentenstein is almost spellbinding, not to be missed. Here is another example of the unarguable fact: here in Europe we make cinema, not blockbuster box-office hits.",
         "Character is what it's about, all right. That commodity which will be obsolete in the coming century/millenium. The mood and acting are as near to perfect as can be conceived. There were scenes that evoked the best of Murnau, Pabst and Lang. Movies like this don't come around much any more."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "First Floor Features",
         "Almerica Film"
      ],
      "summaries": [
         "J.W. Katadreuffe is the son of Joba Katadreuffe and A.B. Drevenhaven. Though fully neglected by Joba, Dreverhaven ensures the succesfull career of his son. Mostly unseen, though he sues his son a few times. The son Katadreuffe succeeds, but at great costs.",
         "The police detain Jacob, a young lawyer, following a death. He tells his story in flashbacks. His parents are stubborn: his mother, whose name he takes, is mute with him and rejects offers of marriage from his father, Dreverhaven, a stern and imposing bailiff. Dreverhaven, for his part, will not acknowledge Jacob in public, save for legal ploys to keep Jacob impoverished. Jacob, first a debt-ridden office boy, rises through intelligence, hard work, and single-mindedness to become a lawyer. His success is tempered by his mother's silence, his misjudgment of a young woman's feelings, and his father's cold, fierce aggression. Is his father merely building Jacob's character?",
         "A ruthless court bailiff is found dead, and a young lawyer is the prime suspect. Told in a series of flashbacks, Jacob Katadreuffe tells the tale leading to the events of his final confrontation with bailiff Dreverhaven. What unfolds is the man's life story ... of his strained relationship with his mother, of his strong desire to make a better life for himself (largely self-taught), of his obsession with his father, and the bizarre battle of wills with Dreverhaven.",
         "Jacob Katadreuffe lives mute with his mother, has no contact with his father who only works against him and wants to become a lawyer, at all costs."
      ],
      "budget": 4500000
   },
   "movielensId": 1860,
   "movielens": {
      "languages": [
         "Nederlands",
         "English",
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1997-04-17",
      "dvdReleaseDate": "2003-02-04",
      "directors": ["Mike van Diem"],
      "runtime": 122,
      "movieId": 1860,
      "title": "Character",
      "mpaa": "",
      "actors": [
         "Jan Decleir",
         "Fedja van Huêt",
         "Betty Schuurman",
         "Tamar van den Dop"
      ],
      "imdbMovieId": "0119448",
      "originalTitle": "Karakter",
      "genres": [
         "History",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "J.W. Katadreuffe is the son of Joba Katadreuffe and A.B. Drevenhaven. Though fully neglected by Joba, Dreverhaven ensures the succesfull career of his son. Mostly unseen, though he sues his son a few times. The son Katadreuffe succeeds, but at great costs.",
      "tmdbMovieId": 17139,
      "avgRating": 3.83551,
      "releaseYear": "1997",
      "numRatings": 535,
      "posterPath": "/gSJgxWyuAfligoPjw395ea9ZD3v.jpg"
   }
}