{
   "tmdb": {
      "original_language": "nb",
      "keywords": [
         {
            "name": "subway",
            "id": 1552
         },
         {
            "name": "anti hero",
            "id": 2095
         },
         {
            "name": "false identity",
            "id": 3864
         },
         {
            "name": "postman",
            "id": 4461
         },
         {
            "name": "torpedo",
            "id": 6791
         },
         {
            "name": "beating",
            "id": 9849
         },
         {
            "name": "dark comedy",
            "id": 10123
         },
         {
            "name": "stealing",
            "id": 10261
         },
         {
            "name": "drug addict",
            "id": 18179
         },
         {
            "name": "peeping tom",
            "id": 156391
         },
         {
            "name": "hidden money",
            "id": 208646
         },
         {
            "name": "drunkeness",
            "id": 229143
         },
         {
            "name": "medicine overdose",
            "id": 241015
         }
      ],
      "imdb_id": "tt0118785",
      "video": false,
      "title": "Junk Mail",
      "recommendations": [],
      "backdrop_path": "/hmt78KzQo8wZM988o2NnGKDUWUx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Roy Amundsen",
               "gender": 2,
               "credit_id": "52fe456c9251416c91031dc7",
               "name": "Robert Skjærstad",
               "profile_path": "/oAVmv5DAYnWtfedMU3AZEekfZb7.jpg",
               "id": 63765,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Line Groberg",
               "gender": 1,
               "credit_id": "52fe456c9251416c91031dcb",
               "name": "Andrine Sæther",
               "profile_path": "/8GE731GTN7LMqjYb1U5ohmO2cmn.jpg",
               "id": 63763,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Georg Rheinhardsen",
               "gender": 2,
               "credit_id": "52fe456c9251416c91031dcf",
               "name": "Per Egil Aske",
               "profile_path": "/s8l1zi31ZUq0JyFQL98O9VeYy9u.jpg",
               "id": 112598,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Betsy",
               "gender": 1,
               "credit_id": "569042449251412d00000129",
               "name": "Eli Anne Linnestad",
               "profile_path": null,
               "id": 224566,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sæther",
               "gender": 2,
               "credit_id": "569042639251412d03000101",
               "name": "Trond Høvik",
               "profile_path": "/6S6IMcRUF5J23EoF2sk2V9k2eEA.jpg",
               "id": 76612,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Per",
               "gender": 0,
               "credit_id": "56904287c3a3684b60000167",
               "name": "Ådne Olav Sekkelsten",
               "profile_path": null,
               "id": 1560202,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Espen",
               "gender": 2,
               "credit_id": "569042b39251412cfd000136",
               "name": "Trond Fausa Aurvåg",
               "profile_path": "/rFWC22ZScaQwA85NBo7l1j9XQdo.jpg",
               "id": 85151,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe456c9251416c91031db7",
               "name": "Pål Sletaune",
               "profile_path": "/7sg7FfMy1xQ1O2WrGdBLCpBT2ef.jpg",
               "id": 7736,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe456c9251416c91031dbd",
               "name": "Pål Sletaune",
               "profile_path": "/7sg7FfMy1xQ1O2WrGdBLCpBT2ef.jpg",
               "id": 7736,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe456c9251416c91031dc3",
               "name": "Jonny Halberg",
               "profile_path": null,
               "id": 112597,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.696672,
      "production_countries": [{
         "iso_3166_1": "NO",
         "name": "Norway"
      }],
      "id": 34582,
      "vote_count": 7,
      "budget": 0,
      "overview": "Dimwitted, somewhat misanthropic Oslo mail carrier Roy's quiet life changes dramatically on the day he steals a set of keys and lets himself into the apartment of a deaf woman who seems to be in trouble with a psychotic criminal. Though he doesn't know it at the time, his and her fate are about to intertwine and this is not going to be to his benefit.",
      "similar": [
         627,
         98019,
         412654
      ],
      "original_title": "Budbringeren",
      "runtime": 83,
      "poster_path": "/qhCGpjvL3pO1hBSxSqLhXfugCjn.jpg",
      "spoken_languages": [{
         "name": "Bokmål",
         "iso_639_1": "nb"
      }],
      "production_companies": [],
      "release_date": "1997-02-21",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Norway",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Pål Sletaune"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Jonny Halberg",
         "Pål Sletaune"
      ],
      "originalLanguage": "Norwegian",
      "imdbLink": "http://www.imdb.com/title/tt0118785/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MjE5MTUwMl5BMl5BanBnXkFtZTcwNzU1NDAzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Skjærstad, Andrine Sæther, Per Egil Aske | See full cast and crew »"],
      "reviews": [
         "Original, wildly amusing, bizarrely funny, genuinely strange, but very entertaining and likeable offbeat comedy about a postman's hilarious adventures when he falls in love with a potential suicide. A wonderful little gem. Don't miss this!",
         "Once we rented this movie just to see what it was about. We were fairly impressed. It focuses on Oslo mailman Roy Amundsen, who is sort of down on his luck. Then, he gets interested in a woman and starts following her around. When she leaves her key in a mailbox, he has it copied, gets locked in her apartment, and gets a little (or a lot) more than he bargained for! Some of the world's most interesting movies have come from Scandinavia (e.g., anything by Ingmar Bergman). \"Budbringeren\" (called \"Junk Mail\" in English) is no exception. This look at some of Norway's grittier aspects is truly eye-opening. Maybe it's not any kind of masterpiece, but it's still an interesting slice-of-life tale.",
         "A twisty-turny narrative that ultimately leads nowhere, avoiding both exposition and explanation at the end of the day. Like a Nordic Coen Brothers film, this is more concerned with portraying quirky characters and odd scenarios, but despite some nifty camerawork, it is a rather ugly film, revelling in its depressingly squalid milieu without making any real point at the end of the day. The anti-hero remains a complete enigma throughout, but funnily enough, despite my reservations at the beginning, it was rather hard not to be won over at the end of the day. There were some marvellously taut action and suspense sequences, and some hilariously humourous scenes. Rather similar to most Scandinavian films I've seen actually. Dark grey and depressing, but blackly comic.",
         "Junk Mail is a Norweigan movie, and it is as black a comedy as I've seen. But the makers of the movie have stumbled onto a comedic truth that never fails: take an aberrant character trait, and take it to the absolute limit. The lead character is a mailman of monstrously incompetent proportions, a creepy, irredemiably snoopy individual who can't even get mugged right; he would gladly have handed over his mailbag, but he couldn't get it off his shoulder. In the process of sneaking around a deaf girl's apartment whom he fancies, he saves her life after she tries to commit suicide. For this guy, this uncharacteristically unselfish act sets off a disastrous chain of events. This weird movie will NOT work for you if you don't think it's funny. And this movie will only be funny for you to the degree that you're cynical and capricious in your affections. People of good heart, stay away.",
         "This film depicts Oslo as a rather run-down city which, as far as I can remember, it is not; and as for the Norwegian Postal Service ...well that seems to be struggling along if we can judge by the unreliable antics of Roy (Robert Skjaerstad), one of the young postmen. He not only opens and reads private mail, but also lets himself into an apartment when he finds a key left in a mail-box. His exploration of the rooms leaves little time for delivering letters so he dumps the contents of his bag in a railway tunnel. The irony of the situation is that he is awarded a gold watch for bravery in attendance to his duties after being badly beaten up in the streets. The originality of the story is completely charming as it blends romance, suspense and comedy in which Roy seems to get involved at every turn. One scene I particularly like is the one in which a locomotive almost runs him down in the tunnel and scatters his letters high and wide like a flurry of snowflakes. It's just one of many quaint scenes. In another scene he is on the point of being gunned down in his own grungey apartment when nearby jackhammers reverberate throughout the whole building giving him the opportunity to make his get-away. There is a suspenseful moment when he slips an iron bar through the doorhandles of a public toilet imprisoning a frantic gunman. Unfortunately for Roy (always a loser it seems) his inscribed wrist watch falls off in his struggle and so the gunman is eventually able to trace his whereabouts. The film is short and sweet, well worth watching. It has a lot of originality in the script and the acting is first class. The film suggests we should look under our beds before retiring . One never knows who may be hiding there...particularly in Oslo.",
         "A brilliant movie by Pal Sletaune! It's probably the \"greyest\" film I've ever seen. Disgusting in one way, but that only makes it greater. In my opinion the best Norwegian film ever, and it is absolutely worth watching. But like most movies, it is best in its original language, so people who doesn't speak Norwegian won't have the same experience, I guess... But it's still worth watching because of the depressing mood in it(!).",
         "JUNK MAIL (3+ outta 5 stars) Offbeat but sincere comedy-thriller about a lonely postman who comes across a set of keys accidentally left in the mailbox by a cute young girl on his route. He makes a copy of her keys and secretly checks out her apartment while she is at work. He also has a habit of disposing of junk mail in an out of the way train tunnel (whether this is out of sheer laziness or to spare the people on his route the bother is never really explained). One day he accidentally falls asleep and is trapped inside the girl's bedroom when she comes home from work and then... well, to give any more away would definitely ruin your enjoyment so I'll stop there. Suffice to say that things get a little more complicated. This quirky little Norwegian film didn't get a whole lot of attention on its US release. Too bad... it's well-written and well-acted and definitely worth checking out. Sort of a kinder and gentler version of \"Blue Velvet\".",
         "Although little appears to happen in this film, it is in fact a very well controlled piece about a postman who has opted out of engaging with the world. He accidentally saves the life of a suicidal woman, and through committing this unintentional good act becomes a better person - entirely against his will. The performances are flawless, and the direction unobtrusive, giving the illusion of effortlessness that is in fact very hard to achieve. Despite being a film of great moral complexity, Junk Mail wears its serious purpose very lightly, and is in fact very funny indeed. Certainly one of the best films to come out of Scandinavia in recent years, and one which shows a side of Oslo few outsiders ever witness.",
         "This has got to be one of the most miserable films that I have ever had the fortune to see. Although miserable, there is an abundance of humour contained within. I watched the film a couple of years back after it had been standing on my shelf for a year or so before that, it had me depressed and laughing and then depressed again throughout its hour and a half running time. Anyone who enjoys low budget, gritty realism type films should make the effort to see this. It's about an Oslo postman who is a little bit too nosey for his own good. His prying about other people lives leads him to trouble of the kind not generally associated with the postal service. I'm not going to tell you everything about the movie because, to be honest, there isn't much to tell. Just go and see it for yourself. In the UK it is available on Tartan Video under the heading 'Junkmail'. If you are lucky enough (and patient enough to watch a Norwegian language film) then you will have stumbled upon one of the greatest dark comedies you're ever likely to see. Norway's greatest gift to an audience which is becoming more and more receptive of non-English language film.",
         "This is definitely one of the best contemporary Scandinavian films with all the hallmark of a top artistic production. All the characters are not without flaws and they are presented as anti-heroes. The movie has a grunge atmosphere and it is laced with humour and mockery. I can't really throw more light into this without creating too great an expectation for you except to say I really enjoyed it for pure entertainment. I like the quaint odd-ball filmmaking style created by Pål Sletaune. My question is: where is the DVD? Criterion people, are you listening?"
      ],
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "productionCompanies": [
         "Atlas Filmselskabet A/S",
         "Norsk Film"
      ],
      "summaries": [
         "A postman, Roy, finds the key to an apartment left in the mailbox. Investigating the apartment, he falls in love with its inhabitant, Line. But Line has other \"friends\", involved in dangerous affairs.",
         "A lazy postman puts his nose where it doesn't belong."
      ],
      "budget": 2100000
   },
   "movielensId": 1861,
   "movielens": {
      "languages": ["Bokmål"],
      "releaseDate": "1997-02-21",
      "dvdReleaseDate": null,
      "directors": ["Pål Sletaune"],
      "runtime": 83,
      "movieId": 1861,
      "title": "Junk Mail",
      "mpaa": "",
      "actors": [
         "Robert Skjærstad",
         "Andrine Sæther",
         "Per Egil Aske",
         "Eli Anne Linnestad",
         "Trond Høvik",
         "Ådne Olav Sekkelsten",
         "Trond Fausa Aurvåg"
      ],
      "imdbMovieId": "0118785",
      "originalTitle": "Budbringeren",
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Dimwitted, somewhat misanthropic Oslo mail carrier Roy's quiet life changes dramatically on the day he steals a set of keys and lets himself into the apartment of a deaf woman who seems to be in trouble with a psychotic criminal. Though he doesn't know it at the time, his and her fate are about to intertwine and this is not going to be to his benefit.",
      "tmdbMovieId": 34582,
      "avgRating": 3.17826,
      "releaseYear": "1997",
      "numRatings": 115,
      "posterPath": "/qhCGpjvL3pO1hBSxSqLhXfugCjn.jpg"
   }
}