{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "greed",
            "id": 5332
         },
         {
            "name": "dollar",
            "id": 7597
         },
         {
            "name": "jackpot",
            "id": 8739
         },
         {
            "name": "atlantic city",
            "id": 10530
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "slot machine",
            "id": 176516
         }
      ],
      "imdb_id": "tt0120838",
      "video": false,
      "title": "Sour Grapes",
      "recommendations": [
         85137,
         27977,
         79008,
         289040,
         84720,
         68180,
         27743,
         269535,
         114740,
         39368,
         41568,
         26962,
         38916,
         48311,
         50699,
         36837,
         35118,
         179159,
         25579,
         26369
      ],
      "backdrop_path": "/j5E1n3g5dPL1AtnX1wJ39WFLlZn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Evan Maxwell",
               "gender": 2,
               "credit_id": "52fe449dc3a368484e02ce67",
               "name": "Steven Weber",
               "profile_path": "/ujINzDjLNtELBSUkRHQgExzP4Fb.jpg",
               "id": 6106,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ritchie Maxwell",
               "gender": 2,
               "credit_id": "52fe449dc3a368484e02ce6b",
               "name": "Craig Bierko",
               "profile_path": "/p73tvHCVhyGeWEUTOwTFgzOkCPn.jpg",
               "id": 14886,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Selma Maxwell",
               "gender": 1,
               "credit_id": "52fe449dc3a368484e02ce6f",
               "name": "Viola Harris",
               "profile_path": null,
               "id": 91849,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Millie",
               "gender": 1,
               "credit_id": "52fe449dc3a368484e02ce73",
               "name": "Jennifer Leigh Warren",
               "profile_path": "/RA1xFVBUCT4k2WfD0n2xb16UmF.jpg",
               "id": 91850,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Studio Executive / Annoying Doctor / Singing Bum (uncredited)",
               "gender": 2,
               "credit_id": "59ea4ea3925141640e000e5a",
               "name": "Larry David",
               "profile_path": "/nU0K1Z7HEFEkuLMQb1qDlZhDhij.jpg",
               "id": 16376,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Riggs",
               "gender": 1,
               "credit_id": "59ea4ed6c3a368253f00293b",
               "name": "Kristin Davis",
               "profile_path": "/rSfRRPlWj1idJRMCwbkXYNunrlm.jpg",
               "id": 38025,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Palmer",
               "gender": 2,
               "credit_id": "59ea4f1a925141628b000ecb",
               "name": "Patrick Fabian",
               "profile_path": "/qVBTTDdWkMaElKx77VFz8zy3Noq.jpg",
               "id": 58791,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Lois",
               "gender": 1,
               "credit_id": "59ea4f4492514145e7002b09",
               "name": "Jill Talley",
               "profile_path": "/1a6pmvxeBa7aWMJIgwxwRsoi7b3.jpg",
               "id": 17414,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Mr. Bell",
               "gender": 2,
               "credit_id": "59ea4f58925141643e000db1",
               "name": "Philip Baker Hall",
               "profile_path": "/eH7GrivSuLEvhJL85qPkhNvg3E7.jpg",
               "id": 4492,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Digby",
               "gender": 2,
               "credit_id": "59ea4f839251416402000ea6",
               "name": "Orlando Jones",
               "profile_path": "/7QOW3bgYjPxnjwrZDclmnJenhPH.jpg",
               "id": 18270,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449dc3a368484e02ce5d",
               "name": "Larry David",
               "profile_path": "/nU0K1Z7HEFEkuLMQb1qDlZhDhij.jpg",
               "id": 16376,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe449dc3a368484e02ce63",
               "name": "Larry David",
               "profile_path": "/nU0K1Z7HEFEkuLMQb1qDlZhDhij.jpg",
               "id": 16376,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.914445,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24560,
      "vote_count": 13,
      "budget": 0,
      "overview": "Richie, a sneaker sole designer, and his cousin Evan, a brain surgeon, are spending this weekend with their girlfriends in Atlantic City. When one of them ends up with a $436,000 jackpot, sour grapes is what results. Even though Richie uses two quarters from Evan to win the progressive jackpot, he sees no connection with that and sharing the jackpot. This ignites a hilarious, runaway chain of even",
      "similar": [
         44639,
         75656,
         949,
         8012,
         3090,
         1075,
         22074,
         12778,
         309242,
         16723,
         17314,
         23855,
         2265,
         11958,
         32689,
         43802,
         23368,
         44800,
         15394,
         246308
      ],
      "original_title": "Sour Grapes",
      "runtime": 91,
      "poster_path": "/bOCnOBQ1TpB4F4aFfdGFUvFm3F2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
         "name": "Castle Rock Entertainment",
         "id": 97,
         "origin_country": ""
      }],
      "release_date": "1998-01-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "A hilarious comedy from the co-creator of \"Seinfeld\"",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Larry David"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Larry David"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120838/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTg4NDU5Njk2OF5BMl5BanBnXkFtZTYwMjQ1MzE5._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Steven Weber, Craig Bierko, Jack Burns | See full cast and crew »"],
      "reviews": [
         "Although it's been a long time since I've seen Sour Grapes, the experience of seeing it- preferably alongside another Seinfeld fan- was fairly pleasant, in that biting Larry David tone. This was the only time David wrote and directed a film, and it does show that he's giving a good try to tell a story within the framework of a film feature all the way through. It's somehow quite an entertaining piece of quietly (or not so quietly) deranged satire on envy, sexual frustration, and the condition of a principle of something. The premise is simple- two good friends go out to Las Vegas to gamble, one friend asks the other for a quarter for a slot machine, and via the quarter in the slot machine the guy wins a helluva lot of money. By the friend with the original quarter's estimation, a part of that change is his, but the friend now says that it isn't. A likely Seinfeld sub-plot is stretched out so that the ideas are given a little breathing room, even if one recognizes that, perhaps, it would be a masterpiece if it were simply a Seinfeld episode, or more appropriately a Curb Your Enthusiasm with even more acidic humor and total unease thrown at the situation. Around the premise, David also tosses in a supporting character who has one of his testicles removed- the wrong one by the doctor, who is one of the friends- and despite his now high voice (ho-ho) he seeks out some payback. That's one of the clearest big gags, as obvious as it is, is the moment when the 'testicle-man', as one might be tempted to describe him, is told by the doctor that the wrong one was taken out during surgery, to his immediate fainted response in a cut-away. On top of this, David experiments with some stupid sex humor (not that there wasn't at least a little later on on CYE, eg Jeff's mother's ass at a stoplight), like with Bierko's character in the self-humiliation of not being able to, um, 'service' himself in a certain way, under the stress of the tear in the friendship. As mentioned, none of this really makes for the kind of classic comedy one might expect, or crave, from maybe one of the only geniuses (yeah, I said it) working in comedy today. But as almost something of a fluke, it does its job well.",
         "If I had believed all the negative on-line reviews for this film, I probably never would have rented it. But I'm very glad I didn't pay heed. While \"Sour Grapes\" may not quite reach the comedic heights of Larry David's \"Curb Your Enthusiasm\" on HBO, there's enough of David's hilarious, mean-spirited, offbeat humor to please any fan of his classic comedy series (oh, yeah, and Seinfeld fans, too). The circuitous way the plot unfolds and then crazily accelerates is very much in the style of both series and the two leads, especially the under-appreciated Craig Bierko,are great. Director and writer David takes perfect aim at such diverse targets as overbearing mothers (the actress in this part is wonderful), dutiful sons, feckless sitcom stars, brain surgeons (who shouldn't fiddle around with testicles), and homeless people. I can see why this film was a flop at the box-office. Larry David is an acquired taste and better suited to a niche audience on cable. But if you like anything else he's done, you shouldn't miss this overlooked little beauty.",
         "It's so funny that I didn't know Larry David wrote the script to this movie, because the whole time I was watching it I kept saying \"That scene was just like something out of Seinfeld.\" or \"That character reminds me of George Costanza\" or \"He kinda reminds me of Kramer.\". Larry David applies his unique brand of comedy to this script very well. It literally plays out like a long \"Seinfeld\" or \"Curb Your Enthusiasm\" episode. All the elements are here. Especially the way everything is related in the end. The movie also has some really good performances from the cast, namely Steven Weber and Craig Bierko. Both of them are very fun to watch here. You can tell they must have had fun making the movie, because they work together very well. Like I said, very Seinfeld-ish. Now that you know Larry David wrote it, you'll notice even more Larry David elements within the movie. They're everywhere when you consider the structure of the plot, the amplified & quirky characters etc...",
         "For all of the good things i had heard about this movie, i was very disappointed. This movie was nothing more than an extention of Seinfeld, which was co-created and written by Larry David. There are conversations about hotel sex and Craig Beirko reminded me of George with his constantly reminding everyone that a doctor didn't hold a door for him. Even the parody of \"Friends\", wasn't funny. Larry David is a smart and witty guy, but this movie was just a miss.",
         "This plays like an extended sitcom, with the only thing missing being a laugh track. The entire movie seems stretched with non relevant material, such as the missing bag of cookies, or the elevator rudeness. There are a few chuckles along the way to the rather dark conclusion. Neither Steven Weber or Craig Bierko elicits any sympathy, so you wind up really not caring who gets a leg up on whom. Both girlfriends and the Mother are nothing but annoyances. The whole script beyond the initial idea of the slot machine sequence, seems like forced outrageousness. At best, a rather mediocre film that belongs on television, and nothing more. - MERK",
         "An old premise, family bickering over money, is never fully explored here. Weber and Bierko are cousins, Weber loans Bierko 50 cents on a slot machine, and when Bierko hits it big, Weber expects half the prize money (reasonable I'd say). Instead he and Bierko feud the rest of the way, with one pulling constant stunts on the other, none of which are very amusing. Weber, a doctor, tells Bierko he's dying, at which point Bierko actually tries to have his mother scared to death so she won't have to live without him. And Weber, so distracted by the feud with Bierko, inadvertently amputates both testicles of a big time tv star. And get ready to laugh your brains out...the tv star now talks in a high voice. Oh please stop, you're killing me. And you'll love when Bierko gives himself oral sex in a totally lame, unconvincing scene where he constantly picks his head wayyyyyy up and then down...yeah, sure. The mark is missed consistently in this letdown.",
         "Frankly, I find this movie difficult to watch every time. So many things occur that just seem to spiral down into chaos causing chaos causing chaos. The main characters, at first...you take a side...then eventually you'll realize that neither are in the right. But one does something to the other, which is unspeakably terrible...and receives the same in turn. Eventually when it's all over, something ultimately terrible happens. Suspense is not only something that relates to a horror film, in my opinion...upon seeing this film. The director perfected it to an almost migraine inducing level. If you are patient, this movie is fantastic. If you're not, and you simply can't stand it...well perhaps this isn't for you.",
         "I'm a Seinfeld and Curb Your Enthusiasm fan. What I liked in this movie was its unique story and how things get going. Things get complicated like in Seinfeld and CYE, but that could have been done better. It's not so funny like in Larry David's sitcoms. Larry should have added more humor and talk-jokes in the movie script. It's like I'm watching a Seinfeld episode written by an amateur stand-up comedian. Larry, it was because of the money, wasn't'it? Both characters are very much like Larry David. They talk and make gestures in the same way Larry does in Curb Your Enthusiasm; this can be very annoying and boring (like \"Pretty, pretty, pretty good...\"). And the guy who won at the casino is not such a good actor. He reminds me of Stephen Snedden from spin off series The Lone Gunmen - he is really that bad. And his wife resembles Susie from Curb Your Enthusiasm. And that horrible soundtrack! It's always the same song over and over again. And I used to like classic music...",
         "I thought this movie was good....When I saw that Larry David (Co- writer of The Seinfeld Chronicles) was involved, I got great expectations. My opinion is that this comedy had a lot of Seinfeld. When you look at the dialogues and characters you clearly can see that this is similar to the Seinfeld Chronicles. I consider myself a Seinfeld fanatic and I love when people follow the example of this series. The movie was filled with sarcastic remarks, no moral, a plot full of entanglements and nothing is going as planned. This comedy is also good because the people involved don`t try to make it hylerious for everyone by using \"stereotypical\" characters and so on. I really recommend \"Sour Grapes\", but I guess you won`t like it if you don`t like Seinfeld. 7 stars",
         "What a waste of time. Do not watch this movie if you have watched Seinfeld or Curb Your Enthusiasm. You have already seen it. It is full of the same jokes, the same sight gags and the same comedic premises. It was a waste of two hours. Larry David is a very funny man but he obviously ran out of material a long time ago. He is rehashing old ideas, familiar scenes and retelling old jokes. You can tell he directed it very early on when both main characters act in exactly the same manner as George in Seinfeld or Larry himself would in Curb Your Enthusiasm. You can almost picture him telling the actors this is how I want you to play this scene. The auntie is also just a rehash of every Jewish mother in all his works. It is the same character, and a racial stereo type as well. The way he uses black characters is nothing short of racist, but we already knew this from Season 1 Episode 9 of Curb Your Enthusiasm, and before that ten years of Seinfeld. In short it is full of misunderstandings, slight misses of important phone calls and gross over reactions to minor irritants. When the elevator scene came around late in the movie, I couldn't take it any more. How many times have we seen the exact same scene? Utter rubbish!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Castle Rock Entertainment"],
      "summaries": [
         "Two cousins and friends, Richie and Evan, go to Atlantic City to gamble. Richie loses all he has at slot machines and asks Evan for two more coins for a last attempt. That last attempt brings a $400,000 jackpot for Richie. No wonder Evan turns greedy and jealous.",
         "SOUR GRAPES is what you get when lots of money ignites a runaway chain of events including deceit, destruction and dissolution all because two cousins can't figure out how to share 50 cents. Richie, a sneaker sole designer, and his cousin Evan, a brain surgeon, are spending this weekend with their girlfriends in Atlantic City. Having exhausted their gambling funds, Richie drops his last quarter into a slot machine. Evan advises him that he needs two more quarters to really make it big and proceeds to give him the extra coins. Richie pulls the lever. Moments later, three grapes across, Richie is scooping up a $436,000 jackpot. Does Evan get two-thirds of the payoff for two-thirds of the investment? Not in Richi's eyes. How about half? No dice.",
         "Richie, a sneaker sole designer, and his cousin Evan, a brain surgeon, are spending this weekend with their girlfriends in Atlantic City. When one of them ends up with a $436,000 jackpot, sour grapes is what results. Even though Richie uses two quarters from Evan to win the progressive jackpot, he sees no connection with that and sharing the jackpot. This ignites a hilarious, runaway chain of events including deceit, destruction and dissolution in the family as everyone seems to side strongly with one side or the other."
      ],
      "budget": 0
   },
   "movielensId": 1864,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["Larry David"],
      "runtime": 91,
      "movieId": 1864,
      "title": "Sour Grapes",
      "mpaa": "",
      "actors": [
         "Steven Weber",
         "Craig Bierko",
         "Viola Harris",
         "Jennifer Leigh Warren",
         "Larry David",
         "Kristin Davis",
         "Patrick Fabian",
         "Jill Talley",
         "Philip Baker Hall",
         "Orlando Jones"
      ],
      "imdbMovieId": "0120838",
      "originalTitle": "Sour Grapes",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["0Qpwjjwszu0"],
      "plotSummary": "Richie, a sneaker sole designer, and his cousin Evan, a brain surgeon, are spending this weekend with their girlfriends in Atlantic City. When one of them ends up with a $436,000 jackpot, sour grapes is what results. Even though Richie uses two quarters from Evan to win the progressive jackpot, he sees no connection with that and sharing the jackpot. This ignites a hilarious, runaway chain of even",
      "tmdbMovieId": 24560,
      "avgRating": 2.45726,
      "releaseYear": "1998",
      "numRatings": 117,
      "posterPath": "/bOCnOBQ1TpB4F4aFfdGFUvFm3F2.jpg"
   }
}