{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "lover (female)",
            "id": 1808
         },
         {
            "name": "paparazzi",
            "id": 2560
         },
         {
            "name": "gondola",
            "id": 3282
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0141986",
      "video": false,
      "title": "Wild Man Blues",
      "recommendations": [56164],
      "backdrop_path": "/yBiIvbjQlosNcjLcsU59SjkWGwH.jpg",
      "revenue": 425788,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "himself, the Clarinetist",
               "gender": 2,
               "credit_id": "52fe4932c3a368484e11f59b",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Herself, sister of Woody Allen",
               "gender": 1,
               "credit_id": "52fe4932c3a368484e11f5cd",
               "name": "Letty Aronson",
               "profile_path": "/dZPK3d3TvgLEmjHQRObNZkv7OUY.jpg",
               "id": 1265,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "herself",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f59f",
               "name": "Soon-Yi Previn",
               "profile_path": null,
               "id": 535801,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "himself, the trombonist",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5a3",
               "name": "Dan Barrett",
               "profile_path": null,
               "id": 401955,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "himself, the trumpeter (as Simon Wettenthall)",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5a7",
               "name": "Simon Wettenhall",
               "profile_path": null,
               "id": 401763,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "himself, the drummer and vocalist",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5ab",
               "name": "John Gill",
               "profile_path": null,
               "id": 578365,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "himself, the bassist",
               "gender": 2,
               "credit_id": "52fe4932c3a368484e11f5af",
               "name": "Greg Cohen",
               "profile_path": null,
               "id": 242172,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "herself, the pianist",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5b3",
               "name": "Cynthia Sayer",
               "profile_path": null,
               "id": 401764,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "himself, the band director and banjoist",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5b7",
               "name": "Eddy Davis",
               "profile_path": null,
               "id": 401956,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "herself, mother of Woody Allen",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5bb",
               "name": "Nettie Konigsberg",
               "profile_path": null,
               "id": 578366,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "himself, father of Woody Allen",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5bf",
               "name": "Martin Konigsberg",
               "profile_path": null,
               "id": 578367,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "himself, guest in hotel suite",
               "gender": 0,
               "credit_id": "52fe4932c3a368484e11f5c3",
               "name": "John Doumanian",
               "profile_path": "/a29DCpIYuwAC21ErdCMTTPFMsnG.jpg",
               "id": 28006,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe4932c3a368484e11f5c9",
            "name": "Barbara Kopple",
            "profile_path": "/cQ8XyOiDPZGFdUrzKbBLEMwBPXi.jpg",
            "id": 22020,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 1.918063,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 76330,
      "vote_count": 7,
      "budget": 0,
      "overview": "Wild Man Blues is a 1998 documentary film directed by Barbara Kopple, about the musical avocation of actor/director/comic Woody Allen. The film takes its name from a jazz composition sometimes attributed to Jelly Roll Morton and sometimes to Louis Armstrong and recorded by both (among others). Allen's love of early 20th century New Orleans music is depicted through his 1996 tour of Europe with his New Orleans Jazz Band. Allen has played clarinet with this band for over 25 years. Although Allen's European tour is the film's primary focus, it was also notable as the first major public showcase for Allen's relationship with Soon-Yi Previn.",
      "similar": [
         858,
         141,
         634,
         242224,
         112160,
         437557,
         297762,
         27586,
         258480,
         43923,
         18221,
         2771,
         59468,
         9587,
         3134,
         11236,
         31900,
         10735,
         9090,
         17130
      ],
      "original_title": "Wild Man Blues",
      "runtime": 105,
      "poster_path": "/oRzV5cA6W1fW78dvkSNIp4JnHqm.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Cabin Creek Films",
         "id": 7942,
         "origin_country": ""
      }],
      "release_date": "1997-01-16",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Barbara Kopple"],
      "runtime": 105,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0141986/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzU1Njg3ODcyNl5BMl5BanBnXkFtZTcwMzcwNzgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Woody Allen, Letty Aronson, Soon-Yi Previn | See full cast and crew »"],
      "reviews": [
         "For the die-hard Woody Allen fan, this is a very interesting documentary that takes a look at the man, the neurotic, and - in particular for the purposes of this film - the musician. This is a candid travelogue surrounding Woody's 1996 tour of Europe, where he was booked with his New Orleans Jazz Band to play a series of engagements. The camera follows Allen (along with Soon Yi Previn and his sister) on the plane, in hotel rooms, on the streets with appreciative fans, and of course on the stage when Woody's performing his favorite music. It's a pretty safe bet that a good chunk of the paying audience was in attendance not so much to hear the jazz as to catch a live glimpse of their favorite movie star, and that's sort of the case with us, too. The occasional concert performances are pleasant enough, but they're not the most valuable elements of the movie; for most fans, things really come alive when we get to see Allen being himself behind the scenes: getting jittery while riding in his boat in Venice, getting grossed out at the thought of a dog licking his face, cautioning people at a press conference that he's claustrophobic, struggling with an uncooperative clarinet, and musing over the respect his films receive in Europe as opposed to their indifference at home. It becomes quite amazing to see firsthand just how much of his true persona is actually what he uses to flesh out those crazy characters he plays in all his films. Nowhere is it more evident just how Woody may have wound up so endearingly neurotic than it is when he returns home to New York at the end of the film. It's then that we meet his still-living parents who seem to do everything in their power to discredit him after his long trip; dad is more interested in the quality of the engraving on Woody's overseas awards rather than being complimentary toward the honor itself; mom reminds her son not to think he made it famous all on his own, and doesn't pull punches when she gives her opinion of Woody's choice of woman. WILD MAN BLUES is not meant for just your average movie lover, but if you're a genuine fan of Woody Allen and his films, you really should catch it. *** out of ****",
         "If you thought you had be Jewish or from New York to fully appreciate Woody Allen, this movie proves otherwise. Documentarian Barbara Kopple took her hand-held camera on Allen's '96 European tour, in which he and his jazz band played a whopping 18 concerts in 23 days. She photographed him everywhere but in the \"john\": in airplanes, hotel rooms, lobbies, receptions, backstage, onstage, in the streets--everywhere. His deadpan quips and jousts buoy up what would have been a conventional travelogue. You're never sure whether Allen's being serious or satiric, but one finds one's self laughing at nearly all his comments. He's just an amusing guy. For comedic reasons, it certainly helps that Woody has one of the funniest faces around--even without his \"vanishing creme and beauty gel\" he comments is amongst his toilitry. As to his tour, this is a chance to see and hear what's been talked about for years. That is, an example of Woody's playing in that certain lower Manhattan pub where he's tooted his \"licorice stick\"--even being loyal to that group one year rather than bothering to go pick up an \"Oscar.\" Playing the clarinet since age 15, Allen admits to practicing two hours daily--a \"must,\" he says, \"just to keep the chops in shape.\" It also helps that his playing is \"only a hobby, to have fun.\" Judging from his New Orleans style jazz performance, he's probably being quite honest. But he also seems to be bringing some extra-musical attributes to his concerts--a whole range of associations with his past creative efforts. All the laughs, pleasures, joys, frustrations, and sorrows associated with his total body of work seem to be reprised as he--now a genuine icon--stands there, slim of body, pouring his heart out in every selection. Ably assisted by musicians on the trumpet, trombone, drums, piano, banjo and bass, Allen is clearly the star, appearing in a strictly all-musical format. There are only a few words of introduction and closing sentences from him. The rest is ninety minutes of pure music. How remarkable are his European followers! They simply love and adore him. They mob him outside his hotel, backstage and through the streets as he walks, taking endless photos (\"It's the same photo,\" he quips). They wave ecstatically at him as he takes gondola rides in Venice. The staid English stand and cheer at the end of his London concerts. Nationalistic Parisians drool over his weak attempts to greet them in French. Europeans also love the more esoteric Allen films, like \"Interiors,\" which flopped in the US. There's no doubt: Woody Allen is an overseas hero. An added final bonus is Allen with his mom and dad in their NYC apartment, they obviously proud of but publicly reserved about their son's accomplishments. \"In spite of the fact that you beat me daily,\" Allen quips to his mom. We're fortunate to have this 105-minute documentary for posterity. It may prove increasingly valuable as time goes on.",
         "This film provides a deeper insight into Woody Allen's private life, not to mention a treat for anyone who loves old New Orlean's jazz. What I found most interesting was seeing Woody Allen as he really is which isn't much different from his characters in his movies. His interactions with people, his humor, his moods, his explanations of himself, seeing his interaction with his parents. It was very real. Very human. Just what you'd expect from Woody Allen. Some key quotes: His wife, Soon yi said: \"When she came to see you play, she said that's the most movement she's seen from you from the whole time she's known you.\" Woody: \"The most movement? What does she expect? I mean, I'm not gonna bob my head and tap my feet when I'm talking about politics or literature or something. I'm not going to keep time. Right? Be reasonable. I'm appropriately animated for a human in the context within which I exist.\" Lady: \"You are so intelligent. You are so happy to be so intelligent.\" Woody (jokingly): \"Well, yes. It is a burden though sometimes. With this much intelligence comes great responsibility. You know. It's lonely at the top.\" In the hotel restaurant walking around: \"Oh, there's the band. Oh, my goodness, they're eating like their going to the 'chair'.\" \"Whenever I travel, I always have to have my own bathroom because I'm crazy. So I always wind up taking an extra room or an extra suite of rooms. Then I can place around all my unctions and vanishing creams and the cosmetics that give me this look.\" With his wife at breakfast in their Milan hotel: \"You know, this being Milan, I hope our laundry doesn't come back breaded.\" \"I've got the kind of personality that when I'm here (Europe) I miss New York and when I'm in New York I miss Europe. I just don't like being where I am at any given moment. I would rather be somewhere else. So you know there's no way to beat that problem because no matter where you are, you know what I mean, it's chronic dissatisfaction.\" In London with a bad cold: \"What a drag. I was looking forward to giving a good show tonight. I don't want to just go out there and make an achievement till I get through the show. I want the show to be very good cause if I'm not good, these people will hate me in my own language.\"",
         "Wild Man Blues (named after a terrific Louis Armstrong song) shows Woody Allen during his trip to Europe and abroad for a tour with his Jazz band. So the question you might be asking is, how much is shown? How candid does filmmaker Barbara Kopple go into the behind-the-scenes and off-the-stage stuff in the film? One could say not enough, but then how personal can one get with a cinematic heavyweight like Allen? True, it's not always just him that carries the interest in the film; his New Orleans Jazz band (the same, more or less, that gave that hilariously cool score for his film Sleeper) is toe-tapping fun, especially if you like this sort of music (I got into it a little more after watching the Ken Burns documentary), with Eddie Davis the banjo player and director of the group a real treat. It may be odd to say, but despite Woody's talent at the clarinet, it sometimes doesn't bring as much attention for one as does the 'talky' scenes. And some of these, of course, have the young Soon-Yi Prevlin in tow. This was of course a few years after the whole hoopla went over about the break-up and all. It's curious to see how their relationship goes in the film, what is and what isn't shown, and this is I think when Kopple gets the most personal, even if it's a little uncomfortably so. Indeed, this is an Allen that is not really like the one he portrays in film after film- it does have the moments of humor, and his neuroses are in full view of the lens. But by giving it this extra view, it shows him as much more of a relatable person, or maybe not (the film does show him in Europe as being far more celebrity-like than here). In all, it works best as an objective view of the subject matter, of a director who also happens to be a good musician who enjoys playing what he calls \"crude...esoteric music\" of old. It is, at least for the Woody admirer, entirely watchable.",
         "4 Oscars on his shelf and a great legacy as comedian and filmmaker that goes for more than five decades Woody Allen doesn't need to prove his geniality to anyone. Talented director, actor, writer and very creative, and at times surrounded by some controversial but still a genius. Barbara Kopple's documentary \"Wild Man Blues\" brings us a little more closer to the man who has an very enthusiastic passion for jazz, playing the clarinet with his jazz band, reason why he never attended the Academy Awards (he only went in 2002 to make a tribute to New York) or any other awards show. Following Woody along with Soon-Yi, we have the pleasure to watch the director of classics like \"Hannah and Her Sisters\" and \"Bullets over Broadway\" on a tour in Europe doing what he likes the most, playing music, showing his skills with the clarinet (and he's a good player by the way) entertaining audiences with the old New Orleans jazz (and boy, he got some really big crowds to his shows, treated like a rock star). More than just the tour, this is an intimate portrait of Woody Allen, his life and his work, his views on music and films, his relation with Soon-Yi, and even a family breakfast with Woody's parents. There's plenty of space and time to enjoy his hobby and watch the man making jokes all the time, at times a little depressed or a little bit cranky but never being snob or arrogant as some of his written interviews tend to sound. Some shocking revelations such as the fact of Soon-Yi watched all of Woody's films except \"Annie Hall\"; or when Woody discussed about getting a Life Achievement Award by the DGA when Fellini never got one, he (and us) can't understand that. Greater than all that is his jokes whatever the occasion, talking about the people he sees on the way (\"They won't pay ten cents to see one of my movies, but passing in a gondola, they love it.\") or talking to Soon-Yi about the concierge of the luxury hotel they stayed in. It's delightful to see when he talks about the films that failed at box-office in America but are a huge hit all over Europe (\"Interiors\", \"Another Woman\", and others). And if you pay attention to his opinions you'll see that most of them will be referred in his future films e.g. when he says about suffering of chronic dissatisfaction. He quoted that in \"Vicky Cristina Barcleona\". Or the way he richly describes Paris, place where he would make the film that gave his 4th Oscar this year, \"Midnight in Paris\". It's all there! Entertainment and reality at its best, \"Wild Man Blues\" allows us to know a little better about the creator of cinematic masterpieces, presenting the man in a different way than we're used to see (ok, he's less neurotic than the characters he play). Have fun! 10/10",
         "\"Wild Man Blues\" is a truly entertaining documentary about Woody Allen touring through Europe with his New Orleans Jazz Band. Every Monday they use to play at Michael´s Pub in Manhattan. It took a long time until Mr. Allen was persuaded to leave New York and to play in European concert halls, he knew too well that people would come to see him and not because of his inspired clarinet soli. Director Barbara Kopple accompanies him during his concerts and even into his luxurious hotel suites. Not unexpected it turns out that Mr. Allen has strange travel habits. The best moments of the film are when the people that always surround Allen never cease to to express their admiration for him, just like they do in his movie \"Stardust memories\"(1980) which was a disaster. His fans realized that this satire was directed at them and they recognised themselves in the characters of \"Stardust memories\". Kopples film reveals that Allen has learnt to live with them. He reacts with a warm smile and a little bit of sarcasm when every day he is told a dozen times \"you are the greatest, I love your movies, mostly your earlier and funny ones, why can´t you go on making funny movies...\". However, \"Wild Man Blues\" is a very funny film.",
         "Here is the famous filmmaker-actor-comedian in a forthright documentary of his touring jazz-band. It's not really his band \u0096 but for all intents and purposes it may as well be. If it weren't for Woody this band would just be another New Orleans jazz style band. They certainly wouldn't fill any concert halls across Europe (in fact they wouldn't be there at all). We see a lot of Woody and Soon Yi in candid conversations \u0096 many of them in lavish hotel rooms in Europe (I am not kidding \u0096 one has a private swimming pool!). There is a sequence at the end with Woody's parents' in Brooklyn \u0096 this is hilarious and looks like it is straight out of one of his films. I have to admit that Woody is quite gracious with his fans who obviously adore him. If you're a fan in any way this is recommended, its' Woody as cinema verite. The only complaint I have is too many performances of the jazz-band.",
         "I don't know how I missed this film when it was released. It's thoroughly enjoyable on at least two levels: the New Orleans jazz and Allen's comic gifts. There's a third level -- the European scenery. It's interesting as a travelogue, if a bit jerky, which is realistic considering the jumping from one city to the next in so short a time. But the thing that stays with me the most is the high quality of Allen's trenchant observations on the passing parade, on mundane matters, such as his thoughts on the note he composes for inclusion in his hotel laundry. I am not a fan of the slick, glib one-liners Allen became known for early in his career, but in this film we have a more mature person, a man who obviously cherishes the relationship with Soon Yi and who respects his parents after life has smoothed the edges of his angst and has enabled him, it seems, to gain deeper insights into the passing parade.",
         "I have been a Woody Allen fan most of my life. I enjoyed his silly era (\"Bananas\", \"Sleeper\"), his playful stuff (\"Annie Hall\", \"Hannah and Her Sisters\") and especially his thoughtful movies (\"Crime And Misdemeanors\", \"Manhattan\"). I'll leave the last decade or so alone, since making a movie a year has got repetitious and somewhat stale. All that said, I remain a fan and was excited to see a documentary on Encore, of his 90's European tour with his \"New Orleans Jazz Band\". I have seen him perform with his band, so I knew the quality of his playing and his excellent band would add to any enjoyment of the movie. Helmed by an award winning director, I was most interested in that phase of his life. The timeframe was shortly after he announced his love for his ex-lover's adopted daughter, Soon-Yi Previn. Their relationship, prior to their marriage, is depicted here with no intimate moments, but they have a \"nice\", gentle chemistry with each other. She encourages him, mildly scolds him, comforts him and seems to enjoy their trip. Despite being 35 years younger, she seems to be the more travel savvy, even the more adult of the two. This is probably because Woody is out of his New York routine. He is followed every foot of the way by photographers, has pre and post concert functions to attend, and must stay in suites that are a tad pretentious to his NY roots. Its fun to watch, if a bit sterile. As expected, much of the film is dedicated to his on stage playing and it is decidedly good. His band is in excellent form. The crowds are very appreciative, almost all adoring fans. While the crowd in Rome is a bit stoic, Woody still plays his 90 minute plus show. There are some eavesdropped conversation that show his wit, and some of his foibles (he must have his own bathroom, he seems to always be starving, etc.). His conversation with fans, and even his parents, bounce from appreciative to impatient, but mostly seem fair. He is able to come and go as he pleases in NYC, but is pushed and prodded pretty good here. The most telling quote about his life is summed up by a roof top conversation with Soon-Yi. He admits that he loves NY and loves Europe, but....he'd always rather be in NY when he's in Europe and Europe when he's home. He admits that it is difficult to enjoy things, given that phobia. I enjoyed having a camera's eye there for me to observe. The odd and soundly criticized relationship with Soon-Yi seems to have withstood the test of time. Woodman, keep playing your music!!",
         "I really love this movie. Woody Allen appears as a very nice man. Other comments are very right, referring to his movie Stardust Memories. I think it's a little bit sad that all these people wants to see him because he's a famous actor and director, and not because of the music he and his partners seems to love so much. That happens to be my favorite kind of jazz (Jelly Roll Morton! Yeah!) and the band are doin' it in a very attractive way. This movie should be just about music."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Jean Doumanian Productions",
         "Cabin Creek Films",
         "Sweetland Films"
      ],
      "summaries": ["Academy Award-winner Barbara Kopple directs this documentary portrait of Academy Award and Golden Globe-winner Woody Allen (Annie Hall, Blue Jasmine), seen traveling with friends and fellow musicians during their New Orleans jazz band's 1996 European tour. Allen's relationship with wife Soon Yi Previn is captured on film here for the first time, and others on the European jaunt include Allen's sister Letty Aronson. Followed by press, paparazzi, and gushing admirers, Allen returns home to face a more realistic critical assessment during \"the lunch from hell\" with his aged parents."],
      "budget": 0
   },
   "movielensId": 1865,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Italiano"
      ],
      "releaseDate": "1997-01-16",
      "dvdReleaseDate": "2005-11-22",
      "directors": ["Barbara Kopple"],
      "runtime": 105,
      "movieId": 1865,
      "title": "Wild Man Blues",
      "mpaa": "",
      "actors": [
         "Woody Allen",
         "Letty Aronson",
         "Soon-Yi Previn",
         "Dan Barrett",
         "Simon Wettenhall",
         "John Gill",
         "Greg Cohen",
         "Cynthia Sayer",
         "Eddy Davis",
         "Nettie Konigsberg",
         "Martin Konigsberg",
         "John Doumanian"
      ],
      "imdbMovieId": "0141986",
      "originalTitle": "Wild Man Blues",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": ["MXld5YUBb1Y"],
      "plotSummary": "Wild Man Blues is a 1998 documentary film directed by Barbara Kopple, about the musical avocation of actor/director/comic Woody Allen. The film takes its name from a jazz composition sometimes attributed to Jelly Roll Morton and sometimes to Louis Armstrong and recorded by both (among others). Allen's love of early 20th century New Orleans music is depicted through his 1996 tour of Europe with his New Orleans Jazz Band. Allen has played clarinet with this band for over 25 years. Although Allen's European tour is the film's primary focus, it was also notable as the first major public showcase for Allen's relationship with Soon-Yi Previn.",
      "tmdbMovieId": 76330,
      "avgRating": 3.45188,
      "releaseYear": "1997",
      "numRatings": 426,
      "posterPath": "/oRzV5cA6W1fW78dvkSNIp4JnHqm.jpg"
   }
}