{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "tarzan",
            "id": 7347
         }
      ],
      "imdb_id": "tt0120856",
      "video": false,
      "title": "Tarzan and the Lost City",
      "recommendations": [57597],
      "backdrop_path": "/dY0PPUlFHvh6RctsrbPVugyfbdu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tarzan / John Clayton",
               "gender": 2,
               "credit_id": "52fe46c99251416c9105fc6b",
               "name": "Casper Van Dien",
               "profile_path": "/ktJIgsilxxQeOvA9I789veHnDnt.jpg",
               "id": 27763,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jane Porter",
               "gender": 1,
               "credit_id": "52fe46c99251416c9105fc6f",
               "name": "Jane March",
               "profile_path": "/9x1Mtvsj3QvA8yVhYN7tzdSp5oM.jpg",
               "id": 21817,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Nigel Ravens",
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fc85",
               "name": "Steven Waddington",
               "profile_path": "/ouQIklNVVkqlW1Htujmptm2qTen.jpg",
               "id": 27764,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mugambe",
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fc89",
               "name": "Winston Ntshona",
               "profile_path": null,
               "id": 75790,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Kaya",
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fc8d",
               "name": "Rapulana Seiphemo",
               "profile_path": null,
               "id": 13098,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Wilkes",
               "gender": 0,
               "credit_id": "52fe46ca9251416c9105fc91",
               "name": "Sean Taylor",
               "profile_path": null,
               "id": 152522,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Schiller",
               "gender": 0,
               "credit_id": "52fe46ca9251416c9105fc95",
               "name": "Gys de Villiers",
               "profile_path": "/pXv5G2mGa8pUqWv56lADhJYKByo.jpg",
               "id": 231649,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Archer",
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fc99",
               "name": "Russel Savadier",
               "profile_path": "/7pIhgAhADIz6cNIqYFNwL9WoypN.jpg",
               "id": 105364,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Jerjynski",
               "gender": 0,
               "credit_id": "52fe46ca9251416c9105fc9d",
               "name": "Paul Buckby",
               "profile_path": null,
               "id": 554584,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Captain Dooley",
               "gender": 0,
               "credit_id": "52fe46ca9251416c9105fca5",
               "name": "Ian Roberts",
               "profile_path": "/HiVItNtPii0NreWhBN5F7fDNkL.jpg",
               "id": 1035098,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Knowles",
               "gender": 0,
               "credit_id": "53455ae80e0a267bc3001c48",
               "name": "Zane Meas",
               "profile_path": null,
               "id": 1246691,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c99251416c9105fc67",
               "name": "Carl Schenkel",
               "profile_path": null,
               "id": 47924,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c99251416c9105fc75",
               "name": "Edgar Rice Burroughs",
               "profile_path": "/8JlB8S3XSwRAyampS0nI4cqoa8q.jpg",
               "id": 15776,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ca9251416c9105fc7b",
               "name": "Bayard Johnson",
               "profile_path": null,
               "id": 554582,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ca9251416c9105fc81",
               "name": "J. Anderson Black",
               "profile_path": null,
               "id": 554583,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "593e5e8cc3a3680f1402c05c",
               "name": "Dustin Hoffman",
               "profile_path": "/3pZx8NB30KIw31rBAT62TUDQFEb.jpg",
               "id": 4483,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 1.929936,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 38618,
      "vote_count": 12,
      "budget": 0,
      "overview": "Tarzan returns to his homeland of Africa to save his home from destruction.",
      "similar": [
         258489,
         10603,
         9732,
         10527,
         11430,
         34851,
         2454,
         7446,
         411,
         9273,
         46195,
         37135,
         172385,
         314095,
         278927,
         8355,
         9325,
         630,
         792,
         353486
      ],
      "original_title": "Tarzan and the Lost City",
      "runtime": 83,
      "poster_path": "/mdKJwKYuetImwY2aTG4wSz60mB6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Film Afrika Worldwide",
            "id": 4792,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dieter Geissler Filmproduktion",
            "id": 1766,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alta Vista",
            "id": 60294,
            "origin_country": ""
         },
         {
            "logo_path": "/tpFpsqbleCzEE2p5EgvUq6ozfCA.png",
            "name": "Village Roadshow Pictures",
            "id": 79,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Clipsal Films",
            "id": 10566,
            "origin_country": ""
         }
      ],
      "release_date": "1998-04-24",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Carl Schenkel"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Edgar Rice Burroughs",
         "Bayard Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120856/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5OTQ0NDI2MF5BMl5BanBnXkFtZTcwNTM2MzQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Casper Van Dien, Jane March, Steven Waddington | See full cast and crew »"],
      "reviews": [
         "I enjoyed this film. It was nice to jump PAST the point where Tarzan was discovered, to a point where he had left the jungle and returned to England for socialization. Casper is an intelligent, grunt-free version of Tarzan who returns to the jungle after getting a psychic call \"home\" from his shaman friend. The movie remained focused on the goal set at the beginning, to save the Lost City from a power hungry treasure hunter. I didn't feel lost or that any of the events were fluff. There is a nice display of magic which was presented well by the special effects team. All of the acting was well done and not overdramatized. I would very much like to see the story continued by this team of creators and actors.",
         "I can't complain at all about this movie. It gave me everything I was hoping for. It's cheesy and fun! I grew up on classic Tarzan flicks and jungle movies. I watched various classic Tarzans including Ron Ely and Johnny Weissmuller. I never missed a chance to catch a Tarzan movie on TV as a kid. Tarzan and the Lost City recaptures that type of childhood magic. It entertained me from start to finish. Its flaws are part of its charm and only add to the fun. All classic Tarzan movies have flaws. So what!? That's part of what makes 'em GREAT FUN! Tarzan and the Lost City is no exception. It provides this classic jungle movie fan with plenty of entertainment value. It's great fun with a big bowl of popcorn and a cold beverage!",
         "Being something of a Tarzan fan, it really isn't that hard to entertain me with the man in the loin cloth (except for the awful, near pornographic, movie with Bo Darek). And in todays world of cgi crapfests, this was a welcome return to real world adventures. It takes place in a real place the jungles of Africa. Has a real cast, no JarJar Binks to be found. And most importantly has a plot that goes somewhere. I think Casper Van Dien did a great job as Tarzan, and Jane March was excellent as Jane. The only drawback at all was the use of magic at the climax, it sort of negated any need for Tarzan to even show up (except to give us a few pics of eye candy). This film's drawbacks are minor when compared to those of other adventure films. It's got a lot of beautiful, and genuine scenery, which only helps to inspire the imagination. It is extremely family friendly, you can watch this with little kids and not worry about giving them nightmares or rotting their brains. Well worth getting on DVD and having an exciting Thursday evening with your kids, or parents as your own age my determine.",
         "I liked this version of Tarzan and I think that it is closer to the book than any other movie that I have seen. This Tarzan is quick on his feet and very quick witted. He is smart,just like the one in the books. Jane is supposed to be an American, why everyone puts her in England is beyond me. I liked this Jane very much and felt that her portrayal was right on the money. I even liked the bad guys and the natives, especially the singing and dancing. Overall it was a plus except that the scenes with Tarzan and Jane were too short and seemed to be cut too soon.",
         "Yes!! In the age of so many films that slap you in the face with so many f/x, it was refreshing to watch a movie with real people and real actors. The new TARZAN and the LOST CITY brought the character to a new level for a whole new generation. Casper Van Dien was an excellent Tarzan and most important, Mr. Van Dien's performance was on target. I enjoyed the film and I am sure that you will too!",
         "Jeez, this is a hard bunch to satisfy. As my screen name indicates I am a stone cold Edgar Rice Burroughs freak and, for ERB fans, Tarzan flicks are less to be enjoyed than to be endured. Our suffering has been great and it has been long. When you have paid hard wampum to sit through \"At The Earth's Core\"....when you have an actual opinion as to whether Buster Crabbe was a better actor than Johnny Weissmuller....when you can explain the difference between Nyoka, Sheena and Rulah....then you can tell us what a lousy Tarzan movie this is. For those Happy Few who fit the description above, you are going to like this film just fine and, in fact, you have probably already seen it. It's not the real McCoy, but you've doubtless given up on that by now.",
         "The movie is truer to the original Tarzan of E.R.Burroughs than almost any other one I've seen and I've watched them for over 40 years and have read 10 of the original books. Although the acting may not be first rate the story line isn't too far from the City of Opar book. I'd prefer more of the \"savage, but civilized\" side of Tarzan to be portrayed, along with less chimp and fake gorillas.",
         "Casper Van Dien joins a long list of actors/athletes to essay the part of Edgar Rice Burroughs famous man of the jungle. As far as looks go he certainly fits the role, loincloth and all. Tarzan is as eternal on the screen in his history as Sherlock Holmes. Both of them if you remember were brought up to date during World War II to aid the Allied effort. And Tarzan had several modern adventures through his many films and television roles right up through the nineties. But on the cusp of a new millennium the Ape Man is returned to the period in time where Edgar Rice Burroughs set him in, clearly in British colonial Africa. Tarzan in fact has returned home to claim the title of the Earl of Greystoke and he's going to marry Jane March as Jane Porter. But Van Dien gets one of those instinctive feelings, the kind that Chuck Norris gets when his Cherokee people are in trouble on Walker, Texas Ranger. He postpones the wedding to an exasperated Jane and heads to Africa. Some of his native friends are indeed in trouble. A scientist who's hired a bunch of what would be called trailer park trash now is on the verge of discovering a lost city with untold wealth. It will make things worse than ever for the natives under colonialism if this archaeological Holy Grail is discovered. Casper tries to reason with the scientist and then takes the more Tarzan like approach to the problem. But things do get real complicated when Jane follows him to Africa. Tarzan and the Lost City is an old style adventure story with the benefit of 90s computer graphics. It's also politically sensitive, not portraying the natives as they were in those old Tarzan films from the studio days. And of course it's filmed entirely in Africa, certainly not done by MGM or RKO back in the day. In the jungle Casper's great to look at and a wonder to behold. But why did he try to adopt that English accent. He sounded silly when he used it. You notice Johnny Weissmuller never even attempted one. Of course they did keep his dialog to a minimum. Despite the accent, this latest big screen Tarzan is a good film and Casper Van Dien is a worthy successor to Johnny Weissmuller, Lex Barker, Gordon Scott, etc.",
         "Since there was so much comment on the \"fake gorillas,\" I think it is worth pointing out that these were not in fact intended to be gorillas but rather the fictional race of \"great apes\" that raised Tarzan in the Burroughs novels. They were supposed to be something closer to humans, with a language developed enough that it could be translated into English - in fact Tarzan was a word in the great ape language meaning \"white skin.\" You can quibble about how successful the movie portrayal of these creatures was, but any Burroughs fan will recognize what they were trying to do. In any case, it was a brief sequence. I thought this movie was surprisingly good and came closer to capturing the flavor of Burroughs' later Tarzan novels than anything else I have seen. Burroughs, after all, was primarily a fantasy writer and there is no point in holding his fiction to any \"realistic\" standard. The production standards were quite good and I liked the principal actors. In fact, Van Dien may be my second favorite Tarzan, after Gordon Scott.",
         "I loved this Tarzan movie, as it goes right away from the normal Tarzan movie. I liked that it has the same type of features that Tarzan of the past has had, but with a new look to head into the next generation. Casper Van Dien really shines in this movie, he has an amazing amount of energy, which this film needed. This Tarzan movie has a new twist, with old ways of life meeting the new way of life. I think it is a great movie."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Dieter Geissler Filmproduktion",
         "Alta Vista",
         "Village Roadshow Pictures"
      ],
      "summaries": [
         "On the eve of his wedding, John Clayton, Lord of Greystoke (better known as Tarzan), receives a message from the witch doctor Mugambe that his homeland is in danger. It turns out that a treasure hunter named Ravens is searching for the lost city of Opar, and is destroying the jungle and desecrating the villagers' burial grounds in the process. Only Tarzan can stop Ravens and set things right in the African jungle, but will Jane stand for her fiance being away for so long?",
         "Tarzan returns to his homeland of Africa to save his home from destruction."
      ],
      "budget": 20000000
   },
   "movielensId": 1867,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-04-24",
      "dvdReleaseDate": "1999-07-27",
      "directors": ["Carl Schenkel"],
      "runtime": 83,
      "movieId": 1867,
      "title": "Tarzan and the Lost City",
      "mpaa": "PG-13",
      "actors": [
         "Casper Van Dien",
         "Jane March",
         "Steven Waddington",
         "Winston Ntshona",
         "Rapulana Seiphemo",
         "Sean Taylor",
         "Gys de Villiers",
         "Russel Savadier",
         "Paul Buckby",
         "Ian Roberts",
         "Zane Meas"
      ],
      "imdbMovieId": "0120856",
      "originalTitle": "Tarzan and the Lost City",
      "genres": [
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["kBSj77k_jxg"],
      "plotSummary": "Tarzan returns to his homeland of Africa to save his home from destruction.",
      "tmdbMovieId": 38618,
      "avgRating": 2.13898,
      "releaseYear": "1998",
      "numRatings": 295,
      "posterPath": "/mdKJwKYuetImwY2aTG4wSz60mB6.jpg"
   }
}