{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fbi",
            "id": 1812
         },
         {
            "name": "truck",
            "id": 9276
         }
      ],
      "imdb_id": "tt0120610",
      "video": false,
      "title": "Black Dog",
      "recommendations": [
         24993,
         33172,
         30653,
         27224,
         26261,
         10081,
         18551,
         2620,
         29739,
         4954,
         20762,
         59232,
         6470,
         19118,
         31652,
         19017,
         24558,
         38940,
         47045,
         4988
      ],
      "backdrop_path": "/k4c8UPuRzyKbp1AAUMT7M0Mdmpp.jpg",
      "revenue": 12,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jack Crews",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d57",
               "name": "Patrick Swayze",
               "profile_path": "/b5G8AGP609DsUeokQ1asnqYJBSl.jpg",
               "id": 723,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Red",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d5b",
               "name": "Meat Loaf",
               "profile_path": "/43nyfW3TxD3PxDqYB8tyqaKpDBH.jpg",
               "id": 7470,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Earl",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d5f",
               "name": "Randy Travis",
               "profile_path": "/fxTlJ3kRNG1vURYeHAHjpOjHzbv.jpg",
               "id": 55725,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sonny",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d63",
               "name": "Gabriel Casseus",
               "profile_path": "/hq47yaZk40VSv0rbdtrrj5J5zzL.jpg",
               "id": 18272,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Cutler",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d67",
               "name": "Graham Beckel",
               "profile_path": "/hv1BySh6NFhR9dz1xtqdKn3gGCF.jpg",
               "id": 6110,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Melanie",
               "gender": 1,
               "credit_id": "52fe47739251416c75099d6b",
               "name": "Brenda Strong",
               "profile_path": "/gjmYWKrfqST0HJ42bjO52NE4E4A.jpg",
               "id": 101396,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Junior",
               "gender": 0,
               "credit_id": "52fe47739251416c75099d6f",
               "name": "Rusty De Wees",
               "profile_path": null,
               "id": 101397,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Wes",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d83",
               "name": "Brian Kelly",
               "profile_path": null,
               "id": 101395,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Vince",
               "gender": 0,
               "credit_id": "52fe47739251416c75099d73",
               "name": "Cyril O'Reilly",
               "profile_path": "/e9c8qaVnuckiZfc8xSkjFifVaGt.jpg",
               "id": 64224,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Tracy",
               "gender": 1,
               "credit_id": "52fe47739251416c75099d77",
               "name": "Erin Broderick",
               "profile_path": null,
               "id": 101398,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Ford",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d7b",
               "name": "Charles S. Dutton",
               "profile_path": "/ajXBoMz8xGgDDcn8xpRi8LmXKKa.jpg",
               "id": 17764,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "McClaren",
               "gender": 2,
               "credit_id": "52fe47739251416c75099d7f",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47739251416c75099d53",
               "name": "Kevin Hooks",
               "profile_path": "/xqzV7byaH95GSvR86JjGzHceIY4.jpg",
               "id": 40230,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58ace0299251411f84001d7b",
               "name": "William Mickelberry",
               "profile_path": null,
               "id": 1384174,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58ace0389251411f84001d84",
               "name": "Dan Vining",
               "profile_path": null,
               "id": 1458271,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.794242,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 18316,
      "vote_count": 51,
      "budget": 0,
      "overview": "An ex-con takes a job driving a truck cross country. What he doesn't know is that the truck is filled with illegal weapons and now he must fight to survive and save his family.",
      "similar": [
         9802,
         8836,
         261023,
         273481,
         8838,
         10538,
         10431,
         13027,
         4349,
         3595,
         9584,
         1632,
         38322,
         1538,
         1571,
         891,
         7551,
         9659,
         36648,
         82675
      ],
      "original_title": "Black Dog",
      "runtime": 88,
      "poster_path": "/ov3xpvjZxQ24kJPCgAu3eJ5y8S2.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1998-05-01",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "The rules of the road are simple. Don't turn back.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kevin Hooks"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "William Mickelberry",
         "Dan Vining"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120610/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5NzgxMDE5OF5BMl5BanBnXkFtZTcwMjM3MTAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Patrick Swayze, Randy Travis, Meat Loaf | See full cast and crew »"],
      "reviews": [
         "I am no fan of the stars of this movie or a truckdriving buff or interested in country music (not that that's overly relevant.) I borrowed this tape with low expectations but was happily surprised by how entertaining it was. What has happened to Patrick Swayze? I thought he did a good job acting in both Donnie Darko and now this. THIS film is what goofy, illogical action flicks are supposed to be. This isn't simply a music video stretched out to an hour-and-a-half. This director actually knows how to make a movie. The plot ain't deep but there IS a plot, which is important. The ideas are dopey but the actors aren't simply laughing their way through but rather they treated this like a serious work. The actress who plays Swayze's wife has a style which usually annoys me but she, too, was ok in this thing. Even the little bits of country music didn't bother me. A stupid finale? Sure, but even that was fun. Wow.",
         "Patrick Swayze shines in one of the best films in the truck-driving genre. The main character Jack Crews (Swayze) plays an ex-con/truck driver/plaid shirt enthusiast who gets more than he bargained for! Literally. In effort to make some much-needed money for his poor family, Crews bargains with a small arms dealer, played by Meat Loaf. Crews agrees to deliver the shipment for Meat Loaf in exchange for some cool cash. As you may have figured out by looking at the movie cover, Crews encounters hordes of inept henchmen along the way. Fortunately for Jack Crews, their vehicles explode easily. Still, Crews n' Company face many action-packed twist and turns on their journey. Swayze gives a spectacular performance; deserving of the either an academy award or employee of the month. I would recommend this film to anyone with eyes.",
         "When this movie came out, the usual pooh-poohers whined and complained about how it had a dumb script, a paper-thin plot, and cardboard characters. I wanted to smack them all upside the head for stating the obvious. Duh! That's the whole point! Patrick Swayze has made some very good dramas (Ghost, City of Joy), and some very cheesy ones (To Wong Foo) and he knows the difference. Anyone who tries to take this movie seriously is missing the point. This one is a terrific guilty pleasure, with over-the-top performances by Swayze and his musician co-stars (Meat Loaf, Randy Travis), and some spectacular chase scenes complete with some truly cheesy touches (every automobile that crashes explodes, regardless of whether the gas tank is actually damaged or not). Trust me, this one's worth checking out, as long as you check your brain at the door.",
         "No truer words, Swayze looked weathered. But I guess some truckers just do. I sort of enjoyed the story, the beginning definitely ignites the rest of the action. This has some 'skill' linked-up in the driving, I learned a couple cool things about Big Rigs, that I didn't realize before however, I haven't seen diesels doing stuff like that since, 'Breakdown' 'CONVOY' or 'Duel'. Patrick is pretty much always fun to see act in any movie that he is in, other than the banter back and forth from the Evil-Graeme Beckel's character, who had taken his wife (played by Brenda Strong, the woman walking down the street only in a 'bra' that caused 'Kramer' from Seinfeld to crash his car T.V.s Seinfeld) and daughter, then making it through that Hellish chase situation and accident, only to lose a new found friend 'Sonny' the F.B.I. man, suddenly being sideswiped by The heavier-weight-coupon clipping-Jimmy Swaggart-wannabe-evil boss Singer rock star/actor Meatloaf at the end of this flick, Jack (Swayze) can't get an even break. However this is how most big budget Studio production houses usually take it into their hands to change a movie script until the believable is now ridiculous, usually at the end of a movie. Kind of like when Sidney J Furie made \"Superman IV\" and the Studio execs slashed his budget in half...this time however at pretty much the last minute, before scene shooting got started. But Blackdog is entertaining and fun,the cast is a great cast. Heck with a good beer it gets even better. But please if you must drink, stay at home and be nice to those around you.",
         "I saw this movie on cable and never saw it in theaters but it was on at 2:00 am and I had a test in my Philosophy class. I said \"screw the test\" and watched this movie. I have never been a fan of Mr. Swayze. Didn't see Dirty Dancing or that movie where he plays a tough bouncer. Didn't want to. But this movie is very good for what it is worth. First of all, I compare the storyline to Smokey and the Bandit....except minus the humor and lamentably the actors. The movie is about a ex-con trying to save his house by driving a truck full of illegal weapons across the eastern seaboard. You've got some great people in this movie +Patrick Swayze: he looks like he could be a truck driver +Randy Travis: who I admit I didn't recognize with the beard. I have no idea why he grew it +Possibly 50 Cent's brother. No doubt..when you see this man (who isn't related) you'll hear Wanksta begin playing +And the best Bloated Bible Thumping Meat \"Old Ass Bat Out Of Hell\" Loaf..who I cant believe actually CHOSE that name. This movie is not geared towards film buffs nor does it pretend to do so. This movie is for those who love the road and Cannonball Run (the first one only, jeez) or Smokey and The Bandit(Numbers 1 and 3..Dom Deluise and that retarded elephant killed number 2) The rest of the characters are a joke (especially the FBI agents...ever seen Pardon The Interruption?) but this movie is nothing more than an exciting and hard to stop watching road classic. Plus I live near where they drive the truck through (how about some love for South Carolina and N. Carolina looks amazing in the movie) So In conclusion, don't put down your Dead Poets Society or your Good Will Hunting for this, but sit back with a beer and enjoy this modern classic.",
         "Black Dog starts as just out on parole truck mechanic Jack Crews (Patrick Swayze) is called into the office by his boss Cutler (Graham Beckel), he tells Jack he's got a job for him to drive a truck from Atlanta to new Jersey & he'll get paid $10,000 for it. Jack isn't keen on the idea since he has no license & wants to stay out of trouble for his families sake, at home that night Jack finds a foreclosure letter hidden by his wife from the bank who are going to repossess his families house. Amazingly they owe the bank $9,000 so that $10,000 he was offered just hours before suddenly looks very tempting. Jack accepts the job but soon finds himself hauling a lorry of guns which are being tracked by the FBI & local redneck scumbag Red (Meat Loaf) wants to hijack the truck & steal them for himself, I guess Jack is just having one of those days... Directed Kevin Hooks Black Dog is a cheesy but sort of fun action flick that could have been better but also could have been worse. The somewhat predictable script by William Mickelberry & Dan Vining doesn't take itself too seriously & feels like an extended version of the final climatic truck chase from Mad Max 2 (1981) in the sense Jack has to protect his truck from all sorts of marauding bad guy's, obviously Swayze is no Mel Gibson & the two don't compare in terms of excitement or quality but that's what I kept think while I was watching it. The character's are clichéd & one dimensional but they serve their purpose well enough, there's some alright one-liners including a funny one where a bad guy ends up splattered on the road & Swayze says 'Eeww, roadkill'! That line alone is almost worth watching this for. It certainly moves along at a brisk enough pace, you've got your bad guy's & you've got your good guy's as well as those caught up in the middle & you know what I actually thought Black Dog was pretty fun, it's not art but it's entertaining & how can you not like a film in which the main villain is Meat Loaf & the main hero is Patrick Swayze? You can't & it's as simple & straight forward as that. Director Hooks does alright, some of the truck crashes are impressive although the actual chase scenes lack a little spark, they are OK but not quite as exciting as I'd have liked. There's not much violence apart from a few shoot-outs & a fight at the end. Talking of the end even though Swayze has been hauling a lorry of guns & making lots of things blow up the FBI give him back his license, they let him go scott free, they take care of his $9,000 debt & let him drive the truck to the police pound. Isn't that a bit, well, generous? I mean he beat Cutler up didn't he? That in itself is assault & it doesn't matter if the guy he beat up is a scumbag either, also what about all the destruction he caused? Surely he broke the terms of his parole somewhere along the way, didn't he? Technically the film is fine, it looks like it had some money spent on it although it doesn't quite look like a mega budget affair. The acting is OK, Swayze looks bored & embarrassed, Meat Loaf is Meat Loaf while Charles S. Dutton puts in a funny performance as FBI agent Alan Ford (Ford? Trucks? Is that meant to be an in-joke because I ain't laughing guy's!). Black Dog is a silly, cheesy & amusing way to pass 90 odd minutes, it's a light hearted action flick using big trucks. It's watchable enough for sure.",
         "I really enjoyed this movie. I do prefer intelligent thrillers, but I don't mind unrealistic stuff if it's good. It was surprising to see Patrick Swayze was in this movie, seeing that it's so unrealistic and it's what would seem like a fool's errand in the eyes of the critics, but I credit his performance. It is about a truckie who is driving a truck filled with firearms, while guys come along, try to kill them, and get the guns. Meat Loaf's acting performance wasn't great, he should have just made a contribution to the soundtrack, and I thought he was over-the-top at the end, racing a truck, wildly raving and chanting bible verses. But the action scenes are good, despite the unrealism. Explosions happen when they wouldn't normally, and shooting people doesn't seem to do anything but make them wince. At one stage, Patrick Swayze is beating a guy up on the truck, and Meat Loaf comes along in his ute-type vehicle, and shoots him in his arm. He winces, but he keeps punching with the same vengeance and strength as before. Despite lack of credibility, it was an exciting adventure and was a film about truck-driving, which I have never actually seen in a movie before. Overall, it was great and the chase scenes are very well-done sometimes. If you aren't expecting too much and don't mind unrealistic things, and you like action movies, see this.",
         "For the genre movie that this is, it's a pretty enjoyable movie to watch. It's definitely no worse or better than any other similar simple straight-forward action flick from the '90's. Of course the movie is suffering from more than 1 problem though. One obviously is its story. It's simple and actually doesn't make a lot of sense and is a real unlikely one. I mean, why did Red ever let the truck drive off from his place, only to dangerously attempt to hijack it later, on the very same day. But oh well, without this story we wouldn't had all those exploding trucks and action scenes within this movie. Well, it's not like the action is much spectacular though. Funny enough there are lots of exploding trucks and cars but they already seem to blow up when one of the passengers farts. Action-wise this movie just isn't good or spectacular enough to watch. Another problem with the movie is that it has far too many villains in it. It's like the main characters against the rest of the world. The movie also doesn't seem to be able to make a choice who to make the main and most important villain of the movie, with as a result that all of the villainous characters aren't really anything memorable or evil enough, since the movie spends to much time on showing the many different villainous characters of the movie. The movie is from the period when Patrick Swayze's career of course already was more or less on a death end. Nevertheless he's always good and serious with every role that he plays. He's also credible in this role, despite his already showing age. He was perhaps a tad bit too old at the time of this movie to play the main lead in an action movie. Meat Loaf mostly seemed to have had fun with playing his role, which shows on the screen. But like I said before, since he plays a villain, he didn't get the screen time he deserved. There are parts in the movie were he completely disappears, only to show up 20 minutes later again. But despite this all, the movie is good and entertaining enough to watch. It's current rating on here would suggest that this is one of the worst action flicks of the '90's but it hardly is. It's also no better than some action flicks but also definitely no worse than some others. 6/10 http://bobafett1138.blogspot.com/",
         "Most people look at Black Dog as a over the top, blow en action flick but this film is fun and had pretty good action. The film is about Jack Crews (Patrick Swayze) an ex con that's trying to find a new life after prison life. His boss offers him a job driving a load across the country, he refuses. After a finding a legal document in his kitchen draw, his wife hid it from him. He agrees to do the job so he can save his house and life hood. Not known to Jack, his load contains illegal weapons that his boss is selling to gangs in the country. Jack gets to the truck stop when meets the boss Red (Meatloaf). Jack chooses the truck he wants to use to pull the load. Jack finally gets on the road with a guy named Earl (Randy Travis) in the passenger seat and two another guys named Sonny and Wes following at the rear in Sonny's car. Soon the trip gets rough and deadly, Red is working for Jack's boss and wants the load. But Jack doesn't give up and wants to put on a fight, soon its a dangerous game of cat and mouse across the country. To make matters worse the FBI and ATF are also on Jacks tale trying to stop him, to grab the illegal load. This is a very fun movie, Kevin Hooks keeps the action non stop as Jack is trying to get the load home. The special effects are fantastic and they really destroyed a number of semi trucks for the movie. The only downfall is the ending, the ending is pretty basic and sometimes even disappoints but apart from that the movie is pretty fun and very underrated. The soundtrack is also a great one.",
         "Overall this movie was very good in my opinion. The only thing I saw wrong with it was the scene where the camero went over the hill and had a damaged front fender then when the scene cuts back to it when it lands it has a perfectly fine front end. Other than that I thought the movie was good. I watch it every day but that also is because I like the thought of a movie on Tractor Trailers. Overall good move, good acting, Bible basing quotes not my favorite but a good movie. I give it 10 stars. P.S. That quote on there: \"One fart Wess and you're walking\" is not by Jack Crews, but by Earl (Randy Travis) when driving the damaged camero up the hill."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Mutual Film Company",
         "Prelude Pictures"
      ],
      "summaries": [
         "An ex-con takes a job driving a truck cross country. What he doesn't know is that the truck is filled with illegal weapons and now he must fight to survive and save his family.",
         "Ex-con Jack Crews, who works as car mechanic in New Jersey since he's out and enjoys being a good husband and father to his daughter, refused to do it as his license was suspended, but when he finds the bank is about to foreclose on his house, he has no other choice then accept $10,000 for one truck ride all the way from Atlanta. He doesn't want to know about the load, but guesses right as it comes with a black dog, spare driver and two men 'protection' in a car that his long ride is about to turn into a mobile battle fought with vehicles and bullets for the illegal arms shipment which the FBI is after too while Red, who send the load in the first place, turns out to head a gang which stops at nothing to get them delivered. And then there's the legend of the ominous black dog..."
      ],
      "budget": 0
   },
   "movielensId": 1869,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-01",
      "dvdReleaseDate": "1998-10-14",
      "directors": ["Kevin Hooks"],
      "runtime": 88,
      "movieId": 1869,
      "title": "Black Dog",
      "mpaa": "",
      "actors": [
         "Patrick Swayze",
         "Meat Loaf",
         "Randy Travis",
         "Gabriel Casseus",
         "Graham Beckel",
         "Brenda Strong",
         "Rusty De Wees",
         "Brian Kelly",
         "Cyril O'Reilly",
         "Erin Broderick",
         "Charles S. Dutton",
         "Stephen Tobolowsky"
      ],
      "imdbMovieId": "0120610",
      "originalTitle": "Black Dog",
      "genres": [
         "Action",
         "Adventure",
         "Thriller"
      ],
      "youtubeTrailerIds": ["C5FHxF0KqdA"],
      "plotSummary": "An ex-con takes a job driving a truck cross country. What he doesn't know is that the truck is filled with illegal weapons and now he must fight to survive and save his family.",
      "tmdbMovieId": 18316,
      "avgRating": 2.333,
      "releaseYear": "1998",
      "numRatings": 497,
      "posterPath": "/ov3xpvjZxQ24kJPCgAu3eJ5y8S2.jpg"
   }
}