{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "library",
            "id": 295
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "free spirit",
            "id": 11678
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "librarian",
            "id": 207447
         }
      ],
      "imdb_id": "tt0114095",
      "video": false,
      "title": "Party Girl",
      "recommendations": [
         25636,
         60994,
         41667,
         41469,
         77469,
         30331,
         67595,
         24071,
         13169,
         33344,
         49806,
         36234,
         37722,
         56135,
         31064,
         50314,
         41801,
         39927,
         22318,
         24200
      ],
      "backdrop_path": "/a5lRIMyTi6wq4YUWXHCeHc3rbY4.jpg",
      "revenue": 472370,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe45d39251416c9103fb57",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nigel",
               "gender": 2,
               "credit_id": "52fe45d39251416c9103fb5b",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Derrick",
               "gender": 2,
               "credit_id": "545f95bf0e0a262ca2000527",
               "name": "Anthony DeSando",
               "profile_path": "/b7LiBIdaquQDfRJYAvy2TEurb2h.jpg",
               "id": 176628,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Leo",
               "gender": 2,
               "credit_id": "545f95cec3a3686cbb0043de",
               "name": "Guillermo Díaz",
               "profile_path": "/hnWjRRud2n2rDI6NbaeSIeEOMcP.jpg",
               "id": 8695,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Rene",
               "gender": 1,
               "credit_id": "545f95d9c3a3685362008cce",
               "name": "Donna Mitchell",
               "profile_path": "/67O6fUUI4gDXCU5T13u4Zv9JNr5.jpg",
               "id": 56694,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Judy Lindendorf",
               "gender": 0,
               "credit_id": "58473a63c3a368141f001f72",
               "name": "Sasha von Scherler",
               "profile_path": null,
               "id": 1244266,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Hannah Buff",
               "gender": 2,
               "credit_id": "58473ab692514119af001f1a",
               "name": "Richard Topol",
               "profile_path": "/eKrCl8C3HQJl7xqi1lp3GlTjrwl.jpg",
               "id": 31282,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Kurt",
               "gender": 2,
               "credit_id": "58473ae4c3a3681428001db4",
               "name": "Simon Verhoeven",
               "profile_path": "/pcnQhdAgrjMAnbbk1fKLxO6hUl1.jpg",
               "id": 18161,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45d39251416c9103fb61",
               "name": "Daisy von Scherler Mayer",
               "profile_path": "/ebJciI29YXLqblVayOIHqOAh4pD.jpg",
               "id": 56714,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545f95820e0a261fb90094fc",
               "name": "Harry Birckmayer",
               "profile_path": null,
               "id": 1383670,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "545f958bc3a3686cbb0043da",
               "name": "Harry Birckmayer",
               "profile_path": null,
               "id": 1383670,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "545f9599c3a3680b58000a38",
               "name": "Daisy von Scherler Mayer",
               "profile_path": "/ebJciI29YXLqblVayOIHqOAh4pD.jpg",
               "id": 56714,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "545f959f0e0a262ca2000525",
               "name": "Daisy von Scherler Mayer",
               "profile_path": "/ebJciI29YXLqblVayOIHqOAh4pD.jpg",
               "id": 56714,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "545f95abc3a3685358008f8c",
               "name": "Sheila Gaffney",
               "profile_path": null,
               "id": 1383671,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "58473b10c3a368140a001fa2",
               "name": "Harry Birckmayer",
               "profile_path": null,
               "id": 1383670,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "58473b2cc3a3681411001eab",
               "name": "Georgia Kacandes",
               "profile_path": "/Vct0XHfBGXNpl0xIifJbcPeJ57.jpg",
               "id": 2947,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58473b4a92514119ad001f86",
               "name": "Stephanie Koules",
               "profile_path": null,
               "id": 1719110,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58473b67c3a3681428001de2",
               "name": "Anton Sanko",
               "profile_path": null,
               "id": 1181479,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "58473b7c92514119ad001fa3",
               "name": "Michael Slovis",
               "profile_path": "/cgeMQ0oukZrPgyY49UkRrC5Qr2R.jpg",
               "id": 52034,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "58473b90c3a3681428001df7",
               "name": "Cara Silverman",
               "profile_path": null,
               "id": 56716,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "58473ba792514119b900203c",
               "name": "Caroline Sinclair",
               "profile_path": null,
               "id": 31276,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58473bd292514119bf001f6f",
               "name": "Kevin Thompson",
               "profile_path": null,
               "id": 19755,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58473bef92514119bc001ff5",
               "name": "Jennifer Baime",
               "profile_path": null,
               "id": 1521758,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "58473c39c3a36814140020ac",
               "name": "Michael Clancy",
               "profile_path": null,
               "id": 1471022,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.854612,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36196,
      "vote_count": 18,
      "budget": 150000,
      "overview": "Although Mary has little income, she still finds ways to spend her nights at clubs. After being arrested for throwing an illegal rave, she asks her aunt Judy for bail money. Judy then finds Mary a job at her library so that Mary can repay her. Initially, Mary finds the job as a clerk boring and stifling, and prefers to get to know a street food vendor whom she likes. However, Mary must refocus her life once she loses her job and apartment.",
      "similar": [
         112160,
         8363,
         41282,
         43923,
         376660,
         15037,
         376867,
         858,
         634,
         437557,
         449176,
         193893,
         391713,
         13342,
         9451,
         9603,
         241848,
         244264,
         80271,
         17130
      ],
      "original_title": "Party Girl",
      "runtime": 94,
      "poster_path": "/iYM0EdHrcbu8rhkDKVBkDcZEo8t.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Party Productions",
         "id": 37890,
         "origin_country": ""
      }],
      "release_date": "1995-06-09",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Sassy, savvy and definitely clued-in!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Daisy von Scherler Mayer"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Harry Birckmayer",
         "Harry Birckmayer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0MTE0NTQxMV5BMl5BanBnXkFtZTcwMDQ2NjkyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Parker Posey, Omar Townsend, Anthony DeSando | See full cast and crew »"],
      "reviews": [
         "This movie should be required viewing for all librarians or would-be librarians. All of the best lines are directly related to librarianship. The public library vs. academic library argument is a classic argument waged among librarians and library school students. It also breaks many librarian stereotypes. Librarians might even be capable of having fun -- even if they don't *usually* have sex in the romance languages section! (The best movie about librarians? Desk Set, with Katherine Hepburn and Spencer Tracy, of course.)",
         "This film is a delightful, light hearted look at both sides of where the \"club kid\" rave scene blends with the New York art, music and performance art worlds (with a cameo by the omnipresent Miss Bunny). This is \"Torch Song Trilogy\" for the perky-post-teen girls. \"That Girl\" for our disaffected, affected millennium times. The dialogue is fast and funny, and Parker Posey's costumer deserves - if not an academy award, at least - a stadium \"wave\" of kudos. Of course, this film rests on the very stylish platform heels of Miss Posey, and she is perfectly cast. Like a lot of her acting work, it may not be very deep, it is often self-referential and, well, posey... but it all WORKS. She is a talented comedienne, an incredible entertainer, and this film entertains, she carries it on her shoulders like a faux leopard wrap, and never lets it drop to the floor. Mary is a superficial party fashionista who isn't above stealing designer clothing from a friend's closet or making out with someone else's boyfriend. On a deeper level, this is a story of a girl and her friends who are care-less in every sense of the word, including about other people; and the process of learning that caring is necessary to life. The script is beautifully crafted, witty, and the only performance that disappoints is the Aunt, in a role that was much too one-dimensional and heavy handed; a more nuanced performance from her, would have deepened the relationship between the two... but... hey... this is comedy. A surprisingly deep role, that gives this film some substance and world vision, is the fallafel selling boyfriend. We should all be so lucky... is he the one for Mary? or the one that gets away? I rate this as a 8 because it isn't a great moment of film history, it is not a classic, and it is not great art (all of which get deeper and richer on re-viewing). Like \"Desperately Seeking Susan\" it represents something very true about it's time period, but may become irrelevant with time. Still, it has everything an entertaining film needs, and is worth viewing several times for the clothes alone!",
         "\"Party Girl\" capitalizes on the tremendous charm of Parker Posey. In fact, at times, the movie seems to be a vehicle in which Ms. Posey is allow to play herself, as she normally is in real life. The film, directed by Daisy Von Scherler Mayer, is a treat for Ms. Posey's fans. Ms. Von Scherler Mayer takes us on a wild trip into lower Manhattan to show us this aimless soul whose life is dedicated to have fun in the different clubs she constantly frequents. This is an era that still was more naive than what that area and the adjacent Meat Market districts became. At least, there are no pretensions in the films and we see down to earth people going about their lives in a normal way, if we can call it that way. Parker Posey makes an amazing Mary. It's because of Parker Posey we enjoy the movie more than if another actress would have played Mary. She is the whole picture. The rest of the cast is good.",
         "Okay. This has been a favourite since I was 14. Granted, I don't watch it multiple times a year anymore, but... This is not a movie for an older generation who want a deeper meaning or some brilliant message. This movie is FUN. It's pretty dated, almost passe, but Parker Posey is so brilliant that it's unbelievable. If you want to be charmed by a 90's Breakfast at Tiffany's, attended 90's raves, or love Parker, this movie is for you. Otherwise, don't bother.",
         "I remember seeing this years ago when it first came out and I was floored by Parker Posey's performance. And the movie was pretty good also. For anyone who's spent a little too much time in the nightclub/after-hours scene, this movie will have a special charm for you. Not too serious, mostly funny, and Parker Posey definitely blazes her talented way through this indie gem. I especially liked the Diaz character (reminded me of every single struggling DJ I've ever known). And many other movies could take a cue from this movie on how to preach the virtue of responsibility without being boring and bland about it. Babaganoosh!",
         "\"Party Girl\" is one of my all time favorite movies. The movie portrayed early 90's raving very well. Raves became distorted in later movies and television shows trying to depict that era of clubbing. The only show I can think of at the moment is \"Saved by the Bell: The College Years\" where Zack, wearing all plaid, has an idea to have a rave on campus, decked out with black lights, horrible music, and \"whip-its.\" \"Party Girl\" set itself apart from these stereotypical rave-umentaries by showing how raves (true raves) were not glow-stick, lolly-sucking teenage rebellion-fests. Posey, showing style and attitude, portrayed an over-the-top character who isn't necessarily perfect, but plays her part well. The movie isn't all about drugs, like other genre movies such as \"Playing Mona Lisa.\" Posey played a girl that I know many of. The movie epitomized the early 90's rave era. Watch this movie at least once just for Posey's performance.",
         "This movie is brilliant. The comments made before is from someone who obviously doesn't get it. The movie is campy- yes! But it is uplifting and fun. This movie is an underground hit and brings comparisons to Absolutely Fabulous. It is a must see!",
         "I loved this movie, and I am one of the older people who is not supposed to enjoy it, or so it seems. No, this movie is not deep -- who cares? These kinds of movies never are. But strangely, there is a message in it. It's that we each have the potential to be whatever we want to be. Parker Posey is great in this movie. I've always thought that she bears some resemblance facially to Katharine Hepburn. So, it's great to see that both Hepburn and Posey made movies about librarians (Hepburn's is The Desk Set). All librarians, especially those with a sense of humor, should see Party Girl. I gave this movie an 8. It is not by any means a great film by cinematic standards, although there are some nice shots in it. But it is incredibly charming and entertaining.",
         "Parker Posey flashes her 1,000-kilowatt smile frequently in this film, and your enjoyment of the movie will rely primarily on how smitten you are by Posey's quirky charm. Count me as a follower. I think Posey is a hoot in everything she's in, incapable of giving an ordinary performance. I have a feeling that in \"Party Girl\" she plays a variation of herself, but that's just fine with me. She appears in virtually every frame of the film, but the movie isn't much of anything without her, so I welcomed the overdose of Posey. The script for \"Party Girl\" feels half-assed, though I did appreciate the existential crisis faced by Posey's character and the shelter she seeks in the Dewey Decimal System as a way of bringing order to her chaotic existence. I wish the screenwriters had taken clever hooks like that further. And the ending had a conventional, all-loose-ends-tied-up quality that would better suit a television sitcom than an out-there indie film. But none of these faults take anything away from Posey herself, so really, how serious can they be? Grade: B",
         "I liked this movie. I felt that the character of Mary was endearing, and so was her circle of friends. It also had some really great quotes. Well, anyway, I am always partial to Liev films, and this is no exception. I thought that he was outstanding. Hmmm...what else can I say? It's a charming little picture, and it was done before Parker did the horrid Scream 3...so savor her indie talent while you can...looks like she's moving to the mainstream."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Party Productions"],
      "summaries": [
         "Mary is a free-spirited young woman with a run-down New York apartment and a high fashion wardrobe. She calls her godmother, a librarian, for bail money after being arrested for throwing an illegal party. To repay the loan, she begins working as a library clerk. At first she hates it, but when challenged decides to master the Dewey Decimal System and become a great library clerk, while romancing a falafel vendor and helping her roommate in his goal to become a professional DJ.",
         "24 year old Mary (Parker Posey) is earning her rent money by throwing yet another party at her loft but, this time she gets busted. Now Mary has to rely on her godmother, Judy, to bail her out. Mary visits the library to thank Judy, who is head librarian, for her kindness, but instead finds herself admonished by Judy for lack of responsibility and inability to hold down a job. In her defense, Mary agrees to take up a job as a library clerk. She assumed Judy would let her be, but instead, Judy constantly criticizes Mary's abilities. Steamed by Judy's dismissal of her lifestyle, Mary is determined to prove herself and in the process realizes a sense of responsibility and self-worth. The one time Party Girl has metamorphosed into a young mature woman."
      ],
      "budget": 150000
   },
   "movielensId": 187,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-06-09",
      "dvdReleaseDate": "2002-12-10",
      "directors": ["Daisy von Scherler Mayer"],
      "runtime": 94,
      "movieId": 187,
      "title": "Party Girl",
      "mpaa": "R",
      "actors": [
         "Parker Posey",
         "Liev Schreiber",
         "Anthony DeSando",
         "Guillermo Díaz",
         "Donna Mitchell",
         "Sasha von Scherler",
         "Richard Topol",
         "Simon Verhoeven"
      ],
      "imdbMovieId": "0114095",
      "originalTitle": "Party Girl",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["ztJuuYFnD1k"],
      "plotSummary": "Although Mary has little income, she still finds ways to spend her nights at clubs. After being arrested for throwing an illegal rave, she asks her aunt Judy for bail money. Judy then finds Mary a job at her library so that Mary can repay her. Initially, Mary finds the job as a clerk boring and stifling, and prefers to get to know a street food vendor whom she likes. However, Mary must refocus her life once she loses her job and apartment.",
      "tmdbMovieId": 36196,
      "avgRating": 3.44929,
      "releaseYear": "1995",
      "numRatings": 986,
      "posterPath": "/iYM0EdHrcbu8rhkDKVBkDcZEo8t.jpg"
   }
}