{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "texas",
            "id": 1556
         }
      ],
      "imdb_id": "tt0118925",
      "video": false,
      "title": "Dancer, Texas Pop. 81",
      "recommendations": [],
      "backdrop_path": "/9KNYpsVjELjWQwYDopwWo55GSBo.jpg",
      "revenue": 565592,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Keller Coleman",
               "gender": 2,
               "credit_id": "52fe499bc3a368484e134431",
               "name": "Breckin Meyer",
               "profile_path": "/7V3hXjmSJXApsuu2aGkEgFFAy03.jpg",
               "id": 33654,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Terrell Lee Lusk",
               "gender": 2,
               "credit_id": "52fe499bc3a368484e134435",
               "name": "Peter Facinelli",
               "profile_path": "/jVlwcMxC0mtWttvvSbovybpLrBX.jpg",
               "id": 56857,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "John Hemphill",
               "gender": 2,
               "credit_id": "52fe499bc3a368484e134439",
               "name": "Eddie Mills",
               "profile_path": "/4GhkrbegZvdZI5QfDAbuyMYPYT0.jpg",
               "id": 87018,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Squirrel",
               "gender": 2,
               "credit_id": "52fe499bc3a368484e13443d",
               "name": "Ethan Embry",
               "profile_path": "/btE5T04gKo8isQ2UekgXmZIMXmA.jpg",
               "id": 58019,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Josie Hemphill",
               "gender": 1,
               "credit_id": "52fe499bc3a368484e134441",
               "name": "Ashley Johnson",
               "profile_path": "/2zIDMXy9680S7ioPo9jpZUq5qG1.jpg",
               "id": 34486,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mrs. Lusk",
               "gender": 1,
               "credit_id": "52fe499bc3a368484e134445",
               "name": "Patricia Wettig",
               "profile_path": "/biCfIyLIL4HIV3rN2jlcTN3BWGF.jpg",
               "id": 33487,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mr. Lusk",
               "gender": 2,
               "credit_id": "52fe499bc3a368484e134449",
               "name": "Michael O'Neill",
               "profile_path": "/eNcC0txMVe0taCERTYpgA81vlyv.jpg",
               "id": 21710,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Earl",
               "gender": 2,
               "credit_id": "52fe499bc3a368484e13444d",
               "name": "Eddie Jones",
               "profile_path": "/g8ZDq6LFNWc12w24oo0r0FfeiIg.jpg",
               "id": 8692,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Vivian",
               "gender": 1,
               "credit_id": "52fe499bc3a368484e134451",
               "name": "Alexandra Holden",
               "profile_path": "/exNLXpKxW1HQBCuqEfC7aGyb7W8.jpg",
               "id": 69399,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Sue Ann",
               "gender": 1,
               "credit_id": "52fe499bc3a368484e134455",
               "name": "Shawn Weatherly",
               "profile_path": "/OxVpJuoNdjnEUjvy1JT9oublN7.jpg",
               "id": 83459,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499bc3a368484e13445b",
               "name": "Tim McCanlies",
               "profile_path": null,
               "id": 77919,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe499bc3a368484e134461",
               "name": "Tim McCanlies",
               "profile_path": null,
               "id": 77919,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.767129,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 78373,
      "vote_count": 2,
      "budget": 0,
      "overview": "Four guys, best friends, have grown up together in DANCER, TEXAS POP. 81, a tiny town in West Texas. Years ago, they made a solemn vow to leave town together as soon as they graduate. Now, it's that weekend and the time has come to \"put up or shut up.\" The clock is ticking and as all 81 people in the town watch, comment, offer advice and place bets, these four very different boys with unique backgrounds struggle with the biggest decision of their lives... whether to stay or leave home.",
      "similar": [
         11069,
         10829,
         262841,
         475,
         9362,
         76640,
         57201,
         10891,
         6977,
         1547,
         1585,
         568,
         927,
         11615,
         59,
         1427,
         793,
         273481,
         162,
         44896
      ],
      "original_title": "Dancer, Texas Pop. 81",
      "runtime": 97,
      "poster_path": "/khV9zPcvgOjrqwlk3dI1lGojZib.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Chase Productions",
            "id": 16517,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "HSX Films",
            "id": 4714,
            "origin_country": ""
         }
      ],
      "release_date": "1998-05-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "in the middle of nowhere they had everything",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tim McCanlies"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Tim McCanlies"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118925/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0NjE2ODM4MV5BMl5BanBnXkFtZTYwNTk2NDg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Breckin Meyer, Peter Facinelli, Eddie Mills | See full cast and crew »"],
      "reviews": [
         "OK, for all you people who came from \"smalltown, America\" who are complaining about this, you should really think about it. This was a really great movie, that shows that you have it all if you just take a look at what you think you are missing. I grew up in Southern Ca, and i moved to a small town when i was 21, but even growing up in a town just shy of a million people, i got an appreciation for it when i left that i would have never had, had i stayed there. This was a great movie, one i would recommend to anyone looking for a good way to spend an evening. not only does it show that a movie can be good without being raunchy and filled with sex, its worth the time that you spend watching it. I would watch it again.",
         "This movie was a like a trip back home for me. I grew up in West Texas, and I always knew in that process that I would one day leave it. By no plan or design, somehow it happened, in many stages. Ultimately, where did I find myself? In California, of course. Now looking back with the help of this movie, I see the simple good of the life I lived back then, when life was slow, plodding even, but placid and enjoyable. Dancer, Texas Pop. 81 provides a window back in time to the life we used to be able to live. I especially enjoyed the halting conversation between the two ranchers, a conversation of one and two word sentences. These two were so tuned into one-another that they needed very few words to express their ideas, thoughts, and concerns. People should be more like that today.",
         "In 1998, Tim McCanlies had a crazy idea. He made a movie about a tiny town in the middle of nowhere, in which no one gets killed, nothing gets blown up, no one has sex, and there aren't any aliens from outer space. Thank goodness he saw his crazy idea through; the result is a fabulous movie that I saw in the theater in 1998, and I am not sure I have seen a better movie since then. The setting of the movie is the fictitious town of Dancer, located in Southwest Texas, where the counties are bigger than the states in the northeast and the people are outnumbered by rattlesnakes. The movie begins on Friday, when four boys are graduating from high school. We learn that, while they were in junior high school, they made a \"solemn vow\" that as soon as they graduated, they were going to get on the next bus to California to make their mark on the world. Easy to say when you're in junior high, and graduation is years away. But now it's here, and the bus is pulling out on Monday morning. The question is whether any of the boys will follow through. That's pretty much the plot. What's so special? Simple: the relationships between the boys, between each of them and their family members, and between the folks in the town. This movie, like all great movies, is about the characters' reactions to the circumstances they are in. The characters are real, fleshed out not in bold strokes but in nuances, and their actions, not always predictable, are always believable. Most of us have faced the decision whether to leave the town that we grew up in. It is fascinating to watch these teenagers begin to grow into men -- at an accelerated pace, because of their childhood pledge. Someday, when you are at the video store and you don't know what to get, you will see this on the shelf. Get it. You will be very, very happy.",
         "Before getting the movie, I was puzzled at the sharp disparity in the comments here. Now I think I understand them! A character in the movie says something like this: \"Some people aren't meant to live in a small town. Some can't live anywhere else.\" There's truth to that, and I think it's reflected in the differing responses to the movie here. If you have experienced small-town life, and either love it or at least are wryly comfortable with it, you'll like this movie a lot. You'll feel you've met these people, you've been to their church, you've been at their picnics. You'll enjoy the scenery, the decent neighborliness, the conversations, the characters. If you're more of a big-city type, you'll be very impatient. Nothing \"happens\"! No heads explode, no alien invasions, abductions, or even flyovers. No sex, virtually no profanity, no fist-fights. Everyone keeps most of his clothes on. Kids love and respect their parents and families, even when they're a little daft. People fight, but basically care about each other. It's boring - to some! I offer no judgment, just this filter to help you decide whether the movie's for you. If you like movies that make you ache for small-town life, you'll like this. If you need action and adrenalin, you may very well not. I like both, and I liked this movie.",
         "Though a bit slow at times, it is quite refreshing to watch a movie that doesn't have any box-office ambitions and yet exceed the expectations one would associate with a blockbuster. 4 teenage boys are faced with life-changing choices when they graduate from high school, whether to follow their parents' wishes and stay in small town Texas (as the name implies), or to strike it big in one of the big cities. There are some commendable performances in here, notable that of Breckin Meyer as Keller Coleman, as he tries to come to terms with leaving his only kin, his grandfather, behind alone while he leaves the town with Lusk (Facinelli). Facinelli also puts in a performance better than I expected from his previous films as the son who does not want in on the family business but wishes to strike it out on his own. I wished that there could be plot involvement for Eddie Mills and Ethan Embry though, the other 2 main actors - they did not have much to act on and I for one would have liked them to have a larger role in the story. But I guess there is only so much you can show in 2 hours. Irregardless of any 'faults' this movie might have, it is still a refreshing look at small town life and the choices some of the teens have to take when they come of age.",
         "I spent a pleasant evening last night viewing this superb portrait of americana. I only wish that I had grown up in such a small town. These kids, teenagers, had it all, most of all solid friendships. I never was able to determine for certain how many if any would leave that fateful Monday morning on the journey to Los Angeles, leaving the small town and its people behind. That some left was inevitable. That some stayed was natural. I would have stayed. As the song at the end said, Dancer may not be on the map, Mr. McNally but it ought to be. I agree. My next visit to West Texas will include it. What a delight I have waiting for me. I feel SO good!!!",
         "Coming from a small town in West Virginia I was able to understand the plight of the 4 boys. My friends and I also made a similar pact, although ours started with going to college together and then moving to some big city and living a glamorous life. That's why this movie really struck me. This movie is for anyone who has ever felt like there has to be more out there. It captures both the charms and pitfalls of small town life. In \"Dancer\" Squirrel and John both find a situation that suits them, giving them a glimmer of hope for the future, while Keller and Terrell Lee both realize that they will never be able to find the happiness they wish for in Dancer, Texas. At one point, though, both almost hit a point of acceptance that this is what their lives are to be and resolve to themselves that they must stay and make the best of it. The theme through for this movie is that each of us must find what makes us happy, assessing what we have, what we need, what we want and how we're going to balance these. We can't always have everything we want, and sometimes to get something we have to give up something. And furthermore, we have to remember that what is right for one person may not be right for someone else, no matter how much you might wish it is.",
         "I walked away from this film with an incredibly good feeling; it was great. It features four young boys on the day of their graduation. They had made a childhood pact to leave their tiny town right after graduation. The audience watches as family interests and friends conflict with hopes, dreams, and practicality. For the record, I'd like to add that this is a great film to see even just for the performances of Breckin Meyer and Ethan Embry. Meyer is the story's dubious hero; he's self-centered but so good-natured and hopeful that you can't help but like him. Embry's character is dirt-poor and has a drunk for a father, but he's so incredibly goofy and sweet that at the end of the movie, you find yourself cheering for him. I recommend this movie to pretty much anyone. There's no sex, no violence, and only a tiny amount of cursing. An especially good movie to watch in groups.",
         "I really enjoyed this film because it did capture everything that's great about small-town life, including bonds shared with the people around you. Even though this kind of story could take place anywhere, placing it in a small country town slowed the story down so that I could really enjoy it. The nostalgia also brought a tear to my eye:)",
         "I was bored one Sunday morning in August 2004 and I was surfing through the channels and I stumbled on this movie that was on one of the premium channels. I was getting more and more into it as the plot was going. My favorite character is Squirrel played by Ethan Embry. After seeing it on TV, I just had to buy it on DVD and I have showed this movie to many of my friends and they love it! It was amazing to see that the director of this movie Tim McCanlies directed Secondhand Lions. This movie shows what true friendship really is and what small town life is about. I recommend this movie to everyone and it is great for the whole family to watch."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Caribou Pictures",
         "Chase Productions",
         "HSX Films"
      ],
      "summaries": [
         "Four friends from the small Texas town of Dancer are graduating from high school and are planning to move to L.A. after graduation, taking the population of Dancer down to 77 from 81. All other 77 residents feel threatened by their decision and decide to spoil their plans by all means possible.",
         "Four guys, best friends, have grown up together in DANCER, TEXAS POP. 81, a tiny town in West Texas. Years ago, they made a solemn vow to leave town together as soon as they graduate. Now, it's that weekend and the time has come to \"put up or shut up.\" The clock is ticking and as all 81 people in the town watch, comment, offer advice and place bets, these four very different boys with unique backgrounds struggle with the biggest decision of their lives... whether to stay or leave home."
      ],
      "budget": 0
   },
   "movielensId": 1870,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-01",
      "dvdReleaseDate": "1998-10-14",
      "directors": ["Tim McCanlies"],
      "runtime": 97,
      "movieId": 1870,
      "title": "Dancer, Texas Pop. 81",
      "mpaa": "PG",
      "actors": [
         "Breckin Meyer",
         "Peter Facinelli",
         "Eddie Mills",
         "Ethan Embry",
         "Ashley Johnson",
         "Patricia Wettig",
         "Michael O'Neill",
         "Eddie Jones",
         "Alexandra Holden",
         "Shawn Weatherly"
      ],
      "imdbMovieId": "0118925",
      "originalTitle": "Dancer, Texas Pop. 81",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["aA1xyJIwykg"],
      "plotSummary": "Four guys, best friends, have grown up together in DANCER, TEXAS POP. 81, a tiny town in West Texas. Years ago, they made a solemn vow to leave town together as soon as they graduate. Now, it's that weekend and the time has come to \"put up or shut up.\" The clock is ticking and as all 81 people in the town watch, comment, offer advice and place bets, these four very different boys with unique backgrounds struggle with the biggest decision of their lives... whether to stay or leave home.",
      "tmdbMovieId": 78373,
      "avgRating": 3.32673,
      "releaseYear": "1998",
      "numRatings": 404,
      "posterPath": "/khV9zPcvgOjrqwlk3dI1lGojZib.jpg"
   }
}