{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113184",
      "video": false,
      "title": "Go Now",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nick Cameron",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dc91",
               "name": "Robert Carlyle",
               "profile_path": "/dLNeFPfJACiCiUz3oEdAjeKIwvZ.jpg",
               "id": 18023,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Karen Walker",
               "gender": 1,
               "credit_id": "52fe4796c3a36847f813dc9b",
               "name": "Juliet Aubrey",
               "profile_path": "/fnWHSvoWnKURqU3h2PwJUf3IQHi.jpg",
               "id": 18066,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Paula",
               "gender": 1,
               "credit_id": "54635aa4c3a368124a002070",
               "name": "Sophie Okonedo",
               "profile_path": "/5Yo3KGum1txRLmt6JZwQ5TYSIsg.jpg",
               "id": 2598,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tony",
               "gender": 2,
               "credit_id": "570dceb792514124e60011e7",
               "name": "James Nesbitt",
               "profile_path": "/n9NorD6bQfFJlW4IcJ6WoGiAKcR.jpg",
               "id": 34715,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sammy",
               "gender": 2,
               "credit_id": "58ac7c95c3a36849fe015c96",
               "name": "Berwick Kaler",
               "profile_path": null,
               "id": 118614,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Madge Cameron",
               "gender": 1,
               "credit_id": "58ac7cecc3a36849fe015cd3",
               "name": "Barbara Rafferty",
               "profile_path": "/udNUPk7YctlEaYNXNbEQ5kbdNYS.jpg",
               "id": 35018,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Chris Cameron",
               "gender": 2,
               "credit_id": "570dced1c3a3680a3000138e",
               "name": "Tony Curran",
               "profile_path": "/IhqoydPOiP53AI6NeHTVwDcHTz.jpg",
               "id": 2220,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Julie Cameron",
               "gender": 0,
               "credit_id": "58ac7d19c3a36849fe015cf3",
               "name": "Erin McMahon",
               "profile_path": null,
               "id": 1762981,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Dell",
               "gender": 2,
               "credit_id": "58ac7ca4c3a3684a0a015de5",
               "name": "Darren Tighe",
               "profile_path": null,
               "id": 1558686,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Bridget",
               "gender": 1,
               "credit_id": "58ac7cfa925141590e014ecb",
               "name": "Sara Stockbridge",
               "profile_path": "/1cdij5P6wkael7FzoM8uHRhDsxM.jpg",
               "id": 24241,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "George",
               "gender": 0,
               "credit_id": "58ac7cb9c3a36849fe015caf",
               "name": "Sean McKenzie",
               "profile_path": null,
               "id": 88384,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "Geoff",
               "gender": 0,
               "credit_id": "58ac7cca925141590e014eae",
               "name": "John Brobbey",
               "profile_path": null,
               "id": 195359,
               "order": 12
            },
            {
               "cast_id": 7,
               "character": "Walsh",
               "gender": 2,
               "credit_id": "570dcedfc3a3680a3f00117a",
               "name": "Roger Ashton-Griffiths",
               "profile_path": "/3lvWs4Kz0aATpcSY7PyPhkKgH6W.jpg",
               "id": 20243,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "58ac7d7692514158bc016c5b",
               "name": "Jenny Jules",
               "profile_path": null,
               "id": 1161607,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "58bd6a6b9251413407001a33",
               "name": "David Schneider",
               "profile_path": "/wLiB2o5hr3au6kXOtpqPuo6Sz1X.jpg",
               "id": 2065,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Bill Cameron",
               "gender": 2,
               "credit_id": "58cbb6fbc3a36828e401056f",
               "name": "Tom Watson",
               "profile_path": null,
               "id": 184329,
               "order": 16
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4796c3a36847f813dc97",
            "name": "Michael Winterbottom",
            "profile_path": "/hnzUhUXiWy7ThflTzPTRb869mnB.jpg",
            "id": 172,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 0.447958,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 49474,
      "vote_count": 1,
      "budget": 0,
      "overview": "Nick, is a young Scottish soccer player living in the big city. He meets Karen, and the two fall in love and move in together. Soon after, Nick exhibits signs of serious illness. As his body slowly succumbs to multiple sclerosis, he experiences a wide sweep of jagged emotions, and in the process gives himself and those who love him the strength to carry on.",
      "similar": [],
      "original_title": "Go Now",
      "runtime": 81,
      "poster_path": "/tnAOFBSuMTpWTiFfrWlgBnwzLdS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "BBC",
            "id": 5996,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-16",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Winterbottom"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Jimmy McGovern",
         "Paul Henry Powell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113184/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTQwNjI3MDk1Ml5BMl5BanBnXkFtZTYwOTg5NTg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Carlyle, Juliet Aubrey, James Nesbitt | See full cast and crew »"],
      "reviews": [
         "Although many people may have seen this movie to see Robert Carlyle- understandably so, as he is a very fine actor- I saw this movie because I have Multiple Sclerosis and I wanted to see the manner in which the subject was depicted. I can honestly say this film was very true to life, particularly in the way it portrays the kind of emotional and physical pain having such a condition can cause. Since the kind of MS that Carlyle's character has is Chronic Progressive MS- the most serious form- it is very painful and sad to watch, but necessary to see for anyone who wants to understand the effect a disease such as MS has on a person, as well as their loved ones. I was downright relieved by the accuracy of the description of the symptoms, since MS has been the subject of some very ignorant TV shows and films. The major downside to the film is the overall weakness of the other actors, particularly when compared to Carlyle's stellar performance. Juliet Aubrey is particularly weak and unconvincing in the key role of the girlfriend. But this should not deter one from seeing it. Anyone who has MS or knows someone who has MS or any other kind of debilitating condition should see this film. You might learn something from it. As an added the plus, the soundtrack, which consists entirely of classic American R&B and Soul (most of which don't get heard too often) is wonderful.",
         "One of Robert Carlyle's finest performances,this wonderful movie avoids pathos and melodramatic effects .Multiple sclerosis is an awful disease but the director focuses his work on the patient's courage,humor and resilience .All is not rosy,far from it,and Nick's pals are subject to egregious gaffes while his parents try to take their boy home to protect him. This film contains one of the most heartrending love scenes that has ever been filmed!No ,there's no sex in it!Nick's girlfriend ,Karen does not want to go now,and she stands in the pouring rain,she keeps waiting waiting desperately waiting.She gave the highest proof of her love that she could. It's not a desperate film.The last scene is a message of hope. As Bessie Banks sings \"Go now....or you'll see me cry \"",
         "This small BBC-produced gem stars the ever excellent Robert Carlyle (Riff-Raff, Trainspotting, Priest, The World is not enough) as an MS-afflicted soccer player/construction worker, whose struggle against the horrible disease (Multiple sclerosis) is depicted with warmth, humor and horror. Plenty of sex and raucous scenes make for a stunningly real and unconventional film. But it´s Robert Carlyle´s astonishing performance that deserves attention. Not really that much to learn here about the disease itself, but the film is touching and realistic, a far cry from similar-themed Hollywood products. Juliet Aubrey as his girlfriend is worth noting, too. ***",
         "I've been really impressed with Robert Carlyle's work ever since I saw him in \"Priest,\" and I've been working my way through all his films -- but I had the hardest time finding this one! I finally bought the video, sight unseen, just to see it! I'm so glad that I did. It's a joy finally to see Robert Carlyle have the opportunity to do a complete person, from laughter to tears, with terrible physical failings and equally terrible emotional struggles. He's a wonderful actor, and it's a treat to see him with a relaxed face, easy -- fully human! He seems to have gotten stuck in the villain or psycho category by American casting agents -- a kind of Scots contemporary Peter Lorre.... But in this role he's just lovely! The film itself is that sort that the Brits do so well, \"a little film\" -- character study, working class, interesting without trying to be earthshaking. I suspect that the difficulty of understanding the accents (not just Carlyle's \"deepest Glaswegian\", but the several other regional accents (notably \"Tony\"'s Irish) has contributed to the film's obscurity in the States, but it's well worth seeking out. In fact, I'm glad I bought it, because I think it bears re-viewing, if for no other reason than that it's likely to take me a few times through before I actually catch all the lines! Nice use, too, of series of still photos, especially of the football (soccer) \"mates\" captured in classic \"yearbook\" style, with funny captions! Other reviewers have commented on how weak they thought the acting was, other than Carlyle. I disagree. I think the acting is fine, but the script has definitely under-developed the other characters, especially Karin. We see so much of Nick's inner life, but almost none of hers. I suspect these writers may do men quite well (hearty \"mates\", whether football or druggies!), but not women. Remember the women in \"Trainspotting\"? In any case, well worth the viewing, especially for Robert Carlyle's lovely performance.",
         "One of the best and most serious movies I've ever seen. Robert Carlyle is really fantastic; it was so difficult to play such a difficult part and he did deliver a stunning performance. It's unbelievable how this picture depicts the tragedy of a person hit by this terrible illness. No commonplace in the whole film, a description of an average life of an average man (actually an average couple) destroyed by Multiple Sclerosis. Congratulations to the director for dealing with a dramatic subject in a very intelligent way, showing how hard it is to find the strength to carry on in those situations, but without ending up with pitying the sick person. Everything is amazingly real, even the long sex scene at the beginning of the love affair that will eventually turn into an everlasting love story. Of course I do highly recommend this movie.",
         "\"Go Now\" is the story of Nick Cameron's (Robert Carlyle) struggle to cope with the debilitating affects of Multiple Sclerosis (MS). A very active person (amateur soccer player) who makes his living with his hands (architectural restorations (?- it wasn't *exactly* clear to me what they do)), it is a very difficult adjustment for him as he can do less and less and must depend upon others to do *for* him. I am moved to submit a review because of the personal experience of my first wife who died from MS. Robert Carlyle's performance as someone with MS is so absolutely on the mark as to be frightening. Early symptoms, attempts to diagnose, the loss of function, the struggle with physical therapy, the anger and frustration of not being able to do the simple things that you once did without conscious thought but which now require concentration and tremendous effort. Another aspect that they covered well is the handicapped person's anger towards pity (or more often in his case, *perceived* pity). His was an absolutely standout performance. They also handled fairly well the dilemma of the caregiver (Juliet Aubrey as Karen). Physically, they can go at any time. Emotionally, they MUST stay because they love the MS victim. In the movie, the fact that they weren't married made it an easier possibility for her to leave. Like the rich person who wonders if they are loved for their money or themselves, Robert Carlyle found it very hard to accept that she loved him for himself, and did not want to stay out of pity or a sense of obligation. My only complaint about this movie is that the thick accents made it very difficult to understand too much of the dialogue. Also, as another reviewer noted, a strong plus was the \"real people\" feeling about the rest of the cast. The movie felt as though a movie camera had captured real life, not people acting in a movie. A stellar performance by Robert Carlyle. I have only seen him in \"The Full Monty\", but I will now try to find his other movies. I am now a big fan of Robert Carlyle. I like this guy a LOT.",
         "Multiple sclerosis (MS), like AIDS, strikes people in the prime of their lives. MS plays a central role in Go Now, but the film is not a chronicle of the disease's progress. Go Now is about two young working-class Scots who have just fallen in love. They're 'just folks'; starting out, enjoying life. Sadly, it won't be so pedestrian as Nick, played by Robert Carlyle begins to display disquieting physical symptoms. Slowly, as his health deteriorates, the reality of his situation is revealed. It is a great test for the young lovers, and this is really what the movie is about; love. The actors and director have made a very moving film that I can highly recommend.",
         "Robert Carlyle delivers a stunning performance in this film. Starting off as a rough-and-tumble guy, he really shows range as his character opens up emotionally with the development of a romantic relationship, and then begins a struggle with MS. Confusion, doubt, anger, pain, determination, fear...you name it: he pegs it. Though the plot could've used a bit more work and the other actors aren't as strong as Carlyle, Go Now is still worth a viewing just for his performance alone. It leaves you with the impression that the film really was made just to be a showcase for his work. Occasional comic relief from his buddies provided a witty twist, and the soundtrack was top-notch.",
         "Robert Carlyle is famous because of Trainspotting (a brillant movie by the way) were he played the b****rd Begbie who would start a fight for no reason. With the reason that he found that funny. That he is an actor who can play something totally different than the Begbie-role. In 'go now' he plays a soccer player who gets MS, the disease that kills you slowly, starting with making you tired and weak. Carlyle plays the role very real and believeble. Because he don't wants to be a problem for his girlfriend he leaves his girlfriend and the house. In the next scene you see him standing outside in the rain just looking at nothing and his girlfriend staring out of the window at him. This scene is so very touching and so real that there is a good possibility that there are coming tears out of your eyes. A very good, touching and warm film.",
         "I must admit, as a Scottish American, I have always sought out and found satisfaction in Robert Carlyle's work. This time, as the daughter-in-law of a wonderful and amazing woman who had Multiple Sclerosis which, ultimately, led to her death 20 or so years after her diagnosis, it was AMAZING to see a film that dealt with the day to day issues of MS so realistically. The fact that the film portrayed a male in the lead as the person diagnosed made it all the more compelling. This is not just a disease that affects females, and also, once diagnosed and as the MS progresses, it's impact is on the entire family or supportive community one hopes the MS patient has. Robert Carlyle is just so heart-breaking perfect in this role. He should have won or should win something for his film. Heather"
      ],
      "genres": [
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Polygram Filmed Entertainment",
         "Revolution Films"
      ],
      "summaries": ["Nick, is a young Scottish soccer player living in the big city. He meets Karen, and the two fall in love and move in together. Soon after, Nick exhibits signs of serious illness. As his body slowly succumbs to multiple sclerosis, he experiences a wide sweep of jagged emotions, and in the process gives himself and those who love him the strength to carry on."],
      "budget": 0
   },
   "movielensId": 1872,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-16",
      "dvdReleaseDate": null,
      "directors": ["Michael Winterbottom"],
      "runtime": 81,
      "movieId": 1872,
      "title": "Go Now",
      "mpaa": "",
      "actors": [
         "Robert Carlyle",
         "Juliet Aubrey",
         "Sophie Okonedo",
         "James Nesbitt",
         "Berwick Kaler",
         "Barbara Rafferty",
         "Tony Curran",
         "Erin McMahon",
         "Darren Tighe",
         "Sara Stockbridge",
         "Sean McKenzie",
         "John Brobbey",
         "Roger Ashton-Griffiths",
         "Jenny Jules",
         "David Schneider",
         "Tom Watson"
      ],
      "imdbMovieId": "0113184",
      "originalTitle": "Go Now",
      "genres": [
         "Romance",
         "Drama",
         "TV Movie"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Nick, is a young Scottish soccer player living in the big city. He meets Karen, and the two fall in love and move in together. Soon after, Nick exhibits signs of serious illness. As his body slowly succumbs to multiple sclerosis, he experiences a wide sweep of jagged emotions, and in the process gives himself and those who love him the strength to carry on.",
      "tmdbMovieId": 49474,
      "avgRating": 3.1125,
      "releaseYear": "1995",
      "numRatings": 80,
      "posterPath": "/tnAOFBSuMTpWTiFfrWlgBnwzLdS.jpg"
   }
}