{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "dream",
         "id": 1566
      }],
      "imdb_id": "tt0120211",
      "video": false,
      "title": "Still Breathing",
      "recommendations": [
         64523,
         4644,
         44546,
         46301,
         2348,
         30285,
         27444,
         61477,
         14066,
         74415,
         43079,
         57012,
         24585,
         44015,
         18553,
         59807,
         67129,
         35320,
         70736,
         39213
      ],
      "backdrop_path": "/bjcHQODig5eRKuHZ42PVILgkXHt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Tree Man",
               "gender": 2,
               "credit_id": "52fe471c9251416c9106a5f5",
               "name": "Lou Rawls",
               "profile_path": "/kxze9RTugaTfD21dXn5XaxZqvsy.jpg",
               "id": 112099,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Fletcher McBracken",
               "gender": 2,
               "credit_id": "52fe471c9251416c9106a5f9",
               "name": "Brendan Fraser",
               "profile_path": "/n8VOWXp94nhIEo5nS9o6bOpUHiN.jpg",
               "id": 18269,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rosalyn Willoughby",
               "gender": 1,
               "credit_id": "52fe471c9251416c9106a5fd",
               "name": "Joanna Going",
               "profile_path": "/8wPmJGGj4HEUfaYzYjoL1AzOSlf.jpg",
               "id": 59662,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Elaine",
               "gender": 1,
               "credit_id": "58c3c08d925141341f001552",
               "name": "Ann Magnuson",
               "profile_path": "/ry9H1u1GFbwXiWWolYA63pjBctp.jpg",
               "id": 37042,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Ida",
               "gender": 1,
               "credit_id": "58c3c0aa9251413432001630",
               "name": "Celeste Holm",
               "profile_path": "/3TWctkWuPrtiwjqkfSDjDFcMcx.jpg",
               "id": 10607,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe471c9251416c9106a603",
               "name": "James F. Robinson",
               "profile_path": null,
               "id": 1069294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe471c9251416c9106a609",
               "name": "James F. Robinson",
               "profile_path": null,
               "id": 1069295,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.954242,
      "production_countries": [],
      "id": 39467,
      "vote_count": 11,
      "budget": 0,
      "overview": "Two lost souls: she a con-artist in L.A.; he a puppeteer in San Antonio have the same dream linking each with the other. He travels to L.A. to find this woman he has become obsessed with. She resists, afraid of his kooky ideas until she travels with him to San Antonio and meets his wise grandmother. Story of two disparate people linked by \"fate\" gets increasingly interesting as it rolls along.",
      "similar": [
         1903,
         638,
         4593,
         300,
         392432,
         258230,
         301804,
         81188,
         11360,
         614,
         626,
         1429,
         9377,
         492,
         38,
         68,
         150540,
         281,
         1018,
         242224
      ],
      "original_title": "Still Breathing",
      "runtime": 109,
      "poster_path": "/w9iW8dQ8OM61lxH01q4PNTmQ6sK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-09-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "True love, midnight visions and stacking rocks. OR  The love of a lifetime can begin with a dream",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James F. Robinson"],
      "runtime": 109,
      "synopsis": "As the movie begins we see Fletcher (Brendan Fraser) who seems very interested in a collage. He even needs an espresso to get him on the right track. In Hollywood, California we meet Rosalyn (Joanna Going) who seems to have given up on two things that she once thought were life's truths, one was that there was a perfect man for every woman and the second was that true love equaled happiness. Now she has grown up and no longer believes these are truths, seems she has met too many that do not even come close. Love has never meant happiness for her. As she walks from her truck to meet friends she is acosta by a man, we aren't sure what he wants, but certainly does not ask nicely and Roz is not waiting around to find out. He grabs her as she is moving and she manages to get her mace out of her purse and sprays him with it. She seems to get him really good with it, and yet as she is running away, now he has a gun pointed at her. She looks terrified, when suddenly we are with Fletcher again and he seems to see what is happening as yells out, \"No!\" It is all happening at once, the gun, Roz, Fletcher, when suddenly a car hits the man with the gun and drives off. A typical Los Angeles hit-and-run incident, but this one may have stopped a shooting. The man is out cold, Fletcher is relieved. Roz kicks him to be sure he is not conscience, then she kicks him again for her trouble and then takes his wallet and takes his money. As she walks away she kicks his gun into the gutter grate. Roz was on her way to meet friends and decides the idiot with the gun should buy a round, while the bartender tends to that she makes an anonymous phone call to 911 to report the hit-and-run but hangs up before giving her name. Fletcher now relieved says, \"I got her\" and now seems to know exactly what hair, eyes, and face to paste together to accomplish his goal. That together with the word \"Formosa\" and he is hot on the trail of his dream. When he looks up Formosa he finds it is in China, so he plans a trip there with a layover in Los Angeles. We find Fletcher playing a trumpet on the river with his Grandmother (Celeste Holm) playing a tuba, she interrupts to state, \"you sound different, something's changed, what's her name?\" Fletcher pronounces he doesn't believe in all that stuff. His Grandmother reminds him that his Grandfather found her on a full streetcar and knew she had a mole on her back and she was still wearing her coat!\" They continue to play. Then back at the house when speaking with her Fletcher shows her some of the collages he has put together. He believes she is in Formosa, China and that she is chinese. We also learn Fletcher is a very good Marionette operator who entertains with a group. Now he must tell them that he is leaving for China to find his dream girl, and shows them the collages of her. These scenes have jumped back and forth from Fletcher putting his girl together, speaking to Grandma and his friends to Roz setting up her latest con and finally getting him to buy her an abstract painting which is a story onto itself. Our girl who has out grown dreams has become a con artist with a partner in crime, Elaine (Ann Magnuson) who seek out rich men to fleece. Roz has begun to have odd dreams, that she is a little girl first laying in ivy, then playing with a little boy on a river, she does not know the boy or the place she only knows the dream makes her feel peaceful. She has to finish up this foreign con and does so easily. She invites to dinner. When he arrives she announces she'd rather order in and watch a video, she's feeling under the weather. He is interested in cashing in on his painting \"investment\" with her. When he asks if there is anything he can do to make her feel better. She asks him to get her some aspirin, when he goes in search of it he finds himself in her bedroom where he tests the bed. Then he notices an oxygen tank, a bed pan, and several prescriptions and brochures like, \"Facts about AIDS\" and \"Now What?\" Needless to say the guy practically leaves skid marks getting out of there. Roz continues to have the dreams of the river, the little boy, and her as a little girl. In this latest dream she hurts her knee and it's bleeding so the little boy uses the bottom of his shirt to dab away the blood. When she awakes she looks at her knee almost as if she expects to see something there. Elaine has her next mark lined but has to hand him off to Roz. Trouble is she hasn't all the information on him, She knows the family gets its money from gas and oil, that the man is not old, that he is peculiar, and he is from Texas and she will meet him the next afternoon at the Formosa. Fletcher is at the L.A. airport waiting for his connecting flight to China when he sees a woman reading an entertainment book about Hollywood and sees a photograph of the famous \"Formosa\" bar. Finally fate has put the two together at the same place. Fletcher arrives first and the place is all but empty. He shows his collages to the bartender and asks if he has seen this woman. Of course pieces of different women mean nothing to him and shakes his head no. Then a man comes in who is expecting to meet a woman. Fletcher immediately recognizes the man's Texas accent and the two briefly talk, and they find out they are both there to meet women. The mark goes off to use the phone leaving only Fletcher in the bar when Roz enters. So it becomes easy for her to find who she thinks is her mark and for him to meet who he thinks is his dream. They leave the bar and end up walking near Roz's apartment. Fletcher tells her he is an artist who stacks rocks. She doesn't undertsand so he shows her by stacking rocks on her hand. He explains that she needs to look at it from different perspectives. Once the rock scene is over, a large dog in a parked car barks and scares Roz and she falls down and hurts her knee which is now bleeding, so Fletcher uses the bottom of his shirt to dab the blood away. When he does this Roz is visibly upset, this is much too close to her dream and it frightens her. She just really does not understand how this could happen. She needs to continue her con, but the dream stuff really shakes her up. Her logical mind knows it isn't possible for someone to set something like that up, but her con-game self believes he's playing her somehow. This makes her double her effort to outwit this rich Texas man. She even finds herself leaving the comfort of her usual game at this man to make sure she has the upper hand at all times. The thing she doesn't know is, she has one directive and he has a completely different one in mind. They both are planning a con, but very different ones with very different outcomes. She plans to con him out of a lot money and flee, he plans to introduce her to his life in Texas and hope she finds both him and Texas impossible to not only leave, but to marry. Her best efforts in L.A. are not met with what she expects. In fact she ends up in Texas with the eccentric rich man waiting for her next move. The next move is not hers, Fletcher is called upon to entertain a dying little girl. Roz tags along but eccentric is not quite defining Flletcher's actions. His odd house, the fact that he likes to sleep on a piano, and that she still can not seduce him frustrates and confuses her. Then she finds out a party is to be thrown and she is the star. Fletcher finally tells her that the men in his family have traditionally dreamed about their true love, and when they have dreamed enough to know where they are they go find them and marry them. His Father found his Mother who was engaged to another man yet still won her. Roz begins to meet Fletcher's friends who have all seen the collage from before and can't believe what they are seeing. Fletcher dreamed of a woman, cut and pasted different parts of illustrations, drawings, and photos to get a good visualization of his love and found her. At the party all everyone can do is stare at her in amusement. Then Fletcher's Grandmother comes and recognizes her immediately and explains she knows exactly how she feels. Afterall, she has been through this herself and knows how uneasy the whole thing can make you feel. She then takes her in the house and shows her family memories and treasures. At the party she finds out that Fletcher is not an eccentric rich man, he is a kind man with a good life and good friends and family, things that she can't or wouldn't steal. She now doesn't feel good enough, and wants to leave. She leaves and resumes her life with Elaine, but while riding with the next mark, she sees unkindness and feels unfulfilled, she feels that no matter what dollar value goes with this man it isn't enough. She leaves him and goes back to Texas. The last scene is beautiful with Fletcher and Roz in tubes floating down a river, the one from her dreams and they are connected. It is a love story, but a very different one. enjoy. Gremma, San Jose",
      "writers": ["James F. Robinson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120211/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1OTgyNTI2OV5BMl5BanBnXkFtZTcwNDUxMDQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Brendan Fraser, Joanna Going, Lou Rawls | See full cast and crew »"],
      "reviews": [
         "Combining eccentricity with serendipity, Still Breathing is still, almost ten years after it was first released, one of the best fate-filled and wistfully magical love stories of all time. Take one somewhat unusual street performer who is mystically drawn towards his soul mate - a hardened con artist miles away, and then back their journey towards, away and towards one another with a gorgeous soundtrack that moves effortlessly from Chopin to Carly Simon, and you've got one very touching if not markedly unique story. Fraser is great as the slightly odd lovestruck suitor as is Going, who clearly portrays her struggle with losing the grip on her tough anti-emotion veneer as it starts to crumble under Fraser's enticing conviction. The lovely locale of San Antonio, TX also adds to the charm of this special film that will leave you wondering if one soul is truly destined to be, exclusively, with another.",
         "If you are not a sensitive guy - don't bother. Otherwise, this film is a treat. You must see the film in its entirety or you will not get it. Super casting job - I do not know of any others who could have handled the parts so well. A true look beyond the superficial plastic sides of characters we usually see. A truly pleasing experience to watch. Brendan Frasier and Joanna Going have much more going for them then the typical fluff of Hollywood types and this movie displays their depth well. Celeste Holm is enchanting and the supporting cast add much color and flavor.",
         "I'm blown away by this screenplay. It's the best modern movie about \"true love\" I've seen. The emotional depth portrayed in the characters is explosive yet classic. Marry that with incredible cinematographic images and a wonderfully eclectic, sophisticated soundtrack, and you've got the ingredients to a contender for my short list of all-time favorites. As you can tell by this over the top reccomendation, this movie's got the kind of overboard sentimentality that inspires the same in me!",
         "Like most people who discovered STILL BREATHING - written, directed, and produced by James F. Robinson, I chanced upon this fantasy of a film while checking out Cable programs. The beginning sequence just kept me curious and wanting to know more, what's going to happen to the two main characters and so on. At the time, I just saw Brendan Fraser in \"Blast From the Past\" opposite Alicia Silverstone, and appreciated Joanna Going's role in another small gem, \"Eden\" (1997, written and directed by Howard Goldberg), as a wife-teacher-mother who has Multiple Sclerosis. STILL BREATHING has magic, and it's so relaxingly delightful! You might say it's quirky, or want to dismiss it as mere fantasy romance. But if you believe - as the film suggests, fate takes a hand in the destined arrangement of two persons being together. The pairing of Brendan Fraser (as Fletcher, the goofy but smart, always a sincere aura about him) and Joanna Going (as the aloof, vulnerable and hesitating Ros) is a godsend unlikely possible couple. James F. Robinson's writing is just right, and his direction is right on. Kudos to October Films for distributing such a wonderful 'small' film, greatly satisfying and enjoyable. It's a surprise gem. There are special close-ups of things - a leaf, a hand, a rock, a knee\u0085each has its own subtle, subliminal significance. Welcome, fate and destiny. Fraser is this young man with such a dedicated and steadfast focus in what he believes - in his heart (a trait handed down from generations in his family) - it is not hokey. It's so unbelievably probable that you want it to be - to happen for real. It's romance at play without showing cupids and 'cutesy' elements. It all seems so downright natural - even thought we know we're in a fantasy Hollywood movie. It doesn't matter: you're on this seeking journey with Brendan and you're not gonna let go - can he fulfill what he held close to his unwavering heart? Joanna Going's Ros seems perfect opposite Fraser's Fletcher. It's matchless casting! Wonderful writing. Imaginative. Creative. What a love and destiny story. Ah, Fletcher and Ros. (I'm repeating myself.) The supporting cast proves to be just as delightful: Celeste Holm as Fletcher's grandmother Ida who has versatile talents; Lou Rawls is the Tree Man who plays music; Ann Magnuson is Ros' social pal Elaine; Michael McKean is a momentarily rich business man. Yes, the menu includes classical tune played by a jazz band, puppet show to cheer a young child, stones stacking as an art, slide projections with 'geographical' touches, endearing hints of black & white flashes. There is wisdom of love, or love legend a-telling\u0085 It's San Antonio, Texas vs. L.A. city scene - which place would you choose? Depends on whom you'd be with - or shall we leave it up to fate? The soundtrack and sound effects contribute to the whole enjoyment of STILL BREATHING. Check it out. Leave skepticism aside. Don't miss a beat.",
         "I saw this at it's premiere in Austin at SXSW a few years ago--Joanna Going sat two seats over from me in the balcony at the Paramount on Congress Avenue in Austin--and the audience loved it. Brendan Fraser is pretty charming in the lead. I was surprised by the cameos: what's-his-face, Lou Rawls, as a street musician; and what's-her-name, who played Fraser's mom (I don't have the cast list handy). An \"OLD Hollywood\" icon. Anyway the plot is pretty unique, but maybe the main plot device could have been more clearly explained right off; I knew what was happening only because the director said what was happening in his opening remarks to the Paramount audience. The producer, a tall blonde BABE in a very lovely dress, gave me a CD of the soundtrack as I was leaving; I told her I thought the film was great and that I hoped she'd make a lot of money off it. She sighed and said she hoped so too.",
         "I can't remember how I came across this unheard-of movie a few years ago, but I am a fan of Brendan Fraser and so I settled back to watch it. I'd never heard one little thing about this movie before, and I was so pleasantly surprised with the whole experience. There was a quiet magic about the whole story. It was a beautiful, peaceful, serene experience just to watch the relationship develop and to enjoy those stunning scenic shots. When the movie ended I felt so relaxed and refreshed! Some months later I had a chance to watch it again, and once again it was like a calming meditation. \"Beautiful\" and \"Magical\" are the only two words coming to mind to describe this movie. It's excellent, and I recommend it highly if you're in the mood for something sweet and peaceful that will make you feel much more alive afterwards. I give it 8 out of 10. Wonderful movie.",
         "Still Breathing is a cute, feel good movie for all romantics out there. It is quorky, and even in its simplisitic thinking, it is truly a 'deep movie'. Brendan Fraser is terrific as Fletcher, and Joanna Going is splendid as Roz. However, many people might look down at this movie because it is rather, well, fictional. Many believe that true love is implausible, but this movie teaches that whatever the scenario, true love is completely realistic. I enjoyed this movie very much and hope that, without becoming repetitive, there will be more like it.",
         "I absolutely LOVED this movie. The way it was filmed was so beautiful. It made me want to visit Texas. I was thrilled to see Joanna Going. She was on a soap opera I used to watch a looooong time ago. She is as beautiful as ever. The characters are believable. Joanna Going's character, Roz, is a con artist but instead of disliking her you feel sympathy for her. I would watch this movie again and again. The music weaves throughout the film and makes you feel good.",
         "I was channel surfing one Saturday afternoon in '05 and fell into the last half of this film. I was hooked! I called a store manager of Blockbuster to help me find this movie for purchase in all their stores back in '05 and she had one VHS left on the sales shelf. There are no more reprints of this for retail sale unfortunately. After watching the movie in its entirety, it was heartwarming. Truly a 'feel good' movie to cheer you up. This movie is beautifully done. The scenes and story line just flows wonderfully to blend into a great story line. Excellent direction from beginning to end. Finally, a movie with a great ending! Joanna Going and Brendan Fraiser are great together. It's one of my favorites. It touches the heartstrings. It may see like a chic-flick but guys would enjoy this too. The mystery and comedic aspects throughout make it lightheartedly touching to watch. The whole concept of how to find your true love has always been a mystery. This movie touches upon that. If only men do find their true love this way it would make a great reality-TV series. (LOL) The SOUNDTRACK is excellent. It's a shame they stopped printing this movie for retail sale. (http://stillbreathing.com/) They really should re-release this and sell more of the DVDs (at a reasonable price). It's too excellent of a movie to sit on a shelf or sell on the streets. Now and then cable movie channels air this but it's rare. If you get an opportunity to watch this movie, it is indeed, a true treasure of a film. I highly recommend it.",
         "Oh, my GOD!!!! For years, I've had a thing for Brendan. This movie sealed the deal. He is too hot for words in this flick!!! The chemistry between the players is freakin' amazing!! My poor hubby searched high and low on the internet to find a copy of this for me, and fortunately, when our house was robbed last Christmas, they left my all time fave movie. I don't care just how \"hardened\" you may have become in the dating world...this movie will remind you what romance is all about. Being a Texas with a heart felt fondness for San Antonio doesn't hurt, either. Ladies...I guarantee that after this movie, your night will be filled with pleasant and slightly naughty dreams....especially the wife beater, personal serenity device...and OHMYGOD....the slide show scene. AHAHHHHHHHHHHH!!!! Trust me, it's a gooder!!!! You'll love it!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Fantasy"
      ],
      "productionCompanies": [
         "Seattle Pacific Investments",
         "ZapPictures Inc."
      ],
      "summaries": ["Two lost souls: she a con-artist in L.A.; he a puppeteer in San Antonio have the same dream linking each with the other. He travels to L.A. to find this woman he has become obsessed with. She resists, afraid of his kooky ideas until she travels with him to San Antonio and meets his wise grandmother. Story of two disparate people linked by \"fate\" gets increasingly interesting as it rolls along."],
      "budget": 0
   },
   "movielensId": 1874,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-01",
      "dvdReleaseDate": "2000-10-17",
      "directors": ["James F. Robinson"],
      "runtime": 109,
      "movieId": 1874,
      "title": "Still Breathing",
      "mpaa": "PG-13",
      "actors": [
         "Lou Rawls",
         "Brendan Fraser",
         "Joanna Going",
         "Ann Magnuson",
         "Celeste Holm"
      ],
      "imdbMovieId": "0120211",
      "originalTitle": "Still Breathing",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["fehUH_WgpGw"],
      "plotSummary": "Two lost souls: she a con-artist in L.A.; he a puppeteer in San Antonio have the same dream linking each with the other. He travels to L.A. to find this woman he has become obsessed with. She resists, afraid of his kooky ideas until she travels with him to San Antonio and meets his wise grandmother. Story of two disparate people linked by \"fate\" gets increasingly interesting as it rolls along.",
      "tmdbMovieId": 39467,
      "avgRating": 3.17337,
      "releaseYear": "1997",
      "numRatings": 199,
      "posterPath": "/w9iW8dQ8OM61lxH01q4PNTmQ6sK.jpg"
   }
}