{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0118866",
      "video": false,
      "title": "Clockwatchers",
      "recommendations": [
         26941,
         307692,
         199342,
         52936,
         17447,
         47798,
         44490,
         49806,
         42911,
         32519,
         36196,
         15990,
         17320,
         77469,
         34208,
         234564,
         37922,
         48745,
         22230,
         55825
      ],
      "backdrop_path": "/7rwFWgr3o3Iy0UsKPas1YjIDzHt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Iris Chapman",
               "gender": 1,
               "credit_id": "52fe48d4c3a36847f817b913",
               "name": "Toni Collette",
               "profile_path": "/oMps1ZPH3dHmqZmrpZcRiyUBgA.jpg",
               "id": 3051,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Margaret Burre",
               "gender": 1,
               "credit_id": "52fe48d4c3a36847f817b917",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Paula",
               "gender": 1,
               "credit_id": "52fe48d4c3a36847f817b91b",
               "name": "Lisa Kudrow",
               "profile_path": "/9c7WB5dqsA3zpZvh6CKRQ6xupjw.jpg",
               "id": 14406,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe48d4c3a36847f817b91f",
               "name": "Alanna Ubach",
               "profile_path": "/g0GOzbSDAzhMxoCBNofiMxHIJJj.jpg",
               "id": 10402,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Cleo",
               "gender": 0,
               "credit_id": "52fe48d4c3a36847f817b923",
               "name": "Helen FitzGerald",
               "profile_path": null,
               "id": 1064534,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Art",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b927",
               "name": "Stanley DeSantis",
               "profile_path": "/4cHxkhTd7oklyNkdva9WJp0FLrX.jpg",
               "id": 4171,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b92b",
               "name": "Jamie Kennedy",
               "profile_path": "/fwvClPv21iaeAsF8Xdg1I0nF8ls.jpg",
               "id": 6213,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr. MacNamee",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b92f",
               "name": "David James Elliott",
               "profile_path": "/lhURUaxfhpPdqKmIKiwsUsfMwd7.jpg",
               "id": 84522,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Barbara",
               "gender": 1,
               "credit_id": "52fe48d4c3a36847f817b933",
               "name": "Debra Jo Rupp",
               "profile_path": "/awbfUc1ABlAunl06r8CY7RwQCW6.jpg",
               "id": 15453,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mr. Kilmer",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b937",
               "name": "Kevin Cooney",
               "profile_path": "/3z2Rte6xznb5Bth6mar42waHc59.jpg",
               "id": 25711,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Milton Lasky",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b93b",
               "name": "Bob Balaban",
               "profile_path": "/3g7IKz8ycv0opDxmpoBxsQkUslU.jpg",
               "id": 12438,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Bud Chapman",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b93f",
               "name": "Paul Dooley",
               "profile_path": "/rnzvqo7oR2IwSfN2Ayh3ysc4WNt.jpg",
               "id": 15900,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Jack Shoberg",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b943",
               "name": "Scott Mosenson",
               "profile_path": "/hmEPmlcwVx5Ao0JBschW6ZVCoSK.jpg",
               "id": 51956,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Global Credit Receptionist",
               "gender": 2,
               "credit_id": "52fe48d4c3a36847f817b947",
               "name": "Joshua Malina",
               "profile_path": "/qa9ItKTmW35iicfsYXowg6P6qm6.jpg",
               "id": 131642,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe48d4c3a36847f817b90f",
               "name": "Jill Sprecher",
               "profile_path": null,
               "id": 145134,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5ac404c8c3a3682d35040514",
               "name": "Jill Sprecher",
               "profile_path": null,
               "id": 145134,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5ac404d592514126be03f62a",
               "name": "Karen Sprecher",
               "profile_path": null,
               "id": 1616084,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5ac404e10e0a260c390429a0",
               "name": "Jim Denault",
               "profile_path": null,
               "id": 2864,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5ac404ec92514126b003d5b1",
               "name": "Stephen Mirrione",
               "profile_path": null,
               "id": 1891,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5ac404fbc3a3682db503fd78",
               "name": "Mader",
               "profile_path": null,
               "id": 57053,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.897713,
      "production_countries": [],
      "id": 55561,
      "vote_count": 15,
      "budget": 0,
      "overview": "The relationship between four female temps all working for the same credit company is threatened with the arrival of a new hire, who lands a permanent position one of the women was vying for.",
      "similar": [
         11421,
         376660,
         244772,
         112160,
         376867,
         258480,
         36040,
         43923,
         12793,
         45153,
         27586,
         8272,
         10735,
         8967,
         858,
         141,
         634,
         14,
         11216,
         773
      ],
      "original_title": "Clockwatchers",
      "runtime": 96,
      "poster_path": "/r7WkwchP388eJMMeBnnFfshUvhN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jill Sprecher"],
      "runtime": 96,
      "synopsis": "Iris (Toni Collette) is a very mousy and quiet young professional who doesn't want to \"rock the boat\" at the office where she works as a temp employee. Margaret (Parker Posey) is the polar opposite to Iris and a catalyst to help her change and speak up for herself. Paula (Lisa Kudrow) eagerly awaits post-work Happy Hours at a local bar and the chance to hook up with the company's executives. Jane (Alanna Ubach) is engaged to marry a jerk who is already cheating on her. Margaret hopes to become a permanent employee as an assistant to Mr. Lasky (Bob Balaban) but her dreams are thwarted when he suddenly dies. A series of thefts start to occur in the office and suspicion falls on the four temps, particularly Margaret. When Iris finds a plastic monkey that she thought was stolen inside Margaret's desk, she loses faith in her and believes she has been doing the stealing. Margaret suggest a one-day strike from work and her friends halfheartedly agree to join her, but on the appointed day, Margaret is ultimately the only one who does not come to work. As a result, the company's officious HR head (Debra Jo Rupp) fires Margaret, and management begins to micromanage the remaining three employees. Iris and the other women's friendships come to an end, as result of the stress, and eventually they all go their separate ways. Jane soon quits her job. Paula reveals that she only heard about Jane's wedding via a newspaper article and Paula goes to temp in another department. It is later revealed that another employee, a shy, quiet young woman from a rich household who became a permanent employee on her first day, was the culprit and that Margaret simply had an identical toy in her desk. Iris confronts the young woman when her diary (from which she does the film's narration) goes missing, and later receives a new diary and note of apology. Iris later is not hired for a job she really wanted, but ironically this helps motivate her to quit the temp field and move on. But before she leaves the company, she is able to do Margaret a favor: one of the senior executives agrees to sign a letter of recommendation for Iris, but she tells him her name is Margaret and, since he had not bothered to learn any of the temps' names, he does not know the difference. Iris then mails the letter to Margaret and bids the temporary worker goodbye.",
      "writers": [
         "Jill Sprecher",
         "Karen Sprecher"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118866/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA5NTc4MzU5NTNeQTJeQWpwZ15BbWU3MDk3MTg4NDE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Toni Collette, Parker Posey, Lisa Kudrow | See full cast and crew »"],
      "reviews": [
         "The only thing that I can think when reading the negative comments left for this movie is that the people who wrote them have *clearly* never temped. As someone who spent four years of his life wasting away in other people's cubicles, I can tell you with complete authority that this movie gets every mind-numbing, insulting, and degrading aspect of the experience dead on. I suppose you should be thankful if you can't relate to what's going on in this film because it probably means you've never had to tip-toe into some middle manager's office on a Friday afternoon to get a signature on your time card. As for those who think \"Clockwatchers\" is \"dull\" or \"boring,\" it's called subtly. Look into it.",
         "Inappropriately marketed as a comedy, Clockwatchers is actually a sad, almost disturbing slice-of-life concerning the empty lives of four office temps and the realistic and/or idealized ways they seek to escape their individual predicaments. This low-key, purposefully bland drama, with spare touches of humor from Margaret (Parker Posey), is steeped in realism, making it all the sadder. Margaret, Paula, and Jane befriend Iris, the central character, at her new temp job. Margaret is loud-mouthed, foul-mouthed, and smart. Paula (Lisa Kudrow) is a young woman with fast-fading beauty, loose morals, and no hope for a future. Jane (Alanna Ubach) is biding her time waiting for her man to marry her and take her away from the temp world. And Iris (Toni Collette) is intelligent but timid. Unlike her new friends, she has the opportunity to score a real job at an interview that her father has lined up for her; however, low self-esteem, shyness, and a new-found friendship with the office girls contribute to her procrastination. Outward, upward mobility seems to scare her. One day Iris stares blankly at her empty diary. Her temp job affects her so badly that she can find nothing to write about; she's been turned into a mindless zombie. During a moment of introspection, she thinks, `Sometimes it hits you, how quickly the present fades into the past. And you question everything around you. You wonder if anything you'd ever do would matter, or if you could just disappear without a trace.' Jill and Karen Sprecher's script is punctuated with perceptive, thought provoking lines, many of which comment on the individual's insignificance in society. Early in the film, Margaret comments on how `a person can just drift through life like they're not connected to anyone or anything.' Later, Iris admits that `even if a person wanted to break free, they could find out they've got nowhere else to go.' Ultimately, the Sprechers' four-character quasi-study can be applied to everyone, every day. Some characters move on, thus positively changing their lives forever; others, whether out of preference, procrastination, or lack of education, stay put, forever locked in dead-end jobs. At the film's end, Iris realizes that improving her situation can come only from `never hiding, never sitting silently, and never just waiting -- and waiting -- and watching the world go by.' Clockwatchers may be a `small' film with a soft voice, but at least it has something to say.",
         "This is a really provocative movie that is artfully filmed. Good art often offers commentary on the times. When you're in the midst of an era, it's hard to see what characterizes it. I think Clockwatchers does a terrific job of capturing a facet of the temp world of the 80's/90's. I was a temp for a year in 1988. It's quite accurate. But you don't have to be a temp to recognize these characters. Yes Dilbert, yes Office Space, and especially the beginning of Joe vs the Volcano have these same foils. But I think Clockwatchers' take was unique. The characters were well developed while still being archetypes. There was a subtlety and style that all the others listed chose against. The direction and cinematography of this film is terrific. It takes guts to burn film doing a close-up of someone's glasses for 10 seconds. There is real art to this film. The writing, the directing, the pacing, editing, all right up at the top of the scale. The acting was fine, but I don't think it's the strong suit of this movie. Toni Collette is a standout. While I love Parker Posey, I think she was probably a bit over the top here. The Muzak, while as mood-setting as the buzz of florescent lighting, can grate at a viewer. This film touched on too may things to list them all. Here's a sample... What are you doing with your life if you're waiting for it to burn off? Isn't it exhausting and poisoning to pretend to look busy all day? If you are a cog in a machine, and accomplishing nothing at that too, did you really even exist? Are the \"troublemakers\" in life getting us in trouble, or offering us freedom (note there are two people here stirring up the pot)? What is theft (and theft of services)? Where is the dividing line between unethical play and immorality? At what point do you give up on the dream of personal growth? Are some people \"better\" than others? What does beauty (and grooming) have to do with it? Does the corporate hierarchy define our worth to others or our self-worth? What is loyalty and betrayal, to whom do you owe how much, and how do you give consent to those obligations/ownership? Work/friends/family are all portrayed as villains and allies wielding this loyalty Sword of Damocles. One IMDB reviewer said this film was a good way to kill time after work. That's terrific irony. :)",
         "I suppose the viewers who label Clockwatchers \"boring\" simply don't understand that dramas are MEANT to be slower than your garden-variety Indiana Jones or Die Hard. These \"action\" flicks are ten-times as dull as the corporate setting for this astonishing study on class, friendship, and inner-awareness. Or maybe it is the female perspective or \"chick-flick\" factor that turn certain people off. Or maybe temporary status in modern American business isn't relevant to everyone. Or the subtle, less gimmicky observations of reality. Clockwatchers is all of these things at once. Toni Collette plays the ultra-shy newcomer to Global Credit, the ultimate transnational corporation, who slowly comes to realize that the doomed bond she makes with three other temps is an extremely sacred event in her life. Iris slowly gains confidence through such comradery and at one point she doesn't want to leave, even though her father has higher career expectations for his daughter. Iris comes full circle at the end of the film, confronts one of her many bosses whom plot against her, and atones for not standing with Parker Posey, who is the life of the party as Margaret. The creators of this film are SO incredibly accurate in revealing what worklife is actually like (the boredom, sharing someone else's space, not knowing someone's name or them not knowing yours), that I felt almost honored to know I wasn't alone. (Movies that are this honest about despair are never depressing.) This is combined by the subtle observations of Iris, which I suppose aren't as exciting as blowing someone's head off or toilet humor, but intriguing nonetheless. It is finally layered with political analysis as the female temps organize a strike. Suffice it to say, Clockwatchers covers a lot of ground, but the layers are folded well together in a way that makes you care about what happens to these characters and their station in life. A must-see sleeper for those who prefer (for example) Merchant & Ivory over Van Damme & Seagal. 9 out of 10.",
         "Some of the earlier reviewers have called \"Clockwatchers\" dull, pointless and have asked why it was made. My question for these reviewers is: What movie were you watching? Is there another movie with a similar title out there? This movie is incredible! No, it's not a \"There's Something About Mary\" farce. No, there aren't any explosion and no one is killed. (Someone does die... but that happens off camera and we don't see any blood.) The comedy here is of the subtle, \"funny because it is true\" variety. If you've ever had a job, any job, the comedy in this movie cannot escape you. Parker Posey once again shows us that she is one of the finest comic actresses alive. And, contrary to what others have said, this is not a one note performance. She is at once obnoxious, brash, funny and fun...and yet, very vulnerable, struggling so hard to be recognized and very terrified of where her life is headed. I could give similar praise to the performances of Toni Collette, Alanna Ubach and (believe it or not) Lisa Kudrow. Director Jill Sprecher (I will have to watch more from her) has aimed her dart at office politics: The pecking order, the self-absorption, the pointlessness of it all, the feeling of \"Oh, how I would I love to leave this place but where would next month's rent come from?\"...and Jill has hit the bullseye!",
         "At the suggestion of co-workers, I rented this film, and was amazed at the honest and funny portrayal \"Clockwatchers\" offers. Sure, it's a slow-moving tale, but working in an office is like that--slow, monotonous, boring. This movie is a very funny satire of inner-office politics. I am surprised the amount of negativity directed towards the film. Perhaps it was a bit too honest? Parker Posey is so perfect in this movie. Toni Collette has the perfect low-key performance to work off Posey's. Lisa Kudrow is funny, but she smartly remains in the background for most of the movie. Alanna Ubach has the thankless role of doing nothing. However, all four work so well off each other, you can easily overlook the negatives. For the person who commented that there are no offices like the one portrayed here, let me say: WRONG! I have worked in two offices that are nearly identical to that portrayed. It was horrible, and I quit both of them quickly. Admittedly, the film does push the realism boundaries, though this is a satire. Exaggeration is key to satire. Go rent this movie. Preferably on DVD for the widescreen. This is better than \"Office Space\" and is more honest in its depiction of office life. It's sad, funny, quirky, and original. Parker Posey's brilliant performance is worth the price alone. Two Thumbs Up? You bet!",
         "Jill Sprecher, the enormous talent behind \"Clockwatchers\", needs to be seen more often. We saw this witty comedy in its original debut and it was a pleasure to watch it again on IFC. Ms. Sprecher and her sister Karen wrote a delicious movie that is on the one level a satire about the way \"temps\" are used in an office, and it's at the same time, a character study about these four souls at the center of the movie. Each one of the young women in the film has a problem. They come together because they don't have a life on their own. Iris, Margaret, Paula and Jane, form a bond because they find safety in numbers. Iris is a clever girl whose shyness doesn't let her assert herself and is dragged along by the others that show stronger personalities. Margaret puts up a front, but deep down, she is just as vulnerable as the others. The most pathetic one is Paula, a woman who is pretending to be what she is not. Jane is waiting for the security of marriage to beat it out of being a temp. When the sneaky Cleo is hired as a permanent employee, the problems in the office are magnified. As things begin disappearing from the office, all eyes point to the four temps. That is the beginning of the end of the clique, as they knew it. Iris is the one that stays the longer and she is the one that discovers the mystery of the missing things in the office, but alas, it's too late, because at that time she leaves the temp job. Toni Collette, Parker Posey, Lisa Kudrow and Alana Ubach, are perfect as the four temps. Toni Collette has a better role where to shine as most of the story is seen through her eyes. Parker Posey is delightful as the free spirited Margaret. Lisa Kudrow also makes a good contribution with her pathetic Paula. Helen Firzgerald, who only has a few lines, cast a giant shadow as the creepy new employee that wants to make friends with Iris, only to be ignored. The Sprecher sisters created a film that feels real a situation one has seen is prevalent in the office setting.",
         "This is one of those movies whose brilliance sneaks up on you. I saw this movie when it first opened in theaters 4 years ago and I distinctly remember not being able to take my eyes off of it...in spite of the fact that its pace is languid and at times meandering, and its main conflict starts rather late in the movie. Nevertheless, those elements didn't bother me, because the film's primary purpose is not so much to be a conventional film as it wants to be a mirror reflecting the hell that is corporate life. And it accomplishes that goal flawlessly. As a slice-of-corporate-life, this movie is so accurate that it sometimes seems like a docudrama. Being an office worker myself, I was impressed by how many details it captured: from the cold, impersonal cubicles to the monotonous overhead music to the arrogance and possessiveness of the person in charge of the office supplies (he'd have you believe he's in charge of planets instead of paper clips) to the secretive, whispered suspicion of and curiosity about new hires, and even to the way bored workers use the up-and-down feature on their swivel chairs to help chase away boredom. Some people view this movie as much ado about nothing since it deals with office life, which, on the surface, seems least likely to offer anything in the way of drama or entertainment. But the movie uses office life as a metaphor for the world we live in and how some of us feel overlooked, unappreciated, or just plain invisible. And the only way to succeed in the corporate world, as in life, is to take action, to make a move, to stop the stagnance. And that's why Toni Collette's character ultimately emerges as a hero. The way she finally takes action by helping the recently (and wrongly) fired Margaret get a recommendation is both touching and inspiring. The cast is great--each player has mastered the mannerisms, the attitudes, and even the blank stares that result from working in an office 5 days a week, 52 weeks a year. But the standout is Parker Posey as the opinionated, defiant, in-your-face Margaret. I've always had reservations about Posey who--in other movies--has struck me as a little too self-consciously cutesy, but here she delivers, and there's almost never a false note as she creates a character who is simultaneously ambitious, hopeful, cynical, upbeat, and sad. Having seen this movie about 4 times thus far, I tend to regard it as a special little friend whom my other friends don't quite understand.",
         "I saw this on cable last night, just 2 days after seeing the Sprecher sisters' latest film, 13 Conversations About One Thing - that was the reason I stayed up til 2:30 a.m. to watch it, in fact (please read my review of 13 Conversations, posted yesterday). This film is linear - one scene following the other chronologically - and therefore not as challenging to the viewer as 13 Conversations, but it does leave its mark (as one character in the movie has been told to do). Writer/Director Jill Sprecher is extremely adept in nailing down specifics, and this gift for detail is in full evidence here. The film is about fear, lunch hours, pettiness, toilet paper, loneliness, rubber band balls, despair, paper clips, friendship, pencils, desperation, cocktail garnishes, anger - downright fury, actually - at being marginalized by the illusion of society - and much more. Toni Collette's face is still in my memory - her terrified-to-do-or-say-the-wrong-thing rabbit eyes, her rapture at feeling connected to her 3 fellow temp workers (and specifically, seeing her nose crinkle the way it does when she smiles), the desolation of seeing their bond destroyed by wretched but inevitable bone-chilling office politics and fear. It's a small slice of life, Clockwatchers, but it's an important slice, one that anyone who has ever interacted with anyone on a daily, money-driven basis can relate to. If you've ever held a job, I'm saying, you will see yourself mirrored in at least some of these meticulous details.",
         "Blistering black comedy co-written by Jill Sprecher (who also directed) and Karen Sprecher, \"Clockwatchers\" gives us a suffocating office setting so vivid and real I half-expected my own co-workers to show up in it. Toni Collette plays the new temporary in a nondescript building wherein office-incidentals are slowly disappearing from the supply cabinet. The ensemble acting is delightfully accurate, and the strife which ensues in this scenario is comically overwrought and horrifying. Sprecher's direction is focused and brave (no overtures to broadly comical sensibilities), and she nimbly stretches the film's satirical edge quite far without faltering. The movie is a genuine American original, and by the final third I couldn't wait to see it again from the start. ***1/2 from ****"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Goldcrest Films International",
         "John Flock Productions"
      ],
      "summaries": [
         "Iris can best be described as a wallflower. She begins her first day as a temp for the nondescript Global Credit Association by waiting in a chair for two hours. This sets the scene for her (mis)adventures with the other \"corporate orphans\", Margaret, Paula and Jane. Led by Margaret, they find subtle ways to lessen the ennui of corporate oppression. The tension escalates when the new permanent hire, Cleo, enters the picture.",
         "Iris is a lonely insecure temp beginning another short-term job for a credit company. She soon meets Margaret, another temp who shows her the ropes and introduces her to fellow temps Paula and Jane. The group becomes fast friends, meeting for drinks after work and looking for guys. All is changed when a new girl is hired and a series of office thefts occur pitting them against the full timers and one another."
      ],
      "budget": 0
   },
   "movielensId": 1875,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "2000-01-11",
      "directors": ["Jill Sprecher"],
      "runtime": 96,
      "movieId": 1875,
      "title": "Clockwatchers",
      "mpaa": "",
      "actors": [
         "Toni Collette",
         "Parker Posey",
         "Lisa Kudrow",
         "Alanna Ubach",
         "Helen FitzGerald",
         "Stanley DeSantis",
         "Jamie Kennedy",
         "David James Elliott",
         "Debra Jo Rupp",
         "Kevin Cooney",
         "Bob Balaban",
         "Paul Dooley",
         "Scott Mosenson",
         "Joshua Malina"
      ],
      "imdbMovieId": "0118866",
      "originalTitle": "Clockwatchers",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["EEviG8HfUkU"],
      "plotSummary": "Iris can best be described as a wallflower. She begins her first day as a temp for the nondescript Global Credit Association by waiting in a chair for two hours...",
      "tmdbMovieId": 55561,
      "avgRating": 3.35354,
      "releaseYear": "1997",
      "numRatings": 1089,
      "posterPath": "/r7WkwchP388eJMMeBnnFfshUvhN.jpg"
   }
}