{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "based on novel",
         "id": 818
      }],
      "imdb_id": "tt0145048",
      "video": false,
      "title": "Little Men",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Narrator / Molly",
               "gender": 1,
               "credit_id": "5a46ffe1c3a368097c003c21",
               "name": "Kathleen Fee",
               "profile_path": "/p7QxiYZCvgCYIBmfoGMN1Xedwo4.jpg",
               "id": 58170,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nat Blake",
               "gender": 0,
               "credit_id": "5a46fff50e0a261727003b6b",
               "name": "Michael Caloz",
               "profile_path": null,
               "id": 1229549,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jo Bhaer",
               "gender": 1,
               "credit_id": "5a470011925141579400392c",
               "name": "Mariel Hemingway",
               "profile_path": "/lNlfYgxGwVSLC4tPJXyos02IRQC.jpg",
               "id": 10447,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dan",
               "gender": 0,
               "credit_id": "5a4700220e0a26171e003d26",
               "name": "Ben Cooke",
               "profile_path": "/mdYAaW3tctXeEqYFl6pKYcgDKSx.jpg",
               "id": 11354,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tommy Bangs",
               "gender": 2,
               "credit_id": "5a470035925141578e003a9c",
               "name": "Ricky Mabe",
               "profile_path": "/xrqqujiAjBV2yh7ddPKowIm1gE.jpg",
               "id": 30608,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Fritz Bhaer",
               "gender": 2,
               "credit_id": "5a47004dc3a368097c003c94",
               "name": "Chris Sarandon",
               "profile_path": "/1Wf3WoXEdPqGyO6onKfFkseDFef.jpg",
               "id": 14541,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Nan Harding",
               "gender": 1,
               "credit_id": "5a47006192514157970038d4",
               "name": "Gabrielle Boni",
               "profile_path": "/dMHsoHqIwIlZdKaYLtr2wnC6LDB.jpg",
               "id": 1231029,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d63c3a368484e1e66ad",
               "name": "Rodney Gibbons",
               "profile_path": null,
               "id": 56983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5a63e6439251410b2d017706",
               "name": "Louisa May Alcott",
               "profile_path": null,
               "id": 58095,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5a63e6580e0a261a0101993d",
               "name": "Mark Evan Schwartz",
               "profile_path": null,
               "id": 981160,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.087583,
      "production_countries": [],
      "id": 209345,
      "vote_count": 0,
      "budget": 0,
      "overview": "In this adaptation of the classic novel by Louisa May Alcott, two street kids from Boston find themselves at Plumfield, a rural boarding school run by Jo and her husband -- and they soon learn academic and life lessons they won't ever forget.",
      "similar": [
         281957,
         392044,
         449176,
         11027,
         11121,
         133805,
         6114,
         101299,
         49529,
         336843,
         182560,
         2501,
         2503,
         1903,
         13,
         769,
         4771,
         65754,
         278927,
         222935
      ],
      "original_title": "Little Men",
      "runtime": 98,
      "poster_path": "/yMwfDCb8UjET9c26N0FadH6dJbH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-05-08",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rodney Gibbons"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Louisa May Alcott",
         "Mark Evan Schwartz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0145048/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2Njc5NzkzN15BMl5BanBnXkFtZTcwMzcwNjUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mariel Hemingway, Michael Caloz, Ben Cook | See full cast and crew »"],
      "reviews": [
         "When I say that Little Men is a 'sharp' movie, I mean that it has a witty sense to it. Though it will never match the success of Little Women, I feel that it comes pretty dang close. I don't know why people dislike it so much. I thought the actors did a fine job, especially newcomer Ben Cook who played Dan. You could feel with and for the characters as you could in Little Women, but the atmosphere is different at least, and it is refreshing. 8 out of 10.",
         "When I first saw this wonderful film, I was in love! I was in love with the characters! This film portrays such emotion and love! The best character was Dan played by the gorgeous Ben Cook! He made me cry! I think that role prooves what a brilliant actor he is and playing a street urchin was the best bet for him! I would strongly recommend that people watch this film as it is a sensitive and wonderful family film. People will fall in love with this film the minute they watch it.",
         "Though some say the actors didn't do very well, I thought they did great. I'm always one to laugh, and this one had me laughing the whole time. Of course, there were emotional scenes, and the end, which was what I would call \"heart-warming\", I cried. Call me a sissy, but it was a great movie. All of the boys, I thought, did great. And Teddy was an adorable little actor too. The best acting would have been done by Ben Cook, who convinced me the whole time I watched the movie. My twin and I both love this movie. It was just so astounding. A cute little tale that concludes Little Women and makes you want to read the books. I would recommend this to all families. It just happens to be one of the stories that touches everyone. Each character was unique, well-played. You have to love it!",
         "Although I can't say I've read any of the books, Little Women or Little Men, I CAN say that this movie is fantastic. For an independent film, I'm absolutely impressed. You wouldn't have thought it to be independent at all- the scenery is marvelous, the acting is wonderful, the plot tantalizing, and best of all, the characters are attracting in the most interesting way and never did I lose interest in the movie. Also, I might add, the camera work and lighting is excellent. You could tell that this movie was obviously made by professionals, but never once did the earlier centriuth feeling leave at all. You feel like you're a part of their lives, it's great! I love this movie much better than I liked Little Women- I think Little Women was too slow in the beginning and too fast at the end so it left you both exhausted and feeling like the movie was long, but still didn't get to the point in time. Anyway, I tell anyone who wants to see a story about adventure, discipline, and finding home, rent this movie about two street urchins who struggle to adapt to the 'be good and obedient' manners of Joe's house.",
         "I bought this video from a seller on Ebay a couple of days ago and it arrived yesterday. Finally sat down to watch it today. Before I saw it I had mixed feelings about how it as I love watching Little Women. The version with June Allyson and Janet Leigh is my favourite, however, I also enjoyed the other two versions that I have seen. This film is GOOD !!! It is very close to the book. OK, there are a couple of variations. In the book it is Laurie that sees that Nat goes to Plumfield, and John Brooke passes away at his own home, not at the school, but nonetheless, this film is a very well done adaptation. Spookily, I noticed a few things all to do with the character of Jo. First off I thought that Mariel Hemmingway bore a strong resemblance to Katharine Hepburn who also played Jo in the 1930's film, and a number of times I thought that the boy who played Nat reminded me of Winona Ryder who played Jo in the 1990's film. All in all a thoroughly enjoyable film and a must-see for fans of Louisa M Alcott's books about the March family.",
         "I absolutely adore this movie. I loved the book, and the movie is a nice version of it. I saw it on TV about two years ago, but since then it hasn't been on and is fairly vague in my mind. I HAVE to buy the DVD soon, as it's a necessity for my collection. People with kids should buy this as it's a great way to introduce them to the world of Louisa May Alcott, but it's not just a film for youngsters. It even made me tear up, which is almost impossible for me, definitely a feel-good film. Lovers of the film Little Women will like this one too, they're very similar in different ways, minus the more famous actors that LW has. I'd give it a solid eight out of ten, highly recommended, and a great family film.",
         "This is a pretty good movie, nothing spectacular but a nice family movie. I didn't much like Mariel Hemingway's Jo, she didn't seem to have much of the tomboyish fun spirit that Jo is famous for. I was surprised to see Chris Sarandon, because this role of his is very different from the one I'm familiar with;Prince Humperdink. I didn't like the Mr. Bhaer of this movie, he was too different from the book character. The boy who played Nat was pretty good, and he gave me the odd feeling I had seen him before, though I have no idea where. I most liked Dan though. There is something very appealing about those tough, street-wise boys, who act all hard but you know they have a heart inside. I thought he was very well played, and I'd like to see that actor (Ben Cook) again. Good movie for kids, adults and some teens might like it too."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Allegro Films",
         "Brainstorm Media",
         "Canada Television and Cable Production Fund"
      ],
      "summaries": ["Retelling of Louisa May Alcott's classic tale of two street kids - one who becomes the recipient of a kind benefactor and the other who goes on the run on the street. The first gets taken to a school run by kindly teachers where he learns virtue and honesty. But when the second boy suddenly is brought into the school, he starts disruptions encouraging drinking and gambling. When he is finally cast out of the school, the other boys react in various ways."],
      "budget": 0
   },
   "movielensId": 1877,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-08",
      "dvdReleaseDate": "2003-03-18",
      "directors": ["Rodney Gibbons"],
      "runtime": 98,
      "movieId": 1877,
      "title": "Little Men",
      "mpaa": "",
      "actors": [
         "Kathleen Fee",
         "Michael Caloz",
         "Mariel Hemingway",
         "Ben Cooke",
         "Ricky Mabe",
         "Chris Sarandon",
         "Gabrielle Boni"
      ],
      "imdbMovieId": "0145048",
      "originalTitle": "Little Men",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "In this adaptation of the classic novel by Louisa May Alcott, two street kids from Boston find themselves at Plumfield, a rural boarding school run by Jo and her husband -- and they soon learn academic and life lessons they won't ever forget.",
      "tmdbMovieId": 209345,
      "avgRating": 2.71186,
      "releaseYear": "1998",
      "numRatings": 59,
      "posterPath": "/yMwfDCb8UjET9c26N0FadH6dJbH.jpg"
   }
}