{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "nova scotia",
            "id": 5829
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "gay man",
            "id": 33458
         },
         {
            "name": "hometown",
            "id": 155808
         },
         {
            "name": "unhappiness",
            "id": 156455
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "dealing with the past",
            "id": 181755
         }
      ],
      "imdb_id": "tt0125128",
      "video": false,
      "title": "The Hanging Garden",
      "recommendations": [
         56310,
         32700,
         107580,
         26630,
         172854,
         15850,
         12453,
         41645,
         35849,
         219924,
         17731,
         132263,
         105067,
         80705,
         65874,
         8353,
         43604,
         32519,
         45219,
         13817
      ],
      "backdrop_path": "/ehZZjfbVOHF09Ui9s6ZNcF5B2F7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Teen Sweet William",
               "gender": 0,
               "credit_id": "52fe45979251416c91037b5b",
               "name": "Ian Parsons",
               "profile_path": null,
               "id": 113811,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Whiskey Mac",
               "gender": 2,
               "credit_id": "52fe45979251416c91037b5f",
               "name": "Peter MacNeill",
               "profile_path": "/wNBsE9FqylAdCwzRvZtkvZJCfVI.jpg",
               "id": 229,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "William",
               "gender": 2,
               "credit_id": "5526f23992514171cb00bbf0",
               "name": "Chris Leavins",
               "profile_path": null,
               "id": 1225397,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rosemary",
               "gender": 1,
               "credit_id": "5526f25c92514162820000f7",
               "name": "Kerry Fox",
               "profile_path": "/6EVZpzoOVUHKqaLqgFrNTT014IN.jpg",
               "id": 17258,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Fletcher",
               "gender": 2,
               "credit_id": "5526f27792514162820000fa",
               "name": "Joel S. Keller",
               "profile_path": "/iAeLdTPIofQsNkpB3QNKycdFhcy.jpg",
               "id": 262720,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Iris",
               "gender": 0,
               "credit_id": "5526f29e9251415785000170",
               "name": "Seana McKenna",
               "profile_path": null,
               "id": 59597,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Grace",
               "gender": 0,
               "credit_id": "5526f2d2c3a3687e0e004f60",
               "name": "Seana McKenna",
               "profile_path": null,
               "id": 59597,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "5526f30b92514171cb00bc04",
            "name": "Thom Fitzgerald",
            "profile_path": "/4jSyoabB9VsY4LekIItNJZsuCOa.jpg",
            "id": 229519,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.405725,
      "production_countries": [],
      "id": 35161,
      "vote_count": 13,
      "budget": 0,
      "overview": "William, a once obese and troubled teen, goes back to his family's home after being gone, without word, for ten years and finds it (and his family) haunted with his past. He had moved to the city and become a fit, well-adjusted gay man, but during his visit home, he becomes unhinged as the newly remembered reasons for his miserable adolescence come to life in each of their presents.",
      "similar": [
         184352,
         26280,
         449176,
         338189,
         413666,
         380874,
         47643,
         26933,
         383526,
         258034,
         11421,
         376867,
         4927,
         425193,
         428493,
         383559,
         52799,
         382475,
         340684,
         10938
      ],
      "original_title": "The Hanging Garden",
      "runtime": 91,
      "poster_path": "/20fdwhvLVJqzPWI2TmVC20C9VsQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Thom Fitzgerald"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Thom Fitzgerald"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0125128/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMTMzNTMwMV5BMl5BanBnXkFtZTcwOTg0NDQzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Leavins, Kerry Fox, Ian Parsons | See full cast and crew »"],
      "reviews": [
         "Sometimes overly poetic in its gardening parallels, this story of a young man who returns to home after a number of years is intense, mysterious, and certainly not lacking in style. In a unique mixture of flashback fantasy sequences, where characters in the past actually interact with those in the present, we see an overweight teenager come to grips with his homosexuality and the returning adult come to grips with his childhood self. This is an amazing directorial debut, and the abundance of cinematic tricks are a welcome storytelling tool. Virgin Mary Icons smile at us; a grown man witnesses the suicide he committed in his youth. The director chooses not to draw thick boundaries around the sexuality of his characters, but doesn't fall into the trap of making them frustratingly ambiguous. Often this leaves the sour aftertaste of homophobia. The mysterious final chapter closes without the pomp and glory that more established directors might have resorted to. It's subtlety complements its outlandishness in a way that doesn't leave you confused.",
         "I'd seen portions of this film on TV when I was about 12, and it frightened me -- I thought it a perversely arousing horror film. Watching it now, I see that it's actually a pretty smartly made literary piece about a family (I could only remember the disturbing images indicated by the film's title). It does have its share of comedy -- there's a lightness in tone that comes mainly from the profuse swearing of the Maritime newlywed (Kerry Fox) who takes part in one of the more awkward marriage processions in recent memory (which also features Ashley MacIsaac on fiddle), and whose marriage instigates the return of her ten-years-gone brother, William. The telling of the film is centered around three tenses of William's life -- his childhood memories, his fat teenage years, and his current appearance -- which are cut up, rearranged, and presented to us, though the unique thing is that Fitzgerald chooses also to surreally intersperse them together into the present one: our current William sees his young self using food as a comfort, and he sees his teen self leave behind his obese body in favor of his current slim frame. I liked the way that Fitzgerald chose to tackle the mind's abstract identity in this very literal way and I think it makes the film more interesting than its abusive-father/thoughtful-mother family drama otherwise would be. There are some nice touches in the film, like William's apparent young sister who he seems to have swapped gender roles with, and there are some really clever scenes like the one where the current William rushes to help his father -- and his father seeing that his grown son has been playing dress-up; or the scene where his mother has to listen to her son's first sexual experience with a woman. The performances are uniformly good for the film's intent, but Sarah Polley stands out as doing something beyond what's merely required. 8/10",
         "Death indeed takes many forms, and Thom Fitzgerald presents one of them here in a very dramatic way. William comes home ten years after his, but it was of course not an actual death, rather the termination of a life of obesity, ridicule and insecurity. Fletcher's rejection, and the ensuing small-town gossip, are what finally caused him to flee to the big city and cut off all communication with family and friends. He returns, reborn as a slim, handsome urbanite, who will not be satisfied until that rejection is reversed. There is a lot of confusion among viewers of this film regarding the corpse that appears to be hanging in the garden. While at least three family members recognize it, it has never physically existed. William has survived the suicide attempt (rather than give in, he is still struggling when the scene ends), and is thus alive ten years later. What hangs from the tree is the broken spirit of a very troubled boy--and the entity that reveals the undercurrent of the plot. Though in appearance a mature adult, William behaves at Rosemary's wedding as if he were trying to experience the childhood he missed. He is late for the ceremony, is dancing with his grandmother in her attic room while he is supposed to be with the rest of the wedding party, and hides under a table during the reception so he can throw flower petals onto the grass for guests to slip on. The pleasures of youth are abruptly halted when he must take care of his drunken father and then help organize a search for his missing mother. Compounding the difficulties are visions of himself as a young boy, using food to assuage hurt feelings, and of course the hanging `corpse.' Later, as both of them envision the corpse, Rosemary reveals to William that she opted to hold her wedding in the garden so as to remember her brother as he `left,' rather than as he `came back.' Although she doesn't want to let go of the overweight, `Sweet William,' the adult will have no part of it and sees his chance to put it all to rest when Fletcher comes on to him down on the dock, the site of an earlier affectionate encounter. After confirming that he holds great attraction over his brother-in-law, William fakes an asthma attack (he has no problem running up the hill), and goes to bury the corpse. Having given up on reliving the past in a more pleasant way, he opts for putting it to rest so he can start anew. Whiskey Mac, like Rosemary, wishes to hold on to the boy he knew ten years ago. It is revealed that he, too, has sensed the corpse when William tells him he has buried it. Devastated, the father tries to exhume it, but the son will not permit him. Of course no physical remains would appear, as none exist, but William doesn't want his father going through the motions of digging up what should be left in place. As George adamantly stated to Martha in Who's Afraid of Virginia Woolf?, the boy is `dead' and there is no use bringing him up again.",
         "Sweet William, Rosemary, Violet, Basil and the rest. Named after flowers and herbs, people growing together in your typical family garden of mismatched souls. Little William, trying to be something that sets him apart from the rest, something nobody can touch or change. He grows up to be a gay and obese teenager. Lusting after his closest friend. Not the easiest of lives. We meet Willy 10 years later, returning home to celebrate his sister Rosemary's wedding. He is now a slim, attractive young man. But what has happened during those ten years? And who is the little boy running around the house? Every time I watch this small masterpiece, new layers of meaning turn up. The plot structure gives away some undiscovered truths, together with dialogue pointers I didn't notice before. That, to me, is a film worth seeing! When we showed this at our local film society, it got a great reception, one of the best we ever had for a film. The Hanging garden is short, bittersweet and - sadly - true to life. You'll find something in this garden for you, whoever you may be!",
         "Hanging Garden is a small, intensely felt film about a family in tatters and a son whose own problems are eclipsed until he does something he can't take back. Given the film's major conceit is a breach in family fabric that can't be woven back in, magic realism is an applicable term--but only so if shot through the caustic self-wounding humour of the Maritimes, where I lived for six years. If this seems dour, then consider the take-off marriage sequence that opens the film: drunkeness, homoeroticism, Celtic music madness and four-dozen f-words. This film is a gorgeous if painful tribute to growing up in a remove that already seems past its age, in an ocean playground whose garden has gone to seed. This film was ranked, and fairly, as the best Canadian film of 1997 by the Jay Stone of the Globe & Mail (Canada's national newspaper), and if that makes Americans laugh, then consider this is a ranking ahead of Sweet Hereafter, which only made it to the Best Director Oscar Nomination and Cannes Recognition for Atom Egoyan and was also Roger Ebert's #2 film of the year. Adulations all around are deserving for this home-grown production. The film only suffers from inexperience with some actors and having to come up with a conclusion for a tale that can't logically have one. And the parents are excellent in it too, especially the mum. At the singular, crucial sequence of the film all the elements of the film - colour, symbolism, lamentation and ladyslipperknots - fuse in breathtaking splendor, and I mean so in the inhaled gasp that graces the east coast 'yes '. It still stuns me in memoriam. Four Stars * * * *",
         "A lovely, intelligent film that challenges the viewer's assumptions about reality, while celebrating the power of memory and redemption. I have rarely been so moved by the beauty of a film, visually and verbally. The performances are real, the writing superb. It also boasts one of the most hilarious weddings in cinema history.",
         "\"The Hanging Garden\" is a slice-of-dysfunctional-life dramady with a coming-of-age flashback which takes you into the tangled web of peculiar family matters and relationships of a Nova Scotia family who live in shadow of a drunkenly abusive patriarch. The quirk infested family includes a gay asthmatic son, a foul mouthed daughter, a wishy-washy mother, a senile old granny, the abusive gardener father, and a kid. The film centers on the grossly overweight son who hangs himself from a tree and remains there as a sort of macabre metaphor for familial dysfunction while living on as a skinny adult and achieving some semblance of normalcy. In spite its obvious weirdness, this earthy flick manages to ground itself with a sense of reality while showing the constant struggle to function in spite of the characters' fractured coping skills. Not for everyone, this fist outing for writer/director Thom Fitzgerald is, IMHO, better than his more recent film \"The Event\". Fodder for those into quirky flicks about dysfunctional families. (B)",
         "We saw the film in its original release. Not having seen it since then, we decided to take another view the other night, as it was a haunting piece of film-making. Thom Fitzgerald directs his own material about a family's disintegration amid an internal crisis. The film shows a family in three different epochs of their lives. The father, Whiskey Mac and his wife, Iris, are seen in their suburban home where they are raising two children. The segments are divided into chapters and all take their names from flowers and herbs. The main conflict in the film is within Sweet William, who as a teen ager is haunted by his latent homosexuality. The object of his interest is Fletcher, the school friend who isn't at all repulsed by William's advances, which are obvious. When they are caught in the act by the zealous grandmother, the family goes to pieces. Sweet William, in shame, hangs himself from a tree in the garden. This, we realize is only a symbolic way to show that like his own mother, Iris, both have fled the home in search of a more normal life. While Sweet Williams returns, completely transformed into a slender man, the mother is never heard of. The message of the film seems to be how a family secret becomes the breaking point and its demise. Whiskey Mac sees the hanging figure of his teen aged son right in the middle of the garden. It's a painful reminder that he has lost him. Rosemary ends up marrying Fletcher, who seems to be game for a sexual encounter with the present William. Mr. Fitzgerald has guided his excellent casts into giving performances that are true to life. Peter MacMeill, Kerry Fox, Chris Leavins, Troy Veinoitte, Seana McKenna, Sarah Polley, and the rest, show an understanding for the material. While this is a somewhat difficult film to sit through, Mr. Fitzgerald film deserves to be seen.",
         "So you thought your family was strange. Just take a look at Sweet William's clan, and give thanks after all for your brood. A young, well adjusted man returns home after an absence of several years to find old memories returning to haunt him. As the film weaves in and out of time zones, we experience a full portrait of the ultimate dysfunctional family. Are folks really like this, or is it just something in the Nova Scotian water? Nary a dull moment in this stimulating, often thought provoking expose. If you're game, take a deep breath and enter the world of \"The Hanging Garden.\"",
         "I recently saw this again having first seen it in the theater on its release and been spellbound by it. Thom Fitzgerald is both the writer and director of an exploration into a family's dysfunction and disintegration amid their getting together for the wedding of the daughter. The film shows the family in both the present and the past and centres around the newly returned son, Sweet William, the father, Whiskey Mac and his wife, Iris, and their relationship to their three children. The father is a nursery man/gardener and the segments of the movie are titled with the names of flowers. As are the children of the family. In the past, Sweet William, an unhappy overweight boy is conflicted by his latent homosexuality. He develops a relationship with his friend Fletcher. When they are caught making love, the family completely falls apart. The message of the film revolves around the theme of family secrets and how attempts to bury or ignore them serves only as a temporary cover-up. They will out. Peter MacMeill, Kerry Fox, Chris Leavins, Troy Veinoitte, Seana McKenna and Sarah Polley give able, believable performances. Again, it is one of those under-appreciated Canadian gems that have not been brought to a wider audience. And deserve to be. And it has one of the most surprising, uplifting endings! 8 out of 10. Bravos to all involved."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Alliance Communications Corporation",
         "Canadian Film or Video Production Tax Credit (CPTC)",
         "Channel Four Films"
      ],
      "summaries": [
         "William, a once obese and troubled teen, goes back to his family's home after being gone, without word, for ten years and finds it (and his family) haunted with his past. He had moved to the city and become a fit, well-adjusted gay man, but during his visit home, he becomes unhinged as the newly remembered reasons for his miserable adolescence come to life in each of their presents.",
         "Having run away as a self-hating, obese and abused 15-year old, William returns to his parents home after 10 years to attend his sister's wedding. He's happy in his new life, with a partner, steady work and having lost all of his excess weight. Being back at home revives all of awful memories of his childhood: overeating because it's the one thing nobody can stop him from doing; being hit by his drunken and abusive father; being seen by his grandmother when he has his first sexual encounter with a male friend; his mother arranging for him to have sex with a woman while she sat in the next room. New revelations are in store however."
      ],
      "budget": 1500000
   },
   "movielensId": 1879,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Thom Fitzgerald"],
      "runtime": 91,
      "movieId": 1879,
      "title": "The Hanging Garden",
      "mpaa": "",
      "actors": [
         "Ian Parsons",
         "Peter MacNeill",
         "Chris Leavins",
         "Kerry Fox",
         "Joel S. Keller",
         "Seana McKenna",
         "Seana McKenna"
      ],
      "imdbMovieId": "0125128",
      "originalTitle": "The Hanging Garden",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "William, a once obese and troubled teen, goes back to his family's home after being gone, without word, for ten years and finds it (and his family) haunted with his past. He had moved to the city and become a fit, well-adjusted gay man, but during his visit home, he becomes unhinged as the newly remembered reasons for his miserable adolescence come to life in each of their presents.",
      "tmdbMovieId": 35161,
      "avgRating": 3.47358,
      "releaseYear": "1997",
      "numRatings": 265,
      "posterPath": "/20fdwhvLVJqzPWI2TmVC20C9VsQ.jpg"
   }
}