{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "lawnmower",
            "id": 2026
         },
         {
            "name": "suspicion",
            "id": 3301
         },
         {
            "name": "fascination",
            "id": 4126
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "wealth",
            "id": 10329
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "hypocrisy",
            "id": 156042
         },
         {
            "name": "voyeurism",
            "id": 178649
         },
         {
            "name": "discrimination",
            "id": 186782
         }
      ],
      "imdb_id": "tt0119506",
      "video": false,
      "title": "Lawn Dogs",
      "recommendations": [
         19033,
         40818,
         261899,
         61072,
         42048,
         42997,
         76800,
         27984,
         32027,
         25576,
         57289,
         85769,
         5282,
         54156,
         121829,
         1905,
         47889,
         46817,
         40562,
         46924
      ],
      "backdrop_path": "/uuFAGCdIiNUxVS04uIWEa0XZiSe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Devon Stockard",
               "gender": 1,
               "credit_id": "52fe45b69251416c9103bbf7",
               "name": "Mischa Barton",
               "profile_path": "/pAfKhudBM6x6XjxziTJ5FftNgSR.jpg",
               "id": 11617,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Trent",
               "gender": 2,
               "credit_id": "52fe45b69251416c9103bbfb",
               "name": "Sam Rockwell",
               "profile_path": "/mEH7nCaG75XNkoFbp3MIwCbIZb6.jpg",
               "id": 6807,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Morton Stockard",
               "gender": 2,
               "credit_id": "52fe45b69251416c9103bbff",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Clare Stockard",
               "gender": 1,
               "credit_id": "52fe45b69251416c9103bc03",
               "name": "Kathleen Quinlan",
               "profile_path": "/qxEXUFX8LP7jAgLvB51S1lWB2zn.jpg",
               "id": 8183,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Billy",
               "gender": 0,
               "credit_id": "52fe45b69251416c9103bc07",
               "name": "Miles Meehan",
               "profile_path": null,
               "id": 115129,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Nash",
               "gender": 2,
               "credit_id": "52fe45b69251416c9103bc0b",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Brett",
               "gender": 2,
               "credit_id": "52fe45b69251416c9103bc0f",
               "name": "David Barry Gray",
               "profile_path": null,
               "id": 94974,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Sean Torrance",
               "gender": 2,
               "credit_id": "52fe45b69251416c9103bc13",
               "name": "Eric Mabius",
               "profile_path": "/mfYqgYHkvJRgPus0kN2V1GhsFOU.jpg",
               "id": 11867,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Pamela 'Pam' Gregory",
               "gender": 1,
               "credit_id": "52fe45b69251416c9103bc17",
               "name": "Angie Harmon",
               "profile_path": "/oFsZQuVxgMm9yUl0dZe4ROznIex.jpg",
               "id": 52929,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Salvador the Mailman",
               "gender": 0,
               "credit_id": "52fe45b69251416c9103bc1b",
               "name": "José Orlando Araque",
               "profile_path": null,
               "id": 115131,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Trent's Mother",
               "gender": 1,
               "credit_id": "52fe45b69251416c9103bc1f",
               "name": "Beth Grant",
               "profile_path": "/zAT9GvzJE0ytL3C36L461cgKI9p.jpg",
               "id": 5151,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Trent's Father",
               "gender": 2,
               "credit_id": "52fe45b69251416c9103bc23",
               "name": "Tom Aldredge",
               "profile_path": "/VNqMbbqT7vK1mYokhn3Tkpcuja.jpg",
               "id": 49835,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b69251416c9103bc29",
               "name": "John Duigan",
               "profile_path": "/bLrx4OQz5g1RnlLQc9ungQ4XKqR.jpg",
               "id": 72624,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe45b69251416c9103bc2f",
               "name": "Naomi Wallace",
               "profile_path": null,
               "id": 115133,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.433577,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 35796,
      "vote_count": 39,
      "budget": 7000000,
      "overview": "In the affluent, gated community of Camelot Gardens, bored wives indiscriminately sleep around while their unwitting husbands try desperately to climb the social ladder. Trent, a 21-year-old outsider who mows the neighborhood lawns, quietly observes the infidelities and hypocrisies of this overly privileged society. When Devon, a 10-year-old daughter from one family, forges a friendship with Trent, things suddenly get very complicated.",
      "similar": [
         2149,
         627,
         122081,
         12271,
         109414,
         979,
         28468,
         1213,
         4995,
         80752,
         106646,
         263472,
         1259,
         9777,
         11004,
         17899,
         2770,
         8363,
         1948,
         4247
      ],
      "original_title": "Lawn Dogs",
      "runtime": 101,
      "poster_path": "/a1a8TnLmUJANysuZG8xBSw4DIBR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Toledo Pictures",
            "id": 39838,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Rank Organisation",
            "id": 364,
            "origin_country": ""
         }
      ],
      "release_date": "1997-11-21",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Innocence is a dangerous friend.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Duigan"],
      "runtime": 101,
      "synopsis": "Camelot Gardens is a housing development in Louisville, Kentucky, where the neat lawns of its apparently neat middle class families are in a constant state of manicured grace, behind Camelot Gardens brick wall. Young Trent Burns (Sam Rockwell) is one of the lawn dogs who come to mow the lawns; he puts up with the hostility of the security guard and the local teenagers for the meager wages that support him in his rundown caravan in the woods off a deserted back road away from Camelot. Newly arrived is the Stockard family, whose 10 year old daughter, Devon (Mischa Barton), likes to be alone, so she can fantasise and what tough fantasies she has. Especially about a Russian witch who lives in the woods. Fearfully, scared the witch might cook and eat her, Devon searches the woods only to find Trent. Trent, reluctant to risk misunderstandings by paying attention to Devon, is nonetheless unable to resist Devons persistent calls for friendship. The friendship does indeed lead to trouble, fuelled by ignorance, prejudice and bigotry on the one hand, and cynicism on the other. Devons friendship both endangers and saves Trent literally and spiritually. Credit: Urban Cinefile",
      "writers": ["Naomi Wallace"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119506/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NDA4NzcyNV5BMl5BanBnXkFtZTcwMTMzMjMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Sam Rockwell, Kathleen Quinlan, Mischa Barton | See full cast and crew »"],
      "reviews": [
         "I first saw this film on late night BBC in England and was half watching it while packing for college. By the half way mark, i was sucked in and couldn't not watch. The first thing that will knock you out is Sam Rockwell. Over the last few years he has risen in fame due to high-profile parts in Charlie's Angels, The Green Mile and Mamet's Heist, but here is the arrival of a veritable acting talent. His is a simple, truthful unshowy performance that resonates throughout the film without crushing it. He is the film's heart, rather than a scene-stealer. As we learn more about his poor, white-trash lawn cutter, we sympathise and begin to realise how easily the reactions of others higher up on the food chain conspire to create chaos for him. I won't give too much about the story away, because it frequently heads off in new, interesting directions, but essentially this is the story of Devon (newcomer child actor Mischa Barton) and the above mentioned Trent (Rockwell) and their relationship. He is poor, she comes from wealthy stock, but feels out of place in her materialistic world and they are both children of nature. What makes it compelling is that she knows this and revels in it and Trent has to be shown, by her. John Duigan does a wonderful job of introducing strands and themes which at first seem offbeat and peculiar but which all add to the sense prejudice, division and isolation felt by these two brillaintly-wrought characters. Each find the other intriguing but are hesitant to become close because of others' values. Eventually they become friends and just as they accept this, the world around them turns on them and what started out as an irreverent comedy-drama, turns into something much darker and even terrifying. Where the film goes from there, I will leave to you to discover. Please do, because this is a very unique film in American independent cinema. Much like the more high-profile American Beauty, what at first seems like character cliche and predictability rapidly leads you down the path least expected. Its beautifully shot, making full use of a handful of gorgeous locations, wonderfully acted, particularly by Barton and Rockwell, but also by the ever-reliably sleazy Christopher Mcdonald (Shooter McGavin in Happy Gilmore and Louise's husband in Thelma & Louise), the quietly strong Kathleen Quinlan and the lesser spotted Bruce McGill in one of his best roles as security guard Nash. The music is also peerless, at first playful and calm, building to a dramatic climax. That climax is what makes this film stand head and shoulders above the rest. An emotional pay-off such as you have never seen in a film of this ilk. 9/10",
         "This superb film, directed by John Duigan, the gifted director of THE YEAR MY VOICE BROKE, is about a friendship between a young girl (Mischa Barton of \"The OC\") and a free-spirited young, adult man (Sam Rockwell). It's self-aware enough to acknowledge the inherent sensitivity of its subject matter, but it doesn't cave into conservative conclusions about how such a relationship ought to be portrayed. At heart, LAWN DOGS is about trust, not the death of innocence or the festering political correctness all around us that sees danger in every unconventional relationship. It does touch on the subject of sexual abuse, but it doesn't come at it from the angle you'd suspect...and that's the whole point, isn't it? Sexual abuse, for the most part, usually visits as someone you've known well enough to trust completely. Beyond its politics, this is a unique, bracing fantasy that is more European than American (or Australian) in its view world both morally and visually. The climax is an unexpected treat and its moral resolution arrives just in the nick of time. Sumptuously photographed and written with great intelligence by Naomi Wallace, it dares to be erotic, provoking, unconventional and incisive. Don't pass it up if you get an offer.",
         "Trent is a young man living in a trailer in a wooded area beyond the suburbs. He makes a living cutting the massive lawns of the populace of a gated suburb village. He befriends a young girl from within the suburb, who herself has some stability issues, despite being only 10 years old. The two build a friendship despite the resentment towards the `white trash' Trent from within the suburb, I didn't know what this film was about before I sat and watched it, reading the plot summary in the tv guide as the title sequence began, I wondered if I would bother, but I'm glad I did. The film works on several level \u0096 the most apparent of which is the simple story of a friendship that is threatened. This part works well as the friendship never seems forced and, although the spectre of sexual tension is there (in Trent occasionally feeling uncomfortable), it is not a strand that is actually part of their relationship. This all works well due (in most part) to two great performances from Barton and Rockwell. Barton shows amazing maturity and ability to carry the role off without it being like many child stars (where it is clear they are forcing everything). Rockwell meanwhile is a mass of subtleties and little touches that make his character likeable. However this part wouldn't work as well if it weren't for the wider theme of the trash being poorly treated by the smugger middle classes. This theme creates the reason for the threat to their friendship (more or less) but it also serves as a humbling attack on a class that lives a selfish, scared life behind gates with private security guards. Such places are increasingly common in America and this film is clear as to their effect on both those inside them as well as the wider community of America. Although it keeps a gentle tone for the most, the film depicts those in the suburb as selfish, aloof and fearful. Even more condemning about this depiction is that it never feels like they have been exaggerated or monsterised in any way! The script is well written and certainly makes the actors jobs a lot easier \u0096 certainly Barton benefits from great dialogue and character development. Rockwell meanwhile benefits more from direction as much of his best work is not dialogue based. McDonald, Quinlan and McGill all do solid work in support. The end of the film is a little worrying as it appears to veer off at a tangent, but the final sentiment is beautifully presented and encouraging (albeit due to a child's apparent naivety). Overall this is a lovely film that I'm very glad I watched. About more than just an adult/child friendship, this film is moving and involving in both it's core plot and it's wider themes.",
         "\"Lawn Dogs\" is a most un-Hollywood-like American movie but that's not surprising; the director John Duigan is a British-born Australian (\"The Year My Voice Broke\", \"Flirting\") and the production companies seem to have been largely British. The satire is biting and the fairy tale elements are not sugar-coated. Ten year old Devon (Mischa Barton) has recently moved in with her parents to \"Camelot Gardens\", one of those new country housing developments favoured by rising executives with mercenary values and no taste, let alone any culture. This one happens to be outside Louisville, Kentucky, but similar places are to be found outside cities all over the US. These are the houses of the undeserving rich. Huge, barn-like houses are plonked in the middle of their treeless lots and surrounded by vast swaths of ever-growing luxuriant grass. After all, this is Bluegrass country. The lawn dogs are the working class boys who are continuously employed to keep the grass down. They do not enjoy high status and must leave the premises after 5 pm. Devon, a highly imaginative kid who makes up fairy stories, becomes friendly with one of the dogs, Trent (Sam Rockwell), who is in his early 20s. She meets him when sent out by her mother to sell gingerbread for the Girl Scouts (called Rangers in the film). Trent at first tries to put her off, knowing full well what people might think, but Devon persists, and a warm but innocent relationship develops. Trent is a not over-bright but slightly rebellious dog and correctly sees in Devon a spirit like his own. Early in the film he holds up the traffic in an entertaining way while cooling off in the river after a hard day's mowing. The residents of \"Camelot Gardens\" are all cardboard cut-out awful, Devon's parents especially. Life is so stultifying that most of them seem to be involved in illicit sex. A bored kid steals all the outside lamps and hurls them into the nearby Ohio river. Two teenagers (one of whom has been screwing Devon's mother and the other of whom has designs on Trent's body) put sugar into Trent's mower engine, destroying his livelihood in the mistaken belief he has taken a couple of their CDs. One girl is quite happy to use Trent as a convenient screw but draws the line at inviting him to her house. The postmen and security guy (an ex-cop) aren't so bad, at least from Trent's point of view. They recognise another working class stiff when they see one. Naturally Trent and Devon are not going to be left alone, but Duigan gives us what is literally a fairy-tale ending, a bit of Kentucky magic realism to match \"Bread and Chocolate\". The real world is told to sod off, in fact. I'm not sure the residents of Jefferson and Oldham Counties, who co-operated in the making of the film, will be too pleased with the portrayal of the \"Camelot Gardens\" residents. But the film isn't really about them. The relationship between Trent and Devon is more older brother - kid sister than anything else though there is an undercurrent of eroticism in Devon's curiosity about Trent's scars and her desire to reveal her own impressive scar from heart surgery. Their joint escapades are pretty innocent and the town's reaction to them completely out of all proportion. Mischa Devon and Sam Rockwell give two well-rounded and well-connected performances. \"Lawn Dogs\" an offbeat, pleasantly paced film about friendship and the things that matter in life. Freedom, it says, is more important than financial security, and the one should never be confused with the other. At least if you're 22 or younger.",
         "From the picture on the cover (see the picture on the main details page!) and reading the back of the video jacket for this movie, I expected this to be a film about suburban wives sleeping with the hired help. Nope. It's a movie about a slightly sick [in the mental and physical sense] young girl [about 10 or 11 years old?] who befriends one of the guys hired to mow the lawns in her gated community. While the guy is reluctant at first, the friendship that forms between them is actually fun to watch. That's what makes the movie interesting. But while the end has to do with the class system talked about on the video jacket, this is a story about the girl and her \"lawn dog\" friend, with the parents and their repressive lifestyle being almost incidental to the story until the end. This is an interesting movie to watch, but I wish the people who write the blurbs on the video jackets would actually WATCH the movies once in a while.",
         "Sam Rockwell has been had. He lit up the screen in \"Box of Moonlight,\" is a major player in the upcoming \"Midsummer Night's Dream,\" and yet he didn't get equal billing for screen time in either of those films. What gives? In \"Lawn Dogs\" Rockwell is stunning as the lawn boy who accepts a little \"rich\" girl as a friend and gives her a new view of the world. The movie is rich in atmosphere and color. The central Southern United States has rarely appeared so docile and yet so menacing. Every time I thought I knew where \"Lawn Dogs\" was going...it pulled another pleasant surprise. Mischa Barton is amazing as Devon Stockard, the little girl with more on her mind than selling cookies. This is truly one of the best American films of the 90's. If you like off-beat slices of America with a twisted view, then \"Lawn Dogs\" is the best movie you'll see in a long time. It is quite simply full of the magic, menace and imagination alive in the heads and hearts of little girls...about to become young women. Oh yeah, and give Sam Rockwell his due!",
         "LAWN DOGS Aspect ratio: 1.85:1 Sound format: Dolby Digital The haves and have-nots are put under the microscope in John Duigan's diverting drama LAWN DOGS, and it's the haves who come up wanting in every respect. Sam Rockwell (CONFESSIONS OF A DANGEROUS MIND) is the penniless gardener-cum-handyman who makes a fragile living tending the lawns of contemptuous rich folk, all of whom view him with deep suspicion whilst indulging their own dubious peccadilloes behind closed doors. Mischa Barton (THE SIXTH SENSE, TV's \"The O.C.\") is a lonely 10 year old girl who's been shielded from the world by her wealthy parents following a recent health scare (she has a faulty heart), but she dares to strike up a friendship with Rockwell after stumbling onto his ramshackle home in the woods, a friendship which she pursues against Rockwell's wishes, until their 'secret' is forced into the open and grossly misinterpreted by Barton's vengeful family. While the moneyed set lives in antiseptic splendour and conceals its hypocrisy behind security measures of every description, Rockwell's character enjoys an open life in a beautiful forest environment, like the witch Baba Yaga in Barton's favourite fairy tale. In fact, there's a magical, otherworldly quality to much of the film (rendered explicit in the final reel), though the central narrative is fairly low-key and revolves around Rockwell's frequent encounters with the dissolute low-lifes who dare to think themselves superior. With his wiry frame and white trash southern accent, Rockwell strikes something of a romantic figure (watch out for his full-frontal nude scene early in the film), though he never stoops to eccentricity or excess. For one so young, Barton is excellent in such a demanding role, and she holds her own against an experienced adult cast (including Christopher McDonald and Kathleen Quinlan as Barton's narrow-minded parents, and Eric Mabius as the rich jock who can barely conceal his attraction to Rockwell). Beautiful cinematography by Elliot Davis (KING OF THE HILL).",
         "'Lawn Dogs' may well be the best movie to come out of America this decade. It's a film that lazily unravels itself, yet succeeds in impacting like a sledgehammer, and does so in such a perfect, unforced and magical way that the experience of viewing it leaves the movie goer completely fulfilled, perhaps like no other film ever has before it. Even more intriguing is the difficulty one has at distinguishing exactly why it is that this film works so flawlessly and just how such a slow moving film can leave a person so thoroughly energized and rejuvenated. Only a few movies of recent times have even come close to carrying off this irony- think 'Fargo' or better still, 'Love Serenade' (interestingly and perhaps not coincidentally also directed by an Australian). Every single element of 'Lawn Dogs' is magical. From the direction, cinematography, music and fairytale infused storyline which deals with the universally important issues of friendship, self-identity, family, community and class divisions, to the powerhouse performances from the two lead performers and amazing supporting cast. John Diugan has demonstrated with 'Lawn Dogs' that he is indeed a true alchemist of the film world that can mix and dabble with the elements to produce pure, solid gold.",
         "Mischa Barton really blew me away in this film. I usually don't care much for child actors, and I went into this film thinking that way. But Barton seemed, with few exceptions, to BE her character. But there's a lot more than just pretty good acting from a precocious child. Barton was a major league charmer. You just couldn't take your eyes off her whenever she was on-screen. Sam Rockwell was decent, and no one else really showed much except maybe Angie Harmon in a small part. (She did have a rare topless scene in this film) But most of the characters do weird things, with no tie-in at all to any reason for their conduct. I think this may be thought by some to be character development, but I think it is either laziness or insufficiently imaginative screenwriters. But in any case you should check out this film just to see Barton. Grade: B",
         "This is the kind of movie that independent film fans search for and hope to find. It's well-written, acted and directed with a story that's off the beaten path a bit, to be sure. It concerns the odd relationship between two people who don't exactly fit in the world an upscale suburban housing community. One is a 10 -year old girl named Devon (Mischa Barton) whose parents want her to be the perfect little daughter. She'd rather live in her own world, one in which she entertains herself with her favorite fairy tale of the child-menacing witch, Baba Yaga. The other is a twentysomething yard worker named Trent (Sam Rockwell), who is treated in this paranoid community almost like a black South African under apartheid, i.e. get in, do you work and get out. Both of them display their non-conformist behavior early on. She climbs out her bedroom window to her roof, takes off her nightgown and watches it magically float away into the night sky. He stops on his way home from work on a one-lane bridge, blocking the traffic, and proceeds to disrobe and take a leap into the river below. Devon gets interested in him, especially after she witnesses his blatant and subtle humiliation at a neighborhood cookout, where he's come to get paid for some work. She more or less stalks him at his mobile home, even spying on him making love to one of the community's young women, a girl who will barely acknowledge him otherwise. Trent tries to shoo Devon away at first, but he can't help but be flattered by the young girl's interest. Of course the potential for misunderstanding in this kind of relationship is great and it inevitably happens. I feared that the movie was about to fly apart after Devon's father and some others confronted Trent, but the fantastic ending (fantastic in the sense of fantasy) made me smile. If you are looking for something different, this movie definitely qualifies."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Rank Organisation, The",
         "Toledo Pictures"
      ],
      "summaries": ["Newly arrived in an up-market housing development, quiet ten-year-old Devon doesn't quite fit in. Ignoring the urgings of her social-climbing father, Devon chooses the company of Trent, who mows the estate's lawns, rather than of the girls her own age. Their friendship grows during her visits to his trailer home, but although it is completely innocent it is obvious that it would be unacceptable to the residents if they found out."],
      "budget": 7000000
   },
   "movielensId": 1880,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-11-21",
      "dvdReleaseDate": "1998-12-08",
      "directors": ["John Duigan"],
      "runtime": 101,
      "movieId": 1880,
      "title": "Lawn Dogs",
      "mpaa": "R",
      "actors": [
         "Mischa Barton",
         "Sam Rockwell",
         "Christopher McDonald",
         "Kathleen Quinlan",
         "Miles Meehan",
         "Bruce McGill",
         "David Barry Gray",
         "Eric Mabius",
         "Angie Harmon",
         "José Orlando Araque",
         "Beth Grant",
         "Tom Aldredge"
      ],
      "imdbMovieId": "0119506",
      "originalTitle": "Lawn Dogs",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "In the affluent, gated community of Camelot Gardens, bored wives indiscriminately sleep around while their unwitting husbands try desperately to climb the social ladder. Trent, a 21-year-old outsider who mows the neighborhood lawns, quietly observes the infidelities and hypocrisies of this overly privileged society. When Devon, a 10-year-old daughter from one family, forges a friendship with Trent, things suddenly get very complicated.",
      "tmdbMovieId": 35796,
      "avgRating": 3.58116,
      "releaseYear": "1997",
      "numRatings": 345,
      "posterPath": "/a1a8TnLmUJANysuZG8xBSw4DIBR.jpg"
   }
}