{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0131436",
      "video": false,
      "title": "I Got the Hook Up",
      "recommendations": [
         47816,
         17584,
         70576,
         44250,
         129798,
         14351,
         102668,
         306307,
         235388,
         18475,
         49877,
         27360,
         221161,
         43814,
         270064,
         16136,
         11443,
         10471
      ],
      "backdrop_path": "/hNanMDuZS6FkomWo95NME0X9nYN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Black",
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf521",
               "name": "Master P",
               "profile_path": "/crshi8WF4eXvaumY5CLmPoTyMFB.jpg",
               "id": 65164,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Blue",
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf525",
               "name": "Anthony Johnson",
               "profile_path": null,
               "id": 83101,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Gun Runner",
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf529",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "T-Lay",
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf52d",
               "name": "Tom Lister Jr.",
               "profile_path": "/UY4xouwBs8p9QmcXbnP8iy2uYp.jpg",
               "id": 8396,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf51d",
               "name": "Michael Martin",
               "profile_path": null,
               "id": 258199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf533",
               "name": "Master P",
               "profile_path": "/crshi8WF4eXvaumY5CLmPoTyMFB.jpg",
               "id": 65164,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4595c3a36847f80cf539",
               "name": "Master P",
               "profile_path": "/crshi8WF4eXvaumY5CLmPoTyMFB.jpg",
               "id": 65164,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.803693,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40505,
      "vote_count": 10,
      "budget": 0,
      "overview": "Two broke buddies feel lucky when they come upon a truckload of cellular phones and begin selling them out of the back of their van. Trouble arises though, when the phones develop faults. The two friends then not only have to deal with unsatisfied customers but also the FBI.",
      "similar": [],
      "original_title": "I Got the Hook Up",
      "runtime": 93,
      "poster_path": "/dwZC33Vufl5HQStkecbxGVLrv1s.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "No Limit Films",
            "id": 16718,
            "origin_country": ""
         },
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-05-27",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "A truckload of cell phones... turns into a boatload of cash!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Martin"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Master P",
         "Leroy Douglas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0131436/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MzA4NzkxNV5BMl5BanBnXkFtZTcwNDQ2NDkxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Master P, Anthony Johnson, Gretchen Palmer | See full cast and crew »"],
      "reviews": [
         "This is definitely one of those movies just to watch to see how bad it is. I'm not too sure if you'll be laughing at it, or laughing with it, but the scenarios are ridiculous (including retarded gangsters trying to ride their bicycles and talk on the cellphone at the same time), the acting is pretty horrible (although Master P's vocabulary primarily consists of Uuuuuuuuugh anyway), and there's gratuitous shots of just about anything that doesn't help the continuity of the movie. Next to \"Dolemite II: The Human Tornado\", this is probably the funniest movie that its only humor is derived from the horribleness of the movie.",
         "It's obvious as to what inspired Master P to make this \"cinematic gem.\" John Witherspoon, A. J. Johnson, Tiny Lester, and several other of the actors in Hook Up were all playing their same respective roles from Friday - Ice Cube's day-in-the-life ghetto comedy. I wish there was an original idea in this movie, but there isn't. One would think that with the collaborative effort NO LIMIT uses to write and direct their movies they would produce at least one film with substantial length or original content. Sadly, this movie falls short on both stipulations. I hope Master P and the NO LIMIT crew had fun making this horrible movie because audience members won't have fun watching it.",
         "Let's face it. Master P is the worst actor in the history of performance. You will never see anything as bad as his stunningly horrific attempts at acting. His awful pick up lines couldn't pick up dog crap, let alone a woman. I got the Hook Up as a film itself is very weak. It tries to be another Friday but fails miserably. The Plot is a joke, and by the time you finish the film, you forget what the film was all about. But Master P has manage to include a few flashes of brilliance. The First being Tiny Lister Jr, who's hilarious expressions and comments, not to mention being a cock eyed motherf***r are sheer comic genius. Then there's the Acting Performance of the millennium by a retard with a disabled sticker on his bike. Worth watching just for his tour de force of a performance. Should have recieved an academy award nomination in my opinion.",
         "I GOT THE HOOK-UP!(1997) Developed by No Limit Films and published by Dimension Films Pros: >Unlike I'm Bout It, actual funding went into making this movie! >A.J. Johnson, albeit annoying, is very funny. Cons: >Master P gives us more and even worse stereotypes on both black and white people than ever. >No one in this movie, especially Master P, can act to save their lives. Plot summary: Enter Black and Blue(Master P and A.J. Johnson), two black guys running a \"ghetto shopping center\"(you won't believe it until you see it) in South Central L.A. One day, a delivery truck filled with cell phones and pagers makes an accidental stop in their area, and Black tricks the deliverymen IN THE MOST IMPOSSIBLE WAY of selling him the goods. Black \"hooks up\" with his perverted on-and-off girlfriend Lorraine(Gretchen Palmer), who has a job at a cell phone company, and a guy that can illegally activate cell phone systems(Anthony Boswell). With everything set, Black and Blue go into selling cell phones. However, when chaos ensues through mixed-up receptions, Black and Blue find themselves on the run from angry customers, federal agents, and gang members. Review: First off, let me inform you that this movie is put together like a live-action cartoon and never takes itself seriously, even when it wants to. All the characters in this movie are overly done stereotypes that are so bad that it hurts. However, there was a particular scene I thought was funny though offensive to the core: (SPOILER ALERT) the scene with Black and Blue getting shot at by handicapped gangbangers, with the leader saying retardedly, \"B****! I'm'll bust a cap in yo' a**!(END SPOILER)\" Also, no one in this movie can act, especially Master P. All he ever does is stupid things in a Southern accent while flashing his gold teeth. The only person in this film that remotely tries to act is A.J. Johnson, though he is basically all mouth in the spirit of Chris Tucker. This movie starts with a unoriginal plot but then quickly gets off the plot and tries to be too many things at once, putting another flaw on this extremely flawed movie. My final 2 cents: Watch it 3 times in your life, and never make any contact with this film again. My rating: 3 out of 10",
         "This is one awful, awful comedy and a waste of a fine cast. Just one failed attempt at humor after another, with such crude and flat gags. The film leads nowhere, thinking it can be fueled strictly on laughs. But there's a problem: the laughs don't exist. There was one funny joke and it was given away in the previews. A.J. Johnson says: \"Here are the twins, Ug and Lee.\" Just so I don't sound like a complete sour grape, there is one great scene involving a boatload of topless babes. If you happen to catch this movie on cable, that scene is worth waiting for. But don't waste any money to rent this movie.",
         "I used to be very much into this \"type\" of film when i was younger. Friday was and is one of my all time favourites and at the time i watched this i used to watch it regularly. \"I got the hook up\" has lots of the same cast, very nearly playing the same roles, but it is so bad. I rented this full of hope when in my teens and even then i thought it was absolute rubbish. Still to this day one of the worse films i have seen. Sometimes really bad films are so bad that they become enjoyable. This does not manage to do that. It just makes you want it to end. I can usually find something good to say about a film but all i can think of for this is that it isn't very long. The dialogue is very bad, the acting is bad, the idea is bad. The soundtrack was bad. Sorry to be so negative. Please don't watch this film.",
         "Black and Blue are two street hustlers who run a ghetto superstore. When they take delivery of a load of mobile phones they think they have it made and start selling them like hot cakes. However when their phones interfere with a radio broadcast, sending details of a money stash out over the air, the two men become the target of a local criminal. Meanwhile the mobile phone company are investigating the new numbers when Black's girlfriend Lorraine is unable to keep them all covered. I watched `Barbershop' a few days ago and gave it a bad review, however now that I've seen this I feel I may have been harsh. This film is awful - yet more cheap crap banged out by No-Limit to try and add to Master P's bank book without any thought of quality control - how very like everything he does! The plot is, well, non-existent. It is merely a series of stupid jokes and scenes with little cohesion. The whole thing seems to be put together for two reasons, 1) to feed Master P's ego and 2) the mis-belief that black people want to see Ricki Lake characters. An example of 1) is the way that the film goes into a playas club at one point, to allow our `heroes' to be surrounded by naked black girls - why? I have no idea but P seems to be having fun. The second thing is seen all through the film in that every character is a joke - a real annoying joke. Squealing and swearing non-stop every character is irritating and unlikeable and, true to form, any white person is a racist (who is brought low by a black man) or a snivelling nerd. Such lazy writing is just plain annoying and it doesn't work. Worst of all is the fact that none of it is funny - none. I half smiled twice at the rapid mouth action of Blue but that was forced on my side. P is an awful actor - I saw him mugging in Dark Angel as well, but here he is worse. He seems to believe that he just needs to swagger and mumble to look cool and he is sadly mistaken. He just looks like a stereotype which I suppose he is - everything about his bling-bling lifestyle is just one big cliché that he brings nothing new to. Johnson is a little better because he makes fun of himself more than P does but even this is lazy swearing and mugging stuff. The rest of the cast is made up of `big-booty' type actresses who are sexy but no more than that and are just like you'd see on Jerry Springer - really lazy stuff guys. Overall if you want a lazy, clichéd film that is full or stereotypes, swearing and cheap jokes but lacking a single laugh then this is the film for you. I think anyone who thinks they have seen a lame comedy should watch this film just to see how bad a bad comedy really is.",
         "I've seen plenty of horrible movies in my life but this one takes the cake. I want everyone to see this though, for a laugh. I still don't understand what the f'n thing was about. Cell phones were important in this film, that's what the \"plot\" of the movie centered around. Other than that I'm at a loss. I can't imagine that a script was written for this. I'm quite sure a few people turned on a couple of cameras and yelled \"do something\". That's has to be what making this moving entailed. Cable access is quality compared to this piece of junk.",
         "I would love to see a \"G\" rated version of this movie. It never let's up in its use of the \"F\" word. In fact in the opening words of the movie, it used the \"F\" word. I think if they made a \"G\" version of this movie - there would be NO dialogue -- the movie would be one long \"MF\" BLEEP! This isn't even a good \"bro\" movie. Bad acting, bad dialouge. It did have a semblance of a plot though. Let me put it this way - if I had to choose between this movie and \"Pippi Longstocking\" -- it would be a toss up... Wayno",
         "I've seen more than my share of bad movies. I've seen my share, your share, probably your dad's share too. And the lady who delivers your mail Monday through Friday, the one who sometimes waves to you when you're out waiting for your dog to take a shizer, I've definitely seen her share. I went to see Master P's \"I Got The Hook Up\" in 1998 after reading a review in the arts section of the local newspaper, a review not unlike the negative ones here on IMDb. It declared \"Hook Up\" to be the absolute worst film the critic had ever seen, and set about quoting some of the supposedly awful lines from the movie. It was upon reading these quotes that I decided I had to go see this flick immediately. If you laughed at \"Friday\", there's absolutely no reason you won't laugh at \"I Got The Hook Up\". It's cut from the same cloth and features a few of the same key cast members as well. The cinematography and overall look of the film are surprisingly impressive as well (the production value is actually better than \"Friday\"). But the greatest part of this film is the dialog and characters. At times, it almost feels like they cast hilarious people and just let them say whatever they wanted. The fact IMDb didn't have ANY \"memorable quotes\" listed for this movie tells me it is truly under-appreciated. I added several of my favorite lines in hopes that some of you guys might laugh and check out this film."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Mastoff Films",
         "No Limit Films",
         "Priority Films (I)"
      ],
      "summaries": [
         "Two broke buddies feel lucky when they come upon a truckload of cellular phones and begin selling them out of the back of their van. Trouble arises though, when the phones develop faults. The two friends then not only have to deal with unsatisfied customers but also the FBI.",
         "Two small time scam artists, Black and Blue, sell boom boxes and broken TVs from their van at the parking lot. When, by mistake, a shipment of cellular phones gets to them, it doesn't take long before FBI and gangsters are after them."
      ],
      "budget": 3500000
   },
   "movielensId": 1886,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-27",
      "dvdReleaseDate": "2001-02-13",
      "directors": ["Michael Martin"],
      "runtime": 93,
      "movieId": 1886,
      "title": "I Got the Hook Up",
      "mpaa": "R",
      "actors": [
         "Master P",
         "Anthony Johnson",
         "Ice Cube",
         "Tom Lister Jr."
      ],
      "imdbMovieId": "0131436",
      "originalTitle": "I Got the Hook Up",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["51wlrIYKKlM"],
      "plotSummary": "Two broke buddies feel lucky when they come upon a truckload of cellular phones and begin selling them out of the back of their van. Trouble arises though, when the phones develop faults. The two friends then not only have to deal with unsatisfied customers but also the FBI.",
      "tmdbMovieId": 40505,
      "avgRating": 2.21579,
      "releaseYear": "1998",
      "numRatings": 95,
      "posterPath": "/dwZC33Vufl5HQStkecbxGVLrv1s.jpg"
   }
}