{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "drama",
         "id": 8029
      }],
      "imdb_id": "tt0119547",
      "video": false,
      "title": "Little Boy Blue",
      "recommendations": [32020],
      "backdrop_path": "/3ZuHZcUKUFHy7Q8tjuBnK7bIJ7D.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jimmy West",
               "gender": 2,
               "credit_id": "52fe43d5c3a368484e000c87",
               "name": "Ryan Phillippe",
               "profile_path": "/8MlC0rqhMpDxnfFjmw2DKOhdVpB.jpg",
               "id": 11864,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Kate West",
               "gender": 1,
               "credit_id": "52fe43d5c3a368484e000c8b",
               "name": "Nastassja Kinski",
               "profile_path": "/4ru0isgjh43sPCpHMyXa0OuLkJn.jpg",
               "id": 2630,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ray West",
               "gender": 2,
               "credit_id": "52fe43d5c3a368484e000c8f",
               "name": "John Savage",
               "profile_path": "/4cNKdr2E2gAvAjjydcwJGscoBsD.jpg",
               "id": 47879,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Doris Knight",
               "gender": 1,
               "credit_id": "52fe43d5c3a368484e000c93",
               "name": "Shirley Knight",
               "profile_path": "/ehtTPcvqq91Dxl7mtlzi0xJI6KP.jpg",
               "id": 28778,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43d5c3a368484e000c7d",
               "name": "Antonio Tibaldi",
               "profile_path": null,
               "id": 85549,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d5c3a368484e000c83",
               "name": "Michael Boston",
               "profile_path": "/itlkQSekYpMd2ASP0ZJFsVmMOsG.jpg",
               "id": 85550,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.164054,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20064,
      "vote_count": 7,
      "budget": 0,
      "overview": "Living in rural Texas is a dysfunctional family: an abusive dad, a Vietnam vet with a war wound that's left him impotent; a compliant wife and a son of about 20, two small sons who look a lot like their brother. The dad harbors a secret, and he goes to murderous lengths to keep it hidden. The young man, Jimmy, who has suspicions, but little comes out until a Yankee woman comes to town.",
      "similar": [
         421044,
         435126,
         62206,
         37247,
         4982,
         2118,
         289,
         13809,
         238,
         240,
         947,
         9798,
         1538,
         50620,
         261023,
         75780,
         134374,
         272,
         10530,
         37710
      ],
      "original_title": "Little Boy Blue",
      "runtime": 99,
      "poster_path": "/yBFQhYiHSt7KkyqKfzuuKdtIcbr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-06-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Antonio Tibaldi"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Michael Boston"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119547/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5MzU5NTQ2OF5BMl5BanBnXkFtZTcwNTQ4ODA0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ryan Phillippe, Nastassja Kinski, John Savage | See full cast and crew »"],
      "reviews": [
         "Little Boy Blue is a difficult-to-review dichotomy of a movie. It continually pairs brilliant film-making with portions that one would expect from a straight-to-video release. The movie starts off quickly establishing its heavy sexual content and unusual family relationships. The alcoholic, Vietnam veteran father played by John Savage is a fierce, detestable character meant to be feared by all but his inexplicably devoted wife played by Kinski (what does she see in him?). Savage's character is effective but could have given us more understanding of why he became who he is. Savage spares no family member his brutality and cruelty. Oldest son Jimmy (Ryan Phillippe) receives even more denigration than his two younger brothers. The tension as Savage and Phillippe both realize that Jimmy's now reaching the age where he may be able to stand up to Savage and therefore threaten his dominance over the family is brilliantly played. Phillippe's performance is light-years past any of his others. He steals the movie with his torn-character-- wanting to escape his hellish father, but fearing what will happen to his mother and even more so his two young brothers if he leaves. This debate is layered even more into his relationship with his girlfriend and the possibility of leaving for college with his great baseball talent. Jimmy's desperate need for love and yet difficulty of being able to love after his nightmarish upbringing makes for captivating viewing. In one sense, though, he has already found it in the wonderfully-shown love he has for his two brothers. It is one of the most tender brother relationships one will find on the screen and clearly the heart of the entire movie. The mystery and plot-turns are much more hit-and-miss than the relationships. Some are well-conceived and timely unveiled, but others make one scratch his head and wonder what was the point of that? One wonders if too much was left on the cutting room floor or if the movie was dumped into video stores with little thought. Such instances include the dramatic recognition by the mail-carrier of the police patrolman that leads to ... nothing. In fact, the mail-carrier's role seems to be too large for such little payoff. And what is the point of the forced-statements at gunpoint by Mrs. Knight? Overall, the role of the police in the movie is the least-developed. Various implications are made in vague, unfulfilled ways. Are the police attempting a cover-up or are they simply negligent in their investigation? And why all the time spent on Nate Carr's attempt to get in on more action at the police department? Little Boy Blue has more flaws than one would like, but it so perfectly handles the complicated relationships at the center of the story that you can't help but love this movie. It will at once move you to tears of sorrow, fits of empathetic anger, and hopes of peaceful love. A warning, though; this movie is full of sex and is worse in that regard than most R-movies. However, this is central to the plot and not superfluous. Here is the irony: many go to see Phillippe's body in cheaper, low-brow movies. They will likely miss this one-- which surely shows more of Phillippe than any of his others-- but which for the first time shows the possibility of a coming actor. And, in at least my opinion, finally puts Phillippe in a quality movie-- one you won't soon forget. Rating:8",
         "This movie is for the adult audience, the actors do a wonderful job portraying each role, I do wish it was a little longer, but it was well thought out and very good. The beginning of the movie is shown to the very end, where a couple in the 70's are heading towards Texas with their baby, and they unfortunately end up picking up a soldier on his way home. Summary: The seemingly normal couple Ray and Kate West live in the outback somewhere in Texas with their 3 sons, the adult son Jimmy is a great baseball player, but doesn't seem to want to do anything in his life except be around the younger boys, who he is extremely protective over. As the movie progresses we see that there are plenty of secrets hidden within the family when Jimmy is forced to have sex with Kate at gunpoint by Ray. At first the impression I got of the movie was that Jimmy would no doubt kill his father one day for putting him through that form of incest, but as the movie continued it started to make more sense that it wasn't entirely incest, but more a very disfunctional family who suffer from Ray's war \"wounds\" and are paying the price of what he had gone through. Ryan Phillippe does a superb performance as Jimmy, the tortured and hurt young man, who wants to be with his girlfriend, but has deeper issues concerning his family. John Savage, again another excellent performance, after seeing him in Dark Angel I must admit the bad guy routine really suits him, but I wasn't really fond of Natassja Kinski's acting and character. She still ends up being the devoted wife, who loves her husband even though he puts her through hell. How weak. The younger cast, the two sons were great, really good acting! I'd give this movie a fair 8/10 with a question mark, being we live in this day and age wouldn't a mother try to protect her sons even if it means leaving her husband? (Or shooting him? Hello?? He has a gun in the house, doesn't anyone else know how to use one?!)",
         "A boy named Jimmy West (Phillippe), who longs for a better life, learns some harsh realities about his existence. After years of dealing with an abusive and sexually disturbed \"father\" (Savage) and being protector to his \"mother\" (Kinski) and younger brothers, he is given a chance by his wealthy girlfriend to get away. The only problem is, guilt, love and fear for his family makes him stay. Upon realizing Jimmy is growing up and has been snooping around where he shouldn't, his father decides its time to reveal some startling news to him. The shocking news makes Jimmy more desperate than ever to tear himself and his family away from his father before something worse happens. At the same time, a woman named Doris (Knight) appears in town, and she reveals to the police why she is searching for the West family. The police lend their help, but she ultimately takes matters into her own hands when she shows up at the West's trailer. The ending is not at all what one would expect and many questions are left unanswered, leaving the viewer wishing for more explanation. I was sorry to see that this movie was not highly publicized because I thought the acting was intense by all. Having forgotten that I first saw Phillippe (along with John Savage) in \"White Squall\", this was really the first time I saw him in a leading role and, might I say, what a performer he is. As for Savage and Kinski, one of the reasons I watched this movie was to see them together again as I had enjoyed them so much in \"Maria's Lovers\". It was nice to see the chemistry still there. Admittedly, some of the sex scenes are a bit harsh and you need to see this movie more than once to really understand it, but don't let that stop you from seeing it at all.",
         "The primary problem with most non-mainstream films is that they fail to adhere to some of the basic cinematic elements that make films work. True, they are often interesting and provocative, but they fail in the larger sense that the film itself (not just the subject matter or content) fails to succeed for viewers. That is not the case with \"Little Boy Blue.\" For once, a novel premise and provocative content combine in a well-written screenplay that leaves the viewer fulfilled instead of disappointed. This film far exceeded my expectations in all areas, including the believable yet powerful acting in all of the major characters. My major problem with the film was that the early part of the film didn't deal with (or even allude to) the overriding premise that really comes to light in the final third of the film. Additionally, the Doris Knight characterization seemed a bit unstable and her motivation in the final scenes is hard to pin down. Still, a highly recommended film.",
         "Little Boy Blue had me transfixed the entire time, wondering about this and that, and the final climax is startling and surprising. You think you've got it figured out, but then something (rather, someone) comes along and everything gets turned upside down. I watched this three days ago and still can't get it out of my head. It was, as far as I can remember, the most disturbing movie I've ever watched and when I started doing some math in my head the next day, I got very, very queasy. I think this film was well acted and well made, even though certain things could have been improved. When the movie finishes you might get caught, like me, stuck between wanting to watch it again with a fresh perspective and being too hesitant to re-watch some of those scenes. John Savage is convincing in his role as the father, you try (it's not a big effort, but it's there) not to sympathize with him and I feel you'll succeed since he is one twisted fellow. Ryan Phillippe is the title character and the story's center, but he doesn't have as much to say, it seems, as other characters. He perfects the role, though, he does an excellent and very truthful job of it. The mother, well, I disagree with the actress' portrayal of her, but I understand it. I think it should have been different, though. You sympathize with her too much and when the movie's over with and you start 'doing the math', like me, you might be left feeling quite a bit less sympathetic. Oh, and the two boys do a fantastic acting job. Those are some good child actors there. The plot is full of twists and keeps you hooked, but it does drag on a little if you're convinced you know what's going on and there's no surprise or point in watching other than to be wigged out. Believe me, it pays off. But you won't be able to figure out what's what until it's over, and then you still might be wondering about certain motivations, and well, numbers. It isn't for the faint of heart. My mother, I know, would have a heart attack if she watched it. I recomend it, if you've got a strong stomach and a bit of patience. It's worth watching twice (kind of like The Sixth Sense, how the movie is in a new light on the second viewing), it'll have your wheels spinning. If anything can be said about it...it's unique, original and interesting...and certainly affecting.",
         "This \"sleeper\" is a masterfully done, complex drama. The story unfolds slowly at first, and the relationships among the characters remain somewhat ambiguous during the first part of the movie. However, once the plot starts to unravel, the film becomes a compelling mystery, revealing only hints of the true horror that propels the action. This is probably Phillippe's best work as an actor; he is given the chance to act--and not simply stand around and look pretty--and he is quite good. Savage and Kinski also deliver powerful performances. You'll probably have no trouble finding this one at the video store, since it didn't get much publicity. But it's definitely worth watching.",
         "This is one of those Southern Gothic flicks involving family secrets in a small town with characters and events that make your skin crawl, yet you just can't stop watching. About halfway through you'll think you've got it all figured out but one or two of the revelations towards the end will probably take you by surprise. Ryan Phillippe does an outstanding job, showing that even early in his career he was more than a pretty face, as does Nastassja Kinski, who I guess also shows she was more than a pretty face. (As for John Savage, he can probably phone in this kind of role by now.) One quirky aspect of the script is that various characters will be just about to learn something important when the scene will cut away .. leaving you, the viewer, in the dark. It comes dangerously close to being an annoyance, but the upside is that this allows the final act to spring its surprises all the more effectively. I appreciated that the ending was more hopeful than I'd expected, partly because I thought I'd figured things out but was proved wrong. Had this been directed by someone like David Lynch it would probably have been a masterpiece. Nonetheless, even if it doesn't rise to that level it is certainly a film that holds your attention and keeps you guessing until the end. More than a \"B movie\" .. maybe a B+.",
         "If you're in the mood for lighthearted escapism you've got the wrong flick. If on the other hand you'd like to be entertained with a great dark/disturbing story with plot twists that are done in very original ways, \"Little Boy Blue\" will more than satisfy! Everyone in this picture did a superb job and I do mean everyone, writers, directors, music, lighting, sets, etc. Ryan Phillippe does more than hold his own in this dark tale in fact he shines! This is a disturbingly haunting movie that I've watched several times, and I don't do that often. So, if you like your entertainment on the gritty side of reality snag this one for your library.",
         "A real cinematic gem that unfortunately got little notice. Start with a total evolving original story by the writer, a director not afraid of hurting his chances with a big studio film and portrayals by John Savage & Ryan Phillippe, and this film adds up to one movie one might find hard to forget nor would one want to. \"Little Boy Blue\" blows the lid off of conventional story ideas and keeps one on the edge of their seats. It's unpredictable, scary, even funny at times but oh-so rewarding. It's kinda like \"Blue Velvet\", \"The Great Santini\" and that tv movie \"Something About Amelia\" from many years ago. I recommend it not only once as a rental but maybe two or three times because each viewing seems to show you a little something extra to put the pieces together in this suspenseful drama. I still can't believe hardly no one's heard of it in this day and age. I recommended it always to friends. Note: It has a couple of young characters but it's not for l",
         "\"Little Boy Blue\" tells the story of a rural Texas trailer trash family with an abusive Vietnam vet patriarch (Savage), a teenaged son (Phillippe) who has sex with the mother (Kinski), and a pair of young sons. Laboring over one dysfunctional moment after another, this dark and ominous drama manages solid performances from a solid cast while it squanders everything on the setup and then sprints to the end in the denouement. More could have been made of the \"hook\" which comes off like too little, too late. A good watch for those into dark dramas about dysfunctional people and families."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Jazz Pictures"],
      "summaries": ["Living in the rural Texas panhandle is a dysfunctional family: an abusive dad, a Vietnam vet with a war wound that's left him impotent; a compliant wife and a son of about 20, who have an incestuous relationship at the insistence of the dad; and, two small sons who look a lot like their brother. The dad harbors a secret, and he goes to murderous lengths to keep it hidden. The young man, Jimmy, who sleeps out in the shed, has suspicions, but little comes out until a Yankee woman of middle age comes to town looking for a dead private eye. And why does dad keep calling Jimmy, \"little boy blue\"?"],
      "budget": 0
   },
   "movielensId": 1890,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-01",
      "dvdReleaseDate": "2006-07-11",
      "directors": ["Antonio Tibaldi"],
      "runtime": 99,
      "movieId": 1890,
      "title": "Little Boy Blue",
      "mpaa": "",
      "actors": [
         "Ryan Phillippe",
         "Nastassja Kinski",
         "John Savage",
         "Shirley Knight"
      ],
      "imdbMovieId": "0119547",
      "originalTitle": "Little Boy Blue",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["5Wlm-Rz8dqQ"],
      "plotSummary": "Living in rural Texas is a dysfunctional family: an abusive dad, a Vietnam vet with a war wound that's left him impotent; a compliant wife and a son of about 20, two small sons who look a lot like their brother. The dad harbors a secret, and he goes to murderous lengths to keep it hidden. The young man, Jimmy, who has suspicions, but little comes out until a Yankee woman comes to town.",
      "tmdbMovieId": 20064,
      "avgRating": 2.85333,
      "releaseYear": "1997",
      "numRatings": 75,
      "posterPath": "/yBFQhYiHSt7KkyqKfzuuKdtIcbr.jpg"
   }
}