{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "psychoanalysis",
            "id": 2833
         },
         {
            "name": "razor",
            "id": 3125
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "psychiatric hospital",
            "id": 10323
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "psychologist",
            "id": 11268
         },
         {
            "name": "hospital",
            "id": 11612
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "straight razor",
            "id": 158203
         },
         {
            "name": "mental hospital",
            "id": 190007
         }
      ],
      "imdb_id": "tt0120401",
      "video": false,
      "title": "The Ugly",
      "recommendations": [
         20216,
         96909,
         67822,
         81475,
         99092,
         36867,
         56604,
         39912,
         59317,
         12724,
         12791,
         28671,
         80653,
         100391,
         27612,
         18441,
         33721,
         21398,
         25033,
         47488
      ],
      "backdrop_path": "/pNwWJWAUM4DT6dcENv3dH3C91i1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Simon Cartwright",
               "gender": 0,
               "credit_id": "52fe45adc3a36847f80d4461",
               "name": "Paolo Rotondo",
               "profile_path": null,
               "id": 76836,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dr. Karen Schumaker",
               "gender": 1,
               "credit_id": "52fe45adc3a36847f80d4465",
               "name": "Rebecca Hobbs",
               "profile_path": null,
               "id": 173385,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Phillip",
               "gender": 2,
               "credit_id": "52fe45adc3a36847f80d4469",
               "name": "Paul Glover",
               "profile_path": null,
               "id": 1070221,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe45adc3a36847f80d446d",
               "name": "Christopher Graham",
               "profile_path": null,
               "id": 1085971,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Marge",
               "gender": 0,
               "credit_id": "52fe45adc3a36847f80d4471",
               "name": "Darien Takle",
               "profile_path": null,
               "id": 1085972,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Marlowe",
               "gender": 2,
               "credit_id": "52fe45adc3a36847f80d4475",
               "name": "Roy Ward",
               "profile_path": null,
               "id": 206524,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Helen Ann Millar",
               "gender": 0,
               "credit_id": "52fe45adc3a36847f80d4479",
               "name": "Cath McWhirter",
               "profile_path": null,
               "id": 1085973,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Helen's friend",
               "gender": 1,
               "credit_id": "52fe45adc3a36847f80d447d",
               "name": "Carolyn Beaver",
               "profile_path": null,
               "id": 1085974,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Simon, aged 4",
               "gender": 0,
               "credit_id": "52fe45adc3a36847f80d4481",
               "name": "Caelem Pope",
               "profile_path": null,
               "id": 1085975,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Evelyn Cartwright",
               "gender": 1,
               "credit_id": "52fe45adc3a36847f80d4485",
               "name": "Jennifer Ward-Lealand",
               "profile_path": "/dEfQ4QCj24HlwVcA3GXXePiSd6z.jpg",
               "id": 173382,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Future cop",
               "gender": 0,
               "credit_id": "52fe45adc3a36847f80d4489",
               "name": "Finn Johnsen",
               "profile_path": null,
               "id": 1085976,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Future cop",
               "gender": 2,
               "credit_id": "52fe45adc3a36847f80d448d",
               "name": "Phillip Brown",
               "profile_path": null,
               "id": 1085977,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Future cop",
               "gender": 0,
               "credit_id": "52fe45adc3a36847f80d4491",
               "name": "Tau Luke",
               "profile_path": null,
               "id": 1085978,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Police photographer",
               "gender": 2,
               "credit_id": "52fe45adc3a36847f80d4495",
               "name": "Tim Barlow",
               "profile_path": "/9rSiw99ubAbRBUSSYE1fptMxb1J.jpg",
               "id": 79875,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Simon, aged 13",
               "gender": 2,
               "credit_id": "52fe45adc3a36847f80d4499",
               "name": "Sam Wallace",
               "profile_path": null,
               "id": 1010989,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45adc3a36847f80d445d",
               "name": "Scott Reynolds",
               "profile_path": null,
               "id": 206549,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "547c4e8bc3a3685b050029c2",
               "name": "Scott Reynolds",
               "profile_path": null,
               "id": 206549,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.911447,
      "production_countries": [{
         "iso_3166_1": "NZ",
         "name": "New Zealand"
      }],
      "id": 40961,
      "vote_count": 21,
      "budget": 0,
      "overview": "A female psychologist wants to understand the minds of a confessed serial killer who spent the last five years in a mental hospital because of his state.",
      "similar": [
         10781,
         10585,
         3600,
         12662,
         9792,
         9373,
         26688,
         378018,
         4232,
         948,
         3597,
         10824,
         12521,
         13567,
         27414,
         136835,
         341006,
         21484,
         10092,
         376570
      ],
      "original_title": "The Ugly",
      "runtime": 93,
      "poster_path": "/hVIrZps5S664za9PYLLtvGviYH7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "New Zealand Film Commission",
            "id": 294,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Essential Films",
            "id": 39988,
            "origin_country": ""
         }
      ],
      "release_date": "1997-08-26",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Murder is in the eye of the beholder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Reynolds"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Scott Reynolds"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120401/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4ODg0NDc1NV5BMl5BanBnXkFtZTcwOTI4MTgxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Paolo Rotondo, Paul Glover, Christopher Graham | See full cast and crew »"],
      "reviews": [
         "Being Australian and a horror movie fan I'm always curious to see any made in Australia, or in 'The Ugly's case, New Zealand. It's a real battle to get genre films made Down Under and there have sadly been very few good ones over the years. 'The Ugly' is one of those few. It would be easy to dismiss this from the packaging as yet another serial killer thriller but no, it's actually a HORROR movie with a supernatural element (something which inexplicably seems to have passed by a few people, going my some of the user comments on this page!) I didn't recognize writer/director Scott Reynolds name at first, but later I realized that I've seen his 'Heaven' starring Martin Donovan, another very interesting movie. Paolo Rotondo who plays the killer is unknown to me but gives a memorable performance, and really helps this work, as does the inventive editing and playing with narrative, which deftly mixes the past and present, fantasy and reality. The stylized touches such as the black blood also made 'The Ugly' fascinating viewing. I'm highly critical of most contemporary horror movies, but I highly recommend 'The Ugly'. Great stuff!",
         "Pretty disappointed with this movie as it happens. It came to me highly recommended by some people whose opinions I trust on such things but it really doesn't pass muster. The opening scene was pretty good to be fair and the film had a few good things going for it. The two orderlies were class - must have been fun roles to play, Jennifer Ward-Lealand is grotesque as Simon's mum and Reynolds certainly conjures up a bit of atmosphere. On the downside, it just wasn't very interesting. He's a serial killer who had a troubled childhood and was bullied at school. His mum was nasty to him and he hears voices in his head telling him to kill. Hardly revolutionary stuff is it? Roy Ward clearly watched lots of Bond movies to prepare for the role of Dr Marlowe. If you've seen Austin Powers, then think Dr Evil but with added demonic facial hair. All that was missing was a white cat for him to stroke. I've seen this compared to Silence Of The Lambs but Rotondo and Hobbs are no Hopkins and Foster. I've also seen this described by a lot of folk as 'overlooked' or 'unappreciated'. That may be true but then there are reasons why it's overlooked and unappreciated. Not a bad movie, just not the 'hidden gem' I'd been led to expect.",
         "Sort of what you'd get if you took SILENCE OF THE LAMBS and cross-bred it with Neil Jordan's IN DREAMS. Going for a Lynchian feel, director Reynolds owes more to the spookily dreamlike imagery evoked by the writings of Ramsey Campbell. Images make you queasy, disturb and profoundly frighten you, yet you can't seem to quite tear yourself away from them, as if you're having a nightmare with your eyes wide open. As singled out in other reviews here, Paolo Rotundo manages to temper the character of Simon with a sense of humanity, something you'd never dream of associating with a serial killer. This hearkens back to earlier little diamonds-in-the-rough from Down Under, like Richard Franklin's ROAD GAMES, David Blyth's DEATH WARMED UP or the more fantasy-oriented films of Peter Weir like THE LAST WAVE or PICNIC AT HANGING ROCK. Like SE7EN before it, it disturbs and disorients you on some pretty deep levels, then gut-punches you with a shockingly unexpected ending, which may not make it something you want to see over and over again. But for fans of this particular genre, it's definitely worth a look.",
         "The Ugly is a pretty good movie up until the unbelievable and unremarkable ending. While the story isn't very original, the director is obviously a fan of Norman Bates, it does hold the viewers interest and one is drawn into the story and looks forward to what will happen next. I do however have a complaint about the film. The ending is stupid and as mentioned above, unbelievable. One previous reviewer stated in their review that \"some things are better left unexplained\". It is my feeling that endings like the one in The Ugly are the result of a writer/director who doesn't know how to end their movie interestingly. It's not clever scripting but bad writing. Overall The Ugly is an okay horror movie. It does have a fair bit of suspense and a couple of good shocks but nothing too noteworthy. Prior to the ending The Ugly rated an 8 but as a whole rates a 5 out of 10.",
         "I'd never heard of this film before viewing the \"Boogeymen\" compilation, and was inspired to hunt it down afterwards, believing I might have missed out on a horror film of stunning importance. Indeed, Paolo Rotondo earned his award for his portrayal of Simon, a shy, good-looking and incredibly violent serial killer. Paolo makes his character sympathetic as we flash back to his childhood and see him beaten by his schoolmates and humiliated further by his weirdo mother. We don't blame him when he kills her. We understand, even if it's on a primal level, the bursts of anger that make him kill again and again. We even hope he will win the girl of his dreams, though when he does, we know it's only a matter of time before she too falls under the razor blade. Simon is a complex character, the sort who stops to rescue an injured dog with the fresh corpse of his most recent murder still in the backseat, or refrains from murdering a little girl because she is deaf, and therefore as damaged as he is. The film that surrounds Simon is unpleasant, to say the least. It is disgusting and difficult to watch and not always easy to follow. The ambiguous ending left me just as confused as I was when the film began. It was as though the people who made this film couldn't decide whether they wanted a straightforward story of a serial killer, or a dark fantasy about demons and the supernatural powers of the twisted mind. Everything is hinted at, but nothing is verified, and at films end, you are left to make up your own mind. I couldn't help but feel disappointed, especially since it seemed that Mr. Rotondo put his all into a character for a film that just wasn't worth the effort. It left me feeling sick and depressed.",
         "\"The Ugly\" is one of the best horror/thrillers I have ever seen.I think that it ranks up with such terrifying genre classics like \"Maniac\" or \"Henry:Portrait of a Serial Killer\".Paolo Rotondo plays Simon,a psychopathic serial killer who,having been abused by his domineering mother as a kid,decides to murder lots of people.\"The Ugly\" is a really suspenseful,psychologically disturbing film which has to be seen to be believed.It's also very violent,even by today's standards-the killings(mostly razor slashings)are cold blooded and brutal.Sure,the blood is black,but it goes well with dreamlike atmosphere of the film.The acting is excellent,especially the performance by Paolo Rotondo is amazing.Simon is the guy we worry about finding hiding behind our doors when we come home late at night.The guys like he really exist in our world.All in all I'd wholeheartedly recommend \"The Ugly\" for those who want something much more intelligent and unsettling than any mainstream slasher flick.10 out of 10.",
         "I wanted to see The Ugly when it was released in cinemas, but I didn't actually get a chance to watch it until I rented it a few years later. Now I regret not seeing it in the cinemas when I had the chance - this movie would have been awesome on the big screen!! Simon Cartwright, a convicted serial killer, is a patient at a local mental institution under the care of two abusive orderlies and the sadistic Dr. Marlowe. Simon requests outsider Dr. Karen Shoemaker to re-evaluate his mental state, and through a series of interviews she learns more about his past and about his crimes. The use of disjointed and out of order flashbacks tease us with glimpses into Simon's past, and as the movie progresses, we see Karen being drawn further and further into Simon's fantasy world. As she begins to be affected mentally, so too are the viewers. There's been a lot of criticism over this movie, mostly claims that the characters weren't believable enough or that the SFX were bad. To really appreciate this film you have to pull your mind away from what's conventional and try to see what the director is trying to do. Scott Reynolds isn't trying to follow some set 'horror movie' pattern or copy a particular movie genre. In the movie, \"The Ugly\" is a monster inside Simon's head, and that's what Reynolds is trying to do- get inside our heads, disturb us and shake us up a bit. This is done through the creepy atmosphere of red and blue colour themes, and the black blood adds to the surreal mood of the movie. Some of the characters are a bit unbelievable but this adds a 'Twin Peaks' feel to the film. And as for the ending, some things are better left unexplained, people!! This movie is very violent and creepy, and guaranteed to keep you on the edge of your seat. If you like it, tell all your friends about it! I give it a 8.5/10",
         "I was attracted to the Ugly mostly because of its title, which just sounded really good to me. I wasn't disappointed in the slightest, as the film's characters, lighting, pacing, dialogue, and style completely blew me away. The acting is superb, especially from Paolo Rotondo. In addition to all this, the New Zealand accents made it really appealing to me.",
         "The Ugly is the kind of movie that wants the viewer to try to figure out what is really going on at the end. The trouble is, I didn't think the movie deserved my thinking time. I had the rare experience of knowing I could sit there and try to figure out the movie but feeling completely unwilling to give it any thought. I think the reason I felt this way is that I was never sure what the movie was trying to accomplish. Did it want me to feel sorry for a serial killer? Sorry, I won't go that far. Did it want me to appreciate its visual style? Okay, somewhat appreciated, but not thought-inspiring. Did it want me to decide what was a dream? It didn't set that up effectively. ***possible spoiler*** I feel like I am giving the movie too much credit to suggest this but... maybe the whole thing was a sweeping indictment of the criminal justice/mental institution system that made a serial killer out of a troubled kid. ***end of spoiler*** Kind of a whiny film, really. I can't call this movie bad, but I found it curiously ineffective.",
         "I found THE UGLY to be pretty enjoyable overall. The problem is that no one seems to have any REAL idea what the hell happened in the film. Now, I don't mind a film that makes you think - but I don't like it when so many things are left vague that you can never truly make heads-or-tails of where the storyline is going. Simon is a serial-killer (who claims he's not a serial killer) who seems to have a dual-personality that her refers to as \"The Ugly\". Simon claims that The Ugly is responsible for the murders and that \"The Visitors\" tell him to kill. A famous female psychologist comes in to analyze Simon and try to get a look inside his head. There's a lot of hard to decipher stuff going on, including the tumultuous relationship with his mother and his boyhood friend Julie, allusions to the fact that Simon is somehow psychic, that all of this may just be a dream, all the blood shown is tar-black, the name Karen (the psychiatrists name) showing backwards in many scenes, shopping carts all over the place, etc...that I just couldn't wrap my head around... THE UGLY is definitely interesting and keeps you guessing - the problem is, it never provides the answers. Playing out like some sort of SILENCE OF THE LAMBS meets THE USUAL SUSPECTS, but with no real resolution (at least none that I could figure out). In many scenes it seems that Simon may be a master-manipulator, other times he seems completely sincere. Some things that happen later in the film negate things that happened before. Basically, I couldn't explain what really happened at all - but it's still an entertaining watch. The other main problem I had that while some of the performances were decent, others were sub-par. The two \"thug\" security guards at the mental hospital were COMPLETELY unbelievable - as though ANY mental hospital would employ such degenerates. Either way - I'd recommend THE UGLY for horror/thriller fans - just understand that unless you find something that I didn't in the narrative - you WILL NOT walk away from this one with any solid answers...7.5/10"
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Essential Films",
         "New Zealand Film Commission"
      ],
      "summaries": [
         "Simon is a confessed serial killer who spent the last five years in a mental hospital because of his state. Dr.Karen Shoemaker wants to get through to him and starts visiting him in the hospital, and his previous life comes to us in flashbacks.",
         "Simon is a killer. Unfit to stand trial. He has been locked away for five years, watched by the sinister Dr Marlowe. Enter Karen, an enthusiastic but formidably intelligent psychologist. She will interview Simon - who wants to prove that he is cured. He seems sane. Seemingly incapable of ferocious acts of violence. He tells her of a terrifying force within him, which drives him to destroy those around him. He says this force has gone. Karen listens to his story. At first she trusts him, even believes him. But then her trust gives way to scepticism. His confession is replaced by deception. The interview unleashes demons from Simon's strange internal world - threatening Karen's previously stable sense of reality. She wants the truth. But she finds that truth can be the most terrifying thing of all.",
         "A female psychologist wants to understand the minds of a confessed serial killer who spent the last five years in a mental hospital because of his state."
      ],
      "budget": 0
   },
   "movielensId": 1891,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-26",
      "dvdReleaseDate": "1998-12-08",
      "directors": ["Scott Reynolds"],
      "runtime": 93,
      "movieId": 1891,
      "title": "The Ugly",
      "mpaa": "R",
      "actors": [
         "Paolo Rotondo",
         "Rebecca Hobbs",
         "Paul Glover",
         "Christopher Graham",
         "Darien Takle",
         "Roy Ward",
         "Cath McWhirter",
         "Carolyn Beaver",
         "Caelem Pope",
         "Jennifer Ward-Lealand",
         "Finn Johnsen",
         "Phillip Brown",
         "Tau Luke",
         "Tim Barlow",
         "Sam Wallace"
      ],
      "imdbMovieId": "0120401",
      "originalTitle": "The Ugly",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Rx8Z-tPer9s"],
      "plotSummary": "A female psychologist wants to understand the minds of a confessed serial killer who spent the last five years in a mental hospital because of his state.",
      "tmdbMovieId": 40961,
      "avgRating": 2.47414,
      "releaseYear": "1997",
      "numRatings": 116,
      "posterPath": "/hVIrZps5S664za9PYLLtvGviYH7.jpg"
   }
}