{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "courtesan",
            "id": 4178
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "revenge",
            "id": 9748
         }
      ],
      "imdb_id": "tt0118894",
      "video": false,
      "title": "Cousin Bette",
      "recommendations": [
         80346,
         68716,
         2319,
         61016,
         48864,
         58467,
         19380,
         2166,
         78691,
         50225,
         61168,
         31611,
         54933,
         36141,
         49963,
         40562,
         75531,
         38583,
         18222
      ],
      "backdrop_path": "/3YTCTF8VMnNykiCZRYd0QICakJN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Cousin Bette",
               "gender": 1,
               "credit_id": "52fe47b7c3a36847f8144549",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jenny Cadine",
               "gender": 1,
               "credit_id": "52fe47b7c3a36847f814454d",
               "name": "Elisabeth Shue",
               "profile_path": "/44AaIXkbZFkdhSW1kRdzCbfYk6c.jpg",
               "id": 1951,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cesar Crevel",
               "gender": 2,
               "credit_id": "52fe47b7c3a36847f8144551",
               "name": "Bob Hoskins",
               "profile_path": "/mIgAC6q5HcHHxZUIiCOvE6mHLGs.jpg",
               "id": 382,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Baron Hector Hulot",
               "gender": 2,
               "credit_id": "52fe47b7c3a36847f8144555",
               "name": "Hugh Laurie",
               "profile_path": "/3qCmEHtq5fBW8dbzsYDSy16Zqb0.jpg",
               "id": 41419,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hortense Hulot",
               "gender": 1,
               "credit_id": "52fe47b7c3a36847f8144559",
               "name": "Kelly Macdonald",
               "profile_path": "/ncpSRbNH44itdir2FLJHsD0nGVV.jpg",
               "id": 9015,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Victorin Hulot",
               "gender": 2,
               "credit_id": "56cf6010c3a3681e360034f4",
               "name": "Toby Stephens",
               "profile_path": "/zZAbK5QVmZSqZzAe16mXWzgjrSs.jpg",
               "id": 10881,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b7c3a36847f8144545",
               "name": "Des McAnuff",
               "profile_path": "/1qcbrutvM9P9HAVW5dFWjQRrhPR.jpg",
               "id": 588701,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b7c3a36847f814455f",
               "name": "Honoré de Balzac",
               "profile_path": null,
               "id": 25349,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe47b7c3a36847f8144565",
               "name": "Lynn Siefert",
               "profile_path": null,
               "id": 12963,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b7c3a36847f814456b",
               "name": "Susan Tarr",
               "profile_path": null,
               "id": 43889,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.22684,
      "production_countries": [],
      "id": 50043,
      "vote_count": 14,
      "budget": 0,
      "overview": "Cousin Bette is a poor and lonely seamstress, who, after the death of her prominent and wealthy sister, tries to ingratiate herself into lives of her brother-in-law, Baron Hulot, and her niece, Hortense Hulot. Failing to do so, she instead finds solace and company in a handsome young sculptor she saves from starvation. But the aspiring artist soon finds love in the arms of another woman, Hortense, leaving Bette a bitter spinster. Bette plots to take revenge on the family who turned her away and stole her only love. With the help of famed courtesan Jenny Cadine she slowly destroys the lives of those who have scorned her. Written by CherylC894@aol.com",
      "similar": [
         979,
         11121,
         281957,
         226,
         3134,
         9093,
         180863,
         281,
         395834,
         10575,
         8067,
         74997,
         445954,
         24420,
         133805,
         59421,
         15912,
         400,
         17609,
         1024
      ],
      "original_title": "Cousin Bette",
      "runtime": 108,
      "poster_path": "/rkuPUrB4PM6Ob9IvniEpNDO5hvJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-06-12",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Who knew deception, treachery and revenge could be this much fun...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Des McAnuff"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Honoré de Balzac",
         "Lynn Siefert"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118894/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3MDc1MzY0MF5BMl5BanBnXkFtZTcwMjcyNzgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jessica Lange, Elisabeth Shue, Bob Hoskins | See full cast and crew »"],
      "reviews": [
         "The words 'adapted from a novel by Honore de Balzac' would suggest to most cinema-goers an example of French heritage cinema, like the excellent version of his 'Le Colonel Chabert' made with Gerard Depardieu in the early nineties. Although Balzac is often claimed by the French as their greatest novelist, he has not captured the imagination of the Anglo-Saxon reading or cinema-going public in the same way as some of his compatriots such as Hugo, Verne, Flaubert or Dumas. Apart from 'Cousin Bette', I am not aware of any other English-language feature films based on his works. The story is set in the Paris of the 1840s. Bette Fischer is a middle-aged spinster who works as a theatrical costumer. She is not well-off financially and lives in a sparsely-furnished apartment, although she has more elevated social connections; her cousin Adeline, who dies at the beginning of the film, was married to the influential Baron Hulot. Bette, however, had little love for Adeline, as she was jealous of her cousin's beauty and of her marriage to a successful man. She falls in love with Count Wenceslas Steinbock, a young Polish sculptor who lives in the same apartment block, but loses her sweetheart to Adeline's pretty young daughter Hortense. Bette's dislike of the Hulot family now turns to hatred, and she plots her revenge. She forms an alliance with Jenny Cadine, an opera singer-cum-courtesan and a former mistress of the Baron, who has given her up in accordance with his wife's dying wishes. Jenny, with Bette's encouragement, tries to ruin the happiness of the young couple by seducing Wenceslas away from Hortense. Those who are familiar with Balzac's novel will realise from the above summary that the film does not stick closely to its plot. Adeline, for example, dies at the very end of the novel, not at the beginning. The real villainess of the novel is not Jenny (who plays only a minor part) or even Bette (who is portrayed as pitiable as well as spiteful), but Valerie Marneffe, the scheming, hypocritical, gold-digging and thoroughly corrupt middle-class housewife who becomes the mistress of Hulot, Wenceslas and several other men. Valerie does not appear in the film at all; nor do Hulot's other mistresses. The film concentrates on the relationships between Bette, Wenceslas, Hortense and Jenny; Hulot, a major figure in the book, becomes less important in the film. The ending of the film, in particular, seems unsatisfactory. There is a confused attempt to tie the story of the Hulot family in with the revolution of 1848, an event that had not even taken place when the novel was written in 1846. This was probably inspired by the standard school textbook idea that the French Revolution represented a corrupt aristocracy getting its just deserts, but this interpretation seems to confuse the events of 1848 with those of 1789, and it is not one that is likely to have appealed to the conservative monarchist Balzac. The replacement of the constitutional monarchy of the amiable 'Roi Citoyen' Louis-Philippe with the regime of the unscrupulous adventurer Napoleon III was not the most glorious episode in French history. Like some other reviewers, I felt that some of the roles were miscast. Jessica Lange, even in her late forties, was far too attractive for the role of the dried-up, embittered spinster Bette. (Balzac chose the name because of its similarity to the French word 'bete', meaning 'beast'). Bette's driving force is sexual jealousy of the beauty of other women, particularly of Adeline and Hortense, but Miss Lange's character is not a woman who would need to feel jealous of anyone. Kelly Macdonald's Hortense seemed too insipid. Hugh Laurie, in his late thirties at the time the film was made, was far too young for the role of Hulot. The character envisaged by Balzac was probably in his sixties and the father of two adult children. (Hortense has an elder brother, Victorin). Laurie, better known in Britain as a comedian than as an actor, plays Hulot as a largely comic figure, whereas in the novel he is a tragic one, a distinguished public servant ruined by his sexual passions and his financial improvidence. The book forms part of the sequence of novels which Balzac intended as a close examination of French society and to which he gave the title of 'La Comedy Humaine'. Despite this title, most of the individual novels, 'La Cousine Bette' among them, are deeply serious rather than humorous, but the filmmakers here seem to treat the story as a black comedy. On the whole, in fact, this approach works well. The story moves along at a brisk pace, helped on its way by some witty songs. The title of one of these, 'Love is the Master, You are the Slave', is perhaps the best encapsulation one could wish for of the film in a single phrase; most of the characters are enslaved by their sexual desires. Jessica Lange may be physically wrong for the part, but she nevertheless throws herself into her role with gusto and makes a splendidly hissable pantomime villainess. Elisabeth Shue's singing voice is not really strong enough to make her convincing as an opera singer, but she is well able to convey Jenny's seductive charms. Unlike some, I found no difficulty with the fact that Bette and Jenny had American accents; both, after all, were originally peasant girls from Alsace-Lorraine (Bette's surname implies that her native language is probably German rather than French) and would not have spoken French with the Parisian accents of the other characters. There are some good performances in minor roles; Toby Stephens makes a suitably dull and priggish Victorin, a man who is the complete antithesis of his father, and Bob Hoskins is in superb form as the greasy businessman Crevel. The name is derived from 'crever', meaning to burst, and Hoskins's Crevel is a man positively bursting with his own self-importance. The film may take liberties with Balzac, but on the whole it is an enjoyable one which works reasonably well in its own right. 6/10",
         "I'm not familiar with Balzac's novel, but I've read a ton of Romantic literature. And this is one of its classic variations (The virtuous are redeemed). I would never have selected this movie myself (friends did) but I enjoyed it. If I described this as Madame Iago, you'd have the entire plot. Nothing is quite so much fun as watching someone who's been disrespected revenging herself on a crowd, especially after how needlessly cruel they've been. Since the playing field will never roll the arrangement back in Bette's favor, why not just destroy everyone? It's like a bomb went off when she's done. I am in no way a fan of Lange, but she's adequate (while looking distressingly like Jim Carrey in drag). On the minus side, the lead-up to the 1848 Revolution is trivialized. The writing is extremely weak (Point A is always too overtly connected to Point B), and the lighting of every scene is too brazen. The accents are all over the place, which becomes very distracting.",
         "\"Cousin Bette\" is a witty and deliciously mean-spirited black comedy. The operative term, however, is \"mean-spirited,\" so this film is not for all tastes. Cousin Bette is victimized (at least in her own mind) by her selfish and unfeeling relatives. Based on a Balzac novel, the story follows Bette's attempts to find love and to get even with those she believes have wronged her. Things don't ever work out as Cousin Bette plans, but the lady proves she is adaptable. Jessica Lange, despite her beauty made me believe that she was an unattractive spinster. Bob Hoskins was, as always, excellent, as was Elizabeth Shue, who nearly stole the show. Good stuff. Recommended.",
         "The plot is complicated, too much so to describe in 1,000 words. Let's just say Cousin Bette is a tale of familial revenge set in 1840s Paris. Cousin Bette is the spinster aunt of a large wealthy family in the throes of loosing it all; money, dignity and respect. As they struggle, Bette (Lange) weaves her plots, many of which go astray working unintended consequences. This is a delightful black comedy that I liked very much, more so than most reviewers and commentators. If you have a predilection for this kind of movie, jump right in.",
         "So what if this movie reminds of dangerous liasons, or cruel intentions or any other film for that matter! Now-a-days, good luck being completely original, when we live in the era when the Wayans brothers are bringing t.v.s The Munsters to the big screen, Yikes! The hard fact of the matter is that Jessica Lange is AMAZING (as always) and Elizabeth Shue is a delight. I really enjoyed the \"Oh what a tangled web we weave\" plot line and you will too if you give it a chance. The story is well written, and the performances are effortless. I usually don't care for period pieces and truth be told, I had to be forced to turn this one on...but I WAS SO GLAD I DID. The supporting cast is a hoot as well.",
         "Every once in a while, a movie comes along that lets one revel in emotions that are generally frowned upon in genteel society. Revenge is one such emotion, and the very black comedy Cousin Bette deals it out in generous portions. Bette (Jessica Lange) has always lived in the shadow of her more beautiful sister, Adeline. Adeline was always prepared for marriage and society, while Bette became a virtual servant for her family. To make matters worse, Adeline marries the one man Bette loves, the Baron Hulot. The film opens with Adeline on her death bed, listening to the confessions of her adulterous husband and spendthrift son. She makes Bette promise to take care of her family. The malicious grin on Bette's face lets us know what is coming. Bette orchestrates her revenge on each member of the family, with a cunning her family never suspected. Part of what makes this film so delicious is that none of the characters are really very likeable, but they are all very interesting and well drawn. Even Bette is not someone you would want to welcome into your own family (although she'd make a fascinating guest at a dinner party). The only character who fares even mildly well is Cesar Crevel (Bob Hoskins). A merchant who has become the wealthiest man in Paris, he is attempting to buy his way to respectability. He is at least without pretense, even going so far as to offer 200,000 francs to see Hortense Hulot (the Baron's daughter, played by Kelly MacDonald) naked. The story follows Bette's attempts to destroy the Baron and his family by manipulating them in their love affairs. The marriage of Hortense is expected to save the family financially, hence the appearance of Crevel. But Hortense loves the penniless Count Wenceslas Steinbach (Aden Young), a sculptor. Meanwhile the Baron has been borrowing from everyone in Paris to keep his mistress, Jenny Cadine. Bette controls all of the characters like a Grand Master. The backdrop to the film is the decay of the French aristocratic society. Resting on the laurels of the Empire of Napoleon, oblivious to the coming revolution (the film begins in 1846), and in complete denial of the changes around them, we actually cheer for Bette as she systematically destroys the Hulot family. In a way it's the revolution carried out from within, making the fall all the more sweet. This film is really exceptional. My only criticisms would be that (1) Elisabeth Shue as the famous actress/courtesan Jenny Cadine is merely adequate, (2) it is almost impossible to imagine the stunning Jessica Lange as the \"plain\" sister, and (3) the characters' accents tend to vary from time to time. The script is intelligent, clever, and realistic. The acting is very strong all around, especially by Lange. Hoskins is terrific, hitting just the right note of a materialistic man trying to be a nobleman, but not quite getting it. The locations and sets are lush and as decadent as one would expect. The direction of Des McAnuff is crisp and assured, the pace even and well controlled.",
         "The closing credits on this movie rolled more than an hour ago. I still feel soiled. The only good thing about director Des McAnuff's version of Cousin Bette is Jessica Lange's excellent turn as Bette, that misunderstood, underestimated old maid hiding her lifelong rage and jealousy beneath a mask of family loyalty. In all other respects, this adaptation is execrable. Screenwriters Lynn Siefert and Susan Tarr should be banned from ever penning any more literary adaptations. Balzac's Cousin Bette was a masterpiece, an eternal condemnation of the selfishness of vice, achieved through a portrayal of depravity's destruction of virtue. The cinematic version is a mediocre daytime drama in petticoats. The power of the original novel derives from Balzac's use of fascinatingly, unforgettably, tragically human characters to illuminate his pitiless moral: that virtue, nine times out of ten, will fall to the knife in the back of vice. That moral is played out through the characters. And from the pure, pious, and eternally forgiving Adeline Hulot, a wife willing to forgive and forget more than two decades of her adored husband's infidelity, all the way down to the Jewish courtesan Josepha, at once a shameless gold-digger, a great artist, and, at heart, a kind woman, every player in Balzac's grand tragedy plays an irreplaceable part and illuminates an unalterable truth. And it is with the writers' treatment of those characters that McAnuff's Cousin Bette first fails. The greatest tragedy of the novel lies in the gradual abandonment and destruction of the saintly Adeline Hulot. After closing her eyes to two decades of infidelity, she slowly falls from her position into terrible poverty and neglect--one of those illuminations of the destruction of virtue by vice which gives the novel its power. Siefert and Tarr seem not to have grasped this essential point of the source material. Instead of having to deal with the difficulty of a great beauty thrown into the gutter, they have taken the easy way out by killing her off within the first five minutes of the novel. And this without even bothering to pay lip service to the beauty and charm of the woman whose success is the fuel for the fire of Bette's vengefulness. Without Adeline's presence and influence, Bette's envy is pointless. But what else could one expect from screenwriters this illiterate? Next, Siefert and Tarr erased the most fascinating character of the original novel, that of Valerie Marneffe, the middle-class civil servant's wife who is the cause of all of the novel's misfortunes. Valerie was a far more fascinating character than her cinematic replacement, the actress and whore Jenny Cadine. Madame Marneffe's hypocrisy--the truth of her whore's heart disguised by the outward appearance of a virtuous wife--and the complications of her avarice and passion, provided a large part of the entertainment and insight of the novel. Again, Siefert and Tarr have avoided the difficulty of bringing such a multifaceted character to life, simply by cutting her out altogether. Jenny Cadine seems to live for nothing more than a few bouquets of flowers and a pretty dress or two. Not a fraction as compelling. So the characters do not live up to the source material. Neither does the plot, which turns Balzac's masterfully arranged actions and reactions topsy-turvy. Here and there, one may see bits of the original novel struggling to break through--as in Bette's rage when she is told that Wenceslas Steinbock, whom she adores, has secretly entered into a romance with her niece Hortense--but those glimpses are more tragic than anything else, for exposing the greatness that this movie fails miserably to approach. With a series of seemingly natural and inevitable turns of fortune and struggles to escape ruin, Balzac presented a wholly organic portrait of absolute devastation. Siefert and Tarr hope merely to titillate viewers with an exposed female buttock or breast here and there, some pretty costumes and settings, and a few melodramatic situations forced and laughable. Balzac needed no duels to depict rivalry and hatred; he needed no accidental husband-shootings to bring the full force of marital discord home; he needed no sudden descents into madness to prove the ruinousness of deluded obsession. No one hurled dishes to shatter against walls in the novel. No wives were arrested, no sons had to escape from money-lenders promising to \"kill your wife and your child\" when debts were not paid. Those soap-opera devices weren't necessary in the original novel, because the story itself far surpassed them. But Siefert and Tarr need them merely to dress up an utter narrative failure. Cousin Bette, the movie, may indeed appeal to some viewers, those who ask for nothing but sub-The Young and the Restless melodrama dressed up in period costumes. For those of us hoping for a bit more than that--perhaps simply a semi-faithful adaptation of one of the greatest works of the Western canon--it is simply best to stay away. I certainly should have.",
         "A somewhat sanitised version of the Balzac classic which departs disappointingly from the original story. Jessica Lang is far too pretty a version of the downtrodden, wizened old hag Bette of the original and so conveys none of her deviousness in the many schemes to avenge herself against her condescending relatives. Missing completely from the film is arch-whore Valerie, a central character of the book's plot, who dies a grim death from a disfiguring tropical disease at the conclusion, thus removing an important moral message of the tale. Most of Balzac's other works viz. Madame Bovary, contain one of these. That said, costumes and furniture are fairly faultless which shows Hollywood has at least tried to do justice to a great book.",
         "Cousin Bette is a very good 1840's period peice (as I am not a fan usually of period peices)where yes a miscast Jessica Lange who is strikingly beautiful at the age of 48 when she filmed this movie plays a spinster who has a family of backstabbers who treat her barely above the servants in attitude and her character taking advantage of certain situtions that come to light that help her reverse her finacinal and living arrangement woes.I don't like to give spoilers as this movie is a fun \" Black Comedy\" and to give away too much detail spoils this film for people who haven't had the experince of watching it. Jessica Lange is great as Cousin Bette yet an older uglier actress would've played the role more convincingly. But in that day and age if you were as old as Ms Lange character was an unmarried then you were doomed for love as her character portrays, so I guess really she isn't that miscast. Elisabeth Shue finally has done another good movie since Leaving Las Vegas and actually can hold a note suprisingly. Young actor Aden Young who was just awesome in his first film role in the movie Black Robe is equally as good here as the artist who Cousin Bette loves and upon being rejected by the boy who is young to enough to be her son then discards and uses to get ahead and gain revenge on her uncaring family members. Bob Hoskins is quite funny in this film role as is Hugh Laurie as the family father who loves Ms Shue's character Jenny Cadine the courtesan enough to flounder the family fortune. Really great black comedy.**** out of *****",
         "---spoilers--- I haven't read the book as I never could get on with Balzac - those movie or TV adaptations I've seen were always interesting but didn't touch my heart. So I can't comment on whether this movie seems faithful to the book. I found the movie is very good and very well acted. I was readily able to admire Cousin Bette who has been treated disgracefully over her life one way and another, lost the first man she loved to another woman and later loses another man to his daughter.... and eventually loses patience with being taken advantage of. I could also happily despise the nasty young Germanm sculptor she so unwisely falls for, what an arrogant irritating twerp. Being English I'm used to Hugh Laurie being only a comedian and it was interesting to see him in a more serious part as the family's patriach. But I'm mystified by one aspect of the story. Toby Stephens is cast as a son of the family, Victorin, and the only one with a brain in his head and one feels for his frustration as the rest of his family behave like idiots. Is he intended to be priggish? Hardly surprising since without him managing the estate and the shockingly large loans that're all keeping them going and his father so determinedly squanders on a showgirl and general stupidity, they'd all have been in the poorhouse long ago. Yet when it comes to retribution time, why is Victorin forced to flee with his family so as to avoid being murdered by one of the lenders calling in the money whilst no-one else suffers or does someone pay off the debts? If the theme is Bette's retribution, what on earth has she got against Victorin? And if the theme is wider than her personal retribution, it's not exactly clear. Perhaps there is an explanation in the book that was omittied from the movie, or the theme is that Victorin must suffer because he doesn't stop his father's excesses. But at least it seems he escapes to build a new, safer life with his family, whilst the rest of them suffer far worse. As people who live to excess and get themselves into trouble are colourful but also can be considerable bores, I would have liked to hear more about the financial aspects and seen Victorin used more in the movie. But what happens to the extensive debts? At the end we see Bette living in the great house but what do they live on? Perhaps the book explains this, I certainly hope so. I'd have given 8 stars but for those two quibbles."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Fox Searchlight Pictures"],
      "summaries": ["Cousin Bette is a poor and lonely seamstress, who, after the death of her prominent and wealthy sister, tries to ingratiate herself into lives of her brother-in-law, Baron Hulot, and her niece, Hortense Hulot. Failing to do so, she instead finds solace and company in a handsome young sculptor she saves from starvation. But the aspiring artist soon finds love in the arms of another woman, Hortense, leaving Bette a bitter spinster. Bette plots to take revenge on the family who turned her away and stole her only love. With the help of famed courtesan Jenny Cadine she slowly destroys the lives of those who have scorned her."],
      "budget": 0
   },
   "movielensId": 1896,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-12",
      "dvdReleaseDate": "1998-12-22",
      "directors": ["Des McAnuff"],
      "runtime": 108,
      "movieId": 1896,
      "title": "Cousin Bette",
      "mpaa": "R",
      "actors": [
         "Jessica Lange",
         "Elisabeth Shue",
         "Bob Hoskins",
         "Hugh Laurie",
         "Kelly Macdonald",
         "Toby Stephens"
      ],
      "imdbMovieId": "0118894",
      "originalTitle": "Cousin Bette",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["i4HHW9DCzGw"],
      "plotSummary": "Cousin Bette is a poor and lonely seamstress, who, after the death of her prominent and wealthy sister, tries to ingratiate herself into lives of her brother-in-law, Baron Hulot, and her niece, Hortense Hulot. Failing to do so, she instead finds solace and company in a handsome young sculptor she saves from starvation. But the aspiring artist soon finds love in the arms of another woman, Hortense, leaving Bette a bitter spinster. Bette plots to take revenge on the family who turned her away and stole her only love. With the help of famed courtesan Jenny Cadine she slowly destroys the lives of those who have scorned her. Written by CherylC894@aol.com",
      "tmdbMovieId": 50043,
      "avgRating": 3.10274,
      "releaseYear": "1998",
      "numRatings": 292,
      "posterPath": "/rkuPUrB4PM6Ob9IvniEpNDO5hvJ.jpg"
   }
}