{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119494",
      "video": false,
      "title": "The Land Girls",
      "recommendations": [],
      "backdrop_path": "/qDN0yCJbBz6CmPyXQkVfHKY5CGo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stella",
               "gender": 1,
               "credit_id": "52fe47019251416c7508ad85",
               "name": "Catherine McCormack",
               "profile_path": "/a8Jszh3rHQ2T4u1VyE4lXrb0uDI.jpg",
               "id": 2462,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ag (Agapanthus)",
               "gender": 1,
               "credit_id": "52fe47019251416c7508ad89",
               "name": "Rachel Weisz",
               "profile_path": "/3QbFXeiUzXUVUrJ7fdiCn7A7ReW.jpg",
               "id": 3293,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Prue (Prudence)",
               "gender": 1,
               "credit_id": "52fe47019251416c7508ad8d",
               "name": "Anna Friel",
               "profile_path": "/ccSUerm8OyftugbfsVdrrKKbBrv.jpg",
               "id": 58016,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "53bd05f9c3a3684cf4000ef7",
               "name": "Steven Mackintosh",
               "profile_path": "/3TQVLNfMiiBAcoaCbmWckxXqagN.jpg",
               "id": 978,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Philip",
               "gender": 2,
               "credit_id": "52fe47019251416c7508ad91",
               "name": "Paul Bettany",
               "profile_path": "/1zmr8C7TCqsoCjDVKJycVp2wWyf.jpg",
               "id": 6162,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Agricultural Officer",
               "gender": 2,
               "credit_id": "5a013742c3a368071100f00d",
               "name": "Nicholas Le Prevost",
               "profile_path": "/gks9jDWbngfFqshHBsmBt7MlWEG.jpg",
               "id": 183785,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Janet",
               "gender": 1,
               "credit_id": "5a0137d8c3a36806f600e4f7",
               "name": "Lucy Akhurst",
               "profile_path": "/nspbFmslDstBFTWhco5BeQOpS6b.jpg",
               "id": 130391,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "District Commissioner",
               "gender": 1,
               "credit_id": "5a013755c3a36806f600e40e",
               "name": "Celia Bannerman",
               "profile_path": null,
               "id": 310469,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Mr. John Lawrence",
               "gender": 2,
               "credit_id": "5a0137fe925141570800e890",
               "name": "Tom Georgeson",
               "profile_path": "/90IirxcNYdJANlTW1i782SGnCkn.jpg",
               "id": 8947,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mrs. John Lawrence",
               "gender": 0,
               "credit_id": "5a0137ce925141574500e840",
               "name": "Maureen O'Brien",
               "profile_path": null,
               "id": 1212179,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Philip's Mother",
               "gender": 1,
               "credit_id": "5a01378ec3a36806f600e471",
               "name": "Ann Bell",
               "profile_path": "/mszRmPOkjQXSP7IpKAPXlUleqSK.jpg",
               "id": 106995,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "Gerald",
               "gender": 2,
               "credit_id": "5a013798925141572e00e49d",
               "name": "Nigel Planer",
               "profile_path": "/uAmUbKmCVa233CEUcJQenyvknBe.jpg",
               "id": 117555,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Desmond",
               "gender": 0,
               "credit_id": "5a0137eb925141571800eb61",
               "name": "Michael Mantas",
               "profile_path": null,
               "id": 1229271,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47019251416c7508ad81",
               "name": "David Leland",
               "profile_path": null,
               "id": 33317,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a01382d925141575000e951",
               "name": "Angela Huth",
               "profile_path": null,
               "id": 35837,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.850587,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 17044,
      "vote_count": 4,
      "budget": 0,
      "overview": "During World War II, the organisation \"The Women's Land Army\" recruited women to work on British farms while the men were off to war. Three such \"land girls\" of different social backgrounds - quiet Stella, young hairdresser Prue, and Cambridge graduate Ag - become best friends in spite of their different backgrounds.",
      "similar": [],
      "original_title": "The Land Girls",
      "runtime": 111,
      "poster_path": "/xRfq92wLifGawMvFf6BPCHoL457.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Intermedia Films",
            "id": 763,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Greenpoint Films",
            "id": 12918,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-25",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The story of three young women and the events that would change their lives... The friendships that would stay with them forever... and the loves that would change their hearts.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Leland"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Angela Huth",
         "Keith Dewhurst"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119494/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAzNjkzOTgwODleQTJeQWpwZ15BbWU3MDk3NzE2MTE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Catherine McCormack, Rachel Weisz, Anna Friel | See full cast and crew »"],
      "reviews": [
         "Another very good example of an understated British flick being elevated by a strong cast into something worth notice. In a refreshing take on the WWII drama, the focus is on the ones who stayed behind in the war-torn south of England, like the farmers to feed the impoverished nation; the women to keep the factories running and, as in \"The Land Girls\", to work the land in place of the absent men. Stephen Mackintosh, my favourite underrated Brit actor, gives the film's best performance as Joe, the farmer's son who wishes he was anywhere but home, but he's well supported by Catherine McCormack, Rachel Weisz and Anna Friel as the unfeasibly but mercifully smouldering girls of the Women's Land Army. Tom Georgeson brings gruff character as Mr Lawrence, the farmer, and check out an early Paul Bettany appearance. Thousands of women found a new freedom in work during the War, but they were expected to return to their domestic, invisible lives once the men returned. \"The Land Girls\" is not cinema verité; and doesn't pretend to tackle the grimness my mother talks of in England in the 40s and 50s. But who cares? \u0096 when I want grim I'll watch a documentary; I'll settle back happily any day to watch fine actors in a quiet, 'little' film with gorgeous Dorset scenery (it really is that beautiful, visit if you can) and a tender story. It will be too slow, too uneventful, for some. Perhaps they'd have preferred a blowsy Hollywood version, where Antonio Banderas plays the farmer's son and Renee Zellwegger the upper crust beauty (hooray for the ghost of a UK film industry). But I found it gentle and charming just as it was; and when the ingredients are so fine to begin with, that's good enough for me. If you like this sort of thing I recommend Powell & Pressburger's magical \"Canterbury Tale\".",
         "This is a beautiful film which received, rather unfairly, little critical acclaim when it was first released. Since then though, it has been praised highly by producers Tom Hanks and Steven Spielberg who have since worked alongside the Director, David Leland, since it was released. As well as being an intimate portrait of three very different young women, it also captures spectacularly the beautiful scenery of the English countryside. The plot is not too difficult to follow: Three young women (Stella, Ag and Pru, played by Catherine McCormack, Rachel Weisz and Anna Friel) from the towns are sent to the countryside to work on the farms (as part of the Women's Land Army), wherein all three at one point become involved with the young and handsome Joe (played by Steven Mackintosh). The storyline is not too difficult to follow, and the film easily rewards the viewer. This film may be hard to come by in some areas, but do not worry if you have difficulty getting hold of it, as it is likely to remain relevant and enjoyable for many years to come -- a hidden gem and undoubted classic of English film-making.",
         "Land Girls is about a British program during World War II that trained women from all over the country to work on farms while the men were at war. Stella, Ag and Prue are three young women from different areas and different classes who go to work on an old farm in south-coastal England. But this isn't a \"fish out of water\" kind of film - the women adjust reasonably quickly and become part of the family. There is a the crotchety farmer, helpful farmer's wife and good looking son who plans to join the RAF. The war feels generally a bit remote - the young women can see bombing from a hilltop, but aren't in the middle of the fighting. The movie focuses on Stella, who's engaged to a young man at a nearby naval station. Prue is the somewhat adventurous hair stylist-turned-cow milker, and Ag is a university student off to help her country. Strongly recommended for folks who enjoy realistic settings and anything about World War II home life.",
         "Stella (Catherine McCormack), Prue (Anna Friel) and Ag (Rachel Weisz) play three \"land girls\", volunteers to carry on the agricultural work of the men. On the farm they find love, conflict, friendship and cows. The film is more of a relationship drama of those left behind than an account of the second world war. That said it is an interesting piece - not only is it different to have a WW2 film from a British point-of-view but also from a woman's point of view. It is interesting to see how those left behind acted with their lives and their war efforts - how close to the truth this account is, anyone's guess, it's a bit unrealistic because so many girl's experiences are crammed into the story of these three. The story is good regardless with the tangled relationships creating the glut of the plot, however the many tangled love stories do get a bit much at times but the themes of love, loss and British spirit during wartime tend to make up for it. The performance from the lead trio are mixed, Weisz is a bit stereotyped as an upper-class woman (\"rotter\", \"jolly good\" etc) but gets better as her character develops. Friel is good as Prue who starts as the roughest of the group but is touched by the events in her life. McCormack (Stella) is meant to be the core of the story with her interactions with the farmers, especially the son Joe (Steven Mackintosh), but she plays it a little over earnest for my liking. Mackintosh has the most complex role and carries it off very well with the best performance in the film. The film's conclusion is a mix of neat, tidy endings and some more emotional moments that more realistically depict the damage that the conflict caused on the people left behind. Overall the film is not amazing but is an interesting account of WW2 from a different point of view, some of the events are a little stereotyped and lack a realistic feel but generally the film carries the emotions that many will have experienced at the time.",
         "Whenver I think of women on the home-front during WWII, I picture them in factories taking the place of the men who went to fight. I never really thought that someone had to keep the farms going to feed the people. Over 30,000 women left the cities in England to form the Land Army and milk the cows and plow the fields while the boys were gone off to fight the Germans. Having said that, this was basically a Lifetime movie with a couple of laughs. The funniest part was when Ag (Rachel Weisz) decided to lose her virginity. It was good for a story about the effects of the war on peoples lives, especially their love lives, but there just wasn't a lot there. Besides Weisz, there was Catherine McCormack (28 Weeks Later) and Anna Friel, who had a bigger WWII role in The War Bride. Of course, we also have to mention Lucy Akhurst, who was a zombie in Shaun of the Dead. Recommended for Lifetime fans.",
         "I must compare LAND GIRLS (1998)with the newly-released (2001) ENIGMA both of which I saw this evening. The more recent film is utterly cliche-ridden (Tom Stoppard, the screenwriter, even throws in a bit borrowed from John Buchan's 39 STEPS!) while David Leland's movie continues to surprise the viewer to the last frame. The horror,the restraint, the mood of Britain at war come through careful period reconstruction. Reality is heightened so that the dazzlingly photographed British countryside continually reminds us of the dark shadow of War which hangs over these young lives. The acting is uniformly good and many of the cast come from the British stage to deliver real truth-of-performance. Unlike ENIGMA'S characters you believe the Land Girls and the people around them.",
         "I first saw this movie on cable with my significant other, and though I usually dread this type of film, I found myself drawn to the simple yet enjoyable plot. The love story between Stella and Joe was well done; slow, almost arduous, yet it seemed never to lag, and I felt very attached this movie and its cast. It's just one of those movies that really isn't much to look at or think about, but leaves you with an extremely -- well -- pleasant feeling. Casting was brilliant, and some of the cinematography took great advantage of the beautiful English countryside.",
         "We've seen this kind of story countless times in BBC imports or Danielle Steel novels. There's nothing new about the plot or the characters: saucy working class girl, sensible\"head girl\" type, and sensitive British lass with eyes for the equally sensitive farmhand. The plot isn't executed in a novel fashion, either, and we can see the rather abrupt ending coming miles away. Still, the leads are quite attractive, with Anna Friel, Catherine McCormack, and Rachel Weisz as the three main land girls of the title and Stephen Mackintosh as the sensitive Dorset lad. Enough so to make it worth a rent on a weekend when all the new releases are checked out!",
         "I found the movie to be a well-acted warm, personal story of three women and the English farming family that they work for as members of the Ladies' Land Army during World War II. However, at times it makes chronological leaps without much warning and it may take a few minutes to figure out exactly what has happened and what the new season is or how much time has elapsed. It was a very interesting insight into a period of England and the life-circumstances of the country in early World War II. At times though, I had a difficult time distinguishing the subtle English accents and found myself backing up to attempt to re-hear what had been said. Sometimes I still couldn't make sense of the accent, and I'm not referring to the usual colloquial British terms that are at times foreign to Americans, although the movie is full of those as well, which adds a very quaint touch. All in all, it was a sort of feel-good movie that possibly could have had a little more punch in the ending. I was left with the feeling that it was a nice experience emotionally and educationally, but which falls a bit short of some movies of the genre, more so probably because of the production.",
         "Being English might have had something to do with it, but I loved this film. All the acting was outstanding and the multitude of little comic moments had me laughing much more than other 'comedies' that we get from hollywood. Although the central theme of the plot - an unlikely love affair - was a little unbelievable and forced, the gentle pace and quaint bizarre moments, and the refreshing setting made this a view again movie. Weiss character was a little ott at first but she played it beautifully with a surprising comic ability. As for the unintelligible accents, well I suggest that the American market which struggles to understand anything not US formulaic mass media, grows up."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Intermedia Films",
         "Channel Four Films",
         "Greenpoint Films"
      ],
      "summaries": [
         "During World War II, the organisation \"The Women's Land Army\" recruited women to work on British farms while the men were off to war. Three such \"land girls\" of different social backgrounds - quiet Stella, young hairdresser Prue, and Cambridge graduate Ag - become best friends in spite of their different backgrounds.",
         "It is England in 1941 in the glorious Dorset countryside. Three beautiful young women, Stella, Ag and Prue, arrive on a remote farm. They are the 'Land Girls' - city girls who have volunteered to take the place of young men who have gone to war. They are an unlikely trio: Prue is vivacious and sexy; Ag is quiet and more reserved; while the dreamy, beautiful Stella is in love with Philip, a dashing naval officer. Despite their differences, they soon become close friends. The film follows their relationships with each other and the men in their lives in the face of war.",
         "Three young women from very different walks of life join the women's land army during World War II and are sent to work together on a farm in Dorset and the experience changes their lives forever."
      ],
      "budget": 0
   },
   "movielensId": 1898,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-25",
      "dvdReleaseDate": "2001-09-10",
      "directors": ["David Leland"],
      "runtime": 111,
      "movieId": 1898,
      "title": "The Land Girls",
      "mpaa": "",
      "actors": [
         "Catherine McCormack",
         "Rachel Weisz",
         "Anna Friel",
         "Steven Mackintosh",
         "Paul Bettany",
         "Nicholas Le Prevost",
         "Lucy Akhurst",
         "Celia Bannerman",
         "Tom Georgeson",
         "Maureen O'Brien",
         "Ann Bell",
         "Nigel Planer",
         "Michael Mantas"
      ],
      "imdbMovieId": "0119494",
      "originalTitle": "The Land Girls",
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "During World War II, the organisation \"The Women's Land Army\" recruited women to work on British farms while the men were off to war. Three such \"land girls\" of different social backgrounds - quiet Stella, young hairdresser Prue, and Cambridge graduate Ag - become best friends in spite of their different backgrounds.",
      "tmdbMovieId": 17044,
      "avgRating": 3.22868,
      "releaseYear": "1998",
      "numRatings": 129,
      "posterPath": "/xRfq92wLifGawMvFf6BPCHoL457.jpg"
   }
}