{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "egypt",
            "id": 1160
         },
         {
            "name": "napoleon",
            "id": 4381
         },
         {
            "name": "leopard",
            "id": 4478
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0125980",
      "video": false,
      "title": "Passion in the Desert",
      "recommendations": [],
      "backdrop_path": "/9UUpskbtPCDUcfChiyekWJEmD7a.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Augustin Robert",
               "gender": 0,
               "credit_id": "52fe463ec3a368484e085fa3",
               "name": "Ben Daniels",
               "profile_path": "/x6MI4Fdz1XbERbNbXYoxTK6NAgv.jpg",
               "id": 27632,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jean-Michel Venture de Paradis",
               "gender": 2,
               "credit_id": "52fe463ec3a368484e085fa7",
               "name": "Michel Piccoli",
               "profile_path": "/gz91b4tVn6yYsKemek2YkUdjlSH.jpg",
               "id": 3784,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe463ec3a368484e085fad",
               "name": "Lavinia Currier",
               "profile_path": null,
               "id": 1205453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe463ec3a368484e085fb3",
               "name": "Honoré de Balzac",
               "profile_path": null,
               "id": 25349,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe463ec3a368484e085fb9",
               "name": "Lavinia Currier",
               "profile_path": null,
               "id": 1205453,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 0.84212,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 60951,
      "vote_count": 6,
      "budget": 0,
      "overview": "Young French officer Augustin Robert escorts artist Jean-Michel Venture de Paradis to Egypt during Napoleon's Egyptian campaign. Napoleon sent de Paradis to record Egypt's great monuments and temples that are destroyed by French soldiers in acts of barbarism. During combat, Augustin and Jean-Michel are separated from their regiment, and they start wandering through the desert fighting for their life. In one of the canyons Augustin meets a leopard he names Simoom and a strange bond between them appears.",
      "similar": [
         27586,
         858,
         112160,
         141,
         634,
         297762,
         394117,
         242224,
         9837,
         258480,
         17130,
         43923,
         3981,
         437557,
         8967,
         8810,
         9762,
         6637,
         2288,
         12162
      ],
      "original_title": "Passion in the Desert",
      "runtime": 91,
      "poster_path": "/xD5LNTEYxcyZaSdSWBcJLATCOJF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Roland-Film",
            "id": 16754,
            "origin_country": ""
         },
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         }
      ],
      "release_date": "1997-08-31",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "What nature divides, the spirit unites.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lavinia Currier"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Honoré de Balzac",
         "Lavinia Currier"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0125980/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzM2MDk3NDIxOV5BMl5BanBnXkFtZTcwMTcwMjYzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Daniels, Michel Piccoli, Paul Meston | See full cast and crew »"],
      "reviews": [
         "Those who distill \"Passion in the Desert\" down to \"a guy falls in love with a leopard\" actually miss the point. The interesting thing about this movie is not its unique and stark setting, or the strange match of its two protagonists, but the way the film manages to paint a metaphorical portrait of love and all the slings and arrows that go with it -- and it does so almost wordlessly. The resulting film is curiously pure, strange, and unforgettable. Even the first act, which is more or less a conventional portrait of two men lost in the desert in Napoleonic times -- has a richness and poignancy (one man, an artist, drinks his paints in thirsty desperation, and the image of his paint-stained lips is haunting). But ultimately this is a movie about love, a sensitively told fable, gorgeously photographed, about a man who is first mysteriously protected by -- and then drawn to -- a wild she-leopard, and of the way the leopard begins to draw him into her world. The movie isn't so much about men vs. leopards (or \"men with leopards!\" tabloid-style -- the movie stops short of portraying the affection between the two in the biblical sense, although there is some ambiguity there) as it is about the nature of love itself. The film paints some fresh, unsettling, and sometimes amusing portraits of the things people do when they're in love -- all the way down to the spitefulness and jealousy that come into play when that love is threatened. By the end of the film, the story has become almost Shakespearean in its depth and richness as the plot plays out to its haunting end. At this point, the roles have almost reversed -- the man has become wild and catlike, and the she-leopard seems strikingly human and thoughtful in her expressions and her actions. The film is the first I've ever seen which actually raises some uncomfortable and ultimately fascinating questions about the possibility of a human falling in love with an animal -- and it explores these questions gracefully and without sensationalism. All in all, \"Passion in the Desert\" was an exquisite film that really moved me -- the performances, both human and animal, are breathtaking and frankly amazed me, and the cinematography and music are glorious. (Too bad there aren't animal Oscars -- the she-leopard in this film really gives an incredible performance.) Bottom Line: If you're looking for something off the beaten path (no pun intended), this film's a keeper.",
         "My opinions do not flow with the majority in most cases. I tend to lean toward the artsy, imaginative, and different. This movie was reminiscent of Frances Ford's \"The Black Stallion\" wherein a fantasy situation is created to showcase the beauty of a magnificent creature who's not readily available to view performing at its peak except on these multitudes of documentaries ala natural. Unlike those nature films, this offering utilizes the finest movie making techniques the industry has to offer fit for a diva creating one of the most sensual super stars (the cat) on the screen. This fantasy depicting the love relationship that develops between a french soldier (he is very nice too) lost on the Egyptian desert and a female leopard he encounters when he chances upon an abandoned Egyptian temple is mesmerizing. I bought into it wholeheartedly. If you are the least bit open to fantasy and appreciate the grace, beauty, power and sensuality of the feline, you should enjoy it. The only flaw in my book was the ending. It was a perfect set up for a Romeo and Juliet finale - that would have taken me over the top.",
         "I remember reading the original Balzac story in college French. I remember Ken Nordine of WGN-TV in Chicago reading it as one of his late night shows. Always loved the story but never believe they could or would make a movie of it. To my surprise they did and did it VERY well. Few of any Balzac stories lend themselves to dramatization, which is unfortunate, and -cat lover that I am, I was always hoping it WOULD be filmed without a lot of Hollywood sexing up. This is as close to perfect conversion as could be done. The theater of the mind is always better than what the eye can see, but this is as close as I think it can come to letting the imagination of reading meet the reality of seeing.",
         "I recently stumbled across a TV showing of \"Passion....\" (having missed the opening scenes). Ms Currier in to be praised for having the vision and courage to bring such a strange de Balzac tale to the screen. I am grateful to the entire cast and crew for their parts in producing such a thoroughly fine motion picture. It must have been arduous shooting so many scenes in the desert. And I cannot comprehend how her trainer coaxed such a fine \"performance\" from the leopard, Simoon. (This adverture calls to mind another suspenseful adventure, \"Naked Prey\"). Why isn't this film more well-known?. Hope I can find it on video.",
         "This movie is beautiful in all ways. It is visually stunning, and this is a good thing since the dialogue would only take up a page or two of paper. The acting is superb; it is subtle, passionate and intense. Ben Daniels does a fabulous job of turning himself into an animal, and mixing that wild nature with a man's overbearing passion and honor. There is not one flaw, not one mistake or wrong moment to be found anywhere. It is completely perfect, but only if you understand what you're going to experience. It isn't a movie for anyone who wants normality.",
         "Passion In The Desert exemplifies spatial grander. It is a visual narrative, illuminated by the magnificent cinematography. Passion was filmed on location in the deserts of Jordan, Egypt, Morocco, Namibia, and Tunisia. We are in Egypt, 1798. Augustin, a Napoleanic soldier, is escorting writer and artist Jean-Michel Venture De Paradis on an official mission to document, measure, draw, and paint the cultural landmarks of the Egypt: its dunes, stupendous ruins, and mysterious people. But, can you truly \"document\" majestic sandscapes, fractured edifices, and wild Bedouins? Can you truly capture the essence of Egypt, nature, man, and time? Jean and Augustin become lost in the mesmerizing glittering, gold desert, whose vastness overwhelms their senses. \"You can't get lost in Egypt! There's the Nile, and there's the sea!\", says the dehydrated Augustin, and soon he discovers an ancient, winding cave that leads to a palatial ruin. Delirious and near-delusional, he attempts to rest; a perplexing sound rouses him; his eyes, body, and emotions become hypnotically locked in time as he stumbles into a sensual, sensory experience.... A wild, sleek female leopard stares back at him, and their love affair begins.... A daring love affair, a daring film.",
         "\"Passion in the Desert\" (1998): Adapted from Balzac's novel, filmed on the AMAZING landscapes of Jordan, scored by Jose Nieto, filmed by Alexei Rodionov, and directed by Lavinia Currier, this is one seriously interesting, highly symbolic film. Napolean's soldiers are trying to cross the Sahara, with typical chauvinism to their imperial viewpoints. When two men become lost, all the old habits and rules are turned to cinders under the hot sun. THEN things get interesting\u0085 and not as linear or predictable as you will probably expect. Ben Daniels stars as the soldier whose spirit moves through many changes. DO think symbolically for this story. THAT is where the worthwhile meanings are found.",
         "An excellent story well told by the film maker. The interactions between the man and the leopard brought many questions to the viewers mind about just who was being humane. The humans killed for no reason the animals only to survive. At the end of the movie you were left wondering just who the real \"hero\" of the movie was. A well told story. The human actor did an excellent job but the leopard stole every scene it was in.",
         "This was a very strange film- I guess dehydration on the desert can cause someone to go slightly insane. Yet the leopard was beautiful and somehow connected with the soldier. There are stories about animals that befriend humans- the most famous is Incident at Hawks Hill by Eckert- where a badger protects a young boy- that is why Passion can be a believable movie. the cinematography is gorgeous and though the acting, not all that good, the leopard makes the story. Independent films like this give the audience a wider view of the filmmaking scene and this is a unique story set in a unique time. Worth a glance.",
         "A film about the relationship between a man and leopard that's very reminiscent of \"The English Patient,\" even down to a scene similar to when Ralph Fiennes' character carries the body of his lover across a desert-rock cliff. In \"A Passion in the Desert,\" the main character carries the body of the leopard across a desert-rock cliff but in the opposite direction (calculated decision or unconscious contrast?). Historically expanded from a very short Balzac story, the film is not perfect but a treat no less. Final shot will haunt me for weeks. (8 of 10)"
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Roland-Film"],
      "summaries": ["Young French officer Augustin Robert escorts artist Jean-Michel Venture de Paradis to Egypt during Napoleon's Egyptian campaign. Napoleon sent de Paradis to record Egypt's great monuments and temples that are destroyed by French soldiers in acts of barbarism. During combat, Augustin and Jean-Michel are separated from their regiment, and they start wandering through the desert fighting for their life. In one of the canyons Augustin meets a leopard he names Simoom and a strange bond between them appears."],
      "budget": 0
   },
   "movielensId": 1899,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-31",
      "dvdReleaseDate": "2005-12-06",
      "directors": ["Lavinia Currier"],
      "runtime": 91,
      "movieId": 1899,
      "title": "Passion in the Desert",
      "mpaa": "PG-13",
      "actors": [
         "Ben Daniels",
         "Michel Piccoli"
      ],
      "imdbMovieId": "0125980",
      "originalTitle": "Passion in the Desert",
      "genres": [
         "Drama",
         "Adventure"
      ],
      "youtubeTrailerIds": ["iM-rs2hB_2Y"],
      "plotSummary": "Young French officer Augustin Robert escorts artist Jean-Michel Venture de Paradis to Egypt during Napoleon's Egyptian campaign. Napoleon sent de Paradis to record Egypt's great monuments and temples that are destroyed by French soldiers in acts of barbarism. During combat, Augustin and Jean-Michel are separated from their regiment, and they start wandering through the desert fighting for their life. In one of the canyons Augustin meets a leopard he names Simoom and a strange bond between them appears.",
      "tmdbMovieId": 60951,
      "avgRating": 2.93939,
      "releaseYear": "1997",
      "numRatings": 99,
      "posterPath": "/xD5LNTEYxcyZaSdSWBcJLATCOJF.jpg"
   }
}