{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "indigenous",
            "id": 1551
         },
         {
            "name": "human animal relationship",
            "id": 2526
         },
         {
            "name": "bat",
            "id": 5155
         }
      ],
      "imdb_id": "tt0112281",
      "video": false,
      "title": "Ace Ventura: When Nature Calls",
      "recommendations": [
         3049,
         1624,
         2123,
         9894,
         8467,
         818,
         854,
         817,
         414,
         7552,
         816,
         9327,
         96,
         9506,
         9493,
         9472,
         9336,
         9739,
         10402,
         9593
      ],
      "backdrop_path": "/zM8D3dSzxISwLilMKzLuzaU3O9j.jpg",
      "revenue": 212385533,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ace Ventura",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af279",
               "name": "Jim Carrey",
               "profile_path": "/5tVf0ow8MX4OwjmVoSa5v7qUDka.jpg",
               "id": 206,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Fulton Greenwall",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af27d",
               "name": "Ian McNeice",
               "profile_path": "/v217qBNPrwNBvcu9F3BVBPE0AwM.jpg",
               "id": 3547,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Vincent Cadby",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af281",
               "name": "Simon Callow",
               "profile_path": "/pOABmGHa7h1CQ1oG4Q6PyuCbwqL.jpg",
               "id": 4001,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ouda",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af285",
               "name": "Maynard Eziashi",
               "profile_path": "/zSxucY5ua1EnrVoKJD97BuqJGvw.jpg",
               "id": 57096,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Burton Quinn",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2c5",
               "name": "Bob Gunton",
               "profile_path": "/b3NfI0IzPYI40eIEtO9O0XQiR8j.jpg",
               "id": 4029,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "The Wachati Princess",
               "gender": 1,
               "credit_id": "52fe44dfc3a36847f80af2c9",
               "name": "Sophie Okonedo",
               "profile_path": "/5Yo3KGum1txRLmt6JZwQ5TYSIsg.jpg",
               "id": 2598,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "The Tiny Warrior",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2cd",
               "name": "Tommy Davidson",
               "profile_path": "/q0f7F4jYfZ5XvcaeBxtbQlfltLX.jpg",
               "id": 88059,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Hitu",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2d1",
               "name": "Adewale Akinnuoye-Agbaje",
               "profile_path": "/lnFcwjgNDNRzQ8yC1HPDIBRBwBh.jpg",
               "id": 31164,
               "order": 7
            },
            {
               "cast_id": 28,
               "character": "Wachootoo Witch Doctor (as Danny D. Daniels)",
               "gender": 2,
               "credit_id": "5ac3bf7f92514126c3037693",
               "name": "Danny Daniels",
               "profile_path": "/knv13MGU8P3moOjEGn1fy6Bmt1Q.jpg",
               "id": 93952,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Wachootoo Chief",
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af2d9",
               "name": "Sam Motoana Phillips",
               "profile_path": "/rJrBTHb3LHFrFo0uydYVhRxKl8c.jpg",
               "id": 1080061,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Wachati Chief",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2dd",
               "name": "Damon Standifer",
               "profile_path": null,
               "id": 172354,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Mick Katie",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2e1",
               "name": "Andrew Steel",
               "profile_path": null,
               "id": 158324,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Gahjii",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2e5",
               "name": "Bruce Spence",
               "profile_path": "/pwJJBmO9MG3OxVX9efGrB6BTFyw.jpg",
               "id": 27752,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Derrick McCane",
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af2e9",
               "name": "Tom Grunke",
               "profile_path": null,
               "id": 171303,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Ashram Monk",
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af2ed",
               "name": "Arsenio 'Sonny' Trinidad",
               "profile_path": "/b3hCkrsQPjTP90OPxWl0XbWhf8j.jpg",
               "id": 1080062,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af28b",
               "name": "Steve Oedekerk",
               "profile_path": "/qUkJ4GbyAdloVjVxCUlxLT23wIe.jpg",
               "id": 4489,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af291",
               "name": "Jack Bernstein",
               "profile_path": null,
               "id": 29901,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af297",
               "name": "Steve Oedekerk",
               "profile_path": "/qUkJ4GbyAdloVjVxCUlxLT23wIe.jpg",
               "id": 4489,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af29d",
               "name": "Gary Barber",
               "profile_path": "/hVdFCnxL2F1wuq7BdgMoxiGBzis.jpg",
               "id": 4507,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af2a3",
               "name": "Bob Israel",
               "profile_path": null,
               "id": 57097,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af2a9",
               "name": "Andrew G. La Marca",
               "profile_path": null,
               "id": 57098,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2af",
               "name": "James G. Robinson",
               "profile_path": null,
               "id": 4700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2b5",
               "name": "Robert Folk",
               "profile_path": null,
               "id": 43393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2bb",
               "name": "Donald E. Thorin",
               "profile_path": null,
               "id": 6490,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af2c1",
               "name": "Malcolm Campbell",
               "profile_path": null,
               "id": 14457,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "565225289251410f190029f1",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 22.328354,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9273,
      "vote_count": 1496,
      "budget": 30000000,
      "overview": "Summoned from an ashram in Tibet, Ace finds himself on a perilous journey into the jungles of Africa to find Shikaka, the missing sacred animal of the friendly Wachati tribe. He must accomplish this before the wedding of the Wachati's Princess to the prince of the warrior Wachootoos. If Ace fails, the result will be a vicious tribal war.",
      "similar": [
         928,
         11430,
         9732,
         10527,
         7350,
         13053,
         2454,
         9325,
         411,
         630,
         927,
         7840,
         254,
         258489,
         284054,
         873,
         1523,
         8587,
         953,
         28178
      ],
      "original_title": "Ace Ventura: When Nature Calls",
      "runtime": 90,
      "poster_path": "/wRlGnJhEzcxBjvWtvbjhDSU1cIY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "O Entertainment",
            "id": 5682,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-11-10",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": "/aPoX8RAxA9J2XW44Ud0AozTUFop.jpg",
         "name": "Ace Ventura Collection",
         "id": 3167,
         "poster_path": "/qCxH543pScFed1CycwJ1nVgrkOc.jpg"
      },
      "tagline": "New animals. New adventures. Same hair.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Oedekerk"],
      "runtime": 90,
      "synopsis": "After failing the rescue attempt of a raccoon in the Himalayas (a parody of the opening to the film Cliffhanger), Ace Ventura undergoes an emotional breakdown and goes on a personal soul-searching quest by becoming a Tibetan monk. He is approached by Fulton Greenwall, a British correspondent working for a provincial consulate in the fictional African country of Nibia. Being that Ace's influence is disruptive to the monastery, the Grand Abbot eagerly gives Ace excuses by which to justify his departure. Greenwall asks Ventura to find a sacred animal called Shikaka, which has become a point of contention. Shikaka, which is a great white bat, is a sacred animal for the Wachati and Wachootoo tribes of Nibia; whenever its name is spoken, the tribesmen must bow. Accompanied by his capuchin monkey, Spike, Ace travels to Africa and returns to his pet detective work. After arriving in Nibia and meeting with the head of the consulate, Vincent Cadby, Ace begins learning about his case as well as the possible suspects. Ace, normally an animal lover, must overcome his fear of bats in order to continue studying the case. He travels to the Wachati tribal village, where he learns that Shikaka is meant as a wedding present from the Wachati Princess, who is set to wed the Wachootoo Prince. If the bat is not returned in time, the Wachootoo will declare war on the Wachati tribe instead. Much of Ace's activity involves eliminating various suspects and enduring the problems of dealing with the Wachati and the Wachootoo, who refer to him as the \"white devil\". This proves difficult, and is made more so by other incidents including attempts to kill him. Reduced to the limit of his ability to solve mysteries, Ace consults the Grand Abbot via astral projection. Advised by the Abbot, Ace finally discovers that Vincent Cadby had taken the bat and hired Ace as a cover for his own crimes. Cadby plans to let the tribes destroy each other and take possession of their land, using the numerous bat caves containing guano to sell as fertilizer. Ace manages to thwart Cadby's plans. However, tribal security chief Hitu is by Cadby's side and sends him to jail, but Ace calls an elephant to escape, and then summons herds of animals, crushing Cadby's house. He tries to shoot Ace with a shotgun, but he is knocked out by Greenwall's fist. After waking up, Cadby manages to escape, with the bat, in a car and Ace chases him in a monster truck. Ace throws the truck's cigarette lighter at Cadby in an attempt to distract him, who finally rams into a tree and the cage with the bat flies away. Ace runs over Cadby's car, while Cadby runs away. Ace, tries to chase him, but when he sees that the sun is rising, he confronts his phobia and dramatically returns the bat to the tribes by running through their battlefield with it clutched in his hands, while screaming its name. Cadby, who was covertly watching, is discovered when Ouda sees him and calls out to alert the nearby warriors that another \"white devil\" is in the area. He is then pursued by both tribes. Meanwhile, Ace accomplishes his mission when he puts (displeased) the bat in his cage. Cadby, who was pursued, ends up lost, out of sight of the tribes. While he was laughing in safety in a tree, he ends up in the hands of an amorous silverback gorilla. The Princess is married to the Prince, who earlier appeared as a champion wrestler sent to challenge Ace's presence in the tribe. Moments later, it is discovered to the tribes' displeasure that the young bride is no longer a virgin, apparently due to Ace's intervention. Both of the tribes promptly pursue Ace, concluding the film.",
      "writers": [
         "Jack Bernstein",
         "Steve Oedekerk"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112281/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzMzODY1ODAzNl5BMl5BanBnXkFtZTYwODEzNjE5._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Jim Carrey, Ian McNeice, Simon Callow | See full cast and crew »"],
      "reviews": [
         "I don't normally respond to these kinds of things, but after reading some of the negative responses I couldn't help myself. There is a movie out there for everyone, something everyone NEEDs to laugh at and who can relate to. This movie is the opidemy of my humor and the extreme way it portrays the upper crust world of stuffy, snobby, self absorbed unrealistic people who think the world revolves around their view and opinions is classic and makes me laugh in a way that is honest for me. I read that some people were offended by it and want to get others to share their view. All I gotta say is, \"If you didn't like the first one, why did you go to see the second one? Just to complain?\" Do all of us \"Friends\" of Jim Carey a favor, if you don't like his humor, just go find some stuffy anal retentive \"fluff\" film, and write reviews on them that we will never read since those movies are for stuck-up self absorbed types. Sorry I just didn't think it fair that these people are \"Flameing\" this as if there are no other possibilities. Thanx for reading.",
         "This movie was directed and written by Steve Oedekerk. Tom Shadyac is not attached to this movie for some reason. But, Steve Oedekerk did a pretty good Job. The movie begins with a spoof from \"Cliffhanger\" where Ace fails to save a Raccoon. Ace retires from being a \"Pet Detective\" until Fulton Greenwall (Ian McNeice) offers him a large amount of money to find a missing sacred Bat. The plot of this movie is not as good as the original. But it's funnier! And a lot of fun. I remember watching this 10 years ago at the theater when it first came out. Frankly, I think there should be one more movie before Ace retires. Jim Carrey is a comedic genius. And he is pure talent. Not even Jerry Lewis can compare to the talent of Jim Carrey.",
         "Is it dumb? Well, it's definitely low-brow, but it also has some gags that are undeniably clever. Is it racist? Yeah, a little, but it's also satirizing old stereotypes about \"Dark Africa.\" Is it immature and and gross and sophomoric and over-the-top? Yes. Yes, it is. But someone (well, me) once said the only thing comedies have to be is funny. And this movie is dang funny. Need I remind anybody of the scene where Ace insists on dropping a slinky down the hundreds of steps leading up to a Buddhist temple? (\"It was RIGHT there!\") Or the slideshow in which Ace's hand appears to greedily devour a poacher's crotch? That's just hilarious! The great thing about this movie is that it doesn't settle for outlandish set-ups that only seem to be jokes. This movie gets full bang for its comedic buck. Do we have a fight with a crocodile presented in-and-of-itself as humor? No! In a lesser film, perhaps. But Ace Ventura goes the extra mile, bringing us childish schoolyard taunts (\"Stop hittin' yourself! Stop hittin yourself!\") And is it enough to have Ace chasing the villain through the jungle in a monster truck? No - he actually pulls up next to him and utters a bon mot worthy of Groucho. Also, where did that monster truck come from?! The sheer resolve not to explain the truck's presence is a sublimely satirical dig at movies that might place monster trucks in the jungle just for cheap, lazy wackiness. This movie is anything but lazy. Jim Carrey, like no actor before him, pulls out all the stops as Ace Ventura. Is he milking things? Oh sure. He's milking things like Paganini milked the violin, or like Michelangelo milked the Sistine Chapel. He's inventing a manic persona so complete and fully realized, that it transcends standard comedy and achieves something mystical and poetic and truthful. And that's how it keeps from being annoying. This film is too casually dismissed because it looks like a terrible movie. I was hesitant to watch it. But maybe, years and years from now, it will achieve the kind of subversive cult-film status it deserves.",
         "Despite most views of this movie, I thought it was just as good as (and in some aspects better than) the original. Of course there was a lot of recycled humor, but there was also a lot of original humor too. I was a little bummed to find out that Courteney Cox wasn't returning in the second installment, but they did just fine without her. I doubt it will happen, but I would love to see an Ace Ventura 3 someday. I thought the scene where Ace is trapped inside the animatronic rhino was the funniest scene in the movie, but the film is filled with other great scenes too. I also loved the fact that he is a lover of all animals, except Bats. I thought that was such a funny idea for the character. I mean, what does that say about bats if a lover of all animals can't even stand them and finds them revolting. Just thinking about it makes me laugh. I just love the irony I guess. Anyhow, there isn't much more I can say about this film other than if you liked \"Pet Detective\", you should see \"When Nature Calls\". \"Bumble-Bee Tuna\", -Chris",
         "I loved this movie ever since in come out in 1995 when i was six years old... I love Jim Carrey am a BIG fan of him...and i think that this was his best performance...he just so funny in this movie... \"It's the mucus that binds us\" still cracks me up today... His other famous saying \"Ok take care now, by bye then\" and \"alrightly\" are classic lines... Its best to see the first movie \"Ace Ventura: Pet Detective\", before you see the second movie so you get the feel of Ace Ventura...the jokes get so much more funnier in the second movie... Just the way Jim acts as Ace is genius...i recommend everyone see this movie...",
         "One of the best and my favorite comedy movies ever! I have watched it at least 7 times and found it funny each time. All those guys saying this part is not as good as the first one, must be out of their sense of humor! This part lives up to its expectations and i found it even funnier than the first part. You might get bored watching the first part 3 or 4 times but not this part! This is a must see film if you haven't seen it already. I own its DVD and keep it very close to my DVD player all the times...never know when i'd like to watch it again :-) I would give it a well deserving 10 out of 10, it cant get any better than this. I really feel sorry for those who didn't find it funny. Please Don't miss it...watch it today!!! Highly recommended!!!!",
         "I didn't think the first movie was any great shakes. Sure, it had Carrey in it, running amok and mugging and mimicking and making every rude sound a kid would learn by eighth grade. But the story just kept getting in the way. That's why \"When Nature Calls\", in my opinion, is much funnier. The story of securing a sacred bat is neither too intrusive nor annoying and leaves room for gags aplenty. And Carrey.... Well, he enters a slapstick marathon and wins the gold in every event. I swear the man is made of rubber. Some of the jokes are pretty gross (the spitting ritual, the \"guano\" references, etc.) but why should that come as any surprise? Most comedies gear for that kind of humor anymore and, more or less sophisticated, reach the same common denominator: body fluids is funny, dude. Still, without the fluids and functions, there are still great scenes (Ace's entrance in the dining hall, the monks' reaction to his departure, his behavior at the slide show, his driving habits, his escape from a mechanical rhino) and plenty of opportunities to see Hollywood's most uninhibited comedian use every conceivable part of his body to make us laugh. I laughed. His work is done. When this \"Nature\" calls, answer it. Nine stars. And remember: do not pass go, do not collect $200.",
         "When you hear a really hilarious joke the normal logical reaction would most likely be that you burst into hysterical laughter. Later on when someone tells you the very same joke again something is already different. You don't laugh to it anymore, you just give it a little weary yawn and say: \"I've heard that one before\". However, there are refreshing exceptions. \"Ace Ventura: When nature calls\" is one of them because if the joke is good enough and someone can still tell it properly it can be just as funny even though you've heard it once before. This sequel isn't better than the original but unlike some other IMDb-users I feel that it really isn't much worse either. If you loved \"Ace Ventura: Pet detective\" I see no sensible reason why you shouldn't love this one as well. Best thing about \"Ace Ventura: When nature calls\" is the fact that our beloved pet detective has moved right from urban city surroundings deep into the exotic African locations. It would've been a really hard job to figure out perfect settings for the third part of this unholy saga so I'm pretty damn glad they never made it (as far as I understand Carrey refused) because these two flicks are so sensationally good comedies it would have been quite a shame to see how the excellent idea wears out after too much use. In the mid-90's when Jim Carrey was just becoming a huge superstar I used to consider him just an annoying and overrated jerk. I simply didn't understand him. I guess it isn't always easy to admit that a guy who talks through his arsehole is one of the most talented comedians of our time but in the end it probably tells more about our time than Mr. Carrey. \"The Truman show\", \"Man on the moon\" and \"The Majestic\" has also proofed that Carrey is more than just a gifted comedian, he's a really believable, charming and impressive actor. Actually I predict that sooner or later when the time is right and he ends up in a right movie he will definitely get his Oscar but it's not coming from something like this that's for sure. Let's face it, if you're not used to Jimmy's humor these movies are not exactly the easiest ones to swallow since the breathtakingly lunatic Ace Ventura is one of the most (if not the most) overdone characters of the whole movie history. But if you give it a try, you may just love it. I can honestly say that I do. This is classic Jim Carrey at his best.",
         "Well, then god help you. I've known people who are not big fans of Jim Carey's style of comedy and I can see their point. He's just outrageous and rarely witty. But this movie has a bit of everything: clever dialogues, beautiful locations, and of course Jim Carey at his very best. I find it much funnier than any of his other works. The Mask had too few of the 'mask' scenes, Pet Detective was just about OK, nothing great. This movie though is better because the story flows freely(unlike P.D) and it has a lot of Jim Carey (unlike The Mask). The scene at the monastery is actually brilliantly shot and to have such OTT comedy at what otherwise seems so mystical a location, I've never seen something like that. And lastly, yes it may seem a bit absurd, it's Ace's love for animals that comes out quite well. To have gone to a seclusion for losing a racoon(he was not paid to find anyways) is both hilarious and heart warming. The rhino scene alone would've made this one of my favorite comedies, but there's so much more on offer. 8/10",
         "Jim Carrey is one of those actors you will find yourself either adoring or hating. He does not ever \"underact.\" This movie made me laugh so hard I cried (even after the fifth time!) From the robot rhino scene to the monopoly guy Jim knows how to be hilarious. I saw the first one (liked it allot) and have to say this one is way better! I am a huge fan of Carrey. I don't think there are many people who can make such a variety of facial expressions. The only reason this is not a ten is because there is (as usual with Carrey) some inappropriate stuff thrown in. But if your love laughing and you love Jim, this movie will fit you \"Like a glove!\""
      ],
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Morgan Creek Productions",
         "O Entertainment"
      ],
      "summaries": [
         "Ace Ventura, emerging from self-imposed exile in a remote Himalayan hideaway, travels to Africa with explorer Fulton Greenwall to find a sacred bat which is told will avert a war between with Wachootoo and Wachati tribes. Of course, when Ace gets involved, all hell breaks loose...",
         "Ace Ventura is back in an all-new adventure. This time an explorer named, Fulton Greenwall, gives him a new case in Africa to find the sacred bat of the Wachati and Wachootoo Tribes. It's up to Ace to find the sacred bat before the two tribes fight a savage war!",
         "Pet detective Ace Ventura comes out of retirement to investigate the disappearance of a rare white bat, the symbol of an African tribe."
      ],
      "budget": 30000000
   },
   "movielensId": 19,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-10",
      "dvdReleaseDate": "1997-10-29",
      "directors": ["Steve Oedekerk"],
      "runtime": 90,
      "movieId": 19,
      "title": "Ace Ventura: When Nature Calls",
      "mpaa": "PG-13",
      "actors": [
         "Jim Carrey",
         "Ian McNeice",
         "Simon Callow",
         "Maynard Eziashi",
         "Bob Gunton",
         "Sophie Okonedo",
         "Tommy Davidson",
         "Adewale Akinnuoye-Agbaje",
         "Danny D. Daniels",
         "Sam Motoana Phillips",
         "Damon Standifer",
         "Andrew Steel",
         "Bruce Spence",
         "Tom Grunke",
         "Arsenio 'Sonny' Trinidad"
      ],
      "imdbMovieId": "0112281",
      "originalTitle": "Ace Ventura: When Nature Calls",
      "genres": [
         "Crime",
         "Comedy",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "DfqPjRMsRP0",
         "YG28rBUkgf8"
      ],
      "plotSummary": "Summoned from an ashram in Tibet, Ace finds himself on a perilous journey into the jungles of Africa to find Shikaka, the missing sacred animal of the friendly Wachati tribe. He must accomplish this before the wedding of the Wachati's Princess to the prince of the warrior Wachootoos. If Ace fails, the result will be a vicious tribal war.",
      "tmdbMovieId": 9273,
      "avgRating": 2.63854,
      "releaseYear": "1995",
      "numRatings": 24658,
      "posterPath": "/wRlGnJhEzcxBjvWtvbjhDSU1cIY.jpg"
   }
}