{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0150290",
      "video": false,
      "title": "Dear Jesse",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57dd7111925141784f0003d5",
               "name": "Tim Kirkman",
               "profile_path": null,
               "id": 931795,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5835d4f39251416d2201a103",
               "name": "Tim Kirkman",
               "profile_path": null,
               "id": 931795,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.001353,
      "production_countries": [],
      "id": 416437,
      "vote_count": 0,
      "budget": 0,
      "overview": "In 1996, at age 30, native son Tim Kirkman returns to North Carolina to explore the parallels and differences between himself and Jesse Helms: they're from the same town and college, with media interests, from families blessed by adoptions, Baptists by upbringing.",
      "similar": [],
      "original_title": "Dear Jesse",
      "runtime": 82,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-10-10",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Tim Kirkman"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Tim Kirkman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0150290/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2NjU3MTE1NV5BMl5BanBnXkFtZTcwOTcyNzc3MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Nathan A. Barbour, Karen Brown, Patsy Clarke | See full cast and crew »"],
      "reviews": [
         "I did not expect filmmaker Tim Kirkman to reveal as much of himself as he did and I loved the part with his old friends \"dishing\" on him. Believe me, this film could have been A LOT angrier in tone. I'm sure Kirkman did everything within his power to hold back what he really thinks of Helms. The result is one compelling doc. And as for the end, well, that speaks for itself. One question that sprang to my mind: To all these people who believe being gay does not warrant any rights because it is a lifestyle choice, what is a religion if not a lifestyle choice???",
         "This is a touching documentary about a young man who lives in New York City but grew up in North Carolina. He addresses his narrative in the film to Jesse Helms, the overtly and unabasedly homophobic Senator from North Carolina. The narrator revisits many places where he grew up and interviews friends and family asking about the bigotry that Helms openly displays. The narrator discovers that many people in his home state share his views of Helms. Realizing this, the narrator feels that he is no longer alienated from his birth state. He makes an interesting point about the North Carolina motto which states that what is true is more important than what merely seems true. He then applies this motto to the condition of bigotry masquerading as civility. One of the most touching aspects of the film is the \"PS\" at the end. This film is a must for anyone trying to teach real family values and tolerance in America. I was touched and moved by the experience.",
         "Like many people, I know who Jesse Helms is... and I basically despise the man, but coming from Canada I did not really have an idea of what it must be like to grow up in a State that kept his man in the Senate for decades. This documentary is not just about homophobia...that exists more or less everywhere - but it is also a glimpse into the \"religious\" and racist South - where the film-maker comes from and where he went back in order to make this documentary. What strikes me most in this film, mainly - but not only made up of talking heads - is the erudition of the people he interviews. Most of them are talking off the top of their heads, but they nevertheless come across as deep and extremely eloquent. I especially liked the first black girl to go to a white school in the film-maker's town; she reads a poem that she wrote as a student - supposedly for the first black to become a mayor (if I remember rightly) but in fact it is an amazing cry from the heart against Jesse Helms. Wonderful stuff! Many of the other people interviewed were as eloquent, and it was often very touching. Or occasionally more revealing than expected.. One of the best moments is when a Republican supporter of Jesse Helms is asked to explain what it is about Jesse that makes him like the Senator. The man is obviously so used to \"knee-jerk\" reactions that he is almost incapable of making a sentence... he is totally flummoxed by the question and struggles to find something to say. In his long silences, there is more eloquence than the man intended about what kinds of people vote for Jesse! The film-maker himself is also very eloquent, especially in the beginning and ending of his film. He talks about himself openly and simply, but to great effect. This documentary would be an excellent tool for teachers in schools to use to start discussions about so many topics. If it were made obligatory viewing for everyone, Senators like Helms might just not continue to get elected."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["North Carolina Film Foundation"],
      "summaries": ["Can you go home again? What if you're a gay man and home is a state where voters keep electing a homophobe to the US Senate? In 1996, at age 30, native son Tim Kirkman returns to North Carolina to explore the parallels and differences between himself and Jesse Helms: they're from the same town and college, with media interests, from families blessed by adoptions, Baptists by upbringing. Tim puts his camera in front of his family, a boyhood pal, college friends, his pastor, Helms fans, community activists, novelists Lee Smith and Allan Gurganus, a mayor who's gay, and people in the street, including a brief interview with Matthew Shepard. What is it to judge, and what is it to love?"],
      "budget": 0
   },
   "movielensId": 1901,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-10-10",
      "dvdReleaseDate": "2007-10-30",
      "directors": ["Tim Kirkman"],
      "runtime": 82,
      "movieId": 1901,
      "title": "Dear Jesse",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0150290",
      "originalTitle": "Dear Jesse",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1996, at age 30, native son Tim Kirkman returns to North Carolina to explore the parallels and differences between himself and Jesse Helms: they're from the same town and college, with media interests, from families blessed by adoptions, Baptists by upbringing.",
      "tmdbMovieId": 416437,
      "avgRating": 3.21333,
      "releaseYear": "1998",
      "numRatings": 75,
      "posterPath": null
   }
}