{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0126938",
      "video": false,
      "title": "Hav Plenty",
      "recommendations": [],
      "backdrop_path": "/jJUcj3AsuyoVl88xigmc3v6gR94.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Lee Plenty",
               "gender": 2,
               "credit_id": "52fe480ec3a36847f81561df",
               "name": "Christopher Scott Cherot",
               "profile_path": null,
               "id": 93133,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Havilland Savage",
               "gender": 1,
               "credit_id": "52fe480ec3a36847f81561e3",
               "name": "Chenoa Maxwell",
               "profile_path": "/acb4N0oPOisoQWXdtskc1o45o3r.jpg",
               "id": 93129,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Caroline Gooden",
               "gender": 1,
               "credit_id": "52fe480ec3a36847f81561e7",
               "name": "Tammi Katherine Jones",
               "profile_path": null,
               "id": 932191,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Leigh Darling",
               "gender": 1,
               "credit_id": "52fe480ec3a36847f81561eb",
               "name": "Robinne Lee",
               "profile_path": "/zKW4GUdUoifxkp6vK1EOBV3y89O.jpg",
               "id": 55258,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Felix Darling",
               "gender": 2,
               "credit_id": "52fe480ec3a36847f81561ef",
               "name": "Reginald James",
               "profile_path": "/55hfCdOE8iqWoZt1DXHZrdbd4wq.jpg",
               "id": 932198,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Bobby Montgomery",
               "gender": 0,
               "credit_id": "52fe480ec3a36847f81561f3",
               "name": "Kim Harris",
               "profile_path": null,
               "id": 175594,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Grandma Moore",
               "gender": 1,
               "credit_id": "52fe480ec3a36847f81561f7",
               "name": "Betty Vaughn",
               "profile_path": null,
               "id": 932200,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Alexandria Beaumont",
               "gender": 0,
               "credit_id": "52fe480ec3a36847f81561fb",
               "name": "Margie St. Juste",
               "profile_path": null,
               "id": 932201,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Mr. Savage",
               "gender": 0,
               "credit_id": "52fe480ec3a36847f81561ff",
               "name": "Chuck Baron",
               "profile_path": null,
               "id": 932202,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Michael Simmons",
               "gender": 2,
               "credit_id": "52fe480ec3a36847f8156203",
               "name": "Hill Harper",
               "profile_path": "/6Dz2mV1Jdfnv0789JTFY8G08ju2.jpg",
               "id": 57686,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe480ec3a36847f81561a5",
               "name": "Christopher Scott Cherot",
               "profile_path": null,
               "id": 93133,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe480ec3a36847f81561ab",
               "name": "Christopher Scott Cherot",
               "profile_path": null,
               "id": 93133,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe480ec3a36847f81561b1",
               "name": "Christopher Scott Cherot",
               "profile_path": null,
               "id": 93133,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe480ec3a36847f81561b7",
               "name": "S.J. Cherot",
               "profile_path": null,
               "id": 932172,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe480ec3a36847f81561bd",
               "name": "Bridget D. Davis",
               "profile_path": null,
               "id": 932173,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe480ec3a36847f81561c3",
               "name": "Tracey Edmonds",
               "profile_path": null,
               "id": 62162,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe480ec3a36847f81561d5",
               "name": "Kerwin DeVonish",
               "profile_path": null,
               "id": 932181,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe480ec3a36847f81561db",
               "name": "Max Biscoe",
               "profile_path": null,
               "id": 932187,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5571681ac3a36838730013f6",
               "name": "Wendy Melvoin",
               "profile_path": "/jPX8ihpolVXBJDd3E07gESUE1Ta.jpg",
               "id": 34061,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5571683d9251416d0800133d",
               "name": "Lisa Coleman",
               "profile_path": "/d0vJQRsaOROcVWuRW8f5FPGRK7v.jpg",
               "id": 34060,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.330746,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 51955,
      "vote_count": 2,
      "budget": 0,
      "overview": "Lee Plenty is an almost broke would-be novelist and Havilland Savage is rich and very beautiful woman and his friend. When she invites him to her home for New Year's Eve, they start to build up a romance.",
      "similar": [],
      "original_title": "Hav Plenty",
      "runtime": 92,
      "poster_path": "/dTOlAcEjMLZ2dCMGv2OfEpofeVa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-09-11",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christopher Scott Cherot"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Christopher Scott Cherot"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0126938/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTA0MzIzODU2OV5BMl5BanBnXkFtZTcwMjc4OTcxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Scott Cherot, Chenoa Maxwell, Tammi Katherine Jones | See full cast and crew »"],
      "reviews": [
         "Lee Plenty is house sitting for his friend Hav Savage. The pair have a frosty relationship but also have slight crushes on each other. When Hav invites Lee down to her parent's house in Washington for New Years eve he travels down but finds himself involved in the lives of all the women under that roof. Every time he tries to leave something comes up. The plot of this film is a little vague to say the least \u0096 it is really based on real life so the rambling story can be excused. It even has a story within a story and finishes with a point that's hard to understand in context of the true story context. However that's not to say that it is without charm, despite not moving in one clear direction it is quite nice. The relationships between all the main characters are quite witty and involving \u0096 making the story good despite it's weakness. The cats are generally good. I felt that Cherot did well as a writer and director but as an actor his performance wasn't good enough to carry the film. His mugging is quite irritating at times and makes it hard to believe that anyone would fall for his `charms'. In fairness he's not terrible but someone else could have done it better. Maxwell is frosty, sexy and vulnerable all at the same time and is really good in an initially unlikable character. Similarly her sister Leigh (played by Lee) is cute and does well with a complex role. The cameos in the movie within the movie are also quality but only really for laughs \u0096 Nia Long, Lauryn Hill, Mekhi Phiffer and TLC's Chilli. Overall this struggles from a narrative that lacks direction and a lead star who maybe thinks he's funnier than he is. But the overall film is witty and charming, the cast are young and sexy and interesting and it's nice to see a black comedy that doesn't have the terrible Master P in it!",
         "I was very pleasantly surprised by this low budget comedy. The story centres around a homeless writer, Lee Plenty (Christopher Scott Cherot - who did everything on this movie to prove his up-coming talent) who joins a friend and her family for New Year, and the trials and tribulations which befall him during his stay. These trials mainly involve getting into various unwanted and unplanned situations with several women. The movie tells a story of love through modern day class barriers and the will Lee Plenty had to achieve his aim (publishing a book). As it turned out everything that happened to him gave him all the material he needed. I found the film light and easy to watch, although not so much the romantic comedy which it was advertised as. The entertainment was in wondering what was going to happen to Lee next to prevent him leaving as he was constantly planning. I must admit though that the ending was pretty predictable. I'm looking forward to what Cherot will treat us to next.",
         "I saw Hav Plenty when it was first released back in 1997 and i still feel about it today the same as i did when i left out of the theater back in '97. I left the theater feeling uplifted about love. And not only was this a very likable little love story, but it was an incredible character study on how opposites can come to attract and how best friends may sometimes make the best lovers. The performances were flawed at times but what the film lacked in the strongest of performances it more than made up for by the overall chemistry of characters and the general likability of them as well. It's a good love story. It certainly didn't reinvent the wheel but it certainly is worth a viewing.",
         "I truly enjoyed the movie \"Hav Plenty\". It was very refreshing to see a romantic and well-written Black love story, which is so rare these days. The cast were all outstanding actors for a low budget movie. The movie was very realistic and it made you feel that you could truly relate. I especially loved Christopher Scott Cherot's role. Although Ms. Havelin was playing \"hard-to-get\", I loved the way Mr. Plenty stood his grounds and did not give in. My daughter turned me on to this movie and now every time I learned that it is airing I watch it religiously. I surely hope that Mr. Cherot will be bringing us more movies and especially with him as a character. I fall more in love with him each time I see the movie. I plan to purchase it and add it to my collection of all-time favorites.",
         "remember when you would hear a song & try to claim it before anyone else saying \"that's my jam\"? well \"this my movie\". not too many people know of this one which in a strange way is a good thing. we don't want it to be spoiled by mainstream biters. i myself just happened to stumble across this one when doing the typical back and forth at the blockbuster a few years back. i saw the cover and it looked appealing - let's see, a romantic comedy without meg ryan? black peeps who are professionals with upper mobility? a story that's actually not about the stereotypical thug? it's an original, creative story made by very talented actors, producers, and music biggies. soundtrack is on-point, characters are likable, even the cameos are well-chosen! overall it's a funny feel-good flick smoothed out on the r&b tip wit a pop appeal, appeal, to it.",
         "Chris Cherot's first feature is an indication of good things to come. While lacking what most independent films lack--namely money--Cherot manages to offer a witty and somewhat unconventional look at romance and the often ambiguous values of the Black middle class. You will inevitably want to see this film again. With each viewing you will notice another nuance of the intense passion between the unassuming Lee Plenty (Christopher Cherot) and the pretentious Havilland Savage (Chenoa Maxwell). You will find yourself refreshed by this film's honesty, good humor, and the ultimate triumph of true love.",
         "I saw Hav Plenty on cable one night. I thought the movie was good. The characters were interesting and Lee was a very likable person to me. He had an off-wit charm yet caring demeanor that I could see different types of women falling for. I appreciated the fact the movie was different and introduced more middle-class African-Americans, which are often neglected. The plot was a bit fuzzy and had the makings of a first time director but overall entertaining.",
         "This movie is so compelling. I am mesmerized by it to the degree that almost every time it airs I watch it. This felt familiar and realistic. Low budget but sparkling with charm and wit. I enjoyed the characters and the pacing especially. It was like eating an Eskimo pie on a summer's day when you have absolutely nothing to do but enjoy it!",
         "While it is not a perfect 10 on my scale it is high up on my list. I really like this story and is a good story. I don't know why there are all these bad commands like this movie is Gigi or Camp Fever. Those of some terrible movies, like on a negative side, really really bad. This actually a good movie and here we have people who just hated it. If I hated a movie that much i don't watch more than 20 minutes of the movie. I love that it showed for once that the woman can mess a good thing up and its not always the man. It gets on my nerves that everything are so one sided sometimes. I liked the one year later thing because if they had gotten together at the end of what happen it would have been too cheesy. Chris i loved your movie and much love my brotha.",
         "I didn't get a chance to see this movie when it came out but when I saw it I was really impressed. The movie had class and it was refreshing to see normal black folk. As a film maker my self I thought the guy did an excellent job for the money. It just proves you can do a quality film without a bunch of stars. But where is Chebot, I am waiting for his next project."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Edmonds Entertainment Group (EEG)",
         "Wanderlust Pictures Inc.",
         "e2 Filmworks"
      ],
      "summaries": ["Lee Plenty is an almost broke would-be novelist and Havilland Savage is rich and very beautiful woman and his friend. When she invites him to her home for New Year's Eve, they start to build up a romance."],
      "budget": 650000
   },
   "movielensId": 1903,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-11",
      "dvdReleaseDate": "2002-02-12",
      "directors": ["Christopher Scott Cherot"],
      "runtime": 92,
      "movieId": 1903,
      "title": "Hav Plenty",
      "mpaa": "",
      "actors": [
         "Christopher Scott Cherot",
         "Chenoa Maxwell",
         "Tammi Katherine Jones",
         "Robinne Lee",
         "Reginald James",
         "Kim Harris",
         "Betty Vaughn",
         "Margie St. Juste",
         "Chuck Baron",
         "Hill Harper"
      ],
      "imdbMovieId": "0126938",
      "originalTitle": "Hav Plenty",
      "genres": [
         "Action",
         "Comedy",
         "Romance",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Bp7av9COM2k"],
      "plotSummary": "Lee Plenty is an almost broke would-be novelist and Havilland Savage is rich and very beautiful woman and his friend. When she invites him to her home for New Year's Eve, they start to build up a romance.",
      "tmdbMovieId": 51955,
      "avgRating": 2.87681,
      "releaseYear": "1997",
      "numRatings": 69,
      "posterPath": "/dTOlAcEjMLZ2dCMGv2OfEpofeVa.jpg"
   }
}