{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "fame",
            "id": 10232
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "drugs",
            "id": 14964
         }
      ],
      "imdb_id": "tt0122529",
      "video": false,
      "title": "Henry Fool",
      "recommendations": [
         23522,
         24200,
         38545,
         25355,
         95361,
         67683,
         47802,
         102873,
         52322,
         198902,
         47161,
         42199,
         63978,
         198802,
         49577,
         133008,
         33297,
         197366,
         42724,
         24488
      ],
      "backdrop_path": "/aN0K5b2ShIlWXBkKDEcfYTlbLB8.jpg",
      "revenue": 1334786,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Henry Fool",
               "gender": 2,
               "credit_id": "52fe46459251416c9104efb5",
               "name": "Thomas Jay Ryan",
               "profile_path": "/9GA0YdSBRoJC19kDGwF8jYuKsOx.jpg",
               "id": 130840,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Simon Grim",
               "gender": 2,
               "credit_id": "52fe46459251416c9104efb9",
               "name": "James Urbaniak",
               "profile_path": "/13cOcBh08yfhJQGvrnZ6ZteWfzw.jpg",
               "id": 58528,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Fay Grim",
               "gender": 1,
               "credit_id": "52fe46459251416c9104efbd",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mary",
               "gender": 0,
               "credit_id": "52fe46459251416c9104efc1",
               "name": "Maria Porter",
               "profile_path": null,
               "id": 189458,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mr. Deng",
               "gender": 2,
               "credit_id": "52fe46459251416c9104efc5",
               "name": "James Saito",
               "profile_path": "/vrZz8dPmYLK25F910luCvYMwEnW.jpg",
               "id": 77155,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Warren",
               "gender": 2,
               "credit_id": "52fe46459251416c9104efc9",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ned",
               "gender": 2,
               "credit_id": "52fe46459251416c9104efcd",
               "name": "Liam Aiken",
               "profile_path": "/cKCBZEIRWPSeDkWXJWihPga6vKY.jpg",
               "id": 19977,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Amy",
               "gender": 0,
               "credit_id": "55fba434c3a36826e50015bc",
               "name": "Diana Ruppe",
               "profile_path": null,
               "id": 1511375,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Laura",
               "gender": 1,
               "credit_id": "55fba440c3a36826e50015c3",
               "name": "Veanne Cox",
               "profile_path": "/7fxVktlpPBAEWImceQB9wTPb90H.jpg",
               "id": 26719,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Pearl - Age 14",
               "gender": 1,
               "credit_id": "55fba44d9251410359000660",
               "name": "Christy Carlson Romano",
               "profile_path": "/3qtwgZBEqGRej10SkNW5AtgA6Ye.jpg",
               "id": 76241,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Angus James",
               "gender": 2,
               "credit_id": "55fba45f9251413d5f001617",
               "name": "Chuck Montgomery",
               "profile_path": null,
               "id": 171574,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Girl in Library #1",
               "gender": 0,
               "credit_id": "55fba4799251413d5f00161b",
               "name": "Karen DiConcetto",
               "profile_path": null,
               "id": 71819,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Girl in Library #3",
               "gender": 1,
               "credit_id": "55fba4869251413d5c001594",
               "name": "Rachel Miner",
               "profile_path": "/j5BnD83LvDyQwJNzU4EOzv8sluk.jpg",
               "id": 54126,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Lawyer",
               "gender": 1,
               "credit_id": "55fba495c3a36826df001846",
               "name": "Fay Ann Lee",
               "profile_path": null,
               "id": 171744,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Teenager at World of Donuts",
               "gender": 0,
               "credit_id": "55fba4a0c3a36826f50014d8",
               "name": "Vivian Bang",
               "profile_path": "/jkNJ9oJfcvWQDzHK2QUAoxyw6gS.jpg",
               "id": 1212270,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Teenager at World of Donuts",
               "gender": 0,
               "credit_id": "55fba4b49251413d56001528",
               "name": "Toy Connor",
               "profile_path": null,
               "id": 1213541,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Gnoc Deng",
               "gender": 0,
               "credit_id": "564580b2c3a36870dd00854f",
               "name": "Miho Nikaido",
               "profile_path": null,
               "id": 189721,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Steve",
               "gender": 2,
               "credit_id": "58920712c3a368096a008937",
               "name": "Paul Boocock",
               "profile_path": null,
               "id": 1231352,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46459251416c9104efab",
               "name": "Hal Hartley",
               "profile_path": "/iDOwoscPZqn8VUEoxawerZRBXJd.jpg",
               "id": 91343,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46459251416c9104efb1",
               "name": "Hal Hartley",
               "profile_path": "/iDOwoscPZqn8VUEoxawerZRBXJd.jpg",
               "id": 91343,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.098979,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37410,
      "vote_count": 33,
      "budget": 0,
      "overview": "An egocentric bum transforms the lives of a shy New Jersey garbageman and his sister.",
      "similar": [
         4771,
         979,
         429733,
         8012,
         15069,
         26390,
         15762,
         12150,
         4638,
         8363,
         1949,
         275,
         281,
         281957,
         339692,
         445954,
         133805,
         2142,
         15912,
         21484
      ],
      "original_title": "Henry Fool",
      "runtime": 137,
      "poster_path": "/qo9xAVG0obbFQAIlDCpoL7plhpz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "True Fiction Pictures",
            "id": 37909,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shooting Gallery",
            "id": 1596,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-07",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/8k7CTsbyL9usdSph3iHIwzC6iQ8.jpg",
         "name": "Henry Fool Collection",
         "id": 378453,
         "poster_path": "/bMtc0hvfRwPuSBAamumTMU0zOv3.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hal Hartley"],
      "runtime": 137,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0122529/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNzM3OTg4MF5BMl5BanBnXkFtZTYwODY4MzI5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Thomas Jay Ryan, James Urbaniak, Parker Posey | See full cast and crew »"],
      "reviews": [
         "Its not that its groundbreaking in the way it tells its story, or that its story is that unusual - its tricky to put your finger on which element makes Henry Fool so unique, but as a whole the work is very unique indeed. If i had to give you a reason why this felt so new to me, was that i'd never seen a movie entirely devoted to literature before, the power of poetry in particular. I found it quite refreshing. Hartley has gone for an atmosphere of strangeness, a kind of artificiality which still rings true, and it works completely. Henry Fool (the character whose nature this movie is an investigation into, which takes the narrative form of his walking into the lives of a low-class suburban family, especially disaffected garbage-man and potential poet Simon) talks and behaves like what he imagines himself, which is the roguish hero of some tragic, romantic Shakespeare play, and a kind of difficult genius. But is he a genius for real? Is this \"confession\" he's writing, his life's work, a masterwork, or a piece of sh*t? Henry affects the lives of a small group of great characters in Simon's local neighbourhood, all drawn with marvellously light brushstrokes, and all seeming like imagined, literary beings, yet still very human. But is he a good influence or a bad influence on this neighbourhood? I can't predict whether you'll like Henry Fool or not - all i can tell you is that i found it captivating and original to the last.",
         "If Hal Hartley were never to make another film, he could easily go down as having created a genuine American Masterpiece with \"Henry Fool.\" Hartley takes this material and stamps it with heart and soul and distance. It's like staring at a palette of beautiful colors - then stepping back to realize it's a bruise. Henry is never less than this astonishing. As Henry,Thomas Jay Ryan gives what is easily the best film debut I've seen in many years. None of the wimpy whispery-voiced drivel that passes for acting these days (from even some of our best screen actors) his performance practically pops off of the screen like a fart at a funeral. The rest of the cast - James Urbaniak, Parker Posey, Maria Porter, Kevin Corrigan, et al. - are on the same inspired level, but it's obvious why the film is named after Henry. I cannot wait to see this man in more. Obviously allegorical, \"Henry Fool\" fairly teems with its laundry list of symbolism both quaint and profound, easy and impossible. I found my cheeks hurting from the smile stretching across my face for much of the film. Other moments had my eyes welling with tears at the beauty \u0096 and pain \u0096 these oh, so deceptively simple lives toil through. This is not, obviously, a film for all audiences, there is something of the fairy tale here and while suspension of disbelief is required, it is also its own reward. Actually the characters, though larger than life, are so evenly and wondrously drawn as to become recognizable to all of us as ourselves or others in our own lives. Here we weigh out the seemingly unfair advantages we perceive \"others\" has having, the pronouncements of self-worth and desire for acceptance and understanding. Hartley's dialogue is equal to the visual aspects of his film: almost stagey (in the good sense), but with a direct honesty that many, unfortunately, will find offputting. His cast delivers these perfectly placed pronouncements with all the gravitas demanded of the situation - and sound natural doing so. It's a beautiful film to listen to. Aside from the brilliant storytelling, \"Henry\" is also beautiful to look at. Hartley's cameramen lens a Queenscape most unusual \u0096 one never quite feels he knows where it's taking place, despite obvious \"Queens\" clues. Every frame \u0096 from Henry's powerfully bizarre arrival to the last triumphant (and gloriously ambiguous) cell is a pleasure, a joy to watch. At its conclusion all I could say was \"this was the best movie I've ever seen.\" Upon reflection, I realize it probably isn't, but at that moment (and each ensuing viewing) I recapture that same, precise feeling. That's what I want in a movie and Henry delivered.",
         "I rented and watched \"Henry Fool\" last night and spent much of this evening tracking down reviews of this extraordinary film. I'm surprised that none of them invoked Dickens, or at least John Irving. There's a constancy in Hartley films: beautiful photography, disciplined design, and (usually) extraordinarily attractive actors who mouth almost excruciatingly gassy dialogue in a deadpan style that seems to serve as ballast. \"Henry Fool\" is no different. But this film delves so deeply and sympathetically into the Big Issues -- love, obligation, and most of all ART -- that it delivers a wallop that reminds me of how I felt at the end of Irving's \"Owen Meany\". And I mean that as a high compliment. \"Henry Fool\" is imperfect, at moments even ridiculous, but you just might be changed by it. Not bad for a movie.",
         "Proof that famously idiosyncratic filmmaker Hal Hartley can expand the emotional and intellectual range of his often dismayingly bloodless work without compromising the skewed, life on the fringes vision that has built him a cult following. This resonant examination of friendship, fame, cultural trends, and the creative process, stars a garbage man and a mysterious bum. James Urbaniak is the socially challenged trash hauler -Simon Grim who lives with his severely depressed mother and slutty, acerbic sister in a cramped in Queens, N.Y. Thomas Jay Ryan is Henry Fool, the drinking drifter who moves into their basement, claiming to be a writer whose unpublished epic manuscript would shake of the world - if Henry ever allowed it to be published. (In fact he's talent free.) But it's Simon who becomes the literary star. Encouraged by his new friend, the trashman who never wrote before, turns out to be a natural poet, moving (and outraging) the public with the power of his words. The director packs a lot of tender heartache into the Grim household, and he presses his finger firmly on the bruised place in America where celebrity becomes its own curse. (In a great conceit, we never see of hear a word of Simon's masterpiece.) Hartley remains an acquired taste (for views with a lot of time to dine - this sitting runs about two hours and twenty minutes). But with \"Henry Fool\" he offers a lot to chew on.",
         "Hal Hartley is just too smart for most movie-goers. He's got a lot to say--and he actually makes his characters say ALL of it; in tiny, impotent little phrases that never astound so much as when you find yourself understanding something large about them. And Henry Fool is a fount of these emerging insights: one test is not enough to know the heart of a would-be hero, one giant failure is not enough to know the soul of a would-be romantic, love isn't always as deep as it is strong, poetry comes and goes, art is in the understanding... Despite dispensing so many ideas, Henry Fool has amazing comic timing, some high drama, a little sex, death, and even a romantic ending. Not enough comedy, drama, sex, death, and romance for a big box-office turnout; but just enough to make the Hartley fans want more.",
         "It's a shame that \"Henry Fool\" remains relatively overlooked and underrated. In large part because it's such a departure from his earlier films, Hal Hartley purists couldn't stomach the epic scale and thematic shift of the film, and audiences who would likely appreciate the movie never even saw it. In my opinion though, Henry Fool is a true masterpiece of American cinema and one of the best films of the 1990s. If you look at films like \"Trust\", \"Simple Men\" and \"Amateur\" as early, developmental works in Hal Hartley's maturation as a filmmaker, and then see \"Flirt\" as his attempt to identify himself more as a \"director\" than a \"writer\", then \"Henry Fool\" is the fruit of that labor - not only is it precisely, minimalistically and efficiently directed, but it's far and away his best writing yet. His favorite themes are expanded and blown up within a mythic frame, and his casting here of stage actors (especially the hefty presence of Thomas Jay Ryan) separates the film from Hartley's earlier work. However, it retains the philosophical tone, the inner musings of character, and the precision of their actions. This time, however, Hartley accomplishes this by expanding the frame with which he grapples with friendship, family, ambition, achievement and betrayal, and ends up with a shattering parable about who we choose to be in our lives. The film is about greatness, and thanks to Hartley's fearlessness in envisioning his characters' conceptions of greatness, it is truly great. (Where's the DVD version?)",
         "Welcome to Hal Hartley's world of the disenfranchised. The focus here is on Henry Fool (Thomas Jay Ryan), a passionate individual just released from prison after seven years, and one Simon Grimm (James Urbaniak), a simple garbageman with a seemingly apathetic view of the world in which he lives. Henry rents a room in Simon's house (which is occupied as well by his mother and sister) where he continues to work on his `confession,' the memoir he began in prison, which is actually a treatise on life that he believes will one day shake the world to it's very foundation. Expounding his passions to Simon, Henry urges him to cast off the shackles of his dreary existence and to express himself by writing down what he feels in the journal he gives him. Henry becomes the mentor, awakening something within Simon long dormant and as yet unrealized. Simon begins writing poetry, while at the same time we begin to see another side of Henry, a man unable to heed his own advice and whose quest for the life he seeks is too often derailed by his own indecisiveness and uncontrollable lusts. Ultimately, we realize that Henry and Simon are not so different from one another after all. Hartley's style bears a distinct signature, in that when his characters speak it is more than simply dialogue; it is small philosophies delivered in a mannered cadence that is engrossing and at times mesmerizing. The supporting cast includes Parker Posey (Simon's sister), Maria Porter, and one of the finest character actors spawned by independent film in recent years, Kevin Corrigan. In the final analysis, we realize that there is much more to `Henry Fool' than meets the eye. I rate this one 8/10.",
         "If you like a movie that is character driven, you'll love Henry Fool which was written and directed by Hal Hartley. This movie abounds with interesting, quirky characters. The leads, Mr. Ryan, the title character, and Mr. Urbaniak, were terrific. The plot, where the teacher/student or leader/follower is reversed during the course of the story is not unique but is presented well. The other characters, Ms. Posey and Mr. Corrigan, undergo significant development as well. I don't want to give away too much but I will say that this movie involves characters that are not politically correct and bathroom humor (literally). The movie is long but you won't notice it as the movie is rich with dialogue (listen carefully), constantly changing scenes, and as already stated well developed chang ing characters. I've deliberately avoided the plot until now because I was afraid I would say too much, but it involves a drif ter writer (and much more) Henry Fool who encourages a plain introverted garbage man, Simon, to write down his thoughts. The other characters Ms. Posey, Simon's sister, his mother, and Mr. Corrigan, thug patriot(?) are interesting as well. My thanks to all involved for a great afternoon's entertainment. Three plus stars.",
         "I found myself in a bizarre predicament with this film. It was a film that I could easily see myself discussing with a group of friends, and remained thinking about it after seeing it. However, I got no enjoyment out of it. From an intellectual point of view there were plenty of topics worthy of discussing, such as the worth of the mass view of your work and what constitutes art versus pornography but the problem for me was the presentation of these ideas. For me, the supposed hero of the story did nothing of his own accord and was led around by the ear of the title character doing exactly what he said. It's hard to root for him if he really has no stock in what he is doing. As well, the title character Henry Fool is unlikeable, and not just because he has a history of deviance. He practically forces his desire for success on someone who otherwise would not want it. There is no dynamic between the two, just a man and his tool that he uses for his own personal gains. To me, neither was likable and it ruined the chance of me rooting for their successes. Meanwhile, the film as a whole seemed needlessly self referential, occasionally fashioning some blatant point through the main character's work or another character's comment that applies almost directly to the film itself. It makes it feel as if the characters are only ways of forcing the writer's concepts about his own work to come to the open, and it uses them for whatever it wants and lets them pick up the pieces afterward. After all this, however, I think that I would still recommend you watch the film. While I have much bad to say about it, it made me think, and when any film does this, it is worth watching simply because I can easily see how a variety of opinions could be formed about the film. Furthermore, not being a writer I found it difficult to identify with any of the predicaments, which might add a personal touch to those who can. At the least I can appreciate an intelligent man trying to make a film of the topics that feel relevant to him.",
         "It takes a great deal of care for a film to suspend my disbelief and bring me in. Usually, the most important aspect of a film to me are the characters. If I believe the actors and connect with the characters, I get drawn in and become able to care about the story. That is the exact area in which this film failed me. The main drawback was the title character. If people like Henry Fool actually exist, I've never encountered them. People just do not talk like Thomas Jay Ryan did in his part as Henry. Hal Hartley's films are always interesting, always thought-provoking, and always intellectual, but they've never struck me as being believable. I run into the same problems with Kevin Smith's films. The characters always sound like they're reading a script. Arguments always resemble a court case in which the two lawyers always know exactly what the other is about to say and always have an immediate and perfect recital ready to retort. To me, the inescapable result is total transparency for the film. It always sounds like one person arguing with himself over and over again, always working to get across one single point of view. With many independent films, my suspension of disbelief is lost due to poor acting and poor sets, both of which are unavoidable for the lower-budget indie film. The sad part about this film is the acting was good, the sets were well-done, and the story was delivered well. The problems exist in the writing and the poorly-developed characters, a problem that is common when total creative control of the film is in the hands of a single mind."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Shooting Gallery",
         "True Fiction Pictures"
      ],
      "summaries": ["Socially inept garbage man Simon is befriended by Henry Fool, a witty roguish, but talentless novelist. Henry opens a magical world of literature to Simon who turns his hand to writing the 'great American poem'. As Simon begins his controversial ascent to the dizzying heights of Nobel Prize winning poet, Henry sinks to a life of drinking in low-life bars. The two friends fall out and lose touch until Henry's criminal past catches up with him and he needs Simon's help to flee the country."],
      "budget": 0
   },
   "movielensId": 1904,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-07",
      "dvdReleaseDate": "2003-12-16",
      "directors": ["Hal Hartley"],
      "runtime": 137,
      "movieId": 1904,
      "title": "Henry Fool",
      "mpaa": "R",
      "actors": [
         "Thomas Jay Ryan",
         "James Urbaniak",
         "Parker Posey",
         "Maria Porter",
         "James Saito",
         "Kevin Corrigan",
         "Liam Aiken",
         "Diana Ruppe",
         "Veanne Cox",
         "Christy Carlson Romano",
         "Chuck Montgomery",
         "Karen DiConcetto",
         "Rachel Miner",
         "Fay Ann Lee",
         "Vivian Bang",
         "Toy Connor",
         "Miho Nikaido",
         "Paul Boocock"
      ],
      "imdbMovieId": "0122529",
      "originalTitle": "Henry Fool",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["twoF56_e9mU"],
      "plotSummary": "An egocentric bum transforms the lives of a shy New Jersey garbageman and his sister.",
      "tmdbMovieId": 37410,
      "avgRating": 3.5364,
      "releaseYear": "1997",
      "numRatings": 989,
      "posterPath": "/qo9xAVG0obbFQAIlDCpoL7plhpz.jpg"
   }
}