{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "teenage girl",
            "id": 10809
         },
         {
            "name": "montage",
            "id": 33896
         }
      ],
      "imdb_id": "tt0143614",
      "video": false,
      "title": "Marie from the Bay of Angels",
      "recommendations": [],
      "backdrop_path": "/yDiBEk7G88Wjs1CJPpsQsMRxQqu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4735c3a36847f8129245",
               "name": "Vahina Giocante",
               "profile_path": "/qsz2gwpZohPL4i9m0d5uCUY20LW.jpg",
               "id": 56402,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Orso",
               "gender": 0,
               "credit_id": "52fe4735c3a36847f8129249",
               "name": "Frédéric Malgras",
               "profile_path": null,
               "id": 1019052,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Goran",
               "gender": 0,
               "credit_id": "52fe4735c3a36847f812924d",
               "name": "Nicolas Welbers",
               "profile_path": null,
               "id": 1019053,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jeune Femme de la Villa",
               "gender": 1,
               "credit_id": "52fe4735c3a36847f8129251",
               "name": "Amira Casar",
               "profile_path": "/cSKff4J5gT6vMW9EsAwFWwOIHb7.jpg",
               "id": 20577,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mireille",
               "gender": 1,
               "credit_id": "52fe4735c3a36847f8129255",
               "name": "Roxane Mesquida",
               "profile_path": "/A7cXGXQg4waLLtJblAUTDuAVHW9.jpg",
               "id": 7706,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Paule",
               "gender": 1,
               "credit_id": "52fe4735c3a36847f8129259",
               "name": "Brigitte Roüan",
               "profile_path": "/8Sx5XE8NDTBisQ9QHCQapOJ3Jaz.jpg",
               "id": 76904,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4735c3a36847f812923b",
               "name": "Manuel Pradal",
               "profile_path": "/bZukjvaK7VbZ1qgmVsEUzlOqdXC.jpg",
               "id": 4883,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4735c3a36847f8129241",
               "name": "Manuel Pradal",
               "profile_path": "/bZukjvaK7VbZ1qgmVsEUzlOqdXC.jpg",
               "id": 4883,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.95899,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 47481,
      "vote_count": 3,
      "budget": 0,
      "overview": "A random montage of disturbing images tell a story about one summer in the lives of two teenagers who somehow find love within each other, Orso and Marie. After they realize this, they run off to a hidden island off the coast of France where they can not be bothered until Orso's hunger for danger and crime become too much for him, forcing him to return to his normal life...",
      "similar": [
         2926,
         9313,
         283227,
         451945,
         184314,
         6935,
         707,
         9280,
         8195,
         1786,
         16869,
         612,
         10545,
         37710,
         82695,
         59436,
         112160,
         80,
         86331,
         306819
      ],
      "original_title": "Marie Baie des Anges",
      "runtime": 90,
      "poster_path": "/n8oaTHcAA7RFI8ouGDnzbisBYGo.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1998-06-19",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "A story of haunted youth.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Manuel Pradal"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Manuel Pradal"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0143614/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1OTMzMjk3N15BMl5BanBnXkFtZTcwMDQ3NTcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vahina Giocante, Frédéric Malgras, Nicolas Welbers | See full cast and crew »"],
      "reviews": [
         "Manual Pradal said he used 'legendary elements of the Mediterranean' (soccer stadiums, the Grand Prix, the Carnival, American sailors) in this 'stunningly beautiful film,' as Stephen Holden called it when it appeared in 1998. Holden described 'Marie Baie des Anges' as a 'dizzying paganistic ode to Eros, where the camera almost never stops moving.' He and others have pointed out that it's a movie where men in packs seem about to attack, danger comes out of nowhere, scenes on the verge of turning ugly then veer off in another direction. (The danger of carnival may make you think of 'Black Orpheus.') Others have commented that Pradal quotes shamelessly from the French New Wave, and that the classic American sailor types could be right out of Jacques Rivette. They might have mentioned Jean Cocteau, who would have loved the use of motorbikes and cars and recurring threatening figures and swift, dreamlike camera motion, the poetic, operatic plot. They've talked about the timelessness of the story -- it's 1990's, but it could be 1950's. (It's altogether a film out of time, cut off from any period or any taste, and that's one main reason why it's so much misunderstood.) The hedonistic summer lifestyle of the young people, the unspoiled landscapes, and those sailors seem to hark back to some indefinable earlier era. Pradal spoke of employing 'drunken' editing; he cuts back and forth in time with surreal, dreamlike, vertiginous effect. People will always be enchanted by this movie. Others will always dismiss it; not get it. It helps to have grown up in the Fifties (as I did) and to have felt the New Wave as an enchantment and loved the sun baked seasides in the French films of surrounding decades. It also helps to appreciate, as Stephen Holden did, that Pradal's is a French and Mediterranean sensibility -'about as far away as you can get from the icky, coy Hollywood 'primitivism' of 'The Blue Lagoon.' Part of this is that the kids, however attractive, are real kids. They don't lift weights or do aerobics, but they're comfortable with their young bodies. They have the natural grace and style and class of Mediterranean kids at the seashore in the summer. The girl, Marie, is played by Vahina Giocante, then a dancer with the Marseilles Opera. The role of the boy she chooses to run away with, Orso, is played by Frédéric Malgras, a Russian gypsy the director found, as he found most of the young non-actors he used in the movie, among gypsies, at soccer stadiums, in housing projects. (Giocante has been in over half a dozen films since; Malgras, none.) Not only are the young people non-actors; they're also, for a change, as young as they're supposed to be, really 15 or 16 years old. This is a first film. Some find it pretentious, artificial, prurient. I find it classic and beautiful. It never ceases to amaze me how the scenes repeatedly rise to an almost mythic level. There's some of the aching sense of longing you also feel in the opening sequences of Patrice Chéreau's 'L'Homme Blessé (1983),' where Jean-Hugues Anglade achieved a startling, intense debut as the adolescent boy who impulsively runs away from his dreary bourgeois home in breathless search of risky gay sex. There are moments in 'Marie' you would almost swear have come from a film made decades before, except that there was never such a film. There's an edge of tragedy and doomed-ness throughout; there's also an intense physicality, a sense of the beauty of the light, the air, the wind, the water, the natural grace of the young bodies, the danger of sexual risk, thievery: it's all so fresh you can almost taste it. Yes, this is a stunningly beautiful film. The American sailors have a clumsy grace that's classic and evokes old photographs. They're genuine, but somehow dated. They're completely American - their French is authentically makeshift; they're gauche but self-confident. Orso has a brooding, withdrawn quality. His name means bear but he's more like a fox or a greyhound, lean and always running. Marie's a risk-taking temptress, out to defy the rules, to charm men and play with them, to ransom herself for a few hours of pleasure. The young couple's first big summer becomes their idyll and their last fling. All this may sound corny and over-solemn, but it's not when you see it with an open mind. The cinematography and the back-and-forth editing distance and abstract us from emotion and purify the events and turn them into art. 'Marie Baie des Anges' expresses and satisfies a profoundly aesthetic and sensual view of the world as few other movies have ever done. Within its own limited dimensions and brief time span, it's perfect.",
         "Marie Baie Des Anges, is quite simply, a highly under-rated French art picture. It is one of my favorite films, because of Maneul Pradal's unique way of storytelling, using visuals to convey the piece. No, the plot doesn't really go anywhere. In the last 20 minutes or so, it doesn't even make any sense. But that's the whole point. It's symbolic. It isn't going anywhere because the lives of Marie and Orso aren't going anywhere. They are lost, troubled youth; who's only refuge is each other, and a deserted island off the coast of France.",
         "I must confess that I read several reviews of the film before actually seeing it, and despite a mixed greeting I tried to keep my mind open to it. It is a beautiful film. The shots, unlike many of our formula movies, are not centered directly on what can be called a plot. But the quick snaps of seemingly unrelated material when taken as a whole becomes the entire atmosphere of the film and if those quick shots are so beautifully crafted as this then you have created a beautiful piece. I digress, the film itself may be too deep for us Americans. most Americans when they sit down to watch a foreign film expect depth but in our V8 world we sometimes feel entitled to a clearly defined plot and story. \"Whats all this about boats and a party!? What's this got to do with anything??\" I can hear my contemporaries cry to which I can only answer emote don't analyze. I won't compare the film to any others all films are works of art and deserve to be treated as such if you truly wish to recognize them. Marie Baie des Anges, with its haunting interconnectedness or perhaps disconnectedness weaves with beautiful images to create a truly beautiful film.",
         "Two teenagers, male and female, together in an isolated place... Not too original, but if compared to some other preceding movies, there are a lot of differences. \"Friends\", \"Blue Lagoon\", \"Spielen wir Liebe\", \"Paradise\"... all of them come from 70's. \"Marie baie des anges\" is two decades late. Maybe this makes it so unlike its ancestors. How do teenagers appear in those places? In Blue Lagoon they grow up on desert island, in Friends run away from adults, in Paradise from danger, in Maladolescenza they look for secret place but keeping contact with other world. Feelings? Fearing adults, loving each other in Friends, exploring and (self)discovery in Blue Lagoon, bullying and violence in Maladolescenza. Ending? Tragic in Blue Lagoon (acciental) and Maladolescenza (violent), reintegrating in Paradise and Friends. And Marie offers a new combination. Main characters run away rejected by peers (Orso also running from law), feelings are superficial and ending is tragic in the most pointless way. One of the rare binding motifs is teenage sexuality. In Blue Lagoon it is innocent and has to be discovered from nothing, in Paradise it exists and develops, in Friends it is careful because of abuse and slowly grows to real love, while in Maladolescenza appears and increases as one of the bully patterns. In Maria, however, nothing has to be discovered: sex has already been their way of life before they met and sailed into isolation. So, the only movie that shows that teenagers don't need special circumstances to be involved in sex, and admit it is a big part of their life, has been made recently, when it became fashionable to close our eyes and say that teenage sexuality doesn't exist because we don't want to see it. The consequence? Number of teenage pregnancies and STD is a lot bigger now than it was in 70's when movies were more free to show reality (and today most of them are found controversial, on black lists and usually can't be found at all). Of course, it was not a merit of movies that situation was better before, it is a matter of the society. There is one thing that shows Marie was made recently: among these movies it is the only one without nudity (at least teenage characters). Sometimes it is advantage, sometimes limitation. It is hard to believe that two teenagers, obviously practicing sex a lot and living alone on the island, would be fully clothed all the time in the middle of summer. But today it's not easy to show things that were allowed in 70's. On the other hand, great scene of Maria's dance was extremely erotic (and was meant to be) just because of her dress. It could be compared to Dawn Dunlap's dance in Hamilton's Laura, but she was seducing only a camera in her mother's hand so her (very beautifully filmed) dance looked more like gym exercise, while Marie was openly seducing male, older fishermen on the beach. Laura was nude, Marie erotic. Photography is something that all of the mentioned movies rely on. And it doesn't fail. Landscape in Friends is not so attractive, but used very well, and unlike the rest of these movies it has great carefully made indoor scenes. Island in Marie can't be compared to Blue Lagoon, but there is a perfect match between the actors and the surrounding nature. Only Maladolescenza doesn't take place at the sea, and the beautiful landscape emphasizes the dark side of the story. Nature is not perfect enough to change people. Violence and evil from inside destroy the beauty. Both Fabrizio and Orso want to keep everything under their control, but aren't able to do it. Orso maybe thinks he loves Marie while Fabrizio seems to be almost split between childish friendship and violent domination, incapable to share love. However, after causing a tragedy we feel there is a hope for Fabrizio to learn and change in future, while Marie's death becomes a trigger of Orso's final insanity and sinking into crime and madness.",
         "This movie kind of fits into this unofficial French genre which might be called the \"French-jailbait-on-the-beach\" film. This loose genre could include classy Eric Rohmer films like \"Claire's Knee\" and \"Pauline at the Beach\", the good but very depressing female coming-of-age films of Catherine Breillat like \"36 Fillete\" and \"A moi souer\", as well as enjoyable trash like \"L'anne des medusas\" (you could even throw \"Swimming Pool\" in here maybe). This movie is about a homeless teenage French girl who hangs around an American military base as kind of an amateur prostitute (it occurred to me watching this that one reason so many people hate America might be because our military uses the whole world as their whorehouse). She meets up with a psychotic French boy her own age and helps him steal a gun from the base, at which point the plot takes a rather implausible turn into serial murder. This movie is not as sophisticated as a Rohmer film nor is it as squirm-inducingly realistic as a Breillat film. It kind of resembles \"L'annee des medusas\", but where that movie was exploitative trash from the get-go (featuring a somewhat older and very naked Valerie Kaprisky), this movie tries to be a realistic teenage slice-of-life for awhile but goes seriously off the rails with the serial murder plot. Like a lot of French movies it also suffers from a terminal case of pretentiousness. As with other films of its type, however, it does have some great cinematography of the beautiful Baie des Anges (where is that anyway?). These films would all make great advertisements for France's tourism board--if not for all the scary teenage French girls.",
         "The chaos of children running the world is a disturbing and possibly accurate portrayal of these characters' view of the world. Each is stealing, cheating and manipulating to survive, except that they don't know they're not surviving, just wild animals. The American sailors are punks, and it's a crime that they are the closest thing to authority figures in the story. Some characters are just brutal, or maybe a bit flat. Marie is living for the moment, oblivious of her aimlessness. Desperate for love, she knows only sex. Orso, also desperate for love, doesn't know how to get anything without just taking it. Because he equates love with giving things, he returns to his violent nature eventually. Neither of the ill-fated couple are not prepared to succeed. These lead characters are undesirable, but I still loved them with all of their failings. I found the story unsettling and thought provoking. Striking scenery and soulful, well-crafted acting drew me into the film completely. The clear beauty of the land and sea is visually stunning. It makes you want to go and experience it. Marie's gentle, natural beauty and wide eyed innocence (or calm?) are validation of Vahina Giocante as a star. She's the beautiful girl next door, the one you understand and don't understand at the same time, but love to be around. Orso's brooding and watching from a distance absolutely demonstrate Frederic Malgras' understanding of an outcast who finds the one thing he wants most of all. A part of me relates to him. If these two stars have that much range, why aren't they in more films?",
         "Marie is a fourteen year-old who behaves as though she will never reach fifteen, at least without becoming pregnant. Her sultry scowl and nubile body attract all who encounter her, including an American Naval detachment. But her true love turns out to be someone who is more disturbed than her. Orso weaves through the film like a mosquito hovering over a potential meal. The beginning of this film also is the ending, and it's at times difficult to follow the director's flashbacks. The juxtaposition of the race drivers is over-done. We get the idea initially that life for this film is indeed in the fast lane and will never pull over to the right lane. However the performances are fine with Vahina Giocante (Marie) exhibiting (but tastefully) not only a beautiful body, but a talent as well. Frederic Miagra (Orso) plods his way through the film with a brooding appeal, only fleetingly losing his expression of despair.",
         "After seeing this movie, I want to view other French movies. They have a unique style of production that is more visual art than plot. Mixing up the time lines detracted from the story. Some characters didn't fit into the story very well. Marie (Vahina Gioconte) oozed sensuality and moodiness. Without her, the story would have been meaningless. Do young people really live like this? Ignore my spelling errors please.",
         "'Marie Baie des Anges' is a gorgeous and tragic film. It's the story of two young people caught in a drain of circumstances, destined to meet at the bottom. Hope is not to be found anywhere for these two except in each other. It takes sacrificing everything for them to see that. This movie truly touched me. There is rarely a \"happily ever after\" in life, and this film is a sock in the face to those who believe that there is. Disaster follows these two very closely, even at the height of their love. This is one of those movies that sinks in slowly, but sinks in very deep. Halfway through, you'll be bored, and want to shut it off. Don't do it. Watch the entire film (in one sitting), and it will stick with you for the rest of your days. 10/10",
         "Marie Baie Des Anges is an absolutely beautiful film. It's one of a kind. The only other film ever made like it was Harmony Korine's Gummo. It's a montage of disturbing images. Though there really is no plot, the film has somewhat of a story. But when the film is this good who needs a plot? I admit in the last 10 minutes of the film I didn't know what was going on, but that makes it all the more interesting. I highly recommend this film."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "La Sept Cinéma",
         "Lelia Films",
         "Les Films de la Suane"
      ],
      "summaries": [
         "A random montage of disturbing images tell a story about one summer in the lives of two teenagers who somehow find love within each other, Orso and Marie. After they realize this, they run off to a hidden island off the coast of France where they can not be bothered until Orso's hunger for danger and crime become too much for him, forcing him to return to his normal life...",
         "Marie, a young French girl, begins dating a GI soldier when him and other soldiers take shore leave on the coast of France. They spend a considerable amount of time together. Then the soldier dumps her for some reason. Enter Orso, a danger hungry criminal. After unsuccessfully attempting to rape Marie, he instead steals her purse. In the purse are her treasured items. He returns the items. The two fall in love. They escape to a deserted island in the Bay Of Angels. From here, the film descends into a random montage of scenes, which become more disturbing with the progression of time."
      ],
      "budget": 0
   },
   "movielensId": 1905,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-06-19",
      "dvdReleaseDate": null,
      "directors": ["Manuel Pradal"],
      "runtime": 90,
      "movieId": 1905,
      "title": "Marie from the Bay of Angels",
      "mpaa": "R",
      "actors": [
         "Vahina Giocante",
         "Frédéric Malgras",
         "Nicolas Welbers",
         "Amira Casar",
         "Roxane Mesquida",
         "Brigitte Roüan"
      ],
      "imdbMovieId": "0143614",
      "originalTitle": "Marie Baie des Anges",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["J5m-XiUvLgg"],
      "plotSummary": "A random montage of disturbing images tell a story about one summer in the lives of two teenagers who somehow find love within each other, Orso and Marie. After they realize this, they run off to a hidden island off the coast of France where they can not be bothered until Orso's hunger for danger and crime become too much for him, forcing him to return to his normal life...",
      "tmdbMovieId": 47481,
      "avgRating": 2.67347,
      "releaseYear": "1998",
      "numRatings": 49,
      "posterPath": "/n8oaTHcAA7RFI8ouGDnzbisBYGo.jpg"
   }
}