{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "substitute teacher",
            "id": 7101
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0119717",
      "video": false,
      "title": "Mr. Jealousy",
      "recommendations": [
         44389,
         40562,
         82432,
         296643,
         17168,
         58467,
         28387,
         28026,
         54933,
         31083,
         55950,
         97406,
         17364,
         56224,
         15209,
         21950,
         75531,
         35683,
         257407,
         152640
      ],
      "backdrop_path": "/f8jPxVQf2tEU57sQOoLnmWw7FdE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lester Grimm, aka Vince",
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168de9",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Ramona Ray",
               "gender": 1,
               "credit_id": "52fe4879c3a36847f8168df9",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Dashiell Frank",
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168dfd",
               "name": "Chris Eigeman",
               "profile_path": "/4JXp2loLNrssBipfrvnhmXfhcaz.jpg",
               "id": 78190,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Vince, aka Leo",
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168e01",
               "name": "Carlos Jacott",
               "profile_path": "/wzCNencJ1xx9EOEFRrGlJB1twtQ.jpg",
               "id": 52930,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Lucretia",
               "gender": 1,
               "credit_id": "52fe4879c3a36847f8168e05",
               "name": "Marianne Jean-Baptiste",
               "profile_path": "/7C1Ubphw4o1Gv200pAwlgohdxcV.jpg",
               "id": 17352,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dr. Howard Poke",
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168e09",
               "name": "Peter Bogdanovich",
               "profile_path": "/jBmV2Q5htw1TEBABPuCc5BeBn9h.jpg",
               "id": 39012,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Irene",
               "gender": 1,
               "credit_id": "52fe4879c3a36847f8168e0d",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168def",
               "name": "Noah Baumbach",
               "profile_path": "/6PuCDnBLURBnLCuat7BfouH9Gus.jpg",
               "id": 5656,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168df5",
               "name": "Noah Baumbach",
               "profile_path": "/6PuCDnBLURBnLCuat7BfouH9Gus.jpg",
               "id": 5656,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5955028d9251411dbd02f45b",
               "name": "Chris Eigeman",
               "profile_path": "/4JXp2loLNrssBipfrvnhmXfhcaz.jpg",
               "id": 78190,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "595502959251411dbd02f463",
               "name": "Joel Kastelberg",
               "profile_path": null,
               "id": 1034517,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "595502a4c3a3681388052534",
               "name": "Victoria McGarry",
               "profile_path": null,
               "id": 1841194,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "595502aec3a36809c6050aef",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "595502b8c3a36814ae054cf9",
               "name": "Robert Een",
               "profile_path": null,
               "id": 1841195,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "595502e29251412b31051285",
               "name": "Luna",
               "profile_path": null,
               "id": 1742137,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5955031fc3a36813880525d6",
               "name": "Steven Bernstein",
               "profile_path": null,
               "id": 6899,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5955032ac3a36834e503757e",
               "name": "J. Kathleen Gibson",
               "profile_path": null,
               "id": 1483898,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5955033c9251412b310512fd",
               "name": "Todd M. Thaler",
               "profile_path": null,
               "id": 999,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "595503449251411d9802edd0",
               "name": "Anne Stuhler",
               "profile_path": null,
               "id": 1467186,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5955034bc3a3680d73046f6b",
               "name": "Roswell Hamrick",
               "profile_path": null,
               "id": 1467187,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59550352c3a36809c6050bd4",
               "name": "Candis Heiland",
               "profile_path": null,
               "id": 1790082,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5955035e9251411dbd02f54c",
               "name": "Janie Bryant",
               "profile_path": null,
               "id": 1522041,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.383673,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53765,
      "vote_count": 16,
      "budget": 0,
      "overview": "After his first date at age 15 ended with the girl making out with another man at a party, aspiring writer Lester Grimm has treated all his girlfriends with jealousy and suspicion. While dating Ramona Ray, paranoia gets the best of him when he discovers that her most recent ex is successful novelist Dashiell Frank. Lester begins attending the same group therapy sessions as Dashiell to learn about Ramona's past with him.",
      "similar": [
         28468,
         27066,
         3134,
         8810,
         949,
         948,
         298312,
         9093,
         49950,
         1599,
         4638,
         112160,
         329103,
         11564,
         1939,
         50124,
         2142,
         13523,
         1427,
         4771
      ],
      "original_title": "Mr. Jealousy",
      "runtime": 105,
      "poster_path": "/a4pDbwrt528alz21qIHW0sTQDJf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Joel Castleberg Productions",
         "id": 40460,
         "origin_country": ""
      }],
      "release_date": "1997-09-11",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Noah Baumbach"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Noah Baumbach"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119717/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNTg4OTU1M15BMl5BanBnXkFtZTcwODM0NzkxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Eric Stoltz, Annabella Sciorra, Chris Eigeman | See full cast and crew »"],
      "reviews": [
         "MR. JEALOUSY doesn't aspire to greatness; just a small, quirky, romantic comedy. To this end it succeeds. Set in Manhattan, Eric Stoltz plays a young thirty-something wannabe writer earning a living as a substitute teacher. Annabella Sciorra plays his girlfriend, and they are falling in love with one another. Eric's problem is that he is pathologically jealous and is being eaten away by thoughts of one of her earlier lovers who is now a successful writer. So obsessed is Eric that he joins the ex-boyfriend's group therapy session under the guise of his best friend. And far from being irate, the friend begins to dig on this, receiving therapy vicariously through Eric. Of course the whole shebang unravels and...well that's the movie. As far as 'date' movies go, this is better than most and is heartily recommended for the guys when the lady wants this kind of movie brought home.",
         "The downfall of nearly all comedies is that Silliness is so often used as a substitute for humor. In this film, I never felt embarrassed for any of the characters, who were allowed to seem like genuinely real people in the context of a genuinely humorous development. It was also literate, which was nice given the thread of narrative running through the thing. I felt that simply reading the script would have been a nice rainy-day read, but at the same time, the lines were not literarily pompous or turgid. Altogether, this was not a great film---but nicely, nothing happened in it to make it a bad one, either. If you're fed up with variations on same-old-same-old, sit back and just let this film flow over you.",
         "This film caught me by surprise on cable one night, and I went out and rented it again to show my friends. Eric Stoltz and Annabella Sciorra look gorgeous and have a wonderful chemistry together, and Chris Eigeman (from 'Metropolitan' and 'Barcelona') is the perfect Brett Easton Ellis-esque foil. It's rare to find a funny film about romantic jealousy, but this is it. Carlos Jacott just about steals the film with his impersonation of a British gentleman, and the rest of the cast is superb. The cinematography is sumptuous and the music is perfect. A great date movie..",
         "The thing this film has going for it is a great hook - the main plot has such a smart take (SPOiler ****** SPOILER **** SPOILER) ON the whole group therapy scene and how the lead character uses it to keep tabs on an ex-boyfriend of his current girlfriend (who he is very jealous about). Eric Stoltz (who is capable of good work: Mask, Pulp Fiction and lame, sleepwalking work: Killing Zoe, many others) is strong in the title role and gets great support from the rest of the cast especially from Chris Eigeman who gives a three dimensional performance as the successful writer/ex-boyfriend. Smartly written, my only problem with the film is the unfocused, rambling beginning. The movie doesnt really click until the first therapy session - then it just keeps rolling along into uncomfortable, delightful comedy.",
         "Mr. Jealousy while not everyman, is certainly a typical kind of man, especially in today's world of endlessly mixed sexual signals. So convincingly, poignantly, and sympathetically portrayed here by Eric Stoltz, Mr Jealousy hardly allows us to ignore our own (mister's) part in his makeup. We love his humor and sense his pain too. I think it is the wonderful restraint and a great complementary cast that helps bring this home to us. One can fully relax (no squirming, trust me) with the manner and content of this comedy, which makes this film a kind of gem, I think. And the therapy scenes deserve special notice. The opening may be a bit thin, and the ending both thin and forced, but the body is of a different terrain, a bittersweet movie unto itself. (someone think of a better ending!)",
         "For all of you Whit Stillman fans (Metropolitan, Barcelona, and Last Days of Disco) check out this movie as well as Noah's earlier film Kicking and Screaming. The premise of the movie is very good and it lives up to its title. If you hate the kind of movie where everyone spends the whole movie talking to one another then skip this one because there are not any jokes involving people being kicked in their midsection or everyone's favorite bathroom humor. Instead you have an intelligent comedy that will add nothing of value to your life but will hopefully make you laugh as you examine other peoples neurosis. I think that there is chemistry between Stoltz and Sciorra despite what a previous reviewer said. I also think this film is better than Kicking and Screaming.",
         "Lester (Eric Stolz) has a new girlfriend in Ramona (Annabella Sciorra). She is a beautiful lady, with a swell job in a Brooklyn museum, and she is continuing work on a graduate degree at Columbia. Substitute teacher Lester, however, is obsessed with Ramona's past relationships. He was burned by a couple of former girlfriends and fidelity is paramount to him. When Ramona actually gives Lester a book to read, written by a former boyfriend, Lester is stunned. Not long after this, Lester stumbles upon the nouveau-celebrity author at a therapy group. Ah ha! If Lester assumes an alias and becomes part of the group, he has a chance to find out more about Ramona's past and her predilections for loyalty. Yet, even as Lester discovers revelations about his new girlfriend, he may be endangering his own chance of survival with Ramona, by not living in the present alone. Should he continue? This film has an offbeat charm that makes it attractive. The script is thoughtful, clever, and original, daring the viewer to listen closely to every word and idea presented. The actors, in addition to the two stars, are very fine, with Chris Eigeman giving a nice turn as the newly famous author, and Bridget Fonda, Peter Bogdanovich, and others on hand to help out in a big way. The costumes are attractive and the NYC setting always a winner. However, this is not the typical romcom by any means. It has a slower pace and its commitment to dialogue over action makes it a hard sell for the ADD crowd. This said, do catch Mr. Jealousy at your earliest opportunity, if you like to vary your viewing habits. Here is one movie that offers charm and intelligence without losing its own unique identity.",
         "A film about relations; you may think: Oh no not an another one, not a Woody Allen remake. Wrong, this is a screwball comedy like the films with Cary Grant en Katherine Hepburn. Makes group therapy slightly ridiculous. Stoltz is great as the jealous lover, obsessed with the past of his present girlfriend.",
         "I caught this movie on cable one night and about laughed my head off. Needless to say, it's not very well-known and I'm surprised it doesn't have a large cult base--how can this be!?! I don't know anyone who's seen it, besides the friends I've recommended it to. Great quotes, simple unpretentious non-fluffy script, funny take on how far jealousy can get you (or not). Carlos Jacott and John Lehr are ridiculously hilarious. \"It's fun just to follow people sometimes. Anyone.\" I've always loved Chris Eigeman's matter-of-fact, dry tone. Eric Stoltz and Annabella Sciorra have great chemistry and play a persuading couple. It's not your run-of-the-mill Hollywood movie, but it's quite clever. Go rent it if you can find it. Heck, buy it if you can find it.",
         "If you haven't seen this film yet, just wait a few minutes until IFC shows it again. They seem to like it there. And me, I like it too. I find it to be a really smart, romantic and bittersweet film with a lot of funny moments and genuinely good acting. There is a certain pretentiousness, but it is self-effacing. Eigeman, for instance does a turn on his pompous shtick, adding subtle elements that make him a level-9 fop. Stoltz and Sciorra are perfect together. Jacott is hilarious in just about every scene he's in, particularly his wedding vows. I like movies where the central conceit of the movie does not become the entire movie. Jealousy is a theme in Stoltz's character, but it is not all of what drives him, which I guess is why some people have a problem with the title. Similarly, the plot device of invading someone's therapy group would be used as an entire basis for farce in a less subtle director's hands. Here it is merely another hilarious bit of detail off of which branch many smaller truths. For as much as IFC shows this, I can't stop watching it any time I begin."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Joel Castleberg Productions"],
      "summaries": [
         "Lester is an occasional substitute teacher and he's very jealous. He is jealous about the last boyfriend of Lester's slightly wacky current partner Ramona - arrogant best-selling author Dashiell. Lester joins Dashiell's therapy group under an alias to find out if Dashiell still has any feelings for her.",
         "Would be-author Lester Grimm's insecurity is worst in relationships. When he finally has a steady girl, Ramona Ray, but stumbles on a book of her dashing former boyfriend Dashiell 'Dash' Frank and discovers where he's in therapy, pathologically jealous Lester joins Dr. Howard Poke's group, under his mate Vince's name. He thus befriends Dash, but while digging for what he doesn't really want to know strains his friendship and his relationship as things are further complicated."
      ],
      "budget": 0
   },
   "movielensId": 1906,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-11",
      "dvdReleaseDate": "2000-03-07",
      "directors": ["Noah Baumbach"],
      "runtime": 105,
      "movieId": 1906,
      "title": "Mr. Jealousy",
      "mpaa": "R",
      "actors": [
         "Eric Stoltz",
         "Annabella Sciorra",
         "Chris Eigeman",
         "Carlos Jacott",
         "Marianne Jean-Baptiste",
         "Peter Bogdanovich",
         "Bridget Fonda"
      ],
      "imdbMovieId": "0119717",
      "originalTitle": "Mr. Jealousy",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["twD57dSSS98"],
      "plotSummary": "After his first date at age 15 ended with the girl making out with another man at a party, aspiring writer Lester Grimm has treated all his girlfriends with jealousy and suspicion. While dating Ramona Ray, paranoia gets the best of him when he discovers that her most recent ex is successful novelist Dashiell Frank. Lester begins attending the same group therapy sessions as Dashiell to learn about Ramona's past with him.",
      "tmdbMovieId": 53765,
      "avgRating": 3.12082,
      "releaseYear": "1997",
      "numRatings": 269,
      "posterPath": "/a4pDbwrt528alz21qIHW0sTQDJf.jpg"
   }
}