{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "ireland",
            "id": 14985
         },
         {
            "name": "protestant",
            "id": 41022
         }
      ],
      "imdb_id": "tt0140508",
      "video": false,
      "title": "Resurrection Man",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Victor Kelly",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4fb3",
               "name": "Stuart Townsend",
               "profile_path": "/8xnPcuwJEz2aiPr4NoqgfBj6lnW.jpg",
               "id": 56778,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Darkie Larche",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4fb7",
               "name": "John Hannah",
               "profile_path": "/jnHc3tC8mzLbVVJD6xWGUsEzC2r.jpg",
               "id": 10727,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ryan",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4fbb",
               "name": "James Nesbitt",
               "profile_path": "/n9NorD6bQfFJlW4IcJ6WoGiAKcR.jpg",
               "id": 34715,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dorcas Kelly",
               "gender": 1,
               "credit_id": "52fe4c10c3a368484e1a4fc5",
               "name": "Brenda Fricker",
               "profile_path": "/z2ARJBvxE1mCwQ6XARTKvvPQySu.jpg",
               "id": 18345,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Herbie Ferguson",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4fc9",
               "name": "Derek Thompson",
               "profile_path": "/yjOUReUYIH2hfTW5N4F2ZrUTR29.jpg",
               "id": 3426,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "James Kelly",
               "gender": 0,
               "credit_id": "5482559ac3a36829ab007491",
               "name": "George Shane",
               "profile_path": null,
               "id": 76107,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4fc1",
               "name": "Marc Evans",
               "profile_path": "/h7CkE0A3ZLI3InPJRx0J5uPF8Wj.jpg",
               "id": 4575,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "548255719251416e7b006946",
               "name": "Eoin McNamee",
               "profile_path": null,
               "id": 113756,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "54825576c3a3685c0e001005",
               "name": "Eoin McNamee",
               "profile_path": null,
               "id": 113756,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.182045,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 136134,
      "vote_count": 2,
      "budget": 0,
      "overview": "Belfast, in 1970s. Victor Kelly is a young protestant man who hates the Catholics so much that one night he begins to brutally murder them. A reporter soon tries to uncover the murder and obtained prestige for himself, while Victor sinks deeper into madness.",
      "similar": [
         357096,
         984,
         11423,
         15069,
         8090,
         4771,
         96,
         979,
         1949,
         281,
         75780,
         807,
         65754,
         281957,
         395834,
         445954,
         25376,
         21484,
         3134,
         10651
      ],
      "original_title": "Resurrection Man",
      "runtime": 102,
      "poster_path": "/mxqUS2x3z9oPz16bK8LKRmjGCGK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Revolution Films",
         "id": 163,
         "origin_country": ""
      }],
      "release_date": "1998-02-13",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Get right to the heart of the fear",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Marc Evans"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Eoin McNamee",
         "Eoin McNamee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140508/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNDE0MDQyOF5BMl5BanBnXkFtZTcwODg3NDYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: David Williamson, Stuart Townsend, Brenda Fricker | See full cast and crew »"],
      "reviews": [
         "What a cruel, confused film . This could have been the definitive film dealing with the tribal hatred during the Irish troubles , but instead we get an incoherant , rather plotless tale of motiveless murders I`ve never read the novel RESURRECTION MAN but it`s obvious the screenplay needs to be restructured since it tells us nothing of the reasons why Irishmen kill their fellow Irishmen. What made Victor Kelly this way ? Why is he regarded as a hero ? , and most importantly of all: Why are his gang called \"The Resurrection Men \" ? These questions are never fully explained Worst of all the film seems to concentrate more on a wife beating Belfast journalist rather than Kelly . If the film had to revolve round him couldn`t he have been an English or American journalist ignorant of the complex situation of 70`s Belfast ? At least then they`d be some expositional context in the film. And on top of this major flaw most of the characters are superflious , they don`t contribute to the plot. I might be missing the point that many terrorists in Ireland (Especially Loyalists ) aren`t intrested in politics or religion but are more intrested in venting blood lust , and to it`s credit the film does in gory detail show the suffering of the victims of violence , but after viewing RESURRECTION MAN the viewer will probably be left feeling that the film ( Like political violence ) is a waste of time. For a detailed and informative study of Lenny Murphy ( Who Victor Kelly is based upon ) try finding Martin Dillon`s book THE SHANKHILL BUTCHERS:A CASE STUDY OF MASS MURDER",
         "I guess this was as far as the filmmakers could go without actually calling Kelly Murphy. So instead of the audience being shown a film that could be called a true story, the events portrayed, however close to real life, take on an air of the surreal. The fact that there was a gang who did this sort of thing and a whole lot worse in the name of sectarian hatred is not made clear. Maybe they thought worldwide audiences would struggle with this concept, and introduced some kind of psychopathic blood lust to make the whole thing more believable. As it is, watching this film, and having read Martin Dillon's excellent book, I was left feeling frustrated, that an opportunity to portray the actual events was badly missed, being dumped into a crypto-fascist mishmash of conflicting motives. Living in N. Ireland, we know that there were and are people who could do this sort of thing and justify it on religious grounds..the film just isn't brave enough to say this, and so we are left with this psycho loner character that is frankly laughable. the gang weren't held in some kind of thrall by this psycho, acting against their will, they actually killed while Murphy was in prison, to make him look innocent. Townsend does what he was asked to do, it's just a pity he wasn't asked to do the right thing.",
         "I found this film to be both disgusting and insulting on every level. 'The Troubles', generally, do not make good subject matter for a movie (just look at 'The Devil's Own') but this is far worse than just a perversion of the truth. The killings in the film are glamorized as 'Pulp Fiction'-type sadism and the sectarian element is embarrassingly brushed aside. The film contains little element of 'gritty realism' (the locations look nothing like Belfast -it was shot in England), the performances and the script are dreadful, and the film never seems to know where it is going, or even why this tale is worth telling! In terms of politics,it is much to close to the bone but even without the Irish element it is a terrible film which thinks far to highly of itself. Exactly what are we supposed to feel for the lead character (he is given no redeeming qualities) and what are we supposed to take away from this film? Stuart Townsend's performance is one of the most insulting I've seen. He plays with the audience knowingly, as if he feels he has our respect and awe.My writing may seem garbled but truthfully I do consider myself a just film critic : that said, I consider this to be one of the worst films I've ever seen. Garbage.",
         "Eoin MacNamee's screenplay loses some of the visceral quality so powerfully evoked in his own novel, and the sense of place suffers badly from the movie having been shot entirely outside of Belfast. A heavily fictionalised account of the life of notorious Loyalist murderer Lenny Murphy, the film admirably conveys the arbitrary nature of sectarian violence in Belfast in the 1970's, and the performances are universally excellent. Not for the squeamish, the film reminds us just how far Northern Ireland has had to come on its present peace process.",
         "Stylishly shot, but predictable, woefully under-developed script with patchy performances other than the compelling lead male actor. Seems to believe it's about violence, but incoherent story and directorial approach to the ultra violence the film purports to explore, results in triple X rated pop video. Not just bad, but stupid on quite a deep level.",
         "Anyone who is familiar with the case of the Shankill Butchers should know that this movie is a travesty, and a disgrace to the victims and their families, and to everyone in Northern Ireland, regardless of their background. 99% fiction with 1% truth. The fact that the writer/director is cashing in on such a horrible era of brutality is almost as shameful as the pathetic popcorn-entertainment we've been subjected to with this movie. \"Artistic license\" has been stretched to the point of snapping with this director. If you have an interest in history and the story of the Northern Irish troubles, this movie ain't for you. Read Martin Dillon's book on the subject, \"The Shankill Butchers\", for a real insight into the events. I also urge you to try and get your hands on \"Lost Lives\", a book chronicling every death as a result of the N. Irish troubles from 1968 to 1999. Failing that, here is Wikipedia's entry on the Butchers: http://en.wikipedia.org/wiki/Shankill_Butchers",
         "If you didn't press stop on your video recorder five minutes into this film due to the shocking nature of some of the opening scenes, you will discover that this is a beautiful film which has more in common with 'Interview With The Vampire', 'The Company Of Wolves', 'Brighton Rock' and 'Frankenstein' than it does with a film about sectarian violence. Despite the book on which this was based, sectarian violence just provides an underlying base to stage this tale of the vampire like 'Victor Kelly', a young Irishman with a thirst for blood, fame and self destruction. Stuart Townsend epitomizes evil in the role of Victor, supported by many talented actors. The evil staring eyes of Victor Kelly, will stay with you long after watching the film. Perhaps this is why Stuart Townsend has been cast in the latest Anne Rice adaption.",
         "In 1975 in Belfast a group of young men, led by Victor Kelly start to get involved in the loyalist violence that goes on around them. However Kelly's enthusiasm and love for violence goes beyond the needs of the terrorist organisations and begins to spiral out of control. This story was written by Eoin McNamee based on his own book. He insists it is fiction but the film makers seem happy to forget that he said this and use it as truth at times. However this isn't as bad as things like Sunday, Bloody Sunday, Name of the Father etc, this doesn't seek to make political statements. What it does want to do is look at the character of Kelly \u0096 and as such it is interesting if not informative. The level of violence is too high although it is delivered with style and energy. However this is a problem, the film wants us to look at Kelly as vicious \u0096 taking pleasure in the killing, but it judges him as well. It judges him \u0096 even though all the violence is stylish and almost glamorised. Double-standards? Have cake and eat it? The cast are good, but Townsend is the standout \u0096 he is powerful in the lead role. Nesbitt is as good as he always is \u0096 although his character is not really involved in the film and his presence is a little distracting at times. Hannah is good despite the moustache \u0096 though mind you, after his embarrassment in the Mummy films, it's good to see him in anything. Overall this is watchable, but it has double standards. It is guilty of enjoying the violence and the life style just as much as Kelly does.",
         "Resurrection Man focuses on sectarian violence in Northern Ireland in the 1970s. Concentrating on what sort of characters are involved in this lifestyle and their relationships, but doesn't really go into much detail why. Which makes the film into a more stereotypical \"two gangs battling\" film, focusing mainly on the relationships between the members of the protestant gang, and making it all very stylish. This is the film's main flaw, it's feels like you've seen it before, it has been done before and better by others. That said, Resurrection Man has some good performances and a decent soundtrack, but on the whole, unless any of the plot lines are of interest to you personally, you might be better off watching some of the established \"classics\" of the genre that are fairly well known.",
         "Making a film about any conflict is ambitious but making one during a conflict is even more so. This film tactfully tackles the story of the Shankill Butchers a gang that mindlessly slaughtered innocent civilians and got away with it because it was during the Troubles. Strong performances from O'Rawe and Fricker in creating authentic Belfast dialogue. Townsend is sensational as as Victor and Holmes music is as good as its gets - long love SugarSweet...! If this production had the same budget as Goodfellows I shudder to think how good it could have been. Open your mind and imagine what it was like to live in a western street in 1970 with the army running down it and bombs going off."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Revolution Films"],
      "summaries": [
         "Belfast, in 1970s. Victor Kelly is a young protestant man who hates the Catholics so much that one night he begins to brutally murder them. A reporter soon tries to uncover the murder and obtained prestige for himself, while Victor sinks deeper into madness.",
         "Film based on the deeds of the Shankhill Butchers in 1970s Belfast, told as a retrospective. Victor Kelly is a criminal and ruthless murderer. He is the leader of a gang of men known as 'Resurrection Men'. Victor's cruelty makes him a local legend, both feared and venerated. On his trail is Ryan a journalist. Driven by his own personal demons and by an obsessive need to discover the truth about the 'Resurrection Men' he is putting himself at risk."
      ],
      "budget": 4000000
   },
   "movielensId": 1908,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-02-13",
      "dvdReleaseDate": null,
      "directors": ["Marc Evans"],
      "runtime": 102,
      "movieId": 1908,
      "title": "Resurrection Man",
      "mpaa": null,
      "actors": [
         "Stuart Townsend",
         "John Hannah",
         "James Nesbitt",
         "Brenda Fricker",
         "Derek Thompson",
         "George Shane"
      ],
      "imdbMovieId": "0140508",
      "originalTitle": "Resurrection Man",
      "genres": [
         "Thriller",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["pWzBAgLQkAQ"],
      "plotSummary": "Belfast, in 1970s. Victor Kelly is a young protestant man who hates the Catholics so much that one night he begins to brutally murder them. A reporter soon tries to uncover the murder and obtained prestige for himself, while Victor sinks deeper into madness.",
      "tmdbMovieId": 136134,
      "avgRating": 2.725,
      "releaseYear": "1998",
      "numRatings": 60,
      "posterPath": "/mxqUS2x3z9oPz16bK8LKRmjGCGK.jpg"
   }
}