{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "burning of witches",
            "id": 2871
         },
         {
            "name": "puritan",
            "id": 10223
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "period drama",
            "id": 15060
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0114345",
      "video": false,
      "title": "The Scarlet Letter",
      "recommendations": [
         9879,
         2259,
         9079,
         2768,
         1909,
         8984,
         10763,
         4478,
         24940,
         31633,
         15556,
         4421,
         7300,
         9623,
         25697,
         2057,
         12117,
         13539,
         1831,
         4587
      ],
      "backdrop_path": "/z73xb3xgb1BGdpGsDfycIf4Yii3.jpg",
      "revenue": 10382407,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hester Prynne",
               "gender": 1,
               "credit_id": "52fe43829251416c750131d1",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rev. Arthur Dimmesdale",
               "gender": 2,
               "credit_id": "52fe43829251416c750131d5",
               "name": "Gary Oldman",
               "profile_path": "/tofLS5A6lBXNjeROGvgpfe2JwaT.jpg",
               "id": 64,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roger Chillingworth",
               "gender": 2,
               "credit_id": "52fe43829251416c750131d9",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Horace Stonehall",
               "gender": 2,
               "credit_id": "5602249992514104a20007a5",
               "name": "Robert Prosky",
               "profile_path": "/9xpt96AOur6MmLIEaYhRiCQLIOE.jpg",
               "id": 10360,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Gov. John Bellingham",
               "gender": 2,
               "credit_id": "52fe43829251416c750131e1",
               "name": "Edward Hardwicke",
               "profile_path": "/21PRsSZBTaTrqq2wPwDUjRLSUjG.jpg",
               "id": 3545,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Harriet Hibbons",
               "gender": 1,
               "credit_id": "560224a692514122ca000ab3",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Rev. Thomas Cheever",
               "gender": 2,
               "credit_id": "560224b8c3a3685532000ab9",
               "name": "Roy Dotrice",
               "profile_path": "/aKcRRZhI3w1auIHsZU66S57YtYG.jpg",
               "id": 4002,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Goody Mortimer",
               "gender": 0,
               "credit_id": "560224d5c3a368552b000c14",
               "name": "Larissa Laskin",
               "profile_path": "/jQYXOLeBTTJJ6tMnL9jgk0kMrBR.jpg",
               "id": 55316,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Goody Gotwick",
               "gender": 1,
               "credit_id": "560224e392514105b6000127",
               "name": "Amy Wright",
               "profile_path": "/mEV42JRtrTTZg92GjyjRkQSXpsn.jpg",
               "id": 87007,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Meredith Stonehall",
               "gender": 1,
               "credit_id": "560224f2c3a3685526000bf6",
               "name": "Dana Ivey",
               "profile_path": "/12mxrB5iT1TAwCzIZvmcFGLBQ52.jpg",
               "id": 13314,
               "order": 9
            },
            {
               "cast_id": 4,
               "character": "Mituba",
               "gender": 0,
               "credit_id": "52fe43829251416c750131dd",
               "name": "Lisa Andoh",
               "profile_path": null,
               "id": 65543,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Prudence Stonehall",
               "gender": 1,
               "credit_id": "5a09fb83c3a368218a006a4f",
               "name": "Sarah Campbell",
               "profile_path": null,
               "id": 1109370,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43829251416c750131e7",
               "name": "Roland Joffé",
               "profile_path": "/kis74mAa2ZsccFr1ToDsrkMy7Gn.jpg",
               "id": 8965,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43829251416c750131ed",
               "name": "Nathaniel Hawthorne",
               "profile_path": null,
               "id": 65544,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43829251416c750131f3",
               "name": "Douglas Day Stewart",
               "profile_path": null,
               "id": 27538,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43829251416c750131f9",
               "name": "Dodi Fayed",
               "profile_path": null,
               "id": 14696,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43829251416c750131ff",
               "name": "Roland Joffé",
               "profile_path": "/kis74mAa2ZsccFr1ToDsrkMy7Gn.jpg",
               "id": 8965,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43829251416c75013205",
               "name": "Tova Laiter",
               "profile_path": null,
               "id": 65545,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43829251416c7501320b",
               "name": "Andrew G. Vajna",
               "profile_path": null,
               "id": 56967,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43829251416c75013211",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43829251416c75013217",
               "name": "Alex Thomson",
               "profile_path": null,
               "id": 21516,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43829251416c7501321d",
               "name": "Thom Noble",
               "profile_path": "/pl35WClWJFiuBao1dTMoV4PaxOj.jpg",
               "id": 17399,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.020784,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10533,
      "vote_count": 134,
      "budget": 50000000,
      "overview": "Set in puritanical Boston in the mid 1600s, the story of seamstress Hester Prynne, who is outcast after she becomes pregnant by a respected reverend. She refuses to divulge the name of the father, is \"convicted\" of adultery and forced to wear a scarlet \"A\" until an Indian attack unites the Puritans and leads to a reevaluation of their laws and morals.",
      "similar": [
         281957,
         27066,
         1259,
         244772,
         452507,
         283227,
         4507,
         21484,
         2275,
         182560,
         4771,
         64682,
         13,
         14,
         75780,
         28468,
         346364,
         6114,
         581,
         634
      ],
      "original_title": "The Scarlet Letter",
      "runtime": 135,
      "poster_path": "/g46rChf49Qgq28RJ22iWwvsK7nO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cinergi Pictures Entertainment",
            "id": 1504,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1995-10-13",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "When intimacy is forbidden and passion is a sin, love is the most defiant crime of all.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Roland Joffé"],
      "runtime": 135,
      "synopsis": null,
      "writers": [
         "Nathaniel Hawthorne",
         "Douglas Day Stewart"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114345/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4MTg0NzMxMV5BMl5BanBnXkFtZTcwMDc4ODUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Demi Moore, Gary Oldman, Robert Duvall | See full cast and crew »"],
      "reviews": [
         "Why should anyone find it necessary or even appropriate to hijack one of the landmark works of American literature to replace it with an emotionally slack, thematically vacant, and feebly agenda-driven narrative? Demi Moore's curious Scarlet Letter is almost an hour underway before it even reaches the point where Hawthorne's book begins: whereas Hawthorne's novel is a study of sin, psychological torment, and forgiveness, this film has neither heart nor mind behind its high-gloss presentation: it is apparently a libertine tract in defense of adultery, and an attack, pretentiously lofty but incapable of more than junior-high subtlety of thought, on intolerance. This can only be pulled off at all by systematically reducing Hawthorne's three-dimensional characters to flat and dull-witted markers, inane in their dialogue, a set of manic and breathy artifacts of a soap-opera sensibility. Accordingly, the characters of Hester Prynne (Moore) and her erstwhile husband Roger Chillingworth (Robert Duvall) emerge as parodies of themselves -- bad acting and bad direction across the board by one bad actress and one good actor. Gary Oldman's Arthur Dimmesdale is astoundingly more or less credible for whole scenes at a time, but he has nothing to play against, and the thematic underpinnings of the story have been knocked out from under him. One can defend this film for its cinematography, for its score, and for any number of other production-based virtues, but when they are all added together, they still don't come close to justifying the film's existence. It is a vulgar and banal demolition of one of America's greatest novels.",
         "I was expecting something really awful, but once I got about 15 minutes into the movie, I decided that the only way to enjoy it was to forget that it was \"based on\" a famous novel and just enjoy the movie for what it was. And I found myself very entertained. I was impressed with Gary Oldman's performance. It's nice to see him portray someone who isn't a psychotic ham and he did admirably well. Demi Moore suprised me with her acting and apart from a few stilted scenes and discomfort with the dialogue, I think she pulled it off pretty well. I found myself caring about her character and her relationship with Dimmesdale. Perhaps the bathing scene was a little too gratuitous -- c'mon, Demi, do you need to show it all? -- but it was only a few minutes out of 135. I wish that Pearl could have been given more screen time and character development and the woman who did her voiceover throughout the story left much to be desired. As did Robert Duvall's performance. I didn't much like his acting in this movie at all. The supporting cast was excellent: Joan Plowright, Edward Hardwicke, and others. The locations and set design were exquisite and the costumes were gorgeous. Overall, I thought it was a very good way to spend a couple hours. You see some early colonial atmosphere, something which is almost extinct in movies nowadays, and adequate and sometimes inspired acting. Just don't expect to see Hawthorne's novel on the screen. If you want to see the unhappy ending in all its self-mutilating glory, see Lillian Gish's silent version that is sometimes aired on Turner Classic Movies. 6/10",
         "I just caught this movie on cable. Eager to see a film version of the Hawthorne book I was, Very Disappointed. It is sad that some people will think that this is the real Scarlet Letter. The names of characters are the same as the book but it rapidly departs from the book beyond that -- and for the worse. You will read commentaries here about what a wonderful film this was with discussions of the beautiful cinematography and great acting. They will also say how it is \"loosely adapted\" from Hawthornes' book. These are all true statements and the \"loose\" in loosely should be especially emphasized. I even agree that normally an adaption might be judged on its own merits. So why did I give this a low score? Because it is titled \"The Scarlet Letter\". That is a classical book with some very deep moral messages. The very term \"Scarlet Letter\" has taken on a special meaning in our language and culture. But, if someone recognizes what Hawthorne was trying to do with his book, they will immediately see this as a rotten-to-the-core script. Consider: the Scarlet Letter, a central theme in the book and holding so much meaning, is just a minor prop in this movie that almost gets in the way. In Hawthorne's book, the heroine, by her actions through life, turned the Scarlet Letter from meaning \"Adulteress\" to meaning \"Angel\" -- it became an emblem of her inner beauty, redeemed through her strength, integrity and good heart. In our own time, people often find themselves \"labeled\" or identified in some way as bad or as a loser. What a great thing it is to have messages that say \"You can rise above that!\". This movie completely and totally misses that opportunity. It is one of the great messages that can be given to others in this life, and it is abandoned in this movie. And what is it traded for? Feminism, rebellion and justifications of immorality. Edgy? Groundbreaking? Incisive? No. So shallow its like cliff diving in a birdbath compared with what Hawthorne brought. In this adaptation, Hester, the heroine claims to not know if what she did was wrong -- or sometimes suggesting it was right. From that high moral ground, Hester almost becomes a feminist warrior or icon leading an insurrection of women against men. That rebellion is ridiculous historically but worse, it completely guts the morality of the book. And the Scarlet Letter? From what I can tell, the movie Hester seems to finally throw it away when she gets her freedom. It has no meaning other than as a talisman for oppression. That is a different message than the book gave out. But the Movie is still called \"The Scarlet Letter\". If the screenwriter wanted to send out a different moral message, then he should have retitled the movie. Something like \"Hester's Anachronistic and Pointless Rebellion\" would have been good. Then it would be truth in advertising. The actors and technicians did a great job but after reading the script they should have dropped the project. I suppose they needed the money. Beautifully shot, well acted, great score ... it still gets a \"1\" for being an egregious lie.",
         "For my point of view \"The Scarlet Letter\" is a good film with great performances\u0085 All the actors do a superb job\u0085 I was worried that Demi Moore might not have the range to handle the role of Mistress Prynne, but she is excellent... She is strong, passionate, intelligent and damaged\u0085 In another place and time she might have been a leader; in this movie she is quite believable as the woman who defends her love at all costs\u0085 Gary Oldman looks perfect as Reverend Dimmesdale\u0085 He projects force and sexual magnetism along with the guilt for his sin\u0085 The film opens in 1666 when Hester Prynne (Demi Moore) arrived in the Massachusetts Bay Colony filled with hope that here, at last, in this new World, would come the freedom to worship without fear or persecution\u0085 She didn't suspect that beyond the trees there is a savage land of savage passions dark and untamed, and that soon she will face a scornful community in which she will forever be shamed by the scarlet letter\u0085 Mistress Prynne rejected the idea of staying in the congregation until her husband's arrival and looked for a house of her own\u0085 She finds a beautiful and frightening place, just as 'Eden must have been so untouched\u0085' On one Sabbath morning, Hester met Reverend Dimmesdale (Gary Oldman) who helps her when her cart got stuck in the woods\u0085 She truly enjoyed, few minutes later, his sermon \u0085 It was rare, for her, to find a man so young and fiery who could speak with such force of passion\u0085 She was moved by his passion\u0085 Dimmesdale thought that comprehending God was going to be his greatest challenge, but\u0097after he met Hester\u0097he was not the man he seems to be\u0085 He lost his power before this seductress beautiful woman\u0085 He lived in this township his whole life and his purpose was clear\u0085 But now he would risk everything\u0097his life, his ministry, his soul\u0097just to spend a few moments alone with her\u0085 After he asked her why that morning in the forest, she didn't say that she is married, he wondered how she were able to see so deeply into his nature\u0085 From that moment, two hearts were there struggling against a love that grew stronger with each passing day\u0085 Hester was courteous enough but her tongue knew no rules\u0085 She earned more than a few reprimands in her life for speaking too bluntly\u0085 With a frightening strength, she challenged her persecutors and stood up to their hypocrisy, refusing to reveal her lover's identity\u0085 \"The Scarlet Letter\" compels us to recognize the shadow side of our lives, including this passion that pushes us beyond our limits... The climax also compels us to contemplate about whether there is anything that we would be willing to die for\u0085",
         "If this movie were original it would be only fair to mediocre, but claiming its based on Nathaniel Hawthorne's classic novel is insulting. I hear the ads for this movie say its based 'freely and liberally' on the book. Well, this is an insult to the book. Is Demi Moore so illiterrate she comments (see trivia section) that it was okay to change the ending of the book from sad to happy because not many people read the book? Unbelievable. The Scarlett 'A' imagery has been permanently etched in American culture. Take classic literature and try shoving it through the Hollywood formula mill and this movie is the result, a faceless, emotionless and forgettable movie. Try sayign that about the book",
         "First, I apologies because my English, I'm from Panama. Second, for me, TSL is a very beautiful movie and I know that it is far from the book by Nathaniel Hawthorne, nevertheless, I found nice things there, for instance, the setting was so refreshing to me and the love scenes were very romantic too. In this movie I felt in love to Gary Oldman. I consider that Demi as well as Gary were chemistry. On the other hand, I think that the producer and the whole team portrait the epoch of the pilgrims, the way they lived and thought about morality and religion. Demi was pretty in this character and convincing. For me this was a sad story of love. Although, the screenplay changed at the end, I found that this movie was done to give audience happier than the original book.",
         "I must inform you that that Roland Joffé has utterly bastardized Nathaniel Hawthorne's work with this film, but I find I must review the film as a film, rather than an adaptation due to the strength of the film itself in comparison to the original literary work. As an adaptation, it is a sexed-up, stylized-down piece of detritus. But as a film... This work stands alone, as it will not bear up under scrutiny when compared against Hawthorne, but aside from that, this \"based on\" work is a fabulous dramatization of Hawthorne's story. I have to say the performances are marvelous, the story is captivating, and the emotion of the portrayals is wrenching. I highly enjoyed this bastardization, and rate it at a 7.6/10 from... the Fiend :.",
         "You could try to imagine a worse film, but why bother? As a film and as an adaptation (\"freely adapted\" is perhaps the greatest understatement since our involvement in Vietnam was labeled a \"police action\") of a book, it's a complete failure. The acting ranges from the clueless to the atrocious. Gary Oldman is apparently trying to do a Scottish accent, Demi Moore is just plain terrible, and Robert Duvall is nuts. The soft-glow sex scene is risible. There's no tension to the story because Oldman & Moore don't appear to have souls to lose. Instead of a perceptive & morally soaked tale of guilt, sin, and conscience, this is a trite, gushy story about being true to yourself. It's basically a Disney cartoon message, except without as sophisticated a presentation. The script (it's idea of 17th century English is lots of thees & thous) is as bad as everything else, substituting a nick of time rescue happy ending for Hawthorne's. So bad that it's not even enjoyable on a camp level. C-R-A-P.",
         "I am an English major and have to say, yes, the book was better and this film is not equal but by itself as a \"freely adapted\" version it too has merit. It has a beautiful score by excellent film composer John Barry, superb acting by both Gary Oldman and Demi Moore (as a woman way ahead of her time) and even excellent supporting cast. It is beautifully filmed and on its own - is a rare romantic treat that would be great in a double feature with say \"THE LAST OF THE MOHICANS\" w/ Daniel Day Lewis. Oldman is terrific...his best role I believe. The only distraction....the always wonderful Robert Duvall as a madman...who starts to stray this film toward THE CRUCIBLE area of witchcraft.",
         "Now, I can honestly say it's not a movie that attracted my attention at first. Maybe it wasn't publicized well, but watching the beginning of the movie, got me in to watching the middle and the end of the movie in one sitting. I agree with past comments of this flick that it was not as people portrayed it to be, meaning so much speaking of the adultery issue. In the basic sense it follows the book, but I think the movie went much further in exploring the love two people shared, almost at first sight. I read the trivia in this website about this movie and noticed that Demi Moore had approved the ending of the movie. I am glad they went a different route and made the audience feel comfortable with the way things made out, rather than to leave the theater or shut off your TV set feeling like something was missing. It's unsatisfying. This movie is far from unsatisfying. If you would like an excellent love story with a great twist, see this movie. Gary Oldman is for the first time, sexy, and this movie has now made me a permanent fan of his brilliant acting."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Allied Stars Ltd.",
         "Cinergi Pictures Entertainment",
         "Hollywood Pictures"
      ],
      "summaries": [
         "In 1666 in the Massachusetts Bay colony, Puritans and Algonquian have an uneasy truce. Hester arrives from England, seeking independence. Awaiting her husband, she establishes independence, fixing up a house, befriending Quakers and other outsiders. Passion draws her to a young pastor. He feels the same; when they learn her husband has probably died at the hands of Indians, they consummate their love. A child is born, and on the day Hester is publicly humiliated and made to wear a scarlet letter, her husband appears after a year with Indians. Calling himself Chillingworth, he seeks revenge, searching out Hester's lover and stirring fears of witchcraft. Will his murderous plot succeed?",
         "New England in the 17th century: Young Hester Prynne arrives at the colony with the purpose to find a house for herself and her husband, old doctor Roger Prynne, who still resides in good old England and will follow later. From the first day the other inhabitants of the village notice that Hester is intelligent and independent, which attracts the ones and strucks the others. When she, however, finds herself a house near the forest and takes a walk in it she sees by chance a naked young man swimming in the river nearby. The man, as she finds out later, is the very popular Reverend Arthur Dimmesdale. The two soon find themselves attracted to each other and secretly begin an affair. As the result of this Hester becomes pregnant and when the government finds out, she is showed up in public and has to wear a scarlet \"A\" as \"adultery\" on her chest. Because of this but also because she refuses to tell the name of her child's father, she goes into jail where she gives birth to her daughter, Pearl. Then, surprisingly, Roger Prynne, whose ship was supposed to have been destroyed in a storm with no survivors, appears in the village. The doctor is now driven by the idea to find out who was Hester's lover and destroy his life, as well as the life of Hester.",
         "An affair between a young woman and a pastor has disastrous consequences."
      ],
      "budget": 50000000
   },
   "movielensId": 191,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-13",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Roland Joffé"],
      "runtime": 135,
      "movieId": 191,
      "title": "The Scarlet Letter",
      "mpaa": "R",
      "actors": [
         "Demi Moore",
         "Gary Oldman",
         "Robert Duvall",
         "Robert Prosky",
         "Edward Hardwicke",
         "Joan Plowright",
         "Roy Dotrice",
         "Larissa Laskin",
         "Amy Wright",
         "Dana Ivey",
         "Lisa Andoh",
         "Sarah Campbell"
      ],
      "imdbMovieId": "0114345",
      "originalTitle": "The Scarlet Letter",
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "youtubeTrailerIds": ["NlUetVd4rsw"],
      "plotSummary": "Set in puritanical Boston in the mid 1600s, the story of seamstress Hester Prynne, who is outcast after she becomes pregnant by a respected reverend. She refuses to divulge the name of the father, is \"convicted\" of adultery and forced to wear a scarlet \"A\" until an Indian attack unites the Puritans and leads to a reevaluation of their laws and morals.",
      "tmdbMovieId": 10533,
      "avgRating": 2.69239,
      "releaseYear": "1995",
      "numRatings": 1853,
      "posterPath": "/g46rChf49Qgq28RJ22iWwvsK7nO.jpg"
   }
}