{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "release from prison",
            "id": 3398
         },
         {
            "name": "dublin",
            "id": 4729
         },
         {
            "name": "irish",
            "id": 11018
         },
         {
            "name": "hoodlum",
            "id": 160488
         }
      ],
      "imdb_id": "tt0126344",
      "video": false,
      "title": "I Went Down",
      "recommendations": [],
      "backdrop_path": "/ucCI0vcgVrBAjMYoP9UbI3cZ0gq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bunny Kelly",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a66f",
               "name": "Brendan Gleeson",
               "profile_path": "/pUTBk2sqFgg4aFBXHckD0qKLUYP.jpg",
               "id": 2039,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Git Hynes",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a673",
               "name": "Peter McDonald",
               "profile_path": "/gPc9j1Sqn1mrShUkPMbj2subRWF.jpg",
               "id": 73283,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tom French",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a677",
               "name": "Tony Doyle",
               "profile_path": "/uUyHBlZ6Gq3XDZh1kPFBvYfAlZc.jpg",
               "id": 73284,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Frank Grogan",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a67b",
               "name": "Peter Caffrey",
               "profile_path": null,
               "id": 73285,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Antoine Byrne",
               "gender": 1,
               "credit_id": "52fe450f9251416c7504a67f",
               "name": "Antoine Byrne",
               "profile_path": null,
               "id": 73286,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Anto",
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a683",
               "name": "David Wilmot",
               "profile_path": "/qc5ABw9XRIx6LP2rElYIJb9JTgj.jpg",
               "id": 73287,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Johnner Doyle",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a687",
               "name": "Michael McElhatton",
               "profile_path": "/yNwAo0LGS9fLd6Hathxt0wN6r9O.jpg",
               "id": 73288,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a66b",
               "name": "Paddy Breathnach",
               "profile_path": null,
               "id": 73282,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a68d",
               "name": "Conor McPherson",
               "profile_path": "/qoe4tpsNSdL50h6Xx3BVhkHhycd.jpg",
               "id": 73289,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a693",
               "name": "Dario Marianelli",
               "profile_path": "/bjYBKs9MuvkF9dL1KIj4oTzdcBq.jpg",
               "id": 11269,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a699",
               "name": "Robert Walpole",
               "profile_path": null,
               "id": 73290,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a69f",
               "name": "Cian de Buitléar",
               "profile_path": null,
               "id": 73291,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a6a5",
               "name": "Emer Reynolds",
               "profile_path": null,
               "id": 73292,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a6ab",
               "name": "David Collins",
               "profile_path": null,
               "id": 45119,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a6b1",
               "name": "Mark Shivas",
               "profile_path": null,
               "id": 55982,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a6b7",
               "name": "Rod Stoneman",
               "profile_path": null,
               "id": 72470,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.03235,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         }
      ],
      "id": 12655,
      "vote_count": 3,
      "budget": 0,
      "overview": "Fresh out of prison, Git rescues a former best friend (now living with Git's girlfriend) from a beating at the hands of loan sharks. He's now in trouble with the mob boss, Tom French, who sends Git to Cork with another debtor, Bunny Kelly, to find a guy named Frank Grogan, and take him to a man with a friendly face at a shack across a bog. It's a tougher assignment than it seems: Git's a novice, Bunny's prone to rash acts, Frank doesn't want to be found (and once he's found, he has no money), and maybe Tom's planning to murder Frank, which puts Git in a moral dilemma. Then, there's the long-ago disappearance of Sonny Mulligan. What's a decent and stand-up lad to do?",
      "similar": [
         2069,
         8012,
         64689,
         7516,
         186,
         59,
         1422,
         8961,
         9366,
         769,
         1572,
         193893,
         156022,
         562,
         154400,
         395990,
         324542,
         1103,
         21575,
         9462
      ],
      "original_title": "I Went Down",
      "runtime": 97,
      "poster_path": "/na3413fBGD0Hyiy5FOvcWYWbJ7x.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Treasure Entertainment",
            "id": 21872,
            "origin_country": ""
         },
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Bórd Scannán na hÉireann",
            "id": 1898,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Easkel Media",
            "id": 70198,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Radio Telefís Éireann (RTÉ)",
            "id": 40605,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shooting Gallery",
            "id": 1596,
            "origin_country": ""
         }
      ],
      "release_date": "1997-10-03",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "One doesn't count, the other can't. Dis-organised crime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paddy Breathnach"],
      "runtime": 107,
      "synopsis": "Man loves woman. Woman doesn't love man. Man goes to jail defending his woman's lover. Man gets out of jail. Gang boss sends him on a mission that he can't get out of. Man gets paired with a not-so-bright partner in crime, who has more to him than meets the eye. The two try to complete their mission while man still holds love for woman.",
      "writers": ["Conor McPherson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0126344/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1Nzk5NTE3OF5BMl5BanBnXkFtZTcwMTIzOTEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Brendan Gleeson, Peter McDonald, Antoine Byrne | See full cast and crew »"],
      "reviews": [
         "I went to see this movie and was enjoying it, and then it came to the bit where they were rescuing the hostage from the house. Imagine my surprise when I realised that the house in question was in fact my own one!! My girlfriend and I had just bought it a month before and knew nothing about the fact that it was used as a location in the movie....the surrounding woodland on the property was also used for other scenes. Needless to say our attention was rivetted to the screen from then on, but that said, it was a very entertaining movie anyhow. I do however think you need to have a certain understanding of the Irish psyche and way of life to get full value from the hilarious script. Brendan Gleeson and Peter MacDonald both excellent, even if they did have a shoot-out at my kitchen door!!",
         "What a pleasant surprise! One of the earlier set of well-made Irish films with not a shamrock or a leprechaun in sight. The banter between Gleeson and McDonald is well-timed, realistic and naturally, hilarious. A film that somewhat reflects a 'real' Ireland that we can relate to(er, possibly without all the guns and violence). A film that shows what a talent we have here.",
         "WARNING - POSSIBLE SPOILER DETAILS INCLUDED This is a cool Irish road movie with brilliant performances from the two lead actors. Brendan Gleeson is a master of these Irish rogue type roles, and his comic timing is impeccable. With his pork-chop sideburns and leather jacket, he would be somebody you \"couldn't trust as far as you could throw him\" if you met him in person. It is no wonder that Gleeson is now commanding roles in big budget blockbusters like Mission Impossible 2, AI, and the latest Harry Potter flick. His charisma jumps off the screen and I'm sure he will go from strength to strength. Peter McDonald gives an understated performance as Git, and acts as a perfect foil to the exuberant Gleeson. McDonald's hang-dog expression is perfect for scenes such as the Balaclava fiasco, where he ends up wearing a child's woolly hat! The supporting cast of villains and ne'er do wells is also very convincing, particularly Peter Caffrey as Frank Grogan, whose brand of Irish Blarney and dirty tricks is wonderful to watch. All in all this is a very enjoyable film both for the splendid acting, non-fussy directing, and a storyline that is tight while still allowing plenty of time for the comic antics to run their course. Please see this film if you get the chance.",
         "The film, which was shot in various locations within Dublin (posing as Cork) is in my opinion one of the best movies to come out of Ireland, Its a great tale of two guys thrown together to complete a task which neither of them want to do. The dialogue and wit between both main players is funny (warning: explenatives abound) and sometimes touching. Git (McDonald), the novice to the world of shady dealings and gangsters and Bunny Kelly (Gleeson), a man who has been there, done that and shot the gun, according to him anyway. The movie moves at a fairly quick pace, we are given glimses at Bunny and Gits life and why they are both in the predicament they are in. The situation humor is spot on with some funny set pieces, with great dialogue between the two. The late Tony Doyle gives a great performance as Tom French, the gangster with a great line in put downs and a man with who you just dont mess with. The story has twists and turns much like the travelled roads the guys are on, the twists and turns are nicely explained by the films end. The film is one of the few films which holds up to repeat viewings. Overall, the film is worth watching and remember, \"The benefit of the Doubt, can even save your life\" - Mr Bunny Kelly BA",
         "\"I Went Down\" is a droll, sometime monotonous, sometimes clever comedy about a couple of guys who run an errand for a small time gangster and end up embroiled an underworld scheme of very limited proportions. The film spends most of its time studying the characters involved as its mildly humorous story unfolds leading to an eventful conclusion which may or may not be worth the wait depending on individual taste. \"I Went Down\", the title, is a double entendre representative of the very subtle humor the film embodies. A worthwhile watch for those who enjoy puns and dry humor.",
         "A well shot, well written, well acted gangster comedy that for me blows lock stock and two smoking barrels right out of the water. Brendan and Peter play the two out-of-their-depth ex-cons brilliantly, in fact they play them so well that I find it hard to watch them in other roles, to me they are Bunny and Git. Conor Mcpherson transfers his stage writing skills well to the big screen and doesn't lose any of his humour.Paddy Breathnach directs the action well but it is slower paced than some may expect, or want, in their gangster comedies but I think it makes perfect Sunday afternoon hangover viewing, so sit down with the hair of the dog and a big fat fry up and prepare to love this film!",
         "I Went Down is directed by Paddy Breathnach and written by Conor McPherson. It stars Peter McDonald, Brendan Gleeson, Tony Doyle and Peter Caffrey. Music is by Dario Marianelli and cinematography by Cian de Buitlear. Fresh out of prison, Git Hynes (McDonald) runs into trouble with local mob boss Tom French (Doyle) and finds himself having to work off a debt to him. He's to accompany Bunny Kelly (Gleeson) to Cork and locate Frank Grogan (Caffrey) and bring him back to Dublin. There's some murky history at the core of this request, but for now Bunny and Git must survive each other and a host of life challenges before they begin to worry about Tom French's motives. Hugely popular in Ireland for a number of years, this independent comedy/drama is finally starting to get noticed by a wider home viewing audience. Film takes a couple of likable rogues and sets them off on a topsy-turvy journey of peril and self discovery. So far so formulaic then. No question about it, plot is unadventurous and outcome is hardly in the realms of the twisty surprise. But dialogue and character interactions are sharp and vital, often cutting and witty. The actors are ever watchable (especially Gleeson and Caffrey), while the fact that the story focuses on a different Ireland to the one that's often tainted by \"The Troubles\", gives the film a freshness that off sets the standard buddy buddy road movie formula of the plot. Director Breathnach goes for the slow burn approach, choosing to let McPherson's script dominate the picture. Yes there's some action, and good sequences flit in and out of the narrative, but the director is mostly about letting his characters breath, fully forming them with each passage of play during the guy's journey/mission. Even a sex scene is deftly slotted in and comes out as tasteful and a further expansion on the character of Git Hynes. It's thoughtful film making as regards being a character driven piece. There's a most interesting side issue involving the women in Git's and Bunny's lives, two men just about traversing the path on the wrong side of the law, both with gal trouble that gnaws away at their masculinity. It's not the Irish Midnight Run, as I was personally led to believe it was, and any expectation of a violent fun fest will only lead to disappointment. But it has many virtues to make it a safe recommendation to those that enjoy crisp and intelligent dialogue and fully formed characterisations. Nice photography, too. 7/10",
         "A rare thing in Irish cinema ...an Irish movie that's not afraid to be authentically Irish. Where other movies attempt to tailor their image and dialogue to suit an American or British market this independent gem from Paddy Breathnach and Conor McPherson depicts believable characters acting and talking in a way that real Irish people would ...a great example being how seriously the lead duo consider the handling of a gun (guns are still not very easy to come across in Irish society and having one is a big deal. The screenplay has echoes of Tarantino and the Coen brothers while not being a slavish rip-off of either and essentially plays as a buddy, road movie; it even manages to include a scene in an Irish bog without seeming twee! Brendan Gleeson's star turn as bunny provides the perfect foil to McDonald's shy, pent-up lead and the movie manages to evoke laughter, sympathy and ultimately happiness as it winds it's way to a satisfactory, yet not overly sugar-coated, ending. Be warned ...I watched this film with my old Canadian flatmate and had to explain a lot of the 'Irish-ism's' in the dialogue as it went along so some of the humour may go over the heads of non Irish-viewers.",
         "This was one of the best films I have seen in a while. Peter McDonald and Brendan Gleeson's chemistry together reminded me of much better known and consequently higher cost Samuel L. Jackson and John Travolta in Pulp Fiction. The movie showed me that having the well known actors shouldn't make the movie. If they are good actors, the script will make the movie, and effectively promote the careers of the actors. The script did an excellent job of portraying the relationships between the characters involved. Again this was one of the best movies I have seen in a while.",
         "I Went Down is a gem of a movie. Although it has been fairly overlooked, it in my opinion is one of the best Irish movies to date. Before films like 'Lock, Stock...' and 'Intermission' made these colloquial crime-capers the fashion, this fast-paced, funny and thoroughly enjoyable action movie hit the big screens. Brendan Gleeson, as ever, is outstanding in his role as Bunny Kelly, but he's not on his own by any means. There are no other big names, but there is some very big performances. Much like the aforementioned 'Lock, stock...' the dialogue is what steals the show, but it's also well shot, and plot is great. I Went Down shouldn't be missed."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Bórd Scannán na hÉireann",
         "Easkel Media"
      ],
      "summaries": ["Fresh out of prison, Git rescues a former best friend (now living with Git's girlfriend) from a beating at the hands of loan sharks. He's now in trouble with the mob boss, Tom French, who sends Git to Cork with another debtor, Bunny Kelly, to find a guy named Frank Grogan, and take him to a man with a friendly face at a shack across a bog. It's a tougher assignment than it seems: Git's a novice, Bunny's prone to rash acts, Frank doesn't want to be found (and once he's found, he has no money), and maybe Tom's planning to murder Frank, which puts Git in a moral dilemma. Then, there's the long-ago disappearance of Sonny Mulligan. What's a decent and stand-up lad to do?"],
      "budget": 0
   },
   "movielensId": 1910,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-03",
      "dvdReleaseDate": null,
      "directors": ["Paddy Breathnach"],
      "runtime": 97,
      "movieId": 1910,
      "title": "I Went Down",
      "mpaa": "R",
      "actors": [
         "Brendan Gleeson",
         "Peter McDonald",
         "Tony Doyle",
         "Peter Caffrey",
         "Antoine Byrne",
         "David Wilmot",
         "Michael McElhatton"
      ],
      "imdbMovieId": "0126344",
      "originalTitle": "I Went Down",
      "genres": [
         "Action",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["vvjMed6Wlug"],
      "plotSummary": "Fresh out of prison, Git rescues a former best friend (now living with Git's girlfriend) from a beating at the hands of loan sharks. He's now in trouble with the mob boss, Tom French, who sends Git to Cork with another debtor, Bunny Kelly, to find a guy named Frank Grogan, and take him to a man with a friendly face at a shack across a bog. It's a tougher assignment than it seems: Git's a novice, Bunny's prone to rash acts, Frank doesn't want to be found (and once he's found, he has no money), and maybe Tom's planning to murder Frank, which puts Git in a moral dilemma. Then, there's the long-ago disappearance of Sonny Mulligan. What's a decent and stand-up lad to do?",
      "tmdbMovieId": 12655,
      "avgRating": 3.42587,
      "releaseYear": "1997",
      "numRatings": 317,
      "posterPath": "/na3413fBGD0Hyiy5FOvcWYWbJ7x.jpg"
   }
}