{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "bedroom",
            "id": 3303
         },
         {
            "name": "purse",
            "id": 8806
         },
         {
            "name": "trunk",
            "id": 9098
         },
         {
            "name": "elmore leonard",
            "id": 155552
         }
      ],
      "imdb_id": "tt0120780",
      "video": false,
      "title": "Out of Sight",
      "recommendations": [
         8012,
         11517,
         6623,
         3595,
         9434,
         9869,
         2142,
         4566,
         11412,
         10782,
         8688,
         9451,
         9430,
         1900,
         11374,
         9208,
         9333,
         8649,
         231,
         7007
      ],
      "backdrop_path": "/ttOEZHDNL9scJkr7S5NSvEZUg4F.jpg",
      "revenue": 77745568,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Foley",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef2f",
               "name": "George Clooney",
               "profile_path": "/z4SBfpKDThuQY0FsvDbajcooBdA.jpg",
               "id": 1461,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Karen Sisco",
               "gender": 1,
               "credit_id": "52fe42f2c3a36847f802ef33",
               "name": "Jennifer Lopez",
               "profile_path": "/yOz9MwgY9IV4kV9QdJyMCrATHCw.jpg",
               "id": 16866,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Buddy Bragg",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef89",
               "name": "Ving Rhames",
               "profile_path": "/8nS83GOu0iqxjL2Oj2DgwkAceFQ.jpg",
               "id": 10182,
               "order": 2
            },
            {
               "cast_id": 23,
               "character": "Maurice Miller",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef9d",
               "name": "Don Cheadle",
               "profile_path": "/b1EVJWdFn7a75qVYJgwO87W2TJU.jpg",
               "id": 1896,
               "order": 3
            },
            {
               "cast_id": 22,
               "character": "Richard Ripley",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef99",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Glenn Michaels",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef8d",
               "name": "Steve Zahn",
               "profile_path": "/tcRHqtdi4wM8hlZ3MjPDWgePp7L.jpg",
               "id": 18324,
               "order": 5
            },
            {
               "cast_id": 27,
               "character": "Kenneth",
               "gender": 2,
               "credit_id": "576dfae99251412e7f0006cc",
               "name": "Isaiah Washington",
               "profile_path": "/kK4nEwvY0MFwCsQ17E0w0El7G9P.jpg",
               "id": 21353,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Marshall Sisco",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef81",
               "name": "Dennis Farina",
               "profile_path": "/o649nAtUimSZxEV6xa5JbMSgsED.jpg",
               "id": 1117,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Chino",
               "gender": 2,
               "credit_id": "576dfa31c3a36856740021eb",
               "name": "Luis Guzmán",
               "profile_path": "/e6mIeGBDkNFZwFDoskcetgkU5oH.jpg",
               "id": 40481,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "White Boy Bob",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef91",
               "name": "Keith Loneker",
               "profile_path": "/jSQEDdzFv2nFEVmh6rn8JnrajWR.jpg",
               "id": 54714,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Adele",
               "gender": 1,
               "credit_id": "52fe42f2c3a36847f802ef85",
               "name": "Catherine Keener",
               "profile_path": "/tEBdqBUduF3dBcJcBeY5ffZ9MMu.jpg",
               "id": 2229,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Midge",
               "gender": 1,
               "credit_id": "52fe42f2c3a36847f802ef95",
               "name": "Nancy Allen",
               "profile_path": "/rB8vSEB4or8GUYlyv9EBTBEC5eH.jpg",
               "id": 44038,
               "order": 11
            },
            {
               "cast_id": 3,
               "character": "Ray Nicolette",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef37",
               "name": "Michael Keaton",
               "profile_path": "/myVdrYNGTgqunLfUSaM8DuVD7DL.jpg",
               "id": 2232,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Moselle",
               "gender": 1,
               "credit_id": "576dfa71c3a36856720026d9",
               "name": "Viola Davis",
               "profile_path": "/9nhqKVGA09DLeZqsvWVoNeTRlRQ.jpg",
               "id": 19492,
               "order": 13
            },
            {
               "cast_id": 4,
               "character": "Hejira Henry",
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef3b",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 14
            },
            {
               "cast_id": 28,
               "character": "Raymond Cruz",
               "gender": 2,
               "credit_id": "59acfe28c3a3682cc804040d",
               "name": "Paul Calderon",
               "profile_path": "/2v8spXfKtaMbFZ25FrVsV0SAPwW.jpg",
               "id": 3137,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef41",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef47",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef4d",
               "name": "Barry Sonnenfeld",
               "profile_path": "/m8vIfbXI44Fd8VK7HSJRisYQjQc.jpg",
               "id": 5174,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef53",
               "name": "Elmore Leonard",
               "profile_path": "/vL1oMCp0EE8kgSNJEPDPrMs7qVs.jpg",
               "id": 2235,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef59",
               "name": "Scott Frank",
               "profile_path": "/hV0DEtOsiiQAMb7Oqo2VEII8o2l.jpg",
               "id": 2199,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef5f",
               "name": "John Hardy",
               "profile_path": null,
               "id": 6341,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef65",
               "name": "Michael Shamberg",
               "profile_path": "/tjqSWmFb0OCjnTwDISwR8Kl94af.jpg",
               "id": 5381,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f2c3a36847f802ef6b",
               "name": "Stacey Sher",
               "profile_path": "/fFvKIC38R9Q34VhTQ8BGfqorK8E.jpg",
               "id": 5382,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef71",
               "name": "David Holmes",
               "profile_path": null,
               "id": 1889,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f2c3a36847f802ef77",
               "name": "Elliot Davis",
               "profile_path": null,
               "id": 5506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f2c3a36847f802ef7d",
               "name": "Anne V. Coates",
               "profile_path": null,
               "id": 6346,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56abf160c3a3681c47003c9e",
               "name": "Bill Corso",
               "profile_path": "/iL7zT7LUL5p7aBuKfQa4vXF4bAt.jpg",
               "id": 15017,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 10.3097,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1389,
      "vote_count": 412,
      "budget": 48000000,
      "overview": "Meet Jack Foley, a smooth criminal who bends the law and is determined to make one last heist. Karen Sisco is a federal marshal who chooses all the right moves … and all the wrong guys. Now they're willing to risk it all to find out if there's more between them than just the law. Variety hails Out of Sight as \"a sly, sexy, vastly entertaining film.\"",
      "similar": [
         264630,
         63801,
         198272,
         63803,
         264661,
         205920,
         216749,
         65916,
         269502,
         63804,
         313643,
         86035,
         86022,
         63802,
         43156,
         313538,
         264651,
         269497,
         313614,
         313821
      ],
      "original_title": "Out of Sight",
      "runtime": 123,
      "poster_path": "/hSL2Ta4ErgAxPEOlkkxZmrTSAET.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Jersey Films",
            "id": 216,
            "origin_country": ""
         }
      ],
      "release_date": "1998-06-26",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Opposites attract.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steven Soderbergh"],
      "runtime": 123,
      "synopsis": "Jack Foley, a small-time crook and obviously agitated, walks out of an office building, rips his necktie off and throws it on the ground. He walks into a nearby bank and surveys the lobby for a few minutes. He walks up to a teller's window and informs the woman behind the counter that his accomplice is sitting with her manager and that if she doesn't follow his instructions, the man will shoot her boss. Foley tells her to empty the cash drawer of it's contents, leaving behind the bills on the very bottom of the piles. Foley assures her she's doing a good job, takes the money and walks out, stopping to talk momentarily to the man he identified as his accomplice. The man (a cameo by director Steven Soderbergh) has no idea who Foley is. Outside the bank, Foley tries to start his car, only to flood the engine in his desperation to flee the scene. A police officer, gun drawn, apprehends Foley, who submits without any altercation. The story jumps to two years before when Foley is a prisoner in Glades Correctional facility in Florida. Playing basketball with other inmates, he looks over the crowd of old-time \"lifers\" and seemingly reaches the conclusion that he doesn't want to end up like them. He spots a couple of fellow inmates, Chino and Lulu, jogging by. When he speaks to them later, he tells them he knows they are plotting an escape. Another security fence is being constructed just beyond the primary one just beyond the point where they plan to emerge once they've tunneled out. Foley tells them he's going with them in exchange for keeping silent about the breakout. Foley does tell a guard about the plan, telling the man to meet him in the prison chapel that night. In Miami, Karen Sisco, a US Marshall, has lunch with her father, a retired Marshall himself. He gives her a Sig-Sauer pistol as a birthday gift. He also questions her about a man she's been seeing, Ray Nicolette, another Marshall, who is married. Karen's father doesn't approve and she tells him to drop the subject. She also tells him that she has to go to Glades Correctional to follow up on a case. Karen arrives at Glades. Also arriving in the prison parking lot is Foley's longtime friend, Buddy. Lulu and Chino have already begun their escape from the prison chapel, while Foley stands watch. The guard Foley had told to come to the chapel arrives and Foley tells him to watch the fenceline. Foley grabs a large vase and hits the guard with it, knocking him out. Outside the fence, Sisco sees the men emerging from their tunnel and alerts the tower guards. Two men escape (one of them is Chino) and two more are shot. Foley surfaces, wearing the guard's uniform and tells the other guards that the tunnel is clear of escapees. Foley approaches Sisco, who wields a shotgun. Foley distracts Karen long enough for Buddy to grab her from behind and they throw her in the trunk of her car; Foley crawls in after her. Buddy drives them away. In the trunk, Foley and Karen have a lengthy conversation, largely about prisoners and movies. Buddy stops under a highway overpass where they are to meet another former convict, Glenn Michaels, who waits with another car. When Foley gets out of the trunk, Karen immediately opens fire with the pistol her father had given her. Foley manages to slam the trunk lid shut trapping her inside. They let her out when she promises to give herself up. They put Karen in the car with Glenn; Buddy and Foley talk for a few minutes about what to do with Karen. Foley is attracted to her, but Buddy doesn't believe she shares his feelings. Glenn suddenly drives off leaving them both behind. Buddy and Jack return to Miami and go to Buddy's apartment. Foley draws a hot bath and relaxes. Karen appears, gun drawn and finds Foley in the tub. She looks him over briefly and moves in to arrest him when he suddenly opens his eyes and greets her. Karen wakes up in a hospital bed, her father next to her. He asks her what she was dreaming about and she asks him what she said. Her father says, \"Hey back.\" Karen had been unconscious for a brief time and recounts to her boss, Burdon, what happened: in the car with Glenn, Karen, remembering Glenn from a previous prisoner transfer, had persuaded Glenn to leave Buddy and Foley behind. Glenn had complied but an argument had broken out between them about what route to take. With both of them panicky, Karen had grabbed the steering wheel trying to force Glenn to take an exit on the highway. The car spun out of control, hit a water barrier and Karen hit her head inside the car. Karen's inexperienced boss is somewhat incredulous. At Buddy's apartment, Jack goes through the contents of Karen's purse, finding a picture of her father. Buddy tries to persuade Jack that they need to leave town immediately, however, Jack wants to see Karen one last time. Jack calls her at home and they have a short conversation. She suggest he turn himself in which Jack refuses to do. Buddy suddenly starts talking in the background and Karen recognizes his voice. Their need to escape even more serious, Jack hangs up. On the television is a report about a squatter's camp being raided; Lulu is among the dead. Jack realizes that Lulu could be tied to Chino; in prison, Jack had told Chino about his former wife, Adele, and where she lived. Jack also realizes that it won't be long before the US Marshal's Office finds Adele. Chino finds Adele's home and goes there, however, Karen has gotten there first and asks Adele if she knows of Jack's whereabouts. Chino starts pounding on Adele's door. Karen gets Adele to stall and when Chino breaks in, Karen arrests and cuffs him immediately. She calls Burdon and asks to be part of the task force looking for Buddy and Jack. Burdon refuses, so Karen asks him if he'll allow her on the team if she brings in Chino. At Buddy's apartment building, Burdon and his team close in on Buddy's apartment and Burdon makes Karen stand watch in the lobby. Buddy and Jack have already exited the room and head down to the parking garage in the elevator. The elevator stops at lobby-level and Karen catches a glimpse of Jack, who sees her also. Buddy and Jack make it to the car and leave. Jack and Buddy drive to Detroit, intending to catch up with a fellow inmate, Maurice \"Snoopy\" Miller. They also plan to find another former inmate, Richard Ripley, a wealthy businessman who'd been serving time for embezzlement. While incarcerated, he'd spoken to Glenn about a small fortune he had in uncut diamonds that he kept in his Detroit home. Glenn, however, didn't keep the information secret and Snoopy also intends to rip off Ripley as well. While driving in a limo around Detroit, Snoopy tells Glenn that he's taking over the operation of the heist. Glenn is initially resistant but quite intimidated by Snoopy. Snoopy also demands that Glenn accompany them on a job where they'll kill a transvestite who competes with Snoopy over drug-dealing territory. Glenn does so and the job turns out to be more violent and terrifying than he ever thought. He goes with Snoopy to the Kronk Gym where Jack and Buddy meet up with them. They all agree to meet at a boxing match the next night to discuss the plan to steal Ripley's fortune. Karen arrives in Detroit and talks to an associate about finding Jack. The agent, Raymond Cruz, in the midst of cleaning up the crime scene left by Snoopy and Glenn earlier in the day, tells her he'll get an address. Karen goes to Snoopy's home and talks to his sister, Moselle, who says she hasn't seen Maurice for several months but he may show up at the boxing matches at the State Theatre the next night. Also at the house is Kenny, Snoopy's brother-in-law. He corroborates Moselle's story and sends her to the store. After Moselle leaves, he tries to force himself on Karen, who hits him with a compact police baton and leaves. Back at her hotel, Karen fends off the advances of a few businessmen at the hotel bar, pointing out to one of them that she knows he's married. Foley quietly appears & they share a drink together. They go back to her room and have sex. Karen leaves the bed and begins to question Foley's motives in having sex with her. He assures her that he was not out for a one-nighter. In the morning, he's gone and has left the Sig-Sauer pistol he'd taken from her in Florida. Glenn goes with Maurice to the State Theatre where they watch boxing bouts. Glenn asks to be excused to use the mens room and quickly bolts out of the State and, while trying to hotwire the car Maurice had taken from him, finds Karen waiting for him. Glenn explains that he's really frightened of Maurice & just wants to get away from him. He also tells her that they're planning to rob Ripley's house. Karen lets Glenn go. Jack and Buddy case Ripley's house. While they sit in the car, Jack remembers meeting with Ripley at his Miami headquarters; in prison, Ripley had offered Jack a job with his corporation after he'd gotten out. Jack is angry to find out that Ripley expects him to take a lower-waged job as a security guard. Jack is furious, thinking Ripley owes him more because he'd protected him in prison. Ripley coldly counters by saying that Jack is a repentant criminal and not worthy of gainful employment. Jack is hustled out by security and walks toward the bank he robs in the first scene. After the fights at the State, Maurice, Jack, Buddy and Maurice's partners, Kenny and a hulking thug named White Boy Bob. Karen follows them. They drive to Ripley's mansion where Bob, posing as a plumber, forces himself in over the objections of Ripley's housekeeper, Midge. Maurice asks where Ripley is, Midge tells him he's in Florida for the winter. The crew forces her to take them to Ripley's safe in his bedroom. Maurice charges Foley with checking the other rooms in the house. In Ripley's closet, Maurice finds the safe behind some suits. He, Kenny & Bob try to shoot it open; before they can open fire on their second try, Midge tells them the combination is Ripley's birth date. When they get the safe open they only find Ripley's hairpieces. Maurice leaves the room, looking for Foley. Jack enters Ripley's office and finds Ripley on hold with 911. Buddy finds them both and Jack mentions that he knows that Ripley has hidden his stash of uncut diamonds in the large fish tank in the office. Jack has Buddy retrieve them and take them out to the van, believing they can slip away before Maurice finds them. Out at the van, Jack has an attack of conscience, believing that Maurice is going to kill both Ripley & Midge, possibly raping Midge first. he tells Buddy to take the diamonds and go. Buddy give him a pistol and drives off. Foley reenters the house and goes up to the bedroom. Kenny is in bed with Midge, forcing himself on her. When Foley calls to Midge, Kenny shoots through the door with his sawed-off shotgun, missing Foley. Foley rushes in and shoots Kenny dead, something he's never done before. As Foley makes his way back to the main staircase, he's stopped by Bob. Bob begins to trot up the stairs, trips, and kills himself when his pistol goes off under his chin. Maurice rushes to the scene, shooting at Foley. When they both run out of shots, they begin to fight, Maurice quickly gaining the advantage with his boxing skill. Foley finds Kenny's gun, Maurice seizes Bob's, but isn't faster than Foley, who shoots him dead. Karen also shows up, telling Jack to surrender. Jack, not wanting to go back to prison, wants Karen to kill him but she refuses, shooting Jack in the leg. Jack is tackled by another cop and handcuffed. Within a few days, Jack is due to be transported back to Florida to face charges associated with his escape from Lompoc. He's put into a van that Karen will also ride in. Before they leave another prisoner, Hejira (a cameo by Samuel L. Jackson), is also put into the van. Jack asks him where he got his name; \"Hejira\" is the Arabic term for the prophet Muhammed's 7th Century flight from Mecca. Hejira goes on to tell Jack that he's escaped from prison at least nine times. Jack thinks that Karen put Hejira into the van with him because they'd \"have a lot to talk about\" during the long drive to Florida. They drive off, Karen smiling in the front seat. (This summary of the movie is not long enough to be suitable as a synopsis. Please add more information to complete the synopsis.) The story revolves around the relationship between a career bank robber, Jack Foley (George Clooney), and a U.S. Marshal, Karen Sisco (Jennifer Lopez). They are forced to share her car trunk during Foley's escape from a Florida prison. After he completes his getaway, Sisco chases Foley while he and his friends - his right-hand man, Buddy (Ving Rhames) and Glenn (Steve Zahn) - work their way north to Bloomfield Hills, a wealthy northern suburb of Detroit. There they plan to pay a visit to shady businessman Ripley (Albert Brooks), who foolishly bragged to them years before about a diamond stash at his mansion. But a vicious criminal (Don Cheadle) who also spent time in jail with Jack and Ripley, is planning on hitting up Ripley's mansion with his crew, consisting of (Keith Loneker) and (Isaiah Washington), as well. The question of whether Sisco is really pursuing Foley to arrest him or for love adds to \"the fun\" Foley claims they are having.",
      "writers": [
         "Elmore Leonard",
         "Scott Frank"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120780/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0MjMwNTE4Nl5BMl5BanBnXkFtZTgwNjExNzQxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: George Clooney, Jennifer Lopez, Ving Rhames | See full cast and crew »"],
      "reviews": [
         "Ah, 1998\u0085 Bill Clinton was still in the White House, the Gulf War had no sequel, gas was under $2.00 a gallon, and a kinda-known actress was in her pre-J. Lo/Jenny from the Block/Bennifer/media whore phase. Back when she used to have a little (now she has a lot), Jennifer Lopez was actually enjoyable in Steven Soderbergh's 'Out of Sight.' I saw this in the theater when it came out and remember thinking it was one of the better films I'd seen that year. I watched it again last night on DVD, and I have to say that it still holds up. Clooney is finally given a worthy vehicle, and he and Lopez have actual, undeniable chemistry on the screen. The supporting players (especially the incomparable Don Cheadle) are perfectly cast. Soderbergh effortlessly knocks this one out of the park. One critic gave the film two and a half out of four stars and claimed 'Out of Sight' was in need of a 'shot of adrenaline,' but I have no idea where he's coming from. When you think of all the bad movies that are released in any given year, you'd think you'd appreciate something like this.",
         "When released in 1998, \"Out of Sight\" was Steven Soderburgh's most mainstream film to date, after he burst onto the indie scene a decade earlier with \"Sex, Lies, and Videotape\". Based upon the novel by Elmore Leonard (\"Get Shorty\", \"Jackie Brown\"), the movie tells the tale of odd couple Jack Foley (George Clooney), a career criminal, and federal marshall Karen Sisco (Jennifer Lopez). After a unique first encounter, their paths continue intersecting, with various degrees of intent, to comprise the bulk of the story. Similar to the Soderburgh-helmed \"Ocean's Eleven\", \"Out of Sight\" blends the standard apples and oranges of genres into a delicious smoothie. This is a drama, minus the driving intensity, light-hearted enough to pass as a comedy. It's a comedy, but not of the HAHA sort. The humor lies in things like Clooney's glances, JLo's relationship dilemmas, the paradox of Ving Rhames' self-righteous thief, and the sheer absurdity of Don Cheadle's gangsta. It's also a romance and a cop-and-robber story, but neither love nor crime is the whole point. All of these pieces unite to form a fantastic puzzle of a picture. The tasty complexity is further deepened by the non-linear storytelling technique. Flashing backward here and there throughout the film is a good choice because the viewer can only fully understand the previous events with the 20/20 vision of hindsight. Plus it eliminates what could have been a painful first half hour of exposition, instead spreading the backstory through the rest of the film. The stylistic singular color palettes for different locations that Soderburgh later used magnificently in \"Traffic\" are present here as well. From bright sun-drenched Florida to the ice cold blues of Detroit, this technique serves as virtual atmosphere, allowing one to determine the geography even without the convenience of titles. In a non-linear film like this, that ease in recognizing time and place facilitates comprehension of what is happening when. Unique among Soderburgh's work (to my recollection) is the film's use of occasional freeze frames. Stopping the picture for just a second or two, Soderburgh gently identifies poignant moments, obvious or not, allowing an extra moment to deservedly linger on them. With the high technical accomplishments, the acting almost doesn't matter, but the slightly understated method works wonders. Clooney is his usual suave self, complete with snappy dialogue and a cornucopia of confidence. In a role that \"Enough\" can only dream about, JLo almost looks like a real actress (joke). She is absent her too-common ditziness and easily holds her own, despite being a tad too glamorous. Rhames, Cheadle, and Albert Brooks are their usual solid selves, playing parts both similar and drastically different from their wheelhouses. Everyone seems to have perspective in their parts, not utilizing excessive gravity or levity, but rather hitting the appropriate notes as they inhabit their roles to perfection. Ultimately you believe all of these actors in their parts, even if JLo's skirts are entirely too short for a federal agent. Like \"Ocean's Eleven\", \"Out of Sight\" is a very good film, merging quality in all aspects of film-making into a fully enjoyable two hour experience. The main themes of crime and love are basic, so the movie doesn't soar to remarkable heights. But if you're looking for a brilliantly made film that you might have missed on its theatrical run, espy Out of Sight and settle in for a quirkily involving night. If you saw it a few years back, check it out again to see Soderburgh's foundation for his own excellence. Bottom Line: A wholly absorbing movie that serves as a film-making clinic of brilliance. 8 of 10.",
         "Wild and chaotic action/drama/comedy that was basically ignored by everyone in 1998, but was definitely one of the top ten films of the year. Bank robber George Clooney escapes prison one day and is tracked by a female federal marshal (Jennifer Lopez, in a very hot performance). There is definitely a chemistry between Clooney and Lopez that will lead to fireworks on more than one occasion. Clooney has teamed up with some crazed criminals for a jewel heist, but Lopez continues to track him relentlessly. \"Out of Sight\" is so full of, well, everything. It is packed with action, romance, drama, and some very black comedy. Clooney and Lopez do the best work of their careers. The supporting cast is super as well. Don Cheadle, Ving Rhames, Michael Keaton, Dennis Farina, and Albert Brooks all shine with the inventive screenplay and the top-notch direction. 4.5 out of 5 stars.",
         "'Out of Sight' is one of those rare films that can boast of having class in every department. The direction, script, cinematography, design and costumes disply such an acute and almost natural flair for bringing Elmore Leonard to the screen that it should be made illegal to film any of his novels without these people. But the acting is in a world of its own. Farina, Keaton, Rhames, Cheadle and Zahn all bring depth, comedy and intelligence to their roles. All are eclipsed however by the irresistable pairing of Jennifer Lopez and George Clooney. Clooney has finally managed to act without peering beneath his eyebrows and the effect is electric. This is the part he was born to play. His charisma is tangiable, but there is also a sense of fatalism whihc makes his character all the more compelling. Lopez, after her screaming shit-fits in the woeful 'Anaconda' proves that sexuality must also equal intelligence. Her Cisco is a mouth-watering mix of sass, beauty and cut-throat determination. It is one of those moments when you can actually see a star being born on screen. Put Clooney and Lopez together, and you have the type of chemistry with which executives have wet dreams over",
         "Great film. The characters seemed believable. The dialog well written, sharp, but not overly polished, no character has a monologue. How often in the 90's do we see a thriller, or crime mystery, or a buddy film, all components the film plays with, and would consider a discussion about the script? Leonard has a way with the practical aspects of crime, the fist fight and shoot outs are awkward, characters miss their mark more often than not, they run out of gas. How often in an action film does the hero miss a shot? I'm sick to death of wildly unbelievable stories, huge explosions and car chases. The photography is very well done and the soundtrack is fantastic. Of particular note is the editing, of which the film received an oscar nomination. One of the best love scenes in a contemporary film. What you hope you get with an adult crime movie, sleek, smart and sexy.",
         "Chemistry so hot that they ignite the screen. Too bad it didn't ignite the Box Office, but Out Of Sight is one movie both George Clooney and Jennifer Lopez can feel damn proud of. Maybe it's the fact that George's criminal character is *actually* funny and multi-dimensional. Maybe it's the fact that the storyline actually has a story to it - and an interesting one at that. Hell - maybe it's just that J.Lo walks around in skimpy outfits - curves flaunted - and likes to kick butt. After much consideration, I must concur: it's equal parts to all 3. Strong performances by Clooney (Jack) and Lopez (Karen), as well as George's Ocean's 11 co-star Don Cheadle. Witty script and likeable characters with a satisfying and plot-twisting ending. What more can you want? Did I hear you say Jennifer Lopez naked? Yeah well, you won't get that here... but it's good all the same!",
         "\"Out of Sight\" was one of the best movies of 1998, and yet it was ignored by moviegoers. I am amazed that most of George Clooney's movies fail, with the exception of \"Batman and Robin\" all of his films have been good. This film has good performances from a talented cast and great direction from an original story by Elmore Leonard. Highly reccomended.",
         "Steven Soderbergh knows his way around the bizarre, nearly impossible story lines and can translate them to film as few others can. OUT OF SIGHT is a little masterpiece of film-making despite the fact that when it initially screened in 1998 it seemed to slip by theatergoers' attention. Based on the inimitable Elmore Leonard novel the story begs indulgence in credible situations but shines in quality of script and characterization and an atmospheric cinematic capturing of a dark, film noir comedy drama that grabs you by the head and holds you glued to the screen for the duration. The story is rather simple on the surface - a jailed bank robber escapes with the help of his buddy and plans a major hit only to encounter a federal agent in pursuit of the two who becomes the love interest portion of this strangely convoluted tail. Subplots and sidebars are sprinkled throughout Soderbergh's telling of Leonard's story, serving to keep our minds alert and mesmerized by the plot development. The cast is absolutely first rate with George Clooney, Jennifer Lopez and Ving Rhames especially pungent in roles that seem written for them. The strong supporting cast includes such fine actors as Steve Zahn, Catherine Keener, Don Cheadle, Luis Guzman , Isaiah Washington, Dennis Farina, and Albert Brooks. And for those who enjoy powerful sexual chemistry Clooney and Lopez offer some of their finest collaborative acting. This is a fine movie and one that doubtless in time will be considered and under appreciated Film Classic. Grady Harp",
         "I, too, had a little trouble buying that such an intense relationship was born from such a minor conversation between them in the trunk. However, when I was able to get past that inconsistency in the plot, I found a great movie. Clooney and Lopez have great chemistry and show that they are both actors worthy of recognition. I loved the editing--the choppy cuts and the freezing of certain scenes. And I have never seen a better seduction scene in my life. The supporting cast was great too, especially the incomparably zany Steve Zahn. And once I got past the improbability of the relationship being so intense that she would risk her career for it, I thought that the way that she did risk her career was just great. I laughed out loud at the scene when he waves to her from the elevator. That is just a wonderful illustration that not everything is clear-cut or easy to do. Clooney was phenomenal, so cool...and just resigned to his life. I loved it. By the way, seeing this movie after Jennifer Lopez has launched her career in pop music simply infuriated me that Hollywood has all but lost a true talent to the world of bubblegum pop.",
         "\"Out Of Sight\" is a crime thriller which neatly combines action, comedy and romance with dialogue which is sharp, scintillating and witty and characters who are fascinating to watch. The humour is extremely enjoyable, the action is full of surprises and the characters, with their various flaws and weaknesses provide the movie with its strongest element. Jack Foley (George Clooney) is a bank robber extraordinaire who's spent too much of his life in prison. His modus operandi involves the use of charm and intelligence rather than guns and masks but when his getaway car fails to start after his latest robbery, he soon finds himself incarcerated in a Florida prison. He joins some other inmates in a jail break but is suddenly confronted by Federal Marshall Karen Sisco (Jennifer Lopez) who threatens to shoot him if he continues. Fortunately, Jack's friend Buddy Bragg (Ving Rhames) had also been waiting for him outside the prison and quickly bundles Karen and Jack into the trunk of his car before driving off at great speed. Surprisingly, during their time together in this exceedingly confined space, the couple develop a certain rapport and it's quickly evident that there's a strong attraction between them. During his time in prison, one of Jack's fellow inmates was Richard Ripley (Albert Brooks), an ex-Wall Street man who'd been convicted for being involved in insider trading. He'd openly told others in the prison about the $5 million worth of uncut diamonds that were hidden in his mansion in Detroit, so after the jail break, some of the escapees make their way to Detroit with the intention of robbing Ripley's house. Jack, having reached a point in his career where he felt that he could never face another spell in jail, decides to take part in the robbery as it could provide him with one last big pay day before he retires from his life of crime. Karen, however, is determined to stay on his trail and their confrontation at the Ripley mansion turns out to be both tense and unpredictable. Jack and Karen are both repeat offenders. He's had a long career of robbing banks and spending time in prison and Karen has consistently been attracted to the guys who she should be bringing to justice. They're both intelligent but also have lapses where their normally good judgement fails them. Getting involved with each other is dangerous for Jack and unprofessional for Karen. Jack also aims to profit from one last job although, by his own admission, he's never known of any criminal who's successfully achieved such a thing. Clooney and Lopez are both very good individually and sensational together as they so powerfully convey the intensity of their mutual attraction. The supporting cast are also top class. Ving Rhames is superb as Jack's good friend whose weakness is his regular need to confess his wrongdoings to his sister. Don Cheadle is faultless as a vicious ex-boxer and ruthless murderer and Steve Zahn is funny and convincing as a slurring stoner who's not very bright and also totally unreliable. \"Out Of Sight\" is a witty and offbeat film and the style of Steven Soderbergh's direction reflects this perfectly. The story about two opposites who attract each other is presented with great originality and the finished product is so engaging and enjoyable that it becomes one of those movies for which repeat viewings become irresistible."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Jersey Films"
      ],
      "summaries": [
         "A career bank robber busts out of jail (Clooney) with the help of his buddy (Rhames) and kidnaps a US Marshal (Lopez) in the process. When the two cons head for Detroit to pull off their final big scam, the Marshal is put on their case but she finds she is attracted to one of them and has second thoughts about bringing them in.",
         "George Clooney stars as Jack Foley, a bank robber who escapes from prison, attempts to rob a tycoon (Brooks), and seduces the female marshal (Lopez) out to capture him.",
         "A career bank robber breaks out of jail and shares a moment of mutual attraction with a US Marshall he has kidnapped."
      ],
      "budget": 48000000
   },
   "movielensId": 1912,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-26",
      "dvdReleaseDate": "1999-05-04",
      "directors": ["Steven Soderbergh"],
      "runtime": 123,
      "movieId": 1912,
      "title": "Out of Sight",
      "mpaa": "R",
      "actors": [
         "George Clooney",
         "Jennifer Lopez",
         "Ving Rhames",
         "Don Cheadle",
         "Albert Brooks",
         "Steve Zahn",
         "Isaiah Washington",
         "Dennis Farina",
         "Luis Guzmán",
         "Keith Loneker",
         "Catherine Keener",
         "Nancy Allen",
         "Michael Keaton",
         "Viola Davis",
         "Samuel L. Jackson",
         "Paul Calderon"
      ],
      "imdbMovieId": "0120780",
      "originalTitle": "Out of Sight",
      "genres": [
         "Romance",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["A_GOrRyhABg"],
      "plotSummary": "Meet Jack Foley, a smooth criminal who bends the law and is determined to make one last heist. Karen Sisco is a federal marshal who chooses all the right moves … and all the wrong guys. Now they're willing to risk it all to find out if there's more between them than just the law. Variety hails Out of Sight as \"a sly, sexy, vastly entertaining film.\"",
      "tmdbMovieId": 1389,
      "avgRating": 3.65688,
      "releaseYear": "1998",
      "numRatings": 8787,
      "posterPath": "/hSL2Ta4ErgAxPEOlkkxZmrTSAET.jpg"
   }
}