{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120321",
      "video": false,
      "title": "Smoke Signals",
      "recommendations": [
         241432,
         42914,
         34101,
         228109,
         63848,
         168128,
         76800,
         44783,
         54602,
         7015,
         27984,
         25576,
         42011,
         265347,
         26195,
         16560,
         39806,
         59728,
         138202,
         17435
      ],
      "backdrop_path": "/hulJN91yFGDNlKbEtjainvV3nga.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe43fec3a368484e009935",
               "name": "Adam Beach",
               "profile_path": "/83RxYduQiVZ19iJn4sC66jO38KL.jpg",
               "id": 33527,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43fec3a368484e009939",
               "name": "Evan Adams",
               "profile_path": null,
               "id": 203677,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "52fe43fec3a368484e00993d",
               "name": "Irene Bedard",
               "profile_path": "/eUX06X7ZpioIO7rHRsaAyNzL646.jpg",
               "id": 65529,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Arnold Joseph",
               "gender": 2,
               "credit_id": "52fe43fec3a368484e009941",
               "name": "Gary Farmer",
               "profile_path": "/iiIgfaFmsL1zqXozZtAqygXpYvy.jpg",
               "id": 15439,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Arlene Joseph",
               "gender": 1,
               "credit_id": "52fe43fec3a368484e009945",
               "name": "Tantoo Cardinal",
               "profile_path": "/pWQi9e8gUGdie0ZFWdcQtUpUQRw.jpg",
               "id": 7863,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Young Victor Joseph",
               "gender": 2,
               "credit_id": "52fe43fec3a368484e009949",
               "name": "Cody Lightning",
               "profile_path": null,
               "id": 60918,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Young Thomas Builds-the-Fire",
               "gender": 2,
               "credit_id": "52fe43fec3a368484e00994d",
               "name": "Simon Baker",
               "profile_path": "/kKf3bmcbh777w1TLtwA9Fe7UtSS.jpg",
               "id": 211568,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Grandma Builds-the-Fire",
               "gender": 0,
               "credit_id": "52fe43fec3a368484e009951",
               "name": "Monique Mojica",
               "profile_path": null,
               "id": 1185589,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Randy Peone",
               "gender": 0,
               "credit_id": "52fe43fec3a368484e009955",
               "name": "John Trudell",
               "profile_path": "/8IAfDyiz8rgvWPl7qthtGZqJ28q.jpg",
               "id": 237532,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Lucy",
               "gender": 0,
               "credit_id": "5521b71fc3a3684dda004377",
               "name": "Elaine Miles",
               "profile_path": "/dr36XewgaopW4wVoQAmfnUSGHhs.jpg",
               "id": 1236658,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Junior Polatkin",
               "gender": 2,
               "credit_id": "562a2bef925141285700203f",
               "name": "Michael Greyeyes",
               "profile_path": "/bYWIwMx1yzDwbkAGriEJF0gWyBP.jpg",
               "id": 154647,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43fec3a368484e00995b",
               "name": "Sherman Alexie",
               "profile_path": null,
               "id": 1201090,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fec3a368484e009961",
               "name": "BC Smith",
               "profile_path": null,
               "id": 42304,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fec3a368484e009967",
               "name": "Brian Berdan",
               "profile_path": null,
               "id": 3189,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54535bc90e0a2648d2000efd",
               "name": "Chris Eyre",
               "profile_path": "/4CYFLwcINhiSn8kUmIxqo6muLMC.jpg",
               "id": 1232592,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5aa51f5e0e0a26076001f013",
               "name": "Melissa Matthies",
               "profile_path": null,
               "id": 1995909,
               "department": "Art",
               "job": "Property Master"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.540605,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 20862,
      "vote_count": 33,
      "budget": 0,
      "overview": "Young Indian man Thomas is a nerd in his reservation, wearing oversize glasses and telling everyone stories no-one wants to hear. His parents died in a fire in 1976, and Thomas was saved by Arnold. Arnold soon left his family, and Victor hasn't seen his father for 10 years. When Victor hears Arnold has died, Thomas offers him funding for the trip to get Arnold's remains",
      "similar": [],
      "original_title": "Smoke Signals",
      "runtime": 89,
      "poster_path": "/dZ6smtO2cEm3nxVhWscYfKS0mYX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ShadowCatcher Entertainment",
            "id": 12269,
            "origin_country": ""
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-16",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Chris Eyre"],
      "runtime": 89,
      "synopsis": "Smoke Signals is a humorous yet serious story about Victor, a young man who Director Chris Eyre describes as \"trying to forgive his father.\" The movie gives us a glimpse into the contemporary Native American world, and is created by an almost exclusively Native American cast. The story begins with a glimpse of two baby boys, one barely rescued from a fire which consumes his parents. We briefly see them grow up and learn of the tension between them. They are opposites. The rescued orphan boy Thomas becomes a naive but positive nerd with over-sized glasses, while Victor - who is to embark on a journey of forgiveness towards his father - is proud of his Native American stoicism and seems to find pleasure in confrontation. Victor's father left when he was a boy, and he now learns that his father just died, and his mother sends him to collect the ashes. He is only able to make the trip with Thomas' help, however, and there is a condition which is difficult for him to accept: Victor must swallow his pride and take Thomas with him. The young men are as different as potatoes and strawberries, and through their tension and close proximity they learn from one another - about the world, about Victor's father, and most of all - about themselves. It is an enjoyably paced sentimental and funny film, which gives viewers a look into the Indian culture, and of course - themselves.",
      "writers": [
         "Sherman Alexie",
         "Sherman Alexie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120321/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MjU1NTg0NF5BMl5BanBnXkFtZTgwODYwMDQ1MjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Adam Beach, Evan Adams, Irene Bedard | See full cast and crew »"],
      "reviews": [
         "Smoke Signals is a somewhat misunderstood film. The setting on an Indian reservation leads viewers to believe that Smoke Signals is about Indian issues or Indian philosophy. To be sure, the presence of Indian values and culture make this movie decidedly more enjoyable, but the movie is more transcendent, more universal than a purely Indian film. And, while this was heralded as the first movie to be written, directed and co-produced by Native Americans, there is something here for everyone, regardless of ethnicity. More than anything else, this movie appealed to me as a writer. Taken from Sherman Alexie's brilliant collection \"The Lone Ranger and Tonto Fist Fight in Heaven\". it is beautifully written and expertly crafted from beginning to end. The first scene, narrated lyrically by Evan Adams as Thomas Builds-the-fire, sets the tone for a story handed down, as with Native American culture, in true oral tradition. The French title, Le secret des cendres (The secret of the ashes) more accurately describes the book and the movie, both of which must be experienced to fully appreciate Alexie's genius. With multiple allusions to fire and ash, each having different meanings, as well as a well integrated use of Native American lore, Smoke Signals requires more than a little thought for the average American viewer. The story revolves around two young Coeur d' Alene Indian men dealing with loss and the end of childhood innocence. The two men cope with loss in very different ways; Thomas though mysticism and legend, Victor through stoicism and denial. When Victor Joseph, brilliantly played by Adam Beach, learns that his estranged father has died, he and Thomas embark on a journey to claim the ashes, another allusion of the french title, and on the way get in touch with their identities as adults apart from their parents. Evan Adams is stupendous as Thomas Builds-the-fire. His storytelling scenes are pure magic. By imbuing simple memories with mystical reverence, he elevates them, and thus both himself and his listeners, to a new spiritual level. His exaltation of the ordinary is the core of this delightful work of genius. It culminates with a reading, slightly modified, of Dick Lourie's poem \"Forgiving Our Fathers\". Lourie, who is a self-described unreconstructed beatnik poet, brings a fragile and elegant beauty to the film's emotional climax. The final scenes, driven by Adams' narration and haunting Native American chant and music, are nothing short of miraculous. Adam Beach, strapping and stalwart as Victor Joseph, managed to parlay his appearance in Smoke Signals into a respectable film career. Evan Adams, diminutive and shy as Thomas Builds-the-fire, was not so lucky despite his masterful performance. Perhaps Admas' aspirations ran along different lines, as these days, even after starring in what is basically a sequel (The Business of Fancydancing, also by Alexie) Adams can now be called Dr. Adams, as he has become a respected and accomplished physician in British Columbia. The supporting cast was equally magnificent, and each lends credibility and energy to the movie. An interesting sidenote is that Irene Bedard, who appears as Suzy Song, was the physical model for Pocahontas in the Disney animated feature. I have seen this movie many times, and will undoubtedly watch it many more. Each time I am left in silent awe as I reflect on my own life, family, and philosophies.",
         "The eyes of cinema has always seen Indians only as the bad guys. The ones that shoot their arrows, wear feathers on their heads, and yell as they chase the heroes down. Finally, after 100 years of movies, we get a film that honestly portrays the Native American culture.  And man, it sure is refreshing. The story opens on the Fourth of July, 1976 in a small Idaho Indian reservation. A small infant named Thomas Builds-the-Fire is thrown out of the window of a burning house and is caught by Arnold Joseph (Gary Farmer), a neighbor with a drinking problem, who is later kicked out of the house by his wife, leaving behind his son, Victor (Adam Beach). Arnold eventually settles down in Phoenix and his family never hears from him again. 20 years later, a phone call comes. It's from a woman in Phoenix, she says that Arnold is dead. Victor, who had developed a resentment towards his father over the years, decides that he should travel to Phoenix to pick up his ashes. Unfortunately, he has no money to get there... but Thomas does and offers to pay if he can come along with Victor. This is a tough decision for Victor since he never really liked Thomas, but he finally agrees and the two set off on their journey. It's during their journey that we learn about the characters, Victor and Thomas' conversations reveal their attitudes towards Americans their views of Native Americans. In one scene, Victor accuses Thomas of learning everything about being an Indian from watching Dances With Wolves. In another funny sequence, the two begin talking about cowboys and end up singing a tune about John Wayne's teeth! Victor's resentment for his father is also revealed to us through flashbacks depicting the early years and the memories (some good, some bad) that the two shared. They do eventually arrive in Phoenix and find the woman that called with the news of Arnold's death. Victor talks with her during the night and finds out how much his dad cared for him and how he never wanted to leave the reservation in the first place. The events that follow drastically alter Victor's perceptions of his father forever. Smoke Signals is a great film and one that can teach you a lot about a culture so often misrepresented on the screen. There is a feeling of ease and casualness in the conversations between Victor and Thomas... slowly they reveal more and more of themselves to us, in a way that is so nonchalant that we understand their feelings it without even noticing it. Smoke Signals is well worth your time and offers a refreshing alternative to the big budget, special effects driven crap this summer.",
         "\"Smoke Signals\" is one of the most unique movies I have ever seen. From the combinations of stories, characters, and filmmaking. The acting in this movie was witty, funny, serious and heartbreaking all at the same time. Even though this is a movie about Native American culture, it is a movie that talks to everyone no matter what there ethnic background may be. I am of Italian heritage but this movie still got to me. It tackles issues of family, culture, and tradition as well as friendship. The acting is this movie is superb and the filmmaker's shots and different ways of filming scenes and how each one flowed into another was amazing. In school we had to read some stories by Sherman Alexie and then we watched the movie. If it weren't for my English teacher I may have missed watching one of the most brilliant independent films ever made.",
         "Smoke Signals (the efforts of Sherman Alexie, Chris Eyre and the cast of fabulous actors) shows in rich, humorous detail what life is like for young Indians today. It is an insider's view of reservation basketball games and the rituals of frybread. Its characters don't bring themselves (and the story) down with self pity. Instead they look to the lighter side of history with references to Columbus and Gen. Custer. The story is simple. Two young men, Victor and Thomas, embark on a trip to Phoenix to retrieve the ashes of Victor's father. Victor is angry at his father for leaving his family and angry with himself for the grudge that he carries. Through the help of Thomas and his father's final friend Suzy, Victor is able to find resolution and peace. The acting, particularly Gary Farmer as Arnold Joseph (Victor's father) and Evan Adams (Thomas Builds-the-Fire) are outstanding. In fact, I had to see it a second time to catch all the plot because Evan Adams completely stole the show for me!",
         "My young grandniece and nephew were visiting with me during the Christmas holidays several years ago and we rented this movie from the local library. Without a doubt, it was excellent. I wanted them to see a movie with various role models, and as I had never seen this movie, I thought it would be a treat for all of us. I especially liked Thomas and his stories. Stories are an important part of growing up in all cultures. We can learn about customs of various groups through them, as well as learn a lot about ourselves, as human beings. I felt that the problems that the young man was encountering with his father are relevant to all people, young and old, and if they are not resolved, unfortunately, those problems hinder personal growth. This film was not only entertaining, but thought-provoking as well. Well done!",
         "This film did not get the attention it deserved. When I first heard about a film made by Native Americans, I was afraid it would be an exercise in political correctness. But the ethnicity of the characters took a back seat to the universal themes of friendship and learning to come to terms with one's past. This is one of the greatest \"buddy movies\" ever made. A couple of years after I saw it I drove through the American Southwest for the first time, and images of the film kept coming into my head. This is a film which really stays with you.",
         "I have read some of Sherman Alexie's work, although admittedly not \"The Lone Ranger and Tonto Fistfight in Heaven.\" I don't want to ruin a movie that I enjoyed so thoroughly by loving the book more. In any case, I think that this film is largely misunderstood. Non-Indian people tend to look at this film as a \"coming of age\" story about finding Victor finding not only his father, but himself as well. Yes, that's there, but there is so much more. For example: the very real and very sad quality of life on the rez. The ones who are fortunate enough to have a car don't care if it drives in reverse only. The kids watch their parents drinking, and often grow up to drink with them. Alcoholism is a very real disease that affects everyone associated with an alcoholic...and it runs rampant throughout many reservations. Imagine knowing that once you had so much, and now are only allotted a certain patch of a certain number of acres; imagine knowing that more than half of your history was oral tradition and people made you stop speaking your native language. Imagine the elders watching the children grow up to try to be white and fail, and imagine them watching their history slip away with every word or nuance forgotten. Imagine the desperation of a people as a whole and individually to have so much and really have nothing at all. That, I believe, is the underlying theme in Smoke Signals. The title alone is a cryptic message from Alexie: smoke signals were used to communicate across open plains, plains now destroyed and whithered as though a fire raged across them, which it did in the form of the white man. Victor's father died in a fire, perhaps sending his spirit up in the form of a smoke signal to his gods. And Thomas' narration at the beginning is about children born of fire and ash. Watch this movie again and again, and see how so many suffer...",
         "I lived where this was filmed and really enjoyed the movie for the content and the location. The inside jokes about being Indian were great and since I no longer live on the reservation it reminded me of home. The story was believable and the actors brought it to life. I had to call my brother and tell him to watch it again and look closer at the end credits and background of the film, it is wonderful. Congratulations to the Cast & Crew.",
         "\"Smoke Signals\", the first film written, directed and starring American Indians, delineates the contemporary Native American experience with a soulful wit and an incisive attitude. It's setting is the Coeur d' Alene Indian Reservation in Idaho where the K.R.E.Z. disc jockey(Broadcasting live from his trailer) proclaims the morning 'a great day to be indigenous'. The film's focal character, Victor(Adam Beach) is a closed-off youth with indiscernible ambition. He languishes around the expansive grounds dwelling over the absence of his father and a perceived lack of opportunity. \"Smoke Signals\" details the strange dynamics of Victor's friendship with childhood pal Thomas Builds-a-Fire(Evan Adams) who frequently regales the locals with his practiced storytelling skills. Victor is stoic and athletic, with an affected warrior look. Thomas is unnervingly talkative with a smiling naivete and a decidedly bookish appearance.(Thomas also serves as the film's narrator) Novelist Sherman Alexie wrote the script. It is based on stories from his book \"The Lone Ranger and Tonto Fistfight in Heaven\". He uses a casually irreverent humor to help tell his tale of personal and national identity. In a brief scene with his mother, Victor kids- 'What do you want a contract? You know how Indians feel about signing paper'. And later Thomas recounts how Victor's dad almost spent time for protesting the vietnam war only to have the charge plea-bargained to 'being an Indian in the twentieth century.' The movie's interesting cultural details(Fry bread, the significance of long hair, etc.) and salient dialogue accentuate it's themes of truth, self-acceptance, and the capacity to forgive. The cinematic structure is equally impressive. Director Chris Eyre employs several unsuspecting flashbacks to reveal the film's central secret. Victor and Thomas's present journey for answers alternates seamlessly with the lyrical recollections of the past. (Possible spoiler) In the end, the determined Thomas helps his friend come to terms with his father, his ancestry, and his exclusive place in life. The understanding Victor gains enables him to liberate the persistent bitterness and disappointment from his world. \"Smoke Signals\" deserves a look for those who missed it's theatrical run. It presents viewers with a caring and poignant glimpse into life on a reservation and the unique perspective of today's Native Americans. Kurt",
         "This is one of my favourite movies and it's just wonderfully acted, directed, produced, and scored. What can I say except don't rent it, buy it! This movie is all about human emotions and Adam Beach and Evan Adams did an unforgettable acting duty as Thomas and Victor. It's a film for the ages. A classic and one that is unfortunately, missed by many. Don't be one of those folks that pass this movie because of its \"lack of explosions, cgi, or american actors\"... Smoke Signals makes you open up your mind, body, and soul. At least for the 100 or so minutes it's running... then the rest is up to you."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "ShadowCatcher Entertainment",
         "Welb Film Pursuits Ltd."
      ],
      "summaries": ["Young Indian man Thomas is a nerd in his reservation, wearing oversize glasses and telling everyone stories no-one wants to hear. His parents died in a fire in 1976, and Thomas was saved by Arnold. Arnold soon left his family (and his tough son Victor), and Victor hasn't seen his father for 10 years. When Victor hears Arnold has died, Thomas offers him funding for the trip to get Arnold's remains, but only if Thomas will also go with him. Thomas and Victor hit the road."],
      "budget": 2000000
   },
   "movielensId": 1914,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-16",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Chris Eyre"],
      "runtime": 89,
      "movieId": 1914,
      "title": "Smoke Signals",
      "mpaa": "PG-13",
      "actors": [
         "Adam Beach",
         "Evan Adams",
         "Irene Bedard",
         "Gary Farmer",
         "Tantoo Cardinal",
         "Cody Lightning",
         "Simon Baker",
         "Monique Mojica",
         "John Trudell",
         "Elaine Miles",
         "Michael Greyeyes"
      ],
      "imdbMovieId": "0120321",
      "originalTitle": "Smoke Signals",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["z4GthKmraXQ"],
      "plotSummary": "Young Indian man Thomas is a nerd in his reservation, wearing oversize glasses and telling everyone stories no-one wants to hear. His parents died in a fire in 1976, and Thomas was saved by Arnold. Arnold soon left his family, and Victor hasn't seen his father for 10 years. When Victor hears Arnold has died, Thomas offers him funding for the trip to get Arnold's remains",
      "tmdbMovieId": 20862,
      "avgRating": 3.81093,
      "releaseYear": "1998",
      "numRatings": 2872,
      "posterPath": "/c5V2kBkQuzpN7DU9mIyfGv7CMRz.jpg"
   }
}