{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "world war i",
            "id": 2504
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "battlefield",
            "id": 10141
         },
         {
            "name": "aerial combat",
            "id": 10237
         },
         {
            "name": "dogfight",
            "id": 10399
         },
         {
            "name": "warfare",
            "id": 33638
         },
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "u.s. military",
            "id": 185454
         },
         {
            "name": "fighter pilots",
            "id": 234078
         }
      ],
      "imdb_id": "tt0018578",
      "video": false,
      "title": "Wings",
      "recommendations": [
         65203,
         42861,
         43277,
         43278,
         33680,
         56164,
         25430,
         33667,
         12311,
         939,
         43266,
         34106,
         1405,
         17661,
         28963,
         23383,
         28580,
         143,
         3060,
         31835
      ],
      "backdrop_path": "/ca3BH6Hmtgn8oDyl2lauC6vDlkF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary Preston",
               "gender": 1,
               "credit_id": "52fe45bec3a368484e06c7a7",
               "name": "Clara Bow",
               "profile_path": "/7gOHaHU9DQStFtCwf8j3XAnAG8r.jpg",
               "id": 102499,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jack Powell (as Charles Rogers)",
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7ab",
               "name": "Charles 'Buddy' Rogers",
               "profile_path": "/x5pqEDv8NB5B1bjcuB6Am1WJnoA.jpg",
               "id": 102500,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "David Armstrong",
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7af",
               "name": "Richard Arlen",
               "profile_path": "/8aj00UfI8CFZ75tGR2TkfpRqJz9.jpg",
               "id": 29760,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sylvia Lewis",
               "gender": 1,
               "credit_id": "52fe45bec3a368484e06c7b3",
               "name": "Jobyna Ralston",
               "profile_path": "/eWls522FZVUv1xMsZfzqNbkcPUM.jpg",
               "id": 102501,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Herman Schwimpf",
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7bb",
               "name": "El Brendel",
               "profile_path": "/rxkDzQqD28gqvFGo0HrYfjCx1FJ.jpg",
               "id": 102502,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Air Commander",
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7bf",
               "name": "Richard Tucker",
               "profile_path": "/knGS2fF9Df9CSqJdj2RKMkN70qz.jpg",
               "id": 14290,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Cadet White",
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7b7",
               "name": "Gary Cooper",
               "profile_path": "/zVUK71x5IoBaJ5H9dTgE2CRmLKy.jpg",
               "id": 4068,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "The Sergeant",
               "gender": 0,
               "credit_id": "5a4fef5b0e0a26369a000010",
               "name": "Gunboat Smith",
               "profile_path": null,
               "id": 1568496,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Lieutenant Cameron",
               "gender": 0,
               "credit_id": "574e050cc3a368578b000012",
               "name": "Roscoe Karns",
               "profile_path": "/8K65O6N0qtgus9cdvBIdfmAEKJ2.jpg",
               "id": 30157,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Mrs. Armstrong",
               "gender": 1,
               "credit_id": "574e0541c3a368578e00001b",
               "name": "Julia Swayne Gordon",
               "profile_path": null,
               "id": 1033217,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Mr. Armstrong",
               "gender": 2,
               "credit_id": "574e054fc3a3685789000022",
               "name": "Henry B. Walthall",
               "profile_path": "/hlkLPAMMdJRTYtcV2I54ivUTuRW.jpg",
               "id": 8830,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Celeste",
               "gender": 1,
               "credit_id": "5a4fefb79251414a0300004b",
               "name": "Arlette Marchal",
               "profile_path": null,
               "id": 1095828,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Peasant (uncredited)",
               "gender": 2,
               "credit_id": "59451c6c9251413ff400f4e4",
               "name": "Nigel De Brulier",
               "profile_path": "/dSat7OeGS4bTrpwLZFnchCsc8vO.jpg",
               "id": 34047,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Mrs. Powell (uncredited)",
               "gender": 1,
               "credit_id": "5a4ff1e0c3a3681bca000202",
               "name": "Hedda Hopper",
               "profile_path": "/iEptinn7n4WaxGXkje3TIW6sEUP.jpg",
               "id": 8637,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Mr. Powell (uncredited)",
               "gender": 2,
               "credit_id": "5a4ff1fcc3a3681bca000228",
               "name": "George Irving",
               "profile_path": "/js2u7KGDeYSKf4eOrVQJxDPfaUP.jpg",
               "id": 13823,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Doughboy (uncredited)",
               "gender": 2,
               "credit_id": "5a4ff227c3a3681b9e000270",
               "name": "William A. Wellman",
               "profile_path": "/m0RSN7IQTXF9ZFUrqoZJUzZqu02.jpg",
               "id": 14643,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7c5",
               "name": "William A. Wellman",
               "profile_path": "/m0RSN7IQTXF9ZFUrqoZJUzZqu02.jpg",
               "id": 14643,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7cb",
               "name": "John Monk Saunders",
               "profile_path": null,
               "id": 102503,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7d1",
               "name": "Harry Perry",
               "profile_path": null,
               "id": 102504,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7d7",
               "name": "John Monk Saunders",
               "profile_path": null,
               "id": 102503,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bec3a368484e06c7dd",
               "name": "John Stepan Zamecnik",
               "profile_path": null,
               "id": 1192628,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45bec3a368484e06c7e3",
               "name": "Edith Head",
               "profile_path": "/63ZeXQOh26sGa8nTbYWntieyWrz.jpg",
               "id": 4350,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 9.201543,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28966,
      "vote_count": 72,
      "budget": 2000000,
      "overview": "Two young men, one rich, one middle class, both in love with the same woman (Jobyna Ralston), become US Air Corps fighter pilots and, eventually, heroic flying aces during World War I. Devoted best friends, their mutual love of the girl eventually threatens their bond. Meanwhile, a hometown girl (Clara Bow) who's the lovestruck lifelong next door neighbor of one of them, pines away.",
      "similar": [
         143,
         269,
         27123,
         2841,
         507,
         1628,
         6418,
         11222,
         337,
         662,
         234567,
         5698,
         17700,
         393729,
         31135,
         12197,
         3060,
         25126,
         50081,
         964
      ],
      "original_title": "Wings",
      "runtime": 141,
      "poster_path": "/a5z7gCR1xLikOJK3WYXIoXoo9Xi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Paramount Famous Lasky Corporation",
         "id": 33333,
         "origin_country": ""
      }],
      "release_date": "1927-08-12",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Youth, hitting the clouds! Laughing at danger! Fighting, loving, dodging death! That's",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "William A. Wellman",
         "Harry d'Abbadie d'Arrast"
      ],
      "runtime": 144,
      "synopsis": null,
      "writers": [
         "John Monk Saunders",
         "Hope Loring"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0018578/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzY5Nzk5NzA3M15BMl5BanBnXkFtZTgwMzA5NzM2MzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Clara Bow, Charles 'Buddy' Rogers, Richard Arlen | See full cast and crew »"],
      "reviews": [
         "Wings (1927), is not only the FIRST winner of the Best Picture Academy Award, it may be the BEST film to hold that title, and I say that knowing that Casablanca, Gladiator, and The Last Emperor all hold the statue too. There have been some stinkers dubbed \"Best Picture\" in the past, (Shakespeare in Love beating Saving Private Ryan??? The Greatest Show on Earth over High Noon?! Spare us all) but this is not one of them. Even supporters of the film, writing reviews here at IMDb, can't seem to resist taking shots at Wings' plot, but I'm here to tell you it is just fine, even solidly written. Some reviewers don't sound like they have seen this movie in a long time, or if they have, they slept through it. For one thing, the \"Love Triangle\" is not as convoluted or hard to grasp as others have implied: Jack Powell (Buddy Rogers) has a crush on one Sylvia Lewis (Jobyna Ralston), the local beauty queen. She finds this cute and indulges it a little bit--actually too much. But she is quite sincerely in love with someone else, David Armstrong (Richard Arlen) a well-off local boy who isn't quite able to figure out how to tell Jack to butt-out because it doesn't involve money. The wild card in all of this (literally and figuratively) is Mary Preston (Clara Bow), who lives next door to Jack and has been mooning over him since she was a little girl. That's the whole dynamic. I have no idea what someone was thinking when they suggested Mary expressed any feelings for David (She never does). Some have said they can't believe Jack would go for Sylvia with Mary next door. I see their point, because the casting of Clara Bow in her role is like having Kirsten Dunst living next door and not noticing. The problem is, Jack isn't SUPPOSED to notice Mary until the end, when he has experienced the war and realizes that everything he wants is right there at home where he belongs. In the beginning he is all about Fast Cars and the Trophy Girls. So, the plot thickens as the US gets dragged into World War I and both Jack and David sign up as pilots. Naturally each of them heads to Sylvia's house to say good-bye. Sylvia prepared a locket with her picture in it for David, but Jack sees it first. This scene is a great display of awkwardness wrapped in etiquette, especially when Sylvia tries to let go of Jack's hand. Jack takes the locket from her, and, this being more than she can stand, Sylvia almost gets the words out to tell him the truth when David gets there. At this point Jack turns on the macho-factor, and he is so gleeful about rubbing Sylvia's locket in David's face that he doesn't even notice she never kissed him good-bye. Sylvia makes up for David's loss of the locket with some tender words and some passionate kissing--no mystery where her feelings lie--and the three of them head off for war. Three, because Mary goes too, as a nurse. Another complaint about this film and it's plot has been that Clara Bow wasn't given enough to do, shunted off into a side part even though she got billing as the Leading Lady, but I just don't see it. Her part was as big as any Romantic Interest in most movies out there; a good example for comparison would be Kathleen Quinlan's roll in Apollo 13. Most of her scenes were not shared with Tom Hanks, but she turned in an emotional and Oscar-nominated performance nonetheless. The air battles in this film have never been topped anywhere. Ever. And that includes anything involving aliens, fighter jets, or a galaxy far, far, away. The information that the actors flew their own planes is misleading. Actors couldn't do what these pilots do. The stunt flying is by the US Army Air Corps in Texas (!) where the movie was filmed (I dare you to have guessed that on your own). What Rogers and Arlen do is all their own close-ups, flying the plane as they careen and dive. When the camera ran out of film (or the planes ran out of gas) a stunt pilot from the Army would pop up and land the plane. The resolution of the story I won't comment further on, except to say that it is extremely moving and does highlight the madness of war, especially the kind of war WW1 was. I support military action for just causes, but everything has a cost and Wings lays that cost bare. These were issues being struggled over long before Vietnam, just in case you thought Hippies invented protest. After complaining that she didn't do enough, some people insist that Mary's tactics in Paris were out of character. No they were not. Mary had to get Jack away from that \"other woman\" and get him his orders before he got court marshaled. She was not becoming a floozie, only dressing the part, and she paid the ultimate price for the risk she took. It also helped to stir up Jack's feelings about her in later scenes, and get him thinking. Wings! Melodramatic? Sure. Unoriginal? Well... if you make that claim because you can guess what's coming or you've seen it all before, just ask yourself how old these movies are that you are comparing Wings to, and check Wings' release date again. Maybe the plot-heist occurred in the other direction. This film deserves a DVD release. Barring that, see if you can track down the old Paramount Laserdisc, LV 2851-2, which is what I had. I have been enamored with, and watching, this film since I was 13 (30 now). It shattered my little-boy prejudices against both black and white and silent films in one great blast of anti-aircraft fire, and I have been spreading its gospel ever since. You will not ever see a better World War 1 film.",
         "This film is, no doubt, a timeless triumph of the silent cinema. I first saw it three years ago and have seen it at least 30 times since then. I've only looked back to see that I have it in my collection...but not on DVD! These studios need to start thinking back to the days in which movies as good as these were made and stop producing so much garbage that they think will make tons of money without considering whether it's done right or not. This film taught me just how important gesture and body language can be in the acting world, whether it be on film or on stage. I know just how \"in-character\" an actor is just by looking at their face, their eyes, and how they're written in the script. Don't get me wrong, people can overact and underact in certain parts, but if you do anything without considering your character's expression or mood, regardless of whether or not your voice is unbearable to hear, you will never see success past the sound of crickets hiding in the audience. The industry knew that sound was coming. Most didn't accept this truth, but they knew it alright! \"Wings\" reminds those who've seen it, as with most classics of the silent cinema, that ACTIONS SPEAK A MUCH GREATER VOLUME THAN THE SPOKEN WORD. I've said all I need to say, and now I'll let this picture speak for itself.",
         "Famous of course for winning the first Oscar for best film, WINGS is also one hell of a good film. Spectacular aerial photography highlights the terrific performances of the three leads: Clara Bow, Buddy Rogers, and Richard Arlen. Director William Wellman creates a solid and moving anti-war statement as he shows us the brutality and stupidity of war, its waste of youth, and its power to destroy the lives of all involved. The film starts with star-crossed lovers in a small town in America. Bow loves Rogers but he loves Jobyna Ralston. Ralston loves Arlen and he loves her but through a mistake, Arlen thinks she loves Rogers. Then the boys go off to war. The outgoing Rogers thinks the war will be an adventure; the shy Arlen goes off, leaving his devastated parents who cannot express their emotions. Bow soon goes off to be an ambulance driver. Ralston stays homes and waits. The story follows the rivalry and growing friendship of the boys as they head for war. The story ends in yet another bitter mistake. The viewer is as emotionally drained by the end of this film as the parents were at the beginning. El Brendel provides some comedy relief. Roscoe Karns has a small part. Henry B. Walthall and Julia Swayne Gordon are the parents. And Gary Cooper has one brief scene with Rogers and Arlen. The scene in which he turns and flashes that famous smile as he exits the tent supposedly made him a star. Clara Bow is solid as the spirited home-town girl who chases Rogers to no avail. She's gorgeous here and she is even moreso in the Paris scene where the matron lets her borrow a snappy and dazzling dress. Few women in film history have been able to be so sexually charismatic as Clara Bow. She's also a good actress. Richard Arlen and Buddy Rogers give their best performances here. Each takes turns as the center of attention as they become men during the grueling war. Their flight scenes are incredibly well done. Arlen's flight scene as he races toward the American lines is amazing. Jobyna Ralston has a rare memorable film not working with Harold Lloyd. And Henry B. Walthall is quietly grand as the crippled father. Wellman's direction and the camera work of Harry Perry are beyond perfection. The aerial battles are breathtaking as are the scenes where they blow up the German blimps. There's also one astounding scene in the beginning of the film where Ralston and Arlen are in a swing. The camera is mounted in a stationary position in front of the actors so we see the scene as though we are in the swing with them. Then suddenly in the background we see Rogers in his jalopy pulling up in the street. The swing stops and Ralston gets out and runs to Rogers (in the background) while we see the close-up of Arlen as he twists in the swing seat and turns to watch them. It's an amazing scene and all one shot. This film is a must see.",
         "This entertaining and occasionally impressive movie is still well worth seeing in spite of its flaws. The combat scenes alone make the rest of it worth watching, and Clara Bow gives a very good performance. She has plenty of energy as always, and here she makes her character especially sympathetic. But it has its weaknesses, too. The story is contrived and full of obvious holes, and except for Bow most of the acting is rather routine (Buddy Rogers is as likable as ever, but no more). The highlights of \"Wings\" come in the battle scenes, and they are awfully impressive. Done without computers or other such advantages, they are exciting and are usually completely realistic. The aerial dogfight scenes are especially dazzling. This part of the movie is not shallow stuff, either, since it has a good balance between the thrilling and the horrifying. If the main story-line had been better, this could have worked very well as a classic film about the realities of war and its effects on the young persons who must carry the heaviest load in a war. But unfortunately, it has the story that it has, which could easily have been better. It is far too heavy-handed, and is also riddled with unlikely coincidences, implausible developments, strange decisions by the characters, and many other such holes. If you can somehow look past all these problems, then it produces some moving and emotional moments, but such moments are too often undone by the contrived ways that they are set up. It's just the kind of mess that has often impressed the individuals who vote for well-known awards, but a movie with such strengths deserved to have a much better plot. Nevertheless, it is still well worth watching for its strengths, and not just because it is the answer to some trivia questions. Just in case there are any modern movie fans who have accidentally wandered into the silents section of the database, please don't think that this is the best of what silent cinema has to offer, just because it won an arbitrary award. There are many silent film masterpieces that are vastly better than this. But it's good entertainment, and has some portions that were made with great skill.",
         "I was fortunate to view this film at the Academy of Motion Pictures' Diamond celebration screening series for all the Best Picture winners last year. A newly restored print in pristine condition was beautifully paired with a live performance of the musical score by an eleven-piece ensemble. As a relative novice to silent era films I was struck by the acting, aerial stunt work, sophisticated camera work and great storytelling. As I was watching I couldn't help but think that this 1927 film has so much more to offer than many contemporary attempts at the war/action genre. As the trend for releasing forgotten classics on DVD continues, I make a very loud plea to add Wings to the list. This masterful bit of film-making history deserves a much wider audience.",
         "In 1917, Jack Powell (Charles 'Buddy' Rogers) is a young man with passion for cars. His next door neighbor is Mary Preston (Clara Bow), who is in deep love for him, but Jack does not notice her. Jack indeed loves Sylvia Lewis (Jobyna Ralston), but she is in love with the rich David Armstrong (Richard Arlen). When USA enters in World War I, Jack and David join the Air Force to fight in France and become pals. Mary joins the Women's Motor Corp, trying to be close to Jack. But it is war, and a tragedy happen between the two friends. I am very impressed with this amazing awarded epic. \"Wings\" was recently released on DVD by the Brazilian distributor Continental, and in spite of the Japanese subtitles along the story, it was a worthwhile shopping. The story is fantastic, and the air sequences are awesome. I would like to have an idea of the cost of this ahead of time production, with these anthological battles in the air. I can not imagine how these shootings were achieved, in such angles, considering the cinema technology of 1927. The story raises an anti-war flag with the tragic end, and has realistic sequences that are impressive even in the present days. As a curiosity, Gary Cooper, in the role of Cadet White, has a very short participation, due to his affair with the famous actress Clara Bow. \"Wings\" is a highly recommended movie, even for audiences that do not like silent movies. My vote is ten. Title (Brazil): \"Asas\" (\"Wings\")",
         "For a feeling of what the silents were really like, look for the version of this film with Gaylord Carter performing the score on a Wurlitzer Theater Organ. Carter recorded this version in the 1980's when he was in his 80's. Amazing performance - basically 120 minutes of live, somewhat improvised music with establihed themes for each character. Incidental music was improvised live combining themes from the various characters. Carter was one of the last musicians that performed during the silent era. Very few musicians understand how difficult this art form was, and Gaylor was one of the best. Each showing of the film was an original, never before heard version due to the improvisational nature of the music. The stamina required to play live music, on 3, 4 or even 5 keyboards with a pedal board and dozens of stops, thousands of pipes for over two hours cannot be overstated. Especially when one of these performers were expected to do so 3 or more times a day! Orchestras are all well and good, but few theaters could afford them - Wurlitzer (and a few other companies) sold 40,000 instruments to theaters world wide during the 20's, and chances are, 90% of screenings of this film were accompanied by a theater organ.",
         "You could justifiably criticize WINGS lesser moments: the naive, \"gee-whiz\" dialog...the less than comedic \"champagne\" sequence in Paris...any of the romantic scenes...the idealized view of military life.... But as light entertainment, WINGS manages to hold its own, despite the passage of years. The battle scenes, easily the highlight of the film, may not have the intensity of later films, but the narrative is clear and precise. And this was not meant to be the last word in documentary accuracy: it's an adventure film tinged with romance, with engaging aerial fight scenes that capture your attention whenever they occur. And personally, I felt that the music from the Wurlitzer organ tied together the film's various themes, musical and narrative, quite tidily.",
         "In many ways, I enjoyed this film more than the more expensive HELL'S ANGELS (which Howard Hughes RE-SHOT after its initial completion in order to make it a sound picture)--even though it was a silent film. That's because for a silent movie, it's nearly as good as you're going to find, whereas the primitive sound of Hell's Angels and less engaging plot left me feeling a bit flat--though its flying sequence were clearly better and more spectacular than those in WINGS. Clara Bow is excellent as the sweet lead of the film whose two friends go off to war. This is a far better showcase of her talents than the equally famous movie \"IT\" (which did NOT age as well). Richard Arlen and Buddy Rogers also did fine jobs in the movie, though special recognition must also be given to the cinematography--the movie is just beautiful in spots and the aerial sequences are amazing for 1927! The only down side? Occasionally, there are melodramatic lapses in the pacing--such as the drinking scene where they talk about BUBBLES incessantly. This seems to be due mostly to the style of the day, and for what it was, it was a brilliant picture. I can easily see why it got the first Best Picture award.",
         "Wings (1927) An epic WWI movie that uses all the classic approaches to a war film and has a lot of great battle footage. It's a tale of rivalry over a girl, of fighting for country (and against the Germans), and of facing death. There are several scenes that make death really gruesome--blood spurting from a pilot's mouth, or a man crushed under a tank--that took me by surprise. I didn't know that such a mainstream American film would go there. \"Wings\" is in a way exactly what American movies would look like thereafter--not just war movies, but all of them. By that I don't mean directors studied this movie and it was the inspiration from here on. But just that the story line, the romance, and even the filming, adventurous but straight on, with more attention to characters and plot than visual effect, all of this would be how films would be made for decades. Including many more by the director, William Wellman, who is one of handful of truly expert but never quite daring and inventive directors of classic Hollywood. To back this up neatly, compare this film to the other film that jointly won Best Picture this year (the first year the Oscars were given, and the only year when the best picture category had two separate parts). That is Murnau's \"Sunrise.\" Never mind which is better (\"Sunrise,\" easily by most accounts). Notice how this film is utterly conservative and \"conventional\" in its approach to the art of making movies. It's superbly well done, but well within the rules of the time. Yes, there are moments of inspiration, including some double-exposed stock where a scene takes play in the sky over another scene on the ground. But \"Sunrise\" shows the lyrical art of the camera, and of editing, and of a less literal kind of storytelling. \"Wings\" is probably much easier to watch for most people--that's the idea. But \"Sunrise\" is far more engaging and complex, begging you to watch it twice. I doubt anyone needs to see \"Wings\" a second time. But then, I have to admit the acting makes more sense in this film. The naturalism of the three leads helps you get emotionally involved. The most famous by far is the woman, Paramount's biggest star, Clara Bow. She doesn't get a huge role (the men do the fighting and flying) but at least when she's there she's a treat. The flying is actually done by the actors, and many of the people involved were veterans (including Wellman, who was a WWI pilot himself). It's pretty exciting to find this so exciting all these years later. Give it a look. It's been restored really well (there's even a new Blu-Ray release). And it looks great. Don't expect anything new from the story or the filmmaking, but just expect a really well made high drama affair."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War",
         "Action"
      ],
      "productionCompanies": ["Paramount Famous Lasky Corporation"],
      "summaries": [
         "Two young men fall in love with the same same girl. After the US enters WWI, both join the Air Corps and become aces. They remain friends, but the relation to the girl threatens their friendship.",
         "In 1917, Jack Powell is a young man with passion for cars. His next door neighbor is Mary Preston, who is in deep love for him, but Jack does not notice her. Jack indeed loves Sylvia Lewis, but she is in love with the rich David Armstrong. When USA enters in World War I, Jack and David join the Air Force to fight in France and become pals. Mary joins the Women's Motor Corp, trying to be close to Jack. But it is war, and a tragedy happen between the two friends.",
         "Jack works on his sports car and dreams of flying. His neighbor Mary is in love with him but he seems not to notice, having been smitten by the fair Sylvia, but he can't see that Sylvia has eyes only for David. The distant drums of war beckon, and Jack and David train to be pilots in the American Expeditionary Corp. Their rivalry soon evolves into camaraderie as they do aerial battle with the Germans in the skies over France. Meanwhile Mary has joined the Women's Motor Corp and despairs that Jack doesn't notice her.",
         "Two young men, one rich, one middle class, who are in love with the same woman, become fighter pilots in World War I."
      ],
      "budget": 2000000
   },
   "movielensId": 1925,
   "movielens": {
      "languages": [""],
      "releaseDate": "1927-08-12",
      "dvdReleaseDate": "2012-01-24",
      "directors": ["William A. Wellman"],
      "runtime": 141,
      "movieId": 1925,
      "title": "Wings",
      "mpaa": "",
      "actors": [
         "Clara Bow",
         "Charles 'Buddy' Rogers",
         "Richard Arlen",
         "Jobyna Ralston",
         "El Brendel",
         "Richard Tucker",
         "Gary Cooper",
         "Gunboat Smith",
         "Roscoe Karns",
         "Julia Swayne Gordon",
         "Henry B. Walthall",
         "Arlette Marchal",
         "Nigel De Brulier",
         "Hedda Hopper",
         "George Irving",
         "William A. Wellman"
      ],
      "imdbMovieId": "0018578",
      "originalTitle": "Wings",
      "genres": [
         "Action",
         "Drama",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": ["08NbkvJQq-s"],
      "plotSummary": "Two young men, one rich, one middle class, both in love with the same woman (Jobyna Ralston), become US Air Corps fighter pilots and, eventually, heroic flying aces during World War I. Devoted best friends, their mutual love of the girl eventually threatens their bond. Meanwhile, a hometown girl (Clara Bow) who's the lovestruck lifelong next door neighbor of one of them, pines away.",
      "tmdbMovieId": 28966,
      "avgRating": 3.71016,
      "releaseYear": "1927",
      "numRatings": 364,
      "posterPath": "/a5z7gCR1xLikOJK3WYXIoXoo9Xi.jpg"
   }
}