{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "singer",
            "id": 10229
         },
         {
            "name": "pre-code",
            "id": 156764
         },
         {
            "name": "wisecrack humor",
            "id": 162487
         },
         {
            "name": "early sound film",
            "id": 193649
         },
         {
            "name": "partially lost film",
            "id": 215678
         }
      ],
      "imdb_id": "tt0019729",
      "video": false,
      "title": "The Broadway Melody",
      "recommendations": [
         56164,
         42861,
         43278,
         144490,
         28966,
         43277,
         5873,
         47462,
         49633,
         256644,
         163052,
         33358,
         84303,
         25430,
         54419,
         87234,
         120490,
         51355,
         104294,
         195073
      ],
      "backdrop_path": "/lcDNjLRtias6bi50fXlD4NZ6KWt.jpg",
      "revenue": 4358000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Eddie Kearns",
               "gender": 0,
               "credit_id": "56090355c3a368586f002d30",
               "name": "Charles King",
               "profile_path": "/oTyR81TPYIFC2fsrESKGvG8ArdK.jpg",
               "id": 1516030,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Queenie Mahoney",
               "gender": 1,
               "credit_id": "52fe4701c3a368484e0afdd9",
               "name": "Anita Page",
               "profile_path": "/8nYNbVBg8G5aaryXsgzl4WC6Fdz.jpg",
               "id": 98012,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Hank Mahoney",
               "gender": 1,
               "credit_id": "52fe4701c3a368484e0afddd",
               "name": "Bessie Love",
               "profile_path": "/q4HAaVW9Y6TBtX7pM0q727ZjLne.jpg",
               "id": 29258,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Pianist (uncredited)",
               "gender": 0,
               "credit_id": "5951e0619251412ac4019550",
               "name": "Nacio Herb Brown",
               "profile_path": "/4LDF2zUhvgXvr3zsBuUFJ56gbat.jpg",
               "id": 1147360,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Flo (uncredited)",
               "gender": 1,
               "credit_id": "54cc0e5ac3a36860b90002b9",
               "name": "Mary Doran",
               "profile_path": "/7DCEhoNQDsbVpHShPWBqXyPygPA.jpg",
               "id": 1016036,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Bystander in Rehearsal Room (uncredited)",
               "gender": 2,
               "credit_id": "5951e08f9251412ac701a10d",
               "name": "Arthur Freed",
               "profile_path": "/dzPxN7pBVeSgW46YEOuCzcDbIv2.jpg",
               "id": 9055,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Music Publisher (uncredited)",
               "gender": 2,
               "credit_id": "5951e189c3a368134a018ccb",
               "name": "James Gleason",
               "profile_path": "/ioE4cCouYzFRvqExhorQ5KmfCmq.jpg",
               "id": 30537,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Francis Zanfield (uncredited)",
               "gender": 2,
               "credit_id": "5951e0b5c3a3680d73016d20",
               "name": "Eddie Kane",
               "profile_path": null,
               "id": 96060,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Specialty Dancer (uncredited)",
               "gender": 0,
               "credit_id": "5951dfd29251412ac40194c8",
               "name": "Carla Laemmle",
               "profile_path": null,
               "id": 99599,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Uncle Jed (uncredited)",
               "gender": 2,
               "credit_id": "5951e0e0c3a368149801a4e6",
               "name": "Jed Prouty",
               "profile_path": "/hK1xwv3xOmWBvdxQxmqiwHmtbPY.jpg",
               "id": 117783,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Jock Warriner (uncredited)",
               "gender": 0,
               "credit_id": "5951e3d3c3a3680d7301703e",
               "name": "Kenneth Thomson",
               "profile_path": "/p457u5djPGAGBbP9i0aSt568rEm.jpg",
               "id": 96056,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Chorus Girl (uncredited)",
               "gender": 1,
               "credit_id": "5951df59c3a36813c501c360",
               "name": "Dorothy Coonan Wellman",
               "profile_path": "/4oU591tBYgLx7fGgrfQrhboDswj.jpg",
               "id": 148574,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Bellhop (uncredited)",
               "gender": 2,
               "credit_id": "59a41209925141774f057e4f",
               "name": "Ray Cooke",
               "profile_path": null,
               "id": 122978,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0afdcb",
               "name": "Harry Beaumont",
               "profile_path": "/mmnsbUDWefbtxStex4Lge86R7kq.jpg",
               "id": 145605,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0afdd1",
               "name": "Edmund Goulding",
               "profile_path": "/sestYtYBKchdGhDq9Ho3BToLKvR.jpg",
               "id": 34740,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5647d9879251413ad7005398",
               "name": "John Arnold",
               "profile_path": null,
               "id": 29970,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5647d995c3a3682601005630",
               "name": "Sam Zimbalist",
               "profile_path": null,
               "id": 10004,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5647d9b1c3a3682605005213",
               "name": "Harry Rapf",
               "profile_path": null,
               "id": 120305,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5647d9b9c3a368260100563e",
               "name": "Irving Thalberg",
               "profile_path": null,
               "id": 1497,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5647d9c39251413ad70053a9",
               "name": "Lawrence Weingarten",
               "profile_path": null,
               "id": 3633,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "570a3232c3a36875700033d5",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.278565,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 65203,
      "vote_count": 27,
      "budget": 379000,
      "overview": "Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield's shows. Eddie was in love with Harriet, but when he meets Queenie, he falls in love to her, but she is courted by Jock Warriner, a member of the New Yorker high society. It takes a while till Queenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie",
      "similar": [
         31900,
         872,
         10530,
         1407,
         2005,
         18126,
         45272,
         60405,
         10537,
         16367,
         3087,
         1125,
         43600,
         30197,
         28658,
         409447,
         1665,
         25167,
         21468,
         14448
      ],
      "original_title": "The Broadway Melody",
      "runtime": 100,
      "poster_path": "/dJxFUKiO7JTDBSUr4Nzct4iJikX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1929-02-08",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "The pulsating drama of Broadway's bared heart speaks and sings with a voice to stir your soul!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Harry Beaumont"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Edmund Goulding",
         "Sarah Y. Mason"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0019729/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0MjA4ODg5NF5BMl5BanBnXkFtZTgwMDk4MDY0MjE@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Bessie Love, Anita Page, Charles King | See full cast and crew »"],
      "reviews": [
         "MGM's \"The Broadway Melody\" has often been criticized and lampooned, but the film holds up better than its reputation would suggest and has historical, social, and entertainment value that merit its viewing. This musical from the early days of sound won the second Best Picture Academy award and the first that went to a sound film. While its technical accomplishments may have impressed audiences in 1929, they are important today only as they show the hurdles that faced an industry in transition. The sound is harsh, which can be expected from early recording techniques, and, like the struggling technicians comically demonstrated in \"Singin' in the Rain,\" sound created several problems for filmmakers. The camera in \"The Broadway Melody\" rarely moves, most of the scenes are in long-shot or mid-shot, and occasionally characters blur when they walk out of the camera's focal range. Thus, observant viewers can spot in this movie many of the real situations that faced the studios and directors during the sound transition period in the late 1920's. Another interesting aspect of \"The Broadway Melody\" is social. Like the two fliers in \"Wings\" from the prior year, the two sisters, who form a stage act that they are attempting to bring to Broadway, openly demonstrate affection in a manner that would raise eyebrows today. The two fliers in \"Wings\" kissed on the mouth, embraced, and openly showed an affection that could only be interpreted as love, although there was nothing sexual implied. Here too, the two sisters kiss on the mouth, sleep together in each other's arms, and embrace more than even two sisters would be permitted to do within current social norms. Again, there is apparently nothing sexual in their affection, only sibling love. Another changing social norm is the shifting role of gays in film, and a clip from this movie was included in \"The Celluloid Closet\" to illustrate the change over time. The male dresser in \"The Broadway Melody\" is a blatant stereotype of the sissy, and the derisive remarks and put downs that he endures from other characters would or should not be tolerated today. However, like the Stepin Fetchit characters that illustrate how African-Americans were once treated on film, the sissy depicted here is a valuable lesson in how minorities were once marginalized and derided in the movies. However, \"The Broadway Melody\" is of merit not only for historical and social reasons but also for its entertainment value. While the backstage story has become familiar, the plot retains a certain dated interest and is not boring. Some of the songs are familiar from \"Singin' in the Rain,\" where they were sung and performed as well as they ever will be. But nevertheless, hearing these familiar tunes as they were first performed is fun, even if the voices and sound are lacking all around, and the clumsy dance numbers that are often performed to these songs cry out for Busby Berkeley, although they retain a certain clunky charm. While the film is neither the classic that it should be nor the campy dud that its detractors claim, \"The Broadway Melody\" is definitely worth a look and makes an excellent double feature with \"Singin' in the Rain\" as a real example of what was spoofed in that musical classic.",
         "This is NOT a bad film. It's a 1929 musical that won an Oscar for best film as well as nominations for direction (Harry Beaumont) and lead actress, Bessie Love. It was the number ONE hit of 1929. Central to this film is Love's great performance as Hank Mahoney, the older sister in a musical act trying to make it on Broadway. The plot is pretty sophisticated for 1929. Bessie Love is in love with a singer (Charles King) who falls for younger sister, gorgeous Anita Page. Rather than hurt her sister, Page starts running around with a scummy playboy (Kenneth Thomson). The truth comes out and Love backs off in a heart-breaking scene, giving up King and the act, and clears the way for Page and King. Two great songs: The Broadway Melody and You Were Meant for Me, both nicely done by Charles King. Love and Page are also fun in The Boy Friend song, in which Bessie Love gets to cut loose and dance in a full-fledged number. Another song, The Wedding of the Painted Dolls, is truly bizarre, and possibly the most over produced musical number you'll EVER see! But I like the music. Yes, yes, you've seen all this before, but remember this is a 1929 talkie. The opening number is wonderful, with Charles King introducing The Broadway Melody. That's James Gleason as the music publisher. And keep your eyes on Rosie (no idea who played her) with her swinging beads. Blanche Payson plays \"the big woman\" in charge of the dressing room, who has a terrific scene with the gay designer (Drew Demorest). Mary Doran, Eddie Kane, Ray Cooke, and Jed Prouty have roles and that's composer Nacio Herb Brown at the piano. I love this film! I love the music. Bessie Love is SO GOOD in this film, you wonder why her talkie career didn't go better. Anita Page is also good and has a couple of terrific dramatic scenes. Charles King is a good singer but his acting was hammy. The three stars also appeared in Hollywood Revue of 1929. And yes, Bessie Love had been in films since the teens and was already a veteran of 15 years when she made this film. Catch her in Intolerance and The Lost World.",
         "A song & dance sister act strives for happiness and fame on the Great White Way. Hailed as Hollywood's first true musical, THE Broadway MELODY shows its age, but ought to be judged by its own era, not ours. When it premiered in 1929, the movie industry was still releasing its last silent films. To see a hundred-minute movie full of music & talk, with a storyline that made sense, some good acting and genuinely hummable tunes - this was all tremendously exciting. That the film won the Academy Award for Best Picture of the year is hardly surprising. From this source the mighty American Movie Musical would spring. Some of the acting is a bit awkward, illustrating the rough transition from silents to talkies - the Microphone was a Monster that would completely devour some actors - but most of the performances are adequate. Of special note is Miss Bessie Love. Pert & pretty, as well as a most engaging actress, she dominates the proceedings as the tough, realistic half of the sibling duo. Able to show joy or despair with equal conviction, she amply demonstrates her mastery of the new medium. Her Academy Award nomination was well earned. As her younger sister, Anita Page is lovely to look at. Her ease with the microphone would increase with her next few acting assignments. Broadway singing star Charles King plays the composer/performer loved by both young ladies and he is quite agreeable in this role. Mr. King had the distinction of being America's first male musical movie star, aside from Jolson, but his film career would be very short, covering only six pictures from 1928 to 1930. The team of Arthur Freed & Nacio Herb Brown supplied the tunes, including the classics 'The Broadway Melody,' 'You Were Meant For Me' & 'The Wedding of the Painted Doll,' which is unfortunately missing its original Technicolor hues. Mr. Brown can be spotted as a piano player in the film, while movie mavens should recognize James Gleason as a music publisher in the opening sequence and Jed Prouty as the girl's stuttering agent - both uncredited.",
         "To say the least, watching this movie was an interesting experience. For one thing, \"The Broadway Melody\" predates the Hayes Code, which placed strong restrictions on what could and could not be seen (or heard) in movies. For example, we see numerous shots of Hank and Queenie in various states of undress, including shots of them in their undergarments as they change clothes, and even one of Queenie in the bathtub(!). No, nothing is revealed, but in 1929, it must have been scandalous to see this. Another interesting aspect of this film is that, despite the fact that it is a \"talkie,\" title cards like those seen in silent films appear throughout. Apparently, MGM wasn't quite sure how to progress the story of the movie as it switched to different sets. Another thing I noticed was the similarities between some of the characters' names to those of real people. Specifically, \"Jock Warriner\" sounds like \"Jack Warner\" (who was head of Warner Bros. Studios) and \"Francis Zanfield\" is similar to \"Florenz Ziegfeld\" (of Ziegfeld Follies fame). It would seem the writers didn't have far to go to create some of these characters. As for the acting, Bessie Love is the best performer in the film. Her character, Hank (yes, a man's name!), is intelligent, strong-willed, determined, and tough-minded, and she deservedly received an Oscar nomination for her performance in this film. \"The Broadway Melody\" is a somewhat dated movie (to echo the sentiment of TV Guide), but it is still worthwhile to watch. The script is a little hokey, but the performances (especially from the women) shine through.",
         "OK, it's very simple. If you want to watch and enjoy this film, you have to put yourself back into 1929. If you're not willing to do that, don't waste your time. If you *are* willing to do that, it's a pretty good film. If the sound or picture seems ancient-- well, not in 1929! If the plot seems old hat-- well, not in 1929! You really do have to put yourself mentally into the time-frame of the time. This was really pretty damn good for 1929. Of course, part of the enjoyment, today, of watching such a film, is indeed the time-warp you get. It really is interesting to see the movie people groping to find their way in the new era of talkies. Some have mentioned the odd silent-movie-style story-boards that open the scenes. Or the way that the players sometimes get out of focus when they get out of range of the camera. There were some other limitations of the time that I found interesting. Very interesting to note all the silence, when the characters are not speaking, especially when they are just emoting. Today, of course, every such scene would have orchestral back-up music, to tell you how to feel, but obviously nobody had thought of that yet. Or the way that they hadn't really invented the modern notion of a Musical, where people burst into song for no reason. In the one scene here where somebody seems to spontaneously burst into a song describing his feelings to someone else... at the end of the song he explains that he wrote it just for her (thus, it wasn't spontaneous after all). All in all, not a *great* film, but enjoyable. I gave it six stars, plus an extra one for the historic interest. My one real gripe: I did think that the actress who played Queenie was just terrible. Too often she just didn't sound natural, she sounded like she was reading lines.",
         "I had the chance of watching this amazing movie when I bought the DVD version of The Broadway Melody. Although the restoration of the film wasn't that good, it still brought me to a conclusion that the film itself is a landmark achievement in the invention of a new Hollywood genre: the movie musical. In the strictest sense of the word musical, however, The Broadway Melody is still at tips. It only contains some three songs blurted out of nowhere by the actors, as well as some orchestral music accompanying the movie as musical score. However, this kind of musical, which is still very much understood to be young in 1929's case, is already a rave not only for audiences but also for the critics. Also, the technical aspects of the film, although are not outstanding enough to win the modern Best Picture, are very much appreciated in 1929's case. If we watch the movie in 1929's style, we can see that indeed it is a great movie. Long shots of dance sequences, great art and set decoration and of course great costumes would fill your eyes, not mentioning the kind of sporadic editing techniques and bright lighting that this movie utilized. This movie, in 1929's opinion, would really win the Best Picture, hands down. However, what's more interesting with this movie is that, as a contemporary audience watching it, I am so enthralled at the history it had shown me. Remember, this is the transition to sound. It is much amusing to notice the fact that for the first time in my life, I have seen movie title cards (used for denoting various locations in the film) and that it is obvious that the movie utilized the 16-frames-a- minute hand-cranked camera which was common with the silent films of the 1920s, because of the seemingly fast motion (you'd notice it too)that actors made in the movie. Another thing is the static nature of the cameras in this movie. It is explainable since cameras are enclosed in \"iceboxes\" or camera rooms that are enclosed so as not to be heard by the then all-hearing microphone, that's why, in 2005's opinion, it did not have an imaginative screenplay. However, at this focal points, I can say that history has been shown in this movie and has added a great deal of weight for it to be considered as Academy Award winner for Most Outstanding Production of 1929.",
         "Even though the occasional subtitle appears like training wheels on a bicycle with The Broadway Melody sound had finally arrived to tell the story of a movie. Though the movies had learned to talk, the players hadn't quite gotten down acting with a microphone instead of exaggerated gestures to make a point. Everybody was overacting that year, you ought to see Mary Pickford's Best Actress performance in this same year. In fact she beat out Bessie Love who did a very good job as one of the aspiring Mahoney sisters for stardom on the Great White Way. Bessie Love and Anita Page play the Mahoney Sisters who come to Broadway after being sent for by an old friend Charles King. King's had his eye on Love, but now little sister Page is all grown up. And she's also attracting Broadway wolf, Kenneth Thomson. Charles King was a popular Broadway leading man of the day, his career going back to 1908 there. Such people as George M. Cohan, Irving Berlin, and Vincent Youmans had songs introduced by him. King had a nice singing and dancing act. He never really took to the big screen, but introducing Broadway Melody and You Were Meant For Me should qualify him for some screen immortality. The plot is your usual backstage story, but the greatness of Broadway Melody was the singing and dancing. The possibilities of the screen musical hadn't been fully explored, it would take Busby Berkeley to do that in a few years. In its numbers Broadway Melody is a photographed stage musical. But not a bad one at that. And our second Best Picture Oscar.",
         "I have just watched the Broadway Melody for the second time. I liked the picture very much because it takes one back to a very interesting time in our history. I am fascinated with the period it represents. I liked the dialogue and the music and the dancing and so on. I think that the film is excellent for its time. Many modern viewers will look at the film and think it as poor because of the dated acting and technology. You have to remember it is 1929 not 2004. Central to its appeal for me is the fact the plot is both complicated and simple. The conflicts of affection between the characters is nicely resolved in the end. The simple fact of life is shown in the film. That is to say that all the fame and money in the world is not worth a thing if one is not happy with it. Most films today depress me very much. I want to be entertained. I don't want to see a bunch of banality. Broadway Melody takes you back to a time when there was true entertainment. I really liked \"The Wedding of the Painted Dolls\". A lot of precision went into that number.",
         "Having seen \"The Broadway Melody\", one has to be taken in as to what an achievement this must have been to 1929 audiences. Here is the very first original musical written for the screen. It balances the interesting storyline with musical numbers which must have seemed to be quite spectacular for 1929, especially the \"Wedding Of The Painted Doll\" number. The performances in the film are uniformly good, with knockout work by Miss Bessie Love and Miss Anita Page. They bring a believability to their characters which is amazing considering the newness of the sound technology at the time. Miss Page was always a good actress as well as a beautiful woman, and I find it interesting that in two of the films that I have seen with her, \"Our Dancing Daughters\" and this one, she has marvelous \"drunk\" scenes. \"The Broadway Melody\" opened the floodgates for musical pictures which went unabated until late 1930, when the public had had enough. If you are lucky enough to get the DVD version of this film, you get an additional ninety minutes of extras consisting of some interesting early sound short subjects, including \"The Dogway Melody\", which is a funny parody of \"The Broadway Melody\" starring an all-canine cast. So step back in time and put yourself in the audience of the first of the \"all-talking, all-singing, all-dancing\" entertainments, which just so happened to be the first sound film to win the best picture Oscar. If you enjoy film history as much as I do, you'll love it. Thanks for reading.",
         "The second Best Picture Oscar winner and the very first that used the then-new advent of sound was \"The Broadway Melody\", a totally under-rated and under-appreciated musical that started a genre which would be dominant well into the late-1960s. It is depression-era New York and two country sisters (Oscar-nominee Anita Page and a very young Bessie Love) come to the city to make it big on Broadway. Of course the competition is stiff and success is not a sure thing by the longest of shots. Page is in love with the star (Charles King) of the show they want to be a part of. King believes he loves Page too, but quickly falls for her younger sister instead. Now the dilemma begins. The problems escalate further as Love becomes a star and begins to run around with socialite Kenneth Thomson (in an appropriately sleazy performance). Will the bright lights of the city destroy Page and Love's relationship forever and what will become of the two men in their lives? \"The Broadway Melody\" is admittedly a formula-driven film, but it works so much better than most all other soap operas throughout the history of the cinema. The main reason is because of top-notch direction by Oscar nominee Harry Beaumont and the solid performances from the four leads. There is also much dazzle in the production as the sound is revolutionary with lavish dance numbers and many instrumental ensembles. Wonderful cinematography, costume design, set direction and editing complete the film's excellence. Not quite a perfect film, but definitely a worthy Oscar winner that still stands pretty tall nearly 75 years after its initial release. 4.5 out of 5 stars."
      ],
      "genres": [
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield's shows. Eddie was in love with Harriet, but when he meets Queenie, he falls in love to her, but she is courted by Jock Warriner, a member of the New Yorker high society. It takes a while till Queenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie."],
      "budget": 379000
   },
   "movielensId": 1926,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1929-02-08",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Harry Beaumont"],
      "runtime": 100,
      "movieId": 1926,
      "title": "The Broadway Melody",
      "mpaa": "",
      "actors": [
         "Charles King",
         "Anita Page",
         "Bessie Love",
         "Nacio Herb Brown",
         "Mary Doran",
         "Arthur Freed",
         "James Gleason",
         "Eddie Kane",
         "Carla Laemmle",
         "Jed Prouty",
         "Kenneth Thomson",
         "Dorothy Coonan Wellman",
         "Ray Cooke"
      ],
      "imdbMovieId": "0019729",
      "originalTitle": "The Broadway Melody",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["OxWVH28E1KY"],
      "plotSummary": "Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield's shows. Eddie was in love with Harriet, but when he meets Queenie, he falls in love to her, but she is courted by Jock Warriner, a member of the New Yorker high society. It takes a while till Queenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie",
      "tmdbMovieId": 65203,
      "avgRating": 3.13819,
      "releaseYear": "1929",
      "numRatings": 199,
      "posterPath": "/dJxFUKiO7JTDBSUr4Nzct4iJikX.jpg"
   }
}