{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0023876",
      "video": false,
      "title": "Cavalcade",
      "recommendations": [
         65203,
         42861,
         126136,
         43278,
         43898,
         44657,
         84295,
         5873,
         33544,
         44369,
         84277,
         82397,
         27976,
         47462,
         147876,
         61416,
         26323,
         84303,
         33358,
         99272
      ],
      "backdrop_path": "/adzlio3r2bYO4rSnBhNtWQ0UuhM.jpg",
      "revenue": 7630000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jane Marryot",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a45",
               "name": "Diana Wynyard",
               "profile_path": "/uQ4THYBzt0unHJRgVicXX1svygP.jpg",
               "id": 117499,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Robert Marryot",
               "gender": 2,
               "credit_id": "52fe48f1c3a36847f8181a49",
               "name": "Clive Brook",
               "profile_path": "/s1LySGvfGdlQLQegB8JZkWzc2A8.jpg",
               "id": 13340,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ellen Bridges",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a4d",
               "name": "Una O'Connor",
               "profile_path": "/3oK1RaPKfj74bwiBsgcz0TNgvxD.jpg",
               "id": 2929,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Alfred Bridges",
               "gender": 2,
               "credit_id": "52fe48f1c3a36847f8181a63",
               "name": "Herbert Mundin",
               "profile_path": "/2DHXTlaQ5AjX3WYPaZoLXHiHxDY.jpg",
               "id": 72060,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Cook",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a67",
               "name": "Beryl Mercer",
               "profile_path": "/kd22nF2wsJ3vW8ciG61jZxokxig.jpg",
               "id": 2018,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Margaret Harris",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a6b",
               "name": "Irene Browne",
               "profile_path": "/3orN9j7sQyjye0meuMeQVgrnsYl.jpg",
               "id": 144361,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mrs. Snapper",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a6f",
               "name": "Tempe Pigott",
               "profile_path": null,
               "id": 29603,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Annie",
               "gender": 0,
               "credit_id": "52fe48f1c3a36847f8181a73",
               "name": "Merle Tottenham",
               "profile_path": "/5xBnWNGJIOEYbZHZDDONMzby4OP.jpg",
               "id": 97218,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Joe Marryot",
               "gender": 2,
               "credit_id": "52fe48f1c3a36847f8181a77",
               "name": "Frank Lawton",
               "profile_path": "/sxTEwrrSKf7DucjwZm69E8HPGtE.jpg",
               "id": 96764,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Fanny Bridges",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a7b",
               "name": "Ursula Jeans",
               "profile_path": "/mAd1MKUZ0RIGTYS1agdhtRCoA5i.jpg",
               "id": 222281,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Edith Harris",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a7f",
               "name": "Margaret Lindsay",
               "profile_path": "/2lDJFueklrAQBc7gg13NyVAy8HL.jpg",
               "id": 20365,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Edward Marryot",
               "gender": 0,
               "credit_id": "52fe48f1c3a36847f8181a83",
               "name": "John Warburton",
               "profile_path": "/31CVHWFW0fKHqke9zhVm3bciBMl.jpg",
               "id": 129676,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "George Grainger",
               "gender": 0,
               "credit_id": "52fe48f1c3a36847f8181a87",
               "name": "Billy Bevan",
               "profile_path": "/b71bTzqUZ60ij9aErlaat6BWkTK.jpg",
               "id": 100763,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Master Edwards",
               "gender": 0,
               "credit_id": "52fe48f1c3a36847f8181a8b",
               "name": "Dickie Henderson",
               "profile_path": null,
               "id": 1234066,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Master Joey",
               "gender": 0,
               "credit_id": "52fe48f1c3a36847f8181a8f",
               "name": "Douglas Scott",
               "profile_path": null,
               "id": 30231,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Young Fanny",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a93",
               "name": "Bonita Granville",
               "profile_path": "/e4mnKztyt6sqQYATmN94M2ULU3r.jpg",
               "id": 14870,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Girl on Couch",
               "gender": 1,
               "credit_id": "52fe48f1c3a36847f8181a97",
               "name": "Betty Grable",
               "profile_path": "/gVQkYy22SpHsZbPb4xyNNORrW6Z.jpg",
               "id": 64838,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48f1c3a36847f8181a41",
               "name": "Frank Lloyd",
               "profile_path": "/h3QW1G6QlkC1cKtcIaFC2kRVkHy.jpg",
               "id": 72061,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f1c3a36847f8181a53",
               "name": "Noël Coward",
               "profile_path": "/MgPU3ByatARQZDAqpQAMVKrfwN.jpg",
               "id": 12718,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f1c3a36847f8181a59",
               "name": "Noël Coward",
               "profile_path": "/MgPU3ByatARQZDAqpQAMVKrfwN.jpg",
               "id": 12718,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f1c3a36847f8181a5f",
               "name": "Reginald Berkeley",
               "profile_path": null,
               "id": 563119,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5aa3c8ae0e0a26074b00b84b",
               "name": "Noël Coward",
               "profile_path": "/MgPU3ByatARQZDAqpQAMVKrfwN.jpg",
               "id": 12718,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5aa3c8bb0e0a26075400b5b9",
               "name": "Reginald Berkeley",
               "profile_path": null,
               "id": 563119,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.811734,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 56164,
      "vote_count": 22,
      "budget": 1180280,
      "overview": "A cavalcade of English life from New Year's Eve 1899 until 1933 seen through the eyes of well-to-do Londoners Jane and Robert Marryot. Amongst events touching their family are the Boer War, the death of Queen Victoria, the sinking of the Titanic and the Great War.",
      "similar": [],
      "original_title": "Cavalcade",
      "runtime": 110,
      "poster_path": "/uVmkQoxPlF8Vvx2TrLOrF08STNH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fox Film Corporation",
         "id": 5488,
         "origin_country": ""
      }],
      "release_date": "1933-02-08",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "THE PICTURE OF THE GENERATION!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Frank Lloyd"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Reginald Berkeley",
         "Sonya Levien"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023876/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM1MjQyNDgxMl5BMl5BanBnXkFtZTgwMjgxMDE5MjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Diana Wynyard, Clive Brook, Una O'Connor | See full cast and crew »"],
      "reviews": [
         "CAVALCADE is an extremely good example of films made in the first few years following the advent of sound, an era in which actors, directors, writers, and cinematographers struggled to find a new style that could comfortably accommodate the new technology. During this period, many actors and writers were drawn from the stage--only to discover that what seems real and natural in the theatre seems heavily mannered on screen. This is certainly the case with CAVALCADE. The film presents the story of two London families whose lives intertwine between 1900 and 1933. The film begins with the upperclass Marryot family and their servants, Mr. and Mrs. Bridges, facing the Boer War--and then through a series of montages and montage-like scenes follows the fortunes of the two families as they confront changing codes of manners and social class and various historic events ranging from the sinking of the Titanic to World War I. From a modern standpoint, the really big problem with the film is the script. CAVALCADE was written for the stage by Noel Coward, who was one of the great comic authors of the 20th Century stage--but the sparkling edge that seems so flawless in his comic works acquires a distastefully \"precious\" quality when applied to drama. Although the play was a great success in its day, it is seldom revived, and the dialogue of the film version leaves one in little doubt of why: it feels ridiculously artificial, and that quality is emphasized by the \"grand manner\" of the cast. That said, the cast--in spite of the dialogue and their stylistically dated performances--is quite good. This is particularly true of the two leading ladies, Diana Wynyard and Una O'Connor (best known for her appearances in THE INVISIBLE MAN and THE BRIDE OF FRANKESTEIN), both of whom have memorable screen presences that linger in mind long after the film ends. The material is also quite interesting and startlingly modern; although it is more covert than such films as ALL QUIET ON THE WESTERN FRONT, CAVALCADE has a decidedly anti-war slant, and the characters in the film worry about where technology (which has produced such horrors as chemical warfare by World War I) will take them in the future. I enjoyed the film. At the same time, I would be very hesitant to recommend it to any one that was not already interested in films of the early 1930s, for I think most contemporary viewers would have great difficulty adjusting to the tremendous difference in style. The VHS (the film is not yet available on DVD) has some problem with visual elements and a more significant problem with audio elements, but these are not consistent issues. Recommended--but with the warning that if you don't already like pre-code early \"talkies\" you will likely be disappointed. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "Cavalcade is one of the great films of the 20th century, and was justifiably honoured as \"best picture\" by the Academy in 1932-33. It is a golden cinematic treasure- waiting to be found anew for those who may know nothing of its existence. It is dated only for those who have no sense of history or cultural depth. It tells the story of England and western civilisation through the history of two families, the Marryots and Bridges. It is the same technique of intimate narrative history that was successfully used in \"Roots\" and other family-history sagas. Noel Coward's highly successful London-set stage play \"Cavalcade\" was adapted for the big screen with a cry of \"A love that suffered and rose triumphant above the crushing events of this modern age! The march of time measured by a mother's heart!\" It tells of the struggle of civility against the brutalising effects of war (and in particular the Great War). It tells the story of Britain's struggle against barbarism in the late 19th and 20th century, and of old fashioned virtues in a world that seemed determined to leave them all behind. The final \"march of the heroes of history\" is perhaps quasi melodramatic Wagnerian mysticism, but it tightens the stiff upper lip- and makes me (for one) proud of Britain's contribution to the modern world.",
         "Often forgotten, but very excellent 1933 Best Picture Oscar winner that stands up amazingly well after 70 years. \"Cavalcade\" is the near-epic tale of two British families (one set of aristocrats led by Oscar-nominee Diane Wynyard and Clive Brook and the other a set of servants led by Una O'Connor and Herbert Mundin) and their experiences from New Year's Eve 1899 to the start of 1933. As the film opens, the country is entangled in the bloody Boer War in South Africa. Queen Victoria's death soon follows and naturally the loss hits the entire country very hard. The sinking of the Titanic also effects the richer group as they lose family members on the doomed liner. Of course World War I produces a terrible situation for the two groups' children. The film progresses through the Jazzy 1920s and then we re-visit the couples in the early-1930s as they reflect on eventful, dramatic and tragic years since the start of the century. A new hope seems possible by the end (of course history would continue to be unkind as World War II would soon become a sad reality for the English), but far from certain. Frank Lloyd (Oscar-winning for his direction) crafted a vastly interesting film that is technologically strong for the time period (the Titanic sequence in particular is something to be appreciated) and very intelligent from the start. The editing techniques are revolutionary with impressive fades throughout to show the passing of time and the cinematography still holds up strong even today. One good thing about the Academy Awards is the historical significance it gives to films like \"Cavalcade\". True the film is not always well-known among movie enthusiasts, but that does not mean that this is not an excellent production and one of the first truly excellent movies that Hollywood would develop for the world. 5 stars out of 5.",
         "If you want to know what the twentieth century looked like to people in the early thirties, this is the film to watch. Two families - upstairs and downstairs - go through the events of the Boer War, the Edwardian age, the First World War and its aftermath, ending in the \"chaos and confusion\" of the depression. The film seems to be fairly closely based on the original Drury Lane theatre production (many of the cast are the same). So when Binnie Barnes delivers \"Twentieth Century Blues\" (excellently) this is presumably how Coward wanted it sung. Noel Coward's clipped dialogue can't always carry the weight of the themes, and the nobility of the upper-class couple gets a bit wearing, but there are fascinating glimpses of a music hall performance and an Edwardian seaside concert party. The film races through thirty eventful years, and one or two of the tragedies are predictable, but the period detail is terrific. The film is well worth catching.",
         "This is an extraordinary film, from a play by Noel Coward. Starting on New Years Eve in 1899, the film goes on an emotional ride through 33 years of British history - ending on New Years Eve 1932. Through the lives of the members of one household (and two families one upper class, the other their servants)we visit the Boer War, the death of Queen Victoria, the Titanic, World War One and the Jazz Age. The film ends with the hope of a more peaceful world - a hope saddened by our knowledge that 1933 was to be the year that Hitler came to power. This is very much an anti-war film, with the World War One scenes very powerful and the sad loss of a mother portrayed vividly as a woman learns of the death of her son as the rest of the world celebrates the end of the war. You won't forget this image. Sumptuously shot and beautifully directed, the film is best when it is visual as it does suffer some of the sound problems associated with early talkies - and some of the acting is a little melodramatic. Diana Wynard's performance alternates between magnificent and hammy constantly - suggesting she was a little uncertain how to act for the camera. And look out quickly for an early portrayal of a gay male couple (snuck in by Coward I suspect!). But this film is astonishingly relevant to us as we move into a new century. Let's not repeat the mistakes of the last. Coward speaks to us strongly from the grave.",
         "A sloppy but beautiful British family saga chronicling the lives of two families, the Marryots and the Bridges, the former upper class and the latter their servants, from the end of the 19th Century up to 1933. A few major events are portrayed. At the beginning of the film, the patriarchs of the two families go off to fight the Boer War. Much later on in the film we experience WWI, and in between we see the Titanic sink. The film is filled to the brink with good characters, all of them being portrayed by very good actors, as well. There are a few very bad scenes, most notably the one on the Titanic (I know it was an important event in this time period, but it's handled very poorly and predictably in the screenplay). The final speech, a necessary element in every film of this sub-genre, is particularly bad, too. The film ends during a worldwide depression, and there is a half-attempt to provide the audience with hope. Unfortunately, there is none to be found. I would have hated to be an audience member at this film in 1933! The many good scenes do far outweigh the bad ones, though. There are a couple that are really masterful. The very long montage that paints a portrait of WWI is gorgeously done, and appropriately harrowing. The scene in which the matriarch of the Marryot family watches her youngest son go off to war is exquisite. After he leaves, she attempts to light a cigarette. At that moment, a young nurse and a wounded man in a stretcher pass by; the nurse lights a cigarette for the wounded man. The match goes out between the matriarch's fingers as she stares at them. This very economical scene expresses both the cold fear she has for her son and the ways in which the boundaries between the classes were fading. The theme of class in Cavalcade is important, although I wish it had been developed further. Early in the film, the Bridges family moves away and amasses something of a fortune of their own. As history marches on, we do see the class lines falter a bit. Cavalcade may actually have been an influence on none other than Jean Renoir, at least in The Grand Illusion. That film also deals with the melding of the classes as a result of wars. There is one scene in Cavalcade that is simply too close to one in The Grand Illusion to be a coincidence. A theater show is interrupted to announce that the Boer War is over and that the troops are coming back. Together, the audience members stand up and begin singing. It looks very much like the scene where the P.O.W.s sing \"The Marseilles\" in The Grand Illusion. 8/10.",
         "I suppose you don't have to be an Anglophile to like Cavalcade, but it certainly helps. The film it seems to be most like to me is Giant. Just as the Edna Ferber based film is some 25 years of the second quarter of the last century as seen through the eyes of the Texas Benedict family, Cavalcade is a British social history through the Marryots, Robert and Jane played by Clive Brook and Diana Wynyard. Though the Benedicts have their problems, they don't go through near the tragedies that the Marryots do. Cavalcade was presented on the London stage a few years earlier and it never made it to Broadway unlike most of Noel Coward's works. It was an expensive production with revolving kaleidoscope like sets that probably made American producers on Broadway shy away from it. A lot of standard English Music Hall numbers were used instead of Coward writing an original score. He did contribute one number however, 20th Century Blues which was a whole commentary unto itself of the roaring twenties. Although at that point in time our history in the USA certainly does connect with the United Kingdom's during World War I for the most part Cavalcade deals strictly with British subject matter. I'm afraid unless one is a fan of Noel Coward or is familiar with 20th Century British history, it's hard for today's audience to appreciate Cavalcade. Cavalcade however was the Best Picture of 1933 and Frank Lloyd won for Best Director. He'd win another Oscar for Best Director on another, but far different British subject in Mutiny on the Bounty. Diana Wynyard was nominated for Best Actress, but lost to Katherine Hepburn for Morning Glory. Two other good performances are Una O'Connor and Herbert Mundin as Mrs. and Mr. Bridges. They are the downstairs in service couple to the upstairs Marryots. Both play far different parts than what we normally see of them. Most film fans remember Herbert Mundin as the meek mess man from Mutiny on the Bounty and Much the Miller from The Adventures of Robin Hood where he's paired with Una O'Connor. He's quite different here. Cavalcade is good, but terribly dated. Still it should be seen and evaluated as a commentary of how the British saw themselves at the beginning of the Great Depression.",
         "This is a wonderful slice of life film about one family as they cope with the 20th century and all its upheaval. While the film came out long before WWII, it does focus a lot on the destruction and loss of WWI, as many of the characters you come to care about through the course of the film are killed. And, through it all, the survivors keep a stiff upper lip like a good Brit! The film features excellent acting, writing and action. All around, it is a top-quality film. However, while an excellent film and one that will tug at your heart, it is NOT as high a quality film as you would expect for the BEST PICTURE award it received. Excellent and worth seeing--absolutely. Oscar worthy--not really.",
         "Unlike the big Oscar winners of later decades, the Best Pictures of the 1930s have largely been neglected (the only notable exceptions being It Happened One Night and Gone with the Wind). Of them all, Cavalcade is perhaps the most rarely remembered, and if remembered at all frequently dismissed as a dated, stagy melodrama, a product of an embarrassing era in cinema's history that even film buffs tend to shy away from, without even the added attraction of some pre-code naughtiness. But are bare legs, innuendo and mean-faced gangsters the only things worth salvaging from this era? The accusations of staginess are not surprising, Cavalcade being adapted from a Noel Coward play. But while Coward may have been a bit of a theatre snob with a naively upper-class attitude, he is not as impenetrably British as he may appear at first glance. Although Cavalcade focuses ostensibly on the concerns of a typical well-to-do English family, Coward strings together his story from universally emotional events, many of which would have related to the lives of people all over the world, and most of which still bear a kick today. Granted, Cavalcade's social conservatism and stiff-upper-lipped fustiness can be a little alienating, but this is not a preachy movie and nothing is forced home or laid on too thickly. Besides, Coward's warm humanism pervades even the most clichéd of characters. The director is Frank Lloyd, himself an unfairly forgotten man of old Hollywood. Many will not understand why Lloyd one an Oscar for his work on Cavalcade, because he does not use any overt camera tricks, but the truth is Lloyd is too much of a master to need any tricks. Many of the claims of stiltedness probably stem from the fact that Lloyd uses a lot of long and often static takes, but there is still subtle and clever technique at work here. Take that first scene of Diana Wynyard and Clive Brook making their preparations for New Years Eve. A large chunk is done without a single edit, yet with a few simple panning manoeuvres Lloyd's camera is smoothly changing the focus and keeping things feeling fresh, at one point having Brook's face appear in the mirror, then following her over to the table where the two of them stand with a garland of flowers framing the lower edge of the shot. Another director might have used a dozen cuts in the same scene, but Lloyd does it with just one or two. And the great thing is you don't notice. Often he will shift our attention from one place to another, but do it by having the camera follow a walking character to disguise the movement, such as the father carrying off a crying child on the beach. In spite of this unostentatious approach, the style is purely cinematic. To be fair however, most of the accusations of theatricality fall upon the cast. I would however describe the performances here as being stereotyped rather than grandiosely hammy. Diana Wynyard was the only Oscar nominee for acting, although she does little here but emote rather wetly. In her favour she does put a lot of expression into her small gestures, and as the picture progresses she ages her character convincingly. More realistic turns however are given by Clive Brook and Irene Browne. The real surprise performance of the lot though is Herbert Mundin. In his many supporting roles Mundin typically played a bumbling yet lovable comedy character, but here he is forceful, passionate and rather moving. Had such a thing existed in 1933, he could have been in line for a Best Supporting Actor award. But, aside from all these qualities, why did Cavalcade of all things appeal to the Academy, which was not exactly cosmopolitan in those days? The answer may be that the mood of the picture was very apt for the times. This was of course the height of the depression, and despite appearances Cavalcade is a rather downbeat affair. The gung ho optimism of the Boer war is replaced by the bitter folly of the World War; characters disappear from the narrative, everyday life becomes increasingly impersonal, until the final scenes are almost despairing. And yet this is not some tale of personal tragedy. Crowds are a constant presence in Cavalcade, with Lloyd using them as a backdrop to a teary farewell, the bookends to a scene or even just a noise heard through a window. In Coward's play characters are killed off in significant events making them symbolic of the losses of a nation. This is a story of great suffering, but it is a story of collective suffering, and this makes it comparable to the most poignant and affecting pictures of depression-era Hollywood.",
         "That was a chapter heading in a book on the making of KING KONG. KING KONG which received no Oscar nominations and this one (1) won BEST PICTURE. That is why we were very interested in seeing it and were not disappointed. No need to go over the films short comings which some other reviewers have done. Though we don't see how being shot in B&W is relevant since that was the prevailing technology of the time. The importance of the film is how the post (WWI) war generation viewed themselves and the tragedies, personal and international that transformed their world. The two (2) most powerful being the brief Titanic sequence and the montage of WWI where young men in an unending stream march into a Dante's Inferno never to return from that circle of hell. How the confidence of the Victorian/Edwardian age was shattered and their Empires were swept away or Gone With The Wind. Film has clearly had it's influence and the most pronounced was in the SUPERIOR Jean Marsh television series UPSTAIRS DOWNSTAIRS. If you cannot feel empathy for the characters of CAVALCADE you will in this. Do yourself a favor and watch CAVALCADE first. Watching both might get some people to, dare I say it, even read a book about that time period and realize that the current time does not have a monopoly upon conflict and pain. One final comment KING KONG should of WON."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": ["Fox Film Corporation"],
      "summaries": ["A cavalcade of English life from New Year's Eve 1899 until 1933 seen through the eyes of well-to-do Londoners Jane and Robert Marryot. Amongst events touching their family are the Boer War, the death of Queen Victoria, the sinking of the Titanic and the Great War."],
      "budget": 1180280
   },
   "movielensId": 1930,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-02-08",
      "dvdReleaseDate": "2010-12-07",
      "directors": ["Frank Lloyd"],
      "runtime": 110,
      "movieId": 1930,
      "title": "Cavalcade",
      "mpaa": "",
      "actors": [
         "Diana Wynyard",
         "Clive Brook",
         "Una O'Connor",
         "Herbert Mundin",
         "Beryl Mercer",
         "Irene Browne",
         "Tempe Pigott",
         "Merle Tottenham",
         "Frank Lawton",
         "Ursula Jeans",
         "Margaret Lindsay",
         "John Warburton",
         "Billy Bevan",
         "Dickie Henderson",
         "Douglas Scott",
         "Bonita Granville",
         "Betty Grable"
      ],
      "imdbMovieId": "0023876",
      "originalTitle": "Cavalcade",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["P5hCuJBlGe0"],
      "plotSummary": "A cavalcade of English life from New Year's Eve 1899 until 1933 seen through the eyes of well-to-do Londoners Jane and Robert Marryot. Amongst events touching their family are the Boer War, the death of Queen Victoria, the sinking of the Titanic and the Great War.",
      "tmdbMovieId": 56164,
      "avgRating": 2.89375,
      "releaseYear": "1933",
      "numRatings": 80,
      "posterPath": "/uVmkQoxPlF8Vvx2TrLOrF08STNH.jpg"
   }
}