{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "producer",
            "id": 33879
         },
         {
            "name": "broadway",
            "id": 156028
         },
         {
            "name": "ziegfeld",
            "id": 190122
         }
      ],
      "imdb_id": "tt0027698",
      "video": false,
      "title": "The Great Ziegfeld",
      "recommendations": [
         43278,
         42861,
         65203,
         27367,
         25430,
         33680,
         1882,
         23383,
         28966,
         24481,
         106887,
         17661,
         56164,
         34106,
         43266,
         146928,
         22638,
         15919,
         5769,
         144994
      ],
      "backdrop_path": "/zrZ90x3TFnt2HAj2OjqKhQQWruz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Florenz Ziegfeld Jr.",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f38bd",
               "name": "William Powell",
               "profile_path": "/p9RKEHo2m3VPoYPejwFkI7PwqZY.jpg",
               "id": 32428,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Billie Burke",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f38c1",
               "name": "Myrna Loy",
               "profile_path": "/2CR0ZjUmMWU5F03EVN32vnxkNvB.jpg",
               "id": 13577,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Anna Held",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f38c5",
               "name": "Luise Rainer",
               "profile_path": "/kX4vs7uLsRwAV3wRsXlO86Q63MA.jpg",
               "id": 125482,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Billings",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f38c9",
               "name": "Frank Morgan",
               "profile_path": "/wqZaxQOgxkBnfSP7i2OMbBAVMI9.jpg",
               "id": 9067,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Fannie Brice",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f38cd",
               "name": "Fanny Brice",
               "profile_path": "/zMV6Q2qMje5DzLw26yl1wu2i5vC.jpg",
               "id": 129432,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Audrey Dane",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f38d1",
               "name": "Virginia Bruce",
               "profile_path": "/qTtSm59QeywDqLYi1LJSQQ4YWH9.jpg",
               "id": 95314,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Sampston",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f38d5",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ray Bolger",
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f38df",
               "name": "Ray Bolger",
               "profile_path": "/wTSd4hMEVZpBwhLuM5Jd83XiBwb.jpg",
               "id": 9068,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sidney",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f38e3",
               "name": "Ernest Cossart",
               "profile_path": "/kF0z8MAH4D3XGY0Ngnel0mW9Y58.jpg",
               "id": 100588,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Dr. Ziegfeld",
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f38e7",
               "name": "Joseph Cawthorn",
               "profile_path": "/9upw9SlTd8IZQWuFPRCgLmbPZEm.jpg",
               "id": 34758,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Sandow",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f38eb",
               "name": "Nat Pendleton",
               "profile_path": "/dOtnUOR6bKMkIkPANf4C6JQnXXt.jpg",
               "id": 32430,
               "order": 10
            },
            {
               "cast_id": 32,
               "character": "Stage Singer in \"Pretty Girl\" Number",
               "gender": 2,
               "credit_id": "59a111fdc3a368481e024548",
               "name": "Dennis Morgan",
               "profile_path": "/3vZyWc6rRwV3HoSE37tL0xnWvFL.jpg",
               "id": 33022,
               "order": 11
            },
            {
               "cast_id": 34,
               "character": "Marie",
               "gender": 1,
               "credit_id": "5a62c7f30e0a261a04005ddb",
               "name": "Marcelle Corday",
               "profile_path": "/hStYcWHduKuc9bJbAcDsjMk5jBo.jpg",
               "id": 106092,
               "order": 12
            },
            {
               "cast_id": 33,
               "character": "Ziegfeld's Butler (uncredited)",
               "gender": 2,
               "credit_id": "5a570aa60e0a2607e8033d2a",
               "name": "Robert Greig",
               "profile_path": "/ze6PfVLC0AaaoKkwtrJtOLuZkWa.jpg",
               "id": 30262,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f38b9",
               "name": "Robert Z. Leonard",
               "profile_path": "/w6wkz4NRYhhOTWqVjXvoHAWj6yQ.jpg",
               "id": 93906,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f38db",
               "name": "William Anthony McGuire",
               "profile_path": null,
               "id": 149117,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5646a9329251413ad50017bd",
               "name": "Hunt Stromberg",
               "profile_path": null,
               "id": 109853,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5646a97a9251413acf001806",
               "name": "William S. Gray",
               "profile_path": null,
               "id": 1167084,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5646a981c3a36826140019d9",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5646a9889251413acc00186b",
               "name": "Eddie Imazu",
               "profile_path": null,
               "id": 116723,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5646a990c3a3682608001849",
               "name": "Adrian",
               "profile_path": "/fnsEX7RnTRGuh32x8WmHrtz25D5.jpg",
               "id": 9064,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "56cdd94b9251415cdf0032c8",
               "name": "Merritt B. Gerstad",
               "profile_path": null,
               "id": 1498,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56cdd9559251415cd700319e",
               "name": "George J. Folsey",
               "profile_path": null,
               "id": 12307,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56cdd95e9251415cd70031a1",
               "name": "Ray June",
               "profile_path": null,
               "id": 16750,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56cdd965c3a3682762003287",
               "name": "Karl Freund",
               "profile_path": "/rp4KICz1DHmkYRlzkrqKWwWZm9U.jpg",
               "id": 70,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56cdd96dc3a3682773003175",
               "name": "Oliver T. Marsh",
               "profile_path": null,
               "id": 127523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56cdd97bc3a36827590032fd",
               "name": "Arthur Lange",
               "profile_path": null,
               "id": 100579,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.3225,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43277,
      "vote_count": 21,
      "budget": 0,
      "overview": "Lavish biography of Flo Ziegfeld, the producer who became Broadway's biggest starmaker.",
      "similar": [
         31777,
         705,
         872,
         194662,
         1934,
         30197,
         11382,
         9899,
         8012,
         382589,
         10218,
         16633,
         9583,
         6964,
         10805,
         16858,
         44052,
         270352,
         28658,
         409447
      ],
      "original_title": "The Great Ziegfeld",
      "runtime": 176,
      "poster_path": "/7wkIYI2r0ICajBcCW0JlIT3zSwc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1936-04-08",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The Last Word In Entertainment!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Z. Leonard"],
      "runtime": 110,
      "synopsis": "Florenz Ziegfeld Jr. was born to an upper-middle class family in the late 19th century. From his father he inherited taste in classical music, and his mother taste in fashion and genteel manners. Dr. Ziegfeld had hoped that his son will takeover the family music reservoir, but after the success of his show in the 1893 World Fair, Flo Ziegfeld was determined to become a showman. Learning from his mistakes in the World Fair, Flo combined attraction with sex appeal and took Sandow the Strong Man on a successful nation-wide tour. After he and Sandow parted ways, Flo was on his way to Europe in search of new talent. He ran into best friend Billings during the crossing. Billings and Flo were both show producers and extremely competitive with each other. Sensing that Billings was in London to sign up a mysterious new talent, the conniving Flo found out who the girl was and put his womanising tricks to their best use. He convinced French singing sensation Anna Held to sign with him instead even though he was down to his last 50 cents. Always living lavishly on borrowed money, Flo managed to built some connections and got enough money to put on the show, but other than commenting on Anna's exceptional beauty, her singing received little attention from the American audience, especially the women. A master publist, Flo had 20 gallons of milk sent to Anna's apartment everyday and purposedly refused to pay the bill. The creditor sued him and Anna's alleged beauty secret - her milk baths - made headlines. Anna Held became household synonyms for what's beautiful and fashionable, Flo's accountant stopped seeing red in the books. By 1907, Flo and Anna had been married for some time and Flo found it boring to feature only one girl in a show. He wanted to produce a show featuring girls, lots of girls; and the stage would be so big that even the audience in the last row would be able to see the performance. Flo sold the idea to Billings, Billings sold it to famous producer Erlanger; and so began 24 years of the Zigfeld Follies. Flo's endless affairs, especially the one with Follies star Audrey Dane, eventually ruined his marriage and Anna divorced him. He later fell in love with stage actress Billie Burke, they got married and had a daughter named Patricia. Flo's extravagant lifestyle and debt began to catch up on him. In 1929, Billie sold all of her jewelry to finance Flo's new shows. He made a Zigfeld-style comeback with four hit shows running simoutaneously on Boardway. But Flo's glory was short-lived, the stock market crash ruined everyone and Flo lost everything. An old and beaten Flo became seriously ill and Billie had to work to support him. After a visit from old friend Billings, Florenz Ziegfeld Jr. died his apartment, located right across the street from the Ziegfeld Theatre sign.",
      "writers": ["William Anthony McGuire"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0027698/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwMjI5NjQ3NV5BMl5BanBnXkFtZTgwNTU4NzY1MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Powell, Myrna Loy, Luise Rainer | See full cast and crew »"],
      "reviews": [
         "Like some huge, lumbering, Paleozoic beast with a heart, nothing like this film has existed in a long time. And I doubt that there will be anything like it again. \"The Great Ziegfeld\" is a grandiose, three hour, B&W cinematic opus that chronicles the true story (more or less) of the professional life of legendary producer/showman \"Flo\" Ziegfeld, played convincingly by William Powell. It is an interesting, lovable film because it is so historically ... quaint. Structurally, the narrative takes a chronological approach. However, except for the film's starting year of 1893 and the ending soon after the 1929 stock market crash, no dates are given, a shortsighted flaw in the screenplay. But during this roughly forty-year period we see Ziggy's ambition unfurl into a successful career of producing some of the most extravagant musical shows in history. And throughout, the theme remains the same: to \"glorify the American girl\", that is to say to glorify the early twentieth century stereotyped image of the American girl. Despite his success as a showman, Ziggy was constantly plagued with financial problems, and embroiled in relations with women, the two most important being: the humorously indecisive Anna Held, and the lovely Billie Burke. More interesting to me than the biography is the lavish, grandiose production numbers. In the most grandiose of all, Dennis Morgan sings \"A Pretty Girl Is Like A Melody\", as the camera ascends a slowly revolving spiral staircase adorned with \"Ziegfeld girls\" in outlandish costumes. The set, resembling a wedding cake, is about as tall as it is wide, with the stage curtain rising to what seems like stratospheric heights. The film's strengths are its humorous script, the dazzling sets, the glamorous costumes, the music, a cameo appearance by Fanny Brice, and a great tap dance routine by Ray Bolger. My main complaint is the film's length. Also, I find it curious that this big budget beast with its theme of wealth and beauty came out right in the middle of the Great Depression. MGM must have been on a colossal ego trip. Overall, \"The Great Ziegfeld\" is fun, and definitely worth watching, especially as a time capsule to an entertainment era that is gone forever.",
         "THE GREAT ZIEGFELD (Metro-Goldwyn-Mayer, 1936), directed by Robert Z. Leonard, and choreography by Seymour Felix, stars William Powell as the legendary Florenz Ziegfeld Jr. (1869-1932), in a fact-and-fiction musical biography that can be summed up from its opening credits, \"suggested by romances and events.\" From the very start, with its very impressive theatrical lighted title credits lasting over two minutes, one would expect this to be a lavish scale production, and it is. So lavish that it leaves the impression the initials of MGM actually stands for Mighty Grand Musical, considering its great length of three solid hours (180 minutes), or two movies for the price of one. What an impression THE GREAT ZIEGFELD must have made in 1936, becoming an Academy Award as Best Picture for that year. Since the Ziegfeld name was still in recent memory, it assured box office appeal. The name of Anna Held (1873-1918) might be one for the history books. Because of Luise Rainer's carnation of this popular actress whose fame was the early part of the twentieth century, the Held name is most associated with Rainer than as the first Mrs. Ziegfeld. The plot traces the career of Florenz Ziegfeld Jr. (William Powell), starting as a carnival barker at the 1893 Chicago Fair, his discovery and exploitation of Sandow, the Strong Man (Nat Pendleton); his departing for Europe where he competes with his best friend and rival, Jack Billings (Frank Morgan), for not only obtaining the services of his servant, Sidney (Ernest Cossart), but beating him to the punch by signing a popular French actress named Anna Held (Luise Rainer), to a performing contract with him back in America. To be sure he wouldn't lose his prize star, Ziegfeld marries her. During their somewhat stormy marriage, Florenz Ziegfeld stages extravagant shows that makes him world famous. Constantly surrounded by gorgeous show girls, Ziegfeld has his share of problems, especially with Audrey Dane (Virginia Bruce), a temperamental showgirl responsible for his divorce from Anna. Ziegfeld later meets and later marries Billie Burke (Myrna Loy), an accomplished actress in her own right, who not only bears his a daughter, Patricia (Jean Holland), but stands by him during his theatrical downfall and setback after the 1929 Stock Market Crash. On the musical program combining old and (new songs by Walter Donaldson and Harold Adamson), features: \"I Wish You'd Come and Play With Me,\" and \"It's Delightful to Be Married\" (both sung by Luise Rainer); \"If You Knew Susie\" (sung by Buddy Doyle imitating Eddie Cantor in black-face); \"A Pretty Girl Is Like a Melody\" by Irving Berlin (sung by Dennis Morgan/voice dubbed by Allan Jones); \"You Gotta Pull Strings\" (sung by chorus girls); \"She's a Follies Girl\" (sung and danced by Ray Bolger); \"You\" (sung by chorus); \"You Never Looked So Beautiful Before\" (sung by Virginia Bruce/chorus); \"Yiddle in the Fiddle\" by Irving Berlin; \"Queen of the Jungle\" and \"My Man\" by Channing Pollack and Maurice Yvaine (all sung by Fannie Brice); \"Look For the Silver Lining\" by Jerome Kern; and \"A Circus Must Be Different in a Ziegfeld Show\" (sung by chorus, performed by Harriet Hoctor), Montage score to Broadway shows: RIO RITA, WHOOPEE, THE THREE MUSKETEERS and SHOW BOAT (briefly playing \"Ol Man River\" on the soundtrack). \"A Pretty Girl is Like a Melody,\" an authentically reproduced eight minute musical segment is certainly the film's true highpoint. The \"granddaddy of all Hollywood's musical biographies, THE GREAT ZIEGFELD is a very impressive film with an impressive cast. While consisting of Ziegfeld headliners as Fannie Brice, Ray Bolger and Harriet Hoctor appearing as themselves, it also features A.A. Trimble and Buddy Doyle authentically duplicating Will Rogers and Eddie Cantor at best. This doesn't go without some regrets by not having the likes of W.C. Fields or Marilyn Miller recreating what they did best under Ziegfeld. Another letdown is having Fanny Brice singing her signature torch song, \"My Man,\" in incomplete form while the story moves to another scene. Rainer's role of Anna Held did win her an Academy Award as Best Actress for her performance based of her famous \"telephone scene\" congratulating ex-husband on his marriage to Billie Burke as she holds in her true emotions. While Billie Burke (1885-1970), then currently a well known film actress, could very well have portrayed herself Myrna Loy steps in for box office appeal. Frank Morgan, the fictional Billings, gives a performance worthy for Best Supporting Actor category while William Powell, the main focus from start to finish, was strangely overlooked by the academy. In 1978, there was another tribute to Florenz Ziegfeld, a TV movie titled ZIEGFELD: THE MAN AND HIS WOMEN, starring Paul Shenar as Ziggy, but it failed to live up to the expectations to the 1936 original. At 156 minutes, it seemed longer than the original. Unlike the Powell version, the 1978 bio-pic remains forgotten. Unlike similar musical biographies of this nature made popular in the 1940s, THE GREAT ZIEGFELD captures the spirit of its time frame, with costumes and women's hairstyles being historically accurate. A movie at this extreme length tends to have its slow spots, which it does, but overall, a large scale production that only MGM can recreate. Distributed to home video by MGM/UA in the late 1980s, the roadshow version consisting of entrée and closing music, deleted scenes and intermission title has been inserted into the 2005 DVD release. THE GREAT ZIEGFELD can also be found on Turner Classic Movies, especially during its annual \"Thirty Days of Oscar.\" (****)",
         "Before anybody goes on for one minute more about how brilliant Luise Rainer is as Anna Held, let's remember that she took the Oscar from Garbo's Camille. I mean, come on. Rainer is pretty and her instincts are right, and her famous \"telephone scene\" expertly employs the old smiling-through-tears device. But it's hardly as challenging a role as Marguerite, and Rainer's undeniable Continental charm can go only so far. The movie itself is a corker. William Anthony McGuire's screenplay is far above average for this musical-biography genre; it's full of smart wisecracks, and while it heavily fictionalizes Ziegfeld's life and persona (it makes him much more suave and irresistible than he was), it gets the big things right: his invention of the big musical revue, his obsession with glorifying the American girl, his unparalleled showmanship and eye for talent. Speaking of talent, you get a full, uninterrupted, great Ray Bolger number, several clever and lavish production numbers, and a snippet of Fanny Brice (but cutting away from her \"My Man\" is unforgivable). The actors playing Eddie Cantor and Will Rogers are amusingly terrible. And Virginia Bruce is memorably nasty as a temperamental showgirl. The Academy named this Best Picture of 1936. And you know, it probably was.",
         "Boy, is this movie long......but worth it for the most part. William Powell is, as usual, his urbane, sophisticated self in a romanticized portrayal of Florenz Ziegfeld. Myrna Loy,leaving behind her wisecracking Nora Charles persona, does a fair job as Billie Burke. Burke, whose movie career was based on dithering, silly women, was once a beauty who graced the Follies. Loy doesn't come across as either but she has never given a bad performance so she is believable. But Louise Rainer as Anna Held is the one to watch here. A beautiful doll-like creature, she enchants you with her performance. The famous telephone scene may be overrated somewhat but it worked for me....and obviously for the Academy...it garnered her an Oscar. The music is so wonderful and the \"Pretty Girl is Like a Melody\" with Dennis Morgan is eye candy. One glaring fault is that there is a very short sequence with the great Fanny Brice in which she is singing \"My Man\" ( probably one of the greatest torch songs of all times) and it is just cut-off in mid warble as the story goes on to another scene. An unforgivable sin!! There could have been a little less talk and a little more singing/dancing in the movie but since it is a biography and not primarily a musical, all, except for the Brice faux pas, is forgiven!",
         "I suspect that had Dashiell Hammett never written a successful comic pot boiler detective story called THE THIN MAN, William Powell's best remembered role would be as Florenz Ziegfeld in THE GREAT ZIEGFELD. Here he captured that brilliant showman's vision and drive with just the right degree of sophistication. I can't think of few others - maybe Robert Montgomery, but I sadly doubt it (he seems too young) - who could have done as first rate a job. It is really rare for a theatrical presence to maintain himself or herself decades or centuries after their death. Prior to the invention of motion pictures it was impossible (except for the late 19th Century crowd, starting with Edwin Booth, Sir Henry Irving, and Ellen Terry - they had some phonograph recordings) for actors to preserve their personas. Photo stills helped but did not leave much. Occasionally one would \"accomplish\" something for good or ill that people would recall (i.e., John Wilkes Booth), but that was a rarity. Movies changed that by allowing the audience to stretch from the contemporaries to the future ones. There are actual movies of Flo Ziegfeld at work on Broadway. Unfortunately he did not look like Bill Powell (Flo was somewhat fat), but those surviving newsreels showed his energy with his casts and productions. Powell got that side of him right. THE GREAT ZIEGFELD traces the showman from his start as the publicity manager of Eugene Sandow (Nat Pendleton) from the Chicago World's Fair of 1893 to his rise as a major Broadway impresario from 1900 until 1930. Only the Great Depression destroyed Ziegfeld's career (he lost most of his fortune in the crash). Significantly his fall is showed by the lights of his four currently big shows (including SHOWBOAT, RIO RITA, and THE THREE MUSKETEERS) all fading out one after another. It not only destroyed his career, but it helped kill the poor fellow (he died in 1932). But by that point his historical reputation was established by his series of spectacular Broadway \"Follies\" shows with the likes of Ed Wynn, Fanny Brice, W.C.Fields, Will Rogers, Bert Williams, Walter Catlett, Leon Erroll as the comic leads, and music by such composers as Jerome Kern, Victor Herbert, Irving Berlin, and even the Gershwins. But better was Ziegfeld's use of women - his \"Glorifying the American Girl\" reviews did precisely that, affecting taste in theater spectacles and taste in what beauty in women should be. He had his rivals as pointed out in other reviews here. Among them were the Shuberts, possibly the most successful in the long run (but only because there were several of them, and they did not go bankrupt). Earl Carroll did produce his \"Vanities\", and George White did do the \"Scandals\", but in retrospect (for all the talent they brought to their shows) these were pale imitations. In Carroll's case he skirted the level of decency by suggesting his chorus girls were naked in some of the sketches. Ziegfeld was no saint but he knew what was acceptable behavior in theatrical production on stage. This film had a good cast. Besides Powell, the women in his life (Anna Held, his chorus girl girlfriend, and Billie Burke) are played well by Louise Rainer, Virginia Bruce, and Powell's movie \"wife\" Myrna Loy. Rainer (as the betrayed Anna) got her first \"Oscar\" for this role, most likely for the emotional \"telephone\" scene. Her part is actually a substantial one, but due to the size of this film it has always been seen as a short supporting bit. This is a trifle unfair. Virginia Bruce brings a nice calculating eye to her performance, undermining the Ziegfeld - Held relationship, but slowly losing the showman due to her increasing alcoholism. Loy was really lucky. Once she got the role she contacted the living and active Billie Burke and had discussions about how to accurately portray the second Mrs. Ziegfeld. She wisely does not try to imitate Billie's familiar syrupy upper register voice. Frank Morgan appears as a friendly rival or Ziegfeld's, both in business and in the boudoir. One likes him as one usually likes Morgan's comic characters. My favorite performance is that of Fanny Brice playing herself. The film was made the year after the death of Will Rogers so that he was not around (he possibly could have been borrowed). Fields was out - Ziegfeld had had plenty of trouble with that curmudgeon on Broadway, and MGM probably knew that Fields would have demanded equal billing to Powell. Wynn was mostly still on Broadway. One does wish Catlett and Erroll might have been used. But we have Fanny in her glory, culminating in her singing her most famous number - \"My Man\". That alone is worth watching the film for. As for the showcase production number on the spiraling tower, it is quite impressive (I doubt if Ziegfeld could have put it on the stage of his New Amsterdam Theater), but I agree that the dubbing of Dennis Morgan's voice by Allan Jones is totally inexplicable to this day.",
         "This is one of the best Hollywood bios I've ever seen. The pacing is fast for a movie from 1936 and William Powell and especially Louise Rainer are fantastic. Filmed in one take, the \"A Pretty Girl Is Like a Melody\" musical number is incredible. One also gets to see Fanny Brice in a rare film appearance, and if you remember Barbara Streisand in Funny Girl you'll see how close Streisand got to perfectly imitating Brice. Also, Ray Bolger does an incredible dance routine which shows off his talent to greater effect then his performance as the Scarecrow in The Wizard of Oz. He's unbelievable. My only complaint, and this is about the DVD, is that Warner should have made the effort of restoring this amazing picture. Most of it looks pretty good but there are many sections with scratches and speckles.",
         "William Powell stars as Florenz Ziegfeld in his \"biography\" of the great Broadway producer. This is a lush and long film filled with great scenes and a few that are too long. Clocking in at about 3 hours, THE GREAT ZIEGFELD is one of MGM's biggest attempts at creating a blockbuster musical, and it won the Oscar for best film. Powell is, as always, terrific. Oddly he did not receive an Oscar nomination for this film but did get one the same year for MY MAN GODFREY. Luise Rainer won the best actress Oscar for her performance as Anna Held. Myrna Loy plays Billie Burke. The great Fanny Brice appears as herself and just about steals the show until they stupidly and abruptly cut away from her as she starts singing \"My Man.\" She doesn't show up again. Ray Bolger gets a whole number to himself. And Dennis Morgan fronts the mammoth \"A Pretty Girl Is Like a Melody\" number (although it's the voice of Allan Jones), which ranks among the great production numbers of the era. The camera slowly pans up a seemingly endless spiral staircase filled with pretty girls as draperies are raised to expose more and more staircase. Then we finally reach the top with Virginia Bruce posed there. It's a giddy and spectacular sequence. The ballet sequence featuring Harriet Hoctor is rather a bore. I'd rather have seen more of Fanny Brice. Brice is hilarious in the dressing-room with a big blonde. Who was she? Is it Gertrude Astor? Powell and Rainer are really excellent in this film. Notable co-stars include Frank Morgan, Joseph Cawthorn, Herman Bing, Marcelle Corday, Nat Pendleton, and Reginald Owen. And while Brice appears as herself the Will Rogers and Eddie Cantor appearances are fakes. An excellent film in the old style and worth the 3 hours it takes to watch it. Ziegfeld was a great showman and deserved this fabulous tribute. He died in 1932, having given the world a number of major stars and great shows.",
         "Long but well worth hanging in there for. Luise Rainer gives an outstanding well-deserved Oscar winning performance as Anna Held. The first half of the movie which covers the period of Ziegfeld's marriage to Held is the better half of the movie. Great re-enactment of stage Follies productions. 9 out of 10.",
         "This film was shown on TCM recently, in the DVD format, since it has an overture and a few minutes of \"exit music\". The copy was excellent, as it has been greatly restored as it looks extremely smooth to the eye. Florenz Ziegfield was one of the most brilliant producers of this country at the end of the 19th and beginning of the 20th centuries. He had an eye for what worked on a stage. He was also the discoverer of a lot of the talent that went to have enormous careers of their own, long after they appeared in one of Mr. Ziegfeld's extravaganzas. Robert Z. Leonard in directing this film had a lot of contributors, no doubt, but it's probably Adrian, the costume designer par excellence that gave this movie a lot of class by recreating for the screen some of the costumes that were associated with Ziegfeld. William Powell portrays the great Ziegfeld. Mr. Powell is amazing in his interpretation of the creative man on the screen. He is this man he is playing on the screen; he is totally convincing he was born to play the role. Actually the film leaves a lot of things unexplained. We know that Anna Held is out of the picture, after her divorce, but nothing is mentioned that she had died at all. Also, the relationship with his second wife, Billie Burke, comes as an afterthought since she only appears in the last part of the movie. Luise Ranier made a compelling Anna Held, the French actress, who obviously never understood her husband, even though it's clear she loved him. She appears as a complete insecure person, never knowing what to do, or what to decide on. As far as the Oscar she won for playing this role, it eludes my comprehension, or maybe that year her competition must have been poor. Myrna Loy as Billie Burke gives a radiant performance. She was always a convincing actress and in the film she demonstrates her versatility in playing a musical comedy star. The young Myrna Loy was a gorgeous creature, as proven in this film. The costumes from some of the musical numbers are incredible. Of course, they were made to suit the theatricality of whatever Mr. Ziegfeld presented. Such extravagant numbers will never be presented on a Broadway stage ever again as the cost would be prohibitive. Virginia Bruce, Frank Morgan, Ray Bolger, Fanny Brice appear in the film, but of course, the picture is dominated by William Powell from beginning to end.",
         "Technically, this is a very well-made and slick movie. MGM certainly put a lot of energy into making this a top movie. However, the movie falls prey to what OFTEN happened with Hollywood bio-pics of the 1930s and 1940s--they don't let truth get into the way of a good story. The true story of Ziegfeld just doesn't come through in this picture--just a sanitized approximation of the man. This is alluded to somewhat in the movie, but the real life Ziegfeld was a rather selfish womanizer who left his poor wife with hardly a dime at his death. Billie Burke was the last Mrs. Ziegfeld and she returned to the stage due to these financial woes--hence, she probably never would have ended up in the Wizard of Oz or the Topper series if it wasn't out of necessity. It would have possibly been more interesting if the portrayal had focused on this aspect of him as well."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "At the 1893 Chicago World's Fair, sideshow barker Flo Ziegfeld turns the tables on his more successful neighbor Billings, and steals his girlfriend to boot. This pattern is repeated throughout their lives, as Ziegfeld makes and loses many fortunes putting on ever bigger, more spectacular shows (sections of which appear in the film). French revue star Anna Held becomes his first wife, but it's not easy being married to the man who \"glorified the American girl.\" Late in life, now married to Billie Burke, he seems to be all washed up, but...",
         "This biography follows the ups and downs of Florenz Ziegfeld, famed producer of extravagant stage revues."
      ],
      "budget": 0
   },
   "movielensId": 1932,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-04-08",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["Robert Z. Leonard"],
      "runtime": 176,
      "movieId": 1932,
      "title": "The Great Ziegfeld",
      "mpaa": "NR",
      "actors": [
         "William Powell",
         "Myrna Loy",
         "Luise Rainer",
         "Frank Morgan",
         "Fanny Brice",
         "Virginia Bruce",
         "Reginald Owen",
         "Ray Bolger",
         "Ernest Cossart",
         "Joseph Cawthorn",
         "Nat Pendleton",
         "Dennis Morgan",
         "Marcelle Corday",
         "Robert Greig"
      ],
      "imdbMovieId": "0027698",
      "originalTitle": "The Great Ziegfeld",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["3EVmRzfCbOU"],
      "plotSummary": "Lavish biography of Flo Ziegfeld, the producer who became Broadway's biggest starmaker.",
      "tmdbMovieId": 43277,
      "avgRating": 3.34776,
      "releaseYear": "1936",
      "numRatings": 312,
      "posterPath": "/7wkIYI2r0ICajBcCW0JlIT3zSwc.jpg"
   }
}