{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "historical figure",
            "id": 6165
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "devil's island",
            "id": 193275
         }
      ],
      "imdb_id": "tt0029146",
      "video": false,
      "title": "The Life of Emile Zola",
      "recommendations": [
         43277,
         65203,
         56164,
         42861,
         17661,
         97029,
         111469,
         8353,
         97035,
         127759,
         189727,
         144994,
         256650,
         148050,
         25430,
         27367,
         52772,
         70447,
         383266,
         363629
      ],
      "backdrop_path": "/bZ6GAlfd7fz8cQI8d2lwfc4WK0Y.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Emile Zola",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f3907",
               "name": "Paul Muni",
               "profile_path": "/q3WSt8ZkN0D45CDiuVnOSfn0VQl.jpg",
               "id": 13352,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lucie Dreyfus",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f390b",
               "name": "Gale Sondergaard",
               "profile_path": "/mLBpLcaCKbdNPeSEVZDSttVqlBH.jpg",
               "id": 25173,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Capt. Alfred Dreyfus",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f390f",
               "name": "Joseph Schildkraut",
               "profile_path": "/d6n04sRsXJiuX0bolUgNhep4sXE.jpg",
               "id": 24820,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Alexandrine Zola",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f3913",
               "name": "Gloria Holden",
               "profile_path": "/3DsqCoOmWqVw4OKeEQWdWt4gFpm.jpg",
               "id": 100779,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Maitre Labori",
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f3917",
               "name": "Donald Crisp",
               "profile_path": "/vESX6aAjaZlEgHYncLE1y76BFtD.jpg",
               "id": 8841,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Nana (as Erin O'Brien Moore)",
               "gender": 0,
               "credit_id": "5808d1029251410fe30091fc",
               "name": "Erin O'Brien-Moore",
               "profile_path": "/cdoXiEVGQojG0kYAViEcxiliOwx.jpg",
               "id": 93698,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Charpentier",
               "gender": 2,
               "credit_id": "5808d10ec3a36874cd00963a",
               "name": "John Litel",
               "profile_path": "/kpNAy4IYFE3OXaOG60RPhkyp70d.jpg",
               "id": 16766,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Colonel Picquart",
               "gender": 2,
               "credit_id": "5808d11dc3a368752b008d76",
               "name": "Henry O'Neill",
               "profile_path": "/65tPuizhifyCJz5TR2bV1ygnmnU.jpg",
               "id": 20368,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Anatole France",
               "gender": 2,
               "credit_id": "5808d12cc3a368752b008d7f",
               "name": "Morris Carnovsky",
               "profile_path": "/pJ5KKB1e2xeRd6Ajv9aAXZBXr0i.jpg",
               "id": 31977,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Major Dort",
               "gender": 2,
               "credit_id": "5808d13b9251410d8e0094c6",
               "name": "Louis Calhern",
               "profile_path": "/k0uuHPK8XgKO7D7iOF2SrxVeE69.jpg",
               "id": 4343,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Commander of Paris",
               "gender": 2,
               "credit_id": "5808d1489251410fe3009232",
               "name": "Ralph Morgan",
               "profile_path": "/5By4MqjMaQY7aOx1kninnw5331N.jpg",
               "id": 103449,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Major Walsin-Esterhazy",
               "gender": 2,
               "credit_id": "5808d1579251410f9d00968c",
               "name": "Robert Barrat",
               "profile_path": "/hP59p1hbbBizWea0ayGoCXjY8r5.jpg",
               "id": 88672,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Paul Cezanne",
               "gender": 2,
               "credit_id": "5808d165925141033e00999c",
               "name": "Vladimir Sokoloff",
               "profile_path": "/pbgNdX1vgSLIbB2phKiuOQlTGAi.jpg",
               "id": 14533,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Georges Clemenceau",
               "gender": 2,
               "credit_id": "5808d173c3a368672f0085d7",
               "name": "Grant Mitchell",
               "profile_path": "/cDZpWgH0qOF4L5nmZJzGIHE5xo3.jpg",
               "id": 30215,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Chief of Staff",
               "gender": 2,
               "credit_id": "5808d1819251415dfb00de35",
               "name": "Harry Davenport",
               "profile_path": "/r28I9wuqqhuMtZ0iBzoi1A74ljp.jpg",
               "id": 11502,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f3903",
               "name": "William Dieterle",
               "profile_path": "/tZGQR1umCzJm3OM22zMJSFn8gCY.jpg",
               "id": 49214,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f391d",
               "name": "Norman Reilly Raine",
               "profile_path": null,
               "id": 67427,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f3923",
               "name": "Heinz Herald",
               "profile_path": null,
               "id": 114367,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.442927,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43278,
      "vote_count": 24,
      "budget": 0,
      "overview": "Bio epic of the famous writer.",
      "similar": [
         462,
         640,
         769,
         5915,
         11202,
         267192,
         45317,
         51828,
         371638,
         324786,
         363676,
         389015,
         407445,
         318846,
         396371,
         323677,
         228970,
         274479,
         10161,
         152532
      ],
      "original_title": "The Life of Emile Zola",
      "runtime": 116,
      "poster_path": "/5zNJzq2wy716GMiQxoBQd8Wx2fS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1937-10-02",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "He'll Hold You In Silence As Deep As Your Emotions !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William Dieterle"],
      "runtime": 116,
      "synopsis": "As a writer who, like Charles Dickens, saw no part of society unworthy of his attention and scrutiny, Emile Zola (Paul Muni) gradually rises, through his novels, as a moralist who semes to understand, empathize with, and appreciate people in all stations in life. His fame and credibility as a champion of the people give him the courage to intervene in the notorious Dreyfus affair, in which Alfred Dreyfus, a Jewish officer in the French army, is, despite the lack of evidence against him, found guilty of the treasonous acts of another Army officer and exiled to Devil's Island. Within a year of Dreyfus' arrest, it becomes clear to several in the French army that Dreyfus was innocent, but they resolve to sweep the mistake under the rug rather than rectify it. When it later becomes evident to Zola that the Dreyfus affair is a coverup, the resolution of which might impugn the honor of the French army, he realizes that he won't have an easy time exposing the truth, but he tries. He is incensed when the real perpetrator, Esterhazy, is found innocent in a rigged court martial hearing. Disenchanted, Zola risks his career and fame by writing a letter to the President of France and has it published in a major newspaper. The article, called J'Accuse, is a direct accusation of the French army in covering up the innocence of Dreyfus to protect one of its own, and the result of this unpopular letter is the arrest of Zola on a libel charge. To the army's dismay, the court proceedings against him give Zola an even greater platform from which to publicly expose the weakness of the case against Dreyfus. In the courtroom, the army has little choice but to try to bully and discredit the popular Zola, and causes him to be shunned by many, even in the country in which he is a revered novelist and moralist. Rather than remaining in France after his conviction, Zola sees it fit to flee to England, his courage and conviction in uncovering the truth unimpaired. The Dreyfus case is ultimately reopened, and Dreyfus is offered a pardon, which he accepts. Dreyfus is set free and promoted in the French army, and Zola can now return to French soil, his actions vindicated by the pardon. Sadly, Zola dies before the French court fully exonerates Dreyfus, but his valiant fight in the Dreyfus affair only added to his reputation of one of France's greatest men. Zola's courageous and zealous pursuit of the truth in his novels and in his life make him a symbol of morality and integrity for the ages.",
      "writers": [
         "Norman Reilly Raine",
         "Heinz Herald"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0029146/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMTI1MjQ0MV5BMl5BanBnXkFtZTgwMDk1NjM5MjE@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Muni, Gale Sondergaard, Joseph Schildkraut | See full cast and crew »"],
      "reviews": [
         "In 1937, The Life of Emile Zola was nominated for the largest number of awards, ten. The movie won three including Best Picture. However, sadly and in some ways shamefully, this film has been ridiculed for being dated today, it's ways and means a little obsolete, and it's style rather unusual. That is downright unjust! The style which is portrayed in this remarkable seventy year old film is quite conventional. The dialogue is perhaps overwritten, but the powerful story is there, and the story line is enhanced by intelligent dialogue to say the least, as well as, first rate performances by an excellent cast, preferably Paul Muni (giving possibly his best performance) as Emile Zola and supported well by Joseph Schildkraut as Dreyfus. Not to mention, the film is technically excellent. Editing, costuming, lighting - without doubt, and all the production values stand up beautifully even several decades later. Sure it's a fictionalized version of the life of the great French writer Emile Zola, however, great fiction can make a great film and that is the case with The Life of Emile Zola. One may forget that this film was released in 1937 when anti-Semitism was again sweeping the continent of Europe, and for that very reason, the word \"Jew\" is never mentioned and we are only given a short visual reference. To avoid lawsuits from their descendants, only Major Dort and Major Esterhazy names were specifically identified. Others are referred to as the Chief of Staff, the Minister of War, etc. Also, Dreyfus was not freed and restored to rank in 1902, the year of Zola's death, but in 1906 after being found guilty again in an 1899 retrial. These historical errors can be forgiven, because it's the films message which stands and given the current climate, the movie's message is all the more important. The shifting focus of this film doesn't make it a frustrating experience for modern viewers. In fact, the film flows quite nicely: struggling writer, gets in trouble for his book, then the film follows Zola's success as he becomes a powerful force in society. Eventually we get to 1894, where many claim the film to zoom away from its subject, where the film begins to focus on Dreyfus. With that being said, if you sit down to watch The Life of Emile Zola, don't skip the first third of the movie, because it's every bit as moving and powerful as the dramatic court scene, most notably in the unforgettable self-defense scene in which Muni delivers an outstanding performance. Unfortunately, had Muni not won the previous year for another biopic, The Story of Louis Pasteur, he would have received the Oscar for his portrayal of Zola. Muni was not only nominated for an Oscar for this role but also received awards from many critics groups. Today many dismiss the significant talent of Muni (one of films first devoted actors), however, one cannot deny he had a great deal with elevating the art of film acting.",
         "Paul Muni, one of the five best actors EVER, is magnificent in recreating the life of one of France's most controversial literary figures. Zola reveals every facet of the great man's complex personality and personal successes and learning experiences in a manner that delivers rare insights and consummate entertainment to the audience at the same time. The supporting cast and the direction match Muni's magnificence to the best of their abilities every step of the way. I recommend this as one of the great forgotten films of all time.",
         "Handsomely mounted in the Warner Brothers style of the 30's, and topped off with a stirring Max Steiner score, \"The Life of Emile Zola\" (***) remains a passionately engrossing experience. Refreshingly, the film admits upfront right after the opening titles that it's a fictionalization, something that isn't done nearly as often it should be in today's purportedly \"true story\" docudramas. (These days, this disclaimer is often buried in the fine print at the very end of the credits after nearly everyone has left the theater.) Even so, \"Zola\" remains remarkably true to the facts. It skips lightly over the author's early years in the first 20 minutes and then soars to gripping dramatic heights in the outrageous libel trial that Zola underwent after he published his celebrated \"J'Accuse\" which condemned the hypocrisy and corruption of the military establishment as it falsely accused high-ranking Captain Alfred Dreyfus of treason and then attempted a massive cover-up when it realized it had made a mistake. The movie has been criticized for underplaying the anti-semitic aspects of the Dreyfus prosecution, but it's implied quite neatly in the scene where the camera pans down Dreyfus's resume to his religion while one of his superiors marvels how \"someone like that\" could became an officer. The film does indulge in some pretty fancy compression towards the end. It implies that Dreyfus was reinstated in the Army right after returning from Devil's Island and on the same day as Zola's tragic accidental death. However, according to the Encyclopedia Britannica, the real facts are even more disturbing and incredible. In 1899 after his return, Dreyfus was retried and found guilty again by a court tribunal! However, he was pardoned by the President. He was finally cleared of all charges and reinstated in the service in 1906, four years after Zola's death in 1902. Interesting sidelight: Zola and his devoted wife had no children but he did carry on a 14-year affair with one of his housemaids that produced 2 children. I guess there's no way the Warner Brothers were going to complicate the image of their hero as a saintly crusader for truth and justice by including this spicy little domestic tidbit.",
         "I highly recommend \"The Life of Emile Zola\" for the brilliant performances of Paul Muni, Gale Sondergaard, and Joseph Schildkraut. (Although I still must admit I'm surprised by Schildkraut's Oscar victory...although he certainly does a good job as Alfred Dreyfus, the role doesn't really give him much opportunity to demonstrate his talents. Dreyfus is not shown in any depth; his role consists almost entirely of protesting his innocence and languishing in prison.) Strong performances aside, though, I do have some problems with the film. It strikes me as very odd that a film that makes such a big deal about \"the truth\" is so hesitant at actually depicting it. One of the key issues of the Dreyfus affair, anti-semitism, is never even brought up. The only reference to Dreyfus' Judaism is a passing glimpse on his personnel papers. The filmmakers' reluctance to address such an important part of the story does a disservice to history.",
         "William Dieterle directed this classic biography and was nominated for an Oscar for his work. This movie had ten Oscar nominations, and won best picture in 1938. Paul Muni (The Last Angry Man) was nominated for an Oscar for his performance as Émile Zola, one of the foremost writers in France. Zola and his best friend and confident painter Paul Cezanne, played by Russian born actor Vladimir Sokoloff (Taras Bulba, For Whom The Bell Tolls), who attend the Moscow Academy of Dramatic Art. The story takes place in Paris in 1862. Paul Cezanne and Émile Zola were friends when both were starting their careers. Through ups and downs Zola became financially successful long before Cezanne. He was married and had a successful career as an author. Paul Cezanne then decided to live in the country far away from the city, and told Zola not to be part of the establishment but to fight for truth and justice again. Émile Zola is living comfortable and even getting fat, and is about to became a member of the French Academy for the utmost writers, and to get honored by the Nobel society. He is approached by Lucie Dreyfus, played by Gale Sondergaard (Anna and the King of Siam), whose husband was unjustly court martialed and sent to Devil's Island (Papillion's prison home) because he was accused of betraying his country by disclosing military secrets. Mr. Dreyfuss' case is one of those passionate cases where anti-Semitism is also an issue. It is unbelievable that this specially inhumane trial took place in France, nation for Liberty, Fraternity, and Equality. That what Zola was fighting for. The music by Max Steiner is beautiful. He was also nominated for an Oscar for best music score. Anatole France is also part of the story. My favorite scenes: the folding umbrellas, Zola getting his first pay check as a best seller author, the conversations between Zola and Paul Cezanne. The determination of Ms. Dreyfuss and she goes to talk to Zola, her last hope. My favorite quotes: \"There are times when the most courageous thing is to be cowardly\". This is a great biography. It is a Schindler's list type of story! It has great passion, deep commitments, love, great music, and we get to know a bit more about French literature. Thanks to my dad, who was passionate for literature and majored in languages, I was brought up with a library of books where one could find the internationally acclaimed classics. Émile Zola's works were among dad's favorite. That was what made me purchase the tape. I highly recommend it. You can learn a lot from this movie!",
         "Such occasions are not unlike great arias in operas: the stage lights softly dim and follow spot brightens as all cast characters (and audience) lean forward to focus on the delivery. Such a moment occurs in \"The Life of Emile Zola\" as Paul Muni as Zola steps to the platform to deliver his courtroom defense speech. Against all the odds of a jeering mob and negative press, he proceeds to offer a seven minute oration. The scene is a set-up for Muni, and the camera, editing, and staging are all designed for the actor to deliver his thespian goods. He doesn't disappoint. Two other cinematic courtroom speeches are comparable: Alec Guiness as Benjamin Disraeli in \"The Mudlark\" (1950) enjoyed the rare opportunity of having his six minute, uninterrupted speech done in a single, slow tracking shot; and Gary Cooper as Howard Roark in \"The Fountainhead\" (1949) held a courtroom breathless for over five minutes, defending his act of poetic, if not Randian-judicial, justice. In Muni's case, his defense scene turned out to be a highpoint of an intriguing acting career. From Yiddish theater to worldwide stardom--with fewer that two dozen films to his credit--Muni constantly enthralled some while leaving others doubtful. What's undeniable about Muni is that he achieved stardom on his own power. He was able to convince a goodly number of people, both peers and public alike, that he was indeed not just a good but great actor. While some held a sneaking suspicion that he was a wee bit of a poseur, having never formally studied his craft, it really doesn't matter. Muni didn't win his lucrative acting contracts--or his Academy Award honors--for nothing. Personally, I enjoy his general work, being more partial to roles more close to his own than those of his elders. In latter cases I felt he often tended to go a bit over-the-top with \"stereotypical mannerisms.\" As Zola, though, his earnestness and determination proves convincing, and the film itself is peopled with a powerhouse cadre of Warner Bros. character players. To the film's credit, a pre-enactment inscription admits to the intermingling of fiction with fact for dramatic purposes. This also relieves the production of accusations of historical inaccuracy. All in all, \"The Life of Emile Zola\" is a most engrossing biopic of a courageous literary giant who placed the pursuit of justice above the receiving of worldly accolades.",
         "This well-crafted film is a worthwhile memorial to Émile Zola, one of the finest writers of his era, and one who deserves to be better-known today outside of his own country. It seems likely that Zola, a naturalistic writer who always used lifelike, genuine characters who had both strengths and weaknesses, would probably have been satisfied with the way he is portrayed by Paul Muni and by the screenplay. Zola is shown not as a flawless hero or as a larger-than-life icon, but as a real person with a talent for writing, who was willing to struggle both to establish himself and to remain true to his principles. The movie makes a good selection of events from Zola's life, looking both at his earlier years, when he was struggling to establish himself, and at his later years, when as a respected member of society he had to fight his own reluctance to remain true to his ideals. The supporting cast have smaller parts, but they generally do quite well. Vladimir Sokoloff has a couple of nice scenes as Cézanne, and his interactions with Muni are quite helpful in defining the main character, especially as he changes once attaining personal success. Joseph Schildkraut makes good use of his scenes as Dreyfus. Zola's lifetime was also an interesting and often tumultuous period in France's own history, and the movie provides at least a small taste of that. There was, for example, even more to the Dreyfus situation than is shown here, but it and other historical events are shown mainly as they involved Zola himself - otherwise, to do justice to the events in themselves, the movie would have had to be several times as long. There's plenty here as it is to make it worthwhile, both as a good drama and as a believable portrait of Zola.",
         "Of Paul Muni's three biographical films made at Warner Bros. and directed by William Dieterle (the others were THE STORY OF LOUIS PASTEUR [1936] and JUAREZ [1939]), this was the only one which had never been shown on TV in my neck of the woods; ironically, it was the first to make it to DVD - but, then again, it is the most highly-regarded of them! Still, given the film's reputation (Best Picture Oscar Winner, Leonard Maltin rates it **** in his \"Movies & Video Guide\"), I somehow expected a masterpiece - but, personally, I feel that Dieterle's THE DEVIL AND DANIEL WEBSTER (1941) and THE HUNCHBACK OF NOTRE DAME (1939) are greater achievements. Even so, it's been sometime since I watched a vintage old-style Hollywood film; of late, I've mostly been concentrating on Euro-Cult and World Cinema stuff - but, really, there's no beating the professionalism and sheer entertainment value of a product from the cinema's Golden Age! The film strikes a good balance between Zola's literary career and his struggles for social justice: the latter is mostly devoted to the Dreyfus affair, a veritable cause celebre at the time (cinematically treated two more times in DREYFUS [1931] and I ACCUSE [1958], neither of which I've watched though the latter had turned up some years back on late-night Italian TV!), culminating in one of the finest courtroom scenes ever filmed. Production values are top-notch, the Oscar-winning script appropriately literate (though the constant speechifying and the film's two-hour length - by contrast, LOUIS PASTEUR had been less than 90 minutes but, then, the epic and star-studded JUAREZ was longer still - make for a somewhat heavy-going experience) and Dieterle's handling virtually impeccable; the only unpersuasive aspect, perhaps, is the one-dimensional portrayal of the corrupt French military who callously sent Dreyfus to Devil's Island for treason, and left him there to rot for years - even after they had found absolute proof of his innocence, because that would have meant admitting to a mistake! The cast is filled with wonderful characters actors whose familiarity - and reliability - allows utmost audience involvement every step of the way, despite Hollywood's typically idealized viewing of events. Best of all, naturally, are Muni as Zola (simply brilliant, especially during his show-stopping speech at the trial, and who even ages convincingly!) and Schildkraut (a touching Dreyfus who, in spite of his relatively brief appearance, managed to walk off with the Best Supporting Actor Oscar - though, personally, I would have voted for H.B. Warner in LOST HORIZON [1937]!). Unfortunately, the audio level on Warner's otherwise exemplary DVD is rather low; the supplements include three vintage shorts (described in more detail below), as well as the full 1-hour broadcast of a radio adaptation of the script (obviously compressed but also including some minor additions) - presented by Leslie Howard (who, at the end, even interviews William Dieterle!) and featuring Muni himself, accompanied by Josephine Hutchinson (stepping in for Gloria Holden, who had played Zola's wife in the film).",
         "In a lucrative and highly successful career that saw him play everyone from Spanish savior, Juarez to a cutthroat gangster in Scarface, character chameleon Paul Muni became French novelist Emile Zola in \"The Life of Emile Zola\" (1937). This is perhaps the most legitimate and faithful - certainly, the most serious and stirring - biographical film to emerge from a major Hollywood studio, and so quite unlike anything that had ever been seen on the screen until that time. Warner spared no expense in retelling Zola's early and lingering success as an author and tragic death in a house fire. Embarking in idyllic 1862's Paris with Zola's initial fame, the film delves compassionately into the morbid curiosity and infamous trial known as the Dreyfus Affair. Encouraged by confidant and contemporary, painter Paul Cezanne (Vladamir Sokoloff) to dispel his own comfortable success and, to stand up for truth and justice, Zola decides to take on the case of Capt. Alfred Dreyfus (Joseph Schildkraut), a war hero unjustly accused of disclosing military secrets and imprisoned on Devil's Island. There are so many powerful and haunting moments in this bio that it's hard to pinpoint exactly where its greatness derives. But it is perhaps best exemplified by the dynamic interactions between Zola and Cezanne. These lead into the beautifully realized and justly celebrated court room summation that, once seen, is not to be forgotten. \"There are times when the most courageous thing is to be cowardly\" exclaims Zola...indeed. The quiet rectitude of \"The Life of Emile Zola\" is a distinct pleasure for classic cinema fans - neither embellished or flag waving, but just as emotionally satisfying and twice as likely to be championed well into the next century. The film's definite slant toward critiquing anti-Semitism is now a time capsule; foreshadowing the growing angst of nations and Nazi terror that was to engulf Europe and cast the world into its second great war. However, William Dieterle's direction is timeless, with slick panache that makes all his points but never heavy-handed or without style befitting a classic biography. The score, by luminary composer Max Steiner, is striking and poignant. In short, \"The Life of Emile Zola\" is befitting of the Oscar for Best Picture and very much a relic from Hollywood's golden age worthy of considerable and repeated re-examination. Warner Home Video's DVD is a reason to stand up and cheer. While there are age related artifacts present throughout, and some scenes suffer from considerable grain, the overall image quality is solid, sharp and beautifully contrasted. The gray scale has been impeccably rendered with deep, rich blacks and, for the most part, solid clean whites. Certain brief sections appear to have been duped in from second or third generation elements, but, keeping in mind that the film is 70 plus year old, such lapses should easily be forgiven. The audio is mono but has been presented at an adequate listening level. A slight hiss is detected occasionally. Save a complete and costly digital restoration, no more could have been expected by the good people at Warners on this transfer. It is head and shoulders above anything the film has looked like in years. Extras include a rare audio only recording of Muni doing Zola on radio, a dramatic, and, a cartoon short subject. The one disappointment here is that no time was taken to do a featurette on the making of this classic film. Regardless, it comes highly recommended by this reviewer.",
         "Marvelous historical biography of Emile Zola, splendidly played by Paul Muni. Always for the poor person, Zola immerses himself in the Dreyfus Affair. Count Esterhazy, the guilty person, is successfully able to frame Dreyfus for passing secrets to the enemy during the Franco-Prussian War. What hurts the most is that Dreyfus, a high ranking official in the French army, was immediately condemned due to a wave of anti-semitism throughout France. Zola shall fight for the exoneration of Dreyfus all the way. In his famous J'Accuse, he drives this goal into total action. Joseph Schildkraut, as Dreyfus, won the best supporting actor award for his portrayal of the condemned man. You feel his hurt and ultimate triumph through every step of the way. His imprisonment at Devils Island is so realistic. His wife in all this is well played by actress Gale Sondergaard, who shed her usual evil-like performances and turned in a remarkable one as the grief stricken faithful wife of the apparently hopeless Dreyfuss. When Dreyfus is ultimately exonerated, tragedy strikes. Zola dies accidentally from poisonous gas seeping through his home. He may be gone but his legacy would live on."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Fictionalized account of the life of famed French author Emile Zola. As portrayed in the film, he was a penniless writer sharing an apartment in Paris with painter Paul Cezanne when he finally wrote a best-seller, Nana. He has always had difficulty holding onto a job as he is quite outspoken, being warned on several occasions by the public prosecutor that he risks charges if he does not temper his writings. The bulk of the film deals with his involvement in the case of Captain Alfred Dreyfus who was falsely convicted of giving secret military information to the Germans and sentenced to life imprisonment on Devils Island. Antisemitism played an important role in the real-life case but is hardly mentioned in the film. Even after the military found definitive evidence that Dreyfus was innocent, the army decided to cover it up rather than face the scandal of having arbitrarily convicted the wrong man. Zola's famous letter, J'Accuse (I Accuse), led to his own trial for libel where he was found guilty and forced to flee to England. Dreyfus was eventually exonerated and restored to his military rank.",
         "Paul Cezanne and Émile Zola were friends when both were starting their careers. Through ups and downs Zola became financially successful long before Cezanne. He was married and had a successful career as an author. Paul Cezanne then decided to live in the country far away from the city, and told Zola not to be part of the establishment but to fight for truth and justice again. He is approached by Lucie Dreyfus, who's husband was unjustly court martialed and sent to Devil's Island because he was accused of betraying his country by disclosing military secrets.",
         "Struggling French writer Émile Zola is more concerned about exposing social and public injustices through his writing than he is about earning a living. However, he does ultimately become a success as a writer, and as a result lives a life of comfort and class. Late in his life, he, on the most part, places his life as a social crusader behind him. Late in the nineteenth century, French Captain Alfred Dreyfus, adamantly professing his innocence, is accused, tried and convicted of treason against the French republic and banished to Devil's Island. New information comes to light of Dreyfus' innocence, information suppressed by the French military in the name of protecting public morale and information which is brought to Zola's attention by Mme. Dreyfus. Initially not wanting to get involved, Zola decides to reignite his social consciousness by defending Dreyfus in the court of public opinion, at the risk of his own personal standing and safety.",
         "The biopic of the famous French muckraking writer and his involvement in fighting the injustice of the Dreyfuss Affair."
      ],
      "budget": 0
   },
   "movielensId": 1933,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1937-10-02",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["William Dieterle"],
      "runtime": 116,
      "movieId": 1933,
      "title": "The Life of Emile Zola",
      "mpaa": "",
      "actors": [
         "Paul Muni",
         "Gale Sondergaard",
         "Joseph Schildkraut",
         "Gloria Holden",
         "Donald Crisp",
         "Erin O'Brien-Moore",
         "John Litel",
         "Henry O'Neill",
         "Morris Carnovsky",
         "Louis Calhern",
         "Ralph Morgan",
         "Robert Barrat",
         "Vladimir Sokoloff",
         "Grant Mitchell",
         "Harry Davenport"
      ],
      "imdbMovieId": "0029146",
      "originalTitle": "The Life of Emile Zola",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["bTStzVavGpo"],
      "plotSummary": "Bio epic of the famous writer.",
      "tmdbMovieId": 43278,
      "avgRating": 3.47111,
      "releaseYear": "1937",
      "numRatings": 225,
      "posterPath": "/5zNJzq2wy716GMiQxoBQd8Wx2fS.jpg"
   }
}