{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "magazine",
            "id": 4620
         },
         {
            "name": "anti semitism",
            "id": 10144
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "new york city",
            "id": 14512
         },
         {
            "name": "widower",
            "id": 33476
         },
         {
            "name": "racial prejudice",
            "id": 162701
         },
         {
            "name": "gentile",
            "id": 209003
         },
         {
            "name": "father and son",
            "id": 240336
         }
      ],
      "imdb_id": "tt0039416",
      "video": false,
      "title": "Gentleman's Agreement",
      "recommendations": [
         43266,
         25430,
         5769,
         27367,
         42861,
         17661,
         15919,
         28580,
         43278,
         56164,
         65203,
         12311,
         33680,
         43136,
         25673,
         14703,
         17281,
         13528,
         3011,
         28966
      ],
      "backdrop_path": "/3DNb1C2NHf5Sbrk5LbuNJydTjXE.jpg",
      "revenue": 7800000,
      "reviews": [{
         "author": "talisencrw",
         "id": "56a04b3b92514137d60042a9",
         "content": "Just two years after Kazan's feature-film debut (and the end of WWII) came this firecracker which became up to that point his most successful film (although A Tree Grows In Brooklyn and Boomerang would also garner Oscar nominations), and it's ironic that so shortly after a great war was won, mainly against racism and the killing of Jews overseas, Gregory Peck's Schuyler Green, in undercover work for an expose to satiate his new, New York City boss, discovers rampant anti-Semitism uncomfortably much closer to home. I love John Garfield's work, rather late in his short career, in the supporting role of Dave Goldman (he should have received an Oscar nomination as well). The film was very successful, taking in three trophies for eight tries altogether (for Best Director, Picture and Supporting Actress--Celeste Holm), and its ending--stressing that forgiveness and tolerance are possible (when Green returns home and forgives his wife)--is very important, though he chose the wrong woman...",
         "url": "https://www.themoviedb.org/review/56a04b3b92514137d60042a9"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Philip Schuyler Green",
               "gender": 2,
               "credit_id": "52fe452d9251416c9102a033",
               "name": "Gregory Peck",
               "profile_path": "/ycs6o0UoohQ7nV7A6VWaTkoIkCQ.jpg",
               "id": 8487,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kathy Lacy",
               "gender": 1,
               "credit_id": "52fe452d9251416c9102a037",
               "name": "Dorothy McGuire",
               "profile_path": "/iGkamkWnIor7eYrTDQMxAjxoQbA.jpg",
               "id": 24815,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dave Goldman",
               "gender": 2,
               "credit_id": "52fe452d9251416c9102a03b",
               "name": "John Garfield",
               "profile_path": "/erQR0rXqGHwVBkXV8rNAj0auD1d.jpg",
               "id": 81970,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Anne Dettrey",
               "gender": 1,
               "credit_id": "52fe452d9251416c9102a03f",
               "name": "Celeste Holm",
               "profile_path": "/3TWctkWuPrtiwjqkfSDjDFcMcx.jpg",
               "id": 10607,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mrs. Green",
               "gender": 1,
               "credit_id": "52fe452d9251416c9102a043",
               "name": "Anne Revere",
               "profile_path": "/cDizEndftfMxxILwLGhYZjoTB61.jpg",
               "id": 7641,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Elaine Wales",
               "gender": 1,
               "credit_id": "52fe452d9251416c9102a053",
               "name": "June Havoc",
               "profile_path": "/7jzXcoZ3GJdC0N5nxt8uGaarVKc.jpg",
               "id": 41255,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "John Minify",
               "gender": 2,
               "credit_id": "52fe452d9251416c9102a057",
               "name": "Albert Dekker",
               "profile_path": "/l6uhlP7tbyb3OVGUi3M6NceagBt.jpg",
               "id": 2755,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe452d9251416c9102a05b",
               "name": "Jane Wyatt",
               "profile_path": "/blYpLJKupFFi6QKqfMWJvN2hkpn.jpg",
               "id": 2021,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Tommy Green",
               "gender": 2,
               "credit_id": "52fe452d9251416c9102a05f",
               "name": "Dean Stockwell",
               "profile_path": "/gooE10UOH6t4geqsEbji9NiQalP.jpg",
               "id": 923,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dr. Craigie",
               "gender": 2,
               "credit_id": "52fe452d9251416c9102a063",
               "name": "Nicholas Joy",
               "profile_path": null,
               "id": 85902,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Professor Fred Lieberman",
               "gender": 2,
               "credit_id": "52fe452d9251416c9102a067",
               "name": "Sam Jaffe",
               "profile_path": "/drxy1JkTOjhUhQnrFnepTmSHELd.jpg",
               "id": 10024,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Third Woman (uncredited)",
               "gender": 1,
               "credit_id": "545244830e0a263a18006872",
               "name": "Virginia Gregg",
               "profile_path": "/kekj3Jr2u34qr28Deq30AIdHQM.jpg",
               "id": 19110,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Mr. Calkins (uncredited)",
               "gender": 2,
               "credit_id": "545244c20e0a262d4600446e",
               "name": "Roy Roberts",
               "profile_path": "/zKGk6q2As8QFkE4V0OHD3JmF4yA.jpg",
               "id": 19400,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c9102a049",
               "name": "Elia Kazan",
               "profile_path": "/tA1PtsKswBEL5bPLcKeToDIRm8K.jpg",
               "id": 2746,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe452d9251416c9102a04f",
               "name": "Moss Hart",
               "profile_path": null,
               "id": 30523,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "545243ae0e0a263a10006b3c",
               "name": "Laura Z. Hobson",
               "profile_path": null,
               "id": 1298317,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "545243ccc3a368023900653e",
               "name": "Darryl F. Zanuck",
               "profile_path": "/pfl8oR2otTYihADFtjLkrtKoFrM.jpg",
               "id": 8502,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "545243ecc3a3681159001c03",
               "name": "Arthur C. Miller",
               "profile_path": "/dD0qk54eZOkwZfD6O0W1g22YAJy.jpg",
               "id": 14648,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "545243fdc3a36802450067ea",
               "name": "Mark-Lee Kirk",
               "profile_path": null,
               "id": 8507,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5452440cc3a3680233006567",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5452441c0e0a262d4600444e",
               "name": "Paul S. Fox",
               "profile_path": null,
               "id": 1335586,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5452442bc3a368532b006b79",
               "name": "Thomas Little",
               "profile_path": null,
               "id": 8508,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5452443c0e0a2642c20038db",
               "name": "Kay Nelson",
               "profile_path": null,
               "id": 1352668,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5452444fc3a368023c0067a8",
               "name": "Ben Nye",
               "profile_path": null,
               "id": 26175,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "57265455c3a36854ff00068b",
               "name": "Alfred Newman",
               "profile_path": "/498k6KmplSJPvWzAecS7eUnaBNg.jpg",
               "id": 8503,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.703085,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33667,
      "vote_count": 59,
      "budget": 2000000,
      "overview": "A magazine writer poses as a Jew to expose anti-Semitism.",
      "similar": [
         1429,
         51828,
         769,
         169917,
         8067,
         22971,
         11224,
         4771,
         13,
         75780,
         346364,
         269795,
         281957,
         449176,
         340666,
         228205,
         452507,
         392044,
         398818,
         293767
      ],
      "original_title": "Gentleman's Agreement",
      "runtime": 118,
      "poster_path": "/vWtSqZFTrdXrelLV4KyjvR6sZ7E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1947-11-11",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Elia Kazan"],
      "runtime": 118,
      "synopsis": "Phil Green( Gregory Peck) is a recently widowed father and a writer who is hired by a large urban magazine to write a series on anti-Semitism. The magazine publisher John Minify ( Albert Dekker) wants Green to immerse himself in the subject and not rely on what the research department at the magazine can deliver. After many nights pounding away on the typewriter keys and plenty of soulful searching with his live-in mother ( Anne Revere) Green hits on the notion that he will tell everyone that he is Jewish in order to get an unbiased response from those he comes in contact with. Immediately Green becomes aware of the \"Gentleman's Agreement\" that is shared in polite society, that the biased attitudes between Christians and Jews is a conspiracy of silence allowing prejudice to thrive. This is problematic for the new girl he has just met, Kathy Lacey ( Dorothy McGuire) who loves Green but is dismayed by the pretense in order to get at the truth of hypocritical treatment that Jews suffer. Kathy is from a Christian Connecticut family and when she introduces Phil to her family the pretense of his Jewish-ness causes the relationship to strain. When Phil's long-time friend Dave Goldman ( John Garfield) comes to visit from the Army and learns of his friend's posing as a Jew to get insider information he alerts him to the fact that he has let himself and his son Tommy ( Dean Stockwell) in for a quiet onslaught of prejudice. As Phil continues in his truth-searching quest he becomes more sensitive to the treatment he receives from others when they think he is not Christian and the learning experience proves valuable to his personal growth and to those around him.",
      "writers": [
         "Laura Z. Hobson",
         "Moss Hart"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039416/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwMDM1NTIyMF5BMl5BanBnXkFtZTYwMDE2MjE5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Gregory Peck, Dorothy McGuire, John Garfield | See full cast and crew »"],
      "reviews": [
         "I hate to say it, but before I saw this movie, I did not realize that there was racism against Jews in the post war period. I couldn't understand it: why would Americans promote the very thing they fought against in the war? Then I was informed that they weren't fighting against racism or discrimination, but against the Nazi regime and genocide. There is a large difference between one person's opinion and a government policy. I'm a teenager, and the fact that Jews were still discriminated against was never mentioned to me. Maybe it should be better known. I am doing Modern History next year and we will be studying the Second World War, and I'm very glad I saw this film (despite its inaccuracies). Anyway \u0096 now to the plot. Phillip Green (Gregory Peck) is a writer who pretends to be Jewish to find out about anti-Semitism. Through this, he learns how much people discriminate against Jews and it affects him deeply and changes his life. I was never bored in this film. I am forever fascinated by Peck, who I've always remembered as Atticus Finch in To Kill a Mockingbird (1962). This is only the second film I've seen with Peck in his younger days (it's quite a pleasure watching him). Celeste Holm also is amazing and I love how she can laugh so easily \u0096 very realistic. The only thing I wasn't satisfied with is the romantic choices by Peck's character. I wish he would have chosen the happy blonde Anne instead of the sappy, boring Kathy. Oh, how I was hoping he would choose Anne! Perhaps Dorothy McGuire was miscast; maybe someone else could have brought more energy to her character. John Garfield is fantastic as Green's Jewish friend. This was ground breaking at the time and I really respect the people who participated in this film for taking a risk. Despite being made almost 60 years ago, I have not only learned from it but enjoyed it. Yes, there are some inaccuracies and plot holes, but I don't particularly care and it doesn't distract me. It's a great film, go see it.",
         "I love this film, though it has faults. It isn't very lively or humorous, and some parts are just plain baffling. Peck is supposed to be the moral spokesman, but so many of the other actors--John Garfield, Dorthy McGuire, Dean Stockwell, Celeste Holm, Sam Jaffe--suggest less priggishness/puritanism and more humanity/warmth than he does. How can we think him morally superior when he comes across like a sulking browbeater? I wish a Spencer Tracy or even a James Stewart had played his role. Sometimes, I feel like saying, \"Lighten up, Greg! Say, did you ever here the one about the Rabbi and the three bellydancers? You'll love it.\" Nor is it just the casting. Many of Anne Revere's lines make me wince with their naivety, and I think she has the most embarrassing role in the movie. However, I really hate the scene when Peck berates his secretary, June Havoc, basically telling her that the only thing that differentiates a Jew from a Christian is just a word--as if cultural and ethnic differences didn't exist or matter. I could go on, because I think I know this film's faults as well as any of its critics. However, the movie's virtues obviously outweigh its shortcomings and dated moments. In fact, after over sixty years, not one other Hollywood film confronts bigotry as intelligently as this one. That's right; not one. Why? Because every other one deals only with bigotry in the extreme--and the result is they don't really attack bigotry, they attack violence. Many bigots who keep their kids out of culturally diverse schools can watch MISSISSIPPI BURNING, IN THE HEAT OF THE NIGHT, CROSSFIRE, etc., and can self-congratulatingly say to themselves, \"Well, that's not me; I know I'm not a racist.\" Of course, violent prejudice is the worst form there is, but, in case you didn't know, it is not violent prejudice that minorities confront on a daily basis. It is the unspoken, insensitive attitudes that GENTLEMAN'S AGREEMENT is brave enough (and unique enough) to attack. Despite its dated moments, it's no wonder this movie raises nervous hairs to this day. It makes one actually wonder: is it wrong to tell a politically incorrect joke? Those who think the answer is simple, please think again. Some have commented that they don't understand what the title refers to and it is significant. A gentleman's agreement is one made without writing or even speech--an agreement that's understood or assumed to be understood. In regards to the film, the term refers to those innumerable bigots who so unthinkingly assume that their prejudices are agreed upon. Speaking as a member of the U.S.'s privileged minority (a white, anglo-saxon, Protestant heterosexual male), I can attest that all of the sexist, racist comments I have had to hear have always been spoken by someone who silently assumed that I would agree with him, making it a gentleman's agreement. The movie, of course, says it's time to break the agreement. A lot of people didn't like such a message when the film came out, and a lot of them don't like it now.",
         "It's hard for today's audience to appreciate the impact of Gentlemen's Agreement in 1947. The Holocaust was not in textbooks then, it was in newsreels showed in American theaters. The state of Israel was coming into being and there was debate about that with Harry Truman shortly overruling a lot of his own trusted advisers including his own Secretary of State George C. Marshall, in giving recognition to the nascent Jewish state. During the course of the film names like Gerald L.K. Smith, Theodore G. Bilbo, and John E. Rankin are mentioned. The first was a Protestant evangelical minister who started out with Huey Long, but then developed a line of anti-Semitism in his sermons. He had a considerably large following back in the day though the Holocaust did a lot in killing his recruiting. Theodore G. Bilbo and John E. Rankin were a couple of Mississippi politicians who for their redneck constituency successfully linked anti-Semitism and racism. They didn't like foreign born either and used a whole lot of ethnic slurs. But the anti-Semitism that Gregory Peck takes on is not that of Bilbo, Smith, and Rankin. It's the genteel country club anti-Semitism that manifests itself in restricted resorts, quotas as to how many Jews will some white shoe law firm accept if any, discrimination in hiring practices, unspoken covenants {gentlemen's agreements} not to sell to Jews in certain areas; all these we see in Gentlemen's Agreement. Peck is given an assignment to write about it and he hits on a novel approach. Just being hired by publisher Albert Dekker, he gets Dekker's backing when he says he will pretend he's Jewish and see how he's being treated. He gets quite an experience in the bargain. Running parallel to Peck's masquerade is his courtship of Dorothy McGuire. She's a divorcée, he's a widower with a young son. The whole thing puts a strain on their relationship, especially in dealing with her sister, Jane Wyatt who lives in one of those restricted by Gentlemen's Agreement communities. Gentlemen's Agreement came up with several nominations and three Oscars for Best Picture, Best Director to Elia Kazan, and Best Supporting Actress to Celeste Holm as a tart tongued fashion writer at Peck's magazine who proves to be a friend. Peck himself was nominated for Best Actor, but lost to Ronald Colman for A Double Life. Holm also beat out Anne Revere nominated for the same film, probably helped by the fact that Revere had won a few years earlier for National Velvet. John Garfield who was Jewish took a small supporting role in the film as Peck's long time childhood friend who educates Peck into how a Jew deals with the rebuffs he's finding out about. Had he not been up also for Body and Soul as Best Actor, he might well have earned a Supporting Actor nomination here. Also note Sam Jaffe as the fictional professor Lieberman which is a thinly veiled caricature of Albert Einstein probably the most noted figure in the world of Jewish background. Like Lieberman, Einstein's a cultural Jew, not religious in any sense of the word. Nevertheless he was a leading figure at the time in the Zionist movement, having endured all that Peck endured in Germany and seeing what was coming with Hitler, fled his native Germany for safe harbor in the USA. My favorite character in the film however has always been June Havoc as Peck's secretary. She changed her name to something ethnically neutral to get her job in the very magazine that will now crusade against anti-Semitism. She's also become a self hater, a phenomenon that other discriminated people also experience. GLBT activists are fully aware of what self hate has done, not hardly unknown among other groups as Ms. Havoc demonstrates. Of course Gentlemen's Agreement is dated with its topical references to post World War II trends and events. Yet it still has a powerful message to deliver. It made Gregory Peck one of the great liberal icons of Hollywood and still should be seen by all as a great lesson in the pitfalls of unreasoning hate.",
         "20th Century Fox currently is releasing a new \"Studio Classics\" DVD series, each a famous film from the past packaged with often compellingly interesting special features. Few releases are more important than 1947's Academy Award winning \"Gentleman's Agreement,\" a for-the-times daring expose of anti-Semitism, a prejudice rarely if ever before that year acknowledged in film. Laura Z. Hobson, an accomplished novelist, wrote the book of the same title and it sold well. Hobson unveiled the so-called \"Gentleman's Agreement\" whereby Jews were excluded from professions, clubs, resorts and employment and residency opportunities as well as simple social associations by a silent compact by mainly white Christians to engage in exclusionary practices. While discrimination against blacks was mandated by unambiguous law supported by inflexible government authority, the relegation of Jews to often second-class status in the dominant Christian community was by deception, denial and deceit. A Christian, Darryl F. Zanuck was one of the few true Hollywood moguls who wasn't Jewish. He was also intensely offended by bigotry of any kind. Hobson's novel, of no interest to Jewish producers who preferred to live in their own world which consciously often aped the society from which they were barred, was his to buy for the screen. He did so for $75,000 and he set out to find a first-class crew to make the film. Elia Kazan signed on to direct (and to revise the screenplay after Moss Hart finished it). Gregory Peck, already a box office idol, was chosen to play Philip Schuyler Green, a widower with a young boy (played by Dean Stockwell). Dorothy McGuire is Green's troubling love interest, Kathy Lacey. John Garfield, one of the many Hollywood denizens who changed their names to avoid being typed as Jewish, is Army Corps of Engineers captain Dave Goldman. Celeste Holm won the Oscar for Best Supporting Actress as Anne Dettrey. Anne Revere, soon to lose twenty years of productive life because of the Blacklist, is Green's wise mom. June Havoc is Green's secretary, Elaine Wales, who in the film changed her name to get work, her real name being clearly Jewish. Lastly, Albert Dekker is magazine publisher John Minify, a man determined to expose to the light of day the insidious anti-Semitism of his social and economic universe. Unfortunately he's a bit naive about what goes down in his own shop. This is a message film, direct and uncompromising. Agreeing to write a series exposing anti-Semitism, Green struggles to find a theme while falling in love with the divorced Kathy. His brilliant concept is to pretend to be a Jew and to record how others respond to him, a clearly well-educated, socially competent man, in that guise. His childhood buddy, Goldman, tries to warn him off but Green is determined. Stridently polemical, the movie traces the growing number of incidents where Green is slighted because of his announced religion. From a building superintendent who doesn't allow a Jewish name on a lobby mailbox to a haughty resort manager of a \"restricted\" facility (the code word of the time for exclusion of Jews and blacks), Green gets a rapid course in the crude discrimination lurking behind most doors including the high society of his new beloved. Green's son, told not to reveal that he and his dad aren't Jewish, runs into his own cruel rejection by classmates. Peck's Green lacks the depth of understanding of a child's vulnerability that his Atticus Finch later displays in \"To Kill a Mockingbird.\" The boy is basically told that the other kids are wrong, we're right and that's that. Too simplistic even for this movie. Green is adamantly and unwaveringly sure of himself and woe betide any who do not share his abhorrence at any manifestation of discrimination, starting with Kathy. The romance between Green and Kathy is as back-and-forth as any Hollywood potboiler, the difference being that their arguments and falling-outs revolve entirely over Kathy's inability to grasp the absolute righteousness of her fiance's crusade. The dispute is artificial and wearying to some degree and I rooted for Celeste Holm's lovely, witty and totally tolerant Anne, a fashion editor with attitude, as the top gal in the film. I would have married her in a New York minute! Younger audiences today may well dismiss \"A Gentleman's Agreement\" as formulaic and preachy but they do not understand the nature of the tragedy, and that it was, that afflicted America at the time. The war had been won, the Cold War was getting into high gear and Nazi criminals were on trial in various European courtrooms. The reality of the concentration camps was known to all but already many had accepted the belief that only some Germans and their allies were actual murderers. Holocaust studies had not begun. The period of \"A Gentleman's Agreement\" was a time in which many top colleges and universities that didn't ban Jews entirely had what are now acknowledged as \"Jew quotas.\" Many Jewish doctors didn't enter that profession because that's what their moms wanted but due to the near blanket exclusion of Jews from engineering schools. Architecture schools also had a low quota for Jews (Louis Kahn's experiences are recounted in the current and outstanding documentary, \"My Architect\"). Whole communities lived by a sub rosa agreement never to admit Jews (and blacks), often solidifying their intent by restrictive covenants that courts enforced). What added to the awfulness of the prejudice is that communities comprised of Jews usually excluded blacks and other non-whites. No Caucasian group, whatever their religion, deserves exoneration for the acts they practiced against minorities. Blacks get no mention in this movie but lynchings were still in vogue-let's not forget that. For many Americans harboring anti-Semitic beliefs, the bestiality of the Nazis was far more troubling than the fate of millions of their innocent victims, Jewish or not. Decrying Auschwitz in no way caused them to re-think less lethal but highly pervasive discrimination that they practiced or, as the film shows, disliked but nonetheless condoned without protest. In that sense \"A Gentleman's Agreement\" was Hollywood's, actually Zanuck's, wake-up call. The politics of the producer, director, screenwriter and much of the cast aren't hidden. Several references to Bilbo and Rankin, two of the most evil racists and bigots ever to pollute Congress's halls, are as direct and clear as the sharp DVD images. And it's no surprise that virtually everyone associated with this film went on to be called by the House Un-American Activities Committee to be questioned about ties to communism (John Garfield died at age 39 of a heart attack the night prior to a second command appearance before that run-amuck committee). That committee hunted communists publicly but pursued a barely hidden anti-Semitic agenda and Hollywood provided plenty of potential victims. The special features on this disc include a short documentary on its genesis and the subsequent reaction to the film as well as interviews with several stars including the still imposing Celeste Holm. Zanuck and Kazin deserved their Oscars as did Ms. Holm. \"A Gentleman's Agreement wasn't the only film to highlight anti-Semitism at that time. In fact it wasn't the first such film of 1947. Released shortly earlier, \"Crossfire\" starring Robert Ryan is a film noir capturing the violent bigotry of a thug who kills a Jewish victim for little better reason than his religion. An exciting film in its own right, its importance is secondary to Zanuck's which blew the lid - almost literally - off a brand of discrimination indulged in by educated and affluent Americans who would never commit assault or murder against anyone because of their race or religion. Hollywood's Jewish moguls must have been surprised at the success of Zanuck's movie which in a small but real way began rolling back the kind of anti-American bigotry that the congressional committee investigating Tinseltown not only didn't care about: they shared it. 10/10 (for its historical impact and lasting value)",
         "On the one hand, Gentleman's Agreement has a highly enlightened prejudice, even today, let alone 1947. Gregory Peck plays a journalist who decides to pretend to be Jewish so he can attain a real-life perspective on anti-semitism. Peck's transformation from a determined writer looking for an edge to a crusader against prejudice is nothing short of profound. The twist of course is that Peck gets lost in the assignment, starts seeing himself as a Jew and struggles to maintain his composure amid all the anti-semitism he experiences. Considering that, it's a shame that the film's abilities to tell a story lag so far behind the movie's depth and boldness. There's a lot of emphasis on the romance between Peck and his editor's niece, which is pretty overdone for a pair who has as little chemistry as McGuire and Peck. I think the worst part of that is hearing Gregory Peck referring to McGuire's character as \"my girl\" like he's in middle school, especially considering I've always associated Peck with characters of tremendous maturity. Additional randomness comes from the fact that the film also focuses on Peck's relationship with his ailing mother, which doesn't have much to do with the central plot at all. What seemed to be an attempt to give a more well-rounded view of the character, the story felt bogged down by those elements. Still, a worthwhile movie, overall, *** out of ****",
         "This movie was very well done, and in my opinion should be shown to young people at school. That way it can help to prevent prejudices and bigotry from taking root in future generations. As John Garfield's character in the movie showed: discrimination and racial intolerance can be eliminated if we fight it. Garfield's willingness to take a supporting role in this movie because of the power of its message should compel the skeptics to watch this movie. The sterling cast meshed together perfectly. Gregory Pecks gentility was exactly what the lead role in this movie had to have. Dorothy Mcguire was also excellent at conveying her emotions in such a demanding role. Its too bad that Garfield and Mcguire are not as well known as other Golden age stars.",
         "Although one certainly cannot say Gentleman's Agreement is not passionate in its aim to uncover the invisible cloak of anti-Semitism in post-war America, the execution of that objective could have used slightly more dramatic tension and immediacy. Released the same year and touching on the same subject was Edward Dmytryk's Crossfire, which dealt with anti-Semitism at its extremes: murder with anti-Semitism as the motive. Gentleman's Agreement takes a more humanistic and subtle approach--one that is too subtle at times. Where Crossfire dropped the bomb of anti-Semitism into the laps of the audience, Gentleman's Agreement gives it to you in periodic shots in the arm in the form of a sermon, and each one says the exact same thing: anti-Semitism is bad. (But we knew that.) Yes, the message is an important one, but feeding it to the audience in a manner that is literally shoving it down our throats every few minutes doesn't help the digestion any. Also lacking in Gentleman's Agreement is a three-dimensional protagonist. Peck's crusading writer who masquerades as a Jew is simply too zealous and unswerving for his own good. He has no faults, no inner conflicts and no doubts about himself. Whether he's being shunned by bigots or Dorothy McGuire, he's such a straight-shooter you know what he's going to do before he does: the right thing right away. There's no real dramatic arc in the story, with the entire weight of the movie resting on the torrid on-again-off-again love affair between Peck and McGuire. She symbolizes the hypocrisy and passiveness of the everyday American on anti-Semitism, and he points it out to her every chance he gets-and that's all. It pretty much rambles on the same dramatic level all throughout the picture, dividing its time between love scenes and sermons, most of which are indistinguishable from one another. In the end, the important message and the overall entertainment value of the picture suffers from this redundancy.",
         "Gregory Peck is slick as a writer for a publisher who is trying to find something to inspire him after his wife dies. He must take care of his young son and has his mother there in New York to help him out. Anti-Semitism hits a chord as WWII has just ended with news of the Holocaust just barely starting to sink into the national consciousness. The timing for release of this movie is obvious, but it is carefully thought out as the director tries to convey the sinister and insidious way in which prejudice worms its way into the mainstream of everyday life. A well done film that works! A clever and intelligent portrayal that deserved the attention it received. Not an entertaining movie in the strictest sense, but one where the audience must do the work of thinking their way through it. It is a film worth navigating, however, because the ugly mirror of prejudice is held up to us all who are watching. It makes you feel uncomfortable because most of us are guilty of what is offered, or at least, of witnessing prejudice and doing nothing about it as we just sit or stand idly by and do nothing. I recommend this film, but it won't be for everyone and many of us would rather just pass this one by. But we should not pass it by, even though it holds up this mirror which makes us feel guilty and uncomfortable. I should point out that the ending which relates to the love interest in the story just doesn't work, but then that is not the heart, soul and purpose of the film. Prejudice, anti-Semitism and discrimination are, and these elements are worked out well. A disturbing, but intelligent portrayal which is worth taking in for what it is worth.",
         "just as philip's magazine editor told him, any hack could write a column on the subject based on facts and figures. what they needed was a different angle that would capture the audience on a gut level. the theme wasn't about showing a Jewish guy get discriminated against. those incidences provide the backdrop and the link to philip's realization of a much more pernicious side to the subject. his magazine article may have started out with the idea of what it actually is like to be discriminated against as a Jewish man, but it moved into an analysis of how well- meaning, \"nice,\" people who woudn't consider themselves bigoted or prejudiced, will sit by and let it happen without saying or doing anything. that's why kathy's rocky relationship with philip is so important and the ultimate resolution of the film.",
         "Certainly the preachiest film ever to win Best Picture, and almost the preachiest film ever to be made, but that doesn't necessarily mean that Gentleman's Agreement isn't a good movie. In fact, I thought it was a fine film and an important one. It's heavy-handedness is mostly evened out by a lot of good dialogue, good filmmaking, and exceptional performances. I'll start there. I thought every principal actor succeeded with flying colors; even when they have to deliver awful and obvious message speeches, they almost always ended up making that writing sound a lot better than it was. Gregory Peck gives one of his very best performances. I'm glad to see him give this performance, too, after being stupefied by that wooden performance in the same year's The Paradine Case. The script does well with the character of Phil Green. When he begins his quest to discover the anti-semitism around him, he is involved very impersonally. It's a job, a job he doesn't really want to do, a job he doesn't even know how to do. And when he gets his big idea, to pretend he's Jewish himself, it seems almost arrogant. How dare he, I thought. But, through the film, he does get personally involved, so deeply involved that the insults and jokes and so forth become personal attacks. I doubt he ever expected that it would hurt so much. In comparison to the other film about anti-Semitism in 1947, Crossfire, also nominated for Best Picture, Gentleman's Agreement certainly does not hold up in terms of filmmaking and artistry. However, which film do you think had more of a chance to make a difference? Where Gentleman's Agreement succeeds, and Crossfire fails, is its ability to make the audience look inside themselves. Sure, it has to hit its audience with a sledgehammer before they look inside themselves to find their own prejudices and shortcomings, but I really think it works."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Philip Green is a highly respected writer who is recruited by a national magazine to write a series of articles on anti-Semitism in America. He's not too keen on the series, mostly because he's not sure how to tackle the subject. Then it dawns on him: if he was to pretend to all and sundry that he was Jewish, he could then experience the degree of racism and prejudice that exists and write his story from that perspective. It takes little time for him to experience bigotry. His anger at the way he is treated also affects his relationship with Kathy Lacy, his publisher's niece and the person who suggested the series in the first place.",
         "Philip Green, played by Gregory Peck, is a famous and well-liked writer. Upon receiving an assignment to write a series of articles on antisemitism in the U.S. after World War II, he begins telling people that he is of Jewish faith. He falls in love with Kathy Lacy, played by Dorothy McGuire, and reveals to her the secret antisemitic ways of thinking she has. Philip Green believes in doing the right thing immediately when wrong has been done and noticed. He lives with the eyes and ears of a Jew and discovers the bigotry and prejudice that lies within even the nicest of people.",
         "Widowed now for seven years, Phil Green, who uses his middle name \"Schuyler\" Green as his pen name for the commentaries he writes primarily on social issues, has just moved from Los Angeles to New York City with his mother and preteen son Tommy to start work in the main office of his company, Smith's Weekly, a national magazine. His editor, John Minify, suggests as his first story a series on antisemitism. He is not enthralled with the topic, which he feels has been covered by all pertinent angles by a multitude of writers, until Tommy asks him about the entire nature of the subject, he who has no idea what it all means and why. Even then, Schuyler is having problems coming up with a suitable angle. But he does come up with what he believes is a new and fresh angle: he will pretend to be Jewish for the period that he is writing the series, he reverting back the more Jewish sounding Phil Green as his name, and as such he will be his own guinea pig. The only people who will know that he is really a gentile is his family, Minify, his wife and who becomes Schuyler's girlfriend, Minify's niece, divorced schoolteacher Kathy Lacy, who came up with the antisemitism story idea to begin with. Through this process, \"Phil\" will encounter much racism, not only against Jews but other minorities, and from unexpected sources. Although he expected open racism, it is the people who stand by and watch it happen without doing anything about it that ends up bothering him the most. He expected the process to affect his own life, which he could handle, but he may not be able to handle how it affects those around him, most specifically his mother, who is facing some health issues, Tommy and Kathy, the latter with whose relationship is also affected. His long time friend, Dave Goldman, who often shortens it to the less Jewish sounding Dave Gold, may be able to give Phil and those around him a better perspective of what is happening.",
         "This film is about a journalist who passes himself off as a Jew to write an article about anti- Semitism in America. He discovers just how this affects him, and the other people in his life. Demonstrates how racism affects a person, especially the subtle forms which may go unnoticed by many in today's world. It also shows how otherwise good people can and do contribute to racism in small, everyday, ways.",
         "A well-known writer at a progressive New York magazine decides to tackle anti-Semites in a unique way as his first assignment. Gregory Peck's character, Phillip Green, pretends to be Jewish in order to write about the effects of bigotry. Green soon learns what it means to be the object of sectarian prejudice.",
         "A reporter pretends to be Jewish in order to cover a story on anti-Semitism, and personally discovers the true depths of bigotry and hatred."
      ],
      "budget": 2000000
   },
   "movielensId": 1940,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-11-11",
      "dvdReleaseDate": "2003-01-14",
      "directors": ["Elia Kazan"],
      "runtime": 118,
      "movieId": 1940,
      "title": "Gentleman's Agreement",
      "mpaa": "",
      "actors": [
         "Gregory Peck",
         "Dorothy McGuire",
         "John Garfield",
         "Celeste Holm",
         "Anne Revere",
         "June Havoc",
         "Albert Dekker",
         "Jane Wyatt",
         "Dean Stockwell",
         "Nicholas Joy",
         "Sam Jaffe",
         "Virginia Gregg",
         "Roy Roberts"
      ],
      "imdbMovieId": "0039416",
      "originalTitle": "Gentleman's Agreement",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["E2eAXa7rNXw"],
      "plotSummary": "A magazine writer poses as a Jew to expose anti-Semitism.",
      "tmdbMovieId": 33667,
      "avgRating": 3.74276,
      "releaseYear": "1947",
      "numRatings": 760,
      "posterPath": "/vWtSqZFTrdXrelLV4KyjvR6sZ7E.jpg"
   }
}