{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "horse",
            "id": 2673
         },
         {
            "name": "savannah",
            "id": 7323
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "family",
            "id": 18035
         }
      ],
      "imdb_id": "tt0114496",
      "video": false,
      "title": "Something to Talk About",
      "recommendations": [
         10879,
         9095,
         20096,
         47608,
         9941,
         11191,
         40480,
         11630,
         10763,
         918,
         3784,
         40509,
         26255,
         31633,
         33657,
         12280,
         31535,
         37718,
         9079,
         10860
      ],
      "backdrop_path": "/qypJLgd6RZazJaLbDNNrWLPAw8l.jpg",
      "revenue": 50892160,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Grace King Bichon",
               "gender": 1,
               "credit_id": "52fe47789251416c7509a969",
               "name": "Julia Roberts",
               "profile_path": "/h13yvG0tRNMTAwciQXxYmQWdYW8.jpg",
               "id": 1204,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Eddie Bichon",
               "gender": 2,
               "credit_id": "52fe47789251416c7509a965",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Wyly King",
               "gender": 2,
               "credit_id": "52fe47789251416c7509a97f",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Georgia King",
               "gender": 1,
               "credit_id": "52fe47789251416c7509a983",
               "name": "Gena Rowlands",
               "profile_path": "/kRHNvkcJlwBr1Xb9XREiZob29NX.jpg",
               "id": 4800,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Emma Rae King",
               "gender": 1,
               "credit_id": "52fe47789251416c7509a987",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Jamie Johnson",
               "gender": 2,
               "credit_id": "553c0eb8c3a3685cf80060fa",
               "name": "Brett Cullen",
               "profile_path": "/dSucCeOCUJy8nDjUjxmWguu3W1D.jpg",
               "id": 16841,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Caroline 'Doodlebug' Bichon",
               "gender": 0,
               "credit_id": "553c0ec6c3a368784500b198",
               "name": "Haley Aull",
               "profile_path": null,
               "id": 1459064,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hank Corrigan",
               "gender": 2,
               "credit_id": "553c0ed3c3a36831dd00c90b",
               "name": "Muse Watson",
               "profile_path": "/f7SZHWqYqAndyA7BAcVBonkP3jQ.jpg",
               "id": 17348,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Aunt Rae",
               "gender": 0,
               "credit_id": "5593de08925141645a002c39",
               "name": "Anne Shropshire",
               "profile_path": null,
               "id": 1483630,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Eula",
               "gender": 0,
               "credit_id": "5593de17925141423f0005c4",
               "name": "Ginnie Randall",
               "profile_path": null,
               "id": 80780,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Dr. Frank Lewis",
               "gender": 0,
               "credit_id": "5593de29c3a368774100389f",
               "name": "Terrence Currier",
               "profile_path": "/e5IbBJ3I4BGFIiqG3MBADE8321n.jpg",
               "id": 174241,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Barbaranelle",
               "gender": 1,
               "credit_id": "56f5b6d5c3a3686a5c000924",
               "name": "Rebecca Koon",
               "profile_path": "/qG3Cx9kz1v4FZsEpPovVVlWxDbO.jpg",
               "id": 174133,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Edna",
               "gender": 1,
               "credit_id": "5593de469251415df80037c2",
               "name": "Rhoda Griffis",
               "profile_path": "/f4jlWaOllPPQXzNnNDapJ5mlLjI.jpg",
               "id": 51456,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Lorene Tuttle",
               "gender": 1,
               "credit_id": "5593de66c3a3687ca5000183",
               "name": "Deborah Hobart",
               "profile_path": null,
               "id": 174125,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Kitty",
               "gender": 1,
               "credit_id": "5664f90b925141281a000b36",
               "name": "Lisa Roberts Gillan",
               "profile_path": "/cIpGjGrqTzpOtHPtskkYy8SHd8j.jpg",
               "id": 15109,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Nadine",
               "gender": 1,
               "credit_id": "57c73345c3a3680ba4004bce",
               "name": "Libby Whittemore",
               "profile_path": "/pqfLw0gRRPygELAPn8zLBo65E1g.jpg",
               "id": 226537,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47789251416c7509a96f",
               "name": "Goldie Hawn",
               "profile_path": "/29s9YEFtR1A3ijJ01JlLjYtLpNU.jpg",
               "id": 18892,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe47789251416c7509a975",
               "name": "Anthea Sylbert",
               "profile_path": null,
               "id": 12020,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47789251416c7509a97b",
               "name": "Lasse Hallström",
               "profile_path": "/tVnakJ0RWFj3eaUIJkzubTzmKXv.jpg",
               "id": 5306,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47789251416c7509a98d",
               "name": "Callie Khouri",
               "profile_path": "/3BNF9XrijgK2HlS7Dgx1kgPZzJz.jpg",
               "id": 17397,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "553c0ee99251413f5a00664f",
               "name": "Sven Nykvist",
               "profile_path": "/2S1wtqPzCUlAMVpor5o0YHkme21.jpg",
               "id": 11905,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.764801,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18402,
      "vote_count": 76,
      "budget": 0,
      "overview": "In one of her best-ever roles, Julia Roberts is Grace, whose reaction to the infidelities of Eddie (Dennis Quaid) turns the lives and loves of the people around her into something like falling dominoes. Robert Duvall, Gena Rowlands, Kyra Sedgwick and others in \"the year's best ensemble of characters\" (Jack Matthews, 'Newsday') co-star in this juicy, truthful story written by Callie Khouri",
      "similar": [
         49519,
         693,
         93456,
         274167,
         195589,
         376659,
         433,
         325133,
         2698,
         7345,
         8967,
         73,
         5176,
         244772,
         277216,
         10054,
         7972,
         2196,
         40807,
         4442
      ],
      "original_title": "Something to Talk About",
      "runtime": 106,
      "poster_path": "/p9qioRaQblGXemFRQSwo8TpikVJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hawn / Sylbert Movie Company",
            "id": 16368,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Spring Creek Productions",
            "id": 705,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-08-04",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "A story about husbands, wives, parents, children and other natural disasters.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lasse Hallström"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Callie Khouri"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114496/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzOTczNTM1MF5BMl5BanBnXkFtZTcwMDM5MDMyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Julia Roberts, Dennis Quaid, Robert Duvall | See full cast and crew »"],
      "reviews": [
         "A Southern woman (Julia Roberts) finds out her husband (Dennis Quaid) is cheating on her. This sets off complications that involve her whole family-her fiery sister (Kyra Sedgwick), gruff father (Robert Duvall) and understanding mother (Gena Rowlands). This plot has been done many times before and there are no real surprises--but it has a good pro-female script. That's no surprise--it was written by Callie Khouri who also wrote \"Thelma & Louise\". The dialogue is sharp and adult and the stars give it their all. I've never really been a big fan of Roberts but she is very good here faking a credible Southern accent. She has a GREAT scene when she confronts her club about her husband's infidelity. Sedgwick is just fantastic as her sister--full of fire and having a great time. Surprisingly Rowlands wasn't that good at first--way too muted but she eventually got better and is wonderful in a scene in which she tells off Duvall. Quaid and Duvall are lousy in their roles...but they're given NOTHING to work with--this picture is about the women. The only male character with any depth is Jamie (Brett Cullen)--very handsome, intelligent and caring--a real great performance. A word of advice--this movie is VERY R rated. There's tons of swearing (especially from Sedgwick) and VERY frank sexual dialogue--it is NOT for the kids (unless it's an edited for TV version). It's an adult movie. Predictable but well-done. Worth catching.",
         "First let me start off by saying that Julia Roberts is from Georgia...Her accent is real! This was a disappointing movie. Julia Roberts and Kyra Sedgwick have great chemistry as sisters and they LOOK like they could actually be related. Dennis Quaid-check, Robert Duvall-check, Gena Rowlands-check...Cast is awesome. Writing is sassy and on the money. The problem is the way the story turns on it's head. When Grace poisons her husband it is not at all funny..and takes the story in another direction. We think we are watching a movie about this lying cheating lout who does his woman wrong and her questioning her life and her choices afterward. We feel bad for HIM when he makes it sound like she drove him into another woman's arms because she didn't give him enough affection. She actually feels bad, but it is already too late, as she has already made him sick from the poison. He decides he doesn't want her back after all and goes ahead and gets a nasty lawyer. Along the way her mom (Rowland)decides to take action on her husband (duvall) who has been fooling around for years. Not making much sense here. All this surrounds a equestrian competition that is supposed to bring these people together. Kind of stupid. I also want to bring attention to the fact that Julia Roberts was about 27 when she made this. Too young to have this older kid, and Dennis Quaid looks a good 10 years her senior, and they were in college together?? Kyra Sedgwick is going for over the top sassy here...We get the point after she knees Quaid in the jewels early on..yes yes she is a tough cookie. All that said, I will watch Julia Roberts in anything. I am her target demographic after all. Her most unwatchable movie is still watchable to me on a snowy Sunday afternoon such as today.",
         "1st watched 1/18/2003 - 7 out of 10(Dir-Lasse Hallstrom): Well-played drama about being in love, making mistakes, and trying to stay in love. This is a heart-breaking movie to watch because it is so much like real life and it is played out so well by those involved. The Direction by Hallstrom is magnificent because of the way he lets the story do the talking and doesn't hurry us to conclusions. Basically, this is a story about a woman(Julia Roberts) who finds out that her husband(Dennis Quaid) is cheating on her and then everything gets mixed up from this point on. There are many other relationships that are also very vital to the story just like they would be in real life. There are parents(who struggle with some of the same things), there is a sister(who tries to lend a helping hand) and there is a child in the middle of everything just trying to survive. By the end, we believe that everything is going to be all right but it is very obvious that much damage has been done. Roberts is superb as usual and everyone plays out their parts very believably. This is one of those movies that is one of a kind, but not one you'd want to watch very often for it hits deep within our souls(especially those who have gone thru similar experiences) and therefore I think it failed when released because the exec's didn't know how to sell it to make money but none-the-less it is a classic in my book on relationships. The choice of the title also didn't make sense because the song really has nothing to do with the movie. Again, I think this was a marketing mistake and not the filmmakers.",
         "This is a delightful film about a Southern belle, Grace King Bichon (Julia Roberts), who chafes under the domination of her brook-no-dissent father, and is cheated on by her husband. Grace works for her father on his horse farm, and her suppressed resentment of his iron rule has likely helped derail her marriage to Eddie. In any event, the film is ultimately about the love and strength of family relationships and the power of forgiveness, as well as finding one's own path in life. All actors turn in great performances: Julia Roberts as the heroine and wronged wife; Robert Duvall as the family patriarch; Gena Rowlands as the beautiful and devoted spouse and mother; and Kyra Sedgwick as the transgressive sister. Dennis Quaid as Grace's philandering husband is very appealing, so it's hard not to be rooting for he and Grace to reconcile. Finally, good cinematography and a portrait of gracious Southern living make this film an enjoyable view.",
         "This is a very clever movie, made with serious intentions, coming out with both a funny and serious side to it. I am talk about the Julia Roberts drama, \u0091Something to talk about'. I have seen many movies that look into the issues concerning relationships and infidelity, such as 2002's, \u0091unfaithful'. Yet this film looks at a different side of the problems that can hurt a relationship and also shows that one couples problems can be the \u0091talk' of the town. Grace Bichon has a picture perfect life. She helps manage her father's riding-stable and has a great husband and little daughter. That is until she discovers that her husband Eddie is deceiving her with another woman. After confronting him in the middle of the night on the streets of their small home town, she decides to stay at her sister Emma Rae's house for a while, to make up her mind. Breaking out of her everyday life, she starts to question the authority of everyone, especially her father's, thus causing a stir in her parent's marriage, too. What a great story this film has. I love the way that the audience get the chance to experience what a place it is that poor Grace has to live. It also shows that being part of a relationship is not an easy thing. Another clever addition to the story is the use of gossip, which is perfectly incorporated and performed by the movie's actors. You really believe that this town's people want to know what is going on in the lives of the \u0091Bichon family' and that is ultimately why it was called \u0091Something to talk about'. This all being said, the film has many characters that I did not like, which is credit to the film's story, allowing me to actually like it. The screenwriter for \u0091Something to talk about', is Callie Khouri, who did a film last year, that I want to see, called \u0091Devine secrets of the Ya-Ya sisterhood'. Callie wrote a most enjoyable script from where I see it. There are flawless roles from all involved in the movie. This movie's main star is a gal I like, that being Julia Roberts. I remember reading that someone said Robert's needed to do this movie, to save her career from going down the wrong path. Well she shone in this most likeable of roles. I love the way that her character goes through so many emotions, especially the hot-headed temperament, but for good reason. I had to laugh when Grace is so abrupt, asking all her friends at a meeting, has anyone and everyone in the town been sleeping with her husband. The next line is priceless. The men in Grace's life are not so great. Husband Eddie (Dennis Quaid) is in a most uncomfortable of situations, which he put himself in. Eddie is upstaged by Grace's sister, Emma Rae (Kyra Sedgwick), who brings Eddie to his knees. Then add in the scene when Grace tries to get revenge on her husband. It is a movie that shows Eddie has done many things wrong. What Grace does might seem a little extreme, but I have no doubt that hurt people will go to such lengths to feel better about themselves and their situation. Grace's father, Wyly King (Robert Duvall) is a man who cares not so much for his family, but more about the disgrace one of his daughter's will bring to the family name, reputation and business. I was shocked when he blurts out \u0091All of our friends complain about how their kids grow up and run off and they never hear from them anymore. Why the hell can't that happen to us?' Director Lasse Hallstrom did a good job with this movie. He certainly seemed fascinated in making a movie which shows how dysfunctional a family really can be, and on more than one level in this film. There was also one name that came up as a bit of a surprise to me in the casting credits, that being Goldie Hawn. She was executive producer of the film, and in some way, you can feel the comedic touch she brought to the film. \u0091Something to talk about' hit home personally for me, as I have been part of a family break up, via one parent being unfaithful to the other. It is very hard for kids to understand what is going on when parent's relationships are disintegrating right in front of them. I have resigned to the fact my parents will never be back together again, but this film shows that not all relationships are a lost cause as I am sure they are not. Julia Robert's role in the film was so compelling from where I see it, as she was well within her rights to be as upset as she was. Her role justifies to me, why she is a star in Hollywood today. I guess the only downer for me in this film was the language, which I found just a little slack and disturbing. Roger Ebert said in his review of the film: \u0091that \u0091Something to talk about' is the kind of film where you start out wondering how all these people are related, and end up knowing all to well'. I could not agree more, but I guess that is what you get when people start to gossip and talk! CMRS gives \u0091Something to talk about': 4 (Very Good Film)",
         "Sterling cast featuring not only Julia Roberts and Dennis Quaid, but also Robert Duvall, Gena Rowlands and Kyra Sedgwick, is a handsomely-made but rather ordinary, women's TV-type light drama (with barbed language added). Roberts plays harried working mom down South who discovers husband Quaid has been unfaithful; they fight, discuss divorce, fight some more, while Roberts gets advice from her well-to-do parents (they ponder the situation when the answers should be obvious). Pleasant cast nearly masks the fact this is completely rote material (with Sedgwick as Roberts' p.o.'ed sister who gets in the proverbial crotch kick). Pokey, overly-familiar, overlong film with too few laughs and too much inane banter. Photographed by the famous Sven Nykvist, who indeed gives the picture a rich, glossy look. ** from ****",
         "When it comes to directors like Lasse Hallström, I always expect maximum, best, masterpiece. After movies that he made back in Finland and brilliant \"What's Eating Gilbert Grape\" I think that my expectations were justified. Sadly, this movie came just behind Gilbert so I can live with one mediocre movie after a huge success with Gilbert and then later movie like \"The Cider House Rules\", \"Chocolat\"... Hallström likes to make family movies, where he can expose the whole family with all their pluses and minuses. In this case, story was written by Callie Khouri (Thelma & Louise), typical 'women are always good' writer. In the middle of the story we've got Grace Bichon (Julia Roberts), who founds out that her husband Eddie (Dennis Quaid) is unfaithful. With her daughter, she decides to come back home at ranch. There she must face her traditional father Wyly (Robert Duvall) and mother Georgia (Gena Rowlands), who seems to be doing whatever Wyly wants. The only person who fully understands her is her sister Emma Rae (Kyra Sedgwick). I disagree that there is nothing to talk about in this movie. Yes, this movie has some obvious problems: the script is not brilliant which is mostly seen in situations that we've all seen before and characters like Eddie, Wyly and Georgia are written on a way that there is nothing for actors to act. But all Hallström characters are alive (you can identify with them) and about family problems that are presented in this movie there is plenty to talk about. For example, what strong woman like Grace does when she's cheated, how to explain her young daughter that her dad isn't living with them any more; the whole relationship of Bichon's after infidelity. On the other hand, we've got relationship between two sisters, between Wyly and Georgia King and so on. So we've got plenty stuff to talk about only if you think about it for a while. What this script lacks is quality writing of male characters. Duvall's and Quaid's characters are simply not developed enough. About acting part, I must admit that Julia Roberts is very good in this role, just like Kyra Sedgwick and Brett Cullen (his character is the only male character that is made right). Duvall, Rowlands & Quaid have nothing to act, like I said before. But I read one comment that says that Duvall shouldn't act in any movie. That is what made me angry so I had to write it. Man is a screen and stage legend! So to end, if you can watch this family drama about marriage, infidelity and love. It's not the best choice coming from Hallström but it's a bearable one.",
         "\"Something to Talk About\" is one of those movies I can watch time and time again and never tire of. It appeals particularly because it has so many elements I love in a movie -- dancing, powerful women, horses, sexy men riding said horses, humor, fighting, making up. Not to mention a cast, writer, and director that imbue the film with a sense of high quality. Relationships between a myriad of characters are explored and to satisfaction. Even minor characters turn in great performances; for example, Grace's Aunt Edna, who shares a secret that leads to a hilariously dark moment for Grace and Eddie. Kyra Sedgewick steals every scene she is in and makes me wonder why she isn't a bigger star. She had chops in this film. She was thoroughly enjoyable. Callie Khouri and Lasse Halstrom made a memorable movie with \"Something to Talk About.\" Worth watching and laughing over and over.",
         "I am loathe to say something this negative, but must. One of the worst movies I ever have been dragged in front of the VCR by my fiancee to watch. It is not enjoyed but endured, especially, I would think, by males - as you will see for yourself (or, I hope, not). What was Robert Duvall thinking when he agreed just to go through the motions for this dud? And Julia Roberts?? The one note of hysterical she maintains throughout is not acting. At least the scenery in Beaufort, S.C. (also the location of \"Big Chill\") is interesting. Overall, what a disappointment.",
         "I like cinema a lot and I am used to many kinds of films, independent and commercial. I liked this movie in spite of Ms. Julia Roberts. No offense but, in general, I don't like most of the movies she appears in... though very successful they may be. I liked the plot of Something To Talk About because it is about relationships put to a test. The young couple. The old couple. The two sisters. Father to daughter. I also like actors Duval and Rowlands. And if its true that is NOT an action movie with cars chasing/crashing and bombs exploding or saving the world and a loved pet, it is also true that I never lost interest in the development of the plot throughout the film. Kyra Sedgwick is well cast and even Julia Roberts's role is convincing."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Hawn / Sylbert Movie Company",
         "Spring Creek Productions",
         "Warner Bros."
      ],
      "summaries": [
         "Grace Bichon, who is managing her father's riding-stable, discovers that her husband Eddie deceives her with another woman. After confronting him in the middle of the night on the streets of their small home town, she decides to stay at her sister Emma Rae's house for a while, to make up her mind. Breaking out of her everyday life, she starts to question the authority of everyone, especially her father's, thus causing a stir in her parent's marriage, too.",
         "A woman's world is rocked when she discovers her husband is cheating on her."
      ],
      "budget": 0
   },
   "movielensId": 195,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-08-04",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Lasse Hallström"],
      "runtime": 106,
      "movieId": 195,
      "title": "Something to Talk About",
      "mpaa": "R",
      "actors": [
         "Julia Roberts",
         "Dennis Quaid",
         "Robert Duvall",
         "Gena Rowlands",
         "Kyra Sedgwick",
         "Brett Cullen",
         "Haley Aull",
         "Muse Watson",
         "Anne Shropshire",
         "Ginnie Randall",
         "Terrence Currier",
         "Rebecca Koon",
         "Rhoda Griffis",
         "Deborah Hobart",
         "Lisa Roberts Gillan",
         "Libby Whittemore"
      ],
      "imdbMovieId": "0114496",
      "originalTitle": "Something to Talk About",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["yxbLkx8A1WI"],
      "plotSummary": "In one of her best-ever roles, Julia Roberts is Grace, whose reaction to the infidelities of Eddie (Dennis Quaid) turns the lives and loves of the people around her into something like falling dominoes. Robert Duvall, Gena Rowlands, Kyra Sedgwick and others in \"the year's best ensemble of characters\" (Jack Matthews, 'Newsday') co-star in this juicy, truthful story written by Callie Khouri",
      "tmdbMovieId": 18402,
      "avgRating": 3.0911,
      "releaseYear": "1995",
      "numRatings": 3381,
      "posterPath": "/p9qioRaQblGXemFRQSwo8TpikVJ.jpg"
   }
}