{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "cancer",
            "id": 10163
         },
         {
            "name": "astronaut",
            "id": 14626
         },
         {
            "name": "single mother",
            "id": 14768
         },
         {
            "name": "neighbor neighbor relationship",
            "id": 183896
         }
      ],
      "imdb_id": "tt0086425",
      "video": false,
      "title": "Terms of Endearment",
      "recommendations": [
         16619,
         2039,
         12626,
         9576,
         12560,
         11816,
         3525,
         403,
         3116,
         10013,
         2075,
         10436,
         9443,
         11393,
         10403,
         10998,
         11364,
         13665,
         25188,
         396
      ],
      "backdrop_path": "/8jOZrHAbHmMtcZOhFeJDtwzylRs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Aurora Greenway",
               "gender": 1,
               "credit_id": "52fe43eb9251416c75023117",
               "name": "Shirley MacLaine",
               "profile_path": "/faG5S4EOVaGHNf1CwZryGcHCE4e.jpg",
               "id": 4090,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Emma Greenway Horton",
               "gender": 1,
               "credit_id": "52fe43eb9251416c7502311b",
               "name": "Debra Winger",
               "profile_path": "/l1ISZ6yfV8ilaNmOHBVTheq6Mbq.jpg",
               "id": 26513,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Garrett Breedlove",
               "gender": 2,
               "credit_id": "52fe43eb9251416c7502311f",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vernon Dahlart",
               "gender": 2,
               "credit_id": "52fe43eb9251416c75023123",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Flap Horton",
               "gender": 2,
               "credit_id": "52fe43eb9251416c75023127",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sam Burns",
               "gender": 2,
               "credit_id": "52fe43eb9251416c7502312b",
               "name": "John Lithgow",
               "profile_path": "/uquz3dZ0fs0lAK57lCXwxaslVkb.jpg",
               "id": 12074,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Patsy Clark",
               "gender": 0,
               "credit_id": "5425b2a70e0a264576001ed2",
               "name": "Lisa Hart Carroll",
               "profile_path": null,
               "id": 1367884,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Rosie Dunlop",
               "gender": 0,
               "credit_id": "5425b2b50e0a263b810065fc",
               "name": "Betty King",
               "profile_path": null,
               "id": 1367885,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Teddy Horton",
               "gender": 2,
               "credit_id": "5425b2c4c3a368698c00117f",
               "name": "Huckleberry Fox",
               "profile_path": "/siDj0ZoNbcJQvB1WiElzlTbcrQT.jpg",
               "id": 150974,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Tommy Horton",
               "gender": 0,
               "credit_id": "5425b2d30e0a263b770064e3",
               "name": "Troy Bishop",
               "profile_path": null,
               "id": 189740,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Younger Tommy Horton",
               "gender": 0,
               "credit_id": "549bf25ec3a3682f1b0036d3",
               "name": "Shane Serwin",
               "profile_path": null,
               "id": 1403803,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Melanie Horton",
               "gender": 0,
               "credit_id": "549bf27cc3a3682f1b0036e5",
               "name": "Megan Morris",
               "profile_path": null,
               "id": 1403804,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43eb9251416c75023131",
               "name": "James L. Brooks",
               "profile_path": "/9Hx9JbnQBChJhlfJTvmnYF8o8DK.jpg",
               "id": 3388,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eb9251416c75023137",
               "name": "James L. Brooks",
               "profile_path": "/9Hx9JbnQBChJhlfJTvmnYF8o8DK.jpg",
               "id": 3388,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eb9251416c7502313d",
               "name": "Larry McMurtry",
               "profile_path": "/krz4pkRlT0FLYxrtndNnyOTVSOq.jpg",
               "id": 1807,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eb9251416c75023143",
               "name": "James L. Brooks",
               "profile_path": "/9Hx9JbnQBChJhlfJTvmnYF8o8DK.jpg",
               "id": 3388,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eb9251416c75023149",
               "name": "Michael Gore",
               "profile_path": null,
               "id": 32398,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eb9251416c7502314f",
               "name": "Andrzej Bartkowiak",
               "profile_path": "/K2pgHC907AUCim8WOkHOJpqERC.jpg",
               "id": 10765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eb9251416c75023155",
               "name": "Richard Marks",
               "profile_path": null,
               "id": 3175,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "59fc8b96c3a3681abb02ce91",
               "name": "Polly Platt",
               "profile_path": null,
               "id": 21067,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "59fc8b9ec3a3681acd02d19e",
               "name": "Harold Michelson",
               "profile_path": null,
               "id": 1765,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.952564,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11050,
      "vote_count": 241,
      "budget": 8000000,
      "overview": "Aurora and Emma are mother and daughter who march to different drummers. Beginning with Emma's marriage, Aurora shows how difficult and loving she can be. The movie covers several years of their lives as each finds different reasons to go on living and find joy. Aurora's interludes with Garrett Breedlove, retired astronaut and next door neighbor are quite striking.",
      "similar": [
         4347,
         425,
         745,
         334,
         281957,
         340666,
         452507,
         10054,
         2275,
         1562,
         298312,
         12149,
         182560,
         4476,
         8967,
         2288,
         4771,
         769,
         118,
         322
      ],
      "original_title": "Terms of Endearment",
      "runtime": 132,
      "poster_path": "/6CRrKmRs3SIgHGeCXZKH7P9ol1b.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1983-11-20",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Terms of Endearment Collection",
         "id": 507956,
         "poster_path": "/mSQGmUz0jbe6rGxjUsm5Ee4PPVb.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James L. Brooks"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "Larry McMurtry",
         "James L. Brooks"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086425/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0ODM4NDk0MF5BMl5BanBnXkFtZTgwMTEzMDUxMDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Shirley MacLaine, Debra Winger, Jack Nicholson | See full cast and crew »"],
      "reviews": [
         "Wow was my first reaction to seeing the film back in February 2003. I had bought it on a whim and watched it one night when I was bored. The rest is history. Terms remains one of my favorite films and I really can't say why. Reputation has made this out to be \"the ultimate chick flick\" upon which every other tear-jerker is judged. But it's definitely more of a character study than a weepy mushy movie. In fact, it's anything but mushy. Where it could of been over-sentimental, it was poignant. Where it could of been boring, it was insightful. And where it could of been corny, it was tongue-in-cheek. Shirley MacLaine and Debra Winger give career performances as mother and daughter. Both characters are polar opposites and in real life the actresses despised each other, but on screen their chemistry sizzles. Jack Nicholson is his usual suave self and John Lithgow is perfect as the wimpy banker. Danny Devito also has a quirky cameo. James L. Brooks is definitely an \"actor's director\". To him, the performances are clearly more important than set pieces or flashy camera work. Each of the three main performances are brilliant (especially MacLaine's). It has been decades since a movie about illness has been made like this that is so achingly real. Two scenes to look for: Aurora walking across a seedy hotel (heat-breaking) and Emma telling her mother that she's pregnant (hilarious). Terms of Endearment is a triumph!",
         "The shifty, funny/serious tone of \"Terms Of Endearment\" caught a lot of people off guard in 1983 and word-of-mouth about it being a seriously good tearjerker/comedy was strong (opening near Christmas probably didn't hurt it come Oscar time either!). But since then, TV sitcoms have been mining this kind of flippant, edgy, raw sense of dynamics (\"Roseanne\" comes to mind), and \"Terms\" doesn't seem as fresh. Watching it again the other night, I couldn't help feeling that some of the juice was missing, or that Shirley MacLaine's Aurora Greenway was actually more of an irritant than a sympathetic harridan. But on closer inspection, the lives of these characters are quite endearing, and the tender music on the soundtrack always underlines a poignant scene at just the right moment. Vivid Debra Winger is incredible as MacLaine's daughter, as are John Lithgow, Jeff Daniels, Jack Nicholson, and Danny DeVito (in a small but telling part). As for MacLaine, I think she makes a few missteps in her characterization, and I didn't like the scene where she leaves her own birthday party in a huff and finds herself at Nicholson's door--it feels put on--or her famous scene with Jack driving on the beach, which is highly improbable. However, her determined will and loving possessiveness/detachment towards her daughter makes her a complicated and colorful bundle of nerves. The picture is flawed, yet has scenes of worth and love, many memorable lines of dialogue, and shows a real skill for balancing different moods. *** from ****",
         "Exactly how in the world did I never see this movie before? I rented it on DVD the other night because I heard it was good, but I didn't expect it to be as good as it was. Incredible story, such powerful and passionate acting, it's just such a great film. I don't think I need to say anything about the acting in it, if you've seen Terms of Endearment you know that Shirley MacLaine, Debra Winger, and Jack Nicholson bring their characters to a life rarely seen in movies. I just can't get over how great this movie was. The story is so good, it's so funny and at times among some of the saddest moments I've ever seen portrayed in the movies. I don't want to go any further for fear that I might spoil it for those who haven't seen this incredible story about life and love and laughter among family. Oh, and if you haven't seen one of the greatest movies ever made, go do so now. Wrapping up, if you can't tell I loved Terms of Enderament. I guess I had always stayed away from it because it seemed like THE chick flick, but it's not. It's such a great story, great acting, everything of a great movie. 10 out of 10.",
         "What can I say about this film other than it is, in my opinion flawless. Every performance, every character, every scene... Debra Winger should have shared the Oscar with Shirley MacLaine. Few movies can make you laugh and cry OVER and OVER again, but this one does it for me. Even when I catch a scene on cable, I find myself drawn in emotionally and grabbing for my box of tissues. The mother-daughter relationship is so true-to-life and the chemistry between Debra and Shirley and Shirley and Jack is palpable. It is one of the greatest films ever made and should be required viewing for all mothers and daughters. This is an AMAZING and moving film!",
         "TERMS OF ENDEARMENT is an undeniably gripping and emotional film experience that will have you rolling on the floor during one scene and weeping uncontrollably during the next. This film follows the complicated relationship between an icy, Texan widow named Aurora Greenway (Shirley MacLaine)and her slightly-off-the-wall daughter, Emma (Debra Winger), who at the beginning of the film is marrying a man named Flap Horton (Jeff Daniels), whom her mother clearly hates, seemingly just to get away from her. The film follows Emma's marriage through three children, infidelity, and unexpected tragedy but it never lets go of the unspoken bond between Aurora and Emma...a bond so strong that it transcends telephone lines, geography, and even dialogue at times...there are moments in the story where you see Aurora and Emma communicate without saying a word to each other. Writer-director James L. Brooks won a pair of Oscars for writing and directing this funny and heartbreaking story that stretches over a long period of time but never fails to hold interest and trust me, the last 20-30 minutes of this film will have you weeping. Shirley MacLaine finally won her long-overdue Best Actress Oscar for her controlled performance as Aurora and Jack Nicholson won a Best Supporting Actor Oscar for his performance as a retired astronaut who moves in next door to Aurora after Emma moves out and begins a hilarious and touching relationship with Aurora. Debra Winger is explosive and unpredictable as Emma and Jeff Daniels is fully invested in the unsympathetic role of Flap. A truly unique motion picture experience that will leave you limp.",
         "A well-observed, well-made drama (with occasional comedic moments), that may not be exactly \"high art\" (it's neither profound nor original), but DOES feature some great acting and manages to pull you in. Debra Winger gives an extraordinary performance; she has a naturalness and expressiveness that you rarely see on the screen. When her character is happy, her whole face brightens up and her joy becomes infectious; when she's sad or confused or embarrassed, the emotions come across strongly, although she never goes over the top. Considering that she lost the Oscar to her co-star, Shirley MacLaine, who is reasonably good but far more one-note, I'd say we had a major Academy Award injustice there. Jack Nicholson is fun to watch and has some amusing lines, and most supporting roles, like those played by John Lithgow and Danny De Vito, are also first-rate and completely believable. So overall it's a good film, directed almost flawlessly, although in the final 20 minutes it needlessly wallows in melodrama. (***)",
         "After the late 60's, early 70's, when movies began to circulate as news and talk show events, we the public began to believe we were to leave the theater having gotten (or not) the message. Such was for better or worse. Great movies like BONNIE & CLYDE, MIDNIGHT COWBOY and NETWORK were fussed, discussed, etc., and educated and entertained us with varying points of view (if no more through water cooler encounters). I may be naive but was it THEN that it became fun to discuss favorite movies, much like books had so been? SUPPORT: Siskel & Ebert's AT THE MOVIES began to appear on PBS in the late 70's. The blowback was a series of shallow - if mildly clever - movies that either the new industry and/or the media spun to we the public as \"art\". Hence TERMS OF ENDEARMENT, DRIVING MISS DAISY, MOONSTRUCK, and more recently Shakespeare IN LOVE, etc. I suggest that films of this caliber, not necessarily terrible, never won Oscars in the 40's, 50's or 60's. The characters in TOE are inarticulate, impatient and shallow people. TOE might have been good if such were the intended message. The sentiments of the movie are incredibly contrived; e.g., we are told zero of the substance of Flab's affairs though Emma's affair is, of course, justified, authentic, etc. I sum up McClain's Character in one word: shrill. I also dare anyone to create a more unashamed melodramatic ending. After watching this flick I walked out of the cinema in Topeka, KS in 1983 not giving a rat's ass about any of the folk or sentiments I'd just seen. Blame it on me being Roman Catholic but the only events, people, circumstances, etc., worthy of concern in TOE were Flap and Emma's children, to which NO attention was paid. I'm going to sound like a snob now. Here's the substance of the personal comments I heard and still hear when I inquire about TOE: \"It was so good\", \"It was so sad.\", \"It was soooo good!\", \"It was sooo moving.\", \"It was just like real life.\", \"I can't believe she died.\", \"You know my sister just died.\" You get the picture.",
         "I've heard many good things about James L. Brooks's 'Terms of Endearment' and finally I decided to give it ago. Honestly speaking I was expecting a typical melodramatic tearjerker that's sole aim is to emotionally manipulate the viewer. I was wrong. 'Terms of Endearment' is a slice of life that centres around a mother, her daughter and their respective lives. The film looks very authentic. The sets, makeup, costumes and art direction look genuine. This is very much a character driven film. The dialogues are full of humour and wit but what's also striking is how deeply layered the words are. While the visuals are quite simplistic it's the characters that shine especially through the actors' natural performances. Their excellent non-verbal gestures, spot on line delivery and restrained performances are superb. A sassy Shirley Maclaine and bubbly Debra Winger are spellbinding. Both actresses beautifully carry the film and they are brilliantly supported by fine actors like Danny DeVito, Jack Nicholson, John Lithgow and Jeff Daniels. What particularly appealed to me about 'Terms of Endearment' is the depiction of the mother-daughter relationship and the dynamic of it. It definitely has its ups and downs and it does not involve the use of clichéd lines like 'I love you' etc but at the same time the unconditional love between them is wonderfully conveyed.",
         "After looking forward to seeing this film for many years, I finally have watched it, and was left a little disappointed. Don't get me wrong, it's a good movie, but I expected so very much more. I found the plot to be rather thin for a movie this long, and after some thought, I'd have to say that the script was average at best. With a weaker cast, I suspect that I wouldn't have even liked it. Fortunately, this film is blessed with a spectacular cast, and this film deservedly received Oscar recognition in the acting categories. It just didn't deserve the best picture Oscar that it also won.",
         "I am a heterosexual, red-blooded woman who hates \"Terms of Endearment\". There, I said it, and I don't care who knows. \"Terms of Endearment\" is one of those insufferable movies aimed for women, even though it is clearly written by men who clearly don't know anything about real women. It's also a disjointed, plot less, excruciatingly dull story with some of the most poorly written characters to ever disgrace the screen. I didn't know which female protagonist I found more insufferable: Aurora (Shirley McClaine), an overbearing mother who clings to her daughter Emma (Debra Winger) like a leach but doesn't appear to actually love her. Aurora is one of those people who refuse to let go and let God, as evidenced where she happily wakes her sleeping baby daughter up because she's convinced that Emma has suffered \"crib death\". Emma is so sick of her mother's nagging ways, she marries the first loser who shows interest, much to her mother's chagrin (\"You are not special enough to overcome a bad marriage,\" Aurora bluntly tells her). Then there's Emma herself, who I desperately wanted to root for, having an overprotective mom myself. Emma could have been written with a certain amount of dignity, passion, and endearing insecurities and intelligence that emerge in spite of Aurora's crappy parenting. Instead, Emma is an immature, petulant, flighty ninny who goes from having a backbone of steel one moment to being a complete pushover the next. She firmly calls her ne'er-do-well husband Flap (Jeff Daniels) on his infidelity, and yet stays with the cheating bastard for no clear reason whatsoever. Not to mention Winger plays Emma the way one would a mentally unstable 3-year-old and who sounds she doing the world's worst Joan Cusack impression. I got the feeling her children would be like the type of kids who have to raise and clean up after their alcoholic parents. I knew something was wrong when the only character I even remotely liked was Jack Nicholson's aging womanizer character. Considering that I don't even like Jack Nicholson, that's really something. Worst of all, \"Terms of Endearment\" is responsible for starting the trend of manipulative tearjerkers that involve families coming closer because of death (\"Stepmom\", \"The Family Stone\", \"One True Thing\"). Not only is it reprehensible to treat death so lightly, but it is unfair to the audience. It's as if filmmakers are punishing them for not being emotionally invested enough in the characters by creating latent feelings of guilt by killing them off. And it's always with Hollywood Cancer, the type of cancer where vomiting and chemotherapy somehow never come into play. I have nothing against chick flicks, I really don't. Just this one."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["Aurora and Emma are mother and daughter who march to different drummers. Beginning with Emma's marriage, Aurora shows how difficult and loving she can be. The movie covers several years of their lives as each finds different reasons to go on living and find joy. Aurora's interludes with Garrett Breedlove, retired astronaut and next door neighbor are quite striking. In the end, different people show their love in very different ways."],
      "budget": 8000000
   },
   "movielensId": 1958,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-11-20",
      "dvdReleaseDate": "2001-04-10",
      "directors": ["James L. Brooks"],
      "runtime": 132,
      "movieId": 1958,
      "title": "Terms of Endearment",
      "mpaa": "PG",
      "actors": [
         "Shirley MacLaine",
         "Debra Winger",
         "Jack Nicholson",
         "Danny DeVito",
         "Jeff Daniels",
         "John Lithgow",
         "Lisa Hart Carroll",
         "Betty King",
         "Huckleberry Fox",
         "Troy Bishop",
         "Shane Serwin",
         "Megan Morris"
      ],
      "imdbMovieId": "0086425",
      "originalTitle": "Terms of Endearment",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "FjLFMTIDkIM",
         "XNP_J-Vf76w"
      ],
      "plotSummary": "Aurora and Emma are mother and daughter who march to different drummers. Beginning with Emma's marriage, Aurora shows how difficult and loving she can be. The movie covers several years of their lives as each finds different reasons to go on living and find joy. Aurora's interludes with Garrett Breedlove, retired astronaut and next door neighbor are quite striking.",
      "tmdbMovieId": 11050,
      "avgRating": 3.63358,
      "releaseYear": "1983",
      "numRatings": 5723,
      "posterPath": "/6CRrKmRs3SIgHGeCXZKH7P9ol1b.jpg"
   }
}