{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "maze",
            "id": 2158
         },
         {
            "name": "castle",
            "id": 3098
         },
         {
            "name": "puppet",
            "id": 6300
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "labyrinth",
            "id": 18129
         },
         {
            "name": "fantasy world",
            "id": 170362
         },
         {
            "name": "goblin",
            "id": 189094
         }
      ],
      "imdb_id": "tt0091369",
      "video": false,
      "title": "Labyrinth",
      "recommendations": [
         1547,
         11639,
         34584,
         847,
         11976,
         1648,
         1649,
         8989,
         11814,
         4011,
         957,
         926,
         6978,
         2605,
         11884,
         5683,
         10776,
         10166,
         9340,
         2293
      ],
      "backdrop_path": "/xPCO1mq0m8bS90lEK3QaYTHiIJW.jpg",
      "revenue": 12729917,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jareth",
               "gender": 2,
               "credit_id": "52fe457f9251416c750588e5",
               "name": "David Bowie",
               "profile_path": "/7OIa363iSLG43x9Sb9HojUANwbh.jpg",
               "id": 7487,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe457f9251416c750588e9",
               "name": "Jennifer Connelly",
               "profile_path": "/xTpRRy9hwk4E2uypuQ30iqt2W2W.jpg",
               "id": 6161,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Toby",
               "gender": 2,
               "credit_id": "52fe457f9251416c750588ed",
               "name": "Toby Froud",
               "profile_path": "/cA3CE3sTfCk76sNPAwUTeNCIY6H.jpg",
               "id": 68794,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Father",
               "gender": 2,
               "credit_id": "52fe457f9251416c7505892d",
               "name": "Christopher Malcolm",
               "profile_path": "/9Ua0yZoI6dZQ5VDqfU096dAM1Un.jpg",
               "id": 47808,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Stepmother",
               "gender": 0,
               "credit_id": "52fe457f9251416c75058931",
               "name": "Shelley Thompson",
               "profile_path": "/vrSEHnWtPn6qHPSTq2lbnS3ZisZ.jpg",
               "id": 68795,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Goblin Corps",
               "gender": 2,
               "credit_id": "52fe457f9251416c75058935",
               "name": "Warwick Davis",
               "profile_path": "/4LjgmjD9nKOgL3gGRhIS5EkI0a.jpg",
               "id": 11184,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Fairy",
               "gender": 0,
               "credit_id": "539708fac3a3686415005bd8",
               "name": "Natalie Finland",
               "profile_path": null,
               "id": 1329495,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Hoggle",
               "gender": 0,
               "credit_id": "5397090ec3a3686423005d5f",
               "name": "Shari Weiser",
               "profile_path": null,
               "id": 1329496,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Hoggle",
               "gender": 2,
               "credit_id": "5397101e0e0a266db7009512",
               "name": "Brian Henson",
               "profile_path": "/m2Bczi1gvhnIYCGp8Fhg2QCPuNf.jpg",
               "id": 65298,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Ludo",
               "gender": 0,
               "credit_id": "539710310e0a266dce0094f0",
               "name": "Ron Mueck",
               "profile_path": null,
               "id": 1329518,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Ludo",
               "gender": 0,
               "credit_id": "539710440e0a266dbf00950f",
               "name": "Rob Mills",
               "profile_path": null,
               "id": 220893,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Didymus",
               "gender": 2,
               "credit_id": "539710540e0a266dc200933e",
               "name": "Dave Goelz",
               "profile_path": "/hVfv7gsUPDRDFxUk7fyCktIL7Ar.jpg",
               "id": 64181,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Didymus",
               "gender": 2,
               "credit_id": "539710630e0a266db4009613",
               "name": "David Alan Barclay",
               "profile_path": null,
               "id": 1329519,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Didymus",
               "gender": 2,
               "credit_id": "539710740e0a266dc2009345",
               "name": "David Shaughnessy",
               "profile_path": "/9lJkB9mFvAiKIMvV7Zmk72vTnUK.jpg",
               "id": 193254,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "The Worm",
               "gender": 1,
               "credit_id": "539710810e0a266dca0095a3",
               "name": "Karen Prell",
               "profile_path": null,
               "id": 189120,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "The Worm",
               "gender": 2,
               "credit_id": "5397108e0e0a266db7009520",
               "name": "Timothy Bateson",
               "profile_path": "/dHSn6dpypXLmNCrCwOy3fJDbPsT.jpg",
               "id": 3548,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c750588e1",
               "name": "Jim Henson",
               "profile_path": "/2OWxHy8MPdaSiLN8Vt0siC0hdr4.jpg",
               "id": 55983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457f9251416c750588f3",
               "name": "Dennis Lee ",
               "profile_path": null,
               "id": 236923,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c750588f9",
               "name": "Jim Henson",
               "profile_path": "/2OWxHy8MPdaSiLN8Vt0siC0hdr4.jpg",
               "id": 55983,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c750588ff",
               "name": "George Lucas",
               "profile_path": "/8qxin8urtFE0NqaZNFWOuV537bH.jpg",
               "id": 1,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457f9251416c75058905",
               "name": "Trevor Jones",
               "profile_path": "/86HjonjMXwcDyOlpaQW1SVR9CXh.jpg",
               "id": 7020,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c7505890b",
               "name": "David Lazer",
               "profile_path": null,
               "id": 70773,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c75058911",
               "name": "Alex Thomson",
               "profile_path": null,
               "id": 21516,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe457f9251416c75058917",
               "name": "George Gibbs",
               "profile_path": null,
               "id": 8943,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c7505891d",
               "name": "John Grover",
               "profile_path": null,
               "id": 10495,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c75058923",
               "name": "Brian Froud",
               "profile_path": null,
               "id": 961211,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c75058929",
               "name": "Terry Jones",
               "profile_path": "/7YaQ0k5BmUU3MmFvDL72tXl2G0B.jpg",
               "id": 10707,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 17.104145,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 13597,
      "vote_count": 754,
      "budget": 25000000,
      "overview": "Frustrated with babysitting on yet another weekend night, Sarah - a teenager with an active imagination - summons the Goblins from her favourite book, \"Labyrinth\", to take the baby stepbrother away. When little Toby actually disappears, Sarah must follow him into the world of the fairytale to rescue him from the Goblin King!",
      "similar": [
         336843,
         11639,
         197796,
         626,
         28501,
         17102,
         29778,
         23220,
         75301,
         20347,
         2265,
         32536,
         395883,
         70811,
         18919,
         44510,
         96712,
         28592,
         46624,
         20122
      ],
      "original_title": "Labyrinth",
      "runtime": 101,
      "poster_path": "/40D6CVNGYbIgg7Sdt1jAYkFA08d.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Henson Associates (HA)",
            "id": 24931,
            "origin_country": ""
         },
         {
            "logo_path": "/o86DbpburjxrqAzEDhXZcyE8pDb.png",
            "name": "Lucasfilm",
            "id": 1,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Jim Henson Company, The",
            "id": 6254,
            "origin_country": ""
         }
      ],
      "release_date": "1986-06-27",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Where everything seems possible and nothing is what it seems.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jim Henson"],
      "runtime": 101,
      "synopsis": "Sarah Williams ( Jennifer Connelly) was a teenager with a large imagination and love for fantasy stories, so much so that she enacted her favorite storybook, the Labyrinth, whenever she could. She happened to have been pretending that she was the heroine in her story while wandering in the park near her house when the clock on the near by city hall building struck, informing her it was 7pm. She realized she was an hour late and needed to get home to watch her baby stepbrother, Toby (Toby Froud). After arguing with her stepmother about her tardiness and feeling ignored by her father, Sarah was left alone with her fussy infant brother. Angered that her stepmother had given her brother one of her favorite teddy bears, a tattered toy called Lancelot, Sarah shouted into the air for someone to take her away from 'this awful place.' To get Toby to stop crying, she told him the story of how the Goblin King was in love with the girl who was 'forced to stay at home with the baby' and that he had 'given her certain powers.' But Sarah in no way believed this story could be real. In anger that the child wouldn't stop crying, Sarah did call for the goblins to take her brother. They took Toby away and Jareth ( David Bowie), the King of the Goblins, gave her an option; she could take her dreams or spend 13 hours in his kingdom, an ever-changing maze called the Labyrinth. If she was able to get to the castle at the center within the specified time, her brother would be spared from becoming a goblin. Sarah was resolved to save her brother and the king left her to do her task. She immediately met an ancient looking dwarf with a feisty attitude who showed her how to enter the Labyrinth. His name was Hoggle (voice Brian Henson) and he told her not to take anything for granted in that place; she didn't seem to find him very helpful and basically told him to leave. However, eventually she got herself stuck in an oubliette, and the one sent by the Goblin King to 'rescue' her was Hoggle. But Hoggle was beginning to like Sarah and against the orders he was given to send her back to the beginning of the Labyrinth, having her start all over again, and therefore be late, he made the choice to help her get to the center and reach her brother. This did not bode well with Jareth, who in umbrage at Sarah's haughty attitude took three hours of her time away and threatened to send Hoggle to the most horrible place known in the Labyrinth for his betrayal, a stinky land of slimy mud called the Bog of Eternal Stench. Then Jareth turned to Sarah and asked her how she was enjoying his Labyrinth. When she flippantly said it was a 'piece of cake,' the king sent a machine covered in spinning knives after her and Hoggle, then disappeared. They were able to escape, yet Hoggle got scared by the sound of a howling creature and said he was a friend to no one but himself, leaving Sarah to fend for herself. Sarah forced herself not to be afraid, remembering she had been told 'things aren't always what they seem in this place.' She found Ludo, a giant furry beast and a gentle creature despite his massive size, who became her friend when she saved him from being tortured by a bunch of goblins. But she became separated from Ludo too and found herself in a strange forest where she met the Firies, creatures that were able to dismember themselves and take off their heads. They tried to take off her head, which of course didn't work, but they didn't stop trying to mutilate her, so she threw their heads away. Hoggle came to her rescue, but she didn't know that the Goblin King had threatened that if she ever kissed him, he would immediately be sent to the Bog. As soon as her lips touched the dwarf's bald head in a kiss of gratitude for being rescued, the stones beneath them shook and they fell to the Bog. Thankfully they didn't fall into the muck. They found Ludo there and met Sir Didymus, a fox knight with a sheepdog as his steed, who decided to aid Sarah in her quest for her brother. As the castle was not much further, there was hardly anything left to prevent her from reaching Toby in time. Except one thing. The Goblin King had forced something on Hoggle; he was to give Sarah a peach that would make her forget about Toby. And Sarah was hungry, which left Hoggle no choice but to give the fruit to her. Handing it to her, he left in shame at having to obey the king. By eating the peach, Sarah found herself in a dream, in a ballroom full of masked faces. She wore a beautiful silver gown and the Goblin King held her tightly in a dance, but she knew there was something she had to do so she left his arms and broke free of the crystal ball he had placed her in. She awoke in a junkyard, peach in hand, but she still couldn't remember what she was supposed to be doing. A goblin woman with a collection of knickknacks on her back led her to a room: her bedroom. Sarah ran to her bed and flopped down onto it, burying her face in the pillow. It had all been just a terrible dream. But it wasn't a dream, for as soon as she opened her bedroom door, the goblin woman came in and tried to get her to begin a collection of knickknacks from her room for herself. One of the items happened to be her book of the Labyrinth and she was immediately reminded that she needed to save Toby. Her friends had followed her to the junkyard when she had been trapped in the crystal and pulled her to safety. They quickly hurried to the nearby castle, for she had less than an hour left. They entered the Goblin City, which surrounded the castle, and soon found goblins attacking them in hordes. But eventually they made it through the chaos to the castle. The throne room was empty and a clock on the wall let Sarah know she had less than 5 minutes left to reach her brother. The only direction Jareth could have taken Toby was up the stairs, and Sarah went it alone, to the concern of her friends. When she reached the room at the top she had to hold to the wall to keep from getting dizzy. This room had many stairways that led to nowhere and walkways between. There was no up or down and she didn't know which way to go. But the Goblin King made himself known, standing below her and she gasped when she saw him. He easily walked around the ledge to her, even walked straight through her, trying to intimidate her. With an evil grin he threw a crystal and she watched as it bounced across the multiple perspectives of the room, only to land in the hands of her brother, who seemed to be sitting upside down above her. Now that she knew where Toby was, all she had to do was get to him, but that was the whole problem. Toby would crawl somewhere different the second she thought she had neared him and, unlike her, he didn't know he wasn't supposed to be able to defy gravity and crawl on the ceiling. Finally she found him directly below her, sitting on the floor, dangling his feet over the ledge of a door. Toby was right there, twenty feet below her, and she had no way of getting to him. Sarah didn't know how long this had been taking her but knew she hardly had any time left. All that she knew was that if she didn't hold Toby in her arms in time, he would never be the same again; she had to save him from becoming a goblin. So with a gulp and wincing of her face at the thought of how broken her bones would be once she fell to the ground beside him, she jumped. But she didn't hit the floor. In fact, as she kept falling, the room was breaking up around her. Finally her feet hit a floor and she found the Goblin King slowly walking towards her from out of the shadows. He wore all white, his cape of feathers flowing about him as he neared her. She began to state the lines her story said would defeat him and finalize her brother's safety, but the king stopped her and offered her dreams to her once again; he even offered himself. But her only resolve was to save Toby, so she completed her dialog and found herself back in her home. The defeated Goblin King flew out the window, banished to live in an owl form. Sarah ran upstairs to ensure that her brother had been returned and found Toby sleeping soundly. She went to her room and began to put away those things that were part of her childhood fantasies, but as she did so, she saw the faces of her friends from the Labyrinth staring at her in her mirror. They told her they would always be around if she needed them, and she told them that every now and again in her life, she would.",
      "writers": [
         "Dennis Lee",
         "Jim Henson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091369/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczNTkyOTIzN15BMl5BanBnXkFtZTgwNjY3MjQxMDE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: David Bowie, Jennifer Connelly, Toby Froud | See full cast and crew »"],
      "reviews": [
         "I recently had the pleasure of watching this movie with three kids who had (to my shock and dismay) never seen it before. It turned out to be as good, if not better, as I remembered. The story is reminescent of the original, printed page (very dark) Grimm fairy tales. The special effects are still special, and the characters are unforgettable. Seriously, don't miss it. This is one of the very few childrens' movies that is smarter and better than what has unfortunately become \"normal\" for the genera. The reverse evolution in childrens' films is heartbreaking, as kids don't deserve to be talked down to so often in movies. I grew up on films like \"Labyrinth\", \"the Neverending Story\", and \"the Secret of NIMH\", and I still count them among my favorites. In the 80's they gave us cinematic filet mignon, and today's kids are getting Spam.",
         "This is a classic fantasy film from Jim Henson, in collaboration with George Lucas. There really is a magic about the film and that has helped it last as a firm family favourite all these years. As with many films aimed at younger audiences there are messages that the writers, in this case Henson himself, have tried to convey, such as `be careful what you wish for (as in the heat of the moment we are not always sure what is best for us) and also about not taking things for granted. These lessons not only relate to the major target audience of young children but also teenagers and adults alike. The film also has values and attitudes about growing up, the central character Sarah is in the awkward stage between child and womanhood, the stage of adolescence. She acts like a child in her self importance and possessiveness but she is perhaps starting to grow out of her young imagination. She does not want to, her room full of inanimate companions, dreams and fantasies, she feels are slipping away. Labyrinth is about Sarah keeping her imagination alive, her fantasies and dreams, and these help her figure out what she is doing wrong, it helps her realise how her attitude is wrong and causes her to be depressed. There is certainly intelligence to this film if analysed deeply. There is depth to the script, and clear attitudes and values that Jim Henson conveys. Henson is in a way telling not just kids, but also adults, that our subconscious, which includes our dreams and imaginative side (in terms of taking yourself to another place, more than imagination in creating something like a piece of music for instance.) can be as affective a guide to where and when your live is going wrong as your conscious. Sometimes we don't realise things we have said or done until we dream. How many times have you said something, that every teen must have to their parents, for instance `I wish you were dead', very cruel but it is said. I have in the past and realised the full implication in a bad dream, a dream is the most effective doorway to imagine something outside of it really happening. What is fantastic about the way the film opens and closes as that it really hints to the fact that Sarah has been through the same dream before, and that she needs these imaginative friends, and dreams to help her see the light as it were. She says for instance at the close that every now and again she needs Hoggle and company. The opening of the film sees Sarah reciting from a book to herself, she is addressing the Goblin king and the characters of this book and her room are the cast of a play inside her mind, they are special to her and meaningful, in a way we might have a favourite song that speaks to us in some way. At the start of the film when we are first in her room there is clever use of visual hints that you wouldn't pick up on until watching a film the second time. Look around her room and you see the characters everywhere, Hoggle, Ludo even a little replica of a maze. There is also a clipping of Sarah's mother, who we do not know whether she is still alive, but in any case is not around, but she is with a man who is the likeness of the Goblin King. The man in the photo probably a figure of blame for the loss (however large) of Sarah's mother. What is also interesting is Sarah being a young girl at the start of puberty has a certain fascination and perhaps crush on the Goblin King, perhaps a combination of the character from the book and the likeness of which she has created this character in her head. Certainly on a visual and script basis there are some clever touches when you consider this is a kids film. The film itself is much like the Wizard of Oz in terms of story (intentional maybe as it could represent something that Sarah finds special and perhaps inspirational). What I really love about the film is, that before the days of CGI, inside the Goblin world, which accounts for 90% of the film, everything is 100% set work, there must be well over a hundred sets and they are all imaginative an create the enchanting atmosphere of the film, these sets combined with some fantastic matte paintings from ILM that give even more of a scale to the film. I do really like this film, the look, the cheesy feel good 80's music, the characters, it is all great. There is some good humour and of course the odd piece of very childish low brow humour but that is to be expected. It is movie magic no question. David Bowie is good as the Goblin King and all the puppeted characters are fantastically brought to life in there movements and voicing as you would expect from a Henson film. A very youthful Jennifer Connelly before the days when many a website was devoted to her ample bosom, has a charm to her, she has to hold the movie together and win the audience, especially after being very bratty and effectively wishing her baby brother into the clutches of Goblins. She does manage to win the audience though and enchant them with her green eyes and youthful innocence. This film is great, it is what makes, or made fantasy films of this time really enchanting. Real artistry was involved, there was exuberance and charm to it and it has lasted a long time. It is a firm fans favourite and still gains new young fans. I can still to this day sit down and enjoy the film because I remember what Jim Henson tries to teach us. `Keep the inner child alive inside you sometimes he/she actually knows best'. Perhaps certain events in recent years may have panned out differently had this been heeded by more people, but that is all just hear say. Overall this is a classic fantasy film with much artistry and charm to appreciate, certainly Henson had a skill in all his fields in the industry. ****",
         "Cool film! Way too good for children. Jim Henson, as ever, is the absolute master of every kind of puppetry known to man or muppet.Particularly adorable is the little punk worm who invites Sarah to \"Come inside and meet the missus\"... very cute. The plot has all the essential elements of a good fairy tale with the added bonus of a heroine who manages to get through all her trials and tribulations without squealing feebly or fainting into the arms of any poxy bloke. David Bowie is wonderfully sexy (despite the fright wig) and his natural humour shines through although his character does a pretty good job of being spiteful and menacing. I get the feeling the he really enjoyed making this film. The soundtrack is excellent and \"As the World Falls Down\" is quite hauntingly beautiful ('though I have to agree with an earlier reviewer that the ballroom sequence in which it was played did slow the action down a little - but it was a visual feast). All in all, a beautiful film with a wonderful cast of creatures and humans. Makes me miss Jim Henson's talents lots but at least we've still got Brian (his son). My friend's three year old now has a crush on the Goblin King (I dread to think how that's gonna shape her life!).",
         "The first time I saw this movie was two years ago. Don't ask me how I managed to miss it as a child but I did. It is obvious that this movie was made for the kiddies but I don't think it can just be enjoyed by the younger crowd. I think perhaps if I had seen this as a child instead of a teenager I would have enjoyed it more but I didn't and I still enjoyed never the less. There is something magical about watching Labyrinth. You just feel the happiness that rubs off from this movie. It almost makes you wish you were a kid again. I admit seeing it now I have to say some parts are beyond corny but I think that's just part of it, I mean that was the 80's right? I am not even a David Bowie fan but I can't help but smile whenever he starts singing (which is quite often). I recently showed this to my 4 year old cousin and he couldn't get enough of it. It was so great to watch him turn his head back to look at me with a giant smile to make sure I saw the puppets doing whatever they were doing at that moment. He really loved it so I bought him the dvd for X-mas this year along with myself a copy. This is really just one of those movies you have to see at least once in your life, just because there isn't another like it. Sure the story isn't much when it comes to plot but try to watch this film all the way through without smiling once, I dare you! A great movie for the kids or kids at heart! 8 out of 10 stars.",
         "Oh dear, Jim Henson, you are sorely missed. Not necessarily because you went before your time, or even in somewhat rotten circumstances. No, it is because unlike the purveyors of so-called family entertainment these days, your work was actually entertaining to the whole family. When I was a lad, I used to think these films were childish and patronising. By comparison to what is being aimed at the children of my cousins, it is MENSA material, and I realise now that it was far more brilliant than I had previously given it credit for. Indeed, compared to the \"you're not good if you don't have good feelings\" rubbish that the likes of B'Harni fill the heads of children with, Henson productions deserve a medal. At its heart, Labyrinth is a simple fable about how much we miss something once it is gone. A young girl wishes that her annoying stepbrother would disappear, only to find when he is gone that she misses him. Enter the Goblin King, played with a great malice by David Bowie. The challenge the Goblin King sets almost sounds like a video game. Indeed, one popular Commodore 64 game of the time set the challenge of collecting the pieces to solve a key puzzle to save the world in a certain time period. Labyrinth was even adapted into a game for the Commodore 64. In Labyrinth the film, this young woman named Sarah, played with a certain kind of brilliance by a young Jennifer Connelly, is challenged to navigate a massive labyrinth in less than thirteen hours, lest her brother become one of the Goblins. It sounds like a very simple idea, and it is. What makes Labyrinth the under-appreciated classic that it is is in the details. As previously indicated, the leads are absolutely brilliant. While David Bowie chews scenery like there is no tomorrow, Jennifer Connelly gets so into her character that she makes it seem perfectly natural when she is interacting with some of Jim Henson's most ludicrous creations. The scene in which she rescues a giant yeti-like thing called Ludo is one of the most superbly-made things in the history of children's film. It is also worth noting that in contrast to the aforementioned normalism of B'Harni and his ilk, Henson's creations taught the valuable lesson that appearances are not the sum total of a living creature's character. Ludo looks like he could tear apart our protagonist, but his manner and speech show him as one of the most gentle and lovable characters ever depicted in film. As you might guess from this film featuring David Bowie as the top-billed star, there are also a few song and dance numbers. Some of them, such as the magic dance number, are immortally embarrassing. Or at least, they would be, if not for two things. First, the suspension of disbelief that Henson so admirably achieves with his puppets is a real pleasure. Second, Bowie's golden voice could charm the paint off walls. When he sings \"I saw my baby, crying hard as babe could cry\", it stands out like a stark reminder of why this man used to be able to sign record deals worth tens of millions of dollars. It may even bring tears to your eyes. If Labyrinth does have a weakness, it is in the closing reels. The final song from Bowie stretches the scene beyond its welcome, but it recovers nicely once Sarah returns to the real world. The compositing work in the Firey sequence is rather lousy, and the story seems to grind to a halt when they do their song and dance number. On the other hand, their song and dance number is still incredibly amusing to behold. In all, I gave Labyrinth an eight out of ten. It is not perfect. In fact, I wonder if whomever designed Bowie's costume was not playing an elaborate joke upon him. But for all of its problems, Labyrinth is an underrated classic. One of the few films that is advertised as being for all ages, and can entertain audiences of that description. A great light went out in our world when Jim Henson passed away.",
         "The movie takes you to a wonderful world where nothing is what it seems. I was about 10 years old the first time I saw it and it made such an impact on me that I ended up ordering it from Germany just 12 years old. The setting is fantastic; it's just scary enough without making scares in a young boy's soul. Bowie acts in a trilling way, and his unique and magical voice brings it all together. If you like fantasy you will love this film. All the Quotes make Bowie as Jareth \"the Goblin King\" the perfect villain. At times you almost despise him but as I wrote in my first sentence, nothing is like it seems. And as I grow older I sympathized with him, you may even say that he tries to help Sarah. If you decide to see that aspect of it that is. All in all I wish you all a lovely experience watching this movie!",
         "Growing up as a child in 1980's New York, I remember being inspired by many fantasy and science fiction films, that eventually led me to start writing short stories myself (from there to my current occupation of journalism the road was quite short, BTW). Titles like The Neverending Story, Flight of the Navigator and Who Framed Roger Rabbit? captured my imagination and filled me with aw, and with time found their way to my ever growing DVD collection, as did Jim Henson's Labyrinth, the latest addition to my nostalgic bundle of joy. The saddest thing about all this is that no one seems to make films like Labyrinth anymore. Viewing it again at the age of 25 just made me appreciate it even more, for all of it's breathtaking imaginative figures, rich scenery and original plot; especially when some of the scenes seem somewhat dated while the essence and heart of the film remain in tact, even twenty years down the road. In short, Labyrinth is one of Jim Henson's last attempts at creating cross-age entertainment through his world famous puppets, after bringing life to the eternal beloved characters of The Muppets and Sesame Street, and before his sudden and premature death. The story presents us 16 year old Sarah (a very young Academy Award winner Jennifer Connelly, A Beautiful Mind), who has an extremely vivid imagination she uses to escape her everyday worries... or so it seems. After asked to take care of her baby stepbrother, Toby, Sarah finds herself dealing with a screaming infant, instead of wondering away in her thoughts to a world filled with Goblins, Yeti-like creatures, and a King Atrhur-ish talking dog. After several lacking attempts at calming the baby down, she wishes Toby to the evil Goblin King Jareth. Fantasy and fiction clash when Jareth (the one and only rock singer David Bowie, who appears on screen with an extravagant 80's outfit and some cute yet unnecessary songs) actually takes Toby away to his evil kingdom, where he threatens to transform the baby into a Goblin, if Sarah won't find a way to cross a tricky and mystical Labyrinth on the way to his kingdom. Determined to save her brother, Sarah makes her way through the Labyrinth, meeting helpful friends along the way, whilst magical fantasy happenings occur around her... This is a true 1980's gem. Treat it with care, and enjoy!",
         "By today's standards \"Labyrinth\" may look dated and cheap but there's something about it that makes it special. David Bowie makes it a stand alone movie in the weird ranking. The man is crazy but his performance is excellent! Jennifer Connely (being 16 at the time) delivers a solid and tender performance. She was very, very cute and her performance totally gained the audience's love. The tale is fantastic and keeps you interested from the beginning to the end. The musical moments are also great! The f/x were great for it's time and I wonder how they came out with the idea for creating such original characters. The thing that I liked the most about the movie is it's art direction. The world that is created is taken directly from everyone's fantasy world idea. Colorful and dark at the same time. Better than the \"Neverending Story\" movies, \"Labyrinth\" should be watched for lovers of sci-fi.",
         "Jennifer Connelly is Sarah, an immature spoiled narcissistic bratty teen whom after wishing her baby brother, Toby, away to the Goblin King (a great David Bowie, who's a highlight of the film) and has to traverse a complex labyrinth to get him back learning to be a lot less selfish in the process. Bowie's songs highlight and punctuate a magical film that is sure to appeal to both the young and young at heart. Better then Jim Hanson's other more mature film of the 80's \"The Dark Crystal\", because it's a tad more humane and more easily to relate to, but both these films are fun to watch. Loving this film from when I was a kid myself might have shading my opinion of it a bit, yet re-watching it just now, I still find it very enjoyable. My Grade: B+ Collector's Edition DVD Extras: \"Inside the Labyrinth\" 56 minute making-of featurette; Four photo galleries; posters gallery; Filmographies; Storyboards; Theatrical trailer; and trailer for \"The Dark Crystal box set\" Random Notes: Comes packed with animation cell/scene composite card and postcards",
         "A Fantastical Quest Through the Labyrinth of Time. This Henson/Lucas production isn't quite what you'd expect from these legendary directors. Somehow, it's better. The genius of Henson and Lucas shines brightly as Jennifer Connelly and David Bowie perpetuate this wonderful tale of fantasy written by Dennis Lee and Jim Henson. Henson's son, Brian (now the head of the Henson Empire), even gets in on the act as the voice of Hoggle. The story opens in the present, this world, this plane. Sarah (Connelly) is a spoiled rotten little drama queen who thinks she is the center of the universe and the sun around which the world revolves. In a brattish fit of colossal immaturity, she stumbles upon the correct words to summon Jareth the Goblin King (Bowie) to take her little brother to the Goblin Realm. Once done; however, she realizes how angry her parents will be and decides that it's more prudent to go \"rescue\" Toby rather than allow his assimilation into the Goblin fold. Jareth gives her 13 hours in which to find her way through an impossible labyrinth, fight her way through the Goblin City, and puzzle out the staircases of the Goblin Castle and save her half-brother. She is punished for arrogance, beguiled in her naivety, confused in her indecision and imprisoned for her quick, thoughtless decisions. \"That's not FAIR!\" is one of her most used and best delivered lines; used again and again, until it FINALLY sinks in that life just isn't fair. It is a warm, funny and enriching tale, once started. It's about growing up, accepting responsibility for your actions and choices and making them more wisely in the beginning, rather than cleaning up your messes as you go along. In the end, Sarah realizes all the infantile tantrums and childish toys are nothing but detritial remains of her otherwise out-lived childhood. She begins to stumble upon the reality that the important things are family, friends, and the responsibility that comes with making mature decisions. She throws away her immaturity and child-like selfishness to save her brother and thereby sets her feet back on the right path to adulthood and maturity. It's a wonderful \"coming of age\" movie, and perfect for its target audience: girls 9-13. But I must say that children and adults alike love this movie, worldwide. It's not ONLY for girls, but for anyone who loves fantasy. This movie is far superior to what most consider to be your standard \"Muppet Movie.\" It's one of my favorites. This movie gets an 8.4/10 from... the Fiend :."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "Henson Associates (HA)",
         "Lucasfilm",
         "Jim Henson Company, The"
      ],
      "summaries": [
         "Young Sarah is left home alone by her parents and she has to babysit her little brother Toby. But the baby keeps crying and Sarah, while telling him a story to make him sleep, inadvertently conjures from a fantasy world the Goblin King who steals the child and brings him to his castle in the middle of a labyrinth. Sarah has to rescue him before midnight, or the baby will became a goblin...",
         "Grown angry about the fact that she must watch over her little brother Toby, Sarah wishes the child to the goblins. They translate this careless statement into action: The Goblin-King Jareth announces that soon Toby will mutate into a goblin. There is only one hope: Sarah has to find the way to Jareth's castle - through a dangerous labyrinth - where she will find strange creatures.",
         "Sarah, a teen, summons the goblins from her favorite book, the Labyrinth, to steal her baby 1/2 bro Toby. When they actually do, she must solve the Goblin King's Labyrinth in 13 hours or else Toby will become a goblin.",
         "A selfish 16-year old girl is given 13 hours to solve a labyrinth and rescue her baby brother when her wish for him to be taken away is granted by the Goblin King."
      ],
      "budget": 25000000
   },
   "movielensId": 1967,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-06-27",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["Jim Henson"],
      "runtime": 101,
      "movieId": 1967,
      "title": "Labyrinth",
      "mpaa": "PG",
      "actors": [
         "David Bowie",
         "Jennifer Connelly",
         "Toby Froud",
         "Christopher Malcolm",
         "Shelley Thompson",
         "Warwick Davis",
         "Natalie Finland",
         "Shari Weiser",
         "Brian Henson",
         "Ron Mueck",
         "Rob Mills",
         "Dave Goelz",
         "David Alan Barclay",
         "David Shaughnessy",
         "Karen Prell",
         "Timothy Bateson"
      ],
      "imdbMovieId": "0091369",
      "originalTitle": "Labyrinth",
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["O2yd4em1I6M"],
      "plotSummary": "Frustrated with babysitting on yet another weekend night, Sarah - a teenager with an active imagination - summons the Goblins from her favourite book, \"Labyrinth\", to take the baby stepbrother away. When little Toby actually disappears, Sarah must follow him into the world of the fairytale to rescue him from the Goblin King!",
      "tmdbMovieId": 13597,
      "avgRating": 3.63125,
      "releaseYear": "1986",
      "numRatings": 10156,
      "posterPath": "/40D6CVNGYbIgg7Sdt1jAYkFA08d.jpg"
   }
}