{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "tardy hall",
            "id": 6291
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "detention",
            "id": 15299
         }
      ],
      "imdb_id": "tt0088847",
      "video": false,
      "title": "The Breakfast Club",
      "recommendations": [
         9377,
         15144,
         235,
         630,
         9603,
         11522,
         9571,
         1542,
         639,
         786,
         2292,
         10625,
         2609,
         4951,
         137,
         8872,
         378,
         2280,
         11003,
         11814
      ],
      "backdrop_path": "/tUSXZ37j0XpNtmOb5uwqogdcq7E.jpg",
      "revenue": 51525171,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Andrew \"Andy\" Clark",
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e55",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Claire Standish",
               "gender": 0,
               "credit_id": "52fe4336c3a36847f8042e51",
               "name": "Molly Ringwald",
               "profile_path": "/y8RQwpSQaRfWK70fR9LUT8Fql64.jpg",
               "id": 21625,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "John Bender",
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e4d",
               "name": "Judd Nelson",
               "profile_path": "/9H1TSnBEDYl59tFC1EQHccrINsp.jpg",
               "id": 21624,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Allison Reynolds",
               "gender": 1,
               "credit_id": "52fe4336c3a36847f8042ea3",
               "name": "Ally Sheedy",
               "profile_path": "/xfNrfzgDwyvmczadJWw4fN70siS.jpg",
               "id": 12851,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Brian Ralph Johnson",
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e59",
               "name": "Anthony Michael Hall",
               "profile_path": "/eQnkUzHVrO69bQ08W82Qa9idJxp.jpg",
               "id": 1904,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Richard Vernon",
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e5d",
               "name": "Paul Gleason",
               "profile_path": "/TKFcITuV9vyTSZe55B8klclPor.jpg",
               "id": 7675,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Carl",
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042ea7",
               "name": "John Kapelos",
               "profile_path": "/5s1r2lu8l1iODlmCf75hBhtxBoU.jpg",
               "id": 55554,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Andy's Father",
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042eb3",
               "name": "Ron Dean",
               "profile_path": "/a910oOgeYR0IxutHf3GeyDNw3qY.jpg",
               "id": 57597,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Allison's Father",
               "gender": 0,
               "credit_id": "52fe4336c3a36847f8042eab",
               "name": "Perry Crawford",
               "profile_path": null,
               "id": 1073863,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Allison's Mom",
               "gender": 0,
               "credit_id": "52fe4336c3a36847f8042ebb",
               "name": "Fran Gargano",
               "profile_path": null,
               "id": 1073865,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Brian's Sister",
               "gender": 0,
               "credit_id": "52fe4336c3a36847f8042eaf",
               "name": "Mary Christian",
               "profile_path": null,
               "id": 1073864,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Brian's Mom",
               "gender": 0,
               "credit_id": "52fe4336c3a36847f8042ebf",
               "name": "Mercedes Hall",
               "profile_path": null,
               "id": 1073866,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Claire's Father",
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042eb7",
               "name": "Tim Gamble",
               "profile_path": null,
               "id": 987357,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e63",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e69",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e6f",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e75",
               "name": "Ned Tanen",
               "profile_path": null,
               "id": 21643,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4336c3a36847f8042e7b",
               "name": "Keith Forsey",
               "profile_path": null,
               "id": 21644,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e81",
               "name": "Thomas Del Ruth",
               "profile_path": null,
               "id": 3031,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4336c3a36847f8042e87",
               "name": "Dede Allen",
               "profile_path": "/20uUxDktTl18s4Y20oPipmWHRJD.jpg",
               "id": 6453,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4336c3a36847f8042e8d",
               "name": "Jackie Burch",
               "profile_path": null,
               "id": 1097,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042e93",
               "name": "John W. Corso",
               "profile_path": null,
               "id": 21645,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4336c3a36847f8042e99",
               "name": "Jennifer Polito",
               "profile_path": null,
               "id": 21646,
               "department": "Costume & Make-Up",
               "job": "Set Dressing Artist"
            },
            {
               "gender": 1,
               "credit_id": "52fe4336c3a36847f8042e9f",
               "name": "Marilyn Vance",
               "profile_path": "/tdNcz7CYAFFKoaYm4EvWec4z3gv.jpg",
               "id": 7719,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe4336c3a36847f8042ec5",
               "name": "Michelle Manning",
               "profile_path": null,
               "id": 56738,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4336c3a36847f8042ecb",
               "name": "Gil Friesen",
               "profile_path": null,
               "id": 950463,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4336c3a36847f8042ed1",
               "name": "Andrew Meyer",
               "profile_path": null,
               "id": 1117353,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 26.604224,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2108,
      "vote_count": 2879,
      "budget": 1000000,
      "overview": "Five high school students, all different stereotypes, meet in detention, where they pour their hearts out to each other, and discover how they have a lot more in common than they thought.",
      "similar": [
         272693,
         57214,
         449176,
         10625,
         9880,
         308369,
         10314,
         37725,
         11355,
         2105,
         8363,
         19840,
         81250,
         26123,
         43923,
         286565,
         133805,
         9611,
         50479,
         13416
      ],
      "original_title": "The Breakfast Club",
      "runtime": 97,
      "poster_path": "/4ZejrrCpfoypR5lHoT3pq6yVldW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "A&M Films",
            "id": 11043,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Productions",
            "id": 8812,
            "origin_country": ""
         }
      ],
      "release_date": "1985-02-15",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "They only met once, but it changed their lives forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Hughes"],
      "runtime": 97,
      "synopsis": "The plot follows five students at fictional Shermer High School in the widely used John Hughes setting of Shermer, Illinois (a fictitious suburb of Chicago based on Hughes' hometown of Northbrook, Illinois), as they report for Saturday detention on March 24, 1984. While not complete strangers, the five are all from different cliques or social groups: John Bender (Judd Nelson) \"The Criminal\"; Claire Standish (Molly Ringwald) \"The Princess\"; Brian Johnson (Anthony Michael Hall) \"The Brain\"; Andy Clark (Emilio Estévez) \"The Athlete\"; and Allison Reynolds (Ally Sheedy) \"The Basket Case\". The school's disciplinary principal, Mr. Vernon, gives them all an assignment; they will write an essay about \"who you think you are\" and the violations they committed to end up in Saturday detention. They pass the hours in a variety of ways: they dance, harass each other, tell stories, fight, smoke marijuana, and talk about a variety of subjects. Gradually they open up to each other and reveal their secrets, for example, Allison is a compulsive liar, and Brian and Claire are ashamed of their virginity and Andy got in trouble because of his overbearing father. They also discover that they all have strained relationships with their parents and are afraid of making the same mistakes as the adults around them. However, despite these evolving friendships, they're afraid that once the detention is over, they will return to their respective cliques and never speak to each other again. In the end, some of their more hidden character traits emerge: Claire emerges as a natural leader. Bender develops a softer attitude and becomes more friendly with everyone. Claire even kisses him and it seems the two will try a romantic relationship. Andrew becomes interested in Allison after she allows Claire to give her a makeover. At Claire's request and the consensus of the group, Brian agrees to write the essay Mr. Vernon assigned earlier, which challenges Mr. Vernon and his preconceived judgments about all of them. While Brian accedes, instead of writing about the actual topic, he writes a very motivating letter that is in essence, the main point of the story. He signs the essay \"The Breakfast Club\", and leaves it on the table for Mr. Vernon to read when they leave. There are two versions of this letter, one read at the beginning and one at the end, and they differ slightly; illustrating the shift in the students' judgments of one another, and their realization that they truly have things in common. The beginning of the letter is as follows: \"Saturday, March 24, 1984 Brian Johnson [although unknown at this point] Shermer High School Shermer, Illinois 60062 Dear Mr. Vernon: We accept the fact that we had to sacrifice a whole Saturday in detention for whatever it was that we did wrong. What we did was wrong. But we think you're crazy to make us write this essay telling you who we think we are. What do you care? You see us as you want to see us... in the simplest terms and the most convenient definitions. You see us as a brain, an athlete, a basket case, a princess, and a criminal. Correct? That's how we saw each other at seven o'clock this morning. We were brainwashed. The letter read before the closing credits reads as follows: \"Dear Mr. Vernon: We accept the fact that we had to sacrifice a whole Saturday in detention for whatever it was we did wrong, but we think you're crazy to make us write an essay telling you who we think we are. You see us as you want to see us... In the simplest terms and the most convenient definitions. But what we found out is that each one of us is a brain... ...and an athlete... ...and a basket case... ...a princess... ...and a criminal. Does that answer your question? Sincerely yours, the Breakfast Club. The letter is the focal point of the film, as it demonstrates and illustrates the changes the students undergo during the course of the day; their attitudes and perspectives have changed and are now completely different. The movie ends as the characters leave detention. The final shot shows Bender walking near the goal post of the football field, freezing as he raises his hand triumphantly and fading to a dark frame as the credits roll.",
      "writers": ["John Hughes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088847/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzYyNTQ1Nzk2M15BMl5BanBnXkFtZTcwODk0NTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Emilio Estevez, Judd Nelson, Molly Ringwald | See full cast and crew »"],
      "reviews": [
         "We all remember being a teenager. A crazy, intense time when your high were higher and your lows were lower, and every experience was that much more significant. John Hughes movie brilliantly captures that environment, that era in our lives, and all the social rifts that we all helped to create for ourselves. I have heard it said that \"The Breakfast Club\" is melodramatic, overacted, and simplistic. If you subscribe to that flippant perspective you might as well join Vernon in his office because you are doing the same thing that he did. Seeing the movie as you want to see it, in the simplest terms and the most convenient definitions. If you really want to understand this film, think back to your own high school days. Think about your last year there. Dig out your old diary or book of angstful poems and reaquaint yourself with who you were then, when you felt things more deeply. \"The Breakfast Club\" does not exist not for highschool kids, as some suggest. Why would they need it? They live there. It exists for all of us who have already been through there, who feel that they are above it now. It exists so that we can remember what it was like and better understand ourselves, and the next generation. Because you can't dismiss something you understand.",
         "This movie is one of the best, if not THE best, 80's film there is. The fact is, every teen character in this movie can be related to someone we knew in high-school. As a child of the 80's, I can honestly say that this is a representative cross-section of every high school in North America. The geek, the jock, the outcast, the rich pretty-girl snob, and the future criminal. They all exist, to some degree or another, in the classrooms of every high school on the continent. What makes this film rise above the rest is the character development. Every character in this film is three-dimensional. They all change, in one way or another, by the end of the film. Whether or not things remain the way they are long after this film ends is unknown, and that adds to the rama. The most important scene in this film is when the characters, as a group, all open up to one-another and describe the hell that their daily school routines are in a personal fashion. Nobody likes the role they must inevitably portray in the high-school scene, but the fact is, it is often inescapable. This film gives the viewer some insight into how the other people around them might have felt during that particular time in their lives. Each of the main characters in this film shines, but Judd Nelson (John Bender) and Emilio Estevez (Andrew Clark) rise above the rest. Simply put, these two actors each put their heart and soul into their respective characters, and it shows. At the end of the film, the viewer is left to make their own conclusions as to how things will carry forth. And I'm sure that most people will do that. This is one movie that left me feeling both happy and sad for each of the characters, and it isn't easy to make me care about a film in that way. Even if you aren't a fan of the 80's genre, this isn't one you would want to miss. My Rating: 10/10",
         "This film is one of the most influential films I have ever watched. It reaches out to you - and your touched by it. No matter what little sub-culture you were shifted into whilst going through the trials and tribulations of Secondary school you could relate to it. It may have been clichéd but what film isn't, we like certain elements we can relate to otherwise what would we take from films. Judd Nelson gives a convincing performance of 'Bender' the criminal. He managed to sway from angry to emotional - making you feel for him when he is describing what things are like at 'his house'. He seemed to have a lot of great lines including the Manilow comment! The emotion in this film is immense considering it is a teenage film - and touches on 5 lost characters who seem to be searching for some type of approval or acceptance. (Just like our-selves) Ringwald shows just how versatile she is, and very different from Pretty in Pink. I heard that Ally Sheedy originally went for Ringwalds part and they swapped? Emilio Estevez carrys his role off very well as a Jock - it gets a little cringe worthy when hes high at the end - and rushing around like a loony. But the end with Ally Sheedy certainly makes up for it. The ending is good, however even ten years later after I first saw this film I always wanted to know what they did the next day! This is such a great film, I can relate to it so much! I love it is truly the best, you can watch over and over and never get tired of it.",
         "Parents have never understood the youth of the world. Elvis used to be evil. Now he's too tame for modern music enthusiasts. Just imagine how tame Eminem will seem years from now. And as a scarier thought, who (or what) could be worse than some of the singers on today's market? John Hughes is locked in a time capsule, still bearing the mind of a teenager, and he is able to tap into these feelings of teenage angst. That is what separates \"The Breakfast Club\" from, say, \"The New Guy,\" or one of those other stupid teen films of recent years. And the jerk, played by Judd Nelson, isn't meant to be cool. He is a jerk, and if older viewers took the time to pay attention to the film, they would perhaps realize that the point of the film, from the very beginning, is to establish that this so-called jerk is only acting like one to get attention. Because he is obviously shunned at home. He's an outcast. And unlike other films that refuse to establish their characters, \"The Breakfast Club\" introduces him as a jerk, and proceeds to explain why he is that way. This is what makes this movie tick. I knew a kid like Bender (Nelson) once when I was in school, and generations of kids continue to go through the exact same things. Once they reach a certain age, though, it seems as though all adults suddenly break away from the teenage emotions. John Hughes never did, I guess. (Although he certainly tapped into adult behavior with his best film, \"Planes, Trains and Automobiles\" [1987], a welcome introduction to Hughes' adult comedy, hinted at in \"Vacation\" [1981], which he wrote.) The film opens with a quote from David Bowie that just about sums the entire film up. We are introduced to five kids spending eight hours of detention at Shermer High School in Illinois. They are: Andrew the Jock (Emilio Estevez), Brian the Nerd (Anthony Michael Hall), Bender the Criminal (Judd Nelson), Claire the Princess (Molly Ringwald), and Allison the Basketcase (Ally Sheedy). They are looked over by the school principal (Paul Gleason), who assigns them the task of writing a report on why they are here in detention and what they did to get there. To say that the outcome is predictable is an understatement. We know who's going to get together with whom from the beginning, but getting there's all the fun. Watching the characters come to appreciate their differences and learn that they're more than just billboard examples of angry teenagers is more than half the fun. Teenagers are not as unaware of who they are as some people always think. John Hughes knew this, and deliberately tapped into this state of mind as no other director has done before -- or since, for that matter. Sure, they've tried. (Hughes' \"Ferris Bueller's Day Off\" was just about the only other film that tried to show teenagers as something more than stupid hormone-crazy rambunctious adolescents, but as young adults who were trying to grow up fast -- the scene where Ferris and Sloane pretend their water is wine is good evidence of this.) Hughes' teenage characters were not the clichés they are now when \"The Breakfast Club\" came out in 1985 -- this film has proved to be the steeple of teen clichés (many of them poked fun at in \"Not Another Teen Movie,\" which features a cameo by Ringwald). Think of \"2001\" or \"Halloween\" -- the drifting spaceships and psycho killers chasing sex-hungry teenagers is now routine, but it wasn't then. The Jock, The Nerd, The Criminal, The Princess, and The Basketcase weren't clichéd back then, either -- although Hughes purposely chose these references to the characters in order to let Brian, The Nerd, say that they were more than just that in the beginning of the film when he's reading his essay in voice-over narrative. I seriously doubt whether this film is any better than the work of Coppola, Cortiz, Kurosawa, Scorsese, Welles, et al. If I were assembling a list of \"the greatest movies ever made,\" I'd never include this. But sometimes the greatest films aren't just the films that are technically perfect, but those that connect to you on one level or another. I know that my all-time favorite comedy (\"Planes, Trains and Automobiles\") may not be considered better than something such as \"Some Like it Hot,\" but that film doesn't affect me the same way. I either don't connect with the story, the characters, the feelings, or I just don't appreciate the film as a whole. I appreciate \"The Breakfast Club\" in many ways, and for that reason it will always be considered one of my favorite films. Even if it is kinda sappy.",
         "I must admit that I was a true loner in high school, and essentially I'm now at 33 I'm still a loner who has become a bit more jaded with the passage of time. With that said, John Hughes \"The Breakfast Club\" seems to me to be a sort of love letter to all of us who just seemed to blend into the background during our high school years. Of course like everyone I also have a favorite character in the film, and my choice is Allison who is wonderfully played by Ally Sheedy. So, my advice to all who have read this far is to try and watch this film with your emotions rather than trying to analyze the film to death.",
         "After reading some of the negative comments made about this movie, i decided to make some of my own. Yes, to younger viewers,this movie will appear to be outdated. The only thing \"outdated\" is the clothing styles and the music. It doesnt matter what year you went to high school or what school you even went to, there will always be a \"criminal\", a \"jock\", a \"princess\", a \"nerd\", and a \"basket case\". This movie is the best teenage movie, no matter when you are a teenager!",
         "Ah the Breakfast Club. Although I am a child of the 80's, I came along at the tail end of Generation X. The cast of The Breakfast Club were actors that I looked up to as a child, and still enjoy as an adult. I remember my own mother was a big fan of this movie, even though she was an adult with children. Of all the \"Brat Pack\" movies, this remains my favorite. Even over two decades later, the movie still holds generations of people captive and sends us all into deep thoughts of our own glory days when we thought that life was BS, and that we had it tough. We were just a few years shy of seeing how tough life would be once we escape the protective circus tent known as high school. Over and over you hear people wishing that a sequel to this film had been made. I am very glad there was not one. Surely we can't imagine this would have been a happily ever after for these characters. They came together one day, but like most high school relationships, all good things must come to an end. The closest thing to a sequel for this movie would be \"St. Elmo's Fire\" and again.....all good things must come to an end. One thing that I loved most about this movie was the tell tale showing of intelligence in the least thought of places; the school janitor. The movie portrayed the janitor as being a hell of a lot smarter than the assistant principal. I have found in my life's experience this is quite believable. It's also sad. I believe that those employed by the education system could learn a very important lesson about young adults and the way their minds work. Youth knows when it's elders have forgotten how to see things. Youth knows how to use that against them. The moral is simple; stay young!",
         "Five teenagers are assigned detention on a Saturday morning and afternoon. They are a jock (Emilio Estevez), a hood (Judd Nelson), a rich girl (Molly Ringwald), a geek (Anthony Michael Hall) and a basket case (Ally Sheedy). During the course of the detention (and with a little help from marijuana) they open up and talk and begin to know each other. A dead on target examination of teen life in 1984/85. This was a very challenging thing to do--release a film about teens just talking and relating to each other. It also was (unjustly) awarded an R rating for the frequent swearing--but that's how high schoolers talk! I was in college when this came out, but I saw it with a friend who was still in high school. According to him the movie got everything right--the clothes, dialogue, styles and music were accurate. He said it was one of the few movies that accurately showed how he felt. I felt the same way. I think any teenager can relate to this movie. The movie is somewhat unpleasant (some of the kids really attack each other verbally) but there's plenty of comedy mixed in too. The cast: Estevez (what ever happened to...) is just great as the jock. He gives a very believable and moving performance especially in a speech about his father. Nelson, however, is horrible as the hood. He looks the part but he's way too eloquent and his acting was pretty bad. Ringwald and Hall are perfect in their roles, but they WERE teenagers when this was filmed. Sheedy does what she can with a criminally underwritten role. John Kapelos (as a janitor) is hardly in it (I'm assuming his part was severely cut) and Paul Gleason (a good actor) is given a very 1-dimensional role--the evil adult. He does what he can with it. The movie isn't perfect--parents are the root of all the kids problems; there are annoying lapses in logic (like how does Ringwald get to see Nelson at the end and Sheedys character wasn't assigned detention, so wouldn't Gleason know that) and there is a whole dance sequence squeezed in. Still--a truly great teenage movie. A definite must-see. A bonus is that the movie opens with one of the best songs of the 1980s (and a big hit)--Simple Minds \"Don't You Forget About Me\". This is rightfully considered a classic. \"Who'd your mom marry--Mr. Rogers?\" \"No--Mr. Johnson\"",
         "One of the best if not the best brat pack flick. John Hughes writes and directs this dramatic comedy about five Chicago high school kids that are from different circles and stations in life being forced to spend a Saturday together in detention. Before the day is over this group finds out that they have more in common than they thought and even some friendships are created. The very impressive cast includes:Emilio Estevez, Ally Sheedy, Judd Nelson, Anthony Michael Hall and Molly Ringwald. Paul Gleason plays the hapless teacher trying to contain the group and then there is John Kapelos as the custodian. This is a don't miss and is fun to watch over and over again. Spit that gum out and remember to ask for a hall pass.",
         "John Hughes is in my opinions the \"king of teens.\" Each of his teen films is great, from \"Sixteen Candles\", \"Pretty in Pink\" (which he co-wrote and produced), and \"Ferris Bueller's Day Off.\" They all have funny and serious moments and are classics. By the same token, \"The Breakfast Club\" is no exception. However, it stands out as doing the best job of the above films at portraying 80s teen life (and perhaps even teen life today) as it really was (is). Hence the familiar plot: Five high school students from different crowds in school (a nerd, a jock, a prom queen, a delinquent, and a loner) are thrown together for a Saturday detention in their school library for various reasons. Detention is supervised by the gruff and demeaning principal Richard Vernon, believably portrayed by Paul Gleason. As the day progresses, each member tells the story of why they are in detention, and by day's end they realize they have more in common than they ever imagined. What makes the film unique is that each character tells his or her own story with credibility and persistence. Jock Andrew Clark (Emilio Estevez) is under pressure from his father to perform up to high standards, which Mr. Clark believes will add to his (dad's) lost youth. Nerd Brian Johnson (Anthony Michael Hall) excels academically, but is failing shop class. Neither he nor his family can accept an F. Delinquent John Bender (Judd Nelson), while tough on the exterior, masks a difficult home life. Prom queen Claire(Molly Ringwald) has pressure to conform from her friends, as well as issues with her parental unit. Loner Allison (Ally Sheedy) has few if any friends, wears all black, and has similar problems at home. Can the emotional bonding they share in detention hold true beyond the library, and can stereotypes be broken? \"The Breakfast Club\" presents no-doubt stereotypical characters, and every member represents countless real-life examples. But what makes it so enjoyable is that applies a variety of themes to its context: prejudice/discrimination, acceptance/tolerance, diversity, class/status differences, family matters, group dynamics, etc. It also encourages us to look at others and ourselves beyond surface-level appearances. Finally, \"The Breakfast Club\" has great 1980s pop culture and societal integrations, from the soundtrack with Simple Minds \"Don't You (Forget about Me), to wealthy, surburban American life (haves and have nots), and superficial values of the \"me\" decade. It reminds us that there truly is diversity in all of us. We are different, but we are all \"the same\" in one way or another."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "A&M Films",
         "Channel Productions",
         "Universal Pictures"
      ],
      "summaries": [
         "They were five students with nothing in common, faced with spending a Saturday detention together in their high school library. At 7 a.m., they had nothing to say, but by 4 p.m., they had bared their souls to each other and become good friends. To the outside world they were simply a Brain, an Athlete, a Basket Case, a Princess, and a Criminal, but to each other, they would always be the Breakfast Club.",
         "When five high school students, Andrew, John, Allison, Brian, and Claire, meet in detention one day. The principal wants them to write an essay, and they think they are in for a boring 8 hours of doing nothing. At first, they argue and hate each other, but after smoking some marijuana, they pour their hearts out to each other, and tell about their fears, secrets, and their deepest emotions, and problems.",
         "Five high school students, all different stereotypes, meet in detention, where they pour their hearts out to each other, and discover how they have a lot more in common than they thought."
      ],
      "budget": 0
   },
   "movielensId": 1968,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-02-15",
      "dvdReleaseDate": "2003-09-02",
      "directors": ["John Hughes"],
      "runtime": 97,
      "movieId": 1968,
      "title": "The Breakfast Club",
      "mpaa": "R",
      "actors": [
         "Emilio Estevez",
         "Anthony Michael Hall",
         "Judd Nelson",
         "Molly Ringwald",
         "Ally Sheedy",
         "Paul Gleason",
         "John Kapelos",
         "Ron Dean",
         "Perry Crawford",
         "Fran Gargano",
         "Mary Christian",
         "Mercedes Hall",
         "Tim Gamble"
      ],
      "imdbMovieId": "0088847",
      "originalTitle": "The Breakfast Club",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "dkX8J-FKndE",
         "3mxaZED3erE",
         "FTAdLAEW6R0",
         "Ucj_dADJaE0"
      ],
      "plotSummary": "Five high school students, all different stereotypes, meet in detention, where they pour their hearts out to each other, and discover how they have a lot more in common than they thought.",
      "tmdbMovieId": 2108,
      "avgRating": 3.82802,
      "releaseYear": "1985",
      "numRatings": 27421,
      "posterPath": "/4ZejrrCpfoypR5lHoT3pq6yVldW.jpg"
   }
}