{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "drowning",
            "id": 793
         },
         {
            "name": "lake",
            "id": 1889
         },
         {
            "name": "cabin",
            "id": 3623
         },
         {
            "name": "cult",
            "id": 6158
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "camp",
            "id": 11663
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "fear",
            "id": 13073
         },
         {
            "name": "summer",
            "id": 13088
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "maniac",
            "id": 14805
         },
         {
            "name": "counselor",
            "id": 15227
         },
         {
            "name": "desire",
            "id": 33513
         },
         {
            "name": "axe in the head",
            "id": 155627
         }
      ],
      "imdb_id": "tt0080761",
      "video": false,
      "title": "Friday the 13th",
      "recommendations": [
         9725,
         9728,
         9730,
         9731,
         10281,
         10225,
         10283,
         11281,
         948,
         30497,
         10285,
         10072,
         377,
         11675,
         11470,
         10014,
         10131,
         9003,
         2082,
         6466
      ],
      "backdrop_path": "/d1DyIWgc80ufW2ENGOMNZRbpq4x.jpg",
      "revenue": 59754601,
      "reviews": [
         {
            "author": "Milo_Jeeder",
            "id": "58aa739e9251416f7d00607d",
            "content": "Clearly, the team behind “Friday the 13th” expected at least to make a reasonable profit out of it, but I seriously doubt that anyone involved in the making of this film even considered the possibility of it becoming the cult classic that it is today. Victor Miller, who wrote the story, openly admitted that he was riding off the success of Halloween (1978). The late actress Betsy Palmer even claimed that, after reading the script, she thought the story was trash (well… she actually used another word), but she took the job because she needed a new car. Little did she know when she took the role that her character would immortalize her as one of the biggest horror icons of all times.\r\n\r\nYes, it is evident that Victor Miller and Don Mancini capitalized on the success of Halloween (1978), but the truth is that “Friday the 13th” manages to stand out on its own, and in the end, other than being two slasher films about a killer who prowls around murdering teenagers; these two films don’t really have that much in common. To this day, John Carpenter’s “Halloween” is considered a more “serious” horror film (for the lack of a better word), while “Friday the 13th” remains a classic, but is still seen as a less underappreciated respectable flick. Why? Probably because, even though I absolutely love it, I will admit that “Friday the 13th” certainly has a campy nature (no pun intended). In my case, I don’t mind the campiness, I actually enjoy it.\r\n\r\nIn “Friday the 13th”, the story begins in 1958, in a summer camp named Camp Crystal Lake. We see two young camp counselors who are about to have sex, when someone appears out of nowhere and murders them both. We don’t get to see who the killer is, since the murders are shown in a point-of-view shot, and the reason behind the murders is not yet explained either.\r\nThe story then jumps to 1980 and it focuses on Alice, a young and sensible girl who, along with other kids of her age, is hired as a counselor by a man who attempts to reopen Camp Crystal Lake. Unfortunately, someone doesn’t seem too thrilled about the reopening of the place, which will lead to a series of gruesome murders. Could it be the same person who killed those two counselors back in 1958? In the end, it is Alice who will have to come face to face with the killer and fight for her own life.\r\n\r\n*Spoilers ahead*\r\n\r\nPlot-wise, “Friday the 13th” may not be too remarkable, but it doesn’t really need to be either. I could be wrong, but I believe this film first introduced the formula that consists on: a summer camp as a scenario, a pinch of mystery, plentiful gore, creative deaths and a gratifying reveal towards the last minutes. Just like this film attempted to ride off the success of a previous slasher, ironically, “Friday the 13th” itself ended up generating a bunch of (arguably) inferior clones as well. Of course, commercial success doesn’t necessarily imply quality, but I do think “Friday the 13th” has a certain something that makes it appealing to a lot of people.\r\n\r\nFor the most part, the characters in this film seem somewhat generic and one dimensional, which is a common attribute in slasher films. There really isn’t much of a character development, and we don’t get to know them very well. Most of the victims are young boys and girls who seem to be in the camp to have a good time themselves, rather than working hard to make the children happy. Surely, these characters don’t really deserve to die for being immature and silly, but at the same time, it is hard to feel too bad for them either. However, the first character that gets killed after the time-jump seems genuinely sweet and caring, so one obviously feels bad for her when she is brutally murdered, just for being naïve enough to trust a stranger. I think this death after the time-jump was a perfect move, because it sets the tone perfectly for what is going to happen later: a bunch of innocent young people will be brutally murdered without having done anything to deserve it. \r\n\r\nThe acting in “Friday the 13th” is mostly plain or, in some cases, over the top, which, along with the silly dialogs and lines, provides the film with an enjoyable campy nature. The late Betsy Palmer, who played the role of Mrs. Pamela Voorhees, was nominated for a Razzie Award, and while I love the character of Mrs. Voorhees and I felt bad to hear about Palmer’s passing, I can understand why she was nominated. It’s true, Betsy’s portrayal of Jason’s mother is over the top and it can appear as unintentionally funny during her delivery of some of her lines, but at the same time, I’m not sure if I can imagine the character being played differently at this point. Then we have Crazy Ralph, literally jumping out of a closet, telling the kids to leave, because they’re doomed and that Camp Crystal Lake has a death curse. This character, aside from being called “Crazy” Ralph, (in case anyone didn’t notice that he was crazy in the first place), is perhaps one of the campiest characters in the slasher subgenre, which earned him an iconic place in the franchise and even a small part in the first sequel.\r\n\r\n“Friday the 13th” offers a nice variety of gory murders, with Tom Savini in charge of the makeup effects, which is an undeniable seal of quality. The legendary “axe in the face” death scene is perhaps one of the most memorable parts of the film for many fans. In this scene, Sean Cunningham and Tom Savini not only offer a morbidly satisfying and shocking on-screen death, we also get a lot of tension and suspense preceding the murder, which creates a feeling of panic and desperation. \r\n\r\nThe final confrontation between Alice, our final girl, and Mrs. Voorhees, Jason’s vengeful mother is really extensive for a good cause, as it helps to build a lot of tension that culminates with a gruesome murder. To some extent, when Mrs. Voorhees suddenly appears out of nowhere and begins to tell the story of what happened to that “poor boy”, it is easy to assume that she is responsible for the carnage, or at least, that she is involved to a certain degree. Up until this point, we had never seen her before throughout the entire film, so why is she popping out now? There are no other supporting characters left to blame for the murders and Mrs. Voorhees shows up the exact moment when things got really ugly? What could she be doing at Camp Crystal Lake in the middle of the night, other than murdering boys and girls? Of course, our final girl, even though she is not unintelligent, seems to be somewhat oblivious of what is really happening and this is what makes up want to scream “Get out of there!”. Mrs. Voorhees is basically explaining the whole story to the audience, but at the same time, she is subtly revealing herself as the killer, before going into a weird trance, in which she starts talking as if she is possessed by Jason, her own son, who drowned at the lake (I always considered this like a switched version of Norman Bates and his mother). \r\n\r\nAs mentioned before, the acting in this final confrontation is not exactly brilliant and the audience ends up getting more than they probably needed to understand the story, since Mrs. Voorhees’ monologue basically goes into detail of what happened, just to make sure we get it right (just like when they make sure that we understand that Ralph is a crazy old man, by calling him “Crazy Ralph”). Regardless of the over the top acting and the spoon-feeding to the audience, the confrontation is full of tension, and it is still considered one of the most memorable “killer reveal” moments in the history of horror for a good reason.",
            "url": "https://www.themoviedb.org/review/58aa739e9251416f7d00607d"
         },
         {
            "author": "inaneswine",
            "id": "5a12e75592514161840281e7",
            "content": "Some films benefit with time, maturing and holding a nostalgic charm. Others rot like a bad apple, like _Friday the 13th_. Perhaps I had to be alive in 1980 to actually appreciate this one, but it is really not as groundbreaking as some people like to think it is, rather another spin on films like _Psycho_ and _Halloween_, minus the budget. And the acting.",
            "url": "https://www.themoviedb.org/review/5a12e75592514161840281e7"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mrs. Voorhees",
               "gender": 1,
               "credit_id": "52fe43c6c3a36847f806e8fb",
               "name": "Betsy Palmer",
               "profile_path": "/lXeseQAJQeKBTlldXGV022wbWbR.jpg",
               "id": 37469,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe43c6c3a36847f806e8ff",
               "name": "Adrienne King",
               "profile_path": "/xCS2BI8ulvypH1cNVtMGwwr50zt.jpg",
               "id": 37470,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e903",
               "name": "Harry Crosby",
               "profile_path": null,
               "id": 37471,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "52fe43c6c3a36847f806e907",
               "name": "Laurie Bartram",
               "profile_path": null,
               "id": 37472,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Marcie",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e90b",
               "name": "Jeannine Taylor",
               "profile_path": null,
               "id": 37473,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e90f",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Ned",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e93b",
               "name": "Mark Nelson",
               "profile_path": null,
               "id": 190040,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Annie",
               "gender": 1,
               "credit_id": "52fe43c6c3a36847f806e937",
               "name": "Robbi Morgan",
               "profile_path": null,
               "id": 1011510,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Steve Christy",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e93f",
               "name": "Peter Brouwer",
               "profile_path": "/z7leSSKSeZ4D7fhwZQsoFnZOnqP.jpg",
               "id": 1081852,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "The Truck Driver",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e943",
               "name": "Rex Everhart",
               "profile_path": "/pW7GyLaz8QrGpVjnC5vvJVjxTqQ.jpg",
               "id": 170970,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Crazy Ralph",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e94f",
               "name": "Walt Gorney",
               "profile_path": "/uUyk6drqyF7y76eSzX8QpfuTKUj.jpg",
               "id": 1014310,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Barry",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e953",
               "name": "Willie Adams",
               "profile_path": null,
               "id": 1205570,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Claudette",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e957",
               "name": "Debra S. Hayes",
               "profile_path": null,
               "id": 1205571,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Jason",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e96b",
               "name": "Ari Lehman",
               "profile_path": null,
               "id": 106207,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Sgt. Tierney",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e947",
               "name": "Ronn Carroll",
               "profile_path": null,
               "id": 174248,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Officer Dorf",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e94b",
               "name": "Ron Millkie",
               "profile_path": null,
               "id": 1019045,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Trudy",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e95b",
               "name": "Dorothy Kobs",
               "profile_path": null,
               "id": 1205572,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Sandy",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e95f",
               "name": "Sally Anne Golden",
               "profile_path": null,
               "id": 1205573,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Operator",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e963",
               "name": "Mary Rocco",
               "profile_path": null,
               "id": 1205574,
               "order": 18
            },
            {
               "cast_id": 26,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e967",
               "name": "Ken L. Parker",
               "profile_path": null,
               "id": 1205575,
               "order": 19
            },
            {
               "cast_id": 28,
               "character": "Boy in 1958 Camping Circle (uncredited)",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e96f",
               "name": "Noel Cunningham",
               "profile_path": null,
               "id": 69585,
               "order": 20
            },
            {
               "cast_id": 29,
               "character": "Busboy (uncredited)",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e973",
               "name": "Irwin Keyes",
               "profile_path": "/9xejxwb12zvNfvDNZkmlIdtQ9A0.jpg",
               "id": 13592,
               "order": 21
            },
            {
               "cast_id": 30,
               "character": "Man The Knife Killer (uncredited)",
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e977",
               "name": "Tom Savini",
               "profile_path": "/yOZPKC3TXlxkvx4HoDrhq1PgXrU.jpg",
               "id": 11161,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e8f7",
               "name": "Sean S. Cunningham",
               "profile_path": "/n2NNVtKE42SNGm9q75IknMZhMtr.jpg",
               "id": 35475,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e915",
               "name": "Victor Miller",
               "profile_path": null,
               "id": 38685,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e91b",
               "name": "Sean S. Cunningham",
               "profile_path": "/n2NNVtKE42SNGm9q75IknMZhMtr.jpg",
               "id": 35475,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e921",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e927",
               "name": "Barry Abrams",
               "profile_path": null,
               "id": 38686,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c6c3a36847f806e92d",
               "name": "Virginia Field",
               "profile_path": null,
               "id": 38687,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e933",
               "name": "Caron Coplan",
               "profile_path": null,
               "id": 38688,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e97d",
               "name": "Bill Freda",
               "profile_path": null,
               "id": 1011611,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c6c3a36847f806e995",
               "name": "Tom Savini",
               "profile_path": "/yOZPKC3TXlxkvx4HoDrhq1PgXrU.jpg",
               "id": 11161,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e99b",
               "name": "Katharine Vickers",
               "profile_path": null,
               "id": 1206164,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c6c3a36847f806e9a1",
               "name": "Katharine Vickers",
               "profile_path": null,
               "id": 1206164,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c6c3a36847f806e9a7",
               "name": "Cecilia Verardi",
               "profile_path": null,
               "id": 1011593,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "56a4b33b925141551c001bdc",
               "name": "Steve Miner",
               "profile_path": "/yk90jxBifKosxEyP8CITJk1BTtt.jpg",
               "id": 58712,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "536d9ed7c3a368121800c204",
               "name": "Alvin Geiler",
               "profile_path": null,
               "id": 1318075,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "536d9e920e0a2647d100e8df",
               "name": "Tom Savini",
               "profile_path": "/yOZPKC3TXlxkvx4HoDrhq1PgXrU.jpg",
               "id": 11161,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "536d9ea70e0a2647cb00edfb",
               "name": "Taso N. Stavrakis",
               "profile_path": "/eCNJTH4h2a55KKuX2EllpFVy21w.jpg",
               "id": 107373,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 1,
               "credit_id": "536d9ee8c3a368121800c209",
               "name": "Julie Hughes",
               "profile_path": null,
               "id": 19252,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "536d9ef7c3a368122600c073",
               "name": "Barry Moss",
               "profile_path": null,
               "id": 19253,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "536d9f09c3a368122000c460",
               "name": "Sean S. Cunningham",
               "profile_path": "/n2NNVtKE42SNGm9q75IknMZhMtr.jpg",
               "id": 35475,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "536d9f1bc3a368122000c467",
               "name": "Victor Miller",
               "profile_path": null,
               "id": 38685,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "56a4b369c3a368388e006906",
               "name": "Richard Feury",
               "profile_path": null,
               "id": 1567660,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "56a4b37992514144ba005e98",
               "name": "Martin Kitrosser",
               "profile_path": null,
               "id": 58809,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 11.561654,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 4488,
      "vote_count": 812,
      "budget": 550000,
      "overview": "Camp counselors are stalked and murdered by an unknown assailant while trying to reopen a summer camp that was the site of a child's drowning.",
      "similar": [
         24124,
         3597,
         133805,
         13510,
         9728,
         238636,
         3600,
         16288,
         13570,
         17609,
         357096,
         23483,
         281957,
         10781,
         1433,
         10585,
         10285,
         377,
         588,
         948
      ],
      "original_title": "Friday the 13th",
      "runtime": 95,
      "poster_path": "/mGJlh8oMyTDhfudvs20kFpYz0Yc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Georgetown Productions Inc.",
            "id": 16779,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sean S. Cunningham Films",
            "id": 17611,
            "origin_country": ""
         }
      ],
      "release_date": "1980-05-09",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/c7pMKwv5NzIN6N3KM4L8fYMTtPw.jpg",
         "name": "Friday the 13th Collection",
         "id": 9735,
         "poster_path": "/uobgqpLQff9WvxGKE2OSvXv1RHm.jpg"
      },
      "tagline": "They were warned...They are doomed...And on Friday the 13th, nothing will save them.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sean S. Cunningham"],
      "runtime": 95,
      "synopsis": "In a brief prologue set in 1958, two summer camp counselors at Camp Crystal Lake, named Barry (Willie Adams) and Claudette (Debra S. Hayes), sneak away from a camp fire sing-along to have sex. Before they can completely undress, an unseen assailant sneaks into the room and murders them both. The film moves forward to (the present) Friday June 13th; a young woman named Annie (Robbi Morgan) enters a small diner and asks for directions to Camp Crystal Lake, much to the shock of the restaurant's patrons and staff. A strange old man named Ralph (Walt Gorney) reacts to the news of the camp's reopening by warning Annie that they are \"all doomed\". Enos (Rex Everhart), a friendly truck driver from the diner, agrees to give Annie a lift halfway to the camp. During the drive, he warns her about the camp, informing her that a young boy drowned in Crystal Lake in 1957, one year before the double murders occurred. After Enos lets her out, Annie walks on. A little later, Annie hitches a ride and gets picked up by an unseen driver in a Jeep. As the driver speeds past the entrance to the camp, Annie becomes concerned and leaps from the moving vehicle when the driver fails to stop, fleeing into the woods. The unseen driver chases her into the woods and slits her throat with a bowie knife. At the camp, the other counselors, Ned (Mark Nelson), Jack (Kevin Bacon), Bill (Harry Crosby), Marcie (Jeannine Taylor), Alice (Adrienne King), and Brenda (Laurie Bartram) are refurbishing the cabins and facilities along with the camp's demanding owner, Steve Christy (Peter Brouwer). They have a few strange incidents, including a prank where one of them pretends to drown, and an unwelcome visit from the local police. They find a large snake in one of the cabins, chopping it in half with a machete. They also receive a visit from Ralph, who again warns them that they are \"doomed\". As a violent storm closes in on the horizon, Steve leaves the campgrounds to get more supplies. Meanwhile, the unidentified killer (still unseen except for a pair of black slacks, a brown plad shirt and a class ring on his/her left ring finger) begins to isolate and murder the counselors one by one. Ned spots the killer (now wearing a hooded black rainslicker) walking into a cabin. Nick follows the person into the cabin. As the violent rainstorm hits the camp, Marcie and Jack later enter the cabin and have sex in one of the bunks, unaware that Ned's dead body is in the upper berth. Afterwards, Marcie leaves to visit the ladies bathroom, and Jack is attacked by the killer, who is lying in wait underneath the cot. The murderer drives an arrow up through the bed and it pierces Jack's throat, killing him. While using the bathroom, Marcie hears a noise by the showers. Thinking its Jack playing a joke on her, she goes and pulls back a shower curtain. Finding nothing, she turns around and finds the unseen killer wielding an felling axe and gets it slammed in her face. Bill, Alice, and Brenda play \"strip Monopoly\" in Alice's cabin, until the rain makes Brenda remember she left her cabin windows open. As Brenda settles down to bed, she hears a faint, child-like voice calling \"Help me!\" from the woods. Brenda walks outside with a flashlight in the pouring rain trying to locate where the child's voice is coming from. She ventures to the archery range where the hooded rainslicker killer turns on the blinding lights at the range, distracting Brenda who is then killed off-screen. Hearing her scream, Bill and Alice go to investigate but only find the bloody axe (the same axe used to kill Marcie) in Brenda's bed. After looking around the camp, they find nobody and begin to suspect that something is up. Attempting to call the police, they discover the phone lines have been cut and that the cars won't start when they try to leave. Meanwhile, Steve is in town having dinner at a local diner when he goes back to his jeep for the drive back to Camp Crystal Lake. But during the drive, his jeep, towing a trailer, gets stuck in the mud off a secondary road. Yet a passing policeman gives him a ride part of the way back to the camp. Steve is let out as the officer gets a call about a car accident in town. With the rain letting up, Steve begins to walk back to the camp alone. When Steve arrives at the entrance to the camp, he is also murdered, apparently familiar with his attacker. When the lights go out all over the camp, Bill goes to check on the power generator, but doesn't know how to operate it or figure out what is wrong. When Bill doesn't return, Alice heads out to the generator cabin looking for him, and she finds his body pinned to a door by several arrows. Now alone, Alice flees back to the main cabin and hides. After a few moments of silence, Brenda's corpse is hurled through a window. Alice hears a vehicle outside the cabin and, thinking it to be Steve, runs out to warn him. Instead she finds a middle-aged woman who introduces herself as Mrs. Voorhees (Betsy Palmer), an \"old friend of the Christys\". Alice hysterically tries to tell her about the murders. Mrs. Voorhees expresses horror at the sight of Brenda's body, but she soon reveals herself to be the mother of the boy who drowned in the lake in 1957. Talking mostly to herself, she blames her son Jason's drowning on the fact that two counselors were having sex and were unaware of Jason's struggling in the lake. She tells Alice that today happens to be Jason's birthday, which Alice beings to worry on where Steve is. Mrs. Voorhees suddenly turns violent and pulls out her bowie knife (thus revealing the bowie knife as well as her class ring on her left ring finger confirming that Mrs. Voorhees is the killer), rushing at Alice, but Alice uses a fireplace poker and temporally knocks Mrs. Voorhees unconscious. A lengthy chase ensues, during which Alice flees her attacker and finds Steve's and Annie's bodies in the process. Mrs. Voorhees turns back on the generator to the camp and then chases Alice all over the camp in a climatic chase, in which speaks to herself in Jason's voice. She corners Alice in a storage shed, where Alice has found a rifle. Before Alice can load it, Mrs. Voorhees attacks her and slaps her around. Alice escapes and runs back to the main cabin, hiding behind a locked door in the pantry. Mrs. Voorhees, now brandishing a machete breaks the door open and rushes in at Alice. Alice hits her on the side of the head with a frying pan, rendering her unconscious and believing to be dead. Heading out to the side of the lake, Alice sits down next to the water, but Mrs. Voorhees comes rushing out at her again with the machete. Narrowly avoiding her machete, The two of them then wrestle next to the lake. Besting her attacker, Alice grabs her machete and decapitates Mrs. Voorhees, now finally killing her. Now in shock, Alice gets in a canoe and rows out to the middle of the lake, where she falls asleep. Morning comes, and Alice is still asleep in the canoe. Police arrive and call out to her, and she awakens. As she sits up and contemplates her own rescue, the decomposing body of Jason (Ari Lehman), attacks Alice and pulls her out of the canoe. Just as she is dragged underwater, she wakes in a hospital, where a police officer tells her that they pulled her out of the lake, and that everyone at the camp are dead. When she asks about Jason, the officer informs her they never found any boy. Alice replies, \"Then he's still there.\" and shows the lake at peace.",
      "writers": [
         "Victor Miller",
         "Sean S. Cunningham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080761/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTYzNDkwNTA1NF5BMl5BanBnXkFtZTcwMjIyNDAyMQ@@._V1._CR11,0,320,432_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Betsy Palmer, Adrienne King, Jeannine Taylor | See full cast and crew »"],
      "reviews": [
         "Without a doubt, the work of Cunningham and Carpenter during 1978 & 1980 rocked the world of the horror genre. Friday the 13th is one of the films that to this day still has repercussions. It demonstrated the importance of setting the tone in horror movies, making the audience themselves feel as if they too were being stalked. Cunningham also was one of the few directors to introduce the idea of a possible female serial killer. Without this film, Scream's Randy would have never uttered those famous words, 'There are certain rules to surviving a horror movie..' This film combined with Carpenter's Halloween, firmly etched the rules in stone. The creepy music, the infamous \"ch-ch-ch-ha-ha-ha\", the crude photography and the graphic depiction of the murders of the counsellors all blend together to give a classic piece of film history. It scared the hell out of multitudes of teenagers who, in many instances could see themselves in the victims of the stalker. These weren't bad people getting killed, these were just your typical average American kids, having a good time, getting picked off. That is what makes this film so defining, that is why, for all its crude and harsh imagery, this is a classic. This is why alot of recent attempts at horror don't measure up. It's not the effects or the blood necessarily, it's the atmosphere and the familiarity that bring it home.It is more frightening to think, \"That could be me\"",
         "Friday the 13th. The movie which turned around the horror genre and gave us one of the most unforgettable villains and endings, is, and always will be a horror classic. Friday the 13th doesn't set out to be glossy and glamorous. Friday the 13th sets out to do what it wants to do; and that is, make you sit on the edge of your seat, feel uncomfortable and unnerved, to make you frightened when you go to bed after watching it. Friday the 13th delivers all of the fantastic horror goods. The plot revolves around American teenagers, who are the new counsellors at the apparently jinxed Camp Crystal Lake. These naive, horny youngsters have a one-track mind and break all of the innocent borders which has more depth than you would think. Basically, the message is \"Don't have pre-marital sex, or you'll die\" just like many of Friday the 13th's predecessors and clones send out as well. Friday the 13th has a variety of characters, all who you could possibly relate to. These characters are then slowly followed and hacked off one by one, in dark, gory, claustrophobic manners, which may leave you frightened in the same way Psycho made showers scary. As the camp counsellors are knocked off one by one, the tension rises higher and higher. Along the journey of carnage, the hugely effective soundtrack really creeps under your skin, highlighting how jumpy and scary the events happening on screen really are. For example when a chase scene occurs, the music may speed up, the tempo rising and jittering, almost moving like the characters on screen are. The acting in Friday the 13th is not bad at all; some of the actors/actresses may be a little amateur, but there is nothing terrible in this picture. The settings are also very effective. The stalkings and slaying in broad daylight and open spaces are a twist in a new direction, showing that not everything has to happen in the dark, in a small isolated house on the top of a hill, so the variation of location makes forests, cabins and even lakes more unappealing to the viewers afterwards, and may leave them creeped out by the aforementioned places. The camera-work is also very effective. The way the camera 'stalks' the victim behind trees and bushes, and the way the camera chases after it's victims as the point of view of the villain is unique and exciting, and adds a more tense and faster chill to the movie. Friday the 13th may play as a clichéd slasher, a story of sex equalling carnage, but it plays so effectively well it is a too important horror movie to simply be dismissed. It collects everything appealing about the 80's horror genre and wraps it up neatly into this fantastic horror package. A classic in it's genre.",
         "I consider Friday THE 13TH a classic, despite everything seemingly going against it. Yes, the original Friday THE 13TH part 1 and part 2 owe a lot to BAY OF BLOOD (or TWITCH OF DEATH NERVE). There's no question about it. The similarities between the two films are obvious. The film is responsible for spawning an endless number of truly awful sequels. The acting is nothing spectacular. The script is barely there. And the film sorta drags a bit in the middle. And the ending of Friday THE 13TH is an indirect rip-off of the ending in CARRIE. But the backwoods atmosphere/mystique behind Friday THE 13TH is totally original and effective (much more than any of the sequels), and the ending of FT13 is, imo, WAY better than the ending of CARRIE. The ending of FT13 makes the movie. The entire FT13 series exists merely on the strength of that ending. It created a myth, in the name of Jason. The story (or script) is wonderfully absurd (when you think about it) which gives the murders an even more psychotic edge to them, and in my mind, are more effective than the ones in BAY OF BLOOD or in any other Friday THE 13TH sequels because of the kooky reasoning behind them. Watching Jason kill his victims in the sequels quickly got boring. And the fact that Tom Savini created the excellent gory FX is a definite plus. The acting is average (some of it even poor) but let's face it, the characters, aside from their individual death scenes, don't have a lot of dramatic things to do, except for Betsy Palmer and Adrienne King, who is good but is not the best \"last surviving female\" actress ever to appear in a slasher. On the other hand, Betsy Palmer is amazing as Mrs. Voorhees. She's a combination of total sweetness, insanity and camp all rolled into one. Once Betsy appears on screen the film is thrilling and she adds a lot of life (no pun intended) to the whole proceeding, which was lacking from a good part of the film. And let's not forget the good score. Very effective even if it sometimes sounds derivative. And the original poster is great! The funny thing about Friday THE 13TH is that when I first saw it 20 years ago I thought it was good but not as good as HALLOWEEN. Fast forward 20 years, and today I sorta prefer Friday THE 13TH slightly more than HALLOWEEN now, which has lost a lot of its luster, due mainly to HALLOWEEN's awful sequels and their stupid story-lines. Artistically, HALLOWEEN is still the better film of the two. There's no comparison there. But it has lost its edge, while FT13's trashiness has oddly kept it fresh. While HALLOWEEN has irremediably lost a lot of its mystique with each subsequent sequels, Friday THE 13TH, on the other hand, actually gained more credibility with every release of its seemingly endless number of ultra-stupid sequels. After seeing some of those sequels, the original FT13 looks positively brilliant compared to those horrendous sequels. It's a classic in its own special way.",
         "Friday the 13th (1980) kicked started the early 80's slasher film phenomenon that was ignited by Halloween (1978) but fueled intensely by this reworking of the Mario Bava classic \"Twitch of the Death Nerve\". Once Friday the 13th was released, there was no turning back. The slasher film was part of the American horror film genre and it would remain that way for years to come. A film that launched countless knock-offs, wannabes, sequels and a t.v. series?! Camp Crystal Lake and the Friday the 13th film franchise are a part of Americana. The film is merely a stage for the splatter effects of F/X maestro Tom Savini. They were later toned down for it's American release and were softened even further during it's video release. The movie itself isn't that great. Technically it's boring. To get the most out of the film you have to watch it uncut. Friday the 13th was designed around Savini's gory set pieces. Watching them with out it is like drinking a mayonnaise soda. I encourage you to seek out the uncut version of this film. Recommended. A (uncut) D (American version)",
         "Friday the 13th must be one of the biggest mysteries in cinema. Although it's a long way from being a good movie, its success and influence is unnameable ( and even unbelievable ). Don't get me wrong...I'm not at all saying that Friday the 13th is a terrible film or not even worth a watch but - let's face it - the plot idea is pretty dumb, the acting and directing are far below average and they haven't fully used the options of setting and location they had. The make-up effects ( by the master Tom Savini himself ) are excellent, but that alone isn't really enough to create a legendary horror movie in my opinion. Some of the later sequels ( Episode 6 : Jason Lives is the perfect example ) and even a few of the numberless rip-offs are superior to the production. I suppose the story is pretty much known by everyone know and I even think the identity of the \"mysterious killer\" of this episode isn't that much of a mystery anymore. Anyway, in case you don't know it, I won't spoil the fun so see for yourself. Although my thoughts on it aren't that high, I do think it's must-see stuff for horror fans. Without any shame, I even admit that Friday the 13th and ALL its sequels are a guilty pleasure of mine. I'll never reckon them as good - or even decent - efforts in the genre, but I'm always up for a little bit of brainless gore slashing. And that's what these series are made for...pure entertainment !! So, in a way, they succeeded after all. They never try to give a thoughtful message to the viewer or something. There are just dumb-looking teenagers being slaughtered...the more the merrier. Favorite \"rewind\"-scene : A young and horny Kevin Bacon being brutally killed in one of his first memorable roles.",
         "Friday THE 13TH (1980) directed by: Sean S. Cunningham starring: Betsy Palmer, Adrienne King, Jeannine Taylor, and Kevin Bacon plot: Seven camp councilors head to Camp Crystal Lake to fix it up for the summer. Despite warnings of a dark past and a 'death curse', the teens decide to have a good time anyway, and at night indulge in sex, drugs, and strip poker. Unfortunately for them, a psycho killer is prowling the camp grounds, picking them off one by one. When only one is left, she must discover the identity of the killer and fight for her life. my thoughts: Ever since I can remember, I've loved this film. When I was a child, it scared the crap out of me. That chilling noise playing in the stalk sequences (which has now become the most famous sound in horror films) haunted my nightmares, and some of the gore scenes were really graphic. Viewing it now, it is no longer that scary but it is still a lot of fun. I liked how these earlier Friday films ignored the stereotypical teenage characters. There's no slut, no jock, no token anything. Every character felt really natural and for some of them, I cared when they died. The gore scenes are great, thanks to Tom Savini. We get stabbings, decapitations, and plenty more. Gore hounds will love this. Well since every gore hound has seen this, gore hounds mostly already love this. And then there's the two key things in making a good horror film. The directing and the music. Sean S. Cunningham is a really good director and establishes the camp setting perfectly. He adds beautiful shots of the wind blowing against the trees, the lake at sunrise, that you wouldn't find in later entries. The music is also great. Harry Manfredini is one of my favorite composers, because he makes the chase scenes so much more exciting. The music in the final scene also works like a charm. I forgot to mention that this film has one of the most popular and remembered horror endings of all time. And while it may have stolen from CARRIE, it works just as well here and is the cherry on top of a classic slasher film.",
         "The original Friday The 13th was the one that started it all. The world's first exposure to the infamous Camp Crystal Lake aka Camp Blood. It goes like this. Camp Crystal Lake, after being closed for a number of years is reopening. The Camp has been closed for so long due to a number of catastrophes such as the young boy Jason Voorhees drowning in the lake, cabins catching on fire, and (I almost forgot) tons of camp counselors being brutally slashed and murdered by a killer running loose in the camp. So when the camp is being reopened, its deja vu, the new camp conselors are in for it. The killer is back and is ready for more. This is the movie that started in all, the classic slasher series that has a total of 11 films to date. The movie is good, but don't expect a truly scary horror film. Its full of some tense moments, nice jumps, and gore, lots of gore. What it lacks is some decent acting (not very impressive). Still, any horror collection isn't complete if you don't have at least one Friday the 13th film, so this one is not to be missed.",
         "In 1980, two years after \"Halloween\" scared the hell out of everybody, \"Friday the 13th\" was released to theaters. This was a clever knockoff of the John Carpenter horror classic, only this one was more violent and gruesome. That aspect turned critics off big time. But moviegoers couldn't resist. They flocked to see this movie and made it a big hit. I never saw this film on the big screen because I was only 9 years old when it came out. After I saw it on cable a few years later, it scared the hell out of me! It doesn't scare me that much today, but it's a far more effective horror/thriller than the last five movies in the series (parts 5 through 9). They should have stopped making these \"Friday the 13th\" movies after the fourth film, which was subtitled \"The Final Chapter\". And you know what's even scarier, they're making part 10. \"Friday the 13th\" was the beginning of the sick slasher genre that played out during the early 1980s. The first films in both the \"Halloween\" and \"Friday the 13th\" series' were easily the best. \"Halloween\" was a great horror film. \"Friday the 13th\" isn't up there with \"Halloween\", but it's a well-crafted gorefest. *** (out of four)",
         "More than 25 years since its release, more than 10 sequels and an infinite number of imitations, most people seem to remember \"Friday the 13th\" as just another slasher with good-looking teens being killed by a seemingly unstoppable psycho while roaming in an isolated location. However, what most people seem to forget, is that \"Friday the 13th\" looks so typical nowadays precisely because it was the first film of its class, the origin of all those clichés and the film that redefined the mainstream horror genre during the 80s and the 90s. At its time, it was a film as daring enough to be called controversial yet at the same time accessible enough to be appreciated by the mainstream audiences; for those reasons and more, this films can be proud of being the first one, the definitive one, the film that gave birth to the slasher sub genre. Our story begins 22 years after a series of unsolved murders happened at Camp Crystal Lake and forced the closure of the beloved Summer Camp and started the legend of the death curse of Camp Crystal Lake, now known as \"Camp Blood\". Now, the new owner, Steve Christy (Peter Brouwer), decides to reopen the infamous \"Camp Blood\" with the help of six new counselors. Ignoring the warnings of the locals, Steve and his young assistants begin the restoration of the long abandoned Camp, but on the night of Friday the 13th, the group of teens will discover that there may be some true behind the local legends, as the death curse of \"Camp Blood\" returns and a mysterious killer starts to claim fresh, young victims. Writer Victor Miller claims to have taken a crash course in horror writing when he wrote \"Friday the 13th\", as both he and director Sean Cunningham were in desperate need of a success and saw that the horror genre had potential, but knew very little about it. So, by taking John Carpenter's \"Halloween\" as a model, Miller crafted his story about the nightmarish night where a group of teens end up isolated and at the mercy of an unknown serial killer, with the sole purpose of making a successful horror film. And he succeeded, as he took the many different elements that would create the \"slasher rules\" and turned the simple and derivative plot into a roller-coaster of horror, with the perfect mix of fun, horror and mystery that just keeps getting better and better until it reaches the climatic finale. Just like Miller took ideas from other horror stories, Cunningham too employs elements from \"Psycho\", \"Texas Chainsaw Massacre\" and specially \"Reazione a Catena\", mixing them and taking them one step further, in a simple but very effective approach that slowly develops Miller's plot while at the same time offers a quite graphic vision of violence (thanks to Tom Savini's excellent effects) that completes what we know as the \"slasher set of rules\". Cunningham may not be an original filmmaker, but his \"Friday the 13th\" remains as one of the most effective suspense tales that despite the bad reputation earned by its sequels, still packs up some good chills thanks to its remarkably well done set pieces and the good use of visuals and music to create tension. The acting of the film is one the level of the horror films of its time; sure, those may not be the best performances in horror but are miles ahead most of what was delivered by the film's sequels. While the cast is nothing really special, two exceptions are easily noticeable: the young Adrienne King, who becomes our main character, delivers a very good performance that makes her decision of stop acting even more surprising. And of course, Betsy Palmer, who gives the performance of her lifetime as Mrs. Vorhees, a former cook at Camp Crystal Lake that knows more about the Camp's curse than what she may tell. Palmer truly created an iconic character that sadly has been overshadowed by the image of the killer with the Hockey Mask. While it's true that Cunningham and Miller made a film heavily based on previous horror classics, \"Friday the 13th\" doesn't feel as derivative as it should, as the many \"borrowed\" elements here work together with frightening perfection. And despite having average acting, and a fairly low-budget, what truly has become the movie's fatal flaw is the poor reputation that its sequels, its parodies and its imitators have given to \"Friday the 13th\"'s name, making the film the source of laughs instead of scares, and making the series to be synonymous with stupid horror tales. The many sequels have truly harmed this film's reputation among the classics, but the truth is that while this movie is far from being a perfect movie, it's creepy and entertaining enough to deliver fun even more than 25 years after its initial release. To enjoy \"Friday the 13th\", one must try to forget what it's known about the series, and simply enjoy the film as if it was the first time one heard about the infamous crimes of \"Camp Blood\". 8/10",
         "A group of camp counselors, a young Kevin Bacon among them, are busy trying to re-open Camp Crystal Lake years after multiple murders shut it down, despite the ravings of Crazy Ralph. They are dispatched one by one by an unseen killer. This IS a classic and always will be. Don't get me wrong as it's not perfect. But it's far from \"merely a Halloween\" clone which some people say. The original Halloween is a perfect classic, but let this film stand on it's own legs as it has every right to. Although I'm saddened about how shoddily Paramount seemed to put out their recent box set. Hell when New Line acquired the rights to the series, yes their Jason films suck, but at least they do right by the fans DVD-wise.Paramount could have done a great service to us by looking back at New Lin's Nightmare on Elm Street box set. It's a shame they didn't. My Grade: A- Eye Candy: Jeannine Taylor shows ta-tas and ass cleavage"
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Warner Bros.",
         "Georgetown Productions Inc."
      ],
      "summaries": [
         "One summer at Camp Crystal Lake, a group of young counselors begin to get ready to lead campers. Unfortunately for the former, someone isn't happy about what's going on in the camp and enjoys playing kill the counselor. As bodies fall to the ground in the camp, no one is safe.",
         "In 1957, a young boy named drowns in a lake near camp crystal lake. In 1958, two counselors are murdered by someone. In 1979, a group of counselors reopen camp crystal lake. During that time, the counselors are getting killed one-by-one by a mysterious person. Could it be Jason out for revenge.",
         "In 1957, at Camp Crystal Lake, a young boy named Jason Voorhees drowned. In 1958, two camp counselors were murdered. In 1962, fires and bad water thwarted the camp's reopening. Now, in 1979, Steve Christy finally reopens Camp Crystal Lake with the help of a few new counselors. Ignoring the warnings from a crazy old man, the murders start once again while a mysterious stalker prowls the area. Is it revenge that the killer is looking for? Who will survive the nightmare and live to tell the story?",
         "Teenagers go to the one and only Camp Crystal Lake for a campout in Cabin 13 but what they don't know is that a little boy drowned there because the councilors weren't paying attention. His name was Jason Voorhees and now he comes back for revenge on his birthday \"Friday the 13th\" to kill the councilors! Beware - the teenagers don't know that a machete slaughtering maniac is out to get them!",
         "A group of camp counselors is stalked and murdered by an unknown assailant while trying to reopen a summer camp which, years before, was the site of a child's drowning."
      ],
      "budget": 550000
   },
   "movielensId": 1974,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-05-09",
      "dvdReleaseDate": "2004-10-05",
      "directors": ["Sean S. Cunningham"],
      "runtime": 95,
      "movieId": 1974,
      "title": "Friday the 13th",
      "mpaa": "R",
      "actors": [
         "Betsy Palmer",
         "Adrienne King",
         "Harry Crosby",
         "Laurie Bartram",
         "Jeannine Taylor",
         "Kevin Bacon",
         "Mark Nelson",
         "Robbi Morgan",
         "Peter Brouwer",
         "Rex Everhart",
         "Walt Gorney",
         "Willie Adams",
         "Debra S. Hayes",
         "Ari Lehman",
         "Ronn Carroll",
         "Ron Millkie",
         "Dorothy Kobs",
         "Sally Anne Golden",
         "Mary Rocco",
         "Ken L. Parker",
         "Noel Cunningham",
         "Irwin Keyes",
         "Tom Savini"
      ],
      "imdbMovieId": "0080761",
      "originalTitle": "Friday the 13th",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["2S8YFTcEDME"],
      "plotSummary": "Camp counselors are stalked and murdered by an unknown assailant while trying to reopen a summer camp that was the site of a child's drowning.",
      "tmdbMovieId": 4488,
      "avgRating": 2.9017,
      "releaseYear": "1980",
      "numRatings": 4776,
      "posterPath": "/mGJlh8oMyTDhfudvs20kFpYz0Yc.jpg"
   }
}