{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "camping",
            "id": 1890
         },
         {
            "name": "summer camp",
            "id": 5767
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "brisbane",
            "id": 191608
         },
         {
            "name": "b horror",
            "id": 193575
         }
      ],
      "imdb_id": "tt0082418",
      "video": false,
      "title": "Friday the 13th Part 2",
      "recommendations": [
         9728,
         9730,
         9731,
         10281,
         10225,
         10283,
         4488,
         10285,
         11281,
         11470,
         11357,
         10131,
         11361,
         11675,
         10072,
         11284,
         10160,
         11442,
         10014,
         10676
      ],
      "backdrop_path": "/mshdRsIOPgzIMdcHUD4I5TUf7kT.jpg",
      "revenue": 21722776,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ginny Field",
               "gender": 1,
               "credit_id": "52fe4522c3a36847f80be573",
               "name": "Amy Steel",
               "profile_path": "/mO8bYH4O6LnYW9wOTWm9CKzGToU.jpg",
               "id": 58710,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paul Holt",
               "gender": 2,
               "credit_id": "52fe4522c3a36847f80be577",
               "name": "John Furey",
               "profile_path": "/dttETPmEg7mt39T9URx19IedPLD.jpg",
               "id": 55571,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alice Hardy",
               "gender": 1,
               "credit_id": "52fe4522c3a36847f80be57b",
               "name": "Adrienne King",
               "profile_path": "/xCS2BI8ulvypH1cNVtMGwwr50zt.jpg",
               "id": 37470,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Terri",
               "gender": 0,
               "credit_id": "52fe4522c3a36847f80be57f",
               "name": "Kirsten Baker",
               "profile_path": "/4ERXWP4D7wRS90k4M0YMUtZcAYq.jpg",
               "id": 58711,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Mrs. Pamela Voorhees",
               "gender": 1,
               "credit_id": "52fe4522c3a36847f80be5a7",
               "name": "Betsy Palmer",
               "profile_path": "/lXeseQAJQeKBTlldXGV022wbWbR.jpg",
               "id": 37469,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Vickie",
               "gender": 1,
               "credit_id": "52fe4522c3a36847f80be5ab",
               "name": "Lauren-Marie Taylor",
               "profile_path": "/36zBTF6UfIq9moVmPOh7dekmczh.jpg",
               "id": 1048670,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Crazy Ralph",
               "gender": 2,
               "credit_id": "52fe4522c3a36847f80be5af",
               "name": "Walt Gorney",
               "profile_path": "/uUyk6drqyF7y76eSzX8QpfuTKUj.jpg",
               "id": 1014310,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Ted",
               "gender": 2,
               "credit_id": "533863d49251417da7002f9c",
               "name": "Stuart Charno",
               "profile_path": "/67yRU3WNiHUNwm4dfYc7EKI86TC.jpg",
               "id": 55931,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Sandra",
               "gender": 1,
               "credit_id": "533863f59251417dad002f48",
               "name": "Marta Kober",
               "profile_path": null,
               "id": 92758,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Scott",
               "gender": 2,
               "credit_id": "533864119251417daa002fff",
               "name": "Russell Todd",
               "profile_path": "/olSzNmPi4EuahT7SK2VZj7xde6C.jpg",
               "id": 102436,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Mark",
               "gender": 2,
               "credit_id": "5338642f9251417d9e00302b",
               "name": "Tom McBride",
               "profile_path": null,
               "id": 1036511,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "533864479251417da4002fd6",
               "name": "Bill Randolph",
               "profile_path": null,
               "id": 1234924,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4522c3a36847f80be585",
               "name": "Steve Miner",
               "profile_path": "/yk90jxBifKosxEyP8CITJk1BTtt.jpg",
               "id": 58712,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4522c3a36847f80be58b",
               "name": "Ron Kurz",
               "profile_path": null,
               "id": 58713,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4522c3a36847f80be591",
               "name": "Steve Miner",
               "profile_path": "/yk90jxBifKosxEyP8CITJk1BTtt.jpg",
               "id": 58712,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "52fe4522c3a36847f80be597",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4522c3a36847f80be59d",
               "name": "Peter Steinfeld",
               "profile_path": null,
               "id": 37933,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4522c3a36847f80be5a3",
               "name": "Susan E. Cunningham",
               "profile_path": null,
               "id": 58715,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.475654,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9725,
      "vote_count": 415,
      "budget": 1250000,
      "overview": "Five years after the horrible bloodbath at Camp Crystal Lake, it seems Jason Voorhees and his demented mother are in the past. Paul opens up a new camp close to the infamous site, ignoring warnings to stay away, and a sexually-charged group of counselors follow -- including child psychologist major Ginny. But Jason has been hiding out all this time, and now he's ready for revenge.",
      "similar": [
         948,
         10781,
         24124,
         13567,
         5486,
         341006,
         9792,
         21407,
         1696,
         1991,
         10285,
         588,
         4232,
         381288,
         12521,
         984,
         398175,
         12662,
         10185,
         9373
      ],
      "original_title": "Friday the 13th Part 2",
      "runtime": 87,
      "poster_path": "/3c6uMXqFXO9G5RVdiPB76IK3FYM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Georgetown Productions, Inc.",
            "id": 7512,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1981-05-01",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/c7pMKwv5NzIN6N3KM4L8fYMTtPw.jpg",
         "name": "Friday the 13th Collection",
         "id": 9735,
         "poster_path": "/uobgqpLQff9WvxGKE2OSvXv1RHm.jpg"
      },
      "tagline": "The body count continues...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Miner"],
      "runtime": 87,
      "synopsis": "Two months later after Crystal Lake's brutal massacre, Alice (Adrienne King), wakes up after dreaming about Mrs. Voorhees' decapitation. She talks on the phone to her mother, then she takes a shower and decides to boil the kettle. When she opens the fridge, she finds Mrs Voorhees' severed head, before being stabbed in the head with an ice pick by a unidentified assailant. Five years later, a group of young adults have come to Crystal Lake to attend a counselor training center that has been set up near the now-condemned Camp Crystal Lake. While some counselors, named Jeff (Bill Randolph) and Sandra (Marta Kober), are in town on their way to the facility, the town drunkard Crazy Ralph (Walt Gorney) appears and tells the counselors to turn back, as the young counselors five years ago did not heed his warning. At the camp, Paul (John Furey), the leader of the group, explains how camp counseling is a serious job, and that the main danger in this area is bears. Ginny (Amy Steel), Paul's former girlfriend, arrives in her broken-down Volkswagon and attends the meeting as well. One night, around a campfire, Paul tells the people about how Jason Voorhees drowned in the same lake which their training area also bounds; how his mother was found to be the infamous murderer of \"Camp Blood\"; and that Alice survived only to disappear shortly thereafter, and that some of the local residents believe Jason is still alive and viciously protects the area around Crystal Lake. When the counselors seem into the story, they are shocked by a mask-wearing man with a spear, but it only turns out to be the prankster Ted (Stu Charno) in a monster mask and Paul claims that Jason is dead. While some of the counselors are seen making out, Crazy Ralph is standing behind a tree, and is suddenly killed using a garotte around his neck. The next day, Jeff and Sandra sneak away to Camp Crystal Lake, which is now in disrepair. As they are about to go into one of the cabins, they are stalked by an unseen man who then approaches them; but it is revealed that is a local policeman (Jack Marks) who has caught them trespassing. The policeman returns the two counselors to camp, where Paul only recommends a light punishment. However, when driving away, the policeman sees somone dart out in front of his squad car, and is running in the direction of the off-limits Camp Crystal Lake. The policeman chases after the masked man to arrest him as well, only to lose him and go into a cabin. The policeman then sees a horrifying sight (not shown to the viewer) before having a claw hammer slammed into the back of his head. After getting to know one another and participating in some training exercises (which consist of dancing, jogging through the woods, swimming and a cookout), the majority of the trainees leave the campsite to party in town for the evening with the exception of Jeff, Sandra (it is their punishment), Mark (Tom McBride) (he is in a wheelchair), Vicki (Lauren-Marie Taylor) (she wants to stay and talk to Mark), as well as Vicki's friend Teri (Kirsten Baker), and Scott (Russell Todd). Teri decides to go for a swim, and goes skinny dipping. During this, her clothes are stolen by someone, and she exits the lake. It is revealed to be Scott who stole her clothes. As they playfully fight, Scott is caught in a trap, and is hung upside down. Teri goes to look for something to cut him down with. While she is looking, Scott's throat is cut by the assailant, using a panga machete. When Teri returns, she thinks Scott is playing a game, but finds him dead, and she is killed off-screen. Meanwhile, far away from the camp, the other group of counselors are partying at a local bar. Ginny brings up the legend of Jason, imagining what Jason would be like if he were alive, deducing he had seen his mother murdered and would be a vengeful creature unaware of the meaning of life and death. Paul, in response, dismisses her concerns and tells her that he is only a legend since Jason drowned in the lake and his demented mother, whom murdered seven people at Camp Crystal Lake, is also dead and buried. Ginny gets bored and decides to return to the camp, and Paul accompanys her, while Ted and the rest of the counselors stay behind at the bar. As it begins to rain, Vicki goes to put some make up on, so Mark will find her more attractive. Mark is on the balcony, when the killer attacks him from behind, by slamming the machete through his head and his corpse, along with his wheelchair falls down the raining stairs. Vicki goes into the house to look for Mark, but cannot find him. Jeff and Sandra are upstairs having sex, but not knowing the assailant heads upstairs and resulting both of them impaled through the bed with a spear. Vicki goes upstairs, and finds them dead, and finds the assailant, wearing a one-eyehole gunny sack over his head, where then she is stabbed through her stomach with a chef's knife. Upon their return to camp, the rain lets up and Ginny and Paul discover the lights are not working in the main cabin and sheets on an upstairs bed appear to be covered in blood. During the search, Ginny finds the two bodies of one the counselors, and then opens the freezer, where Crazy Ralph's corpse falls out. Soon, Paul is attacked by the gunny-masked assailant as Ginny runs out into the woods. After a lengthy chase, Ginny stumbles upon the assailant's cabin and enters. In the back room, she discovers an altar with Pamela Voorhees' head (Now mummified) on it, surrounded by the bodies of the recent victims. At this point, Ginny realizes that Jason Voorhees is the murderer, who seemingly survived his drowning and now seeking revenge upon his deceased mother. Using her study of child psychology to her advantage, Ginny dons Mrs. Voorhees' sweater and deceives Jason into believing that she is his mother (although Jason wises up when he sees his mother's severed head). Jason sees Ginny attempting to attack him with his mother's machete, in which he quickly acts by slashing Ginny's right leg with a pickaxe. Paul, (still alive) runs in and tackles Jason to the floor, at which one point Jason overthrows him and prepares to kill him with his pickaxe. Ginny revives, takes the machete, and slams it through Jason's left shoulder, seemingly killing him. Afterwards, Ginny and Paul uncover his disfigured face (unseen to the viewer) as they leave the cabin. Paul and Ginny retreat back to their cabin, now believing Jason is dead and find Muffin, Terri's pet dog (alive and active). As Ginny calls to her dog Muffin to come, an unmasked and deformed Jason (Warrington Gillette) breaks through the window (With the machete still intact in his shoulder) and pulls Ginny out. The next morning, Ginny wakes up while being placed in an ambulance with no recollection of what happened to Paul. The final shot shows Mrs. Voorhees' head still on the altar, where Jason is also nowhere found, but it is strongly implied that he is still active, before ultimately fading to black.",
      "writers": [
         "Ron Kurz",
         "Victor Miller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082418/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzE4NDkyMjgwM15BMl5BanBnXkFtZTcwNTY4ODgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Betsy Palmer, Amy Steel, John Furey | See full cast and crew »"],
      "reviews": [
         "So many refer to this as the debut of Jason Voorhees. It wasn't...simply the debut of him killing people. He left that to his mom in part one! Steve Miner didn't mess around too much with Sean Cunninham's successful formula simply adding some quite inventive kills and bloodletting. No-one could be accused of using method-acting here, truth is its all pretty embarrassing. The high-school script though probably isn't that much out of place - they are schoolkids after all. Jason himself, though still slightly diminished of stature is one creepy little dude, still without his hockey mask but wearing a burlap sack with holes cut out for his eyes. What appears to be his demise is of course anything but...as parts 3 to 10 will attest. The final 15 minutes are quite tension-filled and better than anything in the original. A must-see for devotees of the series.",
         "I say that, of course, in reference to the expected quality of a movie like this. In general, horror series like the seemingly endless Friday the 13th series are composed of one hugely successful original film (generally, by today's standards, inexplicably so, despite the abysmal standards of today) followed by a lot of stomach-turningly awful sequels that try in vain to recapture the success of the original film. The first sequel in the Friday the 13th series, however, seems to escape that trend, although it never manages to be much better than the original, which wasn't that great in the first place. But at the very least, even the Austin Powers series went more precipitously downhill than Friday the 13th. The movie takes place several years after the original ended, and since Mrs. Voorhees was the real killer in the original (which we all know because we've all seen Scream) and was beheaded at the end, we now have to have a real killer. The thing that helps this movie escape the treacherous realms of the sophomore effort is that it presents the story so well. Jason has lived in the woods since his mother was killed (a horrifying event which the young Jason witnessed), not interacting with a human being in any way in all those years. In order to seek revenge for his mother's murder, he has been savagely stalking and murdering anyone who comes close to his area of the lake. Not exactly the most intricate storyline, but at least it's not some mindless killer running around killing any teenager daring enough to get involved in any kind of sexual behavior (an extremely popular motive in cheesy horror movies). In this case, promiscuity is punished because Jason supposedly drowned because the counselors who were supposed to be watching him were making out when he was screaming for help. There is a cheesy fireside scene where one character explains this whole thing to all of the teens who are out there training to be counselors, which obviously ends with one person in disguise jumping out of the bushes screaming and scaring the hell out of everyone around the fire. The movie then jumps into auto-pilot for most of the film, becoming your typical slasher movie, but at least they took the time to explain why all these killings were happening, right? This makes me wonder, however, why they would cover Jason's face with a cheap piece of bedsheet with a little hole torn in it for one of his eyes. They've seen Halloween! They know the effectiveness of an expressionless mask, so why not be a little more creative here? The only reason I can think of is that Jason lives in the woods and doesn't exactly have access to things like the costume store where Michael Meyers got his mask, but he did have access to axes and machetes and candles and whatnot. Surely in all those years he could have come up with something at the very least a little more comfortable to wear or easier to see through. At the very end of the film, by the way, we are treated to a close up and slow motion look at Jason's real face (something that we never get to see of Michael Meyers, although we almost do in one of the films), as he leaps through a window to grab the last girl left alive. And what a face! No wonder nobody wants to play with him! As far as the killings themselves, Friday the 13th Part 2 fits in with most other 80s slasher films, which are little more than exercises in coming up with new and interesting ways to kill people, because we already know the formula from countless slasher films made before. In this case, there are certainly some creative murders, and the film even confused me with feelings of sympathy for Jason near the end, particularly when he is holding his arms up trying to get away from the chainsaw. The poor guy! Someone killed his mom for avenging his death, and he's lived in the woods alone his whole life! He's the victim here! Okay, I wouldn't go that far, but I definitely felt badly for the poor guy when he fell off the chair and then almost got chainsawed. But luckily he's soon back on his feet (even after almost being cut completely in half with a weak swing of a machete) goring people with big scary knives and reminding us of the dangers of messing with him. Or, as it were, being anywhere near Camp Crystal Lake. This is also, by the way, the last time that any sympathy can be felt for anyone dumb enough to go up to the lake. The rest of the sequels are filled with people who deserve to die anyway for being so dumb. Well, at least his mask improves from this point on.",
         "Friday the 13th part 2 is a great horror film and is the best in the series. Has its share of sex drugs and blood easy to follow with a great opening. Amy Steel gives a good performance as our heroine and the rest of the cast is fine as well. This film moves at a nice pace has its jump scares and builds up nicely to the final chase. I think this film has stood the test of time nicely does not ever seem too dated in anyway no crazy hillbilly music score (such as in the Burning, Bloody Valentine from the same time}. Simple horror at its best.",
         "While most sequels cash in on their original movie's fame, the second part of the Friday the 13th series lives up to its name. Unlike the first movie, Jason stars in this movie while his \"mother\" has the cameo. The gore and the kill scenes surpass the original. The characters are true teenage stereotypes. Much like the ending in the original, the ending here is great. A jump out of your seat moment that lives up to the original. This is way before Jason wears his hockey mask. Here we are witnessed to a masked killer that uses a pillow case to hide his scary identity. From here on, the fame of PART 2 made it possible for the next bunch of films to happen. It is pretty much all down hill from here. While some of those films lived up to being great horror movies, most fell short and could not recycle the same effect that PART 2 had on its audience.",
         "If you've never seen this film, or it's been a while since you've seen it, then do yourself a favor and check it out. This is the film that really put the name \"Jason Voorhees\" on the map. It seems that another camp has opened on Crystal Lake a few years after the original takes place. Now Jason is fully grown, and out to get some revenge for his dead mother! A young Steve Miner was handed the reins for this one and part 3, and he did a very respectable job. With only about a million dollars to use, he created a frightening and more than profitable film which set the table for many more down the road. Since it cost so little to make the earlier films in this series, it just goes to figure that ANY public demand for sequels was bound to create one after the next. Part 2 is somewhat less gory than others in the series. One particularly graphic death was trimmed way down to avoid the X-rating which would have spelled death at the box office. There are some other graphic deaths to make it worth your time, however. One unlucky cop gets the back of a hammer through his cranium. Another man is hung from his feet and his throat slashed. A poor guy in a wheelchair gets a machete in the face, then rolls down a long flight of stairs. Overall, there are still enough killings to keep your interest. The suspense is the strongest aspect of this film. Jason is a smaller and quicker adversary in this film than in the others. The guy they cast for him originally auditioned for John Furey's role, so he wasn't some gigantic beast like Ted White or Richard Brooker. The last fifteen minutes when Jason pursues Amy Steel around the camp are incredibly scary. The moment when Jason comes crashing through the window at the end is perhaps the biggest single scare in the series. And maybe I'm in the minority here, but I think Jason with the gunny sack over his head may have been scarier than with the hockey mask. With the sack, you have absolutely no idea what he looks like under there until we see him unmasked. And what a sight that is!! This is a very good horror film. Do yourself a favor and take another look at it. 8 of 10 stars. The Hound.",
         "This one has got all the things that make up a fun slasher flick. Pointless nudity + pointless sex + blood-o-rama +cheap scares. All in all I was more entertained by this one than the original. I also like how it was the perfect length for a thriller, it didn't get tiresome. It's hard to make these types un-predictable, but they've avoided that here to my surprise. My only complaint is the ending, I didn't get it. Maybe its cleared up in #3? Anyways, See it for some scares! 8/10",
         "After the brilliant Friday THE 13TH, Hollywood of course got greedy and rushed in a sequel with the help of writer Ron Kurz and director Steve Miner. What they deliver is a good installment and top notch death scenes not surpassing the first, but still shocking. Five years after the events of the first film, the survivor of that horrible day is killed by JASON, the boy believed to be drowned for the last 25 years. So now he's finishing off what mama started. Making sure no one goes to Camp Crsytal Lake. But when a new summer camp is opening up right next to his domain, he decides to kill first and ask questions way later. No the hockey mask dosen't come in folks, and no this is not better than the first one. But this one has a playful mode than one, which at it's time was serious. The acting by Amy Steel and John Furey is more of something to root for, because we do care if THEY do die or not. And JASON performance seem lock on, although KANE HODDER is a saint when he plays JASON. And the death scenes are toned down a bit, but still leaves us with that strange feeling in our stomach. Especially the bit involving a wheelchair, what will just make you say \"Now that's just plain wrong.\"",
         "Five years after the horrible massacre at Camp Crystal Lake, all that remains is the legend of Jason Voorees and the death of his demented mother who had murdered 7 campers until one get her. It starts of with Alice (Adrienne King) the survivor of the first one, having nightmares about the events of 5 years ago at camp crystal lake. She's living alone in a spooky house and talks to her mother on the phone about trying to put her life back together, unaware that Jason is lurking around outside, she jumps in the shower and gets phonecall, a hang up from Jason, she goes into the kitchen, opens the fridge door finds a human head and Jason pops up and rams a screwdriver through her head. Then we meet Sandra (Marta Kober) and Jeff (Bill Randolf), on a payphone to they're friend, then Crazy Ralph from the first one appears warning them like last time \"I Told the others they didn't believe me, you're all doomed, you're all doomed\". Eventually they join the other campers at a camp site near camp crystal lake, we get the new meat head councilor Paul Holt (John Furey), Terri (Kirsten Baker) one of the early victims, Ted (Stuart Charno) the funny one, Jeff and Sandra the carefree lovers, Mark (Tom McBride) wheelchair guy, Vicky (Lauren Marie Taylor) the nice girl, Scott (Russell Todd) the charmer and last but not least the main heroine Ginny (Amy Steel) who's the best last girl out of the entire series in my opinion. Overall, much better than the first one, the deaths are wicked especially the one with the 2 people in bed together getting speared, and even the guy in the wheelchair gets it, in the face with the machete, Crazy Ralph (Walt Gorney) makes a final appearance as crazy ralph before he gets garotted with barb wire and the one with the guy gets caught in the trap and has his throat slit hanging upside down. The only standout performance is from Ginny (Amy Steel) who was also impressive in April Fools Day, really goes for it with Jason in the final showdown between killer and heroine.",
         "My friend and I saw this movie years ago when we were teenagers. We both love scary movies, and have seen a variety over the years. Whenever the topic of scary, or horror, movies comes up in conversation, this one is always at the top of our list as the best of the best. The reason (s) being, the story was original enough to stand on it's own, even though it was a sequel; It is the first movie of the series that introduces Jason as the killer; and most importantly, Amy Steel starring as the movie's sole survivor was PERFECT casting . She by far, 'makes' this movie, and her acting is exceptional, making her character, Ginny Field, memorable... In my opinion, she sets the standard for all horror movie heroines. (She was also great in \"April Fool's Day.\") Steve Miner's directing is also worth noting, as there are several effective scares throughout scenes of the movie. The chase scene in the last half hour of the movie is as adrenaline packed as a roller-coaster ride, and is more suspenseful than most big budget movies made today. This movie is not often given the credit it deserves by critics, etc. (you know who you are,) since it is a sequel and a horror movie, but Friday the 13th Part 2, starring Amy Steel, is at the top of my list for the genre. Thanks for reading.",
         "The sequel to the woefully remedial \"Friday the 13th\" improves on the original film, which is sort of like saying slightly curdled milk is an improvement on really curdled milk, but I digress. Part 2 is better if only because Jason is the actual killer, not that weird androgynous mother lady. He wears a really creepy pillow case or something over his head instead of his hockey mask, and it's actually a scarier effect than the more iconic image--he should have stuck with it. There's a long prologue in which the only survivor from the first film eventually gets an ice pick in the forehead, but only after she's been repeatedly scared by the phone, a cat, etc. This opening is actually pretty nerve-racking, and it sets the tone for the rest of the movie, in which the kills are more original than the first (I'm a particular fan of the handicapped kid who gets a machete in the face and then is sent bouncing down some garden steps in his wheelchair) and the nudity is more bountiful and gratuitous. I'm not even going to try to justify my enjoyment of slasher movies---they speak to the basest instincts in all of us and are really morally repellent, but, hey, I like what I like. One of the better episodes in the interminable series. Grade: C+"
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Georgetown Productions Inc.",
         "Sean S. Cunningham Films"
      ],
      "summaries": [
         "After killing Mrs. Voorhees, who was avenging her son Jason's death, Alice Hardy can finally sigh with relief. But there is just one problem. Jason never drowned at Camp Crystal Lake and lived in the nearby woods as a hermit all this time. The day that Alice beheaded his mother, Jason saw everything and his heart filled with thirst for revenge. Two months later, Alice gets stabbed by an ice pick in the temple and disappears. Is Jason behind this? Five years later, a camp next do to Camp Crystal Lake is built and the counselors start snooping around the old, abandoned camp ruins. This makes Jason very upset, since his shack is next to the remains of Camp Crystal Lake and what is inside the shack shall be kept secret forever, even if it means killing nine people!",
         "Two months later, after the tragic incidents back in 1979, the only survivor was mysteriously murdered. Five years later, Paul Holt opens a counselor training center, at Packanack Lodge, near by the old Camp Crystal Lake. Ignoring once again the warnings from Crazy Ralph, murders began again. But as the legend goes, did Jason really drown at Camp Crystal Lake, or he didn't? Is there a reason why these murders are happening? Prepare yourself for another night of screams.",
         "Five years after Mrs. Voorhees is killed, the camp counselor training retreat is plagued by a psychotic person with a bag over his head. One by one, the counselors are killed in gruesome and violent ways. Ginny Field, on the other hand, wants to stay alive and will do anything to do so. Anything involves an ax and a pitchfork maybe.",
         "The movie starts off with the survivor of Part I being killed, and it flashes forward five years to a new camp that has been opened across the lake from the infamous \"Camp Blood\" (Camp Crystal Lake). This time, the killer is Jason Voorhees, who is in mourning for his mother. Again, the counselors are killed one by one.",
         "Mrs. Voorhees is dead, and Camp Crystal Lake is shut down, but a camp next to the infamous place is stalked by an unknown assailant. Is it Mrs. Voorhees' son Jason, who did not really drown in the lake some 30 years before?"
      ],
      "budget": 1250000
   },
   "movielensId": 1975,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-05-01",
      "dvdReleaseDate": "2004-10-05",
      "directors": ["Steve Miner"],
      "runtime": 87,
      "movieId": 1975,
      "title": "Friday the 13th Part 2",
      "mpaa": "R",
      "actors": [
         "Amy Steel",
         "John Furey",
         "Adrienne King",
         "Kirsten Baker",
         "Betsy Palmer",
         "Lauren-Marie Taylor",
         "Walt Gorney",
         "Stuart Charno",
         "Marta Kober",
         "Russell Todd",
         "Tom McBride",
         "Bill Randolph"
      ],
      "imdbMovieId": "0082418",
      "originalTitle": "Friday the 13th Part 2",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "Qqmj12n7yYc",
         "ww5H_UUlJzs"
      ],
      "plotSummary": "Five years after the horrible bloodbath at Camp Crystal Lake, it seems Jason Voorhees and his demented mother are in the past. Paul opens up a new camp close to the infamous site, ignoring warnings to stay away, and a sexually-charged group of counselors follow -- including child psychologist major Ginny. But Jason has been hiding out all this time, and now he's ready for revenge.",
      "tmdbMovieId": 9725,
      "avgRating": 2.48179,
      "releaseYear": "1981",
      "numRatings": 1950,
      "posterPath": "/3c6uMXqFXO9G5RVdiPB76IK3FYM.jpg"
   }
}