{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lake",
            "id": 1889
         },
         {
            "name": "summer camp",
            "id": 5767
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "summer",
            "id": 13088
         },
         {
            "name": "jason voorhees",
            "id": 163621
         },
         {
            "name": "one by one",
            "id": 163651
         },
         {
            "name": "friday the thirteenth",
            "id": 163652
         }
      ],
      "imdb_id": "tt0083972",
      "video": false,
      "title": "Friday the 13th Part III",
      "recommendations": [
         9725,
         9730,
         10281,
         9731,
         10225,
         10283,
         10285,
         4488,
         11470,
         11357,
         11281,
         11361,
         10987,
         11442,
         11675,
         10131,
         10676,
         10160,
         11284,
         10072
      ],
      "backdrop_path": "/ePhSRZqYcgBVg0TvXEYX2lPIW2z.jpg",
      "revenue": 36690067,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chris Higgins",
               "gender": 1,
               "credit_id": "52fe4523c3a36847f80be83d",
               "name": "Dana Kimmell",
               "profile_path": "/A9bPkEPjBZ3azwTtZEbHLbbbzjo.jpg",
               "id": 58799,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rick",
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be841",
               "name": "Paul Kratka",
               "profile_path": null,
               "id": 58802,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Debbie",
               "gender": 0,
               "credit_id": "539b78ac0e0a2644450005b7",
               "name": "Tracie Savage",
               "profile_path": null,
               "id": 1225471,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Andy",
               "gender": 0,
               "credit_id": "539b78bf0e0a26450200214b",
               "name": "Jeffrey Rogers",
               "profile_path": null,
               "id": 106249,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Vera Sanchez",
               "gender": 1,
               "credit_id": "539b78e20e0a264508002265",
               "name": "Catherine Parks",
               "profile_path": "/r0L9RhDveaVbHIRlT2l3HXYNiJb.jpg",
               "id": 55268,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Shelly",
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be893",
               "name": "Larry Zerner",
               "profile_path": null,
               "id": 558477,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Chili",
               "gender": 0,
               "credit_id": "57e18244c3a36808b9001305",
               "name": "Rachel Howard",
               "profile_path": null,
               "id": 82176,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Chuck",
               "gender": 0,
               "credit_id": "57e1825dc3a36808c30010e9",
               "name": "David Katims",
               "profile_path": null,
               "id": 1682653,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Ali",
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be88f",
               "name": "Nick Savage",
               "profile_path": null,
               "id": 995980,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Fox",
               "gender": 1,
               "credit_id": "57e1822fc3a36808c30010cd",
               "name": "Gloria Charles",
               "profile_path": "/jOk3kda1qdJTuoAGELglBhr9O0k.jpg",
               "id": 83334,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Loco",
               "gender": 0,
               "credit_id": "57e1826d92514152210012ae",
               "name": "Kevin O'Brien",
               "profile_path": null,
               "id": 191939,
               "order": 10
            },
            {
               "cast_id": 3,
               "character": "Jason",
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be845",
               "name": "Richard Brooker",
               "profile_path": null,
               "id": 58807,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Harold",
               "gender": 2,
               "credit_id": "58d4d7a39251411f90028354",
               "name": "Steve Susskind",
               "profile_path": "/vqgEWGaHtCuwX43TalUv6ySp5Bx.jpg",
               "id": 7909,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Abel",
               "gender": 0,
               "credit_id": "58d4d7d09251411fd5027d4b",
               "name": "David Wiley",
               "profile_path": null,
               "id": 1782844,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Mrs. Sanchez",
               "gender": 1,
               "credit_id": "58d4d784c3a368127c026008",
               "name": "Perla Walter",
               "profile_path": null,
               "id": 1778206,
               "order": 14
            },
            {
               "cast_id": 4,
               "character": "Cashier",
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be849",
               "name": "Anne Gaybis",
               "profile_path": null,
               "id": 58808,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be84f",
               "name": "Steve Miner",
               "profile_path": "/yk90jxBifKosxEyP8CITJk1BTtt.jpg",
               "id": 58712,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be855",
               "name": "Frank Mancuso Jr.",
               "profile_path": null,
               "id": 49284,
               "department": "Production",
               "job": "Finance"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be85b",
               "name": "Martin Kitrosser",
               "profile_path": null,
               "id": 58809,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be861",
               "name": "Ron Kurz",
               "profile_path": null,
               "id": 58713,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be867",
               "name": "Victor Miller",
               "profile_path": null,
               "id": 38685,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 1,
               "credit_id": "52fe4523c3a36847f80be86d",
               "name": "Carol Watson",
               "profile_path": null,
               "id": 58810,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be873",
               "name": "Petru Popescu",
               "profile_path": null,
               "id": 58811,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be879",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be87f",
               "name": "Gerald Feil",
               "profile_path": null,
               "id": 58812,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be885",
               "name": "George Hively",
               "profile_path": null,
               "id": 13810,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be88b",
               "name": "Steve Miner",
               "profile_path": "/yk90jxBifKosxEyP8CITJk1BTtt.jpg",
               "id": 58712,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.761349,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9728,
      "vote_count": 340,
      "budget": 4000000,
      "overview": "An idyllic summer turns into a nightmare of unspeakable terror for yet another group of naive counselors. Ignoring Camp Crystal Lake's bloody legacy, one by one they fall victim to the maniacal Jason who stalks them at every turn.",
      "similar": [
         4488,
         357096,
         24124,
         15069,
         13567,
         948,
         3597,
         445954,
         984,
         30833,
         10651,
         10781,
         2749,
         123109,
         18587,
         26390,
         8090,
         15762,
         2832,
         1586
      ],
      "original_title": "Friday the 13th Part III",
      "runtime": 95,
      "poster_path": "/5wg2NZyIhcMbIBAahBODXHyJ54S.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jason Productions",
            "id": 7513,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1982-08-13",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": "/c7pMKwv5NzIN6N3KM4L8fYMTtPw.jpg",
         "name": "Friday the 13th Collection",
         "id": 9735,
         "poster_path": "/uobgqpLQff9WvxGKE2OSvXv1RHm.jpg"
      },
      "tagline": "There's nowhere to hide. We dare you to try.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Miner"],
      "runtime": 95,
      "synopsis": "Picking up from the previous events with a flashback sequence, Jason (Richard Brooker) has seemingly survived his attack from Paul and Ginny, and migrates to a store where he changes clothes and then murders the store owners, the henpecked Harold (Steve Susskind) with a meat cleaver into his chest and his shrewd wife Edna (Cheri Maugans) with a knitting needle through the back of her head, before moving on to a nearby lake front property named Higgins Haven. At the same time, 18-year-old Chris Higgins (Dana Kimmell), who was attacked by a mysterious, disfigured stranger in the woods near Crystal Lake two years earlier, returns to the property with her friends; Debbie (Tracie Savage), her boyfriend Andy (Jeffrey Rogers), dim-witted prankster Shelly (Larry Zimmer), Vera (Catherine Parks), and stoners Chuck (David Katims) and Chilli (Rachel Howard). After meeting Abel, an inebriated, religious fanatic derleict who warns them to turn back, the gang meets Chris' boyfriend Rick (Paul Kratka) at their destination; Higgins Haven. Chris intends to face her fears; however, none of her friends know that an unmasked and reclusive Jason has taken refuge in the barn to recover from his wounds. Meanwhile, Shelly and Vera go shopping at a local supermarket to get food and supplies when they get into trouble with a three-person biker gang, called the Black Widows, led by a brutal woman named Fox (Gloria Charles). When Shelly accidently knocks over their motorcycles outside the store, Fox and her two minions Ali (Nick Savage) and Loco (Kevin O'Brien) follow Shelly and Vera back to Higgin's Haven for revenge. However, they are dealt with by Jason before they can do any real damage except for taking the gas out of the gang's van. While looking around the barn in fascination, Fox is murdered with a pitchfork to her neck. Loco looks for her and gets impaled with a pitchfork. Ali is next when he enters the barn and finds the two's corpses. He attacks the unseen Jason, but gets bludgeoned with a 10\" pipe wrench. At nightfall, Jason continues lurking around the barn while spying on the kids who settle down for a party at the nearby cabin. When Chris and Rick go for a walk in the woods, Jason wanders out of the barn to cause more harm again. At first, Jason only harasses them from a distance. When Chuck goes to an outhouse to take a dump and smoke more pot, Jason walks past and bangs on the walls of the outhouse before retreating. Later, Shelly, wearing a wet-suit and a Red Wings hockey mask plans another scare prank against Vera who is siting on a pier beside Higgens Lake. After Vera angrily tells Shelly to go off, he wonders into the barn where Jason slits his throat and takes his hockey mask, now concealing his deformity. Taking the spear-gun that Shelly had with him, Jason (fully masked) walks out of the barn and sees Vera wading out in the shallow water to get Shelly's wallet after she accidently drops it in the water. Thinking it's Shelly, Jason shoots Vera right in her left eye, killing her as her body falls in the water, and having Jason to discard the spear-gun. With Vera killed, Jason finally sneaks into the house, where he continues onward with his killing spree. After Andy and Debbie have sex, she goes to the bathroom for a shower, but gets surprised by Andy, who is walking on his hands. Jason sneaks up to him and horizontally murders him with a machete. Debbie leaves the shower and rests in her hammock in her bedroom, where she soon discovers Andy's horizontally-spitted body hanging from an overhead plank and gets stabbed through the hammock with a kitchen knife. Next, Jason disables the power to the cabin by tampering with a fuse box. When Chuck goes to the basement to fix it, Jason approaches him and shoves his face on the circuit panel, electrocuting him. At the same time, Shelly, whom is still alive and having his neck still slit, stumbles into the cabin before dying where Chilli finds him, but she is quickly attacked and killed by Jason who shoves a hot fireplace poker through her stomach. When Chris and Rick return they find the place empty, where they split up to find out what's going on. Rick, outside is attacked by Jason who kills him by crushing his head, which one of his eyes pops out. After finding the corpse of Loco, Jason then confronts Chris with an felling axe, and a climatic chase ensues with the two of them exchanging attacks with Chris trying to keep away from the masked murderer. During the process, she slows him down by dumping a bookshelf over him, then stabs him in his left leg with the same knife used to kill Debbie (Just before Jason throws it at a wall, which nearly hits Chris), and then bashes him with a fireplace log. Chris tries to escape in the van and almost hits Jason, but it soon runs out of gas (due to the biker gang's vandalism), forcing her to run back to the barn to hide. Jason enters the barn and arms himself with a machete and confronts Chris on the barn's rafter, but she manages to subdue him by bashing him on his head with a shovel. She seemly defeats Jason by tying him to a rope and hanging him to make sure that he is dead. Jason survives the hanging and briefly shows his real disfigured face to Chris while trying to get the noose off his neck, which she recognizes him as the man who attacked her two years ago. As Jason precedes to attack Chris with his machete, one of the bikers, Ali (who seemingly survived his attack), attempts his revenge on Jason, but Jason severs his right hand and hacks him to his demise. While Jason is hacking up Ali, Chris picks up an felling axe and slams it down to Jason's skull, causing him to stagger and fall over, seemingly killing him. Chris then wanders over to the lake and falls asleep in a canoe that drifts into the middle of the lake. The next morning, she wakes up in the canoe, when suddenly she sees Jason (now unmasked and bloody from the axe cut) appearing from an upper window, causing him to run outside to the lake to attack, but sees that it was just a part of her imagination. Reliving, suddenly she gets pulled into the water by a decaying Mrs. Voorhees (Whom has her head still intact). It is revealed that it was just a disturbed nightmare and at some point later, the police take Chris (Mentally disturbed from the events) off the property into the police car as they drive off. The film ends with Jason's deceased corpse, still with the axe intact in his head and showing the lake in peace once again.",
      "writers": [
         "Martin Kitrosser",
         "Carol Watson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0083972/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NTI4NzAwN15BMl5BanBnXkFtZTYwMTA5NzY4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dana Kimmell, Tracie Savage, Richard Brooker | See full cast and crew »"],
      "reviews": [
         "There are very few horror films that are like Halloween ( the first one ) and Nightmare on Elm Street ( the first one ). That is, horror films that not only scare, but have a good story and great direction. Steve Miner is obviously not in the same league as Carpenter and Craven, but what he does manage to do is make an effective sequel that is much scarier than the first and next to the final chapter, it is the best and scariest among all the Fridays. This film is laughable in parts, especially in terms of continuity with some of the stories that are told by Chris, but having said that, Steve Miner makes a very atmospheric and very tense film. The film starts off the day after part two ended. We know Jason is still alive because he kills two disgusting people at the beginning that at least establishes Miner's style to come for the rest of the movie. The false scares, the open doors with no one there, the strange noises, the missing props that the character knows she had just a few seconds ago. The beginning is very well done. But again, the continuity and stupidity of movie characters is at all an all time high here. ( A quick example: Harold is about 5'6, rotund and clumsy. His wife calls out his name when she sees a well built figure standing behind her sheets at night. This figure is at least 6 feet or more in height and he looks squared, not pear shaped like her husband Harold. Plus, on the television is the news about the massacre the night before saying that the killer has not been caught. DUUUHHH!! Should this not click into her brain that who she is seeing may be Jason? ) But what is excellent about this film are some of the same elements that made Halloween good. And that is the use of foreground for false scares. There are numerous times when the camera scans the for-ground and you are so sure that Jason is going to show up, and then he doesn't until whammo, someone loses an eye or their life. It is very effective. There are also numerous shots of Jason in the background waiting for his next victim to turn around to see him. And when we see him standing behind one stoner guy, his pure size really makes him menacing. And that mask.... How he gets the mask is one of the great trivia questions in Friday the 13th folklore. Steve Miner did a masterful job of directing and why he decided to hand the reins over to Joseph Zito for the final chapter is a mystery As Fridays go, this is one that you can't go wrong with. It also has ( I believe ) one of the five most gruesome and painful deaths in the series. Watch for Andy walking on his hands, it will make you cringe for quite a while. Edit: The new remastered edition in 3-D is worth seeing. I found the 3-D to be entertaining in some parts and lacklustre in others, but there is some added footage in the deluxe edition. You get to see more of Fox hanging from the barn and in a truly jaw dropping moment, you get to see all of Andy, chopped up after he gets split in two walking on his hands. In the original version, you just see a glimpse of him as his blood drips onto the magazine, but now, you see his blood, his legs severed, and much more. I would say this alone makes the purchase worth it. Answer to the question: Shelly",
         "I liked this sequel. Yes, it's stupid, but it's a guilty pleasure thing. A van load of stupid twentysomethings head up to Crystal Lake for the weekend for no other purpose than to smoke pot and screw each other cross eyed. Among them are the painfully unattractive Shelly who enjoys immature practical jokes, a newly pregnant girl, a hippie couple who are constantly ensconced in a cloud of pot smoke and the emotionally damaged Chris, who loves Crystal Lake but has terrible memories of it. It seems that, some time ago, Chris was attacked in the woods by a man with a terribly deformed face. During the attack she passed out and woke up the next morning, safe in her own bed at home. She is not entirely convinced that it was all a dream, and so decides that a weekend at her former haven may just be what she needs to deal with the past. Unfortunately, it was not a dream, as all of us already knew. The man who attacked her was Jason Voorhees, and no sooner do the kids settle in and start partying and screwing than he shows up, ready for some post-coital killings. First to go is an obnoxious trio of motorcycle thugs who harassed our heroes. Then Jason gets right down to what he does best - stabbing, skewering, bisecting and impaling anyone who is stupid enough to wander off alone and wait for him to approach. Still, I liked this movie. Jason finally gets to don his signature hockey mask in this one, and I love the ending, when the rotted remains of Mother Voorhees rise from the lake in a nod to the first films shock ending. I'm still not sure how Mother Voorhees got her head back on, but who cares? This isn't a movie you're supposed to think about too much. I also love Jason's unmasked face in this one. A friend of mine succinctly pointed out the fact that he looks like the banjo player from Deliverance all grown up. A scene at films end when his deranged piggy face appears in a window is actually rather shocking. Dana Kimmel does as good a job as she can with the character of Chris, although Chris is not given a whole hell of a lot to do other than scream, act like a whiny wimp and run. Yeah, this movie is stupid, but its harmless fun. It's not as bad as some of the sequels that followed it, believe me.",
         "Last night, the Cameo Cinema in Edinburgh, screened an ultra-rare showing of Friday the 13th Part 3 in all it's gore-splattered 3D glory. The cinema was packed, the screening sold out and the audience absolutely loved it. Every scare worked, the 3D effects leaped right off the screen and lovingly poked us in the eye and when the film was over it got the longest applause I've ever seen a film get. For those pretentious cynics who think that the Friday the 13th films are not great then there's nothing like a 350+ audience to prove you wrong. Since this film was in 'polarised' 3D (see-thru glasses instead of a red-blue blur)then it's not possible to transfer the effect to DVD. Besides, nothing beats seeing this on the big screen with Jason's face 10-feet tall and his massive hands reaching out for you. If there is EVER a 3D screening of this then you really ought to go see, even if you have to sell your own grandmother for a ticket.",
         "I remember first viewing this \"Friday the 13th\" sequel on videotape, and in the beginning I thought it was stupid. But now, after seeing it again on DVD, I have changed my mind about the movie. It isn't that bad. The film starts with a recap of the last scene from Part 2, where Jason is seen getting up after he is assumed dead. Then the movie begins, with a funky and upbeat 80's background song starting the film. Right after the song ends, Jason begins his killing spree, starting with two unsuspecting store owners, and then moving on to unsuspecting teens at a small farm area... The thing I like about this movie is the fact that Jason first gets his trademark hockey mask in this movie. The mask is a big improvement over the sack from part 2, and makes Jason look much scarier. Another good thing about this movie is Dana Kimmell. Although her lines & dialog in the film are somewhat cheesy at some points, her character is very convincing as the teen heroine. And whenever she's frightened, she screams the cutest scream ever. I loved how she screamed in the film; she was cute and funny at the same time! A bad part of the movie is the fact that the rest of the characters are unlikable. The teens are generally stupid and naive, and the biker gang are very mean-spirited. Those characters are so unlikable that you will really want Jason to kill them all. Another bad thing: Some viewers might be disappointed that they cannot see the film in its actual 3D format. I myself would have liked to see the movie's 3D effects. Overall, Dana Kimmell and Jason save the movie from being bad. You have to hear Dana's screams to know how cute she is. And you must watch this movie in order to know how Jason gets his hockey mask. I give this movie a 7/10.",
         "dont ask me why, but i really really enjoyed \"f13:part3\". even though it can be cheesy, it also has some great scares and terrifying chills. part 3 doesnt really depend on \"on-screen\" blood and guts, its more about the killer watching and waiting and not going around cutting peoples heads off and blood splattering on the walls. part 3 is also famous for introducing jasons hockey mask. to me, part 3 is A MASTERPIECE. ITS THE BEST 3RD MOVIE TO EVER BE MADE FOR ANY MOVIE SERIES...",
         "\"Friday the 13h part III\" starts immediately after the events of part II where at the end, Jason gets macheted in the shoulder. At dawn, police finds the dead bodies of 8 counselors spread over the camp, they also give medical attention to the lone survivor Ginny Field (it's presumed that Jason killed Paul). After a recap footage of the ending of the previous film, we see a scene where Jason recovers from the injury and escapes after Ginny and Paul leave his cabin in the woods. This time Jason leaves Camp Crystal Lake and heads to an unknown destiny, which later turns to be \"Higgins Haven\". On his way to the haven Jason murders Harold and Edna (the owners / attendants) of a rural K-Mart like store. This time Jason's unlucky victims include Chris Higgins (owner of the haven), Rick, Chuck, Chilli, Shelly, Debbie, Andy, Vera, and a gang of motorcycle bikers: Ali, Fox, Loco. Highlights of the movie: Jason and the bikers, Chris revealing to Rick about her previous encounter with Jason (not knowing it was him), Chuck watching Jason thinking it's a hallucination, Andy's death, and of course , Jason getting his trademark mask; and at last but not least the great funky groovy opening theme. This tune added some humor to the tension felt towards the beginning of the carnage. \"Friday 3\" came in the right moment when the slasher genre was at it's peak. After the box office success of part 2, this sequel was a coming on. This movie has plenty of gore, suspense, and some good scare scenes. The acting is regular, the best performance comes from Dana Kimmell. Jason looks menacing, big, and surely very angry. Richard Brooker portrayed Jason in a good way, he knows how to act violent and looks like he's blood thirsty. This time the teens aren't as smart as in the previous film, still I liked some of them. Shelly was a good character, although he was annoying you felt sorry for him at the end. Rick was an unlikeable character, he seemed tough but in the end he couldn't even fight Jason. Debbie's pregnancy was overlooked, I guess that Jason didn't know he killed an unborn. What the heck, even if he knew about it he would still kill Debbie. Andy's death is by far the best in the movie, and one of the best s in the series. Chuck and Chilli (who aren't exactly teens) had potential, but in a 90 minute slasher movie you can't get much character development. The gang situation was unnecessary, I mean there was a lot of hype about a possible confrontation between these guys and Jason. The ending of the movie is great! The chasing scene is the best in the series (even better than part 2's). Jason seemed angry and desperate to kill Chris, who wasn't by no means braver than Ginny but still manged to give some fight to Jason. Unmasked Jason looked frightening, specially if you consider that Jason's unmasked look from part 2 wasn't that creepy at all. Unlike the Jason from part 2 this Jason seems to be invincible, the producers probably wanted to create a Jason that would impose respect, and create fear among the other characters. Miner's direction is still good. This is where part III didn't improve from the 2nd. movie. Miner's job in part 2 is magnificent, probably the best (apart from part VI) in the series. Still, Miner shows his talent in creating a scary, and dark setting. \"Friday the 13th part III:3D\" is a good horror movie, the 3rd. installment in the series is worth a rental for horror fans and if you are a die hard of the series -like me- then you should buy it even IF it isn't the uncut version on DVD. I'm sure that this movie is more effective in the fear factor if you watch it on 3-D. Sadly, it isn't available in that format. Give a try to this flick even if you're not a Friday the 13th fan, it's surely a great slasher flick. Not the best in the series but delivers some good scares, gore, a cool theme, and a hockey masked Jason!. 4/10 8/10 in the Friday the 13th scale.",
         "Obviously, no \"Friday the 13th\" film is going to be Oscar material. You have to judge a film based on what it set out to do, and decide whether it met that goal or not. I don't think it's fair to judge these films by the same criteria as \"The Godfather\" or something. If you go into this movie just expecting to have fun, you won't be disappointed. The story is essentially the same as every other \"Friday\" film, with a minor twist: this time it takes place on a little ranch owned by one of the main characters. Jason, fresh off his killing spree in part 2, makes his way across the countryside to find a new batch of hormonal kids vacationing at Crystal Lake. Of course, this time it looks nothing like the Crystal Lake from the previous two films, seeing as it was filmed on a ranch in California instead of New Jersey, but oh well. The kids are all walking stereotypes--pretty much the only way to give them any characterization in a 90-minute movie that has to dispatch one of them every ten minutes. There's a pair of stoners that look older than the rest of the cast and make you question what they're even doing there, a hefty practical joker, and a couple expecting a baby of all things. But they all manage to be likable enough, and thankfully there is no one irritating enough to make you wish they would die already. There is no \"mean girl\" or \"jerk\"; they all seem to be friends, which is nice. Jason gets his hands on the famous hockey mask in this installment, courtesy of one dead joker. The kills are the most creative in the series thus far, obviously taking advantage of the original 3D format this was released in back in 1982: one character's eyeball pops out at the screen in what must have been a pretty cool gag in 3D, an unlucky guy doing a handstand gets split in two, and a harpoon gun is put to deadly use. The highlight of the film is the chase sequence in the final act. The \"Friday\" films are known for some of the most entertaining chase scenes, and this one is no exception. It starts out in a cabin and goes all over the place from there, with Jason pursuing our terrified heroine relentlessly. Jason is actually creepy in this film--some form of degenerate who runs (not walks) after his victims with something approaching excitement. Wait until you see him unmasked later in the film--clearly he is not feeling burdened by his work. This is a perfect movie to put on with friends. It's entertaining, fun, and you'll have a blast watching these goof-balls bite it in interesting ways. You'll laugh at the dialogue, chuckle at some of the acting, and jump at some of the scares. So order a pizza, grab some beer, and just sit back and enjoy.",
         "The last of the scary ones, \"Friday the 13th Part 3: 3D\" is one of the best in the series. The plot does have some holes in it and sometimes the acting leaves a lot to be desired, but the interesting component of the film is its use of 3-D. Don't let the 3-D aspect fool you into thinking the movie is bad (as in \"Jaws 3-D\" & \"Amityville 3-D\"). The film is great; as far as these type of slasher flicks go. Highly recommended.",
         "I've seen my share of movies in 3D but they were ok. \"Friday The 13th\" in 3D was so cool and when they showed this movie in the theatre about 3 or 4 yrs. ago well I went to see it and it was so neat to see it on the big screen. I wish they would make more movies in 3D because I liked them so much especially horror movies like this one.",
         "Although this installment was not too original, I thought it stood out from the others. If you watch the series in order, this is the first time the victims are just vacationing teenagers and not camp counselors. I also thought the character developement was better than the first two (yes, I know \"character developement\" and \"slasher movies\" aren't birds of a feather, but I though it worked in this particular slasher). I actually became attached to some of the characters and didn't want them them to die. Most people, however, think the time spent developing characters slowed the pace and made the movie boring. This was also the first Friday the 13th movie to have it's climax in a barn. I thought the fact that it took place on a ranch was kind of neat, I was getting kind of tired of camp. Most of the death scenes were original, the gore level was average, not a whole lot of suspense (but what do you expect? This is Friday the 13th, not The Sixth Sense), but the characters were really cool. It had some continuity errors with the previous movies, so I'm deducting one point. 9 out of 10."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Georgetown Productions Inc.",
         "Jason Productions"
      ],
      "summaries": [
         "Jason Voorhees, having barely survived a wound to his shoulder from his own machete, is back to revenge on all that visit \"his\" woods. A new group of friends come over to party at an area close to the campsite. This time, Jason will be stronger than ever, and getting a hockey mask from one of those friends.",
         "Jason Voorhees goes to a roadside store where he gets a new set of clothes, and stalks a married couple. Meanwhile, Chris Higgins and her friends make their way to her family cabin, Higgins Haven. But this time, Jason, with his new famous hockey mask will not let the teenagers have fun. Once again, he starts in a killing spree.",
         "Friday the 13th Part III once again follows murderer Jason Voorhees, who as a child drowned off the waters of Camp Crystal Lake. Is there anyone that can put an end to Jason's murderous rampage?",
         "Having revived from his wound, Jason Voorhees; now donning a new appearance, refuges at a cabin near Crystal Lake. As a group of co-eds reside there for their vacation, Jason continues his spree."
      ],
      "budget": 4000000
   },
   "movielensId": 1976,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-08-13",
      "dvdReleaseDate": "2004-10-05",
      "directors": ["Steve Miner"],
      "runtime": 95,
      "movieId": 1976,
      "title": "Friday the 13th Part III",
      "mpaa": "R",
      "actors": [
         "Dana Kimmell",
         "Paul Kratka",
         "Tracie Savage",
         "Jeffrey Rogers",
         "Catherine Parks",
         "Larry Zerner",
         "Rachel Howard",
         "David Katims",
         "Nick Savage",
         "Gloria Charles",
         "Kevin O'Brien",
         "Richard Brooker",
         "Steve Susskind",
         "David Wiley",
         "Perla Walter",
         "Anne Gaybis"
      ],
      "imdbMovieId": "0083972",
      "originalTitle": "Friday the 13th Part III",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "JUhwcjw9ozg",
         "yjfKAxl180c",
         "bSQWGng6iJc"
      ],
      "plotSummary": "An idyllic summer turns into a nightmare of unspeakable terror for yet another group of naive counselors. Ignoring Camp Crystal Lake's bloody legacy, one by one they fall victim to the maniacal Jason who stalks them at every turn.",
      "tmdbMovieId": 9728,
      "avgRating": 2.19348,
      "releaseYear": "1982",
      "numRatings": 1548,
      "posterPath": "/5wg2NZyIhcMbIBAahBODXHyJ54S.jpg"
   }
}