{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lake",
            "id": 1889
         },
         {
            "name": "resurrection",
            "id": 6506
         },
         {
            "name": "morgue",
            "id": 10326
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "jason vorhees",
            "id": 179422
         },
         {
            "name": "hitchhike",
            "id": 206977
         }
      ],
      "imdb_id": "tt0087298",
      "video": false,
      "title": "Friday the 13th: The Final Chapter",
      "recommendations": [
         9728,
         9731,
         10281,
         10225,
         10283,
         9725,
         10285,
         4488,
         11470,
         11357,
         11361,
         11281,
         10987,
         10160,
         11442,
         11284,
         10131,
         11675,
         10676,
         11596
      ],
      "backdrop_path": "/vI1XbNXhPdqgvFK9wJ1eAll9VPx.jpg",
      "revenue": 32980880,
      "reviews": [{
         "author": "John Chard",
         "id": "57bd084ac3a368226c00be7d",
         "content": "You got the curse? \r\n\r\nWell we all thought Jason was dead, as he is here taken to the morgue after being mortally killed... But of course he revives and sets about establishing that he is in fact an indestructible killing machine. I wouldn't want to be living near Camp Crystal Lake right now...\r\n\r\nIn truth it's a good old 1980s slasher pic, but that doesn't necessarily make it worthy to anyone outside of the hardiest of hardest Friday13th franchise fans. The kills and gore quotient are high, bloody and gooey, with the kills not lacking for invention, but plot formula is tired and weary. Crispin Glover makes for something of a curio appearance in the piece, whilst a young Corey Feldman rocks up for a bit of Damien Thorn channelling.\r\n\r\nSome series fans love it whilst others abhor it. Question is? We know it wasn't to be the final chapter after all, so how does it hold up against the others that would follow it down the bloody intestine strewn path?",
         "url": "https://www.themoviedb.org/review/57bd084ac3a368226c00be7d"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Trisha 'Trish' Jarvis",
               "gender": 1,
               "credit_id": "52fe4523c3a36847f80be969",
               "name": "Kimberly Beck",
               "profile_path": "/wt7KIBun88QLlxlXnPj7Tp9lwkB.jpg",
               "id": 2174,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rob Dier",
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be96d",
               "name": "Erich Anderson",
               "profile_path": "/t56ZBN67R70Z0I9Jo6P9iALN2Q4.jpg",
               "id": 58813,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tommy Jarvis",
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be971",
               "name": "Corey Feldman",
               "profile_path": "/odE8az9kgHCkWMtWzfmcDBuZiww.jpg",
               "id": 3034,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sara",
               "gender": 1,
               "credit_id": "52fe4523c3a36847f80be975",
               "name": "Barbara Howard",
               "profile_path": null,
               "id": 58814,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Jimmy Mortimer",
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be9a9",
               "name": "Crispin Glover",
               "profile_path": "/thA5rOv5XE1oFpxD9DSp0tDrIIR.jpg",
               "id": 1064,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Samantha",
               "gender": 1,
               "credit_id": "52fe4523c3a36847f80be9ad",
               "name": "Judie Aronson",
               "profile_path": "/q30tWo0p0NbJAE9gQ54T2NTCCiT.jpg",
               "id": 72541,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Doug",
               "gender": 2,
               "credit_id": "539b6c6e0e0a264526001e8d",
               "name": "Peter Barton",
               "profile_path": "/8ozl7XVYTwprddeyI1J19QMg5pP.jpg",
               "id": 59442,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Paul",
               "gender": 2,
               "credit_id": "539b6c900e0a26444500044e",
               "name": "Clyde Hayes",
               "profile_path": null,
               "id": 72462,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Ted",
               "gender": 2,
               "credit_id": "539b6ca90e0a264445000451",
               "name": "Lawrence Monoson",
               "profile_path": "/2xLX3v0eEUH2xbUzWLZYEOdvmJg.jpg",
               "id": 106752,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Mrs. Jarvis",
               "gender": 1,
               "credit_id": "539b6cbf0e0a2645080020bc",
               "name": "Joan Freeman",
               "profile_path": "/eoiFe5Tlsj6vnSLRIRXVdBck7Y6.jpg",
               "id": 21458,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Tina",
               "gender": 1,
               "credit_id": "539b6ce40e0a264526001e91",
               "name": "Camilla More",
               "profile_path": "/zXiGBX419SiyOVddSo1n5P7lnvm.jpg",
               "id": 22050,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Terri",
               "gender": 0,
               "credit_id": "539b6cf80e0a264445000454",
               "name": "Carey More",
               "profile_path": "/x5chL40drqDqkfSSjR6JkQD7huv.jpg",
               "id": 563576,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Jason",
               "gender": 2,
               "credit_id": "54fb46d9c3a368693b001be2",
               "name": "Ted White",
               "profile_path": "/8QRpdCAVm1WPFpcOahA6O6iNM9f.jpg",
               "id": 176475,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be97b",
               "name": "Frank Mancuso Jr.",
               "profile_path": null,
               "id": 49284,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be981",
               "name": "Barney Cohen",
               "profile_path": null,
               "id": 58816,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be987",
               "name": "Bruce Hidemi Sakow",
               "profile_path": null,
               "id": 58817,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be98d",
               "name": "Victor Miller",
               "profile_path": null,
               "id": 38685,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be993",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be999",
               "name": "João Fernandes",
               "profile_path": null,
               "id": 58818,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4523c3a36847f80be99f",
               "name": "Joseph Zito",
               "profile_path": null,
               "id": 64195,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4523c3a36847f80be9a5",
               "name": "Joel Goodman",
               "profile_path": null,
               "id": 64196,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.513035,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9730,
      "vote_count": 310,
      "budget": 2600000,
      "overview": "After the Crystal Lake Massacres, Jason is pronounced dead and taken to the hospital morgue, where he is mysteriously revived, allowing his diabolical killing spree to continue at the camp where the gruesome slaughtering began. But this time, in addition to terrified teenagers, he meets a young boy named Tommy who has a special talent for horror masks and make up, leading up to a horrifying, bloody battle! Has Jason finally met his match?",
      "similar": [
         10285,
         4488,
         10781,
         1696,
         9728,
         39874,
         10281,
         2832,
         948,
         12521,
         984,
         5486,
         12662,
         10092,
         274,
         30833,
         1991,
         4232,
         1949,
         1359
      ],
      "original_title": "Friday the 13th: The Final Chapter",
      "runtime": 91,
      "poster_path": "/p5wiO9KgZH78Kvo1L6dPz8uECJ9.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Friday Four, Inc.",
            "id": 93280,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1984-04-13",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/c7pMKwv5NzIN6N3KM4L8fYMTtPw.jpg",
         "name": "Friday the 13th Collection",
         "id": 9735,
         "poster_path": "/uobgqpLQff9WvxGKE2OSvXv1RHm.jpg"
      },
      "tagline": "Jason's Back, and this is the one you've been screaming for.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joseph Zito"],
      "runtime": 91,
      "synopsis": "The day after the events of Friday the 13th Part III, police and paramedics are busy cleaning up the mess deformed mass murderer Jason Voorhees left at Higgins Haven, including the defeated hockey-masked killer himself. Two paramedics deliver Jason's corpse to the Wessex County morgue. But afterwords, it turns out that Jason is still alive. He rises, kills morgue doctor, Axel (Bruce Mahler), by slicing and breaking his neck with a hacksaw and then kills Nurse Morgan (Lisa Freeman) with a stomach stab, and heads back to Crystal Lake. Meanwhile, a group of friends named Paul (Alan Hayes), Samantha (Judie Aronson), Sara (Barbara Howard), Doug (Peter Barton), Ted (Lawrence Monoson), and Jimmy (Crispin Glover) have rented a house on Crystal Lake. On the way there, the group passes Mrs. Voorhees' tombstone and a female hitchhiker (Bonnie Hellman), after the group drives off the hitchhiker becomes Jason's next victim, stabbed in the throat while eating a banana. Next to the rental house is the Jarvis home. The group meets 17-year-old Trish Jarvis (Kimberly Beck) and her 11-year-old younger brother Tommy (Corey Feldman) when they arrive. The teenages have an evening and night of fun which nothing happens. Trish wants to go over to the house where the group is, but her mother (Joan Freeman) forbids her from doing so. Tommy, a video game addict, spends the evening in his room playing Atari games and making latex masks as his hobby. The next day, the group befriends two British-accented twin teenage girls Tina (Camilla More) and Terri (Carey More), who live in the area, and they all go skinny dipping at Crystal Point. Trish and Tommy, driving by, stop to see who's at Crystal Point and the group invites Trish to a party that night. Trish's car breaks down a bit further along the road, and they are helped by Rob (E.Erich Anderson), a hiker with mysterious reasons for visiting Crystal Lake, who soon becomes good friends with Trish and Tommy. Next door, the kids are enjoying themselves by dancing and listening to music. With four girls and four boys, each now has a date. However conflict ensues as some of the kids switch dates. These conflicts prove to be the least of their troubles as Jason predictably stalks and kills them one by one. Samantha goes out skinny-dipping and is impaled from under a raft. When Paul goes out to be with her, he finds her nude dead body in the raft and while swimming back to shore, he is stabbed in the groin with a spear. When it begins to rain, Terri decides to leave early and is about to get on her bicycle but has a spear rammed into her back. After having sex with Tina, Jimmy decides to celebrate with a carefree bottle of wine. While searching for a corkscrew in the kitchen, Jason emerges and slams the corkscrew into Jimmy's hand and then drives a meat cleaver into his face. Upstairs, Tina looks out the window where she is grabbed and thrown two stories down landing on the car. While a stoned Ted watches vintage 1910s stag films, he gets too close to the projector screen and is stabbed in the head with a kitchen knife though the screen from the other side. After Doug and Sara finish making love in the shower, Jason attacks Doug and crashes his head against the shower tile. He then kills Sara by driving an axe through the front door when she tries to escape. At the Jarvis house, Trish and Tommy find their mother missing, so Trish goes to Rob for help. Rob explains that he's looking to get revenge for the death of his sister, Sandra Dyer (killed by Jason in Part 2). Trish and Rob take Gordon (the Jarvis family dog) next door to see what's going on. Tommy is left at home, and finds Rob's newspaper articles about Jason. At the house, a frightened Gordon jumps though a second story window and flees. Jason kills Rob, and Trish flees back to her home intending to warn Tommy. After a long chase in and between the houses, Tommy shaves his head and makes himself up to look like Jason, which is effective in distracting Jason long enough for Trish to be able to attack him with his machete. She just misses him, but manages to knock the hockey mask off his face. Horrified by Jason's appearance, she drops the machete to the floor. Tommy picks it up and swings it at Jason's head. Jason then falls to the floor, causing the machete to dig further into his head. As he embraces his sister, Tommy sees Jason begin to move, loses control and, hacks Jason repeatedly with the machete, while Trish screams his name. The final scene of the film has Tommy visiting Trish in the hospital, and they embrace as they believe their nightmare is over, with a bizarre shot of Tommy psychotically looking towards the camera.",
      "writers": [
         "Victor Miller",
         "Ron Kurz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0087298/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzU1NTA3ODQzOV5BMl5BanBnXkFtZTcwMzQwOTM4OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Erich Anderson, Judie Aronson, Peter Barton | See full cast and crew »"],
      "reviews": [
         "I'm a firm believer that horror movies should be judged as horror movies, and not compared when reviewed to films such as The Godfather, and as far as horror films go, this one could easily be the Godfather of em all. Following closely in the tradition of the previous three Fridays, The Final Chapter places Jason smack dab in the middle of two isolated cabins deep in the woods, one occupied by a group of fun loving teenagers and the other by a peaceful lakeside family. Well of course the violence and gross fun is plenty, but what really sets this film apart from a lot of horror flicks and almost all of the Friday the 13th films is it's tone, quality and over all entertainment level. Director Joseph Zito has a sharp eye for detail and Splatter Master Tom Savini sure does send Jason out with a bang. Of course this ended up NOT being The Final Chapter, unfortunately it should have been. After this entry the series really started to go down hill. If your in the mood for a good old fashion 80's slasher flick, this one's for you.",
         "Savini's death make-up and Jason effects are at their peak. worth watching for tommy's freak out at the end. Crispen Glover is in it, and performs the ultimate BAD 1980's dance scene, worse than anything in footloose. The body count reaches a great height and the nudity and sex is as gratuitous as ever. I personally feel that this is the best of the original 4 Friday movies, coming in a close race with the third Jason. I've seen all the movies more times than i can count and this one holds up surprisingly strong among all eleven films. For those of you who are Friday fans, if you haven't seen this one, you are missing out on a key moment in Jason's history, so go pick this one up today.",
         "Friday The 13th Part IV: The Final Chapter is no where near the final chapter, but it is my favorite Friday movie. Jason, presumably dead after the events of Part III, is sent to a coroner. But Jason, of course, is far from dead. So after he heads back to Crystal Lake, the unsuspecting teens who are drinking, skinny dipping, having premarital sex, etc. are in for it. The Jarvis family, residents to Crystal Lake aren't safe either. There might only be one person who can stop Jason's rampage, and that is young Tommy Jarvis, played by Corey Feldman. Friday The 13th Part IV isn't that different from any other Friday movie, it follows the same basic formula most of the others have. The acting is bad, but that goes without saying. Jason is at his prime, he's big, he's bad, and he is ready to slaughter whoever he wants. The direction for this movie is probably the best in the series, it was definitely impressive. The direction is one of the reasons why this movie is my favorite Friday movie. Another reason is that the killings are probably the best in the series. The writers got very creative for how Jason was going to kill and scare his victims. Any Friday The 13th fans and slasher flick fans will definitely want to see Friday The 13th Part IV: The Final Chapter. I give it a 9/10.",
         "Joseph Zito, the director hauled in to oversee this fourth installment, previously directed the wretched \"The Prowler\", the wooly but entertaining \"Invasion USA\", and would go on to direct the shot-in-South Africa \"Red Scorpion\" (with Dolph Lungren). Since \"The Prowler\" was such a stinker, it's hard to see how Zito got the job. Maybe he was a master romancer and could talk actresses out of clothes because this episode in the \"Friday\" franchise has more nubile nudity and panty shots than any previous entry. It is also the goriest since the original with Savini returning as the effects adviser. Jason is resurrected from gory pieces and returns to his old ways after a stint on a slab. He has a grudge for a particular family and must tangle with resourceful horror fan and pint-sized weirdo Tommy (Corey Feldman). Just as the nudity and short shorts levels are elevated, so is the suspense. Using \"The Prowler\" as a guide on not what to do in a slasher, Zito creates some genuine unease and keeps things moving at a fast and bloody clip. The Euro version of this film, which is the one I have, is gorier than the US version and sexier, too. The next installment proved to be one of the worst; so if you're going to subject yourself to one \"Friday\" sequel, choose this.",
         "I'd say this review was going to be a spoiler, but...well, to be honest, it's a slasher movie. You know how it's going to go. Friday the 13th: the Final Chapter features a small family made up of a relatively young mother, the movie's \"innocent\" girl, and a young video game player and mask-making prodigy (a young Corey Feldman) that lives out into the woods. A bunch of teenagers rent the house next door for a night of debauchery. Jason Voorhees, being a slasher, wasn't adequately killed last time, so he gets to come back now. The non-character teenagers in the house, like most people in this film, exist only to increase the body count and have no discernable character traits except for degree of sexual experience, which is enough to get them all killed by the end of the film, playing straight by the rules. This episode of Friday the 13th follows the slasher cliches to the letter, but the only times suspense is even attempted are during a few \"false scare\" scenes early in the movie and in the final chase sequence. The actual killings just aren't all that scary--Jason murders again and again. It's a badly shot, poorly lit, trashy fast-food slasher with wretched acting. You can pretty much not only call every death, but from time to time predict the exact manner of the death. As far as gore and T&A go, Friday 4 delivers, but in that \"fast-food\" style. As a result, it doesn't even hold a lot of fun for slasher fans. It reeks of lack of effort, and really wasn't entertaining as teen-killer fare goes. Avoid it--you'll find a slasher that does it with more style pretty easily.",
         "I know there are fans out there that feel the fourth installment in the Friday the 13th series is the best. I don't happen to agree. While the first three movies weren't necessarily groundbreaking in their innovation, there were moments in each that we had not seen before \u0096 at least in a Friday the 13th movie. By the time Paramount rolled out Friday the 13th: The Final Chapter in 1984, the 80s slasher-boom was in full swing. It was all but impossible to do anything new. Chapter 4 is one big cliché of the slasher genre and a rehash of everything that came before. This one follows the standard formula to a T - A group of idiotic kids go to the woods and for the first 2/3 of the film, we watch them behave like complete morons. Suddenly, and with very little build-up or suspense, Jason shows up and kills everyone in sight. In the end, the one person who seems most incapable of doing so \"kills\" Jason. The End. I think I wrote something just like this for the other Friday the 13th movies I've written about. So far, all I've done is blast Friday the 13th: The Final Chapter. To be fair, it's actually not that bad as far as these films go. Most of the credit for this should go to Tom Savini. His special effects are top notch and worth the price of admission. One of my favorite kill scenes in the movie occurs early on with the hospital attendant in the morgue. That head snap is nicely done.",
         "How many times do you have to stab Jason Voorhees before he dies? Apparently many times, because he returns yet again. This time a family (mother, son, daughter), a house full of teenagers, and a hunter (who happens to be the brother of a prior Jason victim) are the unfortunate ones to be in Jason's path. Is this, as the title suggests, the \"final chapter\"? Many people give this film a low rating, and maybe they're looking at it differently than I do. To me, you can make only so many movies of a guy hacking up teenagers before the idea gets a little stale. Part four (this film) is when the crew realized you could break up the monotony with a little humor. So now in part four you have a fair amount of laughs, some improved gore (compared to the first few films) and the same old formula of killing kids. You also have two key guest stars: Corey Feldman and Crispin Glover. You cannot play down the Feldman power here. Sure, he's young. But he really steals the show and watch his expressions when he finds some neighbors doing something naughty. Feldman's absence from this film would likely have lead to dullness and the premature death of the series. Glover, meanwhile, is the humorous aspect. Well, okay, not just Glover -- the whole opening scene with Axel the Coroner is morbidly amusing (and really anticipates part nine's coroner). But Crispin Glover is fun to watch, and his \"white boy dance\" is pretty amusing. The inclusion of character Rob Dier (brother of part two's Sandra Dier) is a good move, adding some continuity to the movie, further connecting it to the previous films. And for horror fanboys who like nudity (and you know you do), this is the episode that contains by far the most nudity in the series. For some people, that's all it takes to sell a picture. So I understand if people rank this film lower because they think it's getting stale or if the humor makes them think the creators aren't taking the series seriously anymore. As for me, that's what makes this one of my favorite episodes in the series (probably in my top three out of eleven films). We have a crew that just wants to have fun, and if we go along for the ride we have a little fun ourselves. Seems fair.",
         "After moving into a new house on Crystal Lake, a family finds the teens next door have attracted maniacal killer Jason Voorhees to the area and must band together to save each before falling victim to the masked killer. This one turned out to be among the better entries in the series and is probably only behind the original in terms of being the series' best. This one has a lot right, starting first-and-foremost with what is perhaps the greatest final chase in a series known for having good ones. This here is quite simply one of the best of the entire chase, with tons of sprawling action, chilling suspense, psychological tactics and even some jumps, culminating in one of the most notorious gore gags in the genre as a brilliant ending to such an excellent series of events. As well, there's a huge amount of blood and gore on display from the big body count that gets wiped out in pretty fun, graphic manners. Added together with a great smattering of suspense in some creepy, chilling stalking and set-up scenes and a huge heaping of nudity, this one gets a lot of stuff right as a slasher. There's still a few flaws here, mainly in the continued stupidity by the characters to want to invite themselves to a place that harbored a mass murder rampage the last few days before, considering each of these films takes place the following day, and there's no reason why that should be. As well, many of the supposedly funny character traits are just plain irritating, making that section of the film a little tough to get through when it's supposed to be funny but clearly isn't, yet these aren't anywhere near enough to knock this down from among the better slasher entries. Rated R: Nudity, Graphic Violence, Graphic Language, and a few sex scenes.",
         "The first four Friday the 13th movies are the best, by far. The next 7 films were half-baked money makers. And if you ask me, Paramount should have left it at this film. Part 4 combines action, horror, thriller, suspense, and even mystery. And the opening sequence is a combined amount of clips from the previous 3 films. The opening sequence explains the series quickly, so Part 4 is a great Friday the 13th film to start with. The film will have less appeal to fans of the similar series, Halloween. The Final Chpater may combine elements from the previous 3 films, but seems to steal ideas and share ideas with Halloween. Friday the 13th was inspired by Halloween, but at times it seems as too much. Overall, the film is the last Friday the 13th film you should watch.",
         "Friday the 13th: The Final Chapter starts as the authorities are cleaning up the dead bodies left by murderer Jason Voorhees (Ted White), he himself was supposedly killed & his body is taken to Wessex County Medical Center. Everyone thinks Jason is dead but they are wrong & it's not long before he has killed yet again & is on the loose looking for more victims. Six teenage friends, lovers Paul (Clyde Hayes) & Samantha (Judie Aronson), Doug (Peter Barton) & Sara (Barbara Howard) plus Ted (Lawrence Monoson) & Jimmy (Crispin Glover) have hired a log cabin out for the weekend in the Crystal Lake area & become prime targets for the hockey mask wearing homicidal maniac Jason Voorhees who has no intention of stopping his killing spree... Directed by Joseph Zito this was the fourth instalment of the highly successful Friday the 13th series of slasher films & there's a strong case to say that it could be the best one of them all. The script by Barney Cohen follows the same simplistic pattern as before but Friday the 13th: The Final Chapter manages to be a lot darker in tone & a lot more brutal than a lot of slashers before or since. The kills come thick & fast, there's never too long to wait before the next victim & the kills are nice & brutal. There's enough nudity to satisfy including a couple of cute twins, the teenage character's aren't that annoying for a change & as a whole the film works very well within the context of what it sets out to achieve. I really like the Friday the 13th series as a whole & this is definitely among the best of them if not the best outright. I liked it, a lot. Director Zito does a pretty good job, he keeps things moving along & manages to inject some tension & atmosphere to the film. The infamous hockey mask barely features in this one as Jason is kept as a killing machine & nothing more, he has no real character or likability in this one. The gore is strong in this one unlike other entries in the series which were cut to shreds, Jason hacksaws someones throat, people are stabbed, have meat cleavers stuck in their heads, people are impaled on various objects, someone has a knife plunged into the back of their head while someone else has a knife stuck through their throat & Jasons death in this one is great thanks to some top special effects by Tom Savini. With a supposed budget of about $1,800,000 Friday the 13th: The Final Chapter apparently made over $11,000,000 on it's opening weekend, now you know the reason why this wasn't the final chapter. Generally speaking it's well made & competent throughout. The acting is pretty good all round & better than one might expect from a film of this nature, even Cory Feldman didn't annoy me. Friday the 13th: The Final Chapter isn't art, it isn't going to win any awards & it's not going to change your outlook on life but it is just about the perfect slasher. An absolute must for Friday the 13th fans & those interested in the horror genre."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Georgetown Productions Inc.",
         "Sean S. Cunningham Films"
      ],
      "summaries": [
         "Thought to be killed by the sole survivor of the last massacre at Camp Crystal Lake, Jason Voorhees kills his way back to the camp to once again murder its inhabitants. This time, has Jason met his match in the little boy Tommy Jarvis?",
         "After the confrontation with Chris Higgins, Jason Voorhees presumed dead, is taken to the Wessex County Morgue. There he escapes killing an attendant and a nurse, making his way back to Camp Crystal Lake. Six teenagers rent a cabin next to the Jarvis' cabin in Camp Crystal Lake. Soon Jason finds his way to eliminate all who trespasses his way, but not for long. There are two survivors left, a girl and her little brother, Tommy Jarvis. The final battle will define their destiny, be prepared for the Final Chapter.",
         "After being mortally wounded and taken to the morgue, murderer Jason Voorhees spontaneously revives and embarks on a killing spree as he makes his way back to his home at Camp Crystal Lake."
      ],
      "budget": 1800000
   },
   "movielensId": 1977,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1984-04-13",
      "dvdReleaseDate": "2004-10-05",
      "directors": ["Joseph Zito"],
      "runtime": 91,
      "movieId": 1977,
      "title": "Friday the 13th: The Final Chapter",
      "mpaa": "R",
      "actors": [
         "Kimberly Beck",
         "Erich Anderson",
         "Corey Feldman",
         "Barbara Howard",
         "Crispin Glover",
         "Judie Aronson",
         "Peter Barton",
         "Clyde Hayes",
         "Lawrence Monoson",
         "Joan Freeman",
         "Camilla More",
         "Carey More",
         "Ted White"
      ],
      "imdbMovieId": "0087298",
      "originalTitle": "Friday the 13th: The Final Chapter",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "G3Ydoq0-HpU",
         "zBme5lOcZF4",
         "g1D-ELIc6t8"
      ],
      "plotSummary": "After the Crystal Lake Massacres, Jason is pronounced dead and taken to the hospital morgue, where he is mysteriously revived, allowing his diabolical killing spree to continue at the camp where the gruesome slaughtering began. But this time, in addition to terrified teenagers, he meets a young boy named Tommy who has a special talent for horror masks and make up, leading up to a horrifying, bloody battle! Has Jason finally met his match?",
      "tmdbMovieId": 9730,
      "avgRating": 2.27743,
      "releaseYear": "1984",
      "numRatings": 1458,
      "posterPath": "/p5wiO9KgZH78Kvo1L6dPz8uECJ9.jpg"
   }
}