{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lightning",
            "id": 952
         },
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "mask",
            "id": 2546
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "jason vorhees",
            "id": 179422
         }
      ],
      "imdb_id": "tt0091080",
      "video": false,
      "title": "Friday the 13th Part VI: Jason Lives",
      "recommendations": [
         10281,
         9731,
         10283,
         9730,
         9728,
         10285,
         9725,
         11470,
         11357,
         11361,
         4488,
         10987,
         11281,
         10160,
         11442,
         11284,
         10131,
         11675,
         10072,
         10014
      ],
      "backdrop_path": "/lxZxbLpg4JhGptq0CejbElATU98.jpg",
      "revenue": 19472057,
      "reviews": [{
         "author": "John Chard",
         "id": "587ba4dfc3a36846c300dc3f",
         "content": "Jason 6: Welcome To Camp Blood!\r\n\r\nAn absolute hoot of a addition to the Friday 13th franchise. As is often the way with the \"Friday\" sequels, you can talk to one horror fan and this is the worst of the bunch, talk to another and it's the best etc etc. There's a more airy touch here and it serves the formula well, which if the series' fans are honest, is a formula that was getting stale quite early in the chain, so any sort of new ideas or direction is most welcome. \r\n\r\nAfter a glorious James Bond parody opens the credits sequence, accompanied by Harry Manfredini's superbly thunderous musical score, we get long running tormented character Tommy, here played by Thom Matthews, digging up Jason Voorhees' corpse so as to make sure the evil one is dead - oh and to kill him again. Enter a glorious Frankenstein homage (cheeky steal if you like) that sets us up for another round of stalk and dismember as Jason heads back to Camp Crystal Lake, which is now called Camp Forest Green!\r\n\r\nThe kills are not particularly inventive, but there's a real thud of humour about much of them. From an American Express Card to a bloody smiley face imprint, it's clear the makers have a glint in their eyes. We even get an early appearance from Tony Goldwyn, some four years before Ghost would make him a known name. Adding to the quality score, which BTW rattles around home cinema speakers lie a supernatural entity, is Jon Kranhouse's cinematography, which is gorgeous in colour lens selections. All that and you get an Alice Cooper soundtrack as well. \r\n\r\nFrom joyful reanimation to a suitably watery finale, this part 6 delivers more than enough to almost make you rush out to rent part 7. Almost... 6.5/10",
         "url": "https://www.themoviedb.org/review/587ba4dfc3a36846c300dc3f"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tommy",
               "gender": 0,
               "credit_id": "52fe43459251416c7500a0c9",
               "name": "Thom Mathews",
               "profile_path": "/8wOkgEcqAeAlsglJXYiQruMGdFU.jpg",
               "id": 64198,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Megan Garris",
               "gender": 0,
               "credit_id": "52fe43459251416c7500a0cd",
               "name": "Jennifer Cooke",
               "profile_path": "/6GhWtRLnhcuKpYIDSaeQoK5I1pE.jpg",
               "id": 64199,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sheriff Garris",
               "gender": 0,
               "credit_id": "52fe43459251416c7500a0d1",
               "name": "David Kagen",
               "profile_path": null,
               "id": 64200,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sissy",
               "gender": 1,
               "credit_id": "52fe43459251416c7500a0d5",
               "name": "Renée Jones",
               "profile_path": null,
               "id": 64201,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Cort",
               "gender": 0,
               "credit_id": "52fe43459251416c7500a0d9",
               "name": "Tom Fridley",
               "profile_path": null,
               "id": 64202,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jason",
               "gender": 0,
               "credit_id": "52fe43459251416c7500a0dd",
               "name": "C.J. Graham",
               "profile_path": null,
               "id": 64203,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Darren",
               "gender": 2,
               "credit_id": "52fe43459251416c7500a105",
               "name": "Tony Goldwyn",
               "profile_path": "/asV7pfeMIzT8GFdA2gqBjAPGd6l.jpg",
               "id": 3417,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Nikki",
               "gender": 1,
               "credit_id": "52fe43459251416c7500a109",
               "name": "Darcy DeMoss",
               "profile_path": "/bporH7RHg4C5Bym2u3zwUmH0BjV.jpg",
               "id": 82956,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Katie",
               "gender": 1,
               "credit_id": "52fe43459251416c7500a10d",
               "name": "Ann Ryerson",
               "profile_path": "/A1PlH6dw01Eb5xkbqjtv4Wc6e7x.jpg",
               "id": 156587,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe43459251416c7500a111",
               "name": "Alan Blumenfeld",
               "profile_path": "/2ag56MvKkTuhGnUFgJza4hJZl8u.jpg",
               "id": 22053,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Allen Hawes",
               "gender": 2,
               "credit_id": "52fe43459251416c7500a115",
               "name": "Ron Palillo",
               "profile_path": "/7WCLYyPhPNgnSBzZRJ5rhXGLJLx.jpg",
               "id": 75352,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Paula Mott",
               "gender": 0,
               "credit_id": "58d08298c3a368674f0039e2",
               "name": "Kerry Noonan",
               "profile_path": null,
               "id": 1394114,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43459251416c7500a0e3",
               "name": "Tom McLoughlin",
               "profile_path": null,
               "id": 63550,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43459251416c7500a0e9",
               "name": "Don Behrns",
               "profile_path": null,
               "id": 15489,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43459251416c7500a0ef",
               "name": "Tom McLoughlin",
               "profile_path": null,
               "id": 63550,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43459251416c7500a0f5",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43459251416c7500a0fb",
               "name": "Jon Kranhouse",
               "profile_path": null,
               "id": 64204,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43459251416c7500a101",
               "name": "Bruce Green",
               "profile_path": "/yplxWPVgwK1b33AjvbhM9mWX2Aw.jpg",
               "id": 12970,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.402396,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10225,
      "vote_count": 271,
      "budget": 3000000,
      "overview": "Determined to finish off the infamous killer Jason Voorhees once and for all, Tommy Jarvis and a friend exhume Jason’s corpse in order to cremate him. Things go awry when Jason is instead resurrected, sparking a new chain of ruthlessly brutal murders. Now it’s up to Tommy to stop the dark, devious and demented deaths that he unwittingly brought about.",
      "similar": [
         948,
         39874,
         10285,
         44247,
         10781,
         1696,
         10283,
         10281,
         2832,
         12521,
         371608,
         984,
         10665,
         4488,
         13570,
         5486,
         12662,
         10092,
         274,
         67087
      ],
      "original_title": "Friday the 13th Part VI: Jason Lives",
      "runtime": 86,
      "poster_path": "/6vdUpHvkspQonXBdWcLWW5ciEPJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1986-08-01",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": "/c7pMKwv5NzIN6N3KM4L8fYMTtPw.jpg",
         "name": "Friday the 13th Collection",
         "id": 9735,
         "poster_path": "/uobgqpLQff9WvxGKE2OSvXv1RHm.jpg"
      },
      "tagline": "Kill or be killed!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tom McLoughlin"],
      "runtime": 86,
      "synopsis": "Superhuman serial killer Jason Voorhees has been dead and buried for six years. However, Tommy Jarvis, who killed Jason in self-defense when he was 12 years old, is still haunted by his encounter, resulting in his having been institutionalized for an extended period of time. Intent on cremating Jason's body to rid himself of his demons, Tommy escapes the mental hospital with his friend, Hawes, and breaks into the cemetery containing Jason's grave. He and Hawes exhume Jason's casket, but before they can cremate the body, an infuriated Tommy begins stabbing it with a steel fence post. The post acts as a conductor for an ongoing lightning storm, and Jason is resurrected from the dead. He kills Hawes with a punch through the heart and throws his body into the exhumed coffin, prompting Tommy to flee the cemetery. Tommy returns to the town of Crystal Lake, the site of Jason's killings, which has now been renamed Forest Green to distance itself from negative publicity. Tommy attempts to warn the town arrogant sheriff, Mike Garris, of Jason's return, but Garris, aware of Tommy's institutionalization, writes him off as disturbed and has him locked in a holding cell. Meanwhile, Jason begins a trek back to the lake that was the site of his drowning as a child. En route, he encounters Lizabeth and Darren, a pair of summer camp supervisors, who are themselves headed to the lake to supervise the re-opening of the summer camp. Jason attacks and kills them, leaving their bodies in the woods. The next morning, Sheriff Garris's daughter, Megan, who is slated to be one of the camp counselors, arrives with her fellow counselors Cort, Sissy, and Paula to report Lizabeth and Darren missing. Tommy cites their disappearance as evidence of Jason's return, but is met with hostility from everyone but Megan, who takes a liking to him. Sheriff Garris sends the counselors off to the campsite and then escorts Tommy out of town; en route, Tommy flees to the cemetery to try and show Garris the open grave, only to discover that the groundskeeper, fearful of being implicated for digging up the grave due to his alcoholism, has covered the grave (and, consequently, Hawes's body) with dirt. Garris handcuffs Tommy and takes him to the city limits, warning him not to return. Meanwhile, a quintent of business people playing paintball in the woods are set upon by Jason, who kills them and steals their supplies. That night, Jason continues making his way back to Crystal Lake, in the process killing the grave digger and a nearby couple having a picnic. Cort meets up with a local girl, Nikki, and leaves the camp to have sex with her in the woods; they end up in Jason's path and are both killed by him. Sheriff Garris ultimately finds the bodies, and believes that Tommy has killed them, living out a delusion of Jason's return. Tommy, meanwhile, has contacted Megan, having figured out a way to defeat Jason after having read books on monsters and folklore: He can be incapacitated by being trapped beneath the surface of the lake where he drowned. Megan attempts to bring Tommy back to the camp, but they are intercepted by one of Garris's roadblocks. Tommy is arrested and Megan is escorted back to the police station to await her father's return from the field. The police's attention on Tommy permits Jason to slip into the summer camp, where he kills Paula and Sissy, but refrains from harming any of the children. Megan and Tommy escape the police station and make it to the lake, where the pursuing police are forced to acknowledge Jason's return when he attacks them. Garris and his deputies briefly incapacitate Jason by shooting him with high caliber weapons, but Jason ultimately recovers and kills them all. He then attempts to kill Megan, but is distracted by Tommy, who beckons to him from the lake. Seemingly remembering Tommy, Jason abandons Megan and wades out to the lake, where Tommy ambushes him with a chain attached to a large boulder. A fight ensues, during which both Tommy and Jason are knocked into the water; as Tommy attempts to swim to the surface, Jason pulls him underwater and he loses consciousness. Megan swims out to save Tommy and is likewise attacked by Jason, but finally incapacitates him by driving a motor boat propeller into his head. Back on land, Megan revives Tommy with CPR and the children celebrate. At the bottom of the lake, Jason floats, attached to the boulder, still alive but powerless to escape.",
      "writers": ["Tom McLoughlin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091080/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1MjY1NTQ0N15BMl5BanBnXkFtZTYwODg1Mjc4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Thom Mathews, Jennifer Cooke, David Kagen | See full cast and crew »"],
      "reviews": [
         "From its spectacular, squirm-in-your-seat opening to its exciting finale, \"Friday the 13th Part VI: Jason Lives\" delivers. Still haunted by his killing of the masked maniac two films ago, our hero Tommy Jarvis (Thom Mathews) ventures to Jason Voorhees' grave just to be sure he's really dead. When a lightning bolt strikes the metal fence post Tommy uses to puncture the corpse, Jason is resurrected (remind you of someone?) and ready to hack his way through another terrified group of campers and innocent bystanders. But with no one ready to believe that Jason is indeed back, it again falls to Tommy to put evil in its place. The \"Friday the 13th\" series got back on track with this installment following a Jason-less fifth entry that remains a bitter disappointment for many horror buffs. Director Tom McLoughlin struck a magnificent balance between breathing a new life into the franchise and maintaining the look and feel of what fans have come to expect. The picture is fast-paced, smart and, at times, legitimately scary. Jason suddenly seems more evil and terrifying given his newfound strength as a member of the Walking Dead Club. McLoughlin's oft-praised attempts at humor are rarely successful, but at least he chose (wisely) not to mock the zombified star, as the most recent Jason films have. \"Friday the 13th Part VI: Jason Lives\" is not Hitchcock, but it is a highly-entertaining effort that never once reveals its low-budget limitations. Horror fans and those looking for a good scare will be pleased.",
         "With the exception of part 9, ALL of the \"Jason\" movies just keep getting better! In my honest opinion, this sequel comes in third as far as Jason \"sequels\" go (ps:part 1 will always rule) and this sequel comes in right after parts 2 and 4. Part 1 is simply a classic. Director/Writer Tom McLoughlin has literally recreated Jason after the turn of events in part 5, replacing the character's once-human figure from parts 2-4 with a better, more menacing, grosser, unkillable, zombie-like figure. In this installment, it seems that Jason has stopped chasing his victims and has become a little more quiet and subtle about his \"kills\". Most of all, McLoughlin really makes \"Jason Live\" in this movie. Jason thrives!! McLoughlin, in my opinion, has directed what is probably the most \"scary\" Jason of them all. I've seen them all a hundred times, and I still jump when he appears in the window in front of Sissy. The acting is extremely acceptable from its predecessors, especially the roles of Tommy Jarvis (Thom Matthews) and Sheriff Garris (David Kagen). Even the camp counselors liven up their roles a bit. Though it was inevitable for them to be slaughtered, I still thought that it was cool that I still remember their characters. There is just something about this one. Jason Lives has an excellent story line that delivers, however, the gore is relatively low at certain times, but McLoughlin never fails to bring it all back with shots of that very very bloody machete of Jason's. This sequel contains many of my favorite death scenes so far in the series. What McLoughlin did in this movie that previous directors didn't was he actually made Jason unpredictable. I mean, you KNOW he's gonna kill the counselors, but you don't know when or where. I absolutely LOVE that feeling of uncertainty. McLoughlin has Jason lurking out of windows, behind doors, and the scariest part is when Jason is unknowingly in the motor home as the teenagers pull away from camp. There is also a lot of the usual CH CH CH HA HA HA and deep black darkness to enhance Jason's (CJ Graham's) menacing figure. For once I didn't want any of the characters to get killed. I enjoyed all of their roles. I especially didn't want Paula (Kerry Noonan) to die, and her responsible, soft-spoken, motherly role had me rooting for her to be the lone survivor. That was a first for me...except for Chrissy in part III I never really cared much for the campers. However, my hopes were mutilated in the cabin when Paula dies probably Jason's most notorious kill to date. My God, that cabin is bloody! Overall, I recommend this installment to any hardcore Jason fan. It is a real horror movie, this time it's for real. Rent it, buy it, do whatever! It's great! Jason Lives...he breathes...he can never die",
         "Finally, a decent sequel has come out to make Friday the 13th a respectable horror. This is due to a good storyline, good effects and also because one of my favourite actors is the main star in this movie. I thought Thom Mathews was wicked in Return of The Living Dead, and he is just as good playing Tommy Jarvis in this sequel. Especially like the cool Alice Cooper soundtrack at the end, and well, as for Jennifer Cooke, the girl who plays Megan.....she is just gorgeous. If I would have been Tommy, I would have forgotten about Jason and spent the rest of the movie trying to chat her up. Total babe. Cool film, my rating, 9/10",
         "The movie starts off fairly well, relatively speaking. Tommy Jarvis has grown up into a young man and returns to Jason's grave, unable to go on living unless he can completely verify for himself that Jason is really dead. On the other hand, digging up Jason's grave and essentially freeing him (since Tommy doesn't believe that Jason can be killed) doesn't exactly strike me as the best course of action. What was he planning to do, collect Jason's teeth and go check his dental records? At any rate, at least there is some thought put into an interesting way to bring Jason back to life, at least long enough to kill enough kids to fill up another movie. Tommy digs Jason up and then stabs his decayed corpse with a nearby fencepost, which is promptly struck by lightning thus bringing Jason back to life. It was earlier in this scene in the movie that someone utters the line, \"Some folks have a strange idea of entertainment,\" which I had planned on using as the summary line in my review. Sadly, I logged on to the IMDb and the first thing I noticed was that I was not as clever as I thought. It is, after all, one of the best lines in the movie, since it is such a tongue in cheek jab at the movie's biggest fans. During the paintball scene that soon follows, I was immediately struck by the intelligence of the characters. I really appreciate that this movie has people in it who are boneheads but they're not stupid. These are regular guys with undeveloped intellects rather than the typical horror movie moron, one of the worst things to ever see in a horror film. Or any other film, for that matter. It is a great scene when Jason gets his hands on a machete, for example. One of the boneheads in the movie, Burt, is shot by a woman during the paintball game, after which he proceeds to hack away at the trees around him, and check this out. He curses to himself that she shouldn't have been out there in the first place, she should have stayed where she belonged (presumably the kitchen), etc. This is a development of his character as well as the revelation of a deep character flaw that allows the audience to enjoy his death even after learning something about who he is. When was someone invented as fodder ever given that depth of character? Never! Sure, we hardly learn about his childhood and his dreams, but the point is that he ceases to be nothing but some poor sucker to get hacked up in a creative way by Jason. Then you have the other guy who loses his gun. Again, a lesser horror film would have had him lose his gun through some monumental act of paralyzing stupidity. In this film, he's just an office geek who isn't used to handling guns. He thinks he's in a warzone but he is just out of his element, and Jason is closing in to remind him of where he belongs. These are some of the best characters ever put into the Friday the 13th series. Granted, the movie does have its share of lame goofiness. The cemetery man (that's a good movie, too), for example, at the beginning responds to Tommy's request to dig up Jason with something like, \"Dig him up? Does he think I'm a farthead?! Huh huh huh!\" but the characters clearly have the most depth and meaning that we have seen in the series so far. The dumbest characters in the movie are the cops, which I'm sure has some sort of hidden message (which Hitchcock would have appreciated, no doubt), and there is also a clever scene involving the TV. One of the kids staying at the camp (oh, I forgot to tell you, they've changed the charming name of Camp Blood so that they can operate as a summer camp) one night swears that she saw a monster. The counselors tell her that it's okay, it was just a bad dream, but she insists that it was real, \"just like TV.\" Hear that, parents? Don't let your kids watch too much TV or they'll grow up and watch movies like this! Besides that, the little girl's name was Nancy. Could this be an homage to Nightmare on Elm Street? There is an interesting plot structure that involves the police thinking that Tommy is doing the killing, which ties in neatly with their status as the dumbest guys in the movie. This is leaps and bounds better than the sequels that preceded it (and light years better than Part VIII!!), there's even some good direction. The shot of Jason standing on top of the burning motor-home is one of the best shots thus far in the series. If you're going to watch some Friday the 13th movies, definitely don't miss this one. It's easy to get tired of the same old thing by this point, but this one is worth skipping ahead to see.",
         "Friday the 13th Part 6: Jason Lives is almost a straight-up comedy. After five movies I suppose they just gave up on trying to scare people. The director and screenwriter have definitely planted the tongue firmly in the cheek for this installment. An example of the humor can be found when Jason decapitates three people in one foul swoop. There are a ton of little comedic touches like that which push Part 6 into horror/comedy territory. Return of the Living Dead alumni Thom Mathews has taken over as Tommy and does a fine job. Sadly, this is the last we'll see of Tommy and I believe that is a mistake. The character of Tommy Jarvis almost gives Jason a reason for killing. When they lose Tommy, the lose any meaning they may have had. Oh well, I should save those complaints for Part 7. As far as Part 6'es go, I enjoyed this one. Best kill: The sheriff being bent backward.",
         "Jason gets revived by a lightning (hmm...that's original) and wakes up really angry and a lot of innocent bystanders get to feel his wrath. It's up to Tommy Jarvis (again) to take a stab at disposing of Jason. After the horrible 5th entry this one comes as a real treat. Old Jase is back and the Friday series are back on. Little more humor this time around, which annoyed many but I dig it. The movie's brutal and very violent but not as gory as the first four films and that's a miss. The music is pretty good, with that Alice Cooper song in the end credits a nice touch. All in all, a solid Friday sequel which knocks the socks of part 5 and entertains fans of the series.",
         "I love the Friday the 13th series, and after watching them all countless times over the years I have to say that Part 6 is my all time favorite, plain and simple, it is just awesome. Tom McLoughlin (he did another favorite of mine, One Dark Night) does an excellent job directing and really piles on the atmosphere (the opening shot of the misty forest is creepy) and Thom Mathews is the best actor to play Tommy because he is very heroic, attempting to save the lives of those around him and trying to kill Jason once and for all. Jennifer Cooke is appealing as the blonde (aren't they always blonde?) lead girl and CJ Graham's Jason is, plain and simple, awesome. Full of thrills, action, humor, gore murders, and Jason, what more could you ask for? This one is the best, no doubt about it.",
         "I'm very glad they decided to stop messing around and finally make Jason a super-natural being! He was pretty much just a hard-to-kill human in parts 2,3 and 4 (and Jason wasn't even the killer in parts 1 and 5). So they finally decided to make this guy truly unstoppable! I wouldn't say this was a very mind stimulating movie. This film was made purely for the fans! There is no real rhyme or reason to the film, it's just Jason running around killing people. I guess that's cool if that's what you want. The cast was surprisingly good, some of the acting was sub-par, but what can you expect from this sort of movie? There is one cast member that I think really deserves some notice, Jennifer Cooke, a fine actress and quite the looker too. It was also a pleasant surprise to see a younger Tony Goldwyn (\"Ghost\", \"Kiss the Girls\", \"The 6th Day\") in a very small role in the film. I didn't think this installment was anything spectacular, but it had some good stuff in it. Like I said above, the story is for the fans, so don't expect anything special. If you liked the previous Friday the 13th films, then go ahead and give this one a shot. If you didn't like the previous films, don't even bother. Thanks for reading, -Chris",
         "\"Friday the 13th Part VI: Jason Lives\" starts off pretty interesting. Tommy Jarvis, who is now all grown up, goes back to Jason's grave one stormy night to make sure the maniacal murderer is really dead and that he has no chance of coming back. He opens the coffin, and stabs Jason with an iron fencepost, which is then incidentally struck by lightning, which somehow revives Jason's body. Now Jason is back, alive as ever, and he continues his rampage of teenage slaughter in the forests surrounding Camp Crystal Lake. I really enjoyed the opening of this movie. At least the writers made an attempt to revive Jason in a interesting way, rather than just have him randomly come back to life for more murders. Jason was presented as a more supernatural presence in this movie, which should've been well established way earlier, because no average human could survive all of the severe battle scars he's taken throughout the series. I mean sure, it is your run-of-the-mill \"Friday the 13th\" sequel, but this one at least tries to be something a little different, putting interesting spins on things. There were also some pretty inventive murder sequences too, which isn't uncommon in this series. The director keeps Jason lurking in the shadows throughout the film, having him pop up all over, which, while a little unbelievable, is also pretty effective and good for a couple of scares. It's still a pretty silly movie in it's essential form, but all of these movies are, really, but this one manages to have a lot of strong points and not too many weak ones. Overall, this is one of the better installments of the \"Friday the 13th\" series. And if you compare this to the pointless fifth installment, this film looks like cinema gold. While most of the other sequels are just cheap recycled stories of the other movies, at least \"Friday the 13th Part VI: Jason Lives\" offers something a little fresh in the dulling series. 7/10.",
         "When I first saw the poster for the film, I was excited. It is a great atmospheric poster with its dark colours and the mask emanating light from it. I was also excited about the title. Jason Lives, that means that they are bringing him back to life and Roy will stay dead. Now, if only the film could have been as good and creepy as the first four, it would have been a great film. As it stands, this isn't as good as the first four but it kicks the hell out of the last three. So what we are left with is a passable entry in the series. Jason comes back to life via Frankenstein tactics, which should make him even more powerful. And there are scenes in here that would support that theory. One being when one of his victims is bent over backwards and gets snapped in half. So his brutality is still alive and kicking quite nicely. But what this film is missing is the \"feel\" and the \"texture\" of the first four. And to be honest I can't really put my finger on it, but there is just an intangible missing from the sixth episode that was so prevalent in the first four. It's strange though, this film does a lot of things right. It has Jason lurking mysteriously in the background and it uses some decent shots. But it just wasn't that scary. It was entertaining and humorous and that is fine, but I don't want to see a funny Friday the 13th, just as I don't want to see a funny Nightmare On Elm Street. The way Jason is killed in this one is actually quite good, because we are now starting to get into the folklore of Jason. What makes him tick and what can kill him. Having Tommy research the method of death is a good way to go. It's just too bad that they didn't just leave it alone after that. Or better yet, if they actually wanted to make a Jason Goes To Hell, have them go back to their roots and use the techniques that scared us back in 1980-84. Because now Jason is just a pale replica of what he once was. He hasn't quite eroded in this one, but he is coming close. Friday VI is not a bad effort, it just could have been so much better. But hey, we will always have the others on tape."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Sean S. Cunningham Films",
         "Terror Films Inc."
      ],
      "summaries": [
         "Tommy Jarvis returns to the graveyard to make sure Jason Voorhees is dead and accidentally brings him back to life. Now it's up to Tommy to stop Jason's mindless killing and put him back where he belongs.",
         "Tommy Jarvis goes to the graveyard to get rid of Jason Voorhees' body once and for all, but inadvertently brings him back to life instead. The newly revived killer once again seeks revenge, and Tommy may be the only one who can defeat him."
      ],
      "budget": 3000000
   },
   "movielensId": 1979,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-08-01",
      "dvdReleaseDate": "2004-10-05",
      "directors": ["Tom McLoughlin"],
      "runtime": 86,
      "movieId": 1979,
      "title": "Friday the 13th Part VI: Jason Lives",
      "mpaa": "R",
      "actors": [
         "Thom Mathews",
         "Jennifer Cooke",
         "David Kagen",
         "Renée Jones",
         "Tom Fridley",
         "C.J. Graham",
         "Tony Goldwyn",
         "Darcy DeMoss",
         "Ann Ryerson",
         "Alan Blumenfeld",
         "Ron Palillo",
         "Kerry Noonan"
      ],
      "imdbMovieId": "0091080",
      "originalTitle": "Friday the 13th Part VI: Jason Lives",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "B02ZBqu949E",
         "vv21BQpM9CU"
      ],
      "plotSummary": "As a child, Tommy killed mass-murderer Jason. But now, years later, he is tormented by the fear that maybe Jason isn’t really dead. Determined to finish off the infamous killer once and for all, Tommy and a friend dig up Jason’s corpse in order to cremate him. Unfortunately, things go seriously awry, and Jason is instead resurrected, sparking a new chain of ruthlessly brutal murders. Now it’s up to Tommy to stop the dark, devious and demented deaths that he unwittingly brought about.",
      "tmdbMovieId": 10225,
      "avgRating": 2.1871,
      "releaseYear": "1986",
      "numRatings": 1395,
      "posterPath": "/6vdUpHvkspQonXBdWcLWW5ciEPJ.jpg"
   }
}