{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lake",
            "id": 1889
         },
         {
            "name": "mask",
            "id": 2546
         },
         {
            "name": "telekinesis",
            "id": 5086
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "psychiatrist",
            "id": 15106
         },
         {
            "name": "jason vorhees",
            "id": 179422
         }
      ],
      "imdb_id": "tt0095179",
      "video": false,
      "title": "Friday the 13th Part VII: The New Blood",
      "recommendations": [
         10225,
         10283,
         9731,
         9730,
         9728,
         10285,
         9725,
         11470,
         11361,
         11357,
         10987,
         10160,
         4488,
         11442,
         11281,
         11284,
         10131,
         11675,
         11596,
         10014
      ],
      "backdrop_path": "/5tbDda2PxfQdcB0oYehofGSMCvm.jpg",
      "revenue": 19170001,
      "reviews": [{
         "author": "John Chard",
         "id": "587d01bd9251413f4601a55c",
         "content": "There's a legend around here. A killer buried, but NOT dead.\r\n\r\nJason Voorhees is unintentionally revived from his watery grave by a girl with telekinetic powers.\r\n\r\nAnd so the Friday the 13th bandwagon rolled on for another sequel, a part 7, that once again pitches the unlikable Voorhees against a number of annoying teen types. Those involved here deserve some respect for at least trying to add some impetus to the flagging series, here by way of a gimmick, that of a telekinetic foe played by Lar Park-Lincoln, but ultimately it just ends up same old same old. In fact it's a considerable step down from the more fun and funky part 6. \r\n\r\nThe telekinetic issue becomes something of a side-bar, which is annoying as there's a potentially great thread involving a devious doctor (Terry Kiser) that never reaches the heights it should have. There's a little thought in the writing as regards grief management, but ultimately all hope of something more substantial gives way to Voorhees slicing and dicing kids we don't care about anyway. We could watch the first 3 films if we wanted that again.\r\n\r\nA decent confrontation fight at the finale saves it from stinkerville, but really it's a weak sequel that offers nothing to warrant it being made in the first place. 4/10",
         "url": "https://www.themoviedb.org/review/587d01bd9251413f4601a55c"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jason Voorhees",
               "gender": 2,
               "credit_id": "52fe43519251416c7500be11",
               "name": "Kane Hodder",
               "profile_path": "/1bTc6ACp6bLCBhhfNUZyqwnZ5fY.jpg",
               "id": 62596,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tina Shepard",
               "gender": 1,
               "credit_id": "52fe43519251416c7500be15",
               "name": "Lar Park Lincoln",
               "profile_path": null,
               "id": 64719,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Melissa",
               "gender": 0,
               "credit_id": "52fe43519251416c7500be19",
               "name": "Susan Jennifer Sullivan",
               "profile_path": null,
               "id": 64720,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe43519251416c7500be1d",
               "name": "Kevin Spirtas",
               "profile_path": "/pjt3LJIii2wfv0hxvH9VYQFbujc.jpg",
               "id": 64721,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Crews",
               "gender": 2,
               "credit_id": "52fe43519251416c7500be21",
               "name": "Terry Kiser",
               "profile_path": "/lGQSeLgWeLjFGz2gOMWYNlPOM2f.jpg",
               "id": 55267,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Robin",
               "gender": 1,
               "credit_id": "52fe43529251416c7500be6d",
               "name": "Elizabeth Kaitan",
               "profile_path": "/iryK9uB31CZSC2bWuXyU3KfVX2K.jpg",
               "id": 98078,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Amanda Shepard",
               "gender": 1,
               "credit_id": "579d7618c3a3682505000c28",
               "name": "Susan Blu",
               "profile_path": "/gxED4fq2nOzHCvMUBoxEmj9Ylg6.jpg",
               "id": 19548,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "John Shepard",
               "gender": 2,
               "credit_id": "579d7628c3a3682577000b0b",
               "name": "John Otrin",
               "profile_path": null,
               "id": 102576,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Sandra",
               "gender": 1,
               "credit_id": "579d765bc3a368253f000aee",
               "name": "Heidi Kozak",
               "profile_path": "/wihXxwEpc8ZJsgcxCoJhexcIIQD.jpg",
               "id": 88523,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Michael",
               "gender": 2,
               "credit_id": "579d7683c3a36828b1003f18",
               "name": "William Butler",
               "profile_path": null,
               "id": 81460,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Jane",
               "gender": 0,
               "credit_id": "579d76919251413adf000ba2",
               "name": "Staci Greason",
               "profile_path": null,
               "id": 100268,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Maddy",
               "gender": 1,
               "credit_id": "579d76bc925141120b005987",
               "name": "Diana Barrows",
               "profile_path": null,
               "id": 22555,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Judy",
               "gender": 0,
               "credit_id": "579d76d19251413ab3000c27",
               "name": "Debora Kessler",
               "profile_path": null,
               "id": 1659011,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Kate",
               "gender": 0,
               "credit_id": "579d76dbc3a3682505000c6d",
               "name": "Diane Almeida",
               "profile_path": null,
               "id": 83330,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Ben",
               "gender": 0,
               "credit_id": "579d76ebc3a36837fa0036bd",
               "name": "Craig Thomas",
               "profile_path": "/mXVTRucD1GX6EV7n1HSaiSx8BXp.jpg",
               "id": 572609,
               "order": 14
            },
            {
               "cast_id": 28,
               "character": "Young Tina Shepard",
               "gender": 1,
               "credit_id": "59da0fe292514125140408f2",
               "name": "Jennifer Banko",
               "profile_path": null,
               "id": 166926,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43519251416c7500be27",
               "name": "John Carl Buechler",
               "profile_path": "/3JYXzXtEUTrUNPZch7bgdbPS1v1.jpg",
               "id": 64722,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43529251416c7500be2d",
               "name": "Frank Mancuso Jr.",
               "profile_path": null,
               "id": 49284,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43529251416c7500be33",
               "name": "Iain Paterson",
               "profile_path": null,
               "id": 64723,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43529251416c7500be39",
               "name": "Barbara Sachs",
               "profile_path": null,
               "id": 64724,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43529251416c7500be3f",
               "name": "Manuel Fidello",
               "profile_path": null,
               "id": 64725,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43529251416c7500be45",
               "name": "Daryl Haney",
               "profile_path": null,
               "id": 64726,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43529251416c7500be4b",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43529251416c7500be51",
               "name": "Fred Mollin",
               "profile_path": null,
               "id": 23860,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43529251416c7500be57",
               "name": "Paul Elliott",
               "profile_path": null,
               "id": 35165,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43529251416c7500be5d",
               "name": "Maureen O'Connell",
               "profile_path": null,
               "id": 64727,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43529251416c7500be63",
               "name": "Martin Jay Sadoff",
               "profile_path": null,
               "id": 64728,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43529251416c7500be69",
               "name": "Barry Zetlin",
               "profile_path": null,
               "id": 64729,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.077627,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10281,
      "vote_count": 242,
      "budget": 2800000,
      "overview": "A young girl who possesses the power of telekinesis accidentally causes her father's death after a family dispute at Crystal Lake. Years later, when a doctor tries to exploit her abilities, her power becomes a hellish curse, and she unwittingly unchains the merciless, bloodthirsty Jason Voorhees from his watery grave.",
      "similar": [
         4488,
         3597,
         13570,
         133805,
         24124,
         10283,
         2832,
         948,
         12619,
         241848,
         12521,
         10665,
         11376,
         12662,
         9424,
         2082,
         10781,
         1991,
         377,
         10285
      ],
      "original_title": "Friday the 13th Part VII: The New Blood",
      "runtime": 88,
      "poster_path": "/mt5ijxnTC5a0sS1oPD58Gt9UT5N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1988-05-13",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": "/c7pMKwv5NzIN6N3KM4L8fYMTtPw.jpg",
         "name": "Friday the 13th Collection",
         "id": 9735,
         "poster_path": "/uobgqpLQff9WvxGKE2OSvXv1RHm.jpg"
      },
      "tagline": "Jason is back, but this time someone's waiting!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Carl Buechler"],
      "runtime": 88,
      "synopsis": "Months after the conclusion of the previous film, 10-year old Tina Shepard (Jennifer Banko) hears her alcoholic father physically abusing her mother. The emotional trauma unlocks Tina's previously latent telekinetic powers, which result in her father's death at the bottom of Crystal Lake. Ten years later, Tina (Lar Park Lincoln) is still struggling with guilt over her father's death. Her mother, Amanda Shepard (Susan Blu), and her doctor Dr. Crews (Terry Kiser) take her from the mental institution that she has been in and out of in the hopes of treating Tina's overwhelming guilt. When in fact, Dr. Crews plans to study and to exploit Tina's abilities by keeping her stress levels high. To make sure they are at their peak, Dr. Crews has them convene at their house at Crystal Lake where her father was killed. Despite suspicions of his true intentions, Tina allows herself to be subjected to the tests. Meanwhile, several teenagers are vacationing in the house next door setting up a surprise birthday party for their friend Michael (William Butler). Included are brainy Maddy (Diana Barrows); perky Robin (Elizabeth Kaitan); science fiction writer Eddie (Jeff Bennett); socialite snob Melissa (Susan Jennifer Sullivan); the stoner David (Jon Renfield); the preppy Russell (Larry Cox) and his girlfriend Sandra (Heidi Kozak); and Ben (Craig Thomas) and his girlfriend Kate (Diane Almeida). Nick (Kevin Blair) is Michael's cousin and aside from that, hardly knows the others. He becomes attracted to Tina and tries to start a relationship with her, despite her initial resistance, she becomes friends with most of the kids and takes strides to return to being \"normal.\" But her situation and initial spite of Melissa who is also eying Nick cause a great deal of tension. After a particularly stressful session with Dr. Crews, Tina bursts out of the house and makes her way to the dock where her father died. Believing she senses him, she uses her telekinetic powers in an attempt to resurrect him, only to inadvertently free Jason (Kane Hodder) from his imprisonment. She tells her mother and Dr. Crews, who believe she is being delusional and seeing things. However, Jason returns to his duties by dispatching Michael and his girlfriend Jane along with a nearby camping couple, Dan and Judy, who all happen to be in the area. Tina panics when she sees a vision of Michael being killed and begins to doubt her own sanity, especially after direct evidence is apparently a delusion when she sends Dr. Crews to investigate. Dr. Crews discovers the bodies of Micheal and Jane and returns to the cabin not telling anyone what he saw. Amanda soon discovers Crews' true motives, however and overhearing the argument, Tina runs away, taking the car, which she crashes shortly afterward after having a vision of Jason killing her mother. Jason enters the grounds and kills Russell with an axe to the face and drowns Sandra in the lake while she is swimming naked. Maddy, who is out to prove she can be attractive like Robin for David, goes looking for him and discovers Russell's body before being killed with a sickle when she hides from Jason. Ben and Kate make up from an argument just in time for Jason to crush his skull and shove a party horn into Kate's eye. He kills David with a knife and moves upstairs to throw Robin out a window. Meanwhile, Tina and Nick reunite in the woods and discover Michael's body. During this time Jason makes his way downstairs to kill Eddie. Nick leaves Tina at the house to warn the other teens and soon discovers Eddie's body. He returns to find Tina gone and Melissa sneaking around the house. He begs her to stay, which she agrees. Amanda and Dr. Crews discover Amanda's car, and during their investigation they discover Jason. After a short run, Dr. Crews holds Amanda as a human shield and she is killed by Jason who stabs her in the back with a scythe. Crews tries to escape, but he is killed by Jason who uses a tree saw. Tina finds her mother's body, then follows Jason back to the camp, discovering bodies along the way before confronting him. Distraught and enraged over her mother's death, Tina finally begins using her telekinetic powers to keep Jason outside of arm's reach. She finally seems to kill him by dropping the roof of one of the house porches on him, but it only slows him down. Tina meets with Nick in which they return to her house and they run into Melissa where they tell her what is going on. Melissa thinks that its all a sick joke, but when she opens the front door to leave Jason appears and axes her in the head, throwing her over a TV set. Tina continues to use her powers to keep Nick from being killed, eventually throwing Jason into the house basement. She douses him with gasoline and uses the furnace's fire to ignite it. She and Nick make their way to the docks just as the house goes up in an enormous explosion. Jason comes back and knocks Nick unconscious and incapacitates Tina. Using her powers, she finally resurrects her father who wraps Jason's chains around him and pulls the killer back into the lake before Tina passes out. The following morning, Nick and Tina are placed into an ambulance where she tells him that \"they\" took care of Jason, meaning her and her father. Someone discovers Jason's mask, torn in two as the ambulance pulls off into the morning light.",
      "writers": [
         "Daryl Haney",
         "Manuel Fidello"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095179/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyNDM5NDQ5NV5BMl5BanBnXkFtZTYwMDkxNjg4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jennifer Banko, John Otrin, Susan Blu | See full cast and crew »"],
      "reviews": [
         "Jason has met his match before, going down two-nil to Tommy Jarvis. However, this one is different! Her name is Carrie, but for some reason she uses the name Tina Shepard. Camp Crystal Lake has been operating peacefully for years, ever since Tommy Jarvis chained Jason to the bottom of the lake. But, you see, in horror movies, any peace is bound to be interrupted eventually. Enter Tina Shephard. Years ago the Shephard family was on vacation at Crystal Lake, when Tina's father drowned under some bizarre circumstances. At the age of 17, Tina and her mother return to Crystal Lake with Tina's psychiatrist, Dr. Crews. Dr. Crews isn't what he seems, he is obviously more interested in exploiting Tina's psychic abilities rather than helping her. This isn't very important, because it isn't very long before Tina accidentally releases Jason from what should have been his watery-grave... Yeah, this is your average slasher movie. All the characters are obvious stereotypes. Except for the sci-fi nerd sporting a mullet. I can honestly say I've never seen that before. Tina Shephard is basically a re-work of Carrie from... 'Carrie', but she is the films saving grace. Jason against a psychic made for a nice showdown. Other than that, I'm still wondering why people keeping going to Crystal Lake, only to be surprised when maniac wearing a hockey mask tries to kill them. Apparently this was heavily censored. Kane Hodder makes a good Jason, and there are kills aplenty, but not much gore. Oh well, it had a nice musical score if that makes up for anything... Not too bad entry in the series - 5/10",
         "The popular, money-making slasher series continues with Lar Park Lincoln (the best leading actress in the Friday films) as Tina Shepherd, a pretty teen with telekinetic abilities who accidentally uses her powers to release Jason (Kane Hodder) from his underwater grave. He lurks around (with exposed spine) and sets his sights on a group of young people who rent a cabin for a birthday party. To justify some of the murders, many of the characters, like shrink Terry Kiser (who plots to exploit Tina) and Susan Jennifer Sullivan (great blonde bitch) obviously deserve to die. Gore-wise we have a decapitation, a hand thrust through a chest, a party horn stuck in an eyeball, an axe to the face (twice), a drowning, a body thrown out a window and, the best murder, well I won't ruin it by saying it involves a sleeping bag and a tree, but it's a hoot. The make-up FX are great, the women look good (and several of them have nude scenes) and there's a surprise ending you may not expect, but still not much plot. Kane Hodder went on to become the only actor who played Jason to receive a little fame for this thankless role. This was the number one box office draw at movie theaters the week it debuted.",
         "I've always been fascinated by the Friday THE 13TH films. Sequel after sequel, unknown cast after unknown cast, limited budget after limited budget, they still manage to be pretty good horror movies. And incredibly, this sixth sequel tops the series . In fact, it's one of the best horror movies of the 1980s. Again resurrected from his watery grave (didn't he open his eyes at the very end of the last one? Nah, I guess not), the zombified Jason is ready to hack and slash his way through another group of innocent (though quite naughty) teens. But this time ol' maggot head may have met his match in the form of Tina Shepard, a teen gifted with the ability to move objects with her mind. She is, it turns out, our only hope to stop the monster. The fun concept of Friday THE 13TH PART VII: THE NEW BLOOD paves the way for legitimate chills and thrills. This fierce, spine-bearing Jason is a much more frightening being than before as he paces through the woods, chases skinny dippers and employs weapons of terror I have never seen before (what was that thing with the spinning blade?). This is a serious frightfest that in no way tries to carry on the humorous overtone of its immediate predecessor. Director John Carl Buechler deserves a lot of credit for respecting continuity and sticking to the formula while squeezing out another great film from the well-worn slasher-in-the-woods concept. The film would work well enough without the heroine of Tina. The pretty blonde (played by Lar Park-Lincoln) is just icing on the cake, helping to create (dare I say it?) one of the most memorable horror movie finales of all-time. The showdown, complete with telepathically-propelled lamps and electrical wires, also showcases some very impressive special effects (how many Friday films can you say that about?). Of course we all know who will prevail in this clash of good and evil, but we also know it's just a matter of time before Jason pulls another Lazarus. Even if you're not a fan of the series or think it's too campy, you'll be pleasantly surprised. Give Friday THE 13TH PART VII: THE NEW BLOOD a whirl. Jason would have wanted it that way.",
         "The New Blood is the second worst installment in the Paramount era Friday the 13th movies - edged out, ever-so-slightly by Jason Takes Manhattan. I'm always perplexed by how many fans embrace this entry. Truthfully, Kane Hodder's portrayal of Jason Voorhees, and the Jason make up design are the best things about part 7. From the lackluster sound design, insipid script (which seemingly can't even rip off The Final Chapter well), forgettable characters, turtle pacing, and practically non-existent gore effects, almost everything about this entry is pi$$ poor! Maybe, if the movie was available uncut (something that will unfortunately never exist), that would boost my rating and enjoyment slightly. But as it stands, the sleeping bag kill sequence remains one of the only highlights in this dismal Friday. Be sure to check out our Friday the 13th Fan Podcast here: http://tgif13.podbean.com",
         "Weepy Tina Shepard arrives at Crystal Lake with her mom and her doctor. Tina is a wreck of a girl - plagued by a powerful telekinetic ability, Tina killed her drunken and abusive father in a fit of rage many years ago and has been trying to deal with her guilt ever since. Unfortunately, her sadistic doctor wants only to exploit Tina's powers and drives Tina to the breaking point with his cruelty. In yet another emotional fit, Tina attempts to raise her dead father from the depths of Crystal Lake, but instead raises the rotting carcass of Jason Voorhees instead, who emerges with his hockey mask intact and his bloodlust stronger than ever. Jason immediately heads into the woods and starts killing, gradually working his way to the house next door to Tina's, filled with vacuous partying teens. Tina, who is also precognitive, tries to warn those around her of impending death, but no one will believe the stressed out girl. Finally, Tina must battle Jason herself is she hopes to save her new boyfriend and herself from death. This is Kane Hodder's first outing as Jason Voorhees and its a really great one. Jason is a hulking killing machine of pure, cold rage and the deaths the accrue have never been more vicious or grimly satisfying. The now-famous sleeping bag bludgeon makes its first appearance in this 6th installment, and its one of my favorites - really nasty and brutally hilarious. Lar Park Lincoln is great as Tina - perhaps a bit too weepy, but almost as angry as Jason and erupting in great displays of rage, both verbal and telekinetic. Lincoln did a lot of her own stunts in this one too, which is always impressive. The make-up effects in this movie are my absolute favorite. Jason is a wet, rotting cadaver, his spinal cord clearly visible through the shredded remains of his clothes, his ribcage poking out, his flesh dark with rot. The unmasking scene is a truly shocking and \"wow!\" inspiring awesome moment, as Jason's face is revealed to be little more than an animated skull - but animated it truly is! Beneath the hideous make-up, Hodder impressively expresses the evil wrath of Jason with one empty eye socket and half a mouthful of teeth. The telekinetic effects are a lot of fun as Tina \"throws\" every weapon at her disposal at Jason: a couch, a jar full of nails, a light fixture and finally a can of gasoline and the flames from the basement furnace. It was great to see someone give Jason a run for his money instead of just screaming and running away. All in all, one of the better sequels to follow the original Friday the 13th. 7 out of 10.",
         "Friday the 13th Part VII: The New Blood is more of the same to be honest. It adds original ideas to it and throws in a bit more plot structure, but underneath all of that new material is basically the same old Friday the 13th material. Not necessarily a bad thing in this case, because the acting is very good in this instalment. However the Jason formula does hit rock bottom. The thrills, chills and scares are the same old same old. Victim hears a noise, hunts about, then Jason jumps out on them, and they meet their demise. Now, this is the whole trait of the Jason Voorhees franchise, but it can get a little tedious and boring when they play this the whole way through the movie. Gore wise there is a decapitation, a party horn shoved into a head, an axe to the face, which happens twice, a drowning, a hand thrust through a chest, a body thrown out a window and the fantastic scene where Jason whacks somebody in a sleeping bag against a tree. The soundtrack is more tense and chilling in this sequel which is a benefit to the weaker points of the movie. The characters are very clichéd; the spoilt bitchy girl, the ugly girl who wants to be beautiful and popular, etc. These personalities make you want the characters to die. However Maddy, the ugly-turned-beauty girl was one of the few characters I enjoyed watching on screen, and truly felt sorry for. It really seems that popularity and good looks do, indeed, kill. Anyway, the introduction of a telekinetic girl to battle Jason was a bit of a twist. It half works and half doesn't, to be fair. It just doesn't seem to be very appealing, the fact that this girl, Tina, has her telekinetic powers yet takes forever to get rid of Jason. It was also her powers which summoned him up from the lake. So Jason hacks his way through a cabinful of partying teens, celebrating a birthday. The usual stalk-and-slash ensues, and the battle between the heroine then follows. Why is it never a male who has the final battling climax? Anyway as you can see, apart from the obvious additions to distract you from the fact that this is more of the same, Friday the 13th Part VII: The New Blood delivers the usual gruesome goods and gratuitous nudity which makes the series so appealing, and is therefore worth checking out.",
         "Here we go again. The makers of this instalment pretend that events in the previous films have any bearing on the current one by recapping so-called highlights of the last couple before Jason is up and about again, using various sharp implements to kill partying teenagers. This time he finds himself up against a telekinetic girl who envisions the murders and tries to stop him, but not before a lot of boring set-up and bloody deaths involving saws, knives, spikes and, for a bit of variety, party favours. Still no variation in formula on any significant level, just the usual crap. Even the make-up effects aren't up to much this time round; at least the others had a kind of momentum, but this just stumbles around for eighty minutes, throws a couple of trick endings at you, and then falls down and dies.",
         "Ever since homicidal maniac Jason Voorhees got trapped in chains at the bottom of Crystal Lake, the nearby summer camp has operated without a Hitch... without a murder. But one of this season's happy campers isn't there to have a good time. Tina Shepherd can see the future and levitate objects. Her doctor knows just how dangerous telekinesis can be, but he's out to exploit her, not help her. And now it's too late. Tina has accidentally unchained Jason Voorhees from the bottom of his watery grave and the bloodbath is underway. Tina's special powers are her only hope for survival. But what chance does a teenage girl have against an axe-wielding killer. This film starred: Kane Hodder, Lar Park Lincoln & Susan Blu. This 7th entry in the Friday the 13th saga is another poor one in my opinion. It's not a very good plot and has a bunch of 1 dimensional characters hat you jut don't care about. Not recommended but check it out if you want to watch the full series. **/***** Poor",
         "Jason is stuck at the bottom of Crystal Lake after the events of the last movie. Luckily for him there's a telekinetic girl (Lar Park-Lincoln) who cries a lot and has Carrie fits. She inadvertently frees Jason, thinking he's her dead father! Jason immediately starts killing people, naturally. The series was clearly trying to move in a new direction here with more of a focus on the paranormal and supernatural. Terry Kiser from Weekend at Bernie's plays a shrink in this. He's better with comedy. Lar Park-Lincoln's performance consists of crying or being on the verge of crying at all times. My sister used to love this entry in the series because of the angle with the telekinetic girl and the handsome guy who looks like he belongs at a Superman audition. First movie in the series where Kane Hodder plays Jason. He would be the longest-running Jason, playing him for the rest of the series. Frankly, I'm not a big fan of Hodder's Jason. He's too big and bulky, like a football player or pro wrestler. Plus they put him in some kind of suit where you are supposed to be able to see his exposed spine and ribcage. It's incredibly cheesy and just makes Jason cartoonish instead of intimidating. Most of the people Jason kills in this one aren't particularly annoying or bad. The first couple seemed quite nice, actually. The whole vibe to this sequel seems off but it's still a watchable movie. Not the best of the series but far from the worst. There would only be one more decent one after this then it was downhill.",
         "Part VII begins with a useful recap of the previous films, with a narrator telling us how these are Jason's woods, and that no one can stop him. Film then begins with a young girl named Tina with telekinetic powers accidentally killing her father on Camp Crystal Lake, and then how, years later, she returns there with her mother and psychiatrist to sort out her problems, only Tina, hoping to bring back her father, instead revives Jason Voorhees, still chained in the lake, though now free to resume his killing ways with another group of unfortunate teenagers. Only Tina, using her telekinetic powers, has a chance to stop him... Aside from the novelty of Jason having an equally powerful opponent to contend with, this tepid, contrived sequel has little else going for it, though Kane Hodder is very good as Jason, and film a step up from earlier sequels(which isn't saying much!)"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Paramount Pictures",
         "Friday Four Films Inc.",
         "Sean S. Cunningham Films"
      ],
      "summaries": [
         "Lying dormant at the bottom of Camp Crystal Lake, Jason Voorhees is released from his watery grave by a telekinetic girl. And so the killing begins again. Can she use her powers to stop Jason, or is he back for good?",
         "A distraught little Tina Shepard dreams of the time when she believes she drowned her father with her anger-triggered psychic powers. A trip back to the site is supposed to help Tina, but her doctor merely wants to exploit her. In a rage, Tina accidentally frees Jason Voorhees from the bottom of the lake with her powers, and he begins to slaughter the teens next door. Tina becomes able to control her telekinesis in her fear-state and gives a strong showing against Jason.",
         "Tina Shepard is a special girl. She has the gift of telekinesis (which allows her to manipulate objects by thought). But her gift is also a curse, mainly because she caused the death of her father on the docks of Camp Crystal Lake. Now, Tina has returned home with her caring mother and her conniving doctor, who wants to exploit Tina's powers and become famous. But the teenage residents of Camp Crystal Lake have something more to fear than Tina's powers as she accidentally frees Jason Voorhees from his watery grave. And Jason is really in the mood for a good old teenage massacre.",
         "Years after Tommy Jarvis chained him underwater at Camp Crystal Lake, Jason Voorhees returns to the camp grounds when he is accidentally released from his prison by a teenager with psychic powers."
      ],
      "budget": 2800000
   },
   "movielensId": 1980,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-05-13",
      "dvdReleaseDate": "2004-10-05",
      "directors": ["John Carl Buechler"],
      "runtime": 88,
      "movieId": 1980,
      "title": "Friday the 13th Part VII: The New Blood",
      "mpaa": "R",
      "actors": [
         "Kane Hodder",
         "Lar Park Lincoln",
         "Susan Jennifer Sullivan",
         "Kevin Spirtas",
         "Terry Kiser",
         "Elizabeth Kaitan",
         "Susan Blu",
         "John Otrin",
         "Heidi Kozak",
         "William Butler",
         "Staci Greason",
         "Diana Barrows",
         "Debora Kessler",
         "Diane Almeida",
         "Craig Thomas",
         "Jennifer Banko"
      ],
      "imdbMovieId": "0095179",
      "originalTitle": "Friday the 13th Part VII: The New Blood",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["tFueYFS9rB4"],
      "plotSummary": "Tina possesses the gift of telekinesis, allowing her to move things and see the future, using the power of her mind. But when a devious doctor tries to exploit her ability, the gift becomes a hellish curse. Tina unwittingly unchains the merciless bloodthirsty Jason Voorhees from his watery grave, igniting a bloodbath that ends in the ultimate showdown in strength of mind versus pure evil matter.",
      "tmdbMovieId": 10281,
      "avgRating": 2.03614,
      "releaseYear": "1988",
      "numRatings": 1176,
      "posterPath": "/mt5ijxnTC5a0sS1oPD58Gt9UT5N.jpg"
   }
}