{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "prom",
            "id": 10266
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "disco",
            "id": 155490
         },
         {
            "name": "psycho",
            "id": 176182
         }
      ],
      "imdb_id": "tt0081383",
      "video": false,
      "title": "Prom Night",
      "recommendations": [
         40969,
         39929,
         34311,
         39874,
         28377,
         13567,
         13555,
         34312,
         24124,
         47957,
         24913,
         41828,
         40229,
         24831,
         11415,
         37936,
         24274,
         14929,
         15158,
         37530
      ],
      "backdrop_path": "/7MJNhkXpbsoE8BuxwJLuTPcjYvH.jpg",
      "revenue": 14796236,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mr. Hammond",
               "gender": 2,
               "credit_id": "52fe45f79251416c91044993",
               "name": "Leslie Nielsen",
               "profile_path": "/cZpuTfE1j63tCEXoSL2A7KZjk5d.jpg",
               "id": 7633,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kim",
               "gender": 1,
               "credit_id": "52fe45f79251416c91044997",
               "name": "Jamie Lee Curtis",
               "profile_path": "/c4poMDwQ0nUj81m4WPriiv96ExZ.jpg",
               "id": 8944,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nick",
               "gender": 0,
               "credit_id": "52fe45f79251416c910449a1",
               "name": "Casey Stevens",
               "profile_path": null,
               "id": 1184781,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Wendy (as Eddie Benton)",
               "gender": 1,
               "credit_id": "52fe45f79251416c910449a5",
               "name": "Anne-Marie Martin",
               "profile_path": "/pFOlDkjiAt4re31G57i8h7Ai7FO.jpg",
               "id": 9986,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mrs. Hammond",
               "gender": 1,
               "credit_id": "52fe45f79251416c910449a9",
               "name": "Antoinette Bower",
               "profile_path": null,
               "id": 15961,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe45f79251416c910449ad",
               "name": "Michael Tough",
               "profile_path": null,
               "id": 1184782,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lou",
               "gender": 2,
               "credit_id": "543fd2510e0a2651ca000097",
               "name": "David Mucci",
               "profile_path": "/qD1Acd4PngkCtUl2qmPAFdlyACM.jpg",
               "id": 3714,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Sykes",
               "gender": 2,
               "credit_id": "54603f760e0a264d600039a7",
               "name": "Robert A. Silverman",
               "profile_path": null,
               "id": 20175,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Vicki",
               "gender": 0,
               "credit_id": "54603f890e0a264d600039b0",
               "name": "Pita Oliver",
               "profile_path": null,
               "id": 1383990,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Drew",
               "gender": 2,
               "credit_id": "54603fa10e0a263d6600124f",
               "name": "Jeff Wincott",
               "profile_path": "/oA1AVImV3w3761o5zWRhnUWuRjH.jpg",
               "id": 104509,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Kelly",
               "gender": 0,
               "credit_id": "54603fad0e0a262ca20019fd",
               "name": "Mary Beth Rubens",
               "profile_path": null,
               "id": 180688,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "McBride",
               "gender": 2,
               "credit_id": "54603fb9c3a36841d3003f25",
               "name": "George Touliatos",
               "profile_path": "/5dhhJXgozmVffYlJiOweZIMPvSo.jpg",
               "id": 59179,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Jude",
               "gender": 1,
               "credit_id": "59f8eaaf9251414bd50046f7",
               "name": "Joy Thompson",
               "profile_path": null,
               "id": 138874,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Weller",
               "gender": 0,
               "credit_id": "59f8eabdc3a3682d50004609",
               "name": "David Bolt",
               "profile_path": null,
               "id": 12489,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Young Nick",
               "gender": 0,
               "credit_id": "54ff702d9251413d9b00041b",
               "name": "Brock Simpson",
               "profile_path": null,
               "id": 1042872,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f79251416c9104499d",
               "name": "Paul Lynch",
               "profile_path": null,
               "id": 44130,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45f79251416c910449b3",
               "name": "William Gray",
               "profile_path": null,
               "id": 66140,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55db0481925141721d005fc8",
               "name": "Robert Guza Jr.",
               "profile_path": null,
               "id": 1221561,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "54603fd6c3a3680b5a002009",
               "name": "Peter R. Simpson",
               "profile_path": null,
               "id": 35329,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54603ff20e0a261fb900a8f6",
               "name": "Paul Zaza",
               "profile_path": null,
               "id": 12700,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54603ffe0e0a261fbd00a863",
               "name": "Carl Zittrer",
               "profile_path": null,
               "id": 12701,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "546040170e0a264d600039c1",
               "name": "Robert C. New",
               "profile_path": null,
               "id": 57668,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54604023c3a368371c001203",
               "name": "Brian Ravok",
               "profile_path": null,
               "id": 1383991,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5460402e0e0a264d600039c8",
               "name": "Reuben Freed",
               "profile_path": null,
               "id": 12704,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "54604046c3a3686e490035a9",
               "name": "Warren Keillor",
               "profile_path": null,
               "id": 1015792,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "54604055c3a3686e490035ac",
               "name": "Allan Cotter",
               "profile_path": null,
               "id": 1286357,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.921259,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 36599,
      "vote_count": 104,
      "budget": 1000000,
      "overview": "This slasher movie follows a relentless killer who is out to avenge the death of a young girl who died after being bullied and teased by four of her classmates. Now high-school students, the guilt-ridden kids have kept their involvement a secret, but when they start being murdered, one by one, it's clear that someone knows the truth. Also coping with the past are members of the dead girl's family, most notably her prom-queen sister, Kim Hammond (Jamie Lee Curtis).",
      "similar": [
         12619,
         3597,
         133805,
         1803,
         9424,
         24124,
         291356,
         15762,
         979,
         10285,
         281957,
         245891,
         238636,
         3600,
         241848,
         445954,
         26789,
         39918,
         11376,
         4488
      ],
      "original_title": "Prom Night",
      "runtime": 92,
      "poster_path": "/3KIy1qFmdLMwUrSlRAiovX5anhR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Simcom Limited",
            "id": 15059,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Guardian Trust Company",
            "id": 542,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Prom Night Productions",
            "id": 15060,
            "origin_country": ""
         }
      ],
      "release_date": "1980-07-18",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Prom Night Collection",
         "id": 123255,
         "poster_path": "/tHhPnpJad4RVICIwaeERIq63ARg.jpg"
      },
      "tagline": "If you're not back by midnight... you won't be coming home!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Paul Lynch"],
      "runtime": 92,
      "synopsis": "Inside an old abandoned building, four children are playing a game in which they all hide while one of them looks for the others, calling out \"the killer is coming!\" Young Kim and her two twin siblings, Alex and Robin, walk by and see the children playing. Kim and Alex leave, but Robin lingers, hoping to join the game. But upon entering the building, the four kids gang up on her, chanting \"kill!\" until Robin has nowhere to go. Backing up into a window, Robin crashes through and falls out of a second floor to her death below. One of the kids, Nick, wants to get help, but Wendy convinces all of them that the best thing to do is tell no one and never tell anyone about what happened. Wendy, Nick, Jude, and Kelly swear to keep quiet. As they leave the building and ride away on their bicycles, an unseen person sees them ride off. Later that evening, Robin's father, Mr. Hammond (Leslie Nielsen) and the police are at the scene. They have surmised that Robin was the victim of a sexual attack by a homicidal maniac. They think they know who is responsible and the cops go off to question a suspect. Six years later. The now grown-up Kim (Jamie Lee Curtis) and Alex (Michael Tough) are visiting their sister's grave with their parents. A little later, an unseen person with a creaky voice is telephoning each member of the guilty party one by one telling them, \"I'll see you at the prom!\" The timid Kelly is upset, while Jude and Wendy think that it's a prank. Meanwhile, police detective McBride (George Touliatos) is unsettled because a psycho killer named Leonard Murch has escaped from a local clinic hospital. Murch was a known sex offender who the police suspected was responsible for Robin's death. That night when McBride and his men approached Murch for questioning, he fled and after a car cash, wrecked his car and suffered horrible burns all over his body. Murch has been residing in the asylum for the criminal insane and he just escaped and may be heading back to the town where it happened to look for more victims. When the police discover the dead body of a nurse that Murch took as a hostage during his escape from the hospital, McBride and the asylum psychiatrist Dr. Fairchild believe that Murch may have returned to the town for revenge against everyone. In town, it is revealed that Nick is Kim's latest boyfriend. Wendy is Nick's ex-girlfriend, and she is certainly not happy that the new couple are going to their senior prom together. Wendy tries to assure Kim that the relationship will not last by telling her \"It's not who you go with. It's who takes you home\". Later, the school bully and misfit Lou (David Mucci), is messing with Kim in the cafeteria wearing a hood. Alex steps in to defend his sister, and he holds his own against Lou's two pals until Lou sucker punches him in the back. Brought before the principal, whom is Mr. Hammond, he suspends Lou for fighting. As Lou leaves the school grounds, Wendy tries to talk to him. When Nick and Kim are walking around, Nick tries to tell her about that fateful day, but is he not able to. Meanwhile, Wendy makes devious plans to break up Kim and Nick, and she tells Lou that she doesn't want anyone hurt. Lou tells her that he will take care of it. Nearby, Jude is picked up for a ride home by Slick, an outcast student who drives a Chevy van, whom he asks her to the prom and she accepts. In the girls locker room after tennis practice, Wendy finds her school photograph torn from the yearbook and hanging on the front of her locker. When Kim and her friend, Kelly, are alone, they hear a loud noise in the locker room and they see that a mirror has been smashed. After checking around the locker room, the return to see that a fragment of the mirror is gone. Jude and Kelly both find their yearbook photographs inside their lockers, as does Nick. That night, Lou picks up Wendy to take her to the prom. Mr. Hammond is the chaperone and Alex is the DJ for the disco music. Everyone is having a good time dancing and listening to the music and watch Kim and Nick do their well-choreographed dance on the dance floor before everyone. McBride secretly arrives at the dance to oversee it and to make sure that nothing bad happens. Kelly and her boyfriend, Drew, leave the gymnasium for a part of the school where they begin to make out. Kelly decides that she cannot go any further, and an irate Drew goes elsewhere telling Kelly that he knows \"plenty who will\". After Drew walks out on Kelly, a man wearing all black clothing with a hood over his head, quickly approaches the tearful Kelly and kills her by slashing her neck with a long and jagged mirror shard. Jude and Slick decide to sneak out of the festivities in the gym for some intimate time as well. Outside, Jude and Slick are in the back of his van enjoying the privacy. After spending a bit of time outside the van, they hear noises and thinking that someone is nearby spying on them, go back inside the vehicle to smoke some marijuana. After a minute, the back doors fling open and the hooded killer stabs Jude in the neck with the mirror shard. The murderer then leaps in after Slick who fights back and pushes the killer out of his van and starts it up to run the killer over. But the killer leaps out of the way and grabs onto Slick as he is trying to drive away. After wildly spinning around, the killer jumps free and the van goes over a cliff and explodes into flames with Slick still inside. The killer returns to the school and follows Wendy out of the gym to the ladies room where she is putting on makeup. The lights are turned off and the killer, now armed with an axe, swings it at her head. Wendy gets away and a long chase through the school begins as Wendy tries to outrun her axe-wielding pursuer. The chase leads through the darkened halls, classrooms, and the workshop area. Wendy almost gets away, but in due time the killer finds her when she screams after finding Kelly's dead body in a linen closet and she is axed to death. Back inside the prom, McBride is told by another police officer that Murch has been caught and was several miles away from the town. When McBride leaves, Kim begins looking for her father, but cannot find him as he is to announce the new prom king and queen. So, a teacher decides to announce the winners himself. Backstage, Nick and Kim ready themselves for the announcement of prom king and queen when Nick is accosted by Lou's thugs and Lou takes his place backstage with the crown. The killer, believing Lou to be Nick-in-waiting, sneaks up to him from behind and uses the axe to chop off Lou's head, which rolls down the catwalk for the entire student body to see. The students scream and flee the gymnasium. But the killer is knocked out when he accidentally hits the ropes supporting the sandbag counterweights for the stage curtain. Kim finds Nick and frees him and tries to help him get out of the building. The killer revives and, quickly realizing his mistake, blocks the exit and attacks Nick and Kim. The killer seems only wanting to kill Nick and cares little about Kim whom is trying to stop him. Kim manages to get the axe away from the killer who, deprived of his weapon, attempts to choke Nick. Kim swings the axe at the killer, hitting him in the shoulder. When the masked killer reacts to his injury and yells out, Kim pauses for a moment and looks at the killer's eyes and sees familiar looking eyes staring right back at her which makes her drop the axe. The killer stumbles away and outside where McBride returns with the police who have surrounded the place. As they take aim, Kim runs outside and yells \"don't shoot him!\" Kim runs to the killer's side who collapses. She removes his hook to reveal..... her brother Alex. Using the mask to gauge his wound, Kim holds Alex who tells her that Nick and his friends were the ones who killed Robin. As Alex dies from his wound, Nick walks outside and stares at a tearful Kim as she continues holding her dead brother.",
      "writers": [
         "William Gray",
         "Robert Guza Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081383/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MzY1NDA5M15BMl5BanBnXkFtZTYwMDIyNzA5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leslie Nielsen, Jamie Lee Curtis, Casey Stevens | See full cast and crew »"],
      "reviews": [
         "I first saw Prom Night back when I was 10 years old, but didn't appreciate it as a film until re-watching it at 19. Watching it a second time was like discovering a priceless gem and I must say, as a screenwriter, I still look to this movie as motivation and inspiration. Unlike most Hollywood horror/slasher movies, it did what most of the latter cannot, which is provide a combination of good lucks and good acting, therefor ensuring we care about the characters. Scream most definitely took a page from this movie as inspiration for its mystery theme. Though the budget was low and this movie was made in 1980 I feel that it still has enough of a story to keep us entertained and also enough of a punch to make us jump a bit. But what really makes Prom Night a success is its actors. Jamie Leigh was wonderful as always, but one character I felt that stole the show was the character of Wendy. As vile and wicked as they made her, the actress portraying her gave her depth. I felt as a viewer that she was more than just the typical bitch character. With killer lines, a beautiful face, and a chase scene that has been the foundation of future horror movie chase scenes, this girl makes the movie worth watching. If you happen to see this movie on or notice it in a video store I would suggest giving it a look. I would love to see a remake, ONLY if they kept the plot the same, but intensified the horror, much like what was done in TTCM remake. And, of course, to have Edie Benton and Jamie Leigh make an cameo or guest appearance somewhere!",
         "One of the Halloween follow-ups that would give Jamie Lee Curtis the title of \"scream queen\". Children accidentally cause the death of a little girl, now years later they are in high school and getting ready for the prom. However, it seems someone else is planning on getting some murderous revenge on prom night. Prom Night is a formula slasher film, with plenty of the slasher trappings, but there are some elements that raise this film above some of the others of it kind. The director gives this movie a truly dark and eerie atmosphere, with the help of Paul Zaza's spooky music score. The plot remains engaging throughout and the creep-factor is kept high. One difference from the slasher \"norms\" is the fact that we ultimately have sympathy and even sorrow for the film's killer. While Prom Night is hardly a flawless movie, in fact there are a few scenes where the lighting is way too low and the disco prom dates the film, it does hold it's own. The cast gives good performances, especially Curtis, Eddie Benton, and the late Casey Stevens. There's also a few good rock numbers like \"Prom Night\" and the mellow \"Fade to Black\". Worth a look for slasher fans. *** out of ****",
         "'Prom Night' is a decent little slasher-mystery starring Jamie Lee Curtis in her third scream queen role. The movie also stars Leslie Nielsen as Jamie Lee's father and Hamilton High School principal. Everyone else in it are just bit players, but we must consider that this film stars one of the wickedest you-know-whats in slasher movie history. Her name is Wendy, and she is played by Anne-Marie Martin. Who this actress is, or was, I have no idea, but I know I hated her character with a passion. One of the biggest bonuses for horror fans in this movie will be the big chase scene with her and the killer quite near the end which was deliberately filmed super dark. You can hardly see what's going on and for me it is the best scene in the whole movie. Big points for Wendy's chase scene. It works since she plays the role well, and we've waited so long for this scene and it comes pretty much near the end, but it delivers. Anyway, 'Prom Night' opens with a tragedy in which young Robin Hammond, who is Jamie Lee's character's little sister, accidentally falls to her death from a two-story window after being cornered by four brats(Wendy, Nick, Kelly, and Jude)who were trying to scare her. Freaked out that they may be in serious trouble, they all make a pact to take it to the grave, initiated by Wendy, the leader of the brats. Ultimately the blame gets pegged on some serial pedophile and no one ever suspects the four kids. But someone else knows and was there and saw the whole thing. We continue twelve years later. It's the day of the prom and all four of the kids receive raspy phone calls, asking them to \"come out to play\". It concerns most of them, but eventually their minds stray back to the prom. Some of them have dates, some don't. Jamie Lee ends up going with Nick who just dumped Wendy, so Wendy hooks up with Lou, who sort of serves as John Travolta's Billy Nolan from 'Carrie', and the two of them plan to play a prank on Jamie Lee and Nick since they were voted Prom King and Queen. Pause real quick. Remember, Nick is one of the kids who was involved with the death of Jamie Lee's little sister. Could you really keep a secret that big from someone you are \"going steady\" with? Also, the two other girls involved, Kelly and Jude, appear to be good friends with Jamie Lee's character. I don't think there is much logic in that, but hey, it's a horror movie. I have to overlook it. In the end, prom dreams are sliced and diced as the vengeful killer begins knocking each of them off, eighties style. The movie is definitely pretty corny and cheaply made, but that's all part of it's charm. The suspense is there, the score is really creepy, and Jamie Lee does her thing. However, the best part is the mystery. Who is the killer? I'm sure we all know twenty-five years later, but it was fun finding out. Everyone is a suspect in 'Prom Night', as mentioned by Randy from the first 'Scream', and it will keep you guessing right up to the climax. Well, actually, when it gets to that point there are only a couple people left that it can be...but it was still a bit of a surprise. Honestly, I think 'Prom Night' could use a remake. My VCR copy has such awful quality that it's really quite hard to see what's going on on the screen, and I hear that the DVD isn't any better, so I think we could all benefit from a remastered version, or even a remake at this point. 6/10 is my vote. A decent little slice and dice mystery from days long gone. How I miss them...",
         "Six years ago four kids make a pack to keep a secret, which involved the mysterious death of child Robin Hammond. They thought that were the only ones who knew what had happened, but some else witnessed it to. Now that person strings them along, to eventually plan their revenge during Prom night. A real thank-you to the commercial success of \"Halloween (1977)\" and \"Friday the 13th (1980), which saw the influx of slasher films and \"Prom Night\" was one of the first to step up. Too bad that we have here is an unspectacular so-so, if slick looking slasher effort that got caught labouring along with very little happening and providing us with corny school melodramatics. When it came to the crunch, most of the Prom Night sequences was about getting the groove on and listening to funky dory disco soundtrack. Oh it just makes you want to bogey; well it didn't stop Jamie Lee Curtis from strutting her stuff. However when it came to the good stuff, I thought the novel deaths were soundly executed, and there's a certain unpleasantness about them. When the black hooded killer (who's quite fast on their feet and would make for a good shaker too) is tormenting and stalking the victims (from be it to the phone calls or hanging about in the shadowy corridors) there's an ominous air to proceedings, which director Paul Lynch pulls off rather well. It's just too bad that most of the time is used setting this all up with ineffective red herrings and below par, drawn out script. Too many loose ends creep in, even though the premise is quite slight and you can find yourself laughing at its unintentional goofiness and picking up on it predictability. Robert New's stunningly vivid camera movements are atmospherically airy and Paul Zaza and Carl Zittrer's sorrowfully twisted musical score gets it cues right. The performances from the cast are acceptable with a likable Jamie Lee Curtis (earning her scream queen tag at the time) proves herself as an upcoming talent. Weak character, but well judged performance. Leslie Nielsen looks awkwardly distracted, and seems to duck off in a phone-in performance and George Touliatos gives the film some solidarity. Anne-Marie Martin is a delight as the scheming sexpot Wendy, David Mucci is perfect as the boorish brute Lou and Casey Stevens is modest as Curtis' prom date Nick. This post-Halloween slasher is familiar and slowly plotted, but its competent technical handling helps.",
         "\"Prom Night\" emerged at the beginning of a decade, which also marked a decade for the rise and fall of slasher films as we know them. Along with \"Terror Train\" and \"The Fog\", \"Prom Night\" is one of Jamie Lee Curtis's most well-known returns to the genre after \"Halloween\", though it still remains fairly obscure to many horror fans and general audiences. The plot centers on Kim Hammond (Curtis), daughter of her high school's principal (Leslie Nielsen). She's popular, well-liked, and seems to have it all. Unfortunately, Kim and her family are haunted by the mysterious death of her younger sister, Robin, who died after falling from the top floor of an abandoned building ten years prior; the police blamed a schizophrenic child predator on the crime, but little do they know, there were four children who were there and whom were responsible for the incident. Those four children are now high school seniors, classmates and friends of Kim; it's prom night, which is incidentally the ten year anniversary of Robin's death. Kim will be crowned prom queen. Some won't live to see it. If the \"Prom Night\"'s plot set-up sounds familiar, that's because it is. Though the film was fresh twenty-some years ago, its originality has been obstructed by the plethora of slasher films that followed in its wake, which may leave some viewers bored and running the numbers; but if you can look past this, \"Prom Night\" is an extremely fun film. It has a little bit of everything going for it: an elusive killer, odd phone calls, probable motives, sassy high school girls, disco dancing, a ski-mask, and, most importantly, an axe. Team up the carefree high school environment with five teenagers' dark secret, and accompany that with a hellbent murderer on prom night, and you've got yourself a straightforward, suspenseful piece of slasher cinema. Granted, the film is dated, and the disco dances and funky hairdos of the day may take be distracting to some extent, but the nostalgia of that era is in every frame. Paul Zaza's score is appropriately ominous and ignites a feeling of being under watch by... someone, and at all times. Director Paul Lynch also does a fine job here, showing us just enough, but not too much. Nice establishing shots of the high school's hallways at night set the stage for the action that ensues as night falls and the prom begins, and several impressive instances of cinematography abound (the slow-motion throat slash murder which only shows us a close- up of the victim's facial expression, followed by a fade-in to the red punch bowl being one example). There are several surprisingly artsy shots in the film, and the camera-work is, for the most part, clever. The film has a rather bright, hazy look to it as well, which, whether intended or not, gives the movie another sort of texture. Performance-wise, we've got a surprisingly decent cast of 20-somethings playing 18-year-olds. Nonetheless, most all involved give commendable performances, Jamie Lee Curtis included. Leslie Nielsen's role is minor, but he's great, and Eddie Benton does a good job as the jealous rich girl of the school (and might I say, she has one of the best chase scenes I've ever seen in a horror film). Though the film takes roughly an hour before all the mayhem ensues, the build-up is worth the wait\u0097 the final 15 minutes of the film are incredibly fun (almost as fun as the hokey disco dance scene with Jamie Lee Curtis and Casey Stevens, ala \"Saturday Night Fever\"). The killer himself is eerie and has an interesting choice of weapons (a shard of broken mirror), even though his whispering \"now!\" upon each murder might sound funny. The revelation at the end of the film may or may not be expected, depending on the viewers' familiarity with these types of films. Either way, it's pretty poignant for a slasher movie. Overall, \"Prom Night\" is a wonderful example of slasher prototypes. It was early enough to not be considered a total rip-off, and it's got a lot of interesting things going for it, no matter how by-the-numbers it seems today. It's suspenseful, sometimes spooky, and genuinely fun and lively. Factor in some wonderful murder scenes, a budding scream queen, an eerie score, and a full-fledged disco blood-bash, and you have yourself one of the most memorable slasher films of the 1980s. 9/10.",
         "Arriving as it did during the early moments of the slasher film explosion of the 80's, Prom Night was undoubtedly much more impressive then than it is today. Stripped of historical significance, modern viewers will probably be disappointed to find this dated offering to be a relatively bloodless affair with a meager body count and limited thrills. Certainly, as a horror film, Prom Night doesn't have the tools to deliver any solid scares. But as a piece of time capsule kitsch, this movie is a very fun watch, even if the unintentional laughs outweigh the splatter elements. The set-up that ultimately launches the film's flimsy revenge plot is silly and awkwardly-staged, with a young girl basically walking out of a window to her death because a quartet of pint-sized kids her own age chant \"kill\" over and over again. This isn't a particularly terrifying scenario, so things get off to a clumsy start here. It doesn't help matters that the next hour of the film is almost completely devoid of anything suspenseful, scary, or even interesting, save for a series of phone calls to the film's eventual victims made by a killer who has obviously watched too many Dario Argento films. The rest of the runtime for the first two acts is padded with long-winded character development, needless subplots, and a few attempts at red herring planting that ultimately fall flat. There is also a lot of screen time devoted to extended Disco dancing sequences, which, predictably, have aged far worse than the rest of the film. Compounding the goofiness, when Jamie Lee Curtis and her date are horrified to see that their nemeses have arrived at the prom despite being expelled, Jamie Lee proclaims, \"let's show them what we can do!\", at which point she and her partner take to the dance floor and lay down some revenge boogie. Take that, jerks! The film shows us too much of the killer early on, so even though this is supposed to be a whodunnit, the list of likely suspects is quite short by the time any of the murders start happening. Even worse, the masked, black-clad maniac is the smallest-statured movie psycho of all time, and any menace derived from our mysterious prom-crasher is promptly done away with once we see them and Jamie Lee on the screen at the same time, at which point we can't help but notice that our scream queen star is both taller and more physically intimidating than the killer. When the slasher movie festivities finally get underway, the resulting murders are downright quaint in their subdued delivery, and only a couple of sequences have any real impact. The payoff is relatively meager considering the extended exposition, and while the killer's surprise reveal at the end makes narrative sense, it is a bit disconcerting to see that the skulking murderer we've been following throughout the film is actually the most benign character in the entire cast. A horror classic, this ain't. But the glaring markers of the era give the film nostalgic interest, and it's definitely fun to see Leslie Nielsen playing it straight, even if he abruptly disappears from the film without explanation before the climax. Jamie Lee is also a welcome presence, and although she seems to be phoning her scenes in most of the time, we have to concede that she gives the admittedly weak material about what it deserves. The ancillary elements of the film (including the very cool theatrical poster and its killer tag-line) are actually more interesting than the finished product, and only the most forgiving fans of the genre's boom during this period will gleam much enjoyment here. It's hard to recommend a film that has such limited appeal, but I must confess that I have a genuine fondness for Prom Night, and I still enjoy myself every time I watch it. 1978-1983 was truly a magical era when the horror genre exploded with low budget delights, and if you hold those golden years in your heart, your chances of forgiving this film's trespasses are much better.",
         "While other slasher flicks of the early eighties involved an identifiable villain slicing and dicing countless teens, \"Prom Night\"'s killer remained a mystery. But like all good horrors, there is a back story which sets up the reason for the killings, in this case, the motif is purely revenge. Four childhood friends who would later grow up to be the school's nice boy, diva, meek girl and geek girl, were all involved in the death of another young girl. That girl is the sister of Jamie Lee Curtis' character, Kim. And, as Prom Night approaches, someone is hunting down those four former friends. Jamie Lee Curtis is obviously the main reason to watch this film, but \"Prom Night\" is not without other good points. The idea of a murderer prowling around on Prom Night is great, the music is very cool, especially the song on the closing credits. Oh, and Jamie Lee Curtis sure can dance! The rest of the cast are pretty good. Leslie Nielson's involvement is minimal, though Antionette Bower is wasted. Pita Oliver, David Mucci, Casey Stevens and Anne-Marie Martin as the school diva are especially note worthy.",
         "I'm a big horror fan and I have always heard good things about Prom Night. That it's one of the classics and it is mentioned as one of the Jamie Lee Curtis scream queen classics. Ha ha please. I love Jamie Lee Curtis but never was she ever stalked in this film, thus not making her any kind of scream queen in this film. The points I liked in this movie: The creepy beginning, the old camera of this film (I love \"old\" horror movies, they have a more creepier atmosphere to them, I hate new cameras), the insanely creepy phone calls. The voice and whispers of the phone calls are just disturbing and also when he is killing victims he speaks with that voice. Then the rest of the movie tanked it...here's why. The movie dragged, there were no murders throughout the film. Everything was saved for the end, and when you reach the end you get hit with insane amounts of disco music. I personally do not like to see my murderers on screen. I prefer that they remain mysterious and anonymous till the very end. If your gonna show your killer please make him scary. This murderer was too skinny, dressed in black and just wearing a plain black mask with two holes in the eyes. Just stupid. I hated that. the decapitation was great but that final scene at the prom just reeked of Carrie. So everyone runs for the hills when they see the decapitated head, and the disco is STILL on and Jamie Lee, her boyfriend in this movie and the killer are fighting to disco music. That was that. The icing on this mess is the revelation that the killer is Jamie Lee's brother in the movie. In the flashback it just simply shows you that her brother witnessed the murder at the beginning sequence of the movie. Just lame. I was really expecting just a good solid horror movie but this just didn't do it for me. I gave this movie points for atmosphere and Jamie Lee Curtis. The rest of it is a bomb.",
         "Another average slasher flick, one of two that scream queen Jamie Lee Curtis made back to back during her time in Canada fresh from her fame in John Carpenter's Halloween in 1978. It opens with four young kids in an abandoned building playing a macarible game when one girl joins them and it leads to her accidently falling out of a second floor window to her death. The four kids (three girls and a boy) make a pack never to mention it to anyone. But six years later, someone knows about the killing and decides to get those four responsible. As it also happens the anniversary of the death coincides with the big high school prom which the kids are all attending, making it convenient to borrow big ideas from movies like Carrie (1976) among others for the characters, situations and subplots. Although it has some good qualities and was moderately successful when first released, the movie is bloodless in almost every respect, plus the murders are so murky and dimly lit. Jamie Lee Curtis, playing Kim, the older sister of the murdered young girl, is good as the popular student who wants to be elected prom queen. But she, unfortunatly, is not one of the four students targeted by the masked ax-weilding killer. In fact, she frequently becomes a suspect along with her father the school principal, as well as her younger brother Alex, the creepy school janitor, and the school bully. But the identity of the killer is fairly obvious. But so much time is spent on establishing red herrings that more than two-thirds of the movie pass before any of the killings begin. The production values are also good, but the film is starting to show its age. Contents: Six killings, scant blood, one decapitation, Jamie Lee Curtis as prom queen, no nudity, no real suspense, no pace, lots of disco music and dancing, sit this one out.",
         "\"Prom Night\" is one of the horror films that is highly underrated. What this film has that most horror films from the 80's generation (including some from these past two generations) do not take the time to develop is a strong plot with good character development. Of course these come with good screen writing. Having said that, as a consequence the viewer actually has to sit through a building story, which takes a while to build up. Therefore about 50 minutes of the film is dedicated solely to that. But that's not to say there aren't any moments of suspense or slight uneasiness. But during the prom sequence the film has a tendency to lose track of the fact that it is a horror film, and so there may come a time during the film that you'll ask yourself \"what is it I'm watching again?\" There are a few possibilities as to who could be doing the killings and why, but the revelation was a bit predictable and if you pay close attention to the film there are actually intentional hints dropped. This I found to be quite clever. Also, most horror movies don't leave the audience on a sad not but this one actually did, something rare to find in a horror film, and it was nice to see. Those who are expecting a horror film with excessive gore scenes will not find it in this horror film. For Paul Lynch's \"Prom Night\" it is mostly what you do not see that makes you cringe. \"Prom Night\" runs approximately 89 minutes in length, and should at least be considered as a rental. \"Prom Night\" is not a forgettable horror movie, and has memorable moments. Roughly 39 minutes of the film will keep you on edge and entertained, especially during Kelly's chase scene. Whilst the other 50 minutes will keep you for the most part intrigued. ***1/2 Stars Out of *****"
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Simcom Limited",
         "Guardian Trust Company",
         "Prom Night Productions"
      ],
      "summaries": [
         "For six long years, Hamilton High School seniors Kelly Lynch, Jude Cunningham, Wendy Richards and Nick McBride have been hiding the truth of what happened to ten-year-old Robin Hammond the day her broken body was discovered near an abandoned convent. The foursome kept secret of how they taunted Robin - backed her into a corner until, frightened, she stood on a window ledge... and fell to her death. Though an accident, the then-twelve-year-olds feared they would be held responsible and vowed never to tell. But someone else was there that day... watching, and now, that someone is ready to exact murderous revenge on prom night.",
         "Six years ago, when young Robin Hammond crashed through a broken window, her playmates vowed to keep the accident a secret. They promised that no one would ever know, but someone already does. Now after years of keeping the secret, Robin's sister Kim is about to be crowned Prom Queen, but a chilling event undermines her party plans. Revenge for the six-year-old murder is around the corner as the unknown observer turns maniacal killer stalking the high school halls. Kim's friends are disappearing and the dark empty halls are filling with blood. This was the senior prom where some were crowned and others were losing their heads.",
         "A masked killer stalks four teenagers, responsible for the accidental death of a little girl six years earlier, at their high school's senior prom."
      ],
      "budget": 1600000
   },
   "movielensId": 1987,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-07-18",
      "dvdReleaseDate": "1998-02-17",
      "directors": ["Paul Lynch"],
      "runtime": 92,
      "movieId": 1987,
      "title": "Prom Night",
      "mpaa": "R",
      "actors": [
         "Leslie Nielsen",
         "Jamie Lee Curtis",
         "Casey Stevens",
         "Anne-Marie Martin",
         "Antoinette Bower",
         "Michael Tough",
         "David Mucci",
         "Robert A. Silverman",
         "Pita Oliver",
         "Jeff Wincott",
         "Mary Beth Rubens",
         "George Touliatos",
         "Joy Thompson",
         "David Bolt",
         "Brock Simpson"
      ],
      "imdbMovieId": "0081383",
      "originalTitle": "Prom Night",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "j5pRzHJp_pM",
         "afVU6iyRn3c",
         "I-lCiYKozvc"
      ],
      "plotSummary": "This slasher movie follows a relentless killer who is out to avenge the death of a young girl who died after being bullied and teased by four of her classmates. Now high-school students, the guilt-ridden kids have kept their involvement a secret, but when they start being murdered, one by one, it's clear that someone knows the truth. Also coping with the past are members of the dead girl's family, most notably her prom-queen sister, Kim Hammond (Jamie Lee Curtis).",
      "tmdbMovieId": 36599,
      "avgRating": 2.47072,
      "releaseYear": "1980",
      "numRatings": 683,
      "posterPath": "/3KIy1qFmdLMwUrSlRAiovX5anhR.jpg"
   }
}