{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "exorcism",
            "id": 2626
         },
         {
            "name": "supernatural powers",
            "id": 4769
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "possession",
            "id": 9712
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "locker room",
            "id": 10081
         },
         {
            "name": "prom",
            "id": 10266
         },
         {
            "name": "unfaithfulness",
            "id": 11510
         },
         {
            "name": "camp",
            "id": 11663
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "high school friends",
            "id": 18005
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "school principal",
            "id": 165154
         },
         {
            "name": "prom queen",
            "id": 166229
         }
      ],
      "imdb_id": "tt0093176",
      "video": false,
      "title": "Hello Mary Lou: Prom Night II",
      "recommendations": [
         41769,
         41828,
         36599,
         55538,
         26958,
         34312,
         34311,
         59762,
         28155,
         40952,
         74747,
         55377,
         40969,
         26957,
         42709,
         26956,
         29794,
         40760,
         39895,
         35977
      ],
      "backdrop_path": "/jGDT2vnhIuunDAd6FpRLwgBKS44.jpg",
      "revenue": 2683519,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bill Nordham",
               "gender": 2,
               "credit_id": "52fe473f9251416c9106effd",
               "name": "Michael Ironside",
               "profile_path": "/i3HkCGEnQGJeD0U8WDumO4VH5fU.jpg",
               "id": 11086,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Vicki Carpenter",
               "gender": 1,
               "credit_id": "52fe473f9251416c9106f001",
               "name": "Wendy Lyon",
               "profile_path": null,
               "id": 166463,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Craig Nordham",
               "gender": 0,
               "credit_id": "52fe473f9251416c9106f009",
               "name": "Louis Ferreira",
               "profile_path": "/mqJglT0g3tRMg5cNeJ7C6vdP4E.jpg",
               "id": 51036,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mary Lou Maloney",
               "gender": 1,
               "credit_id": "52fe473f9251416c9106f005",
               "name": "Lisa Schrage",
               "profile_path": null,
               "id": 229714,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Father Cooper",
               "gender": 2,
               "credit_id": "533674139251417db4000967",
               "name": "Richard Monette",
               "profile_path": null,
               "id": 1228014,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Kelly Hennenlotter",
               "gender": 1,
               "credit_id": "533674369251417db400096f",
               "name": "Terri Hawkes",
               "profile_path": "/wP8XbBEEq7FHFaLySamTCldwgr1.jpg",
               "id": 5926,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Josh",
               "gender": 0,
               "credit_id": "5336746c9251417da1000954",
               "name": "Brock Simpson",
               "profile_path": null,
               "id": 1042872,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Jess Browning",
               "gender": 0,
               "credit_id": "5336749e9251417dad000907",
               "name": "Beth Gondek",
               "profile_path": null,
               "id": 1305423,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Virginia Carpenter",
               "gender": 0,
               "credit_id": "533674b09251417da7000991",
               "name": "Judy Mahbey",
               "profile_path": null,
               "id": 1305424,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Walt Carpenter",
               "gender": 0,
               "credit_id": "533674c49251417dad00090d",
               "name": "Wendell Smith",
               "profile_path": null,
               "id": 1305425,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Monica Waters",
               "gender": 0,
               "credit_id": "533674ea9251417d9b000948",
               "name": "Beverley Hendry",
               "profile_path": null,
               "id": 92763,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe473f9251416c9106eff9",
               "name": "Bruce Pittman",
               "profile_path": null,
               "id": 92438,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "533675bf9251417d9b00095c",
               "name": "Ron Oliver",
               "profile_path": "/bQMN2KtPJqtP6PklZ8241Bk3lGP.jpg",
               "id": 80523,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.403833,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 39929,
      "vote_count": 42,
      "budget": 0,
      "overview": "When Hamilton High's Prom Queen of 1957, Mary Lou Maloney is killed by her jilted boyfriend, she comes back for revenge 30 years later. Bill Nordham is now the principle of Hamilton High and his son is about to attend the prom with Vicki Carpenter. However, she is possessed by Mary Lou Maloney after opening a trunk in the school's basement. Now Bill must face the horror he left behind in 1957.",
      "similar": [
         3597,
         133805,
         24124,
         4488,
         36599,
         277685,
         238636,
         12619,
         3600,
         65086,
         11376,
         357096,
         9424,
         620,
         23483,
         281957,
         8456,
         10781,
         27770,
         377
      ],
      "original_title": "Hello Mary Lou: Prom Night II",
      "runtime": 97,
      "poster_path": "/4wHoYhDZ5tfk3E2myRs8vdyoOv1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Simcom Limited",
            "id": 15059,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Allarcom Limited",
            "id": 15493,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Columbia Television",
            "id": 15494,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CFCN Communications",
            "id": 21287,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TBA Film",
            "id": 21288,
            "origin_country": ""
         }
      ],
      "release_date": "1987-11-13",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Prom Night Collection",
         "id": 123255,
         "poster_path": "/tHhPnpJad4RVICIwaeERIq63ARg.jpg"
      },
      "tagline": "You Can't Keep a Bad Girl Down",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruce Pittman"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Ron Oliver"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093176/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNDE0NjI0MV5BMl5BanBnXkFtZTcwNzc1MTk5Mw@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Lisa Schrage, Michael Ironside, Wendy Lyon | See full cast and crew »"],
      "reviews": [
         "Though this movie often gets skewered on the message boards it is a delight for those who appreciate the high school horror films of the 80's. The acting is stale, the story is one we've all heard before but this film had some memorable touches. The locker room scene is one of my all-time favorite death scenes and this film used the art class paper cutter as a weapon way before Josh Hartnett wielded one in \"The Faculty\". The \"living rocking horse\" is definitely something viewers wont easily forget and that scene reminds me of horrors historical roots in cinema: that scene screams German Expressionism as much as the title sequence in \"Nightmare on Elm Street\". If you don't like camp, this movie will be hard to swallow, but if you're a fan of the B movies you rented as a kid just because the cover art looked creepy: bon apetit.",
         "The Prom Night series probably takes the cake as one of horror's more negligible series due to its lack of continuity, trite plots, and severe emphasis on Christianity. However, I think Mary Lou is probably the best installment in this series. Vicki Carpenter is the quintessential goody two shoes who's raised by strict and deeply religious parents who've done a fine job at making her feel guilty for having \"sinful\" thoughts about her boyfriend and using the Lord's name in vain. But with her interest in the prom queen who died thirty years earlier, it's obvious that she's torn between a her own world and one that can be considered more sinful. The spirit of Mary Lou does a helluva job at corrupting this little Miss Perfect by exposing her to violence, revenge, lust, and even homosexuality that she's pondered for years. While the film bears no major relevance to its predecessor much like the subsequent two films, it provides a reflection of what teenagers have been going through for years while they were trying break free from the parents who drove them crazy, discover more about themselves, or just try, by any means necessary, to be the most popular person in their school. After all, weren't those the elements that John Hughes filled his 80s teen movies with?",
         "HELLO MARY LOU: PROM NIGHT II (1987) starring: Michael Ironside, Wendy Lyon, Justin Louis, Lisa Schrage, Richard Monette, Brock Simpson, Beverley Hendry, Terri Hawkes, Beth Gondek. plot: Thirty years ago at the Hamilton High Prom, Bill (Michael Ironside) caught his beautiful date, Mary Lou (Lisa Schrage), cheating on him with Budd (Richard Monette). Just as Mary Lou was about to be crowned Prom Queen, Bill played a prank which backfired and killed the beautiful girl. It is now 1987, Bill is the principal of Hamilton High and Budd is a priest. Bill's son, Craig (Justin Louis) is dating the cute Vicki (Wendy Lyon), who is a shoo-in for Prom Queen. But when Vicki finds Mary Lou's old dress in the prop room, she unleashes her spirit and becomes possessed. Mary Lou has returned, in the body of Vicki. She stands up to her religious mother, murders her friends and attends the prom in order to finally receive her crown. the good: First of all, this has nothing to do with the first Jamie Lee Curtis thriller besides the fact that they both take place at the doomed Hamilton High and both have Brock Simpson in their cast. This was obviously made because of the success of the NIGHTMARE ON ELM STREET series, having a vengeful spirit get revenge for his/her death. But it is still fun, it even has a bit of THE EXORCIST and CARRIE in it, and in the plot summary, you can see why. But despite it's unoriginality, it's a fun, gory, well performed, well directed ghost/slasher/possession film. And for t&a fans you get to see all of Wendy Lyon and the boobs of Beverley Hendry, and they both share a kiss in the gym shower.",
         "Wendy Lyon plays blonde-haired high-school goody-two-shoes Vicki Carpenter (just one of several characters in this film blessed with the surname of a horror director) who gradually becomes possessed by the vengeful spirit of promiscuous tart Mary Lou Maloney (Lisa Schrage), who was burnt to death during her high school prom in 1957 as a result of two men fighting for her affections. Before getting down to the messy business of exacting revenge on those responsible for her untimely demise, Mary Lou dispatches a couple of Vicki's closest friends (after all, practise make perfect), causing her next targets\u0097local priest Father Cooper (Richard Monette) and high-school principal Bill Nordham (Michael Ironside)\u0097to suspect that they might be next to die. At the high school prom, Nordham attempts to stop the now fully possessed Vicki from causing further mayhem, but only succeeds in making the spirit within even more angry, ensuring everyone present has a totally unforgettable night. A non-related sequel to Prom Night, the 1980 Jamie Lee Curtis slasher, Hello, Mary Lou is an entertaining tale of revenge from beyond the grave featuring a grab-bag of supernatural elements borrowed from genre classics such as The Exorcist, A Nightmare on Elm Street, and Carrie. The result is a derivative slice of 80s teen horror that is rather light on the gore (why, oh why, didn't they chop fashion disaster Jess's head off like they threatened to do?), but which is still lots of fun thanks to some great performances from a decent cast (including the always superb Michael Ironside) and a couple of surprisingly risqué scenes: Lyon strips off and gives us full-frontal as she hops in the shower with (big) bosom(ed) pal Monica (Beverly Hendry); nasty prom queen hopeful Kelly (Terri Hawkes) gives a blow-job to a lucky computer geek to convince him to rig the evening's voting; and the possessed Vicki not only comes on to her principal and a priest, but also her own father!!! Throw in some Elm Street-style nightmare scenes, the most memorable of which has a rocking horse come to life, and a daft 'shock' ending, and what you have is an eminently watchable time-waster.",
         "Hello Mary Lou isn't the most entertaining horror I've seen but it's fairly decent and something always seems to be happening. There's no gore at all but there's plenty of silliness. There seems to be a weird religious edge to it as well, as the girl possessed by Mary Lou asks the priest: \"Will you pray for me?...Will you f**k me?\" There's a hilarious line from the priest during a funeral, when he comments that the death should remind everyone of violence seen every day in life, on TV, and in films. Other funny scenes include a girl being pulped in between two lockers, Mary Lou's corpse bursting out of Vicki's body, and an exploding grave. These are not as cool as they sound, but will still bring a smile to your face. I would give this a watch if you enjoy 80's horror films. It's not the best, but it's got enough wholesome cheesiness to pass the time.",
         "Clever, inventive, and funny totally non-related sequel to Prom Night takes various elements from just about every horror film and blends them together with successful results. The story deals with a murdered prom queen possessing a young girl thirty years later to avenge her death. Lisa Schrage is funny, scary, and sexy as Mary Lou. Pretty good effects for the most part too. Rated R; Nudity, Sexual Situations, Graphic Violence, and Profanity.",
         "What have The Fly, Invaders from Mars, The Thing from Another World, and The Blob all have in common? They are science fiction films from the 1950s that were remade in the 1980s. The 1980s saw a new enthusiasm for everything 1950s as America - for the first time in three decades - felt more like the society and world leader they imagined themselves to be in that earlier post-war decade. Helping this optimistic reinvigoration of nationalist sentiment along were such factors as Reagan's neo-conservative government, the growth of economic rationalism, Russia's withdrawal from Afghanistan, an end to the Iran Hostage Crisis, the meteoric rise of computer technology, and unprecedented increases in wealth accumulation and consumer fetishism. University survey's conducted in the 80s revealed that American values among young adults had returned to a conservative high not seen since the 1950s. With all of these cosmetic similarities between the two decades, its no wonder that fashion, music and movies returned to the halcyon days of McCarthyism, anti-communism, nuclear paranoia and conspicuous consumption. Indeed, in the New Hollywood of the 80s there was a general shift among audiences towards juvenile escapist fantasies rather than cynical social realist dramas of the 70s. So what does all this have to do with Hello Mary Lou: Prom Night II (PN2)? The renaissance of everything 1950s in America is a key concern of PN2, and typical of horror films that, in general, capture the zeitgeist fairly accurately. PN2 provides a particularly impressive visual metaphor for the regeneration of the 1950s within a 1980s context when, at the prom, Mary Lou quite literally emerges from Vicki's body. Prior to this \"rebirth,\" Vicky - possessed by the vengeful spirit of Mary Lou - dresses in 50s clothes, uses anachronistic phrases from the 50s (\"See you later, alligator\"), and listens to 50s music. The film is as much an intelligent and insightful observation of 80s neo-conservatism as it is a camp, clever and visually striking horror romp. Reviewers that have not enjoyed the film scathingly pointed out the extent to which PN2 borrows from Carrie and The Exorcist. Yet this is all part of the twisted pleasure of the film. Take it too seriously and the acerbically clever joke is on you. For through its derivative nod to Friedkin and De Palma's films, PN2 locates itself very clearly within firstly, a post-Exorcist era when every second horror film in the 70s borrowed something from The Exorcist (the most financially and critically successful horror film in history), and secondly, a post-De Palma era in which it pays homage to a director who pays homage to a director (Hitchcock), resulting in a playful mise-en-abyme. PN2 is also a really good looking film. It features some solid stylish special effects and well executed set pieces that predate those in the later campier instalments of the Nightmare on Elm Street franchise. As we know, Mary Lou makes several unsuccessful attempts to possess Vicki. She comes to Vicki when she's alone and vulnerable, invading her personal space. Some of these possession attempts involve some truly creative filmmaking involving good old fashioned in-camera special effects. This of course was an age when a major part of filmmaking was still problem solving - an age when audiences were still asking, \"How did they do that?\" An age before digital boredom. In one sequence from PN2, the rocking-horse in Vicki's room starts to move by itself and takes on a demonic visage, with its eyes rolling, its brows creasing and its tongue lolling about. In another sequence, Vicki is alone in a classroom when chalk writing mysteriously appears in reverse on the blackboard, seemingly written from inside the board (the words \"HELP ME\" appear, one of the many nods to The Exorcist). When Vicki approaches the board, it suddenly becomes a liquid state and black hands reach out and pull her into the inky blackness. After struggling to stay afloat as the board becomes a whirlpool, Vicki is eventually pulled under (or inside) as the dark waters swirl around her. After she disappears, the blackboard returns to its solid state and the letters that had been swirling around are now scattered randomly across the board. I could rabbit on endlessly about this film but i've already said too much. I hope after reading this review you might be inspired to check out this overlooked gem from the decade that produced so many overlooked gems, and with an open mind, hopefully you might see what a group of intelligent and creative young filmmakers with no cash, but solid ideas and loads of cunning are capable of producing.",
         "This movie has far more better acting,horror, direction, humor and even better music then it's three other movies. Mary Lou is a snotty prom queen who dies in a fire in 1957. She returns 3O years later to get her crown possessing the body of a nice girl,Vickie. So now, Vickie sets out to get the crown and nothing will stand in her way! Good acting especially by Wendy Lyons as Vickie and Lisa Schrage as Mary Lou. If you like good horror movies like I do rent this one. you won't be sorry. Recommended!",
         "Your attitude going into Prom Night II will determine how much joy you take away from the film. If you're expecting a horror masterpiece, look elsewhere. If you like campy movies that are rather fun to watch unfold, you'll like this. Lisa Schrage has the time of her life playing an over the top Mary Lou and Wendy Loyd channels Schrage's rage perfectly during her time \"possessed\". Not classic cinema but a fun way to kill a couple of hours with a wicked ending.",
         "I could not consciously give this film anything more than a 7 rating despite the fact that I really like it because it and the subsequent sequels and the remake of \"Prom Night\" have absolutely NOTHING to do with the original! This would be a great film on it's own, I don't know why the producers saw it necessary to leach onto the \"Prom Night\" title when this is actually a totally different movie. It's not really all that scary but it is a campy little horror flick about a prom queen who dies in a fire on stage in front of the entire school just before she is about to receive her crown. She dies before our eyes but returns to haunt the high school 30 years later and posses the soul of one prom queen hopeful. Michael Ironside puts on a great performance in this as the man responsible for Mary Lou's fiery death who later becomes the high school principal and whose son is dating the girl who has been possessed by the spirit of the vengeful Mary Lou. There are a couple of attempts to blatantly rip off \"The Excorcist\" and some inconsistencies in the story line but all in all this is a fun little flick and you don't need to watch the original to appreciate it since it's a totally different movie."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Simcom Limited",
         "Allarcom Limited",
         "British Columbia Television"
      ],
      "summaries": [
         "When Hamilton High's Prom Queen of 1957, Mary Lou Maloney is killed by her jilted boyfriend, she comes back for revenge 30 years later. Bill Nordham is now the principal of Hamilton High and his son is about to attend the prom with Vicki Carpenter. However, she is possessed by Mary Lou Maloney after opening a trunk in the school's basement. Now Bill must face the horror he left behind in 1957.",
         "Thirty years after her accidental death at the 1957 senior prom, the tortured spirit of prom queen, Mary Lou Maloney, returns and she is out for revenge."
      ],
      "budget": 0
   },
   "movielensId": 1988,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-11-13",
      "dvdReleaseDate": null,
      "directors": ["Bruce Pittman"],
      "runtime": 97,
      "movieId": 1988,
      "title": "Hello Mary Lou: Prom Night II",
      "mpaa": "",
      "actors": [
         "Michael Ironside",
         "Wendy Lyon",
         "Louis Ferreira",
         "Lisa Schrage",
         "Richard Monette",
         "Terri Hawkes",
         "Brock Simpson",
         "Beth Gondek",
         "Judy Mahbey",
         "Wendell Smith",
         "Beverley Hendry"
      ],
      "imdbMovieId": "0093176",
      "originalTitle": "Hello Mary Lou: Prom Night II",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["cxKUQENmcsg"],
      "plotSummary": "When Hamilton High's Prom Queen of 1957, Mary Lou Maloney is killed by her jilted boyfriend, she comes back for revenge 30 years later. Bill Nordham is now the principle of Hamilton High and his son is about to attend the prom with Vicki Carpenter. However, she is possessed by Mary Lou Maloney after opening a trunk in the school's basement. Now Bill must face the horror he left behind in 1957.",
      "tmdbMovieId": 39929,
      "avgRating": 2.08869,
      "releaseYear": "1987",
      "numRatings": 327,
      "posterPath": "/4wHoYhDZ5tfk3E2myRs8vdyoOv1.jpg"
   }
}