{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "prom",
            "id": 10266
         },
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "acid",
            "id": 208580
         }
      ],
      "imdb_id": "tt0098136",
      "video": false,
      "title": "Prom Night III: The Last Kiss",
      "recommendations": [
         41769,
         39929,
         28082,
         16304,
         40252,
         32595,
         40463,
         44909,
         38499,
         35945,
         38500,
         36421,
         5796,
         135482,
         39930,
         30654,
         25753,
         25752,
         41848,
         52868
      ],
      "backdrop_path": "/uFyaOsZpMZrdZwA6MDWbBAaiIul.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Alex Grey",
               "gender": 2,
               "credit_id": "550429519251412c51000cde",
               "name": "Tim Conlon",
               "profile_path": "/sOwMfG9kn1rQamSiiIY5R5sMpxI.jpg",
               "id": 1212249,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Mary Lou Maloney",
               "gender": 1,
               "credit_id": "54ff6d589251413d99000438",
               "name": "Courtney Taylor",
               "profile_path": "/gttQG3U5SQl0uI5hs6VuLQdOBwo.jpg",
               "id": 1087657,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sarah Monroe",
               "gender": 1,
               "credit_id": "52fe45dfc3a36847f80df571",
               "name": "Cynthia Preston",
               "profile_path": "/3luJCE9inrE0f3QxMrYVbjIZdr0.jpg",
               "id": 1213299,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Andrew Douglas",
               "gender": 2,
               "credit_id": "54ff6d839251413da10003f6",
               "name": "Dylan Neal",
               "profile_path": "/uuJjxlqQHkJqrhajEQq6Gmy2dkr.jpg",
               "id": 79149,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Shane Taylor",
               "gender": 2,
               "credit_id": "54ff6e13c3a3685b960004a0",
               "name": "David Stratton",
               "profile_path": null,
               "id": 199303,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Leonard Welsh",
               "gender": 2,
               "credit_id": "54ff6e3f9251413da8000472",
               "name": "Jeremy Ratchford",
               "profile_path": "/fzzVrrOw00lWlqJs4dBSD8gJGZg.jpg",
               "id": 44205,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mr. Weatherall",
               "gender": 0,
               "credit_id": "54ff6e5f9251413d9f000470",
               "name": "Roger Dunn",
               "profile_path": null,
               "id": 1351508,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mr. Walker",
               "gender": 2,
               "credit_id": "54ff6efd9251413dab0004c3",
               "name": "George Chuvalo",
               "profile_path": "/9lTM1wUXaci9YpXILPUhH2i4iuu.jpg",
               "id": 105298,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Ms. Richards",
               "gender": 0,
               "credit_id": "54ff6dd89251413d9b0003f3",
               "name": "Lesley Kelly",
               "profile_path": null,
               "id": 1193939,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Officer Larry",
               "gender": 0,
               "credit_id": "54ff6f5a9251413da1000408",
               "name": "Brock Simpson",
               "profile_path": null,
               "id": 1042872,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df567",
               "name": "Ron Oliver",
               "profile_path": "/bQMN2KtPJqtP6PklZ8241Bk3lGP.jpg",
               "id": 80523,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45dfc3a36847f80df56d",
               "name": "Peter R. Simpson",
               "profile_path": null,
               "id": 35329,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "55db1dd0c3a3680dd500683e",
               "name": "Lucinda Sill",
               "profile_path": null,
               "id": 1327596,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "55042c67c3a368262e000c75",
               "name": "Ron Oliver",
               "profile_path": "/bQMN2KtPJqtP6PklZ8241Bk3lGP.jpg",
               "id": 80523,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55db1d659251417d7c000e30",
               "name": "Ray Sager",
               "profile_path": null,
               "id": 35328,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db1d7292514143f3007562",
               "name": "Peter R. Simpson",
               "profile_path": null,
               "id": 35329,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db1d81c3a3680dd5006835",
               "name": "Ilana Frank",
               "profile_path": null,
               "id": 35327,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db1da2c3a36831f4007d28",
               "name": "Dan Johnson",
               "profile_path": null,
               "id": 1500047,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "55db1dae92514143e0007876",
               "name": "Paul Zaza",
               "profile_path": null,
               "id": 12700,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55db1dba92514143e4007b88",
               "name": "Rhett Morita",
               "profile_path": null,
               "id": 1085811,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55db1dc592514143e4007b8a",
               "name": "Nick Rotundo",
               "profile_path": null,
               "id": 59395,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55db1ddc92514143e600744b",
               "name": "Reuben Freed",
               "profile_path": null,
               "id": 12704,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "55db1deb92514143e600744d",
               "name": "Brendan Smith",
               "profile_path": null,
               "id": 1375601,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "55db1dfe92514143f3007575",
               "name": "Nancy Howe",
               "profile_path": null,
               "id": 1500048,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.315047,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 41828,
      "vote_count": 19,
      "budget": 0,
      "overview": "Mary Lou, the prom queen burned to death by her boyfriend back in the fifties, has escaped from hell and is once again walking the hallways of Hamilton High School, looking for blood. She chooses as her escort in world of the living Alex, an average depressed student with dreams of one day becoming a doctor. As Mary Lou begins to get back into form, the body count starts climbing and the graduating class of Hamilton High is once again smaller than expected.",
      "similar": [
         434873,
         133805,
         15762,
         19204,
         341006,
         9373,
         10781,
         36599,
         7341,
         19908,
         588,
         381288,
         336843,
         3597,
         9538,
         16288,
         241848,
         301846,
         298584,
         74997
      ],
      "original_title": "Prom Night III: The Last Kiss",
      "runtime": 97,
      "poster_path": "/bJOpzoUXeYhruTAc3PBbvKAeLpd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Famous Players",
            "id": 36555,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Norstar Entertainment",
            "id": 16953,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Comweb Productions",
            "id": 61660,
            "origin_country": ""
         }
      ],
      "release_date": "1990-03-30",
      "vote_average": 4.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Prom Night Collection",
         "id": 123255,
         "poster_path": "/tHhPnpJad4RVICIwaeERIq63ARg.jpg"
      },
      "tagline": "A Romantic Comedy from Hell",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Ron Oliver",
         "Peter R. Simpson"
      ],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Ron Oliver"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098136/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MTc2MTU1N15BMl5BanBnXkFtZTYwMjE4OTU5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Tim Conlon, Cynthia Preston, David Stratton | See full cast and crew »"],
      "reviews": [
         "I'm a bit surprised by all of the negative reviews of this film ...it's got more wit and grue than 90% of the films of its genre and era, yet it's called \"crap\" (which says little for everything else). Yes, PN3 is very juvenile, but so is the intended audience - the evil heroes of horror of the late 80s and early 90s generally play to such tastes. The male lead is easy to like (the chemistry between he and his girlfriend reminds me of that of the lead guy and his girlfriend in \"Fright Night\"), as is the actress portraying Mary Lou. The film doesn't pretend to be anything more than a \"USA Up All Night\" flick, but the dialog, style and gore of the movie are all above average (I think of \"Girlfriend From Hell\" as the prototypical decent \"USA Up All Night\" film, and this one is definitely in a class above). The horror just erupts from nowhere in this film, like the scene in which the principal cuts off his finger and wind starts blowing all over, slamming doors shut ...my reaction to this was a big laugh: what a great, madcap way to foreshadow. I love films in which the hell just starts right away and keeps going until the end (Evil Dead 2 is probably the best example of that). And I laughed a lot while watching PN3, but perhaps one needs a rather free - and yet very juvenile - sense of humor to get the most out of it. If you ever snickered at the humor and one-liners of Freddy Krueger, Angela Baker, or even the Wishmaster, you'll probably like this incarnation of Mary Lou. In any case, this film is very representative of its time and genre, in good ways and bad, depending on your take.",
         "Prom Night III: The Last Kiss (1989) This movie, was strangely funny and cheezy, but had some horror elements thrown into it. It is about Alex, who has a great girlfriend, and their relationship begins to crumble as Alex begins having visions and experiences with Mary Lou Maloney, who was killed in a fire at the school 33 years ago. Mary Lou begins to give Alex anything he's ever wished for, but in the process, she begins killing people in Alex's way, and the police come after Alex! There were many gorey but funny scenes in the movie, like when Mary Lou appears at the ice cream stand in the classroom. It tried to be scary, but turned out more funny and entertaining. I give Prom Night III a 6/10.",
         "Like the first Prom Night, Hello Mary Lou: Prom Night II was a mild success. As a result of that, a second sequel was born two years later and would follow the storyline of II instead of I and instead of starting a new storyline like IV, but that's a whole other can of worms. I like both I & II very much and for different reasons, but after that what else is there? What else can be done to keep the series fresh? Well in the case of Prom Night III: The Last Kiss, the filmmakers followed in the footsteps of the later Nightmare on Elm Street sequels and gave us a campy gorefest with plenty of visual style to boot. Whether or not if that's a good thing is up to the viewer, but personally I was a happy camper. Pros: Never a dull moment. Decent performances, the best from Cyndy Preston as the \"hero's\" girlfriend. Plenty of creative and gory kills. Some OK gore, make-up, and visual effects. Directors Ron Oliver and Peter Simpson inject quite a bit of style into the film, making it a visual feast, especially in the second half. Some of the campy humor works. Lastly, this sequel has a kind of ending that's rare in the horror genre. Cons: Some of the humor falls flat on it's face. Highly derivative of the later Nightmare on Elm Street films due to a wisecracking villain, over-the-top kills, and more style than substance (For this film this is both a plus and a minus). The score is mediocre for any film, but it's also not fit for this one and feels more right for a straight comedy. Final thoughts: In the long line of sequels to classic 80s horror films, Prom Night III is certainly one of the most entertaining. It is however vastly different than the first film and even the second which was somewhat campy, so if you don't like dark comedy with your blood and gore then you might want to avoid this. Otherwise, get ready for an hour and a half of no-brainer entertainment. My rating: 3.5/5",
         "Prom Night III continues with the Mary Lou storyline, but takes it in a lighter and more humorous direction. Mary Lou (Courtney Taylor) unleashes herself from hell using a nail file to cut the chains. It's from there that she begins to stalk a student named Alex (Tim Conlon). Her mission is to get Alex to be with her forever. There is just one thing standing in her way. Alex's girlfriend Sarah (Cynthia Preston). She starts to kill some of the people that get in his way for success. When he struggles in biology, she finishes his test and then turns his bio teacher into a human banana split. A guidance counsellor questions Alex's grades, so she kills her off using battery acid. This goes on and on and each time Alex has to dispose of the bodies by burying them in the football field. With Prom Night looming, the police eventually find the corpses and of course point the finger at our lead character. Will Alex escape and send Mary Lou back to hell, or will she claim her man and get rid of Sarah? Prom Night III definitely has the best special effects of all the films in the series. The banana split murder in particular is pretty unique and visually well done. There is just something about this one that seems kind of cheap. It's like a cheap version of part II. The actress that plays Mary Lou in this one is different from the previous installment. She isn't as good as the Mary Lou from the second film. She was darker and more sinister in part II. In The Last Kiss, they try hard to make her seductive and humorous, much less evil and dark. The performance isn't as good. I also don't understand the decision making from the lead character Alex. He knows this dead chick is killing all these people, and instead of telling anyone else, he just continues implicating himself by burying the bodies. This movie also has a 60's and 70's 'Grease' feel to it as well with Alex's leather jacket and the greased back hair. Prom Night III seems to suffer with a personality disorder. It tries to be funny, tries to be supernaturally spooky, and tries to add a bunch of different elements to it as well. It's all over the place and not as good as part II. Mary Lou is completely different from the vixen we knew her as in \"Hello Mary Lou\". The ending is also very bizarre, but original at least. Prom Night III doesn't take itself very seriously, and neither do I. 5/10",
         "Overall, \"Prom Night III : The Last Kiss\" is a funny 80's slasher with black humor and intentionally funny death scenes. There's plenty of gore that looks very comical but it fits correctly in the movie's atmosphere. The acting is really good for the movie's standards. Tin Conlon delivers a funny performance when necessary. Courtney Taylor steals the show because she's extremely beautiful and she isn't afraid to show her delicious body. She isn't the best actress out there but she gives a sexy, funny performance. The rest of the cast is just okay. The movie is filled with cheesy one-liners and some comical situations with funny music in the background (for example, anytime the police men talked there was funny music). \"The Last Kiss\" has also an extra spice. The sex scenes are steamy and sensual. Courtney Taylor is probably the hottest ghost seductress ever to appear in a Horror movie. She is worth the watch but be sure to get the unrated version. The movie has many highlights in different fields. The death scenes are decent, the comical situations are well done, and the always beautiful Courtney Taylor demonstrates she's gorgeous every time she's on screen. Thanks for wearing that sexy nurse uniform Mrs. Taylor. Watch this movie if you are into cheesy slasher flicks with gore and black humor. This isn't a great movie by any means but it deserves a watch. Or in the other hand, if you like beautiful women like Courtney Taylor watch this movie! I watched only for her to be honest. Meet Alex, a geeky student with a normal life. He was a best friend that always tries to help him, a pretty girlfriend, and a perfect family. His life seems to be normal but it lacks of a \"spark\". His fate changes when he suddenly meets Mary Lou Maloney, a hot ghost that falls in love with him. Alex, little by little also falls in love with her because she helps him with his grades, in the football team, and in his life overall. The main problem is when he realizes too late that Mary Lou is a ghost that enjoys killing people. At some point, Alex admits to his best friend that he is in love with Mary Lou. But that's when things start to get worse because more people are started to get killed and he's the prime suspect. He also regrets about his romance with Mary Lou because he is cheating on his girlfriend. The life Alex always wanted has become a true nightmare. After police goes after Alex, things really get ugly for him. A shooting starts and he's taken to jail, but guess who rescues him? Mary Lou comes to his aid before interrumping the Prom Night dance at Alex's school. In one of the most bizarre endings in the 80's slashers, Alex and his girlfriend face Mary Lou in hell. Yes, that is meant to be hell.",
         "When I first watched Prom Night III: The Last Kiss, I thought it was a load of rubbish. Recently, though, I re - watched the film again and really loved it. I liked the humour in this film and found it to be entertaining. I take back what I said about it in my user comment on Prom Night IV: Deliver us From Evil. Actually, I like it more than Prom Night IV. The acting was okay also, as were the gore effects!",
         "Wicked and seductive femme fatale 50's prom queen Mary Lou Maloney (deliciously played to the perfectly vampy hilt by the gorgeous Courtney Taylor) escapes from hell and returns to the normal world to wreak all kinds of nasty havoc. Mary Lou falls for amiable, but average and underachieving nice guy Alex (a solid and likable performance by Tim Conlon). Pretty soon Mary Lou is bumping off anyone who gets in Alex's way. It's up to Alex's sweet girlfriend Sarah Monroe (a winning portrayal by the fetching Cyndy Preston) to save Alex from Mary Lou's evil clutches. Directors Peter Simpson and Ron Oliver (the latter also wrote the witty script) deliver a delightfully outrageous horror comedy riot that unfolds at a constant snappy pace, maintains an engagingly breezy and campy tongue-in-cheek tone throughout, and offers a handy helping of suitably over-the-top graphic gore (grisly highlights include electrocution by jukebox, two fingers being accidentally cut off with a pair of scissors, an annoying guidance counselor getting drenched with battery acid, an especially inspired impalement on a metal spiked football, and a heart being yanked out). The humor might be pretty crude and lowbrow, but it's still awful funny just the same. For example, Alex and Mary Lou make love on top of the American flag. Moreover, there's a hilarious parody of vintage 50's histrionic classroom VD scare films and the PA announcements are absolutely sidesplitting. Plus the wacky dialogue is simply priceless (all-time favorite line: \"I don't get mad; I bake\"). Conlon and Preston display a spot-on charming chemistry in the lead roles while Taylor has a field day as the sexy, yet sinister Mary Lou. Nice supporting contributions by Dylan Neal as cocky jock Andrew Douglas, David Stratton as Alex's easygoing smartaleck friend Shane Taylor, Jeremy Ratchford as the hopelessly geeky Leonard Walsh, Roger Dunn as bumbling principal Mr. Weatherall, and George Chuvalo as jerky biology teacher Mr. Walker. Rhett Morita's lively cinematography makes nifty use of crazy tilted angles and boasts plenty of hyperactive camera-work. Paul Zaza's shuddery score likewise hits the shivery spot. A real hoot.",
         "\"Prom Night III: The Last Kiss\" is the third installment of the series, following Part II, which was virtually unrelated to Part I. Mary Lou continues her rampage again at Hamilton High School. This time, Mary Lou's ghost falls for a teenage football player named Alex. She begins appearing to him, and she seems to be able to give Alex what ever he wants, when he wants it. But what he isn't aware of is that Mary Lou is an evil spirit, and she begins killing off all of his enemies and rivals, and he ends up losing his girlfriend too. Since Mary Lou is a ghost and nobody can see her, Alex is the only link to the murders and he becomes the prime suspect. I'm not sure if this sequel was intended to be scary or funny, because to me it was a heck of a lot funnier than it was scary. The whole setup of the movie is a bit random, and there are some genuinely funny scenes. Cheesy, but funny. Prime examples of this campy humor are when when Mary Lou appears to Alex at an ice cream stand in the biology classroom, and when Alex wakes up naked in the school and has to wrap himself in a flag. There are lots of gory scenes throughout the movie, but none of it is really taken seriously and the special effects aren't great. The acting was alright, and the plot was unrealistic. But it's what you would expect from a movie of this type. Overall, \"Prom Night III: The Last Kiss\" is a campy but funny horror flick. It's not scary at all, it turned out to be much more funny than terrifying. It's an okay way to pass an hour and a half. 5/10.",
         "The third film in the \"Prom Night\" franchise continues to steer the series further away from its slasher origins and closer to the supernatural and, well, corny. Mary Lou, the undead bombshell from the previous film, returns to Hamilton High and takes a liking to Alex Gray, a football player who is bored with his current situation and craves a bit of spice in his life. When the two hook up, Alex gets more than he bargained for, although, strangely enough, doesn't seem all too shocked or surprised by a lover who is more than thirty years past her expiration date and who will do literally anything for him, which includes killing his teachers and classmates in only the most ridiculous ways possible. \"Prom Night III: The Last Kiss\" is the sort of film that doesn't take itself too seriously, and upon viewing it, neither should you. There are no serious thrills to be found in this often cartoonish and over-the-top sequel, but there is plenty of fun to go around. From the silly death scenes, which are complimented by comically underwhelming reactions from star Tim Conlon, who appears to have little to no regard for the value of human life. Likewise Mary Lou, played this time around by where-is-she-now Cyndy Preston, gives Freddy Krueger a run for his money with the amount of cheesy one-liners that are thrown around and with the way she lashes out with those ridiculously long fingernails (side-bar: I'd hate to be Alex's back). There are also other little moments, such as the school-intercom gags and the Charlie Brown-ish phone call that Alex makes to his parents. These bits ensure that the film is hardly threatening in the slightest, and at best, is a light-hearted late-night romp that takes a certain sort of mood to appreciate. Put simply, it's a stupidly funny horror comedy that won't fail to entertain, even if it tends to induce a few facepalms. This film is best taken with a grain of salt.",
         "Third instalment to the PROM NIGHT series is a sequel only to the second film, ignoring the original (Much like the second). This time evil high school ghost Mary Lou Maloney escapes hell & once again haunts the hallways of Hamilton High, killing people with juke boxes, drowning them in battery acid, killing them with ice cream cones that kind of thing. Only this time she has fallen in love with a handsome average student named Alex who is also on the football team & whom has a girlfriend. But all is not perfect for Alex, his grades are slipping, making his dreams of becoming a doctor to go down the drain, he's almost off the football team & his relationship with his girlfriend is also falling apart slowly, but after spending a few nights with sexy Mary Lou, it all changes, Alex's grades sky rocket (thanks to Mary Lou killing his snooty guidance counsellor & his obnoxious science teacher) & his role on the Football team soon goes from mediocre to the new football star! (it also helps that Mary Lou killed his rival, a big dumb jock bully) however when the body count rises, Alex realizes after burying the messy remains that he has to do something & soon he wants to break off their \"Relationship\" which angers Mary Lou, setting off a string of more inventive & equally gross murders, in which Alex soon starts to see his friends falling victim & himself blamed for the murders! While trying to prove his innocence, Alex soon realizes that the old saying \"Breaking up is hard to do\" takes on an entirely different new meaning with Mary Lou & when Mary Lou determines to make him hers by taking him to hell, Alex's girlfriend sets to rescue Alex, but only if she can get past Mary Lou's zombies henchmen. I admit it, I wasn't all that crazy about PROM NIGHT III, when I first saw it, I saw it very few times (much like the mediocre original) & I couldn't get into it nor understand it. However after recently buying the series on DVD I decided to give the film another chance & well I highly enjoyed it this time! This third film abandons the scariness of the second & goes for a more comedic approach (not surprising since horror/comedies were quiet popular at the time) unlike most horror/comedies though, this one actually works (Love the announcements on the P.A system) the kills are gory & inventive when they need to be & often played for laughs, with all of the victims mainly deserving of their fates (well most of them anyways) not to mention they're fun, such as Mary Lou's old boyfriend, now a school janitor getting electrocuted against a jukebox, from which his pacemaker pops out, a snooty guidance counsellor being dosed in battery acid, a football tossed at the school president/bully/football jock that turns into a spinning drill, that drills itself into him, two ripped out hearts, electrocuted guards, a strangled nerd, a science teacher killed by ice cream cones & then covered in whipped cream, ice cream & fruit etc. Thankfully these kills are all on screen & the gore is plentiful, thankfully that is, since most horror films that arrived by 1990 were almost bloodless.The acting & directing above the norm for this type of film & the story is very easy to get hooked into & moves at a fair pace. The film ultimately fails to provide any chills, not surprisingly, due to the films goofy tone. For instance Mary Lou is made into a Freddy Kruger type character, with her one liners & jokes before & after she has killed a victim (Unlike her dead serious, non joking motives in the equally serious PROM NIGHT II) in fact in a nod to the NIGHTMARE series, Mary Lou's nails shoot out of her finger tips, like long claws in one sequence. Heck even her wardrobe is different than the one she wore in the second (Can ghosts change their clothes)? The acting is fairly good here. The direction is pretty good as well, although with two directors at the helm, one would think the film's direction would blow things right out of the water, but it never really does. COURTNEY TAYLOR replaces LISA SCHARAGE in the original & is fun to watch, she's a great actress able to go from sexy vixen to a cold hearted murderer on cue. Sadly while the film is entertaining for a while, once Alex's girlfriend heads back in time to rescue him from Mary Lou's evil clutches, the film falls apart, with a major let down of a conclusion & an unnecessary set up for a continuation of Mary Lou's reign of terror, which never came in the next sequel. What's interesting is how the film doesn't seemingly pick up from the second film at all. That film ended with Mary Lou possessing the school Principal, who was the date she ditched at the prom years prior, driving away with his son & the girl, she originally possessed. However at the beginning, Mary Lou is back in hell, surrounded by 1980's style aerobic dancers, before she manages to escape using her nail file & get out of her knee shackle & re-enters the world of the living & the events of Part II are never ever referenced not even once. In fact, as already stated in my summary, the film could be looked at as the horror movie version of MEATBALLS III, where a seemingly average teen's life is turned upside down by a sexy female ghost. Highly recommended to horror fans! Followed by a sort of connected sequel, PROM NIGHT IV: DELIVER US FROM EVIL *** stars"
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Norstar Entertainment",
         "Comweb Productions",
         "Famous Players"
      ],
      "summaries": [
         "Mary Lou, the prom queen burned to death by her boyfriend back in the fifties, has escaped from hell and is once again walking the hallways of Hamilton High School, looking for blood. She chooses as her escort in world of the living Alex, an average depressed student with dreams of one day becoming a doctor. As Mary Lou begins to get back into form, the body count starts climbing and the graduating class of Hamilton High is once again smaller than expected.",
         "A murdered high school girl returns from the grave and hypnotizes a student into helping her commit revenge murders."
      ],
      "budget": 0
   },
   "movielensId": 1989,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-03-30",
      "dvdReleaseDate": "2003-09-23",
      "directors": [
         "Ron Oliver",
         "Peter R. Simpson"
      ],
      "runtime": 97,
      "movieId": 1989,
      "title": "Prom Night III: The Last Kiss",
      "mpaa": "R",
      "actors": [
         "Tim Conlon",
         "Courtney Taylor",
         "Cynthia Preston",
         "Dylan Neal",
         "David Stratton",
         "Jeremy Ratchford",
         "Roger Dunn",
         "George Chuvalo",
         "Lesley Kelly",
         "Brock Simpson"
      ],
      "imdbMovieId": "0098136",
      "originalTitle": "Prom Night III: The Last Kiss",
      "genres": [
         "Comedy",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["2pRvaN0yUe0"],
      "plotSummary": "Mary Lou, the prom queen burned to death by her boyfriend back in the fifties, has escaped from hell and is once again walking the hallways of Hamilton High School, looking for blood. She chooses as her escort in world of the living Alex, an average depressed student with dreams of one day becoming a doctor. As Mary Lou begins to get back into form, the body count starts climbing and the graduating class of Hamilton High is once again smaller than expected.",
      "tmdbMovieId": 41828,
      "avgRating": 1.56218,
      "releaseYear": "1990",
      "numRatings": 193,
      "posterPath": "/bJOpzoUXeYhruTAc3PBbvKAeLpd.jpg"
   }
}