{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "car mechanic",
            "id": 3296
         },
         {
            "name": "letter",
            "id": 3344
         },
         {
            "name": "normandy",
            "id": 4299
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "single",
            "id": 9457
         },
         {
            "name": "umbrella",
            "id": 41277
         },
         {
            "name": "1950s",
            "id": 208611
         },
         {
            "name": "1960s",
            "id": 208992
         }
      ],
      "imdb_id": "tt0058450",
      "video": false,
      "title": "The Umbrellas of Cherbourg",
      "recommendations": [
         2433,
         5544,
         2457,
         43904,
         427,
         1818,
         10227,
         2786,
         934,
         16672,
         649,
         40641,
         776,
         4024,
         1859,
         35838,
         976,
         266,
         216,
         777
      ],
      "backdrop_path": "/k5LmD06FxzBdf2Po1wWGnOQhqOY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Geneviève Emery",
               "gender": 1,
               "credit_id": "52fe4433c3a36847f80880d7",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Guy",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80880db",
               "name": "Nino Castelnuovo",
               "profile_path": "/edyUJkPj8k8bEiRb4XFIlnqoCG9.jpg",
               "id": 5476,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Madame Emery (Mutter)",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80880df",
               "name": "Anne Vernon",
               "profile_path": "/5Xtsnl2JxWNloPHsx6cjN8LSaPk.jpg",
               "id": 28608,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Tante Élise",
               "gender": 1,
               "credit_id": "52fe4433c3a36847f80880e3",
               "name": "Mireille Perrey",
               "profile_path": "/pJeNF7Ywu1NtiIN1gTDXSvGSH5L.jpg",
               "id": 46935,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Roland Cassard",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80880e7",
               "name": "Marc Michel",
               "profile_path": "/b7QbG4DDom3uPv6FMaVgV9HlAAc.jpg",
               "id": 46936,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Madeleine",
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880eb",
               "name": "Ellen Farner",
               "profile_path": null,
               "id": 46937,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Aubin",
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880ef",
               "name": "Jean Champion",
               "profile_path": "/cPmXNw1jbJzFzs3h09ZLICyQYhu.jpg",
               "id": 18767,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Bernard",
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880f3",
               "name": "Pierre Caden",
               "profile_path": null,
               "id": 46938,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Jean",
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880f7",
               "name": "Jean-Pierre Dorat",
               "profile_path": null,
               "id": 46939,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880b5",
               "name": "Jacques Demy",
               "profile_path": "/7f4Rg6B6HXM8gybOVVLWKYK2Bqw.jpg",
               "id": 24882,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80880bb",
               "name": "Jean Rabier",
               "profile_path": "/29EbAiWCdqcvhjpcaNZZ93fF2mO.jpg",
               "id": 19086,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880c7",
               "name": "Monique Teisseire",
               "profile_path": null,
               "id": 46934,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880cd",
               "name": "Bernard Evein",
               "profile_path": null,
               "id": 24296,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880d3",
               "name": "Jacqueline Moreau",
               "profile_path": null,
               "id": 32098,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80880fd",
               "name": "Mag Bodard",
               "profile_path": "/bvmRx2TJbwXOLvFma1ywT7LCwZS.jpg",
               "id": 26013,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f8088103",
               "name": "Gilbert de Goldschmidt",
               "profile_path": null,
               "id": 26011,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f8088109",
               "name": "Jacques Demy",
               "profile_path": "/7f4Rg6B6HXM8gybOVVLWKYK2Bqw.jpg",
               "id": 24882,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f808810f",
               "name": "Anne-Marie Cotret",
               "profile_path": null,
               "id": 45532,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5384f661c3a36805a400b739",
               "name": "Michel Legrand",
               "profile_path": "/ewYlyU0UvONnt7jjHhaSXCKVHVa.jpg",
               "id": 10934,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.96045,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 5967,
      "vote_count": 152,
      "budget": 0,
      "overview": "This simple romantic tragedy begins in 1957. Guy Foucher, a 20-year-old French auto mechanic, has fallen in love with 17-year-old Geneviève Emery, an employee in her widowed mother's chic but financially embattled umbrella shop. On the evening before Guy is to leave for a two-year tour of combat in Algeria, he and Geneviève make love. She becomes pregnant and must choose between waiting for Guy's return or accepting an offer of marriage from a wealthy diamond merchant.",
      "similar": [
         872,
         11631,
         69,
         2604,
         403,
         252,
         746,
         8092,
         4688,
         409447,
         444902,
         16520,
         10654,
         1125,
         33511,
         30197,
         177888,
         31439,
         28658,
         15677
      ],
      "original_title": "Les parapluies de Cherbourg",
      "runtime": 91,
      "poster_path": "/ju5W8qvWfjXXGaR7wd9wSyuYXhS.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Parc Film",
            "id": 14680,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Madeleine Films",
            "id": 1147,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Beta Film",
            "id": 1080,
            "origin_country": ""
         }
      ],
      "release_date": "1964-02-19",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "a film for all the young lovers of the world",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jacques Demy"],
      "runtime": 91,
      "synopsis": "Madame Emery and her daughter Geneviève (Deneuve) sell umbrellas at their little boutique in the coastal town of Cherbourg in Normandy, France. Geneviève is in love with Guy (Castelnuovo), a handsome young auto mechanic who lives with and cares for his sickly aunt and godmother Elise along with her quiet, dedicated, care-giver, Madeleine (Ellen Farner), a young woman who clearly loves Guy. Subsequently, though, Guy is drafted, and must leave to fight in the Algerian War. The night before he leaves, he and Geneviève make love. She becomes pregnant, and feels abandoned, as he does not write often. At her mother's insistence, she marries thirtyish Roland Cassard (Marc Michel), a quietly handsome Parisian jeweler who falls in love with Geneviève and is willing to wed her, even though she is carrying another man's child (Cassard had previously wooed the title character in Lola, only to be rejected once the father of her child returned; he relates an edited version of this story to Madame Emery with ill-concealed bitterness). The society wedding in a great cathedral shows Geneviève's upward social and economic movement, but she does not seem at all happy with her situation, and clearly feels trapped. When Guy returns with a leg injury, he learns that Geneviève has married and left Cherbourg, and that the umbrella store is gone. He attempts to ease back into his old life, but becomes rebellious due both to the war and to the loss of Geneviève. One day, Guy quits his job after an argument with his boss, and spends a night and a day drinking excessively in seedy port bars. He winds up sleeping with a prostitute named Jenny, whose real name turns out to be also Geneviève. When he returns to his apartment, Madeleine tells him tearfully that his godmother has died. He sees that Madeleine loves him, and cleans up his life with her encouragement. With an inheritance from his aunt, he is able to finance to own a new \"American-style\" Esso gas station. He asks Madeleine to marry him, and she accepts, though she wonders if he is asking her from despair at Geneviève's actions. The coda is set in December 1963, approximately five years after the earliest events. Guy is now managing the couple's Esso station. He's with his now upbeat and loving wife Madeleine and their little son François. It is Christmas Eve. Madeleine and François go for a short walk, leaving Guy briefly, after which a new Mercedes pulls in to the station. The mink-clad driver turns out to be a sophisticated, visibly wealthy Geneviève, accompanied by her (and Guy's) daughter Françoise, who remains in the car. At first shocked to see each other, they go inside the station to talk, and Geneviève explains this is the first time she has returned to Cherbourg since her marriage. Her fairly young mother is now dead. Her rich husband and child are the only family she has left. She has evidently had no children by Cassard, and she makes no mention of him. The two converse while Geneviève's car is being filled with gas, and Geneviève asks Guy if he wants to meet their daughter. Without comment, and little reflection, he answers \"no\", and this leads to their exchanging their final goodbyes. As the film ends, Guy greets his wife with a kiss and plays with his son.",
      "writers": ["Jacques Demy"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0058450/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5NzQ2NTQ5OF5BMl5BanBnXkFtZTgwMzYyNTM3MjE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Catherine Deneuve, Nino Castelnuovo, Anne Vernon | See full cast and crew »"],
      "reviews": [
         "Some things are so wonderful you can't quite believe they exist. A technicolour heaven with a young Catherine Deneuve at her most beguiling and beautiful in a film that's entirely sung in the most exquisite way? Pinch me, I still can't get over the fact this film exists. Everyone has a film they return to when they're feeling jaded, sick of Hollywood or simply because it's raining outside. I have two films I turn to at these times. One is Singin' in the Rain; the other is this little gem. Both transport me to a world of colour, joy and heartache, yet both stay just the right side of sentimental too. Of course the plot is a little convoluted; of course the entirely sung script makes it a little jarring at first - but just sit back and let Les Parapluies do its magic. You won't regret it. I promise ;-)",
         "Maybe not. Les Parapluies de Cherbourg is one of the most beautiful movies ever made with an enchanting and haunting score by Michel Le Grande, and totally focused, sharp and creative direction by Jacques Demy. Catherine Deneuve gives a fine performance in pinkish white makeup with her blonde hair pulled away from her famous face, at twenty playing a seventeen-year-old shopkeeper's daughter who falls in love with a garage mechanic. He is called away to the war in Algeria after making her pregnant. Will she wait for him as the award-winning song proclaims? Will their love endure the long separation? All the dialogue is sung. The script is terse with nothing extraneous to the bittersweet story. Because the dialogue is stripped to the barest essentials, the singing seems natural and enhances the dream-like quality established early with the rain falling on the umbrellas and the cobblestone streets of the seacoast town. The sets are splashed in vivid color. Everything is superficially romantic, but the events are the starkest realism. When a young girl if forced to choose between love and security, which does she choose? It depends on the circumstances, and sometimes circumstances and the passage of time can change her heart. I was a teenager in France when this was made in the sixties. The backdrops of the white Esso gas station, the red and yellow passenger train cars, the bouffant hair styles on the girls, their eyes heavily made up with mascara and black eyeliner, the ubiquitous bicycles and the little French \"cigarette roller\" cars all brought back vivid memories of youth as did the musical score. A question: what ever happened to the \"other\" girl, Ellen Farner who played Madeleine? To be honest I found her more attractive than Deneuve who of course went on to become a great star and an acclaimed international beauty. Farner was never heard from again. Some scenes made more effective by their simplicity: When Genevière (Deneuve) returns home after a late evening with Guy, her mother (Anne Vernon) surveys her daughter and exclaims, \"What have you done?\" Genevière retorts sharply, \"Mama!\" and it is clear what she has done. Also, as Guy is going off to the army Madeleine arrives upon the scene as he is saying good-bye to his stepmother who is ill. They exchange glances that reveal Madeleine's love for him. And then she sings out softly in the heartfelt regret of parting, \"Adieu, Guy.\" We know these are not the last words that will pass between them. Additionally, the brief, beautifully structured, final scene at the shiny new Esso gas station is not to be forgotten. The scenes with Roland Cassard (Marc Michel), the suave, traveling man of means who sells Madame Emery's jewelry so she can pay the taxes on her umbrella shop, are nicely staged so that we can see at a glance that he is enormously taken with Genevière and that the mother will do everything possible to further his case. It is agreeable for those identifying with Genevière that Roland is not only well off financially, but is as handsome as the garage mechanic. But will he still want her when he learns that she is pregnant with another man's child? Jacques Demy who also wrote the script is to be commended for the effortless pace and tight focus of this romantic tale of star crossed lovers. I wish every director had such an ability to cut the extraneous and concentrate on the essentials without intrusion. The tale is an atmospheric tour de force of love lost and gained, of bourgeois values triumphant. This might be a bit precious for some, but upon seeing this for the third time, I can tell you I was enchanted anew. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "A glorious film just a few things to add to what everyone else has said [NB SPOILERS towards the bottom of the page - not that the plot is exactly a suspense] - It's a \"realistic\" story on the face of it. The whole thing is reminiscent of the \"verismo\" Italian operas from the end of the 19th century, like Cavalleria Rusticana, where soap-opera plots about ordinary people are set to emotionally stunning over-the-top drama-queen music - inherently a democratic kind of style, saying that shopworkers and little old ladies have as much right to passion and glory as kings or gangsters or movie stars. - Yes, the singing is silly. But the film knows this - in the very first scene the men in the washroom joke about \"Carmen\" (another example of the same style) and one of them sings something like \"I'm going to see a film, I don't like Opera, I can't stand all the singing\". Its a film that *knows* mechanics don't (usually) sing arias while they check the oil, and makes a joke about it. Buffy fans will have got the same point from \"Once more with feeling\" - the Fundamental Problem of the Musical is: \"why is everybody singing?\" - But there is something unrealistic about it, the beauty. Everyone and everything is good-looking. The people are beautiful. The dirty old town is beautiful. Cheap bars are beautiful. Squalid damp flats are beautiful. Abandoned hulk ships are beautiful. A garage forecourt with petrol pumps and a canopy is beautiful. All the men are good-looking. And as for the women - someone asked why more men than women like this weepy film. The obvious answer is Catherine Deneuve. But Anne Vernon playing her mother is cuter than anyone her age has a right to be. And as for Ellen Farner... Guy has not one but two stupendously attractive women after him, which is about 1.99 more than the average member of the audience. - The costumes match the background far too often for it to be anything but deliberate. At first its even more confusing than the singing. Madame Emery dresses differently to match the wallpaper of the shop and her flat, sometimes her clothes even seem to change colour for no reason other than to match the scenery. Genevieve stands in front of a window while a truck that's exactly the same shade as her cardigan pulls up behind her. When she tries on her maternity dress it has the same combination of royal blue background and pink flowers as the wallpaper behind her. When she walks past the docks with Roland they are both wearing different shades of off-white - hers matches the rusting paint on the old ships, his matches the cliffs visible in the distance. When Guy and Madeleine sit next to each other outside the cafe her orange-brown clothes and even her lipstick match the door behind her while his dark brown jacket matches not only the wood behind him but also her hair - exactly the same trick we've seen when he was sitting next to the prostitute Jenny with her red dress on front of the red screen inside the other bar. We are in fantasy land here, even if it looks a little like Cherbourg. - but this is all the same as the singing. To ask \"how does a poor family afford such clothes?\" or \"why is the delivery van exactly that shade of yellow?\" is to miss the point as much as to ask \"why does a shopkeeper sing to his customers?\" or \"why does it always rain when we say goodbye?\". In this movie, in this fantasy land, the world is turned upside down, the meek can inherit the earth (or at least look as if they might), small-town Cherbourg is as romantic as Paris, sailors and truck-drivers sing while they work, the poor wear clothes that money can't buy, the scenery changes colour to match your wardrobe, every man looks like a leading man, and every shop-girl truly is as beautiful as any duchess. - This is \"Singing in the Rain\" set in the backroom of a shop instead of the back lot of a Hollywood studio, this is \"West Side Story\" without the violence, this is a small-town \"Moulin Rouge\", this is \"Brief Encounter\" on acid. - It's not a tragic ending, any more than the endings of Casablanca or Brief Encounter are tragic. It's the right ending. We're not so much sad for Genevieve - even though we are crying - as we are happy for Roland (who deserves a break. Even though we know he's probably a crook) If we are crying its because Guy needs to hug Francoise. We expect that the marriages will work out in the end - maybe they have worked out already. If these people are not going to be happy its not because they married the wrong partners. - and what other film has had hundreds of thousands of viewers in floods of tears watching an aerial shot of an Esso service station?",
         "In 1957 France a 17 year old shop girl (Catherine Deneuve) is in love with a gas station worker (Nino Castelnuovo). Her mother is totally against the romance. He's called off to serve in the war for two years. They must part but have sex before he leaves. Then she discovers she's pregnant... Sounds terrible but it isn't. All the dialogue is sung and the film is done in just breathtaking color--all the sets are decorated to take advantage of this. The colors just leap out at you and some of the scenes are unbelievably beautiful. The musical score is haunting and Deneuve (who became known by this film) and Castelnuovo make a very attractive, sympathetic couple. The film is just gorgeous--I can't stress enough how beautiful it is and the music (especially the title theme) is so moving. It all leads up to a finale that has me crying every single time I see it. It IS a happy ending (sort of) but the emotions of the two characters really tear you apart. The acting is good, the film moves quickly (90 minutes) and--quite simply--this is one of the best foreign films ever made. It's not for everybody but if you're a romantic (like me) you'll love it. But be warned--have PLENTY of tissue handy for the end. I've seen it four times and I STILL cry at the end! A definite must see. A 10+.",
         "The first of the three segments is perhaps the sunniest film ever made. It's a totally original film (at least from what I've seen); so original, in fact, that at first it's kind of off-putting -- the artificiality of the bubble gum colors (in the first segment, as they change slightly as each moves into the next), the constantly moving camera, and the fact that all of the lines are sung makes it hard to get situated within the film, for the same reason that you turn the car radio down when you're driving down a street trying to read house numbers. (\"I can't follow the plot, they keep singing...\") And yet Demy isn't satisfied with just being sunny (and his brightness is never garish); each segment has a specific feel, the grandest being the last, with an ending that's just right. (Though it should be said that Demy never once sacrifices the pleasure he creates, nor does he fall into any stale conventions, even while his story is based on the oldest of movie clichés -- wait for me!). I hesitate to use the word melodrama, but that's essentially what the film is, both for the meaning of the word \"melo\" (music) and for the heightened emotions brought on my the music. It feels like we've got our head in the clouds, not least of all because the acting is aided by, well, the singing. The music, which is nearly always splendid (and never song-and-dancey), compliments the actors. At first the acting is very plain; or at least, it seems that way. I think that's due to the unconventional approach. Deneuve's loveliness as a young woman keeps us from responding to much aside from her beauty (and she starts off as a typical love-struck sixteen year-old), but by the end she's quite a different person, and to overuse a term applied to Deneuve, she becomes elegant. (I kept looking at her handsome costar thinking Alain Delon would have been perfect in the role; then I learned his most noteworthy film aside from this one was the Delon-starring Visconti film, \"Rocco and His Brothers.) Surely some people would probably vomit at a film of such shameless exhibitionism and style, but I was left astonished, thinking, How in the hell did they pull it off? 9/10",
         "I saw this movie in 1964 when I was 11 years old. It was my introduction to heartbreaking love and this movie probably influenced my love life or how I imagined love was supposed to be. My mother had to lead me from the theatre when it was over because I was blinded with tears. Many years passed until I was able to order the film in VHS and watch it again (about 3 years ago). I still love it. The vivid colors, Genevieve and Guy's beauty and youth, and the beautiful score by Michele LeGrande combine to transport you to a magical place. I loved the fact that every word was sung, but it was not like opera at all. After a few minutes it was as if every word is always sung and talking doesn't exist. Catherine Deneuve was so beautiful! I love this movie and highly recommend it.",
         "This must be amongst the most distinctive, idiosyncratic and exquisite films I have seen in a long while. There is nothing particularly new about the plot, which is a straightforward and uncomplicated love story divided into three acts, but the beauty of this film is in the telling of it. All the dialogue in this film is sung, which at first is a little unsettling, but it actually takes very little time to adjust to. The verse/chorus format of popular music and the musical genre is eschewed for an approach more resembling a modern opera, as the characters croon their lines to each other over a continuous score. This gives the most banal of lines a rhythm and cadence of their own. Because of this I found the French a lot easier to understand than with more naturalistic films, which was fairly handy for me as the print I was watching was with Dutch subtitles! I must confess, I did find that the music (written by Michel Legrand) began to grate towards the end of the 87 minute running time but even so there is still much to admire here. Visually it's stunning, with a bold and vibrant colour palette of almost hallucinogenic intensity and sumptuous costume and set design (that wallpaper!). The opening credit sequence sets the mood perfectly: a birds eye view of the inhabitants of Cherbourg in the rain beneath their umbrellas as they walk across the frame is reduced to a colourful abstraction. Catherine Deneuve is predictably gorgeous and the first act of the young couples courtship is one of the most beautifully pure pieces of cinema I can think of. It reminded me a bit of 'Jacques Brel is Alive and Well and Living in Paris', a film which I saw in television a long time ago and would do absolutely anything to get hold of a copy. 'Les Parapluies de Cherbourg' is a wonderful, sincere and uplifting film that everyone should go and see at least once, and preferably on a big screen. Once seen, never forgotten.",
         "1. Coloring, that is absolutely matchless 2. Even the first notes of the main theme make you cry 3. Unique way of singing in a musical 4. One of the most touching love stories 5. Beautiful Catherine Deneuve 6. It's not American 7. Made in the sixties 8. You can watch it over and over again 9. Since you've once seen it.. you must watch it over and over again 10. Esso-scene Ten more or less good reasons why this just might be the one.. the favorite movie of mine. I partly understand people who hate it, the singing is the main reason i think. But the unique way of singing! Not in the traditional way this is a musical, people just happen to sing when they talk. And the music (especially main theme) is so hauntingly beautiful it really does make you want to cry when you hear the first notes. The coloring is like in no other film. The clothing and background have been matched in every single scene of the movie. That's real cinema, that's beautiful! And if that's beautiful already, then what comes when the 20-year old Catherine Deneuve is in the lead role! Just WOW! Once again I don't bother explaining any of the plot, because there's no point really...but one of the saddest scenes in movie history, is the Esso-scene in this one. Watch it! if you're not too busy watching the latest Van-Damme.",
         "I heard so much about this film but missed seeing it in 1964 during its first release simply because it was never shown here. I finally got to see it 40 years after its debut and it remains as fresh and enchanting as I imagined it to be. The film is quite heartbreaking because Genevieve (Catherine Deneuve) did not persevere in her love for Guy. I can only imagine what pain Guy had to bear facing war in Algeria knowing his fiancée back home was pregnant with his child and he couldn't do anything about it. The blaze of colors in the movie was a contrast to the somber atmosphere of infidelity and lost love. I suppose they both had fairly good marriages but we can gleam that they did not reach the pinnacle of joy and had to settle for second best in the end. It sort of reminded me of Elia Kazan's \"Splendor in the Grass\"--Warren Beatty's character and Natalie Wood's character--they did not \"live happily ever after\"--they just settled for second best. It is very clear that Genevieve continued to carry the memory of her lost love--otherwise she would not have made the detour to Cherbourg and meet Guy \"accidentally\"...It was such a heartbreaking scene--they meet each other after many many years and they have named their children with the same name--the name they planned to give their first-born as they made their future plans together before he leaves for his army stint. I wonder, would it still be as beautiful if it ended happily? In any case, it is one of the most unforgettable films I have ever seen. Try to get hold of the DVD copy for your collection. :-)",
         "A very French, very idiosyncratic musical that while lacking any discernible 'songs' or dance routines manages to be one of the most affecting musicals ever written. Remy says he was inspired by American musicals, and yet a more non-American could hardly be imagined. Can we really pretend that an American studio in 1963 would endorse the story of pre-marital sex and the romance of marrying a 17-year old girl pregnant with another man's child and not feel the need to moralize or condemn? Only in France, and thank God for it. All the cast are brilliant - charming and charismatic; the production design looks like a psychedelic gingerbread house; the score is exceptional; the singing genuinely heart-felt and moving; and the whole thing is carried off with such effortless confidence and unreserved joy that it's impossible not to fall in love with it."
      ],
      "genres": [
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Parc Film",
         "Madeleine Films",
         "Beta Film"
      ],
      "summaries": [
         "Told in four acts, the lives of Geneviève Emery and Guy Foucher of Cherbourg France are presented. Act 1 begins in November 1957, when sixteen year old Geneviève, who works in her widowed mother's umbrella shop called \"Les parapluies de Cherbourg\", and twenty year old Guy, who works as a mechanic at a gas station, are madly in love and want to get married. They are reluctant to tell anyone not only of their want to get married, but of their relationship. Geneviève believes her mother will think her too young, and would want her to marry someone with better prospects, especially considering her own tenuous financial situation. And Guy is more concerned now about not abandoning his ailing godmother, Aunt Élise, who raised him, and who he looks after along with a young woman named Madeleine. Act 2, told largely from Geneviève's perspective, begins in February 1958. Guy, drafted to fight for the French in Algeria, has been gone for two months, and is expected to be gone for two years. Geneviève rarely hears from Guy. In order to solve their many problems, Geneviève's mother wants her to marry Roland Cassard, a refined and well appointed diamond merchant who travels often for his work but who is devoted to Geneviève whenever he is in Cherbourg. Geneviève, who still loves Guy but who she is slowly losing in terms of him as a person in her mind, has to decide what to do about Roland, especially as it may become more difficult to accept his proposal as time progresses. Act 3, told largely from Guy's perspective, begins in March 1959 upon his military discharge and return to Cherbourg. Life circumstances, including what happened during the war, has changed Guy, and he has to figure out what the next phase of his life will look like because of his new perspective. Act 4 takes place on one snowy day in December 1963, when Geneviève and Guy are shown in their current lives, that based on what has happened in those previous three acts.",
         "This is the story of 16 year-old Genevieve and 20 year-old Guy who are very much in love. Her kindly mother, who runs an umbrella shop, won't hear of her marrying, particularly as Guy has yet to complete his compulsory military service. Genevieve is heartbroken when he leaves for his army service in colonial Algeria and is upset to have received only one letter from him in two months. She's also pregnant. Her mother has a solution to the situation in the form of diamond merchant Roland Cassard who has helped them out in the past. Roland is a kind man who accepts to raise Genevieve's child as his own. By the time Guy returns from Algeria Genevieve is married and the umbrella shop has been sold. Several years later, they meet again.",
         "Geneviève, 17, lives with her widowed mother, who owns an umbrella shop in Cherbourg. She and Guy, a twenty-year-old auto mechanic, are secretly in love and want to marry, but when she reveals this to her mother, her mother objects on the grounds that Geneviève is too young and Guy is not mature or well-established enough, particularly since he has not yet done his required military service. Shortly after this, Guy is drafted to serve in the war in Algeria. Before he leaves, he and Geneviève consummate their love for each other, which results in her becoming pregnant. While Guy is away they drift apart, and Geneviève, strongly encouraged by her mother, accepts a marriage proposal from a well-to-do gem dealer named Roland Cassard, who has fallen in love with her at first sight and has promised to bring up her child as his own. (The character of Cassard is continued from Demy's earlier film Lola, das Mädchen aus dem Hafen (1961).) Guy is wounded and is discharged before his two-year term is up, but when he returns to Cherbourg Geneviève has already married and moved away. He struggles with depression and anger, but eventually is healed by falling in love with and marrying Madeleine, a young woman who had been caring for his now-deceased aunt Élise. Using an inheritance from his aunt, Guy fulfills his ambition of opening a service station. Years later, the now conspicuously wealthy Geneviève, traveling with her daughter, Guy's child, accidentally meet Guy at his service station. While the two have only a brief conversation about the state of their respective lives, the conversation is clearly fraught with unspoken fondness and regret.",
         "A young girl separated from her lover by war faces a life altering decision."
      ],
      "budget": 0
   },
   "movielensId": 199,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1964-02-19",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Jacques Demy"],
      "runtime": 91,
      "movieId": 199,
      "title": "The Umbrellas of Cherbourg",
      "mpaa": "",
      "actors": [
         "Catherine Deneuve",
         "Nino Castelnuovo",
         "Anne Vernon",
         "Mireille Perrey",
         "Marc Michel",
         "Ellen Farner",
         "Jean Champion",
         "Pierre Caden",
         "Jean-Pierre Dorat"
      ],
      "imdbMovieId": "0058450",
      "originalTitle": "Les parapluies de Cherbourg",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "4h-w5qM2VMM",
         "imCOi7pqKh0"
      ],
      "plotSummary": "This simple romantic tragedy begins in 1957. Guy Foucher, a 20-year-old French auto mechanic, has fallen in love with 17-year-old Geneviève Emery, an employee in her widowed mother's chic but financially embattled umbrella shop. On the evening before Guy is to leave for a two-year tour of combat in Algeria, he and Geneviève make love. She becomes pregnant and must choose between waiting for Guy's return or accepting an offer of marriage from a wealthy diamond merchant.",
      "tmdbMovieId": 5967,
      "avgRating": 3.77142,
      "releaseYear": "1964",
      "numRatings": 1669,
      "posterPath": "/ju5W8qvWfjXXGaR7wd9wSyuYXhS.jpg"
   }
}