{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monk",
            "id": 345
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "nun",
            "id": 745
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "casual sex",
            "id": 172454
         }
      ],
      "imdb_id": "tt0105179",
      "video": false,
      "title": "Prom Night IV: Deliver Us from Evil",
      "recommendations": [
         41828,
         39929,
         34312,
         216683,
         28082,
         32595,
         106427,
         40252,
         87704,
         41848,
         40251,
         38500,
         26959,
         70553,
         59762,
         38499,
         39895,
         37526,
         26958,
         67737
      ],
      "backdrop_path": "/ijAmcuTQLz5CpTK8kvb4Mn1sHQW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Meagan",
               "gender": 1,
               "credit_id": "52fe45dbc3a36847f80de805",
               "name": "Nicole de Boer",
               "profile_path": "/2aEdXU5l5VAPfFpDV1Z1j0CbysI.jpg",
               "id": 5888,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mark",
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de809",
               "name": "J.H. Wyman",
               "profile_path": "/jF1yBNkbr9pAeyOM8HKMnbS5pUr.jpg",
               "id": 49825,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Laura",
               "gender": 1,
               "credit_id": "52fe45dbc3a36847f80de80d",
               "name": "Joy Tanner",
               "profile_path": "/l3sJo5bjXR5moKD9TcPXmJ3KxqD.jpg",
               "id": 168615,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jeff",
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de811",
               "name": "Alle Ghadban",
               "profile_path": null,
               "id": 179962,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Father Jaeger",
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de815",
               "name": "Kenneth McGregor",
               "profile_path": "/6NeXaUMfBhEngZEvk6kETPK5Ekn.jpg",
               "id": 115856,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Father Jonas",
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de819",
               "name": "James Carver",
               "profile_path": null,
               "id": 1265448,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Father Colin",
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de81d",
               "name": "Brock Simpson",
               "profile_path": null,
               "id": 1042872,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lisa",
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de821",
               "name": "Krista Bulmer",
               "profile_path": null,
               "id": 1265449,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Rick",
               "gender": 0,
               "credit_id": "54ff75699251413d9f000526",
               "name": "Brad Simpson",
               "profile_path": null,
               "id": 1437790,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Brad",
               "gender": 2,
               "credit_id": "5870c98f925141356c00685b",
               "name": "Phil Morrison",
               "profile_path": null,
               "id": 1734415,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Louise",
               "gender": 0,
               "credit_id": "58cd37479251415a8b00bd37",
               "name": "Thea Andrews",
               "profile_path": null,
               "id": 1226804,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Sister Jude",
               "gender": 1,
               "credit_id": "58cd3752c3a368510e00b29f",
               "name": "Carolyn Tweedle",
               "profile_path": null,
               "id": 130434,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Rafe",
               "gender": 0,
               "credit_id": "534d63a00e0a2679dc000277",
               "name": "Ray Sager",
               "profile_path": null,
               "id": 35328,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de82b",
               "name": "Clay Borris",
               "profile_path": null,
               "id": 180868,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de831",
               "name": "Richard Beattie",
               "profile_path": null,
               "id": 115179,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de837",
               "name": "Ray Sager",
               "profile_path": null,
               "id": 35328,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de83d",
               "name": "Peter R. Simpson",
               "profile_path": null,
               "id": 35329,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de843",
               "name": "Paul Zaza",
               "profile_path": null,
               "id": 12700,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45dbc3a36847f80de849",
               "name": "Richard Wincenty",
               "profile_path": null,
               "id": 1204184,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de84f",
               "name": "Stan Cole",
               "profile_path": null,
               "id": 12703,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dbc3a36847f80de855",
               "name": "Ian Brock",
               "profile_path": null,
               "id": 107418,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.710774,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 41769,
      "vote_count": 19,
      "budget": 0,
      "overview": "Carrying on the Prom Night tradition, this film begins back at Hamilton High School on Prom Night in 1957. As a young couple are enjoying a romantic moment together in the back seat of a car, they are interrupted by Father Jonas, a priest who slashes and immolates the lovers. Thirty years later, Jonas gets loose from the chapel basement where the church fathers had been secretly keeping him locked up and drugged. As luck would have it, it's prom night again, and group of four students have unfortunately chosen Jonas's hideout as their secluded getaway spot.",
      "similar": [
         12619,
         39988,
         30670,
         12662,
         357096,
         10781,
         39867,
         36599,
         24124,
         10285,
         948,
         238636,
         3597,
         3600,
         9946,
         979,
         281957,
         74997,
         13567,
         133805
      ],
      "original_title": "Prom Night IV: Deliver Us from Evil",
      "runtime": 92,
      "poster_path": "/tjq1iWClSBCfi3SjpVJblOU6q4F.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Norstar Entertainment",
         "id": 16953,
         "origin_country": ""
      }],
      "release_date": "1992-02-14",
      "vote_average": 3.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Prom Night Collection",
         "id": 123255,
         "poster_path": "/tHhPnpJad4RVICIwaeERIq63ARg.jpg"
      },
      "tagline": "They ditched the prom for a private party, now it's their last dance.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Clay Borris"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Richard Beattie"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105179/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMTQwODM0Nl5BMl5BanBnXkFtZTcwNDg2MzAwMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Nicole de Boer, J.H. Wyman, Joy Tanner | See full cast and crew »"],
      "reviews": [
         "This is a slasher that plays it by the rules, so if I'm spoiling anything for you, it's because you've never seen a slasher movie before. Prom Night IV gives us the gift of slashing in a film that is lit with decent effectiveness, not shot notably poorly, with sub-par to decent acting and some moderately suspenseful scenes. The prom thing is more or less done in the intro, where we get to see a couple slashed in a prom in 1957. Our mad killer here is a Catholic priest gone horribly wrong--he kills with a cross where the long end has a blade. Our victims, two teenaged couples, are headed down to a retreat that used to be an old monastery for a weekend of debauchery. Meanwhile, a young priest newly charged with watching over the insane priest (who's been kept underground by the Church) is developed for a bit, but manages to slip in his duties. (Prom Night IV is very good at giving \"bonus slashes\" before it gets around to killing the teenagers.) The highlight of Prom Night IV is Nicole de Boer, who you might remember from The Cube or Star Trek: Deep Space Nine (she was Ezri Dax). Her acting, which is pretty good, manages to elevate the rest of the movie (since she is the film's heroine). The rest of the cast is pretty small-time, though, and doesn't live up to Nicole. It does have the requisite T&A shots (and a really poor sex scene), to be certain, and it manages to fit 8 deaths into a film that only focuses on those 4 teens. All are pretty freaky and well done, too. Once the suspense starts, it's pretty good at not letting up, despite following the rules strongly. The extended scenes before the slasher starts on the teens build everything up quite well. This is a slasher movie, and you will enjoy it only if you're in the mood for one. However, it does what it does well, and as such is worth picking up if you are.",
         "If the kind of movie that involves a group of partying sexually active teenagers getting killed off one by one appeals to you, then you will love this cliche-slasher movie. I personally enjoyed it. I think that the actresses were quite delicious, and that the idea of a murdering priest was kind of interesting. If you want a great horror film, rent \"Psycho\" (or even \"Night of the Demons\"), but if you want something to pass the time, rent this movie. It is worth watching for horror fans. Just don't expect to see Mary Lou from the 2nd and 3rd installments in the series.",
         "Prom Night IV: Initiation is a surprisingly underrated horror gem that is a great find. This fourth installment in the Prom Night series is often overlooked because of just that; it's the fourth installment. No one ever expects much from the Prom Night films, but most of them, excluding the first, are excellent movies, and this installment is, just barely, the best of them all. Prom Night IV should be looked upon as a masterpiece of the genre; it had a few similarities to the original Black Christmas, but I actually liked this movie way more. It's prom night in 1957, only this time, there's no Mary Lou. Father Jonas, molested by a priest as a child, has only one thing on his mind this prom night; ridding the world of sluts and sinners. After killing a young couple in their car at the prom, the other priests find out about Father Jonas's dastardly deeds and lock him up in the monastery for thirty-three years. Now, it's prom night in 1991. Four young students looking to have a good time consisting of sex and alcohol go away to a secluded house for the weekend, skipping the prom at their school and deciding to throw a party of their own. Father Jonas escapes in a series of unfortunate events, and happens upon the locale that the four students are staying at. Still desperate to stop sinners, Father Jonas lurks around the house and begins to kill the group off one by one in an increasingly disturbing fashion. Prom Night IV is very creepy and atmospheric, and the soundtrack adds to the element immensely. The most interesting part is how both religious elements and slasher elements are combined for a perfect combination. This Prom Night is actually SCARY! Father Jonas is extremely frightening, and the way he kills each of the teens is both shocking and disturbing. The acting is great, probably the most believable in the entire series. In terms of death and gore, this installment holds nothing back whatsoever. There's plenty of blood, and there's gross out scenes to boot. The \"final girl\" is interesting, and you're rooting for her the entire time. I actually liked most of the characters. Prom Night IV was a perfect slasher film and one of the best in its genre. A horror/slasher film that is not to be missed!",
         "POSSIBLE SPOILERS? You be the judge. The \"Prom Night\" series took a brief detour into \"Nightmare on Elm Street\"-wannabe territory in the previous two films (thanks to the undead prom queen, Mary Lou Maloney) but 1992's PROM NIGHT IV: DELIVER US FROM EVIL returned the series to its slasher-film origins, for better or for worse. This film has no connection to any of the prior \"P.N.\" entries other than the title (and its setting around the unluckiest high school in film history, Hamilton High). Our story begins in 1957, where a deranged Catholic priest, Father Jonas, is shown in prayer, squeezing his rosary till his hands bleed and swearing to the Lord that he will do God's work and deliver \"sluts and whores\" to Him. It just so happens that Hamilton High's prom is going on that night; when an unlucky couple sneaks out to their car for a romantic interlude, the crazed clergyman slits their throats with a sharpened cross and sets the car on fire. Rather than turn Jonas over to the proper authorities, as any sane people would do, his fellow priests choose simply to sedate him and lock him away in the Church basement, claiming him to be \"possessed\" and \"beyond saving.\" Oooo-kay, sure. That MIGHT happen. We then flash forward to present times, where a new, young priest is assigned to watching over Jonas and administering regular injections of sedative. Naturally, the new guy falters in his duties (making an ill-advised decision to \"try and reach him\") and the killer Priest awakens from his three-decade slumber (still looking surprisingly youthful and athletic after all that time in lockdown!) and escapes. It is at this point where we meet our teenage cannon fodder, a foursome of high school students headed by the virginal Megan (who has not succumbed to the pleasures of the flesh yet, though she really really kinda sorta wants to), her slutty friend Laura, and their idiot boyfriends. Prom season is here again but this group of friends decide to bypass the prom entirely and instead heads to Megan's boyfriend's family Summer home for a weekend getaway. This summer house just happens to be the same building as Jonas' old monastery. Do I have to draw you a picture of what happens next? Jonas returns to his old stomping grounds, finds our teenage fornicators deep in the middle of a post-Prom party and shows them the error of their ways thanks to that handy-dandy razor-sharp cross. With only four potential victims in the house, the body count is obviously not going to be especially huge, so it takes for-EVER before the Jonas character starts doing his dirty work, making the midsection of the film rather slow and boring after the slam-bang opening sequence. Things pick up in the last fifteen or twenty minutes as Megan and her boyfriend struggle to survive the attack of Jonas, and there's a decent enough fiery finale, but for most of its length we groan at the stupidity of these characters (when Megan's boyfriend finally finds his Dad's gun, why does he choose to climb up to the ROOF of the house, rather than barricade himself and Megan in a room to make a Last Stand? Because he's a character in a slasher film, of course!) and we don't feel much sympathy for them as they meet their fates. The ending seems to be an attempt at setting up a fifth installment, which thankfully never came to fruition. PROM NIGHT IV: DELIVER US FROM EVIL has some unique ideas (I like the idea of the Priest as a killer), some nice T&A moments (as when Megan tries on the new lingerie her boyfriend bought for her -- yowsa!) and a few scenes that make you sit up and take notice (as when Jonas crucifies, then burns, the bodies of Laura and her boyfriend outside the house) but despite those few flashes of originality, it ends as just another nothing' special slasher film. Not essential, but worth a look if you just can't get enough of mad killers stalking teenagers.",
         "I am a fan of the Prom Night series and have been for quite a while. So it was no surprise to me that I found this flick enjoyable. And like everyone is saying, this film really has no relation to the other Prom Night films. I loved the first one, the second was great fun, too, but the third one was pretty terrible. It went more towards the erotic horror genre. Which I hate. Anyway, POSSIBLE SPOILERS HERE!, the film is about a crazed monk who kills two teens making love in the backseat of a car. He is caught by the rest of the monks and the administer some kind of injection that puts him into a coma for nearly 40 years. Then, a new priest takes over after the old one dies but the idiot doesn't administer the injection. So, Father Jonas, who is creepy as hell, I might add awakens and kills the Priest. He then returns to the old monastary from the beginning of the film and sets his sights on four teenagers that are having their own private prom celebration. So from here, it's scare city. The music is downright scary and haunting, the acting very good. Especially that of Nikki De Boer, the guy who played Father Jonas scared the living crap out of me. So I give this film a 10! Great, scary popcorn fun! Check it out!",
         "So second time in series, this movies to new story, this as got nothing to with any of the ones before. However the opening scene is might to be the same night Mary Lou died by the fire in part 2, However as that happen out side a crazy priest killed two of teens who were having sex, Few years later Prince is back and start the killing spear off again and kills anyone is having any Sex. This movie got to bit more serious then the last two movies in the series I thought the story was little weak for this series, I didn't fact the series went from comedy to serious again, I Thought the movie was very slow and I didn't think the movie that creepy or scary and the movie wasn't that fun to watch. the acting was really good from the whole cast Not sure what to rate at the moment!",
         "This movie is actually quite good--hitting the right marks, at the right time. Chilling, suspenseful, and scary. The heroine (played by the always-superb Nicole de Boer) is very likable--and it's easy to care for her, worry about her, and root for her to survive. Each of the four youngsters is a \"type\"--but they are all portrayed vividly, with varying degrees of likability. Needless to say, Miss de Boer gives the best performance of all. The villain--a possessed priest whose insanity (and crucifixion wounds) terrify the other priests--is locked up and sedated for forty years...and oddly enough, doesn't age a day. (As to the question of why they didn't just report him to the cops--well...I'm PRETTY sure they got the impression that the cops couldn't handle him.) When a young priest is re-assigned to look after him--a simple, tragic act of compassion costs him his life--and the monster is unleashed once again. From the moment of the \"obscene phone call\", a connection is created between the murderer and Meagan (Miss de Boer's character)--Fate has effectively chosen her to be his nemesis. Thus, the stage is set for a final confrontation--the innocent, lovable Meagan having to face the monstrous Father Jonas alone. The final sequence is very ambiguous--but it plays to the idea of their connection. The implications are open to interpretation--I prefer to think that she simply senses his presence, as in the climax, not that she is his \"heir\", or something. (Interesting note: for some reason, I can't watch that scene and not be reminded of Marlon Brando's famous dramatic death in Apocalypse Now: looking upward, gazing in wonder, \"The horror...the horror....\") This is a good film for its genre, overall. I recommend it.",
         "\"Prom Night IV: Deliver Us From Evil\" is a serious (as in: no comedy touches) slasher that falls short in thrills & tension. Too bad, because it had a lot of potential. It's well-made, but severely dull in places. This time we have yet another stand-alone, unrelated sequel about a killer-priest (who is \"evil beyond imagination\") stalking & killing two couples in an isolated mansion. There are some supernatural undertones in the plot, but they are never explored. The budget on this production even seemed reasonably comfortable, as the cinematography isn't bad at all, often showing us some decent camera-movements on rails & even crane-shots. The acting is passable and the film opens really interesting. But then things fizzle quickly and the whole movie becomes uneventful. If they had simply amped up the body count & bloodshed, this sure could have turned into one of the unsung slasher gems from the early '90s. Now it just remains a curiosity for those interested in the \"Prom Night\" series. It's a strange franchise, to say the least, with this 4th installment presenting us yet again a different storyline. Interesting, but a failed effort altogether.",
         "\"Prom Night IV: Deliver Us From Evil\" marks yet another turn in the \"Prom Night\" franchise, ditching the supernatural elements of the previous two entries in exchange for a more back-to-basics slasher formula that is not unlike the original. This time, however, it's a Catholic priest gone mad, with a sharpened crucifix in hand, who unleashes his wrath against a group of fornicators...err...high school kids who ditch their prom in lieu of a remote cabin where they can get down and dirty without anyone around to hear their screaming -- whether that's a good thing or not. Another direct-to-video installment, the fourth \"Prom Night\" is not of the highest quality, but at least delivers the goods on the most basic level. Slasher fans will appreciate its dead-pan approach, which is in stark contrast to the goofiness on hand in \"Prom Night III: The Last Kiss.\" Father Jonas, the Catholic priest in question, is played stone-faced by James Carver and makes for an effectively brutal killer, even if he is overexposed by the film which doesn't allow him to lurk or stalk very much. The cast of teens, meanwhile, are just begging to be killed by Father Jonas, and with lines like \"Shut up and take your pants off\" who can say they didn't see it coming? Sure, it's a low-rent, dirty little horror movie, but at least it tries, and even when it doesn't succeed, \"Prom Night IV\" doesn't exactly suck, either. At the very least, this last entry in the series is more entertaining and exciting than the remake that would follow 17 years later.",
         "In 1957 deranged and dangerous Catholic priest Father Jonas (excellently played with frightening intensity by James Carver) kills two fornicating teenagers. Thirty-three years later Father Jonas escapes from the cellar of the church he's been imprisoned in and returns to the monastery from his youth. Said monastery has been converted into a summer home where a pair of teenage couples go to celebrate prom night. Director Clay Borris and screenwriter Richard Beattie craft an extremely dark and twisted slice'n'dice body count fright feature that benefits substantially from a grimly serious tone, a creepy mood, a steady pace, several gory and nasty murder set pieces, a smidgen of steamy soft-core sex, a considerable amount of tension, and a brutal and harrowing last third. Better still, there's no silly disruptive humor to diminish the severity of the in-your-face harsh and unflinching horror; Father Jonas in particular registers strongly as one extremely scary and vicious dude. In addition, the brooding religious angle gives the picture an extra sick and subversive edge. Nicole de Boer makes for an appealing heroine as the sweet and virginal Meagan; she receives sound support from Alden Kane as Meagan's nice guy boyfriend Mark, Joy Tanner as shameless slut Laura, Alle Ghadbran as the equally brash Jeff, Brock Simpson as eager young priest Father Colin, and Fab Filippo as Mark's bratty peeping tom younger brother Jonathan. Rick Wincenty's polished, agile cinematography keeps the camera constantly moving and boasts a handful of fluid tracking shots. Paul Zaza's spooky'n'shuddery score likewise hits the skin-crawling spot. A superior slasher horror outing."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Norstar Entertainment"],
      "summaries": [
         "Carrying on the Prom Night tradition, this film begins back at Hamilton High School on Prom Night in 1957. As a young couple are enjoying a romantic moment together in the back seat of a car, they are interrupted by Father Jonas, a priest who slashes and immolates the lovers. Thirty years later, Jonas gets loose from the chapel basement where the church fathers had been secretly keeping him locked up and drugged. As luck would have it, it's prom night again, and group of four students have unfortunately chosen Jonas's hideout as their secluded getaway spot.",
         "A religious fanatic stalks four teens he feels have transgressed the law of god."
      ],
      "budget": 0
   },
   "movielensId": 1990,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-02-14",
      "dvdReleaseDate": "2005-07-07",
      "directors": ["Clay Borris"],
      "runtime": 92,
      "movieId": 1990,
      "title": "Prom Night IV: Deliver Us from Evil",
      "mpaa": "R",
      "actors": [
         "Nicole de Boer",
         "J.H. Wyman",
         "Joy Tanner",
         "Alle Ghadban",
         "Kenneth McGregor",
         "James Carver",
         "Brock Simpson",
         "Krista Bulmer",
         "Brad Simpson",
         "Phil Morrison",
         "Thea Andrews",
         "Carolyn Tweedle",
         "Ray Sager"
      ],
      "imdbMovieId": "0105179",
      "originalTitle": "Prom Night IV: Deliver Us from Evil",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["aebIiQ8qAl8"],
      "plotSummary": "Carrying on the Prom Night tradition, this film begins back at Hamilton High School on Prom Night in 1957. As a young couple are enjoying a romantic moment together in the back seat of a car, they are interrupted by Father Jonas, a priest who slashes and immolates the lovers. Thirty years later, Jonas gets loose from the chapel basement where the church fathers had been secretly keeping him locked up and drugged. As luck would have it, it's prom night again, and group of four students have unfortunately chosen Jonas's hideout as their secluded getaway spot.",
      "tmdbMovieId": 41769,
      "avgRating": 1.45882,
      "releaseYear": "1992",
      "numRatings": 170,
      "posterPath": "/tjq1iWClSBCfi3SjpVJblOU6q4F.jpg"
   }
}