{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gun",
            "id": 1419
         },
         {
            "name": "birthday",
            "id": 1421
         },
         {
            "name": "voodoo",
            "id": 3392
         },
         {
            "name": "toy",
            "id": 4290
         },
         {
            "name": "stalker",
            "id": 6844
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "explosion",
            "id": 14601
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "doll",
            "id": 33630
         },
         {
            "name": "evil",
            "id": 156075
         },
         {
            "name": "toy comes to life",
            "id": 187065
         },
         {
            "name": "ginger",
            "id": 201120
         }
      ],
      "imdb_id": "tt0094862",
      "video": false,
      "title": "Child's Play",
      "recommendations": [
         11186,
         11187,
         11932,
         11249,
         4488,
         167032,
         10072,
         11281,
         6466,
         9529,
         377,
         9003,
         609,
         10131,
         10823,
         9725,
         8913,
         948,
         10014,
         10160
      ],
      "backdrop_path": "/2O7BSytXfkEcTyP9I4IiFBhn3w3.jpg",
      "revenue": 44196684,
      "reviews": [{
         "author": "Gimly",
         "id": "59e722419251413bd900c22f",
         "content": "I'm a big fan of the _Chucky_ franchise. Throughout all of its ups and downs, Don Mancini and the gang have never failed to bring forward a watchable movie. Even the most recent entry, _Cult of Chucky_ (which was kind of a fuck-up) provided me great enjoyment as a series-long fan. But no subsequent movie has ever matched the original for me. That first _Child's Play_ didn't just birth a classic character, it is, in and of itself, a classic. The first time you see Chucky open his mouth and hear the words of the real Brad Douriff... I've seen it twenty times over, and I'm still floored every single one of them. Absolutely floored, and floored with a massive grin on my face to boot.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._",
         "url": "https://www.themoviedb.org/review/59e722419251413bd900c22f"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Karen Barclay",
               "gender": 1,
               "credit_id": "52fe438c9251416c75014c07",
               "name": "Catherine Hicks",
               "profile_path": "/b1UONnn9lsxqsxJYXnp3DWpUwpm.jpg",
               "id": 2022,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Mike Norris",
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c0b",
               "name": "Chris Sarandon",
               "profile_path": "/1Wf3WoXEdPqGyO6onKfFkseDFef.jpg",
               "id": 14541,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Andy Barclay",
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c0f",
               "name": "Alex Vincent",
               "profile_path": "/jR4RmOgv77uVsxOWbTMy5LWZiBg.jpg",
               "id": 65683,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Charles Lee Ray/Chucky",
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c13",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Maggie Peterson",
               "gender": 1,
               "credit_id": "52fe438c9251416c75014c17",
               "name": "Dinah Manoff",
               "profile_path": "/7GDV847Od4w8onTqwh9ZA70aLH.jpg",
               "id": 8900,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Chucky Stunt Double",
               "gender": 2,
               "credit_id": "56dd1830c3a368764a002788",
               "name": "Ed Gale",
               "profile_path": "/nT29IOEnFLknnx1MccIiPug014d.jpg",
               "id": 1471,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014bd3",
               "name": "Tom Holland",
               "profile_path": "/yYNJTyRwKoUT27Dp9fIO9rWwO3s.jpg",
               "id": 64796,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014bd9",
               "name": "Don Mancini",
               "profile_path": "/5gOwYJrxNsGpr8iJ16qDlXJH1tH.jpg",
               "id": 65677,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014bdf",
               "name": "John Lafia",
               "profile_path": null,
               "id": 65678,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014be5",
               "name": "Tom Holland",
               "profile_path": "/yYNJTyRwKoUT27Dp9fIO9rWwO3s.jpg",
               "id": 64796,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014beb",
               "name": "David Kirschner",
               "profile_path": null,
               "id": 13596,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014bf1",
               "name": "Joe Renzetti",
               "profile_path": null,
               "id": 65681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014bf7",
               "name": "Bill Butler",
               "profile_path": "/BJpWJoyF771fVD0bUPx5WE173y.jpg",
               "id": 2287,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014bfd",
               "name": "Roy E. Peterson",
               "profile_path": null,
               "id": 65682,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe438c9251416c75014c03",
               "name": "Edward Warschilka",
               "profile_path": null,
               "id": 4981,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 18.032101,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10585,
      "vote_count": 803,
      "budget": 9000000,
      "overview": "A single mother gives her son a beloved doll for his birthday, only to discover that it is possessed by the soul of a serial killer.",
      "similar": [
         10651,
         9373,
         12521,
         948,
         3600,
         341006,
         10781,
         15069,
         1991,
         14869,
         60304,
         562,
         395834,
         3597,
         13184,
         22825,
         133805,
         12662,
         101299,
         73861
      ],
      "original_title": "Child's Play",
      "runtime": 87,
      "poster_path": "/dSX9i2buibfyKFRpK2kOe6rtl5R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Artists",
         "id": 60,
         "origin_country": ""
      }],
      "release_date": "1988-11-08",
      "vote_average": 6.3,
      "belongs_to_collection": {
         "backdrop_path": "/AAhYXBVIEl6WgQnzfBsauTIC25.jpg",
         "name": "Child's Play Collection",
         "id": 10455,
         "poster_path": "/50aqbDvbOtdlZrje6Qk4ZvKM7dM.jpg"
      },
      "tagline": "Chucky is one mean S.O.B.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tom Holland"],
      "runtime": 87,
      "synopsis": "On the morning of November 9, 1988 in Chicago, Illinois, while being chased by Detective Mike Norris ( Chris Sarandon), Charles Lee Ray, a serial killer known as \"The Lakeshore Strangler\" ( Brad Dourif), is shot and mortally wounded. Before dying, Charles takes cover inside a toy store, finding boxes of talking \"Good Guy\" dolls and then uses a voodoo ritual to transfer his soul into one of the dolls. The store is then struck by lightning and it burns to the ground. Later that morning, 6-year-old Andy Barclay ( Alex Vincent) tells his widowed mother Karen Barclay ( Catherine Hicks) that he wants a Good Guy doll for his birthday. Unable to afford the full price, Karen buys a stolen doll from a street peddler, which is the same doll into which Charles Lee Ray had earlier transferred his soul. That night, as Andy is playing with the doll who has introduced himself as \"Chucky\" Karen's friend, Maggie Peterson ( Dinah Manoff), who is babysitting Andy, scolds him for turning on the evening news and placing Chucky in front of the TV. When Andy tries to deny the accusation, she doesn't believe him and sends him to bed. Maggie is later violently struck with a hammer by an unseen figure and falls out of the apartment kitchen window to her death. Andy, when questioned, insists that Chucky has revealed himself to be alive and that he killed Maggie. The next day, Andy visits the house of Eddie Caputo ( Neil Giuntoli), Charles Lee Ray's accomplice, who had betrayed him. Chucky sneaks into Eddie's house and blows out the pilot light on the stove and turns up the gas. Eddie discovers Chucky is alive and, in panicked self-defense, fires his gun and the house explodes, killing him. Authorities place Andy in a psychiatric ward after he is found near the crime scene. Karen discovers Andy was telling the truth after discovering that the included batteries in the Good Guy doll box were never put inside Chucky. After threatening to throw him in the fireplace, Chucky comes alive in her hands, bites her and runs out of the apartment. She contacts Detective Norris, who is now investigating Maggie's death. Although he initially doubts her story, the homeless man who sold Karen the doll confirms that he retrieved it from the burnt down toy store where Charles Lee Ray was killed. Norris becomes a believer after he is attacked by Chucky in his car and survives only by shooting the doll. Chucky meets with John Simonsen, his voodoo instructor from years past, and asks why his gunshot wound bled. John, under torture via voodoo doll, informs him that his body is slowly conforming to that of a human's and that he will soon be trapped in the body if he does not transfer his soul into the body of the first person he revealed himself to, which is Andy. Offhandedly remarking that he will \"get to be six years old again,\" Chucky stabs the voodoo doll and leaves John to die. Karen and Detective Norris, following leads from Charles Lee Ray's case file, find John as he lays dying and receive instructions on how to kill Chucky; although Chucky is a doll, his heart is fully human and vulnerable to fatal injury. Knowing that Chucky is after him, Andy escapes from the psychiatric unit. Chucky brutally kills the ward's head doctor with an electroshock machine in the process, leaving the authorities to believe Andy killed the doctor while escaping. Mike and Karen rush back to the apartment hoping that Andy is there. Chucky reaches the apartment before them and knocks Andy unconscious with a baseball bat, and proceeds the voodoo ritual to steal his soul. After a prolonged struggle, Chucky is thrown into the fireplace by Karen and despite some coaxing by Chucky, Andy manages to light a match and ignite the fireplace, ultimately setting Chucky ablaze. Andy and Karen, thinking Chucky is dead, go to help the injured Mike Norris. After Andy gets the first aid kit from under the sink, he discovers Chucky is gone. Very burnt but alive, Chucky chases after Andy and Karen, who barricade themselves in the bedroom; Karen shoots him several times, missing his heart, but scattering his head, an arm and a leg in the hallway. After Norris' partner, Jack Santos, arrives, the scattered doll parts attempt to attack at the instructions of Chucky's screaming, severed head. Karen, remembering John's last words, tells Mike to shoot Chucky in the heart. Norris does so and makes a direct hit, killing Chucky. Chucky then says \"Hi I'm Chucky wanna play\" before his evil voice fades. Jack then tells Mike \"I believe you, but who's going to believe me?\". Karen then tells Andy that they are going to the hospital for Mike's wounds. Karen then turns off the bedroom light, with Chucky's remains corned at the wall as the final scene is Andy looking back at Chucky before closing the door as the film ends.",
      "writers": [
         "Don Mancini",
         "Don Mancini"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094862/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1MjQ5NDkyMV5BMl5BanBnXkFtZTcwMjkzNjEzNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Catherine Hicks, Chris Sarandon, Alex Vincent | See full cast and crew »"],
      "reviews": [
         "I've seen this brilliant horror movie over twenty times so far and it is still great.\"Child's Play\" is wonderfully original-a great concept(the soul of a serial killer in the puppet)and villain(Chucky!)are perhaps the keys to it all.Plenty of shocks and scares,pretty good acting and lots of violence.The direction and editing are so tight and carefully done.Now I can see why this movie was such a huge success in 1988.Managing to be both frightening and classy,this is a nerve-wracking experience.I actually found \"Child's Play\" to be a very scary film.I did not find it too gory,but what gore there is it was done to heighten intensity levels to the extreme.All in all,I wholeheartedly recommend it to any open-minded viewer,who likes to watch horror movies.The hammer in the head scene still gives me goosebumps.",
         "When people nowadays think of Chucky, the living doll, they think of the foul mouthed psycho doll complete with body modifications and a punky bride in a movie filled with funny one liners and black humor. However, when Chucky came to life almost 20 years ago, he was a real thrill that redefined the horror genre of the late 80s and spawned a series of imitators (some better than others). Director Tom Holland crafts this very original tale written by Don Mancini, where a dying sociopath (Brad Douriff) uses voodoo to transplant his soul to an inanimate toy. Catherine Hicks plays Karen Barclay, a single mother who gets the possessed toy for her little son Andy (Alex Vincent), not knowing what is hidden deep inside the doll. Despite its apparent cheesiness, Holland truly creates a haunting atmosphere filled with suspense by following the trick Steven Spielberg used in \"Jaws\". While we know from the very beginning that the toy is haunted, we never get a glimpse of what he can do and neither does the characters; only the young Andy knows the truth, but nobody believes him. Unlike its current MTV-inspired incarnations, \"Child's Play\" starts a bit slow, but suddenly it turns into a suspense-filled roller-coaster with enough thrills to keep you at the edge of the seat. Holland directions truly makes the difference between a cheap B-movie and the classy film this one has become. Brad Dourif makes a superb job and this movie started his now-legendary career in the genre. Catherine Hicks is a very good lead character, surprisingly realistic, thanks in part to the very well-written dialog. Chris Sarandon completes the cast as the detective investigating the mysterious murders surrounding Chucky and Andy. The movie moves at a very good pace, despite its slow start; it has that 80s feeling and it is surprisingly violent for its time (it was released when rules were turning a bit stricter). It has great special effects and a very creepy atmosphere inside it's urban landscape. While many reviewers consider a flaw the fact that Chucky's possession is not a mystery, I believe that a lot of the suspense is in the fact that we know that, but the characters don't. It is a very well constructed film in the end, and definitely better than its current sequels. 8/10",
         "Child's Play is built upon a pretty laughable premise \u0096 some hardened criminal finds himself wounded and cornered by the police, so he chants some mystical words, lightning clouds form in the sky, and he transports his soul into the body of a kid's doll of the My Buddy variety. But the movie is so well made that it is able to remain effective despite its questionable premise, kind of like Darkman, another movie with something of a goofy plot but that still manages to come off as a great action horror film. Some of the best moments in the film come early on, before anyone but Andy realizes that Chucky is alive. Kind of like what Steven Spielberg did in Jaws, director Tom Holland leaves Chucky as a lifeless doll for a good portion of the beginning of the film. As is to be expected, it's much more difficult to show a living, running, stabbing, screaming doll than it is to show a regular doll, which itself manages to stare blankly in such a way that you know there's something going on in its head. There's nothing worse than hearing someone criticize the acting skills of a little kid, but I have to admit that I found Alex Vincent's performance as Andy a little trying at times. Granted, the kid deserves a lot of credit for performing reasonably well in a horror film at the age of 7, which is certainly more than I could have done at that age, but for every time that he effectively portrayed a scared little kid, which happened often, there were at least as many times when he spoke with the wooden monotone generally associated with reading a cue card. That being said, the effects in the movie are very impressive. There are a few goofs in there, but you have to look pretty hard to find them, and the doll itself was very well done. Brad Dourif makes one of his earlier appearances, showing up in Child's Play just long enough to get shot and then transfer his body into the doll, and then spend the rest of what is now a total of five movies trying to get out of it, which may have something to do with the fact that his voice is more famous than his face. He was mostly known as the timid Billy Bibbit from One Flew Over the Cuckoo's Nest before he did Child's Play, and the success of this movie clearly had a significant impact on the rest of his career, since so many of his later performances were in decidedly dark roles. Note: watch for the only funny scene in the movie, which my itself is so funny that any other comic relief isn't even necessary. As Chucky ascends in an elevator, and elderly woman notices him, but her husband tells her to just leave it, whoever forgot it is bound to come back for it. When she exits the elevator, she looks back with a grimace and says, 'Ugly doll\u0085' Chucky's response is one of the funniest things I've ever seen in a horror film.",
         "Child's Play was billed as a horror movie, but it's hard to categorize it as such. Especially by 1980s standards. There's no brainless teenage cattle, no gratuitous nudity, and no ridiculously high body count. If anything, Child's Play runs like an episode of Rod Serling's The Twilight Zone. It's creepy, but ultimately not shocking. This is no coincidence. An episode of The Twilight Zone called Living Doll used a similar premise. Child's Play is done very well, considering it's about a serial killer who uses voodoo magic to transfer his soul into a doll. The acting is way above average for a horror movie and the momentum builds nicely. The viewer is forced to wait quite awhile before they actually see Chucky kill anyone. If anyone has seen VH1's \"I Love the 80s\" then you've probably seen Dee Snider mock the movie: \"It's a doll! Step on it! It's over!\". If Chucky tried to go on a killing rampage, this would work. But he doesn't. He uses stealth and cunning to make up for the failings of his diminutive body. He reveals his true self only to young Andy, the boy who gets him as a birthday present. He kills all his hapless victims without much trouble. After all, who would suspect an innocent little doll could kill you when you're not looking? Perhaps the biggest problem with Child's Play is that it was billed as an evil doll movie. Chucky was on all the posters and commercials, knife in hand. It would have worked much better as a suspense thriller, where you suspect that little Andy Barclay is the murderer. Despite it's failings as a horror movie, Child's Play is still a great movie because it paints a dismal and accurate picture of the 80s: the frustration of single parenthood, the dark dangerous inner cities, and trying to get your kid that overpriced toy that they just *have* to have. Child's Play also came at a time when dolls were really popular: Teddy Ruxpin, Cabbage Patch Kids, My Buddy, and Kid Sister were all hot items. Little kids loved these things, but there's something inherently sinister about dolls. Those glassy eyes and perma-smiles seem insincere. Overall, Child's Play is a movie that probably succeeded because it was in the right place at the right time. Nonetheless, it's worth at least a few viewings. Chucky is easily one of the top 3 horror movie villains of the 1980s along with Freddie Krueger and the Gremlins. Rating: 4 out of 5 stars",
         "Director Tom Holland does quite a good job scaring us with this cliche-ridden, unoriginal story of a serial killer transferring his soul to a toy store doll. The doll is incredibly eerie with its red hair and deep eyes, and goes by the name of Chucky saying things like, \"My name's Chucky...wanna play?\" Although much of the plot is very predictable(especially the ending), the execution of the plot is first-rate. Add to this some earnest acting from CatherineHicks, Chris Sarandon, and especially Alex Vincent playing a six-year old, and you have a pretty entertaining feature. The special effects are also first-rate, and the doll seems to actually be alive. Brad Douriff adds his voice to the demented Chucky, and his voice is evil personified. Dinah Manoff has a small role, but it is an important role which she plays very well. The atmosphere is definitely set on suspense and it is a rollercoaster of a ride as we see the doll slowly become human and seek out his only murderous hope for salvation. Good scares!",
         "It was always the films where a child is in peril that stuck with me the most. Child's Play was probably the top of the crop. The film taps into all those things you remember as a child like those colorful commercials that would promote the cereal you were eating. And those big dolls like 'My Buddy', that even as a kid I knew were creepy. Script, acting, music, mood, atmosphere, direction, scares, everything works and that's why I give it the high rating it deserves. Brad Dourif was the perfect choice for the voice of the Chucky doll. It's sinister and angry and darkly sarcastic. He is what I consider to be one of the all time great underrated actors. The film is bleak. There's nothing happy about it although the good guy doll commercials insist it's playtime. After this film, the only sequel I highly recommend is Child's Play 2, which I love just about as much as this one. Part 3 wasn't bad. Bride of Chucky was an interesting new direction to go in, but the feeling of the first couple of films is long gone by then, and Seed of Chucky was about the same.",
         "I really don't care what anyone says about this movie. I am a horror movie fanatic and i first saw this film at the age of 7. Out of all the horror movies i've ever seen, child's play ( the first one , to ME, is the scariest movie i've seen. A CREEPY looking doll, a CREEPY voice, eerie music because it's not even music its like chimes and a combination of creepy sounds, suspense and of course barely any comedy, just pure horror. Out of all the horror movies I've seen, the scariest movies would have to be the following: Child's Play, Pet Semetary, The Exorcist 3, Evil Dead is pretty creepy at times, The Others, Saw ( not a quite scary just a damn good movie, Texas Chainsaw Massacre (original), April Fool's Day is kinda creepy, Sleepaway camp ( music and that ENDING ) there are a few more but i cant quite think, however, the tops are Child's Play and Pet Semetary. Oh, and High Tension is a VERY good horror/suspense. So if u wanna wanna be creeped out, go home, turn off the light, put the TV on loud or surround sound if u have it, and watch by yourself. It's a scary movie, well at least to me it is. I'm not scared of the movie now at the age of 25 but it is one the only ones that no matter how many times i watch it, still creep me out a bit.",
         "I saw the commercials of the very first Child's play Movie and I remember them completely - the stunning special effects of the doll creeping with the mechanical head turning right around and the isolated kid, was later called Andy hollering for his Mother. I was nine years old at that time. I saw that movie on tape at 13 (under aged- naughty me!!) but could not wait to see it. Chucky was now the first Boogyman I ever watched. Brad Dourif whom I known from One Flew Over the Cuckoo's nest, Blue Velvet, Fatal Beauty, Dune and many countless films - he is one of the most finest performers I have ever seen, with his magnetic charisma and those huge wildly intense blue eyes to match. Dourif hits the big time as Charles 'chucky' Lee Ray, the Voodoo practising Serial killer of Chicago who was gunned down in a toy store by bewildered Detective Norris (Sarandon)and betrayed by his partner-in-crime Eddie Caputo. Charles made a promise that he will get revenge on the ones that 'done him in' and found a Good Guy doll to exchange his soul whispered a Voodoo incantation in the name of 'Damballah Wedo' (a west African, and Haitian Snake God), lighting struck the toy shop and the police found Ray dead - bet they thought it was over and celebrated by munching on Bear claws and donuts collections- RIGHT? Nope Wrong. In comes along little Andy Barclay - sweet Darling' angel, but he whines about wanting the latest craze - em yes! you guessed it - and you know that he is gonna get what he wants alright! unfortunately Karen Barclay (Hicks) buys the 'special' doll at cheapo bargain from a Homeless Guy. At least she does not have to worry about batteries because the doll is 'more alive' than expected, with a diminutive height and Brad Dourif's inimitable Booming voice. And ratty Auntie Maggie (Peterson) gets it, and takes a dive from the forty storey building. and then it is Eddie's turn to be shish kabab in a exploding House! The body count's are rising, and the truth about Charles Lee Ray is mounting but more unbelievers are added to the equation. Until they see Chucky 'is alive' and eat their words (or die so to speak). It is a Scary movie, with great scenes of Chicago, and Chucky has a vehement vengeance and will not stop at nothing with its perished body ashed from flames and blue eyes peering out creeping towards Andy makes you feel like a kid wanting to cry out to your Ma. what a Nightmarish Film, this cool movie deserves praise. Hail Chucky!",
         "Well made thriller about a dying serial killer (Brad Doriff) transplanting his soul into a child's play doll. Fast forward now and a mother buys the doll for his son's birthday. Doriff then goes on a killing spree, but after a cop wounds him he finds out that if he stays in the doll's body for too long, he and the doll will become one forever. So he goes after his owner so that he can transfer souls. Highly original premise highlighted by terrific special effects and lots of good one liners and humor. Rated R; Extreme Violence & Profanity.",
         "This is a truly interesting horror flick that was so popular that sequels have been coming out ever since, none of course matching this one: the original. The film builds up suspense in the beginning and then takes off once \"Chucky\" comes to life. It almost takes half the movie for that to happen. It stays intense from that point and certainly keeps your attention. The only change I would have made was to the end the movie five minutes earlier, but they tacked on something that wasn't needed. The doll's owner \"Andy,\" (Alex Vincent) is a cute little kid and Alex does a decent job of acting while Catherine Hicks is fine as his mom. A familiar face in the '80s, Chris Sarandon, adds his talents as a detective. Instead of all the stupid sequels, I would have preferred to see a remake done, now that special-effects have made such great advances. For instance, at least with the VHS I have, Chuckie's lips aren't even in sync with the dialog! He walks a little too wooden-like but the other special-effects were just fine. Nothing is to be taken seriously, anyway. It's just a silly voodoo-type story (you should hear the explanation of who \"Chuckie\" is) and just played for a scary horror film. On that level, it works because it IS scary."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["United Artists"],
      "summaries": [
         "When Charles Lee Ray needs to get quick escape from cop Mike Norris, he takes his soul and buries it into playful, seemingly good guy doll Chucky. Little does he know a little boy by the name of Andy Barclay will be the new owner of him soon-to-come. Charles confides in Andy while he commits numerous murders. Once the adults accept Andy's story as truth, it's too late.",
         "When serial killer Charles Lee Ray is mortally wounded in a police shoot-out, he uses a voodoo spell to transfer his soul into Chucky, a \"Good Guys\" doll. Andy receives the doll as a birthday gift, and Chucky soon resumes his killing spree. However, Charles doesn't want to be trapped in the body of a doll forever. His only escape would be to transfer into the first human he revealed his true identity to... which places Andy in mortal danger.",
         "Young Andy Barclay sees a commercial for a 'Good Guy' doll on TV, and asks his mother for one for his birthday. At work, Andy's mom and her friend discover a peddler selling one for a low price, and she buys it. What she doesn't know is that the particular doll contains the spirit of Charles Lee Ray, aka 'The Lakeshore Strangler', who died at the hands of police the night before and had transferred his spirit to the doll by voodoo. That night, Andy's babysitter is pushed from their 5th-floor window to her death, and only young Andy knows that 'Chucky' - the doll - is responsible for that a death and a series of murders that follow. Worse than that, the soul of Charles Lee Ray is trying to get out of the doll's body - and take over Andy's...",
         "A single mother gives her son a much sought after doll for his birthday, only to discover that it is possessed by the soul of a serial killer."
      ],
      "budget": 9000000
   },
   "movielensId": 1991,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-11-08",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["Tom Holland"],
      "runtime": 87,
      "movieId": 1991,
      "title": "Child's Play",
      "mpaa": "R",
      "actors": [
         "Catherine Hicks",
         "Chris Sarandon",
         "Alex Vincent",
         "Brad Dourif",
         "Dinah Manoff",
         "Ed Gale"
      ],
      "imdbMovieId": "0094862",
      "originalTitle": "Child's Play",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "G8cLLrpkn-8",
         "sjiyV8mtXiU",
         "_nASgjFpVbA"
      ],
      "plotSummary": "A single mother gives her son a beloved doll for his birthday, only to discover that it is possessed by the soul of a serial killer.",
      "tmdbMovieId": 10585,
      "avgRating": 2.82243,
      "releaseYear": "1988",
      "numRatings": 2889,
      "posterPath": "/dSX9i2buibfyKFRpK2kOe6rtl5R.jpg"
   }
}