{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "poltergeist",
            "id": 3350
         },
         {
            "name": "supernatural powers",
            "id": 4769
         },
         {
            "name": "family secret",
            "id": 6625
         }
      ],
      "imdb_id": "tt0091778",
      "video": false,
      "title": "Poltergeist II: The Other Side",
      "recommendations": [
         10306,
         16288,
         26515,
         10344,
         24929,
         9599,
         10127,
         11415,
         12521,
         11284,
         10906,
         10131,
         8973,
         609,
         10160,
         10280,
         20701,
         10072,
         10351,
         11569
      ],
      "backdrop_path": "/b0I6M2Ws1KnFit7xCJeYpK2NV4s.jpg",
      "revenue": 40996665,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Steve Freeling",
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257a3",
               "name": "Craig T. Nelson",
               "profile_path": "/mhKSd2uLhNX7TahlNhwJgDYMRwN.jpg",
               "id": 8977,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Diane Freeling",
               "gender": 1,
               "credit_id": "52fe43ff9251416c7502579f",
               "name": "JoBeth Williams",
               "profile_path": "/9kmPUDqZIZw7aYeKYm3gy1xr94s.jpg",
               "id": 10080,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carol Anne Freeling",
               "gender": 1,
               "credit_id": "52fe43ff9251416c750257a7",
               "name": "Heather O'Rourke",
               "profile_path": "/pa7kowurmC4DwJzVXYT08R50L5g.jpg",
               "id": 10086,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Robbie Freeling",
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257ab",
               "name": "Oliver Robins",
               "profile_path": "/cp0sOxhabpGVZcHFaTc9YL0Ngn7.jpg",
               "id": 10085,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tangina Barrons",
               "gender": 1,
               "credit_id": "52fe43ff9251416c750257af",
               "name": "Zelda Rubinstein",
               "profile_path": "/xCqgUXqwv4Fndx2w3iK1weqlzN9.jpg",
               "id": 10091,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Taylor",
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257f9",
               "name": "Will Sampson",
               "profile_path": "/qcufMVWjaK0jlcDkkUZ6Kawvj2l.jpg",
               "id": 68301,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Kane",
               "gender": 0,
               "credit_id": "52fe43ff9251416c75025801",
               "name": "Julian Beck",
               "profile_path": null,
               "id": 130723,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Gramma-Jess",
               "gender": 1,
               "credit_id": "52fe43ff9251416c750257fd",
               "name": "Geraldine Fitzgerald",
               "profile_path": "/ybUphD37eQrjd9PN4eIHSkmdxTs.jpg",
               "id": 30226,
               "order": 7
            },
            {
               "cast_id": 6,
               "character": "Old Indian",
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257b3",
               "name": "John P. Whitecloud",
               "profile_path": null,
               "id": 68296,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257b9",
               "name": "Brian Gibson",
               "profile_path": "/jjc2ARxLzv3El2tHeEUKC89vPtW.jpg",
               "id": 18069,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257bf",
               "name": "Michael Grais",
               "profile_path": null,
               "id": 10056,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257c5",
               "name": "Mark Victor",
               "profile_path": null,
               "id": 10058,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257cb",
               "name": "Freddie Fields",
               "profile_path": null,
               "id": 27963,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257d1",
               "name": "Michael Grais",
               "profile_path": null,
               "id": 10056,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257d7",
               "name": "Mark Victor",
               "profile_path": null,
               "id": 10058,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257dd",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257e3",
               "name": "Andrew Laszlo",
               "profile_path": null,
               "id": 2082,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257e9",
               "name": "Thom Noble",
               "profile_path": "/pl35WClWJFiuBao1dTMoV4PaxOj.jpg",
               "id": 17399,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257ef",
               "name": "Bud S. Smith",
               "profile_path": null,
               "id": 23914,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c750257f5",
               "name": "M. Scott Smith",
               "profile_path": null,
               "id": 23926,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55402c18c3a36829e5000201",
               "name": "John Bruno",
               "profile_path": null,
               "id": 1395269,
               "department": "Crew",
               "job": "Visual Effects Art Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.932048,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11133,
      "vote_count": 201,
      "budget": 19000000,
      "overview": "The Freeling family move in with Diane's mother in an effort to escape the trauma and aftermath of Carol Anne's abduction by the Beast. But the Beast is not to be put off so easily and appears in a ghostly apparition as the Reverend Kane, a religeous zealot responsible for the deaths of his many followers. His goal is simple - he wants the angelic Carol Anne.",
      "similar": [
         7191,
         124905,
         588,
         5876,
         39256,
         339530,
         46261,
         620,
         339967,
         293167,
         408220,
         40761,
         927,
         928,
         282035,
         243688,
         242224,
         49017,
         55341,
         138843
      ],
      "original_title": "Poltergeist II: The Other Side",
      "runtime": 91,
      "poster_path": "/wp8IkFabtxJohz8ivfwNWt4Bcse.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1986-05-23",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/i8QZZV1olny9FCPNrxAL7Kk9CJy.jpg",
         "name": "Poltergeist Collection",
         "id": 10453,
         "poster_path": "/8Z6P04pKGvCnkmHdAl2lmbfAIbN.jpg"
      },
      "tagline": "They're back.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brian Gibson"],
      "runtime": 91,
      "synopsis": "One year after the events of Poltergeist, Cuesta Verde, the Freelings' neighborhood from the first film, is being evacuated and turned into an archeological paranormal dig, centered around the spot where the Freelings' home stood before it imploded. The excavation leads to the discovery of an underground cave by a ground crew. Its existence is revealed to psychic Tangina Barrons (Zelda Rubinstein), who tells a friend of hers, Taylor (Will Sampson), an American Indian shaman. After investigating the cave for himself, Taylor realizes that Kane, a demon disguised as a preacher, has located Carol Anne and goes to defend her. The Freeling family, Steven (Craig T. Nelson), Diane (JoBeth Williams), Robbie (Oliver Robins), and Carol Anne (Heather O'Rourke), has relocated to Phoenix, Arizona and now live in a house with Diane's mother, Jessica \"Grandma Jess\" Wilson (Geraldine Fitzgerald). Having lost his real estate license, Steve is reduced to selling vacuum cleaners door-to-door while filing repeated insurance claims to cover the missing home. Grandma Jess is highly clairvoyant, and says that Diane and Carol Anne are clairvoyant as well. Grandma Jess later dies from natural causes, but not before telling Diane one last time that she'll always \"be there\" if she needs her. Taylor shows up as Kane begins his first assault on the home. Unable to get in through the television as the family has removed all television sets from the home, Kane's minions are forced to find another way in, this time through Carol Anne's toy phone. The attack fails, and the family gets out of the house fast. Taylor introduces himself and convinces them that running would be a waste of time since Kane would only find them again, and they return to the house, which Taylor has made safe for the time being. Kane himself shows up at the home one day in human form, and demands to be let in, but Steven stands up to him and refuses. Taylor congratulates him for resisting Kane, and then takes Steve out to the desert and gives him the Power of Smoke, an Indian spirit that can repel Kane. Tangina shows up at the house and helps Diane to understand the history of Kane and how he became the Beast that is now stalking the family: he was once a man, the Reverend Henry Kane, who led his followers into the cave because he believed the end of the world was coming, then refused to let them leave after the date he predicted came and went. Because he was so evil, Kane became a monster after death. Taylor warns the family that Kane is extremely clever, and will try to tear them apart. One night, Steven lets his guard down and gets drunk, swallowing a Mezcal worm that is possessed by Kane, who temporarily possesses him. He attacks and tries to rape Diane, who cries out that she loves him. Steven then vomits up the worm possessed by Kane, which grows into a huge, tentacled monstrosity. In this form Kane attacks Steven from the ceiling, but Steven uses the smoke spirit to send him away. The Beast then decides on another assault, and this time, the family decides to confront the Beast on his own turf, the Other Side. The Freelings return to Cuesta Verde and enter the cavern below their former home, where Kane pulls Diane and Carol Anne over into the Other Side. Steven and Robbie jump in after them through a fire started by Taylor. On the Other Side, Diane, Steven, Robbie, and Carol Anne unite, but Kane grabs Carol Anne. Taylor gets a charmed Indian lance into Steven's hands, and Steven stabs Kane with it, defeating the monster and causing him to fall into the afterlife. Carol Anne nearly crosses over into the afterlife as well, but Grandma Jess' spirit appears and returns her to the family. The Freelings then return safely to this side, and thank Taylor and Tangina.",
      "writers": [
         "Michael Grais",
         "Mark Victor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091778/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDYwODU0MTgxNl5BMl5BanBnXkFtZTcwMzkzODM1NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: JoBeth Williams, Craig T. Nelson, Heather O'Rourke | See full cast and crew »"],
      "reviews": [
         "\"Poltergeist II: The Other Side\" is a very interesting movie despite the fact that the plot was rather subpar. My favorite movie of all time is the original \"Poltergeist,\" and this movie is a respectable sequel. I like it because of the character Kane, for one, who gives the movie another ghostly dimension. Julian Beck was wonderful in the film as Kane. Also, the children remained good actors, especially the late Heather O'Rourke, who played Carol Anne. This is another strong performance by the young actress, and would have gone on to be a wonderful adult actress later in life had she lived. All in all, I give it a 7.5 out of 10.",
         "Poltergeist II (1986) was the second film of the Poltergeist Trilogy. With the amount of money the first film made. the studio decided to make another film. The principal players from the Freeling family are here (sans Dominique Dunne, for reasons known) along with an old friend from part one. A new character is added to the mix as well. Poltergeist II is darker than the first one (if you can believe that) but not as brilliant as the first one. The Freelings have moved away from the remnants of the home. After the horrific events of part one, things can't get any worse (or can they...). An evil entity is following the family on the run. For awhile things are relativity calm. They've set up a new residence (with a family member) but the family has fallen on some pretty hard times. But they're about to get even harder. A dark man has been visiting them hurling religious epitaphs at them. Like a family house guest he doesn't want to leave and is even more bothersome than a Fuller Brush salesman or a religious solicitor. Does this strange figure intended to harm the Freelings or is he a person from the family's past? A scary sequel. Not bad, if you want to follow the exploits of the Freelings then this movie is for you. Poltergeist II is a worthy sequel. I enjoyed it very much. Followed by the final entry in the Poltergeist trilogy, the ever so dark and (surprisingly frightening) part three. Recommended.",
         "I have seen this sequel to \"Poltergeist\" many times and have always enjoyed it as much as I did the first movie. You will find that most people who dislike this sequel do so for the simple fact that it's a \"SEQUEL\" to the original 1982 \"Steven Spielberg\" produced hit (surprise surprise!) and \"Spielberg\" was nowhere in sight this time around (so what!), not everybody cares about whether a big director is involved with a movie/sequel or not including myself. The sequel is written & produced by \"Mark Victor\" & \"Michael Grais\" who co-wrote the original with \"Steven Spielberg\" and follows the doomed Freeling family four years after the original classic left off... I have always regarded \"Poltergeist II\" as a worthy follow up with it's flaws (which it is) and can still not understand how this movie made it's way from a running time of \"130\" minutes down to a mere \"91\". Its obviously down to MGM rushing the movie's production and ordering pathetic cuts. Some of this movie's editing is really poor and it's a shame because the movie is actually pretty good and only really falls apart at the end when you can see how bad a hack job this movie really received. They should have dropped \"The Other Side\" from the title because you only get to see it in the movie for about 2 minutes and what you do get to see is a rushed not-finished mess of a finale. The Poltergeist franchise should have been sold to UNIVERSAL (The company \"Steven Spielberg\" first approached about the original). They would have given this movie the justice it deserved. As for the third movie \"I really don't care\" nothing could have saved the third movie from being bad\". Even with it's problems, I still loved the character's from the first movie, the plot was on the right track and introduced us to one of the most memorable villains in horror sequel history, the evil \"Reverend Kane\" brilliantly portrayed by \"Julian Beck\", and while not being as productive as the original, the special effects held up too. Wrapping everything up, this movie is a decent sequel and has the advantage of retaining most of the original cast from the first movie (minus \"Dominique Dunne\" who was murdered by her boyfriend shortly after filming the first movie) and there are some really good classic moments in this sequel, one being... \"The Vomit Creature!\"...check your Tequila for strange worms swimming around in it next time!. 7/10",
         "This sequel was okay at the theater when I saw it, but it wasn't great. Kind of an average film that adds plot points that really are a bit weak. We find out in this one that it was not necessarily the fact the little community was sitting on an old cemetery that was the problem in the first one, but rather that the house was over some burial ground of a cult. There is also this really old man that is a bit creepy wandering around looking for Carol Anne and the Freeling clan. I just think they wanted to add a more physical enemy, someone you could focus on. The family is now living with grandma, but strange stuff starts happening again. For some reason they want Carol Anne. An Indian guy comes to their aid and gives them advice and there are a series of happenings, but this one just isn't as good as the first one as it is very slow in places. The ending was just plain lame and only makes this one worse than it is. As not good as this is though, the next Poltergeist makes this one look a lot better. Some good scenes here and there, but ultimately this one disappoints. Though there is that memorable scene with the worm.",
         "While not as good as the first one this movie was interesting. It was well made and featured many of the same actors and actresses as well as a few new ones, who all turned out excellent performances. The story line was solid and thought out. I particularly felt that Julian Beck's character Cane was a nice addition. He was chilling to watch on screen as a antagonist to the family. Will Sampson as Taylor was also an interesting character. R.I.P to both actors and to O'Rouke. Overall a good film but one that can not possibly hold a candle to the original. 6 out of 10.",
         "Despite the fact that 'E.T.' was released the same year, the first 'Poltergeist' was still quite a hit at the box office and with critics and viewers. The studio wanted a sequel, something that I don't think anyone expected to happen. I mean the end of the first one didn't really leave the door open and there weren't many questions left to be answered. But 4 years later we got one anyway, but like most sequels it was met with a mixed reaction. I've never understood why, and like many others, I feel 'Poltergeist II' is a vastly underrated and under-appreciated film. Pros: Excellent performances from the returning cast members and the newcomers. Another great score by Jerry Goldsmith, which has classic themes and some memorable new ones. Has a darker and more sinister atmosphere than the original. Plenty frightening moments and images. There's also a few nice, sweet moments. Awesome creature and visual effects. Provides a pretty interesting back-story on the spirits. A terrifying villain in Reverend Kane. Well-paced. Some more cool set pieces, especially the one set in the garage. Cons: The finale isn't bad per se, but the villain is done away with too fast and easily. Final thoughts: A sequel this good doesn't come often. Unlike some other part 2s, like 'Amityville II: The Possession' for example, this one has heart in it. It isn't just another poor attempt to cash in on the name of the original. That's a sequel to be proud of. My rating: 5/5",
         "\"Poltergeist II: The Other Side\" is a mostly average sequel to the superb 1982 horror movie about unfriendly ghosts terrorizing a suburban family. This movie is not real bad like most people say it is (I did like some of it), but it's not real good either. \"Poltergeist II\" takes place in Arizona, which is where the Freeling family now resides. But no matter where you go you can't keep a nasty ghost down, and those pesky spirits are back to terrorize the family once again. Where the first film was scary with a great sense of humor, the second film comes off more funny than scary. Not a good sign for a horror film where you're expected to be scared. And there isn't much scares this time around. Plus, the special effects this time around aren't as effective as they were in the first film. Nevertheless, the effects received another Oscar nomination, which to me was surprising. If there's anything to like about \"Poltergeist II\", it's the acting. JoBeth Williams, Craig T. Nelson, Heather O'Rourke, Oliver Robins, and Zelda Rubinstein are all back reprising their roles from the first film, with a few new faces add to the cast. The new cast members add some spark here. Will Sampson is very good as the Indian medicine man who also happens to be an exorcist, and comes in to help out the Freelings; Julian Beck makes a strong presence as the evil preacher who happens to be the leader of the ill-mannered ghosts (Beck was reportedly very ill when he made this, and it shows on the screen; he died right after filming completed); and the great veteran actress Geraldine Fitzgerald has a nice small part as Grandma Freeling. So to sum up this film: good acting, bad story, so-so effects, which makes for an average movie. *** (out of five)",
         "It seems as though most people will give a sequel a bad rating just for being a sequel. I think this is the case with \"Poltergeist II\". Though the sequel may not have been written and produced by Steven Spielberg, it still retains the same qualities as the original feature. The Freeling family are still quite likeable and despite the past events they have not lost their sense of humour; the special effects are top notch, Jerry Goldsmith's spooky music sends shivers down your spine and the cast deliver, in particular the late Julian Beck as Rev Henry Kane. What an uncanny and intense performance! MINOR SPOILER!!!! Watch P2 at dead of night and hear him sing \"God lives in his only temple\" accompanied by Goldsmith's awesome score and then tell me it doesn't scare the hell out of you and you're a liar in my eyes! In my humble opinion, the scene with Kane approaching the family's house and asking the father to let him in, ranks among the most terrifying scenes in movie history! Genius! Verdict: So all in all P2 deserves to be recognised as a compelling and most riveting sequel that should have gotten the recognition it deserves. I've seen it dozens of times and the excitement and fun has yet to wear off. Just watch it with an open mind. It's well worth it. 9/10",
         "In this follow-up to Poltergeist, the Freeling family call on the big Native American fella from One Flew Over the Cuckoo's Nest to help them once again defeat evil malevolent spirits that seem to not like them very much. As with virtually all sequels this one is inferior to the original. However, the first film wasn't all that great and this one isn't a complete washout either. The story is modified somewhat from the first episode so that now the source of the poltergeist unrest is attributed to the dead followers of a cult leader, as opposed to the dead disturbed by unscrupulous property developers. The change has really only been made so that they can have a sequel to be perfectly honest, however, it does mean that the series is able to introduce the evil Reverend Kane. Kane is probably the best character in the series and his scene where he confronts the Freeling family on their front porch is the scariest and most well-crafted moment in any of the films. Julien Beck is excellent and unforgettable as the skeletal preacher. The rest of the cast play it strictly by numbers, although once again Heather O'Rourke is fab as the little girl. The other daughter is completely written out of this film with no explanation. Although it's a well documented fact that the actress who played her, Dominique Dunne, was murdered shortly after the first film was released, I still don't think it would have trashed her memory to have explained her absence; quite the opposite in fact. The Poltergeist series was perhaps most famous at the time for its spectacular visual effects and this film is no exception. The demon Kane is a well rendered creation, and there are a number of cool 80's effects throughout. Unfortunately, though, it all ends in a somewhat underwhelming finale where the family enter some vortex or something. I think it would have been better if they had cut back on the special-effects here and simply re-introduced Reverend Kane, as he was much scarier. But I guess having a big effects-laden ending is one of the in-built rules of the Poltergeist movies sadly. Overall, there's good stuff in this sequel but it's ultimately squandered on a rubbish ending.",
         "Poltergeist is one of my all time favourite horror films. I loved the way filmmakers Steven Spielberg and Tobe Hooper created a haunted house chiller in the normalcy of suburbia. It gets under your skin so much, it makes you dread ever opening an airing cupboard again. And its a film that's aged gracefully. Its just as scary as the first day I saw it 20 years ago. Then four years later, out popped Poltergeist 2: The Other Side, but this time without Spielberg or horror maestro Hooper present. And the change is definitely noticeable. Its not that Poltergeist 2 is bad. It just falls short of what made the original so great. After the chaos in Part 1, the Freeling family moved away from Cuesta Verde, and what was left of their haunted house. Now they've moved in with Diane Freeling's (JoBeth Williams) prescient mother, Gramma Jess. But when she passes away, the spirits now have a clear path to the Freelings, and in particular, their youngest daughter Carol-Anne. Once again haunting their new home, the Freelings have help from Taylor (Will Sampson), an Indian shaman, who holds the family together until their final confrontation with the evil spirits. Poltergeist 2 is a passable sequel, but it hardly generates the scare quotient the original did. Poltergeist was an exhilarating roller-coaster ride of thrills and chills. Pt 2 has few thrills. The man in the directors chair this time is Brian Gibson. I can't say that I've ever heard of him, and I'm sorry to say this, but he's no Spielberg. Some of the shocks he comes up with are a bit inventive. Like when the Freeling's son Robbie has a nasty encounter with his braces. It comes alive right in his mouth and entangles him like a gigantic spider web. But elsewhere the scares it whips up are way out there. In fact as the film draws to an end, the shocks start to get a bit too silly for their own good. Consider this one. Steve Freeling (Craig T Nelson) is drinking tequila. At the bottom of the bottle is an evil worm. When Steve accidentally ingests it, it takes him over. For a time he turns evil, going completely over the top, and then throws up a hideous ghoul (or Vomit Creature as its called on the credits). Its a scene of such startling idiocy its almost embarrassing to watch. The film's saving grace is its supporting cast. Taylor is a great character. Will Sampson does a brilliant job bringing him to life. You really feel safe knowing that he's around, and his pep talks to the Freelings are inspiring and filled with wisdom. But the one character that makes you sit up and take notice is Reverend Henry Kane (Julian Beck), the demonic preacher after Carol-Anne. He only gets a couple of scenes but whenever he's around, the hairs on the back of your neck immediately creep up. This fella is scary just to look at. Julian Beck was dying of stomach cancer at the time, and his illness actually adds to Beck's already impressive performance. He looks so cadaverous and chilling. And his silky voice intensifies his frightening appearance. The scene where he tries to hypnotise Steve into letting him in the house is terrifying. Jerry Goldsmith also turns in another great theme tune, especially in Kane's scenes. But having the words \"God is in His Holy Temple\" thudding on the soundtrack is a bit much. The film overdoes it too, to the point of tedium. The film also tries to answer the questions left hanging by the first one. But the plot is made up of many ill-fitting odds and ends that by the climax, I was no closer to working out the nature of these spirits or their intentions. The ending is vaguely unsatisfying. I didn't get the impression of a battle hard won. The film was trimmed down from 130 minutes, so I'm told. So I have to wonder what was left on the cutting room floor. It would be interesting to see it restored in a DVD special edition some day. Perhaps the film and the ending would be all the better for it. Poltergeist 2 is a film that suffered from severe editing. You can tell. You can't shake the impression you're watching an incomplete picture. And that's why the film doesn't work properly. Its watchable, but the haphazard structure undermines the film at key moments. And it just doesn't penetrate your defences the way Part 1 did. Its better than the dreadful Poltergeist 3, but its only a mildly unnerving haunted house show. Not the ride in pulse racing terror that it should have been."
      ],
      "genres": ["Horror"],
      "productionCompanies": [],
      "summaries": [
         "The Freeling family move in with Diane's mother in an effort to escape the trauma and aftermath of Carol Anne's abduction by the Beast. But the Beast is not to be put off so easily and appears in a ghostly apparition as the Reverend Kane, a religeous zealot responsible for the deaths of his many followers. His goal is simple - he wants the angelic Carol Anne; but the love of her family and the power of psychic Tangina once again unite, along with an elderly native American, to fight for her life.",
         "The Freeling family have a new house, but their troubles with supernatural forces don't seem to be over."
      ],
      "budget": 19000000
   },
   "movielensId": 1995,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-05-23",
      "dvdReleaseDate": "2003-08-26",
      "directors": ["Brian Gibson"],
      "runtime": 91,
      "movieId": 1995,
      "title": "Poltergeist II: The Other Side",
      "mpaa": "PG-13",
      "actors": [
         "Craig T. Nelson",
         "JoBeth Williams",
         "Heather O'Rourke",
         "Oliver Robins",
         "Zelda Rubinstein",
         "Will Sampson",
         "Julian Beck",
         "Geraldine Fitzgerald",
         "John P. Whitecloud"
      ],
      "imdbMovieId": "0091778",
      "originalTitle": "Poltergeist II: The Other Side",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "vOJGNobMclA",
         "EwsHWPCS0m4"
      ],
      "plotSummary": "The Freeling family move in with Diane's mother in an effort to escape the trauma and aftermath of Carol Anne's abduction by the Beast. But the Beast is not to be put off so easily and appears in a ghostly apparition as the Reverend Kane, a religeous zealot responsible for the deaths of his many followers. His goal is simple - he wants the angelic Carol Anne.",
      "tmdbMovieId": 11133,
      "avgRating": 2.49726,
      "releaseYear": "1986",
      "numRatings": 1643,
      "posterPath": "/wp8IkFabtxJohz8ivfwNWt4Bcse.jpg"
   }
}