{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "korean war",
            "id": 3264
         },
         {
            "name": "drifter",
            "id": 13017
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0114663",
      "video": false,
      "title": "Three Wishes",
      "recommendations": [
         46924,
         24962,
         49345,
         66469,
         17207,
         47608,
         59977,
         25576,
         40480,
         15128,
         292044,
         76229,
         31633,
         24736,
         36914,
         61418,
         117258,
         117904,
         161495,
         28320
      ],
      "backdrop_path": "/bDCr50l4P0o8g1Aw7e5C6sjLaQo.jpg",
      "revenue": 7025496,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Jack McCloud",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e813",
               "name": "Patrick Swayze",
               "profile_path": "/b5G8AGP609DsUeokQ1asnqYJBSl.jpg",
               "id": 723,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Jeanne Holman",
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e817",
               "name": "Mary Elizabeth Mastrantonio",
               "profile_path": "/jNIGODCEy216bbPnj28ky5E4L3Q.jpg",
               "id": 1161,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Tom Holman",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e81b",
               "name": "Joseph Mazzello",
               "profile_path": "/zsBGvymDqB737PerJTqhS9dPuBd.jpg",
               "id": 4787,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Phil",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e81f",
               "name": "David Marshall Grant",
               "profile_path": "/tKe6LIoceX8738rIELToYMuefCH.jpg",
               "id": 24535,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Coach Schramka",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e823",
               "name": "Jay O. Sanders",
               "profile_path": "/wgCFAatAtmfN5zWgwzGgA48wwXu.jpg",
               "id": 6067,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Adult Tom",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e827",
               "name": "Michael O'Keefe",
               "profile_path": "/w6ssYHZER9wrZ1fWen6iUEQWYan.jpg",
               "id": 38085,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Leland's Dad",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e82b",
               "name": "John Diehl",
               "profile_path": "/hDUvgqpIv753skoeRGjVw6gYp7A.jpg",
               "id": 4942,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Joyce",
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e82f",
               "name": "Diane Venora",
               "profile_path": "/3k7w5Y7gTAxN1JML7jhN8F8rVrS.jpg",
               "id": 6200,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Scott",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e833",
               "name": "Brock Pierce",
               "profile_path": null,
               "id": 72862,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Brian's Father",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e837",
               "name": "David Hart",
               "profile_path": null,
               "id": 106119,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Scott's Father",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e83b",
               "name": "Scott Patterson",
               "profile_path": "/tXrO1CHnuR6zjpHh2JXNtozW0XC.jpg",
               "id": 50020,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Sackin's Father",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e83f",
               "name": "Michael Laskin",
               "profile_path": "/dt0nTgeDt8kfWWtpXvanE1L28q8.jpg",
               "id": 19454,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Leland's Mother",
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e843",
               "name": "Annabelle Gurwitch",
               "profile_path": "/fNubMSpdGfRT94qDsOKJs7BcdZd.jpg",
               "id": 42324,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Katherine Holman",
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e847",
               "name": "Moira Harris",
               "profile_path": "/nhtDA9vLKqg2KnEjw9UgOuz2tMO.jpg",
               "id": 7221,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Policeman",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e84b",
               "name": "Neal McDonough",
               "profile_path": "/8Vg7WKE4QEGz18at8mQHP9aqEbB.jpg",
               "id": 2203,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Neighbor",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e84f",
               "name": "Bill Mumy",
               "profile_path": "/ciFUMYHa9tmGdz52vedmoTOfJde.jpg",
               "id": 49357,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Neighbor's Wife",
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e853",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Neighborhood Teenager",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e857",
               "name": "Garette Ratliff Henson",
               "profile_path": "/xXzXov8q56YxH8pbHb1DrJ8hrV.jpg",
               "id": 76239,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Additional Ball Player",
               "gender": 0,
               "credit_id": "52fe474fc3a36847f812e85b",
               "name": "Michael Wong",
               "profile_path": "/bpqmMC4oUPtke5g3XiWCnMGmbzi.jpg",
               "id": 64896,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e7fd",
               "name": "Martha Coolidge",
               "profile_path": "/6XDmHbCLMtzvVU8h5ZauG8CkSIl.jpg",
               "id": 63713,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e803",
               "name": "Clifford Green",
               "profile_path": null,
               "id": 65363,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e809",
               "name": "Ellen Greene",
               "profile_path": "/nJzE8dS38hxbALr5LZ88BYt8dm0.jpg",
               "id": 13420,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e80f",
               "name": "Elizabeth Anderson",
               "profile_path": null,
               "id": 67394,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "588fd85ac3a3687f030000e2",
               "name": "Phil Tippett",
               "profile_path": "/2uQ0B7fN5cDQk17J1X3pxDSf9y.jpg",
               "id": 7727,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5aa527820e0a26075d023f0a",
               "name": "Tony R. Medina",
               "profile_path": null,
               "id": 1995913,
               "department": "Crew",
               "job": "Propmaker"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.63517,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47939,
      "vote_count": 24,
      "budget": 0,
      "overview": "While Jane Holman (Mastrantonio) is driving with her two sons, she accidentally runs into a drifter, Jack McCloud (Swayze), who breaks his leg. Being responsible,  Jane invites Jack, and his dog, to stay at her home until his leg has healed.  Jack struggles to adapt their lifestyle, and finds himself loved by the family. He starts teaching baseball to Tom, who misses his father, who was lost in the Korean war. Jack and Tom develop a strong bond of friendship. Meanwhile, Gunny believes that there is more to Jack and Betty Jane than meets the eye...  We learn that Jack, is Jack McCloud, a Star White Socks baseball player in 1941, who dropped out of the league, after his first season, and; \"was never heard from again\" ...  A wonderful story.  We witness magic between a boy's imagination, and Jack's dog, and are never sure if we are witnessing imagination or magic by the dog.  A story of friendship, family, and learning that life isn't always as cut and dried as we often believe.",
      "similar": [
         141,
         9598,
         97630,
         112160,
         858,
         8810,
         634,
         437557,
         297762,
         242224,
         424488,
         2280,
         16859,
         11544,
         129,
         8966,
         8967,
         10830,
         10555,
         49444
      ],
      "original_title": "Three Wishes",
      "runtime": 115,
      "poster_path": "/ub79b63JJV4oeHwomSy5OS5fVsr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Savoy Pictures",
         "id": 11308,
         "origin_country": ""
      }],
      "release_date": "1995-10-27",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "If you really believe, magic will find you",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martha Coolidge"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Clifford Green",
         "Ellen Green"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114663/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMTYxODc2N15BMl5BanBnXkFtZTcwMTMzNjAwMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Patrick Swayze, Mary Elizabeth Mastrantonio, Joseph Mazzello | See full cast and crew »"],
      "reviews": [
         "Just watched this movie in TV. Although it had a slow pace and some of the characters were not fully developed, I liked it. Especially appealing to me, as a senior, was the locale and the truly accurate portrayal of life and times in the late 1950's. Even the kitchen appliances and the dish ware were spot on! I lived in a tract just like the one in the film - the San Fernando Valley urban explosion! I thought the players were all fine and the child actors were very effective. The story dragged a bit but pacing is not everything - sometimes it is good to linger a bit and be nostalgic. This is a good movie for thoughtful teens who can appreciate the message given about home, hope and history.",
         "I watched this movie on TV twice. It's the first movie I've watched by Patrick Swayze. I was moved by the story and felt myself like that little Tom very much. I couldn't help crying when I saw the ending and told myself I should learn from this movie. And till then I began to understand the meaning of the movie. It's a good movie for a family to watch together. I think many people can learn from this movie that we should cherish what we already have had in hand. As the saying says, happiness lies in satisfaction. And it's not a big story, so it may not have got much attention from audience. But still I would say it's a good movie.",
         "I read one of the comments and it wasn't favorable.. but I'll venture to disagree. the movie held my interest until 2:30 in the am.. it made me laugh and cry and it touched my heart strings.all the little boys did a real good job acting, as did the adults. it sent many positive messages on living life and being true to yourself...and the courage to do what makes you happy.also that prayer works.... I e-mailed one of my daughters and told her she too might enjoy it.. so what if it's fantasy...it was a feel good flick and I am happy I had the chance to view it..by far beats all the horror and murder movies and give hope that the world can be turned into a better place one man/woman at a time....",
         "This movie is better than the rating suggests. Patrick Swayze displays some tremendous acting skills as the ever blue Jack McCloud, a tramp and thorough loner. He is sincere and pervasive, as is Joseph Mazzello as Tom. The evolving relationship between the two of them is one of the three major themes of the movie. It is a relationship propelled by Tom's dear wish to have some male person around he can relate to and rely on, as his father is apparently absent. Jack, who joins the family as a stranger, develops a kind of deep and caring commitment towards the three family members. He doesn't push for it, it just happens. The second theme focuses around M.E. Mastrantonio's brilliant performance as Jeanne Holman, Tom's and Gunny's mom. Her despair mingled with hope and confidence makes her the archetype of the single parent of the Mid-50s, the era which is so superbly revived as the movie's setting. The third theme centers around Gunny, Tom's little brother, his belief in magic and fairies as well as his fears. This is the movie's underlying main theme, as the title itself suggests. The end, which makes you feel good and renews faith in what we have and ought to preserve and care for, reveals the message of the title and grants this movie an inspiring and deeply human message. Magic is out there - in everything we do and everything we dream of. It is the little things, the little signs of love and affection, of hope and endurance. Tom himself, as an adult, receives reassurance in his faith and his values by what Jack has done to his family when he was a young boy. The message is brilliant and makes this movie a solid 8/10. \"Be yourself\", Jack advises Tom. \"And be happy with what you have\" he adds much later in the movie. Hope and love will endure against all odds, if we allow magic into our lives. The same magic we believed in as kids. It is still there. You just have to admit it.",
         "When my 5 year old and I entered the theater for this film, all I knew was that it was not R rated. To my great pleasure and surprise I found a gem of a movie I continually recommend to all my friends. After my brother and I watched it a few years ago you could have called us the \"blubber brothers\" as we both were overcome by the its generous wish for us all.",
         "I was up late already... But the story drew me in and as the minutes ticked by I decided this was worth it to stay up until 1:30 AM to see the ending even though 6 AM was going to come awfully early. This was an all-around feel-good movie... A bit of magic, a lot of courage from a single mom, a bit of baseball (and who doesn't like a bit of baseball in their movies?), a dog who might be more than a dog, and Patrick Swayze quietly helping a suburban community think outside the box. He's kindly and unfailingly honest. I'm just surprised the suburbanites didn't lynch him and stone his kind single-mom hostess after his first week there. The end had a nice wrap-around closure. Totally worth staying up for!",
         "After reading nothing but negative reviews for Three Wishes all my expectations were crushed, but I watched it anyway. It was an excellent, perfectly acted (in most cases), well directed film with beautiful camera work. Mary Elizabeth Mastrantonio plays a single mother of two whose husband supposedly died in Korea (it takes place in the fifties). She invites a mysterious stranger who she hit with her car (causing a broken leg) to stay with them until his cast is taken off, with no idea on how he will change their lives forever. In his movies, Patrick Swayze is either good or horrendous. In this one he is both. At some points it looks like he'll get an Oscar, at others, a Golden Raspberry. The underrated Mary Elizabeth Mastrantonio (The Abyss, Limbo) is very good in her role, but the best performance belongs to Joseph Mazzello, who plays her oldest son, Tom. Despite being third billed, Mazzello probably has the most screen time, and should've got some kind of award for his performance (though he wasn't as good her as he was in The Cure). The other two leads were good. In his first film Seth Mumy plays Mastrantonio's youngest son, and is given very few scenes with the rest of the family, spending most of his time with Swayze's dog, who I'll go to now. The dog is completely adorable and happens to be a very good actor, even though he/she is a dog. Without revealing anything, I'll say that the ending was completely unexpected, in a bad way. It was stupid, full of holes, unnecessary and made the director look like she (I think) had run out of ideas. Michael O'Keefe plays Tom in 1995. He is so unbelievably awful, he almost bring the whole picture down with him. It would've been better if the narration had been left out. Sadly, Three Wishes was one of the box office disasters that destroyed Rysher Entertainment. (Who had my favorite logo for a production company. Bad reason) + (GOOD THINGS) 1.) Camera work 2.) The promising cast 3.) The adorableness (is that a real word?) of the dog 4.) Joseph Mazzello's performance 5.) Mary Elizabeth Mastrantonio's performance 6.) Direction 7.) The script - (BAD THINGS) 1.) The ending 2.) Flashback narration Total: 8.5/10",
         "I actually read a review that Siskel and Ebert gave this movie in my local newspaper. They both said this movie was horrible and gave it a few more bad reviews. Can't remember what it was, but when I saw the movie, I loved every minute of it. This movie basically shows how a simple act of kindness can bring a family closer together in times of desperation. I enjoyed how much thought went into producing such a heart-warming tale and so many times when I watch it, it makes me understand what the family goes through and sympathize with them. For people who want a movie that can truly bring a family together and show that even the most difficult things that occur in life can have a way of working out, this movie will definitely show you that.",
         "It's a great movie. Did not claim to be, but it was very well prepared and contains a very strong message and unusual. If an analysis of the film from the point of view of psychoanalysis, possibly conclude that the film shows nothing more than the desires of each family member. Just that. Are dreams that help support the reality. The role played by Swayze reminds me gunslinger Shane, a character from the magnificent film directed by George Stevens, who was the angel savior, the redeemer, the expected stranger who comes, does its job and disappears.Reconstitution of 40 and 50 is high quality and the atmosphere created in addition to the excellent performance of Mary Elizabeth Mastrantonio elevates this film to a level not imagined, I believe, by their makers. Very good.",
         "Certainly a mixed bag of comments on this one. I'm definitely one of this film's boosters. I saw it long ago on a motel tv in the middle of the night and have never forgotten it. My memory was that it was an 80s movie; I suppose because most of the plot was set in the 50s. When I rediscovered that it was made as late as 1995 I was quite surprised. The fact that women directors and writers were so heavily involved with this movie explains its beautiful emotional resonance. Even now as I write this I'm again deeply moved by the whole story and its telling. To me it's right up there with films like \"It's a Wonderful Life\" and \"Miracle on 34th Street,\" etc. Recently TCM has been featuring great women screen writers like Frances Marion and April Guy Blache. I'm glad to discover that women are still and again strongly contributing to our collective screen world of emotions and feelings. Too bad this sensitive approach seems to turn some of your reviewers strongly off. Perhaps it's a gender thing."
      ],
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": ["Rysher Entertainment"],
      "summaries": [
         "When Jane Holman is driving with her two sons, Tom and Gunny, she accidentally runs into a drifter, named Jack McCloud, who breaks his leg. Feeling sorry for him, Jane invites Jack and his dog Betty Jane to stay at her home until his leg has healed. After having some difficulties to adapt to this new lifestyle, Jack soon finds himself loved by the family and they all want him to stay. When he starts teaching baseball to Tom, who misses his father who's missing in the Korean War, the two of them develop a strong bond. Meanwhile Gunny believes that there's more to Jack and Betty Jane than meets the eye, and he's determined to find out!",
         "In an unexplained act of charity, Jeanne Holman, picks up an injured, apparent tramp and takes him home to care for him little realising who he was or the effect he would have on her life and those of her family."
      ],
      "budget": 0
   },
   "movielensId": 201,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-27",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Martha Coolidge"],
      "runtime": 115,
      "movieId": 201,
      "title": "Three Wishes",
      "mpaa": "PG",
      "actors": [
         "Patrick Swayze",
         "Mary Elizabeth Mastrantonio",
         "Joseph Mazzello",
         "David Marshall Grant",
         "Jay O. Sanders",
         "Michael O'Keefe",
         "John Diehl",
         "Diane Venora",
         "Brock Pierce",
         "David Hart",
         "Scott Patterson",
         "Michael Laskin",
         "Annabelle Gurwitch",
         "Moira Harris",
         "Neal McDonough",
         "Bill Mumy",
         "Colleen Camp",
         "Garette Ratliff Henson",
         "Michael Wong"
      ],
      "imdbMovieId": "0114663",
      "originalTitle": "Three Wishes",
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["hQR4_rT0qB4"],
      "plotSummary": "While Jane Holman (Mastrantonio) is driving with her two sons, she accidentally runs into a drifter, Jack McCloud (Swayze), who breaks his leg. Being responsible,  Jane invites Jack, and his dog, to stay at her home until his leg has healed.  Jack struggles to adapt their lifestyle, and finds himself loved by the family. He starts teaching baseball to Tom, who misses his father, who was lost in the Korean war. Jack and Tom develop a strong bond of friendship. Meanwhile, Gunny believes that there is more to Jack and Betty Jane than meets the eye...  We learn that Jack, is Jack McCloud, a Star White Socks baseball player in 1941, who dropped out of the league, after his first season, and; \"was never heard from again\" ...  A wonderful story.  We witness magic between a boy's imagination, and Jack's dog, and are never sure if we are witnessing imagination or magic by the dog.  A story of friendship, family, and learning that life isn't always as cut and dried as we often believe.",
      "tmdbMovieId": 47939,
      "avgRating": 3.03238,
      "releaseYear": "1995",
      "numRatings": 386,
      "posterPath": "/ub79b63JJV4oeHwomSy5OS5fVsr.jpg"
   }
}