{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0076054",
      "video": false,
      "title": "Freaky Friday",
      "recommendations": [
         14612,
         46878,
         10631,
         24236,
         20096,
         42239,
         31944,
         112170,
         33839,
         42473,
         14822,
         17447,
         1793,
         27224,
         66762,
         43249,
         197467,
         70259,
         14550,
         21185
      ],
      "backdrop_path": "/fMiG4SU1iMebXQH5JDefQBMRVtE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Annabel Andrews",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e4fb",
               "name": "Jodie Foster",
               "profile_path": "/eAIE6bnOQ8rm0f933gyeAQdIwrP.jpg",
               "id": 1038,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ellen Andrews",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e4ff",
               "name": "Barbara Harris",
               "profile_path": "/j3c7qYmGUI3jQyEVBFA9F4RJWL6.jpg",
               "id": 30618,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bill Andrews",
               "gender": 2,
               "credit_id": "52fe46a19251416c7507e503",
               "name": "John Astin",
               "profile_path": "/2b0Iv7mg0kTnyH4ZU0ajk2e0wYL.jpg",
               "id": 41230,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mrs Schmauss",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e507",
               "name": "Patsy Kelly",
               "profile_path": "/soUhE8AQeLckoUsmarAPTBBeJs5.jpg",
               "id": 12025,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Harold Jennings",
               "gender": 2,
               "credit_id": "52fe46a19251416c7507e50b",
               "name": "Dick Van Patten",
               "profile_path": "/mAYJ9Psvz3JQAvHXDwdcegO3Wok.jpg",
               "id": 14671,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Virginia",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e50f",
               "name": "Vicki Schreck",
               "profile_path": "/AlQBCIisJzeVulJ8V5uTbXS6TNI.jpg",
               "id": 121353,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mr Dilk",
               "gender": 2,
               "credit_id": "52fe46a19251416c7507e513",
               "name": "Sorrell Booke",
               "profile_path": "/4LuFV048VmqjbM98UWklsetsq60.jpg",
               "id": 40191,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr Joffert",
               "gender": 2,
               "credit_id": "52fe46a19251416c7507e517",
               "name": "Alan Oppenheimer",
               "profile_path": "/5UAa7wSnoh6JwiAKciCCKB9dnro.jpg",
               "id": 24320,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Opposing Coach",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e51b",
               "name": "Ruth Buzzi",
               "profile_path": "/600DeQdI6kAAVPBMkqMDDfEXV4k.jpg",
               "id": 22556,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Coach Betsy",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e51f",
               "name": "Kaye Ballard",
               "profile_path": "/y5LnBkH9cKQdRv5jf7u2AMCJCJV.jpg",
               "id": 121354,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Boris Harris",
               "gender": 2,
               "credit_id": "52fe46a19251416c7507e523",
               "name": "Marc McClure",
               "profile_path": "/5VPLVH1eAiIQ3s7aNjrgvzwTt3t.jpg",
               "id": 1067,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mrs Murphy",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e527",
               "name": "Marie Windsor",
               "profile_path": "/dy2787JbnskmAt2vjYTjYfFOYRx.jpg",
               "id": 3340,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Ben Andrews",
               "gender": 2,
               "credit_id": "52fe46a19251416c7507e52b",
               "name": "Sparky Marcus",
               "profile_path": null,
               "id": 121355,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Miss Gibbons",
               "gender": 1,
               "credit_id": "52fe46a19251416c7507e52f",
               "name": "Brooke Mills",
               "profile_path": null,
               "id": 121356,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Mary Kay Gilbert",
               "gender": 0,
               "credit_id": "52fe46a19251416c7507e533",
               "name": "Karen Smith",
               "profile_path": null,
               "id": 101967,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Drapery Man",
               "gender": 2,
               "credit_id": "558b8a2292514141d5002595",
               "name": "Al Molinaro",
               "profile_path": "/4BGMjNOkXchm0vbZVHNeSLyOfIN.jpg",
               "id": 1217791,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Bambi",
               "gender": 1,
               "credit_id": "558b8a3892514141db002621",
               "name": "Charlene Tilton",
               "profile_path": "/jZwoQorUzQXTbwENKDCYPIbCGxl.jpg",
               "id": 21862,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Mr. Jackman",
               "gender": 2,
               "credit_id": "558b8a4d92514141db002631",
               "name": "Fritz Feld",
               "profile_path": "/kTS9wZWTKH61e3e7k2LQOuBIle8.jpg",
               "id": 13821,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46a19251416c7507e4f7",
               "name": "Gary Nelson",
               "profile_path": null,
               "id": 47893,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "575e0046c3a36806ad001099",
               "name": "Mary Rodgers",
               "profile_path": null,
               "id": 1485215,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "575e004ac3a3687f6300054a",
               "name": "Mary Rodgers",
               "profile_path": null,
               "id": 1485215,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "575e0053c3a3687bbc00058d",
               "name": "Tom Leetch",
               "profile_path": null,
               "id": 1423959,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "575e0065c3a3687bbc000599",
               "name": "Ron W. Miller",
               "profile_path": null,
               "id": 12863,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "575e006c9251411c1b000504",
               "name": "Johnny Mandel",
               "profile_path": null,
               "id": 9796,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "575e00739251411c4d000525",
               "name": "Charles F. Wheeler",
               "profile_path": null,
               "id": 12119,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "575e00799251411c1b00050d",
               "name": "Cotton Warburton",
               "profile_path": null,
               "id": 5841,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "575e007fc3a36804700011bb",
               "name": "John B. Mansbridge",
               "profile_path": null,
               "id": 12869,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575e0085c3a36806ad0010af",
               "name": "Jack Senter",
               "profile_path": null,
               "id": 137190,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575e008cc3a3687f6300055d",
               "name": "Robert R. Benton",
               "profile_path": null,
               "id": 11083,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 10.230693,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16084,
      "vote_count": 75,
      "budget": 0,
      "overview": "School girl Annabel is hassled by her mother, and Mrs. Andrews is annoyed with her daughter, Annabel. They both think that the other has an easy life. On a normal Friday morning, both complain about each other and wish they could have the easy life of their daughter/mother for just one day and their wishes come true as a bit of magic puts Annabel in Mrs. Andrews' body and vice versa. They both have a Freaky Friday.",
      "similar": [],
      "original_title": "Freaky Friday",
      "runtime": 95,
      "poster_path": "/flADh6Vw4I2rAwr5LF3isAO9wFN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1976-12-17",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Annabel and her Mother are not quite themselves today - in fact, they're each other!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gary Nelson"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Mary Rodgers",
         "Mary Rodgers"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076054/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NjQwNjQzN15BMl5BanBnXkFtZTcwNzY4NzUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Barbara Harris, Jodie Foster, John Astin | See full cast and crew »"],
      "reviews": [
         "While the remake with Curtis and Lohan was good and Hollywood smooth with better production values (so what), the main difference is in the lead actors. I mean you know Jodie Foster can act circles around Lindsay Lohan (who couldn't) but the main difference is in the moms. Jaime Lee Curtis is a savvy pro who has her own take on the role but it's pretty flat in comparison. Barbara Harris I didn't remember from her small roles in Dirty Rotten Scoundrels and Peggy Sue Got Married but now that my memory has been jogged, she did a fine job. This movie, though, is her tour-de-force. What a fantastic performance. She is flawless and incredibly funny in this role. As fine a comedic turn as anyone has ever done; the nuances of voice, the facial expressions, the slapstick - all spot on. Jodie Foster is no slouch either. Her teenage roles have showed maturity beyond her years and a thorough understanding of her roles. She shines in this one. The supporting cast is well chosen and they're all good too. I can see why they remade it, though. Todays kids don't usually get into old movies so with a box office cinch like Lohan, why not? I like a lot of the 60's and 70's movies since that is my generation and subsequently have trouble enjoying the 30's and 40's movies. But a good movie is a good movie no matter when it was made.",
         "This movie, unlike the two so called remakes actually follows the book. My kids have all loved this movie and had no trouble at all relating to the incidents.Sure they have typing class instead of computer class but so what? So what if the Mom stays home and the Dad works. Many families do that today. The brother appears to be in half day kindergarten because he is picked up from school before lunch. Maybe Mom will go back to work next year. It may be a bit dated but that doesn't detract from the movie at all. Unlike many modern movies the kids are not smart mouthed brats who get away with such behavior. There are no gross jokes or rude, stupid humor. This is a fun movie for families, especially mothers and daughters to watch together. I would recommend this over the other two because it's how the author intended the story.",
         "It is no secret, that, back when we were grown ups, Disney made films that were as delightful as the next Sidney Lumet film. \"Freaky Friday\" is one of those many films. When young Annabelle Andrews, and her mother Ellen Andrews switch bodies on Friday the 13th, one heck of a journey is on the rise! This great tale of learning and growing up has been mocked, or copied twice, in vain. There are many reasons why this film should have only been seen the way the company originally produced it. First off, the message is quite easy to figure, and keeping it simple, but meaningful was the great way to spread it. The age-old story of two people walking a mile in each others shoes. A funny mother-daughter story that never gets old, this one has just as much a tender side as it does a comic side. About the film, the script is fresh and original, producing interesting narration by a game Foster. What makes this one almost a word for word act of the novel is because the author of the novel also wrote the screenplay. Some times, when the author also helps with the script, the outcome is less than amusing, but in this case, it was the best thing they could do. Mary Rodgers delivers the goods with this one, and the rich element of comedy is never wasted. The situations are almost too much. The incidents are made in ways to which an adult can laugh as much as a child can. In fact, most of the funny moments reflect more adult humor, such as Mrs. Schmauss and the liquor. Other moments such as typewriters going crazy, and one of the most hysterical ski sequences ever seem to be too much for children in todays times. Ergo, they remade this film twice. Once in '95 that was slow and dull, despite a good director and good cameos. And recently in '03 with a forced script. The two latter versions were made with more simple jokes to appeal more for kids. Such subject matter was also toned down. The situation with Annabelle and Ben. Why does Annabelle hate him so much? Because there is nothing more annoying than a perfect kid with no messy qualities. Later, same question, but answer goes as \"his sister doesn't \"hate\" him. he bugs her\". What is wrong with the normal sibling rivalry using the word 'hate'? The film also shows how much better times were back then. As thirteen year-old teens were taught to be a whiz on the typewriter, and speak very well of American history. Those times are just not here anymore, not much anyhow. IN any case, this film is a great joy of a film. Modern film-making at it's best, and of course, Disney made films good back then. Not like the senseless contrived mush we see today.",
         "The teenager Annabel (Jodie Foster) has friction with her mother Mrs. Andrews (Barbara Harris) and her younger brother Ben. One Friday morning, the both wish to be the other for one day at the same time and their wishes come true and they swap bodies. Meanwhile, Mr. Andrews (John Astin), who is the PR of a company, is preparing a party to promote a real estate, and he counts on the support of his wife and daughter. Along the day, Annabel and Mrs. Andrews learn the problems of each other and understand the difficulties of the other. The original \"Freaky Friday\" is a very funny Disney movie even thirty-six years after its release. Barbara Harris steals the film and together with the teenager Jodie Foster, they are responsible for hilarious situations. My vote is seven. Title (Brazil): \"Se Eu Fosse a Minha Mãe\" (\"If I Were My Mother\")",
         "This is definitely one of the very best of Disney's many comedies. Perhaps it's the great writing from Mary Rodgers, author of the book, or the spectacular acting from the entire cast, especially a young Jodie Foster and Barbara Harris. The film is incredibly funny, without being stupid, and it feels very real and authentic, an element that is gone from almost every other Disney film of the era. Although it includes the typical Disney chase scene, the rest of Disney's usual cliches are dropped so that the focus is on the characters and the believable and hilarious situations that they get into. A definite 10/10! Go rent it! Be sure that you get the 1977 version, though, not the 1995 remake.",
         "This film is truly one of a kind, and it disgusts me that remakes are the order of the evening with this one! As a young girl, (Foster) and her mother (Harris) are at the edge of their sanity together, the unthinkable happens!!! The switching of the minds into seperate bodies! \"Id like to be you for a day\" The opening song suggest, and they weren't kidding! With a terrific cast of main roles,(ie- Harris, Foster, and Astin) Not to mention an even more funny cast of co-stars! (ie-Marc McClure, Patsy Kelly, and Charlene Tilton) This film gets away with the most funny of jokes, involving washing machines, and cars, and cop chases! only the best films could do all this and still hold entertainment for adults and kids, and the fact that this film was remade 2 times in insulting to me! I did find Melanie Mayron's version humorous, it was not nessasary! Still, true classics prevail!",
         "Never particularly loved this movie but it is lifted above the usual Disney fare by Jodie Foster, who was just totally incredible in this. You watch her and she nails the part - her performances in her movies are always better than great but to have been this good as a kid is kinda spooky, she delivers her lines so well. She is just about one of the finest actresses working in movies today along with Meryl Streep. It is so rare for a child to be as mature in performance as Jodie was. I guess the nearest child star in terms of performance is Haley Joel Osment. I have seen the remake with LL and JC but they just do not make such a good job of the parts as Jodie and Barbara (who seems to have disappeared from the movie scene-curse of the older actress).",
         "FREAKY FRIDAY was one of several vehicles Disney crafted for future star Jodie Foster, when the precocious teen actress was under that company's tutelage. Her adult demeanor serves her well, playing a thirteen year old inhabited by her mother's personality. The real joy in this slapsticky farce is Barbara Harris, whose brand of humor is gainfully employed as the irrepressible Annabelle, stuck in her mother's body. This and FAMILY PLOT are probably Harris' most readily available films. Too bad Harris didn't make more.",
         "It wasn't 100% perfect, but it did entertain me. I will say I also enjoyed the 2003 remake as it was fresh and funny. That said, this is definitely worth seeing. It does start off very briskly, but it loses its way just towards the end, and one or two of the gags were lacking. That said, the script does have its humorous and touching parts, the film is nice to watch visually with nice cinematography, scenery and costumes, the music was nice and upbeat and the premise intrigued me. The direction was also assured, but what made the film was the two sterling lead performances of Barbara Harris and especially Jodie Foster as the mother and daughter who swap bodies for a day. The supporting performances while not as effervescent were also effective. Overall, I liked it, it wasn't perfect, but there are certainly worse movies out there. 7/10 Bethany Cox",
         "Freaky Friday brings us to the home of John Astin and Barbara Harris with their children Jodie Foster and Sparky Marcus. Harris and Foster are constantly fighting, Foster is going through teen angst saying Mom doesn't understand her, Harris's life is not being made easy by having her first child going through the teen years. But on a fateful day where legend has it strange things do occur, one morning as the family is starting their day, the souls of Harris and Foster exchange bodies. After a lot of yelling and screaming the two decide to live each other's day as their new outward appearance dictates. The responsibilities of adulthood thrown on Foster's shoulders just overwhelm her. As for Harris it's not easy being a teen. It all adds up to some pretty funny moments. Best being Foster/Harris making a botch of a field hockey match and Harris/Foster on water skis. I've always liked the way the Disney Studio always gave a lot of old time players the character roles that they used to get in the old days. In particular here is Patsy Kelly in one of her last appearances as a maid who liked a cocktail every now and then. Freaky Friday proved to be one of the Magic Kingdom's most popular products. The recent remake with Lindsay Lohan and Jamie Lee Curtis was as fresh as the original, though that one offered some kind of explanation for the strange occurrence. This version just let the magic speak for itself."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Schoolgirl Annabel is hassled by her mother, and Mrs. Andrews is annoyed with her daughter, Annabel. They both think that the other has an easy life. On a normal Friday morning, both complain about each other and wish they could have the easy life of their daughter/mother for just one day and their wishes come true as a bit of magic puts Annabel in Mrs. Andrews' body and vice versa. They both have a Freaky Friday.",
         "The teenager Annabel has friction with her mother Mrs. Andrews and her younger brother Ben. One Friday morning, the both wish to be the other for one day at the same time and their wishes come true and they swap bodies. Meanwhike, Mr. Andrews, who is the PR of a company, is preparing a party to promote a real estate, and he counts on the support of his wife and daughter. Along the day, Annabel and Mrs. Andrews learn the difficulties of each other and understand the difficulties of the other.",
         "A mother and daughter find their personalities switched and have to live each other's lives on one strange Friday."
      ],
      "budget": 0
   },
   "movielensId": 2014,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1976-12-17",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Gary Nelson"],
      "runtime": 95,
      "movieId": 2014,
      "title": "Freaky Friday",
      "mpaa": "G",
      "actors": [
         "Jodie Foster",
         "Barbara Harris",
         "John Astin",
         "Patsy Kelly",
         "Dick Van Patten",
         "Vicki Schreck",
         "Sorrell Booke",
         "Alan Oppenheimer",
         "Ruth Buzzi",
         "Kaye Ballard",
         "Marc McClure",
         "Marie Windsor",
         "Sparky Marcus",
         "Brooke Mills",
         "Karen Smith",
         "Al Molinaro",
         "Charlene Tilton",
         "Fritz Feld"
      ],
      "imdbMovieId": "0076054",
      "originalTitle": "Freaky Friday",
      "genres": [
         "Fantasy",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "School girl Annabel is hassled by her mother, and Mrs. Andrews is annoyed with her daughter, Annabel. They both think that the other has an easy life. On a normal Friday morning, both complain about each other and wish they could have the easy life of their daughter/mother for just one day and their wishes come true as a bit of magic puts Annabel in Mrs. Andrews' body and vice versa. They both have a Freaky Friday.",
      "tmdbMovieId": 16084,
      "avgRating": 3.06553,
      "releaseYear": "1976",
      "numRatings": 2167,
      "posterPath": "/flADh6Vw4I2rAwr5LF3isAO9wFN.jpg"
   }
}