{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "kids and family",
         "id": 9963
      }],
      "imdb_id": "tt0054649",
      "video": false,
      "title": "Babes in Toyland",
      "recommendations": [
         7234,
         7237,
         61855,
         128780,
         42699,
         108181,
         20551,
         36759,
         29419,
         6980,
         118641,
         33838,
         36523,
         56147,
         76212,
         52745,
         40454,
         47003,
         22779,
         19893
      ],
      "backdrop_path": "/7dgepMxDid4E1wXgAJsV2zW2Kvw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary Contrary",
               "gender": 1,
               "credit_id": "52fe44dd9251416c9101f74b",
               "name": "Annette Funicello",
               "profile_path": "/6nqrBDFDvjpVdrZS1RjfX9rTJ7S.jpg",
               "id": 82777,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Barnaby",
               "gender": 0,
               "credit_id": "52fe44dd9251416c9101f74f",
               "name": "Ray Bolger",
               "profile_path": "/wTSd4hMEVZpBwhLuM5Jd83XiBwb.jpg",
               "id": 9068,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tom Piper",
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f753",
               "name": "Tommy Sands",
               "profile_path": "/i8gZmGv1Iptjve4LwdgMJ0Dwioa.jpg",
               "id": 23086,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Toymaker",
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f757",
               "name": "Ed Wynn",
               "profile_path": "/rdFZ6qgbqAof6QlUn6Yi146kvVS.jpg",
               "id": 5833,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Villager",
               "gender": 1,
               "credit_id": "52fe44dd9251416c9101f79d",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Grumio",
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f7a1",
               "name": "Tommy Kirk",
               "profile_path": "/30E79Tjibru53EWmXNmAddZSKlx.jpg",
               "id": 83130,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Boy Blue",
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f7a5",
               "name": "Kevin Corcoran",
               "profile_path": "/3RLdYK6I0JNqDf5FtAG4EFPzy5f.jpg",
               "id": 83131,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Gonzorgo",
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f7a9",
               "name": "Henry Calvin",
               "profile_path": "/P5z49IggXK4uer8Wdger8d8k8z.jpg",
               "id": 115546,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Roderigo",
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f7ad",
               "name": "Gene Sheldon",
               "profile_path": "/cHWrt9r503Vy4brN7wLuGvpQ22W.jpg",
               "id": 183587,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Bo Peep",
               "gender": 1,
               "credit_id": "52fe44dd9251416c9101f7b1",
               "name": "Ann Jillian",
               "profile_path": "/oGo91ckWLHq5jWf3XOf43MpmayZ.jpg",
               "id": 113905,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Mother Goose",
               "gender": 1,
               "credit_id": "52fe44dd9251416c9101f7b5",
               "name": "Mary McCarty",
               "profile_path": "/2qoLxU8Mq2f5nDvOXsNzsKzMln8.jpg",
               "id": 178113,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Willie Winkie",
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f7b9",
               "name": "Brian Corcoran",
               "profile_path": null,
               "id": 195830,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f75d",
               "name": "Jack Donohue",
               "profile_path": "/ekzEQX60geCOFXmWqWk8yAvA58Z.jpg",
               "id": 109452,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dd9251416c9101f763",
               "name": "Lowell S. Hawley",
               "profile_path": null,
               "id": 83126,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dd9251416c9101f769",
               "name": "Ward Kimball",
               "profile_path": "/vWJedE2eQW8bQdzG9wggipQvG4V.jpg",
               "id": 109453,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f76f",
               "name": "Joe Rinaldi",
               "profile_path": null,
               "id": 64867,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f775",
               "name": "George Bruns",
               "profile_path": "/qH2a2m2LoLDCjpPj1h6sISFHDr0.jpg",
               "id": 57337,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f77b",
               "name": "Edward Colman",
               "profile_path": null,
               "id": 5840,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dd9251416c9101f781",
               "name": "Robert Stafford",
               "profile_path": null,
               "id": 109454,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dd9251416c9101f787",
               "name": "Bill Thomas",
               "profile_path": null,
               "id": 14493,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dd9251416c9101f78d",
               "name": "Austen Jewell",
               "profile_path": null,
               "id": 109455,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dd9251416c9101f793",
               "name": "Eustace Lycett",
               "profile_path": "/feYtHqyDtiOrxDaocoZ7XtiMb0i.jpg",
               "id": 109456,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dd9251416c9101f799",
               "name": "Robert A. Mattey",
               "profile_path": null,
               "id": 8586,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.858675,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32611,
      "vote_count": 22,
      "budget": 0,
      "overview": "All roads lead to magical, merry Toyland as Mary Contrary and Tom Piper prepare for their wedding! But villainous Barnaby wants Mary for himself, so he kidnaps Tom, setting off a series of comic chases, searches, and double-crosses! The \"March Of The Wooden Soldiers\" helps put Barnaby in his place, and ensures a \"happily ever after\" for Tom and Mary!",
      "similar": [
         8871,
         9487,
         13053,
         927,
         10137,
         13417,
         14113,
         27996,
         34560,
         36257,
         50546,
         39451,
         1885,
         26441,
         37244,
         60897,
         10122,
         16508,
         20694,
         23544
      ],
      "original_title": "Babes in Toyland",
      "runtime": 106,
      "poster_path": "/nYtN5gyJlNEqQe5wsTe1vWodPZR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1961-12-14",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack Donohue"],
      "runtime": 106,
      "synopsis": "After an introduction by Mother Goose and her pet goose Sylvester, the audience is invited to Mother Goose Village, wherein numerous characters from nursery rhymes make their homes. The village is currently celebrating the impending marriage between Mary Quite Contrary (Annette Funicello), and Tom Piper (Tommy Sands). However, high above the village, in a crooked house, lives the evil landlord of the village, named Barnaby. Barnaby is privy to the fact that upon being wed, Mary will inherit money, and as such, he intents to marry her to get to it. To do so, he recruits two men named Gonzorgo and Rodrigo, to kidnap Tom and throw him in the sea. As well, the sheep tended by Little Bo Peep (who lives with Mary, along with Little Boy Blue, Wee Willie Winkie, and two twin girls) must be stolen too, as they provide a source of income for the small family. After Tom leaves Mary for the evening, the two men knock him out, and tie him in a sack. However, on their way to the sea, they come to a fork in the road, that tellsof a gypsy camp nearby. Gonzorgo gets the idea to sell Tom to the gypsies, and then lie to Barnaby that they've completed their deed, thereby collecting twice! The next day, Barnaby intrudes on Mary's wedding preparations, but the moment is spoiled when two shipwrecked sailors (Gonzorgo and Rodrigo in disguise) come to Mary's place. They explain that Tom ran away to sea, ashamed that he could not provide for her and the children she takes care of. Gonzorgo claims that a note that they found from Tom, indicates that he says she should marry Barnaby instead. Needless to say, Mary is saddened at this news, and Barnaby attempts to woo her to marry him However, she refuses, claiming she could never marry just for money alone. Taking a positive attitude, she claims that she's sure the sheep that Little Bo Peep tends will help them live well, when Bo Peep returns, claiming she's lost the sheep! The townspeople claim they'll help, but when word comes that the sheep's tracks lead to The Forest of No Return, all offers are rescinded. Mary tries to assure the children that things will be fine, but later on that evening, she has second thoughts about Barnaby's offer, and goes to his home. The children don't want Mary to be miserable, and decide to go to the forest to find the sheep themselves! After this, Gonzorgo and Rodrigo wake the village, telling that Mary has decided to marry Barnaby! Barnaby happily tells how he has hired a band of gypsies to perform, and the sleepy town is soon filled with their music. Near the end, a fortune teller comes out, and before everyone's eyes, she sheds her clothing (and makeup), and it's revealed to be Tom in disguise! Apparently, Barnaby hired the same gypsies that the two thieves had sold Tom to. Of course, Barnaby isn't happy to have been double-crossed. Mary and Tom return to Mary's house, only to find a note from the children telling where they've gone! In the Forest of No Return, the children wander into a small clearing, wherein they are menaced by a group of talking/singing trees. Luckily, Mary and Tom come to their rescue, with the trees then quieting down. The children try to convince their elders what they saw, but Mary and Tom assume they're playing a game. With it being too dark to go home, the group rests in the woods. At daybreak, the trees stir them to waken, claiming they are going to take the group to the Toymaker, as they are on the outskirts of Toyland. Needless to say, this news excites the children, and they head to the Toymaker's workshop. Inside, they find the Toymaker and his assistant Grumio, working on a way to increase toy production in time for Christmas. Grumio has created an automated machine, but when the Toymaker pushes it to super-speed, it falls apart, with the old man blaming Grumio for the machine's faults. After Grumio leaves, Tom, Mary, and the children appear, offering to help the Toymaker. At first unsure, the Toymaker grows delighted at the work ethic of the group. Eventually, it's time for bed, and the children are put to sleep. However, before Tom and Mary can do the same, Grumio rushes into the room, with a special gun, filled with red liquid. Grumio then shows the Toymaker and the others, that it can shrink items down. However, two puffs of the red liquid, will make the shrunken item disintegrate. The Toymaker thinks this is brilliant...until Tom points out that they'll need big things to be made small. Declaring his assistant's device to be ill-conceived, the Toymaker throws it out a nearby window...right into the hands of Barnaby, who has overheard everything about what the gun does! Barnaby then shrinks down the Toymaker, before doing the same to Gonzorgo and Rodgrigo (as they have decided to defect from him). Finally, Barnaby shrinks Tom, and forces Mary to marry him, on condition that he'll make Tom disintegrate with an additional blast from the gun. The Toymaker (being also the Mayor and Chief of Police of Toyland), is forced to marry the two. However, during the ceremony, Tom slips away, and going to the workshop, frees numerous toy soldiers from their boxes. Leading a charge into the next room, the soldiers then assault Barnaby. Barnaby almost has the upper hand, until the vial holding the red liquid in the gun breaks, and splatters on him, shrinking him down. Tom and Barnaby then face off, before Tom knocks the evil man into a box. Shortly after this, Grumio appears, having made a green-colored antidote. With it, he restores the Toymaker, Gonzorgo, Rodrigo, and Tom, to proper size. The people then return to the village, where Tom and Mary are wed, before driving off in a horse-driven sleigh, as their friends wave goodbye.",
      "writers": [
         "Glen MacDonough",
         "Ward Kimball"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0054649/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2MDc3ODgyMl5BMl5BanBnXkFtZTcwNjk3MjYxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ray Bolger, Tommy Sands, Annette Funicello | See full cast and crew »"],
      "reviews": [
         "You know, this is one of those grossly underrated, wonderful treasures of a movie. It's rather simple, with the fanciest effects being the movement of the toy soldiers, which was ahead of its time, but it's a true case of simple is beautiful. It's a fantastic movie for those who just wish to sit back, and laugh with the family, and have an adventure in fantasy land. The play is still being put on around the world, and this, to me, is just the best captured version. There's really something for everyone - Ray Bolger ( who looked really spectacular, very handsome in his role as Barnaby), Annette (who is always charming for being the sweetheart we all know), Tommy Sands as the daring hero, and the team of Henrey Calvin and Gene Sheldon, along with the forever amusing Ed Wynn. This movie turns out more of a comedy, and the adventures that encompass Mary and Tom Piper, when crossed by Barnaby, double crossed by Gonzorgo and Rodrigo are hilarious. This is primarily a Christmas movie, but it's set so you can watch it anytime of the year - and so you should! I still cannot get over Ray bolger as a villian....he does a lovely job, and looks terrific, but if you only know him as the scarecrow, you'll especially need to see this! He makes the statement relavent that he is very, very, very versatile, and one of our greatest entertainment treasures.",
         "This is a film that cries out to be seen on the big screen. As a child, I saw this in the theater, and the color just dripped off the screen. With the magnificent soundtrack and wonderful special effects, it was a special event. However, on the small screen it does lose something of its effect, but it's still a good movie. The scene where TomTom has been shrunk, and takes his revenge on Barnaby by losing the wooden soldiers on him still gives me goosebumps. Probably better for younger children, I still wouldn't miss this film.",
         "I would go to the ends of the Earth for Annette Funicello, but this is one of her weaker efforts for Walt Disney. Mary Contrary hopes to get married, but her wedding plans are thwarted by an evil villain. Most of the production and the special effects in the finale are very good, and the adaptation of the operetta score is fine, but the balky direction has no pizazz, and it's precisely this clunky, one-dimensional handling which eventually sinks the film (much better is a Disney short entitled \"Back Stage Party\", also available on DVD, where Walt Disney and Annette tour the sets used in the film). There's nothing really happening in \"Babes In Toyland\", beyond the fact it has a distinct case of \"Wizard Of Oz\"-itis. The scowling children chatter in unison, Tommy Sands is excruciatingly hammy in drag as an old gypsy woman, and the Laurel & Hardy-inspired slapstick routines feel out of place. It's a misfire, yet on the other hand it IS better than \"The Shaggy Dog\". ** from ****",
         "I can remember watching this movie over and over when I was little-- of course, as the years went by I eventually taped over it. Well, when I finally grew out of my \"I'm too cool for this movie\" phase, I regretted my hasty decision. Luckily, last night it was on in the middle of the night on the Disney Channel and I practically programmed the VCR with lightening speed. I still love it, and I always associate certain scenes with certain memories, and now that I'm older I understand what is going on a little bit better (not to mention some of the jokes that flew right over my head when I was four!)! If you don't watch it for yourself, you're kids'll love it. Believe me, I know!",
         "It was sixty years since Victor Herbert and Glen MacDonough's magical musical for kids premiered on Broadway when this version came out and now it's nearly 50 years since the film was in theaters. It doesn't rank up with the one that Laurel&Hardy did in the Thirties. For one thing the Victor Herbert score was cut, but not added to. Secondly Stan and Ollie were the center of things even though they are supporting characters. That in itself made their March Of The Wooden Soldiers memorable. Still this version that Disney did featured several of his stable of young stars like Annette Funicello and Tommy Sands as the young lovers of Toyland who want to wed. But evil Barnaby reprised in this version by Ray Bolger is going to put a stop to that. He's got designs on Annette's virtue and more important on the inheritance he knows she will get upon her wedding day. Bolger is having a great old time hamming it up as Barnaby. Stan and Ollie are saluted by Disney with Gene Sheldon and Henry Calvin, fresh from the Zorro series. They're funny, but are clearly relegated to supporting players as Bolger's inept stooges. As Stan Laurel was still alive when Babes In Toyland was in the theaters, I've often wondered what he thought of Sheldon and Calvin. Tommy Kirk who was barely out of his teens got a real treat to work with one of the great funny men of all time. Babes In Toyland is a great example for those of us to see the zany humor in the character of Ed Wynn as the Toymaker with Kirk as his assistant. The two of them work very well together. Even Tommy Sands gets into the humor of things when he dons an outrageous gypsy drag persona to foil one of Bolger's schemes. A scheme that goes awry when Calvin and Sheldon don't precisely obey orders. You just can't get good help, even in Toyland. I even think Victor Herbert would have approved of the way his numbers were done though he probably would not like the Disney interpolations that were made. He was a stickler for such things in his life. Viewing March Of The Wooden Soldiers back to back with Babes In Toyland doesn't make this version look inferior by any means.",
         "It's a 1960s Disney Musical, I should not have to say more than this about the movie. It's great for kids, unfortunately. I remember seeing it, and liking it as a kid - and got it for my 3 yr old daughter. My wife hates me for it. Not that the movie is that horrible - but my daughter is in love with Tommy Sands and wants to watch this movie every night. My wife even took my daughter to the library and checked out kids movies - she was excited until she got home, and just said she wanted to watch Tom and Mary (The names of the main actors in the movie) If you have little kids - they'll love it. You might even enjoy it some yourself - until it's overplayed.",
         "Has there ever been a film in which you want the villain to win? Did you ever want to see the Wicked Witch of the West get her hands on those ruby slippers and shove Dorothy inside the crystal ball so she would be forced to watch the witch tap dance for eternity? Did you want the Baroness in \"The Sound of Music\" to throw Maria back to the convent and marry Captain Von Trapp? Well, put yourself through nearly two hours of torture with this second film version of the 1903 Victor Herbert operetta and see if you can escape it without hoping that Barnaby wins, forcing Annette Funnicello's Mary to marry him, then teach her some acting lessons before realizing his mistake and sending her back to Tommy Sands. Decently made in 1934 by MGM, this color version of the operetta is about as fun as a dental visit. Overly sweet and gooey, this is as nauseatingly irritating as Disney films could get. Even in their later musicals, there was an adult element that older audiences could enjoy, and by modern standards, I don't even think pre-teens could get into this film without praying for a dental emergency to take them away from it. From the moment that Mother Goose comes out with her introduction, you want to see her plucked, stuffed and cooked, and with one of the most obnoxious production numbers to open a musical, if your kids don't look at you and say, \"What is this crap?\", they deserve all the sweets they can handle to try and get through the rest of it. While there are some magical moments (\"The Forest of No Return\", \"March of the Wooden Soldiers\"), they are few and far between and surrounded in molasses and honey that can make the most innocent of movie viewers cringe. Henry Calvin and Gene Sheldon are a poor imitation of Laurel and Hardy, their comic relief dated vaudeville schtick, even by 1960's standards, especially with the banal \"Slowly He Sank To The Bottom of the Sea\". Ed Wynn does provide some amusement as the toymaker, but it is Ray Bolger's mustache twirling \"Snidely Whiplash\" style villain that seems to be having the most fun. Bolger shows off his dancing talents which were still energetic more than 20 years after \"The Wizard of Oz\", giving spark to \"Castle in Spain\". A young Ann Jillian is a vibrant force as Bo Peep, but I much prefer her in sultry roles like Mae West. \"Babes in Toyland\" does not seem like the type of show that can be revived, and even by 1960's standards, it seems that 50+ year old songs like \"I Can't Do The Sum\" and \"Go To Sleep\" were best left in the old trunks of old songs that express one era but are better left unexpressed in others. Sometimes the overly cuteness of Disney films just seemed out of step with the turbulent 1960's even if they were also delivering a lot of magic to children of that era like me with classics like \"Mary Poppins\" and \"Bedknobs and Broomsticks\".",
         "This film is one of my favorite Disney live-action musicals, and a wonderful Christmas film too. It use to be on TV when I was a kid...but not anymore. I was fortunate to buy it on DVD though. The film is also based on an operetta by Victor Herbert, with new lyrics by Mel Leven and of course I thought it's a great soundtrack. In the film, Annette Funicello plays Mary Quite-Contrary and Tommy Sands plays Mary's fiancée Tom Piper, the Piper's son. As Mary and Tom's wedding approaches, evil schemer Barnaby (The Wizard of OZ's Ray Bolger) hatches a plot to drown Tom, and steal Mary's sheep in an effort to get her to marry him...for the money she will inherit. But unfortunately for Barnaby, the two henchmen he had order to kill Tom, kidnap him instead and sell him to a band of gypsies...for more money of course, since they're being payed by Barnaby to get rid of Tom. But when Mary discovers Tom is alive, the couple had a happy reunion. But when the two went back to Mary's cottage, the children in Marys' care, Wee Willie Winkie, Little Boy Blue and Little Bo Peep had gone to look for the sheep in the Forest of No Return. The two found the children, but they spend the night in the forest. In the morning, the band were \"captured\" by the trees of the forest and escorted to Toyland to see the Toymaker. That's all I could tell you folks, you will have to see the film for yourself how it ends. Overall, this film's a wonderful Disney production...too bad it had a disappointing box office performance.",
         "i love this movie and it's a terrific classic, all the movie characters are mother goose characters living in a town with such houses as the giant shoe and the pumpkin house. Little bo peep lost her sheep in the forest of no return causing mary contrary and tom piper to follow the kids after them when they attempt to locate the lost animals...instead they stumble upon the lost toyland and get pulled into a world of mishaps including a shrinking invention gone wrong, making tom piper no more than a few inches tall....also there are wonderful songs and dance scenes including a gypsie dance and beautiful serenades by the classic annette funicello...a must see kid classic!",
         "Walt Disney had great hopes for \"Babes In Toyland\", releasing it during the lucrative Christmas holiday season. But the critical reaction was just so-so, and the box office take, while not disastrous, was disappointing. Watching the movie today, it's pretty easy to figure out why there wasn't much enthusiasm for the movie. Its biggest flaw is that there is almost nothing done to make the main characters of Tom and Mary into REAL characters - we learn next to nothing about them, and Tommy Sands and Annette Funicello give performances that show their helplessness with their thin characters. Somewhat better is the character of Barnaby - he's given a lot of screen time and Ray Bolger gives a decent performance. Bolger gives some spark in his scenes, but additional problems with the movie defeat his enthusiasm. The songs, while not awful, are extremely unmemorable. Most of the sets come across as extremely stagebound and theatrical and feel phony. Is there anything else in this movie that might attract some viewers? Well, Ed Wynn fans might be charmed by his scenes as the toymaker. And the climax does have some stop-motion animation that might interest fans of the medium. But even these people might turn off their televisions before these moments come because the movie is for the most part so bland. I think even kids will be bored."
      ],
      "genres": [
         "Family",
         "Musical",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["Tom the Piper's Son is about to marry Mary Quite Contrary. On the eve of their wedding, evil miser Barnaby hires two henchmen to drown Tom and steal Mary's sheep, cared for by Little Bo Peep, thus depriving Mary and the children she lives with of their livelihood, forcing her to marry Barnaby. The sheep are stolen, but Gonzorgo and Roderigo, Barnaby's henchmen, double-cross him by selling Tom to a band of gypsies instead, leaving Tom with the opportunity to escape and make his way with Mary, Bo-Peep, and other Mother Goose characters to Toyland."],
      "budget": 0
   },
   "movielensId": 2017,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1961-12-14",
      "dvdReleaseDate": "2002-09-03",
      "directors": [
         "Jack Donohue",
         "Austen Jewell"
      ],
      "runtime": 106,
      "movieId": 2017,
      "title": "Babes in Toyland",
      "mpaa": "G",
      "actors": [
         "Annette Funicello",
         "Ray Bolger",
         "Tommy Sands",
         "Ed Wynn",
         "Bess Flowers",
         "Tommy Kirk",
         "Kevin Corcoran",
         "Henry Calvin",
         "Gene Sheldon",
         "Ann Jillian",
         "Mary McCarty",
         "Brian Corcoran"
      ],
      "imdbMovieId": "0054649",
      "originalTitle": "Babes in Toyland",
      "genres": [
         "Comedy",
         "Fantasy",
         "Family",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "All roads lead to magical, merry Toyland as Mary Contrary and Tom Piper prepare for their wedding! But villainous Barnaby wants Mary for himself, so he kidnaps Tom, setting off a series of comic chases, searches, and double-crosses! The \"March Of The Wooden Soldiers\" helps put Barnaby in his place, and ensures a \"happily ever after\" for Tom and Mary!",
      "tmdbMovieId": 32611,
      "avgRating": 2.96412,
      "releaseYear": "1961",
      "numRatings": 1059,
      "posterPath": "/nYtN5gyJlNEqQe5wsTe1vWodPZR.jpg"
   }
}