{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mentor",
            "id": 1310
         },
         {
            "name": "poet",
            "id": 5933
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0114702",
      "video": false,
      "title": "Total Eclipse",
      "recommendations": [
         9819,
         37857,
         10474,
         342,
         70356,
         8092,
         63607,
         73994,
         61072,
         49455,
         144994,
         110083,
         65016,
         148905,
         28526,
         69054,
         175341,
         71592,
         56927,
         246005
      ],
      "backdrop_path": "/5XMmpliJtfFoSDX0nnutbV4gBuU.jpg",
      "revenue": 339889,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Arthur Rimbaud",
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b09",
               "name": "Leonardo DiCaprio",
               "profile_path": "/A85WIRIKVsD2DeUSc8wQ4fOKc4e.jpg",
               "id": 6193,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Paul Verlaine",
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b13",
               "name": "David Thewlis",
               "profile_path": "/lWCGcTKvr4QUi8MvFBleMw8xY8.jpg",
               "id": 11207,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Mathilde Maute",
               "gender": 1,
               "credit_id": "52fe460f9251416c91047b47",
               "name": "Romane Bohringer",
               "profile_path": "/keVDM0uUbKmo0yOVNrjMuKiH1B2.jpg",
               "id": 40938,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Isabelle Rimbaud",
               "gender": 1,
               "credit_id": "52fe460f9251416c91047b4b",
               "name": "Dominique Blanc",
               "profile_path": "/l52O3muXMMlUQMgY27o8vgUmTcq.jpg",
               "id": 19068,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Rimbaud's Mother",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b4f",
               "name": "Nita Klein",
               "profile_path": null,
               "id": 150916,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Isabelle, as a child",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b53",
               "name": "Felicie Pasotti Cabarbaye",
               "profile_path": null,
               "id": 1163055,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Frederic",
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b57",
               "name": "James Thiérrée",
               "profile_path": "/yFRYfPNxjKv2Wyuuo2FqAhnCaLv.jpg",
               "id": 46274,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Vitalie",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b5b",
               "name": "Emmanuelle Oppo",
               "profile_path": null,
               "id": 1163056,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "The Judge",
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b5f",
               "name": "Christopher Hampton",
               "profile_path": "/7L7S5KHE21jFGL2IS1VXqQJxx9R.jpg",
               "id": 12952,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Mrs. Maute De Fleurville",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b63",
               "name": "Denise Chalem",
               "profile_path": "/AkML9VI9Ztc2AXdICoXnCVZB2ix.jpg",
               "id": 146375,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Mr. Maute De Fleurville",
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b67",
               "name": "Andrzej Seweryn",
               "profile_path": "/cv5QWhXGPhWdFYsGOtg3856uNYJ.jpg",
               "id": 2829,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Carjat",
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b6b",
               "name": "Christopher Thompson",
               "profile_path": "/waz8EXJ8xVMa97XnSAh6KxFEvU8.jpg",
               "id": 35530,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Aicard",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b6f",
               "name": "Bruce Van Barthold",
               "profile_path": null,
               "id": 1163057,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Charles Cros",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b73",
               "name": "Christopher Chaplin",
               "profile_path": null,
               "id": 1163058,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "André",
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b77",
               "name": "Mathias Jung",
               "profile_path": null,
               "id": 309816,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Somalian Woman",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b7b",
               "name": "Kettly Noel",
               "profile_path": null,
               "id": 1163059,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "Djami",
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b7f",
               "name": "Cheb Han",
               "profile_path": null,
               "id": 1163060,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe460f9251416c91047b0f",
               "name": "Agnieszka Holland",
               "profile_path": "/t7OOYOMIre88LLiWYepg8XnF9FD.jpg",
               "id": 1128,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b19",
               "name": "Christopher Hampton",
               "profile_path": "/7L7S5KHE21jFGL2IS1VXqQJxx9R.jpg",
               "id": 12952,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b1f",
               "name": "Jan A.P. Kaczmarek",
               "profile_path": "/4ozuUr7gySorz5ynJFnelr3SNvv.jpg",
               "id": 22680,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b25",
               "name": "Giorgos Arvanitis",
               "profile_path": null,
               "id": 20572,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b2b",
               "name": "Jean-Pierre Ramsay-Levi",
               "profile_path": null,
               "id": 1163054,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe460f9251416c91047b31",
               "name": "Isabelle Lorente",
               "profile_path": null,
               "id": 56532,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b37",
               "name": "Dan Weil",
               "profile_path": null,
               "id": 1000,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe460f9251416c91047b3d",
               "name": "Pierre-Yves Gayraud",
               "profile_path": null,
               "id": 17063,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe460f9251416c91047b43",
               "name": "Margot Capelier",
               "profile_path": null,
               "id": 10471,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.42083,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 36834,
      "vote_count": 149,
      "budget": 0,
      "overview": "Young, wild poet Arthur Rimbaud and his mentor Paul Verlaine engage in a fierce, forbidden romance while feeling the effects of a hellish artistic lifestyle.",
      "similar": [
         258480,
         370663,
         244772,
         401898,
         12793,
         858,
         141,
         634,
         242224,
         112160,
         376867,
         11421,
         43923,
         513,
         11634,
         437557,
         297762,
         300667,
         455661,
         27586
      ],
      "original_title": "Total Eclipse",
      "runtime": 111,
      "poster_path": "/BTGFfPHySJtw2qBoLysz3ercDB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "FIT Productions",
            "id": 16026,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Portman Productions",
            "id": 16027,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Société Française de Production (SFP)",
            "id": 6849,
            "origin_country": ""
         }
      ],
      "release_date": "1995-11-02",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Touched by Genius. Cursed by Madness. Blinded by Love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Agnieszka Holland"],
      "runtime": 111,
      "synopsis": null,
      "writers": ["Christopher Hampton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114702/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyMTY0NDM2N15BMl5BanBnXkFtZTcwMjMzNDYxMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Leonardo DiCaprio, David Thewlis, Romane Bohringer | See full cast and crew »"],
      "reviews": [
         "It's a good thing not too many people saw this film when it came out [no pun intended], because, if any of DiCaprio's female fans had seen him in this, one of his best early roles, his career would have been over well before he was involved in \"Titanic.\" And that's because he's so utterly convincing as the tortured, bisexual teen genius poet Arthur Rimbaud, that it would undoubtedly set many of those young ladies to wondering if he'd played the part a little TOO well, if you get my meaning. If ever there was any such thing as a male femme fatale, It's Leo right here. Rumor has it that he tried to have the video pulled a few years ago, right after his \"Titanic\" success. It's a good thing he wasn't successful, because I think that this film rates right along with \"The Basketball Diaries\" as possibly his best performance. But it takes two to tango, at least in this case, and David Thewlis is almost as good opposite DiCaprio as Paul Verlaine, who began as Rimbaud's mentor and wound up as his long-time lover. As Verlaine was ugly and overweight, whereas Rimbaud was lithe and handsome, the two seemingly would have made an unbelieveably odd couple physically, but were drawn together more by their mutual likes and dislikes rather than physical attraction. And that's what you sense through all of their scenes together, a meeting of minds more than a meeting of bodies. There were many who praised this movie, there were many who hated it, but love it or hate it, it holds a strange fascination which makes you remember it long after you've seen it.",
         "This movie is not for the faint of heart or the conventional taste. It's not a fantasy. Like the real-life characters upon which the movie is based, TE is eccentric and poetical. French poet Rimbaud, who wrote almost everything he wrote as a teenager, has been admired by some of the most eccentric creative people of the last century. He was a very unusual teenager, being some kind of genius, some kind of lowlife, and a runaway. His poetry digs into and portrays life with discomforting and sometimes painful and sometimes ecstatic detail. His is the muse which revels in the squalor of creation. Many people will dislike this film because the two main characters, Rimbaud and Verlaine, are bisexual and not at all stereotypical. Both of them are snotty and selfish and violent and often despicable. (As Shakespeare probably was at times, but you'll never see him portrayed in movies that way.) These are not Robert Frost poets. These are worm and scat and sex and drug and rock'n'roll and get-down-and-get-dirty poets. Past that, it's the story of a great, if brief, flowering love ... the kind of love story you'd expect for people who live and breathe life in the way great alternaculture poets must. Eternity is where the sunlight mixes with the water. And the penetrating movie mixes with the prepared mind.",
         "This art-house film is not a crowd-pleaser but is nevertheless an excellent film. It is one of DiCaprio's best independent films before he became a titanic superstar. Rimbaud\"s painfully self-destructive bisexual life and his affair with Verlaine is not a \"nice\" story to tell, but the drama is interesting as a study in the eccentric mind of the artist. Beneath the plot is the age-old question of whether the artist's oddness hinders his creativity or is actually the fuel for his art.",
         "I realized going into this film that it was not going to be a straight bio-pic about Rimbaud's life so that loosened my expectations for the movie a bit, which is good considering had I expected a life story I would've been sorely disappointed. This film is more about Rimbaud's rocky relationship with fellow poet, Verlaine, whom he falls in love with and subsequently about Verlaine being stuck between a rock and a hard place with Rimbaud on one side and his beautiful but ultimately empty headed wife, Mathilde on the other. The set/costume design was done well enough; not enough to win awards but enough to make the time and place believable. What stands out the most, though, is the acting and of course the wonderful violin heavy score. DiCaprio gives an inspired performance as the young, opinionated, Rimbaud as does Thewlis in his role as the older poet, Verlaine who takes him under his wing. You won't get a complete round view of either man or his life here, but what you will get is a story about love, madness, writing and the search for meaning. If you like what you see of Rimbaud from this movie, I would whole heartedly recommend his work to you and any and all written biographies as they will shed even more light on a truly great poet's life.",
         "Of course there is pain and monstrosity in love. Two wild poets would need to live that out. But can a movie about it make any sense, without a fair portion of their poetry? Michelangelo said that painting excels when it approaches sculpture, and sculpture when it comes close to relief. An art form is enhanced when nearing its periphery, almost turning into another art form. Along this line, I am sure that the poetry of Rimbaud and Verlaine would have stood forward excellently, when recited in the movie about their relation. It would also have helped in making their interactions understandable. After seeing the movie a second time, I read some of Rimbaud's writings, and there was a slightly different character emerging from his words, than the one portrayed, though excellently, by Leonardo DiCaprio. Rimbaud's own words show that he was a victim just as much as a predator. Of course, he would say so, himself, but also: this modification would have made the movie rise beyond the black and white polarity it is too often caught in. Still, I enjoyed the movie tremendously, mostly thanks to Leo and the way he made his character fire up. He might have been type-cast, to do the obnoxious adolescent, but they got more than they bargained for - he included the most important aspect of Rimbaud: the prodigy poet, the artist living for art, loving for art. His acting is sometimes stunning, and not only in delicate scenes where minute nuances are essential, but also in all kinds of silliness in between. To hear him bark like a dog, really like a dog - did he do that himself, or was there an added sound effect? The pause, and the slightly humorous expression on his face, right before he tells his fellow poet that he expects more from him than his words. His posture and cocky moving about in the Paris of the noble poets, and his running on all four in the countryside. Brilliant acting. There's a lot of formidable acting also on behalf of the others in the cast, even when the script and the direction works against them. And it does, more than once. Maybe the plot got all confused, simply because the poetry of the poets was not taken into account. But a film gone awry can still be a wonderful experience. Frustrating, but wonderful. This one is.",
         "There will be those who watch this film for DiCaprio, which is fine, then there will be those who watch this for the fact that it's about a French Poet, Rimbaud. The former is most likely the more probable, unfortunately, thus the rating of 5.7 at the time I'm writing this review, 4, September, 2004. Rimbaud was a poet who came to fame early on. Born in 1854, Jean-Nicolas-Arthur Rimbaud was one of four other siblings, a brother and three sisters, however, two of the three sisters passed. By fourteen, he was \"winning nearly every academic competition he entered and by fifteen, had his first poem published in a literary review\" (Mason, 2003). The police took interest in him as he was a trouble maker. Some of his more famous writings, \"A Season in Hell,\" \"A Drunken Boat,\" and \"First Night,\" are what he accomplished before giving up on writing at an equally young age, eighteen! Because he was so young, and maintained such excellence, he's been likened to similar prodigies such as Mozart, and Picasso. His is a work of certain genius which we can peer into - via this short dramatic biography - if we allow ourselves to pay close enough attention. I recommend this movie to any scholar, anyone interested in poetry/writing, anyone interested in prodigies, artists (or their madd, sometimes megalomania temperament), or depressives. Overall, it was good, it sparked remembrances of Robin Williams in \"Dead Poet's Society\" (1989), Gwyneth Paltrow in \"Sylvia\" (2003), and Sean Connery in \"Finding Forrester\" (2000). All are great writing flicks about love, loss, overcoming the human condition, or being ruined by it.",
         "First off, this movie definitely deserves it's 'R' rating. So if you're a young Leo fan, don't bother. You're too young to see it and far too young to understand it. Onto the review. I was deeply moved by this movie. I thought Leo DiCaprio (who I usually despise) was excellent in his role. He played the part of bisexual Arthur Rimbaud very well. Very believable. David Thewlis' role was also very well acted (and quite impressive) as Paul Verlaine. Most have said it's not an accurate portrayal of what really went on....well that's what the disclaimer on the beginning of the movie states. If you missed it, don't complain. Basically, it will move you (unless you have no emotion at all), make you think, and perhaps shock you a bit (mainly Paul's behavior toward his wife was a bit shocking). But it is a beautifully artistic film and I urge fans of this genre to experience it.",
         "\"Total Eclipses\" narrates the romance that is born among the poets Paul Verlaine (David Thewlis, in a courageous and excellent performance, Thewlis plays strong scenes with experience and professionalism) and Arthur Rimbaud (Leonardo Di Caprio, before being thrown to the Hollywood's stardom in \"Titanic\"). The film documents, without make-ups,Paul Verlaine's slow destruction,a man who is consumed by the love and hate that he fells for Rimbauld.Director Agniezka Holland accomplished a touching and beautiful work,counting with a perfect plasticity that reconstitutes the time and the romance among the two men in a detailed way and without shame, what can,in fact,shock Di Caprio's fans in some delicate moments.Even being a little slow in a lot of parts of the story, \"Total Eclipse\" is efficient when its seen as a drama that lectures about the difficulty of being homosexual, but besides this topic, it analyzes what happens when people abdicate of their happiness and suffer due to social conventions, and finally it ends up in a intelligent conclusion:that only through the courage and through the love it's possible not only to break such barriers but also to achieve redemption.Director Agnieszka Holland conducts with experience a story that, in the hands of another director, could be reduced into a common and not very innovative denominator, and the lenses of her camera shows, without make-ups and courts to alleviate the impact of the scenes, the whole suffering, the prejudice and the pain that marks the relationship between Rimbaud and Verlaine. The two poets' love is realistically developed by Holland, starting by the friendship, in which the two writers begin to know important things about theirselves and discover that they have a lot in common, in terms that both are unhappy with the path their lives acquired, the doubts, the fears and the frustrations,till the beginning of the romance. The scene in which the first kiss happens, when Rimbauld seduces Verlaine and tries to get closer to him and ease his nervousness,is strong,touching and beautiful,this decisive and provocative part is filmed and written in a sweet and human way. The focus that the production gives to the story, therefore,is natural and realistic, what can scare many people away of the box- offices for the context declaredly homosexual of the story.\"Total Eclipse\" explores and studies the relationship without making concessions and without allowing any demagogy or fear. There are rough scenes such as the one in which Thewlis is tirelessly sodomized by Di Caprio, there are moments of fondness when the two kiss each other,but in the same way the sick and morbid aspect of the relationship is expressed, when, for example, Rimbauld stabs Rimbaud's hand to prove his love.Being a heterosexual, i concluded that, instead of adopting a dogmatic and racist posture, it would be better if i could appreciate the film not as just another plot about two gay guys who are in love but I tried to enlarge my point of view, understanding that the film was, actually, a simple feeble love history marked by the suffering and resignation. Thus, I recommend \"Total Eclipse\" as an intelligent and efficient drama, a work that deserves to be applauded by its initiative and courage, for the excellent performances and for the safe and kind work by Agnieszka Holland, who tells a love story in a distressing and realist form. \"Total Eclipses\" i rated for strong sexuality and nudity, language, and some startling violence and it runs 111 minutes.The Cast: David Thewlis, Romane Bohringer and Leonardo Di Caprio.",
         "I saw this movies many years ago long before Leonardo was a superstar as he is today and was riveted to the screen by the depth of his performance. The length to which he commented himself to this character was Oscar worthy, to say the least. I was so taken, I immediately preordered it to own and add to my collection. As I have watched it repeatedly over the years, my original assessment remains the same...a 10 plus! I am in shock that neither Leonardo nor the film industry has not made mention of this film when listing or crediting his fabulous and diverse character choices during his career. In my opinion, his work in this film is far and away better than even the Titanic. He really seemed to grasp every aspect of this tormented genius character which had far more depth than the Titanic character. I highly recommend you see and buy this movie.",
         "Genius is by nature sui generis. Most of us can only observe and wonder, and from time to time pretend we are similarly gifted. As for the actual behavior of genius, it almost always entails what is commonly known as bad manners. The other striking feature of genius, for some but not all, is what is commonly known as insanity. Although modern science has defined various types of mental disorder and found causes and cures for some of them, it really begs the question to try to judge character or morality on the basis of scientific data. Art lies after all outside the realm of science, and always will do. Having said that, I believe the film Total Eclipse must be reviewed or criticized solely on whether it is a good work of art. My opinion is that it succeeds at some levels, and fails at others. I accept that the writer and director knew exactly what they were doing at every step. Except for a few quibbles about editing, I agree that the artistic concept and the technique are first rate. The musical score is excellent. The camera angles are generally adept at conveying the actions and emotions of the cast. Outdoor scenes tend to be well conceived. Unfortunately, all that falls by the wayside because of flaws in relating the story accurately and well to its origins. Anyone familiar with the lives and work of Verlaine and Rimbaud can only cringe at the superficiality of this film. As many others have pointed out, scant attention is paid to verse, and then only in a language -- English -- that only approximates the original. It would have been a graceful beginning to make this film in France with French characters speaking French, then allowing the subtitles to fill in the gaps for non-French-speaking viewers. What that conclusion implies, of course, is that the primary cast is wrong for this film. I really hate to say that, because DiCaprio and Thewlis are great actors doing the best they can to carry the film forward. Although I would have picked a different physical specimen for the role of Verlaine (for some odd reason the face of the late German director Fassbinder comes to mind), the choice of an androgyne for Rimbaud was physically right on target. Finally, I am appalled at some of the comments here that betray a preoccupation with sex. \"Zany\" is the only word one can apply to subjective and even judgmental interpretations of this film about this or that scene or bit of action not in accord with a viewer's personal sexual expectations. My own view is that this was, if anything, a highly bowdlerized adaptation of reality. In short, recast this in French, and focus more on the full text of Rimbaud's genius."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "FIT Productions",
         "Portman Productions",
         "Société Française de Production (SFP)"
      ],
      "summaries": [
         "In 1871, Paul Verlaine (1844-1896), an established poet, invites boy genius Arthur Rimbaud (1854-1891) to live with Paul and his young pregnant wife, Mathiltde, in her father's home in Paris. Rimbaud's uncouth behavior disrupts the household as well as the insular society of French poets, but Verlaine finds the youth invigorating. Stewed in absinthe and resentment, Verlaine abuses Mathiltde; he and Rimbaud become lovers and abandon her. There are reconciliations and partings with Mathiltde and partings and reconciliations with Rimbaud, until an 1873 incident with a pistol sends one of them to prison. Codas dramatize the poets' final meeting and last illnesses.",
         "Young, wild poet Arthur Rimbaud and his mentor Paul Verlaine engage in a fierce, forbidden romance while feeling the effects of a hellish artistic lifestyle."
      ],
      "budget": 0
   },
   "movielensId": 202,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-02",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["Agnieszka Holland"],
      "runtime": 111,
      "movieId": 202,
      "title": "Total Eclipse",
      "mpaa": "R",
      "actors": [
         "Leonardo DiCaprio",
         "David Thewlis",
         "Romane Bohringer",
         "Dominique Blanc",
         "Nita Klein",
         "Felicie Pasotti Cabarbaye",
         "James Thiérrée",
         "Emmanuelle Oppo",
         "Christopher Hampton",
         "Denise Chalem",
         "Andrzej Seweryn",
         "Christopher Thompson",
         "Bruce Van Barthold",
         "Christopher Chaplin",
         "Mathias Jung",
         "Kettly Noel",
         "Cheb Han"
      ],
      "imdbMovieId": "0114702",
      "originalTitle": "Total Eclipse",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["8eZpsPixVuU"],
      "plotSummary": "Young, wild poet Arthur Rimbaud and his mentor Paul Verlaine engage in a fierce, forbidden romance while feeling the effects of a hellish artistic lifestyle.",
      "tmdbMovieId": 36834,
      "avgRating": 3.04946,
      "releaseYear": "1995",
      "numRatings": 465,
      "posterPath": "/BTGFfPHySJtw2qBoLysz3ercDB.jpg"
   }
}