{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "gay relationship",
            "id": 10198
         }
      ],
      "imdb_id": "tt0137386",
      "video": false,
      "title": "Billy's Hollywood Screen Kiss",
      "recommendations": [
         73252,
         41922,
         79908,
         9098,
         21001,
         36542,
         40922,
         41645,
         33358,
         84274,
         44305,
         84298,
         47619,
         27440,
         19844,
         66701,
         239552,
         77410,
         12794,
         20675
      ],
      "backdrop_path": "/ssUxTFKZYOts8T9gSiCwZZIUUpA.jpg",
      "revenue": 2020700,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Billy Collier",
               "gender": 2,
               "credit_id": "52fe47309251416c75090b31",
               "name": "Sean Hayes",
               "profile_path": "/tkJiMSkm2aEsLiSy5HsgEmxINpZ.jpg",
               "id": 52601,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gabriel",
               "gender": 2,
               "credit_id": "52fe47309251416c75090b35",
               "name": "Brad Rowe",
               "profile_path": "/htYBmmA2qtBNwt5zCG2WCH1TWWM.jpg",
               "id": 65475,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Perry",
               "gender": 2,
               "credit_id": "52fe47309251416c75090b5d",
               "name": "Richard Ganoung",
               "profile_path": null,
               "id": 109184,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Georgiana",
               "gender": 1,
               "credit_id": "52fe47309251416c75090b61",
               "name": "Meredith Scott Lynn",
               "profile_path": "/xs7Z9eymnmNu8Z1Wab9U3ccxepn.jpg",
               "id": 151384,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Whitey",
               "gender": 2,
               "credit_id": "52fe47309251416c75090b65",
               "name": "Matthew Ashford",
               "profile_path": "/11kaTPGguWRoyptLjcxZWNIZZHL.jpg",
               "id": 154441,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Fernando",
               "gender": 2,
               "credit_id": "52fe47309251416c75090b69",
               "name": "Armando Valdes-Kennedy",
               "profile_path": null,
               "id": 173824,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Rex Webster",
               "gender": 2,
               "credit_id": "52fe47309251416c75090b6d",
               "name": "Paul Bartel",
               "profile_path": "/7Kj1Y9V8lfnFXHkjf30H8d3ylQA.jpg",
               "id": 101377,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Gundy",
               "gender": 2,
               "credit_id": "52fe47309251416c75090b71",
               "name": "Carmine Giovinazzo",
               "profile_path": "/vz4yAF22bqgPWM1ZDzi9OnfzVP2.jpg",
               "id": 12800,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Holly",
               "gender": 1,
               "credit_id": "52fe47309251416c75090b75",
               "name": "Holly Woodlawn",
               "profile_path": "/lAfx6cfa4q6Qdm3P2s52fqfhdQ6.jpg",
               "id": 106926,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Andrew",
               "gender": 2,
               "credit_id": "56b67c16925141661500442a",
               "name": "Christopher Bradley",
               "profile_path": "/efLSQiHOkueOjVGu4muU26eYFKm.jpg",
               "id": 182600,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47309251416c75090b3b",
               "name": "Tommy O'Haver",
               "profile_path": "/9mLTBNTLML7hOBzH9hDWKV0pGMh.jpg",
               "id": 62514,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47309251416c75090b41",
               "name": "Tommy O'Haver",
               "profile_path": "/9mLTBNTLML7hOBzH9hDWKV0pGMh.jpg",
               "id": 62514,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47309251416c75090b47",
               "name": "Marcus Hu",
               "profile_path": null,
               "id": 1001254,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe47309251416c75090b4d",
               "name": "Meredith Scott Lynn",
               "profile_path": "/xs7Z9eymnmNu8Z1Wab9U3ccxepn.jpg",
               "id": 151384,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47309251416c75090b53",
               "name": "David Moseley",
               "profile_path": null,
               "id": 991381,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe47309251416c75090b59",
               "name": "Irene Turner",
               "profile_path": null,
               "id": 74265,
               "department": "Production",
               "job": "Line Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.97916,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17539,
      "vote_count": 14,
      "budget": 0,
      "overview": "Billy, a struggling young gay photographer (who likes Polaroids), tired of being the \"other man\", falls in love with Gabriel, a waiter and aspiring musician who is probably straight but possibly gay or at least curious. Billy tries to get Gabriel to model for his latest project, a series of remakes of famous Hollywood screen kisses, featuring male couples, while also trying to win his affections.",
      "similar": [
         449176,
         413666,
         47643,
         184352,
         26933,
         52799,
         322127,
         10938,
         11000,
         26371,
         26280,
         4927,
         17483,
         10806,
         4369,
         428493,
         338189,
         119675,
         382475,
         340684
      ],
      "original_title": "Billy's Hollywood Screen Kiss",
      "runtime": 92,
      "poster_path": "/6YgizLQ4Jyc4T8Juf3LHV3KvpkH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Revolutionary Eye LLC",
         "id": 19397,
         "origin_country": ""
      }],
      "release_date": "1998-07-24",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Lights!... Camera!... Attraction!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tommy O'Haver"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Tommy O'Haver"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0137386/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxMTMyNzA2Nl5BMl5BanBnXkFtZTcwMzUxMjgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Brad Rowe, Sean Hayes, Richard Ganoung | See full cast and crew »"],
      "reviews": [
         "This film was a rare treat in that it presents its subject matter with dignity and fun. The comedy, directed by Tommy O'Haver never goes for cheap shots. The story of this somewhat naive photographer trying to make it in Los Angeles, under another writer/director would have gone for the 'on your face' attitude, rather than give it the romantic tone Tommy O'Haver imparted on the movie. The performances are good. Sean Hayes, who has gone to bigger and better things, is fine as Billy, the photographer. Brad Rowe, as Gabriel, the object of Billy's love, is fine also. Best of all is Meredith Scott Lynn, a fine actress, who is the best asset of this movie. Her Georgina serves to tie all the different plots, and in doing so, she contributes to make the film better. Paul Bartel, Holly Woodlawn and the rest, do a fine job. Tommy O'Haver made a charming movie about people that are so normal they could be straight for all we know.",
         "\"Billy's Hollywood Screen Kiss\" Aspect ratio: 2.39:1 (Panavision) Sound format: Dolby Stereo An LA photographer (Sean Hayes) falls madly in lust with an aspiring model (Brad Rowe) who's been hired to pose in a series of pictures inspired by old-time Hollywood movies. But Hayes receives mixed signals from the object of his desire - is he gay, or isn't he? - which leads to complications of the heart... Described as a 'trifle' by writer-director Tommy O'Haver (ELLA ENCHANTED), this unassuming confection asks little more of its audience than to enjoy the scenery (both geographical and human!) and to pine along with its luckless protagonist as he pursues the hunk of his dreams. Those familiar with Hayes' outrageous turn in TV's \"Will & Grace\" may be disappointed by his restraint as a bland, scatterbrained idealist who learns the hard way that the course of true love never ran smoothly, especially in LA. Spiced with dream sequences that recreate moments from Hollywood's 'golden age' (most impressively, an Astaire-Rogers dance routine between Hayes and Rowe to the strains of Petula Clark, with drag queens on backing vocals!), the film pays affectionate tribute to the movies of a bygone era, movies which inspire the leading character on his never-ending quest for perfect happiness. Watch out for the magical scene in which Hayes and Rowe share a bed for purely platonic reasons, only to end up touching each other by 'accident'... Also starring Meredith Scott Lynn (STANDING ON FISHES), Richard Ganoung (PARTING GLANCES), Paul Bartel (EATING RAOUL), Carmine D. Giovinazzo (IN ENEMY HANDS), and Warhol 'superstar' Holly Woodlawn (WOMEN IN REVOLT) as a musical attraction at the gayest party in town! Beautiful widescreen cinematography by Mark Mervis (HELLBENT).",
         "Considered in the context of an initial effort by a young director, I thought this was a very nice film. As a gay man, I found the characters all very believable and recognizable, and the protagonist Billy utterly charming. All in all, skillful, original and sweet. Don't go in expecting a deep cinematic experience, but accept it for what it is and I don't think you will be disappointed. However, those who are not gay or who cannot empathize with the gay experience, will probably not be moved, notwithstanding the director's attempt to show the universal character of human love and experience.",
         "This movie starts as a comedy, but somewhere along the way, it becomes a touching drama. The story about Billy who is often rejected by his love interests will give you a very different view of homosexuals, whom often portrayed as a group of people who have sex a lot and always change partners. This movie will show you that that is not the case. It's worth the money.",
         "If you watch this movie expecting Sean Hayes to play a Jack McFarland (\"Will & Grace\") type character, you'll be disappointed. His portrayal of Billy is low-key & pensive. He's adorable (instead of obnoxious & swishy) with a little boy twinkle in his eyes. Billy is a photographer from Indiana who has relocated to Los Angeles. He comes across a waiter/bass player (Brad Rowe as Gabriel, a character I'm not too crazy about) working in a coffee shop, who becomes his model & the object of his affection. Supposedly, Gabriel is straight & has a \"girlfriend\" in San Francisco. The sexual tension between these two can be cut with a knife (it's nerve wracking.) I especially like the scenes where Billy opens up to Gabriel about his life & experiences. Telling him the types of things you'd only share with someone you truly feel connected to. Is Gabriel gay?? Will they get together??... (The film has great sets, & beautiful colors. There are also hideous drag queens on hand. The one who lip syncs Petula Clark tunes is horrendous looking & it's amusing hearing/seeing Pet Clark's voice come out of that face!)",
         "This is another one of those \"discovered by accident while channel surfing\" movies that I am always grateful to have found. Before the movie was over, I was online buying the DVD. O'Haver must have summoned all his Indy Film clout to muster the likes of Paul Ganoung, Meredith Scott Lynn and the fabulous Paul Bartel to lend their talents both on and off the camera, but the coup of coups was casting Sean Hayes. Hayes is superb as Billy, a struggling gay photographer yearning for love. He falls for Gabriel (Brad Rowe) who may or may not be gay. The rest of the film dances around the inevitable question and let's just say that things have a way of working out for the best, albeit differently from what we often expect. Actor, writer, director and absolute gay icon Paul Bartel, who unfortunately passed away a couple of years after Screen Kiss, is deliciously unctuous as a would be mentor. Brad Rowe is passable, if a little lightweight, and benefits immeasurably from his co-star. Sean Hayes, even before the runaway success of Will and Grace, demonstrates the comedic genius that steals almost every scene. Spliced throughout the movie are several numbers by Mr. Dan, a notable drag artist and promoter from L.A., and as Petula Clark he helps generate the sheer joy of watching this movie. If you remember Lou Reed's classic \"Take a Walk on the Wild Side\" you may enjoy watching Holly Woodlawn (\"Holly came from Miami F-L-A\" - yes THAT Holly) as the party hostess. The DVD commentary is worthwhile, and offers an inside view of the resourcefulness it takes to make a good indie film. It does not detract from the importance of BHSK that it is not an original film. O'Haver had been toying with the basic story idea since his earlier Catalina, but in BHSK the story is more fully developed and humorous. Touching, moving, gentle and risqué, an uplifting and life-affirming message wrapped in a carnival of Angelean queer decadence.",
         "I am a straight guy and I LOVED this movie. My friend told me to rent it and watch it without reading the summary, so I did. I never would have seen this movie otherwise, but I am so glad that I did. It was educational for me as well as entertaining. I definitely recommend seeing this movie to anyone who is deciding whether or not to see it. It was GREAT!!!",
         "One of the very few movies I saw twice this year, and not just because newcomer Brad Rowe is so terribly easy on the eyes. Whether you're gay or straight (although, I suspect, particularly if you're a gay man), you're bound to see yourself on the screen more than once. Billy (Sean P. Hayes) rushes headlong to a place where we've all gone before, a place where angels fear to tread: the Territory of Unrequited Affection. We've all been there; we've all done it. The desire and need for emotional as well as physical intimacy is a great and terrible thing, and Billy's struggle is one we can identify with while still seeing the humor inherent in our own all-too-human endeavors. Bright, cheerful cinematography makes the most of the distinctly L.A. locations (West Hollywood, Catalina Island). Gentle, tender, funny, for the most part honest, and not a diatribe--which meant that I could recommend it to my straight friends, too.",
         "Aptly described by its producer as a trifle, this is a cheerful little romantic comedy about a gay photographer (SEAN HAYES) who fantasizes about what it would be like to connect with a gay hunk (BRAD ROWE) who seems to be leading him on in a homo-erotic relationship that Rowe prefers to keep platonic. The bedroom scene is the best acted, best scripted, best directed moment in the whole film, done with rare sensitivity and acting skill by both. It culminates in nothing, which is what one feels by the time the movie has come to its disappointing finale. Nothing really new has opened up food for thought. By turns, sad, wistful, funny, irreverent, with a cast full of what we call misfits (and rather shallow ones at that), it fails to do anything more than pass the time as the kind of interesting little gay trifle that gains sympathy for Sean Hayes' character. At the same time one can't help being irritated by his hopelessly romantic character molded by the tacky romantic films he grew up on. Makes its point by having strains from Max Steiner's \"Now, Voyager\" as part of the background score. Certainly not for everyone, but amusing enough to please fans of SEAN HAYES who will no doubt like seeing him in a more restrained role than the gay man he played on \"Will and Grace\". He does well in the part. BRAD ROWE is a bit stiff as his fair-haired dreamboy (and would-be lover), lacking the ability to create any sympathy at all for his character by the film's end. He's really too bland to care about. Darkly handsome JASON-SHANE SCOTT as Brad might have been a better choice for Rowe's key role since he shows considerable more dramatic ability in a minor part as well as the model looks required.",
         "A tepid attempt at gay comedy which would appeal to or at least not offend potential \"straight\" audience members. The story revolves around Billy (Sean Hayes) and his infatuation with a seemingly straight man named Gabriel (Brad Rowe) who he meets at a coffee shop and convinces to do some modeling. Before long a more famous photographer on the L.A. scene, Rex Webster (Paul Bartel) is threatening to swoop down and take him away from Billy before he gets to finish his photo shoot. Much of the film is consumed with Billy's self-doubt about his relationship with Gabriel \u0096 is he merely engaging in \"fantasy projection\" of his desire onto an apparently straight man (who assures us at every opportunity that he has a \"girlfriend in San Francisco\") or has he fallen in love with the improbably handsome busboy? There are some moments of slight humor but nothing that made me laugh out loud. A lot of the characters just became obnoxious to me, particularly Billy's straight friend Georgiana (Meredith Scott Lynn) who for unexplained reasons spends time with a very very obnoxious drug addict musician type on Catalina Island. The drug addict character is an example of how the film tried to woo favor with the straight audience by projecting its unfavorable stereotyped images onto select \"straight\" characters and allowing the other \"straight\" characters to join in on ridiculing those characters' behavior along with the gay characters. I mostly watched the film to see Paul Bartel, honestly, and his work was fine here but not exceptional. There wasn't anything distinctive enough about the character, a sort of hackneyed artist/queen, that would have enabled Bartel to show much of his talent. Since this was one of Bartel's last roles that's kind of disappointing. I did enjoy Hayes' work, I thought it was fine within the limits of what he was given for the character. Not really a terrible movie but really just not funny enough to be worth it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Revolutionary Eye LLC"],
      "summaries": [
         "Billy, a struggling young gay photographer (who likes Polaroids), tired of being the \"other man\", falls in love with Gabriel, a waiter and aspiring musician who is probably straight but possibly gay or at least curious. Billy tries to get Gabriel to model for his latest project, a series of remakes of famous Hollywood screen kisses, featuring male couples, while also trying to win his affections.",
         "Billy is a gay fine-arts photographer who falls in love with straight coffee-shop waiter Gabriel."
      ],
      "budget": 0
   },
   "movielensId": 2029,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-07-24",
      "dvdReleaseDate": "2002-02-05",
      "directors": ["Tommy O'Haver"],
      "runtime": 92,
      "movieId": 2029,
      "title": "Billy's Hollywood Screen Kiss",
      "mpaa": "",
      "actors": [
         "Sean Hayes",
         "Brad Rowe",
         "Richard Ganoung",
         "Meredith Scott Lynn",
         "Matthew Ashford",
         "Armando Valdes-Kennedy",
         "Paul Bartel",
         "Carmine Giovinazzo",
         "Holly Woodlawn",
         "Christopher Bradley"
      ],
      "imdbMovieId": "0137386",
      "originalTitle": "Billy's Hollywood Screen Kiss",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["8QAfaVBokVs"],
      "plotSummary": "Billy, a struggling young gay photographer (who likes Polaroids), tired of being the \"other man\", falls in love with Gabriel, a waiter and aspiring musician who is probably straight but possibly gay or at least curious. Billy tries to get Gabriel to model for his latest project, a series of remakes of famous Hollywood screen kisses, featuring male couples, while also trying to win his affections.",
      "tmdbMovieId": 17539,
      "avgRating": 3.46335,
      "releaseYear": "1998",
      "numRatings": 532,
      "posterPath": "/6YgizLQ4Jyc4T8Juf3LHV3KvpkH.jpg"
   }
}