{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "american football coach",
            "id": 5621
         },
         {
            "name": "coach",
            "id": 8338
         },
         {
            "name": "pirate",
            "id": 12988
         }
      ],
      "imdb_id": "tt0062737",
      "video": false,
      "title": "Blackbeard's Ghost",
      "recommendations": [
         36855,
         15943,
         15944,
         17984,
         19378,
         20238,
         19953,
         18444,
         35992,
         22777,
         19762,
         32140,
         20723,
         36283,
         50717,
         18887,
         35101,
         29228,
         18966,
         13343
      ],
      "backdrop_path": "/wUsgwPXJlmj1JtkB68iCsbcTtZE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robyn's Grandfather Captain Blackbeard",
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e17",
               "name": "Peter Ustinov",
               "profile_path": "/8Lv4g3ZPVSM1ckKk15OnryX8sL7.jpg",
               "id": 14501,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Steve Walker",
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e1b",
               "name": "Dean Jones",
               "profile_path": "/n9eCdZR2pUylbx53VEoTZ6INuIr.jpg",
               "id": 40393,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jo Anne Baker",
               "gender": 1,
               "credit_id": "52fe46bd9251416c75081e1f",
               "name": "Suzanne Pleshette",
               "profile_path": "/7R77pmMiGLHtDrnhCjGzmDohS8O.jpg",
               "id": 8231,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Emily Stowecroft",
               "gender": 1,
               "credit_id": "52fe46bd9251416c75081e23",
               "name": "Elsa Lanchester",
               "profile_path": "/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg",
               "id": 2926,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dean Wheaton",
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e27",
               "name": "Richard Deacon",
               "profile_path": "/ikKk1FGXFDl9GJoyI3I2EBfexEY.jpg",
               "id": 80206,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Prince John",
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e55",
               "name": "Peter Ustinov",
               "profile_path": "/8Lv4g3ZPVSM1ckKk15OnryX8sL7.jpg",
               "id": 14501,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Marian Sheeta",
               "gender": 1,
               "credit_id": "52fe46bd9251416c75081e59",
               "name": "Stefanie Powers",
               "profile_path": "/xjK7ytgxD9MVkB1vTgjHgn83xMS.jpg",
               "id": 39762,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Sir Hiss",
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e61",
               "name": "Terry-Thomas",
               "profile_path": "/tdsN3NUsBNEPtHkWX5BskfG7yCi.jpg",
               "id": 29427,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Silky Seymour",
               "gender": 2,
               "credit_id": "5936e52ac3a3684b97000969",
               "name": "Joby Baker",
               "profile_path": "/lvZ1dCVF3YmHspnyj1xvyYZWx1e.jpg",
               "id": 83435,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "TV Commentator",
               "gender": 0,
               "credit_id": "5936e5369251417256000978",
               "name": "Elliott Reid",
               "profile_path": "/nRRsBDG0uxNmuDO4V2FigeTXS3j.jpg",
               "id": 11168,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Virgil",
               "gender": 0,
               "credit_id": "5936e546925141724e000969",
               "name": "Norman Grabowski",
               "profile_path": "/zdHg0RcNh9heTTu2ch5c7NBJCcF.jpg",
               "id": 1675496,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Motorcycle Officer",
               "gender": 1,
               "credit_id": "5936e5589251417285000980",
               "name": "Kelly Thordsen",
               "profile_path": "/ffLcE343NamNXydbumgjbQMD6M7.jpg",
               "id": 81735,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Pinetop Purvis",
               "gender": 2,
               "credit_id": "5936e5689251417285000991",
               "name": "Michael Conrad",
               "profile_path": "/kleHZkUDjC1mVLJFSEajRRQoGO6.jpg",
               "id": 40390,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Croupier",
               "gender": 2,
               "credit_id": "5936e577c3a3684bfd000a6a",
               "name": "Herbie Faye",
               "profile_path": "/mZ6cKi9WjwdD3KpY7n5gQQ3iwTq.jpg",
               "id": 153537,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Head Official",
               "gender": 2,
               "credit_id": "5936e586925141725f0009ea",
               "name": "George Murdock",
               "profile_path": "/6FsCrzj86JjQJsEMYWnDBdPa0kw.jpg",
               "id": 2081,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Gudger Larkin",
               "gender": 0,
               "credit_id": "5936e5b9c3a3684c48000900",
               "name": "Hank Jones",
               "profile_path": "/kXmxVycgvSJfztC5ewVpRY9FAnF.jpg",
               "id": 1374832,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "Teller",
               "gender": 2,
               "credit_id": "5936e5c5c3a3684c39000a6d",
               "name": "Ned Glass",
               "profile_path": "/3H3OFQohDcX2TQ9bKhwWpfL6HxI.jpg",
               "id": 18870,
               "order": 17
            },
            {
               "cast_id": 30,
               "character": "Waiter",
               "gender": 2,
               "credit_id": "5936e5d0c3a3684bc1000aad",
               "name": "Gil Lamb",
               "profile_path": "/vnGdmpmsQcT1DoNYVufovzMHtdZ.jpg",
               "id": 99828,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e2d",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e33",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081e39",
               "name": "Don DaGradi",
               "profile_path": "/umaANl0jfZwnytLvyJetUPXHFkK.jpg",
               "id": 5837,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e3f",
               "name": "Wolfgang Reitherman",
               "profile_path": "/p9ywBLS3Pvv3BcocjLsPwnll6mc.jpg",
               "id": 57314,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e45",
               "name": "Hayao Miyazaki",
               "profile_path": "/1OBQPIwR88n49oAEzk47k0fhhOV.jpg",
               "id": 608,
               "department": "Directing",
               "job": "Layout"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081e4b",
               "name": "Herb Taylor",
               "profile_path": null,
               "id": 143773,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081e51",
               "name": "George Bruns",
               "profile_path": "/qH2a2m2LoLDCjpPj1h6sISFHDr0.jpg",
               "id": 57337,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.037925,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16249,
      "vote_count": 52,
      "budget": 0,
      "overview": "Peter Ustinov stars as the eponymous wraith, who returns to Earth to aid his descendant, elderly Elsa Lanchester (Stowecroft). The villains want to kick Lanchester and her friends out of their group home so that they can build a crooked casino. Good guy Steve Walker (Jones) gets caught in the middle of the squabble after evoking Blackbeard's ghost.",
      "similar": [
         60304,
         16859,
         58,
         671,
         672,
         675,
         767,
         2270,
         8065,
         1865,
         10693,
         4935,
         9029,
         408,
         411,
         129,
         492,
         62213,
         72197,
         76492
      ],
      "original_title": "Blackbeard's Ghost",
      "runtime": 106,
      "poster_path": "/ybo9m4BFvJZMwuXE7YJ5bOuwB4F.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1968-02-08",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "He's out'a sight...literally!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 106,
      "synopsis": "Steve Walker (Dean Jones) arrives in a Maryland seacoast town to take the position of track coach at Godolphin, the local college. The night of his arrival coincides with a charity bazaar at the hotel where he will be boarding: Blackbeard's Inn, named after the notorious English pirate Captain Edward Teach, and now run by the elderly descendants of the pirate's crew. The owners are attempting to pay off their mortgage in order to keep the inn from being bought by the local crime boss, Silky Seymour (Joby Baker), who wants to build a casino on the land. In quick succession, Steve discovers his track team's shortcomings and runs afoul of the stiff dean of Godolphin College, its football coach, and Seymour; but he also makes the acquaintance of an attractive Godolphin professor, Jo Anne Baker (Suzanne Pleshette), who is anxious to help the elderly ladies save the Inn. A bidding war with the football coach at the charity auction nets Steve an antique bed warmer, once owned by Blackbeard's wife, Aldetha Teach, who - in addition to being a witch - is also the spitting image of Jo Anne. Inside this bed warmer is hidden a book of magic spells, that had once been the property of Aldetha. Steve recites one on a lark, unintentionally conjuring up the ghost of Captain Blackbeard (Peter Ustinov), who appears as a socially-inappropriate drunkard whose wife cursed him to an existence in limbo since his death in 1718 for all eternity unless he can perform one good deed. Steve and Captain Blackbeard soon learn that the two of them are bound to one another by the power of the spell and only the very reluctant and somewhat eccentric Steve can see or hear the ghost (whom is also coporial and can physically moves things with nobody seeing his physical image). As a result, the increasingly frustrated Steve must deal with the antics of the wayward pirate while attempting to revive Godolphin's track team and form a relationship with Jo Anne. The next evening, Steve gets arrested falsely for drunk driving in his automobile, which was in the control of Blackbeard, who was steering the steering wheel like a pirate ship. As a result of this, as well as causing the cop's motorcycle to crash into a tree, he spends a night in jail, while Blackbeard goes in and out of the cell creating havoc for Steve who begins to lose his sanity among all of this (Steve keeps forgeting that no one, except him, can see or hear Blackbeard and begins to increasingly talk to him in public with everyone around him thinking that Steve has finally lost his sanity... which is only half-true). While in jail, Steve tells Blackbeard what Mrs. Stowcroft mentioned that if Blackbeard did a good deed, the curse would be broken. However, when Steve asks for the treasure that would help save the Daughters of the Buccaneers, in keeping the inn, Blackbeard admits that he spend all of the money, therefore causing Steve to no longer trust Blackbeard. Steve gets released from jail the next day, but he's placed on probation with the college due to this mistaken drunk driving incident and rumors of mental incapacity. The Dean tells Steve that his team has to win the Broxton relays, or he will be finished. Things get more complicated when the pirate steals one of the Inn's mortgage payments and bets it on Steve's track team. Blackbeard's intention is to use his ghostly powers to help Godolphin win the Broxton Relay track meet, and thereby pay the mortgage in full. Though Steve (who is an overly scrupulous man) is at first outraged over the pirate's interference, he eventually decides the greater good is to win the money for the sake of the Inn and help the old ladies, whom he also has grown fond of. During the Broxton Relays, Steve watches helpessly while Blackbeard uses his ghostly powers to help his team win and prevent the other team players from winning. Despite everyone around him thinking that Steve has gone insane (Steve keeps yelling to Blackbeard; telling him not to intervene with the relays when no one else can see or hear Blackbeard), the tean wins the relays. But when Steve goes to collect the winnings, Seymour is revealed to be a sore loser and refuses to pay out the winnings from the bet. The following evening, Steve, with Jo Anne in tow as well as the unseen Blackbeard, go to Silky Seymour's casino to try to win the money made and Steve accepts the pirate's help in shaking down Seymour. With Blackbeard again using his ghostly powers, he manages to help Steve and Jo Anne with all of the money needed to save the Inn at the craps and roulette tables, and when Seymour's thugs attempt to steal the money rather then let them go, Blackbeard intervenes and beats up Seymour and his thugs allowing Steve and Jo Anne to escape. Finally, with the mortgage paid, Blackbeard has performed his good deed and is released from the curse. In the final scene, Steve finally reveals Blackbeard to the old ladies and Jo Anne on the beach by having them recite the incantation. Blackbeard bids them all a cordial goodbye and departs to join his former crew aboard his ship, leaving Steve and Jo Anne to pursue their future happily together.",
      "writers": [
         "Bill Walsh",
         "Don DaGradi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062737/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NDcwMTk4Ml5BMl5BanBnXkFtZTcwNDQ0NjAwMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Ustinov, Dean Jones, Suzanne Pleshette | See full cast and crew »"],
      "reviews": [
         "This movie had great memories from when I saw it as a kid. Usually, the movie's never as good as it was, you know, when you see it again once you're older. This one is still great, though! The jokes and gags are, for the most part, routine and common, but I think Peter Ustinov made the movie. You just have to let go of everything and have fun with it.",
         "This was a movie that brought back good memories. Our family went to see it at the theater back in the 70's. It is a good story, with a few scenes that are very funny. Dean Jones has the lead (of course), and Suzanne Pleshette is also very good. Peter Ustinov, is a great pirate for the kids to enjoy. A good Disney movie, and a great family movie.",
         "Watching Blackbeard's Ghost yesterday put me in mind of the late Robert Newton and his portrayal of Blackbeard in a classic film from the Fifties. Had Mr. Newton not died of chronic alcoholism in 1957, I'm sure he would have been the Disney studio's choice to play Blackbeard. With Robert Newton not being available, the studio got another actor famous for a bravura performance, that of Nero and Quo Vadis. Who'd have thought that Peter Ustinov would have gotten another role that called for flamboyant overacting. Ustinov's Blackbeard is a combination of Newton's Blackbeard and his own Nero. And he dominates the film completely. Dean Jones who was Disney's major leading man at the time who played the roles Kurt Russell was too young for, borrows a great deal from that other actor, who's career Disney rejuvenated, Fred MacMurray. In fact the similarities between this and Absent Minded Professor and Son of Flubber are too obvious to be missed. Still those were two pretty funny films and Blackbeard's Ghost is in a great tradition. Dean Jones is the new track coach at Godolphin College and he stays at the inn that's run by the descendents of the crew of none other than Edward Teach better known as Blackbeard. But they are a harmless bunch of senior citizens led by Elsa Lanchester. Yet that inn is coveted by gangster Joby Baker who's bought the mortgage. Jones finds a faded piece of paper in an old bedwarmer and it's a spell that makes the ghost of old Blackbeard visible to him only. After that Jones plays straight man to a hilarious Ustinov. Blackbeard and is doings cause some romantic problems for Jones with Suzanne Pleshette, but in Disney tradition in the end the old buccaneer sets everything to right and escapes the limbo he's consigned to. For Peter Ustinov fans, this is a must. You can see it in his face and his performance how much of a good time Ustinov was having with this part. It will translate into your enjoyment as well.",
         "Blackbeard's Ghost is a live action picture out of Walt Disney Studios and it's directed by Robert Stevenson. It's based around the novel written by Ben Stahl, with the adaption for the screen by Don DaGradi & Bill Walsh. Starring are Peter Ustinov, Dean Jones, Suzanne Pleshette, Elsa Lanchester & Joby Baker. Plot finds Ustinov as the titular phantom of the title, who is suspended between worlds after a curse was put on him by his ex-wife. When amiable track coach Steve Walker (Jones) arrives in the coastal town of Godolphin he attends a charity sale and buys an antique bed warmer. Later that night Steve finds a hidden spell located in the bed warmer and after reading it out aloud he conjures up the ghost of Blackbeard. Seems that only Steve can see the bluff old pirate, and apparently Blackbeard can only escape his curse if he does a good deed. Good timing, then, since the old hotel run by the old ladies of Godolphin is under threat of closure from unscrupulous gambling gangster Silky Seymour (Baker) who wants to build a casino on the land. In spite of the fact that they just can't get on, Blackbeard and Steve may just be good for each other. A perfect light hearted live action film for the young and the young at heart. Looking a bit dated now on account of the advent of special effects, Blackbeard's Ghost none the less carries a weighty good against evil parable and brings on the laughter in spades as it goes. The set up is classic Disney, a pretty little coastal town is home to buccaneer secrets and the equilibrium is being upset by baddies who want progress to further their greed. Enter a bad boy coming good and the underdog sports team suddenly finding a new lease of life; aided wonderfully by Blackbeard during the film's funniest quarter. And there's even an engaging romance between Jones & Pleshette that's easy to warm too. The cast are inoffensive and pleasant, particularly Ustinov who is on full tilt pantomime overdrive, while the little devilish motif of cheating for the greater good finds Disney not hiding behind the syrup jar. Personally I laughed out loud on a number of occasions, most notably a cheerleader sequence that still has me giggling as I write this piece. Hopefully this film can have a similar effect on those looking at it for the very first time. Seek it out folks and watch with the family, for it is perfect family entertainment. 8/10",
         "This Ustinov performance is one of the few I saw of him. The amazing ease and wit with which he performs is admirable. Who would have thought that a classic role such as a pirate could be filled in with such dignity. The story itself is a patchwork of silly situations all centring around the fund raising for a group of old ladies. The whole cast is up for a good laugh (I suspect Ustinov has something to do with this) and this gives the movie some swagger. The sets and effect used in the movie are amateurish, BUT this is what makes the movie all the more gullible. Although this might at first seem a movie to be seen on TV on a rainy Saturday afternoon, I recommend you go to the videostore and enjoy it on a Friday night before you go out.",
         "I saw this movie on Easter Monday this year, I loved it, it has so many great jokes, mostly ghost jokes which were great. One of the most funniest movie I have seen, i could not stop laughing. Blackbeard's Inn, a small hotel on the Carolina coast, is run by the Daughters of the Buccaneers, a group of little old ladies all claiming to be descendants of the notorious Edward Teach, known as Blackbeard. When Steve Walker, the new track coach for Godolphin College, registers at the inn, he learns that the Daughters are desperately trying to pay off their mortgage in order to prevent a takeover by the local gambling czar, Silky Seymour. Encouraged by Jo Anne Baker, a college instructor, Steve helps the old ladies' cause by buying an antique bed warmer at a charity auction and discovers that it was once owned by Blackbeard's 10th wife. Before being burned as a witch, she had condemned her philandering husband to wander in limbo until he performed one good deed. By accident, Steve conjures up the devilish pirate's spirit and persuades him to help the Daughters. After that he life is being turn upside down by this ghost, it some very funny scenes, then people starting to thinking that Steve is the one who going crazy. Great comedy for the whole family.",
         "Fun Disney-fantasy comedy about a pirate/ghost that returns to our time. Enjoyable story that mingles adventure , fantasy , slapdash and amusement . One of Disney's best live-action comedies , this stars Peter Ustinov in the title role as Blackbeard , he has been cursed by his spouse who was an evil witch , so that he will never die . The phantom is suspended between worlds after a curse was put on him by his ex-wife . When a sympathetic trainer named Steve Walker (Dean Jones) arrives in the coastal little town called Godolphin he attends a charity sale and buys an antique bed warmer. After that , Steve discovers a hidden spell and after reading it out aloud he conjures up the title character and he only can see the fantastic pirate , being one important trouble , no one will believe him . The only way to \"break\" the curse is to do a good act for once in his life . As the notorious pirate is a ghost who has to prevent his descendants from becoming a gambling casino . Meanwhile , an ancient hotel run by some old ladies called ¨Daughters of Buccaneers¨( Elsa Lanchester and others ) of Godolphin little town is under threat of foreclosure from nasty gambling mobster who wishes to construite a house game on the location . As the coach Steve and the gorgeous Jo Anne (Suzanne Pleshette ) help protect his descendants' home from being taken over by racketeers who want to make it casino , both of whom along with the 400-year-old ghost romp around in the motel threatened with closure. This slapstick fantasy Disney is plenty of adventure , imagination , comedy ad lots of fun . This is a likable sort of a kiddies' adaptation of a ¨ghost story¨ and another attempt for repeat the Mary Poppins magic . Peter Ustinov as the titular phantom of the title is terrific , he steals the show , as himself grins, grunts and botchers around which makes him all the more endearing . Many of the gags are good , but the movie sometimes drags . Highlights of the movie result to be the amusing scenes in which the pirate uses his powers to aid the young runners to gain competitions and fun final at the house game . Well produced by Bill Walsh , colorfully photographed by Edward Colman and lively musical score by Robert Brunner ; the three of them customary experts on Disney fantasy home . The motion picture is well directed by usual craftsman from Disney productions named Robert Steveson who achieved for the famous company its greatest successes such as ¨Mary Poppins¨ , ¨Bednobs and broomsticks , ¨Gnome-mobile¨, ¨Herbie rides again¨ , ¨Absent-minded professor¨, ¨Son of Flubber¨, ¨Shaggy DA¨ , ¨That darn cat¨ , ¨One of our dinosaurs is missing¨ and many others . Rating : Acceptable , 6,5 , worthwhile watching . Amusing and engaging film with effective combination of primitive special effects , live action , adventure , fantasy and humor . The children will get a kick out of this Disney film .",
         "Peter Ustinov has a ball and the rest of the cast are most enjoyable in this fun Disney flick which is ideal for young audiences. Director Robert Stevenson brings Ben Stahl's novel to the screen as he tells the story of legendary pirate Captain Blackbeard, who was cursed by his wicked wife to walk the earth in limbo until such a time as some small portion of good might be found in him. Disney released similar films around the late sixties and early seventies including \"Bedknobs and Broomsticks\" with much success at the time. This enjoyable, merry fun also stars Elsa Lanchester, Dean Jones (of \"Herbie\" fame) and Suzanne Pleshette. Sunday, January 18, 1998 - Video",
         "Though this movie isn't a well-known classic, it is still most certainly a shining example of why Disney films were once so enjoyable. The movie features an interesting, offbeat plot of the new coach of a rather dismal track team unwittingly summons the ghost of the vicious pirate, Edward Teach (Peter Ustinov). After centuries caught in limbo, the pirate has evolved into a lovable ne'r-do-well, and does his best to \"help\" his new companion, much to the consternation of the coach. Disney regulars Dean Jones, Suzanne Pleshette, Elsa Lanchester, George Murdock, and Richard Deacon star in this little gem. They play their usual character types, but the move is truly made by Peter Ustinov, who plays the role perfectly. The movie features a lot of slapstick, though it's cleverly presented and plays host to wry dialogue. All in all, a very enjoyable film",
         "While silly and over-the-top at times, this film is a lot of fun. My main problem though with \"Blackbeard's Ghost\" though is that it is tad too long by 10 minutes. But it is hugely enjoyable entertainment for the whole family, with some nice costumes and cinematography. Also a vast majority of the jokes are very funny, the intriguing plot is along the lines of \"The Canterville Ghost\" and the performances are spirited. Peter Ustinov, a great actor, makes a very lively lead who is condemned to wander in limbo until he performs a good deed, and Dean Jones also does a good job. Elsa Lanchester almost steals the film though, as one of the ladies he must save from gambling gangsters. Overall, while not perfect, it is enjoyable and worth watching. 7/10 Bethany Cox"
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["In this comedy, Peter Ustinov is the famous pirate's ghost that returns to our time. Blackbeard has been cursed by his last wife who was a notorious witch, so that he will never die. The only way to \"break\" the curse is to do (for once in his life) a good act. Is the famous pirate able to do something good?"],
      "budget": 0
   },
   "movielensId": 2035,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-02-08",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Robert Stevenson"],
      "runtime": 106,
      "movieId": 2035,
      "title": "Blackbeard's Ghost",
      "mpaa": "G",
      "actors": [
         "Peter Ustinov",
         "Dean Jones",
         "Suzanne Pleshette",
         "Elsa Lanchester",
         "Richard Deacon",
         "Peter Ustinov",
         "Stefanie Powers",
         "Terry-Thomas",
         "Joby Baker",
         "Elliott Reid",
         "Norman Grabowski",
         "Kelly Thordsen",
         "Michael Conrad",
         "Herbie Faye",
         "George Murdock",
         "Hank Jones",
         "Ned Glass",
         "Gil Lamb"
      ],
      "imdbMovieId": "0062737",
      "originalTitle": "Blackbeard's Ghost",
      "genres": [
         "Fantasy",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["0pgOSllKF_0"],
      "plotSummary": "Peter Ustinov stars as the eponymous wraith, who returns to Earth to aid his descendant, elderly Elsa Lanchester (Stowecroft). The villains want to kick Lanchester and her friends out of their group home so that they can build a crooked casino. Good guy Steve Walker (Jones) gets caught in the middle of the squabble after evoking Blackbeard's ghost.",
      "tmdbMovieId": 16249,
      "avgRating": 3.13728,
      "releaseYear": "1968",
      "numRatings": 346,
      "posterPath": "/ybo9m4BFvJZMwuXE7YJ5bOuwB4F.jpg"
   }
}