{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109287",
      "video": false,
      "title": "Blank Check",
      "recommendations": [
         26441,
         11164,
         10680,
         12559,
         14819,
         16314,
         17745,
         21845,
         20726,
         17037,
         26258,
         9446,
         36929,
         40490,
         24795,
         41579,
         10414,
         22590,
         26261,
         45325
      ],
      "backdrop_path": "/ucCLWpnmWm5VVkrx38Zo7JayijF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Preston Waters",
               "gender": 2,
               "credit_id": "52fe45bb9251416c750607e9",
               "name": "Brian Bonsall",
               "profile_path": "/yxHJV1rhvnct5yqm3zFyJKWVdkt.jpg",
               "id": 76130,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Shay Stanley",
               "gender": 1,
               "credit_id": "52fe45bb9251416c750607ed",
               "name": "Karen Duffy",
               "profile_path": "/c3G9gFCbBf6zHRQTqUZjXYgZUh4.jpg",
               "id": 76131,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Fred Waters",
               "gender": 2,
               "credit_id": "52fe45bb9251416c750607f1",
               "name": "James Rebhorn",
               "profile_path": "/cRbeDNPpcWKP0nLkXo5Bi1tq61w.jpg",
               "id": 8986,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sandra Waters",
               "gender": 1,
               "credit_id": "52fe45bb9251416c750607f5",
               "name": "Jayne Atkinson",
               "profile_path": "/Ae4wkn9x4JABoFWlNtdABYv2uol.jpg",
               "id": 18261,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ralph Waters",
               "gender": 2,
               "credit_id": "52fe45bb9251416c750607f9",
               "name": "Michael Faustino",
               "profile_path": null,
               "id": 76132,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Damian Waters",
               "gender": 2,
               "credit_id": "52fe45bb9251416c750607fd",
               "name": "Chris Demetral",
               "profile_path": "/itn5ZX13YdM34YMSxbAiscBWswL.jpg",
               "id": 76133,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Quigley",
               "gender": 2,
               "credit_id": "52fe45bb9251416c75060801",
               "name": "Miguel Ferrer",
               "profile_path": "/fvRncqShcaV8R45IJGYZ7IAvrsO.jpg",
               "id": 15860,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Juice",
               "gender": 2,
               "credit_id": "52fe45bb9251416c7506080b",
               "name": "Tone Loc",
               "profile_path": "/o940ZhEYQYrOJdhRnmPrYoc9iOq.jpg",
               "id": 31004,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Biderman",
               "gender": 2,
               "credit_id": "599a4c5a92514149cc00b6e6",
               "name": "Michael Lerner",
               "profile_path": "/7VlkzO1z5wh96UCXpPZ0rUFx8aN.jpg",
               "id": 4250,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Henry",
               "gender": 0,
               "credit_id": "599a4c69c3a368394800b7d0",
               "name": "Rick Ducommun",
               "profile_path": "/reHrybVr1GjF4pGXhtN9EUxS0zD.jpg",
               "id": 1538,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Yvonne",
               "gender": 1,
               "credit_id": "599a4c719251414a0600ac69",
               "name": "Debbie Allen",
               "profile_path": "/ilRAAFScoujz9VfFHug0GsYDyA6.jpg",
               "id": 32395,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Party Guest",
               "gender": 0,
               "credit_id": "5a3886700e0a264cbc1fe3d7",
               "name": "Alfredo Huereca",
               "profile_path": "/jmbSPEvhC4Z8SCv6eG5ctLAWa0W.jpg",
               "id": 1944192,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bb9251416c75060807",
               "name": "Rupert Wainwright",
               "profile_path": null,
               "id": 11809,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bb9251416c75060811",
               "name": "Blake Snyder",
               "profile_path": null,
               "id": 59954,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bb9251416c75060817",
               "name": "Colby Carr",
               "profile_path": null,
               "id": 960811,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a75873fc3a3686b510073d6",
               "name": "Bill Pope",
               "profile_path": null,
               "id": 9341,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 9.471954,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13962,
      "vote_count": 107,
      "budget": 13000000,
      "overview": "Bullied by his siblings and nagged by his parents, 11-year-old Preston is fed up with his family -- especially their frugality. But he gets his chance to teach them a lesson when a money-laundering criminal nearly bulldozes Preston with his car and gives the boy a blank check as compensation. Preston makes the check out for $1 million and goes on a spending spree he'll never forget. Maybe now, his family will take him seriously!",
      "similar": [],
      "original_title": "Blank Check",
      "runtime": 93,
      "poster_path": "/y3SHngrd4vb909iwxgPm1ER4NJb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1994-02-11",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Quick thinking landed him a million bucks... now everybody's after it!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rupert Wainwright"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Blake Snyder",
         "Colby Carr"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109287/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MzE2NjkzNF5BMl5BanBnXkFtZTcwODM1MjgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Brian Bonsall, Karen Duffy, James Rebhorn | See full cast and crew »"],
      "reviews": [
         "Chief Ooga say Disney's Blank Check is cute but hollow movie. Story follow adventure of young kid who get hit by man who want to avoid trouble by giving kid blank check (hence title) to cover damages done to two-wheeled cycle. Kid decides to obtain one million dollar from man by writing that on check. Kid go to bank and get one million dollar. Little did he know that man who hit him is some gangster-type man whose million dollars the kid stole. Chaos ensue. Chief not tell ending, but say that is predictable All in all, Chief Ooga not disappointed since Chief Ooga no expect much out of movie. Cute film for Little Chief, but trite and unrealistic for village elders. 2/5 Oogas",
         "Little Preston Waters (Brian Bonsall) is down on his luck. He needs money. Badly. He attends a little brat's birthday party and after seeing all his big-spending friends and the birthday boy, decides it's time for a change. Now we know his own special day is approaching. His thrifty father provides him with an $11 check, and as he goes down to his local bank to cash it, a recently-released thief named Carl Quigley(played convincingly by Miguel Ferrer) runs over his little bicycle. Eager to avoid the police, Quigley gives the kid a blank check and takes off. The check has fallen into the wrong hands, as Preston fills it in for a cool $1m and what do you know, has no trouble cashing it! Things get worse for the boy after a spending spree, as the money will eventually disappear, and a certain someone will be longing for that fortune. I enjoyed Brian Bonsall's and Karen Duffy's little friendship, along with friendly limousine driver Rick Ducommun, but the plot is way too basic, and my opinion remains the same now, as it did in 1994, when I first saw the film.",
         "Preston Waters, a 11 years old boy,has problems with his parents and brothers specially because of money issues. He is crazy to have his own house and his own rules,since his brothers always stole his saved money and his parents neglect his wishes. One awful day, Preston was riding his bicycle; It was the same day that the villain of the story,Quigley, was trying to scape from the Police and accidentally ran the car over Preston's bike. Needing to be far away from the police, Quigley gives in a hurry, a check to cover the damages of Preston's bike. The problem was: It was a blank check! Preston is a clever boy and decides to have a high price on that check: 1 million dollars! All that money gives Preston things that he always wished for, like a mansion with pool,lots of toys, and even a limousine! The problems start to begin when the FBI and Quigley wants to know where the money is, making Preston in a hard situation and facing many problems. This movie was one of my favorites during my childhood. :)",
         "Yeah, I remember this one! Many years since I actually watched it. The story was entirely surreal, but nonetheless great! What anyone who rates and reviews movies ought to bear in mind is what the respective movie aims at. It's the same with \"First Kid\", which follows a similar pattern. Certain movies - like this one here - just aim at plain and comical nonsense. Such movies can't be rated from the point of view of a hypercritical reviewer. Of course these movies lack quality, lack a sophisticated storyline, very often lack first-class acting, but if they do fulfil their primary premise - that's okay. I don't have this movie here on my list of all-time favorites, but I still thought it was funny, had some very enjoyable sequences and made a good story. Brian Bonsall is a smart actor anyway.",
         "[CONTAINS SPOILERS] A criminal by the name of Carl Quigley escapes from prison one night and returns to his hideout to retrieve his stash of $1,000,000 he had heisted once, and they both will come into play a little bit later in our tale. Preston Waters a depressed 10-year old. His brothers, Damien and Ralph have moved their business into his room, he also didn't have much fun at Butch's birthday party at Funland (Fun, Fun, Fun for everyone!) The reason he didn't enjoy himself was maybe that he couldn't do much with only six tokens, or maybe because he doesn't even like Butch. Preston then goes to the bank to open an account with $11 he got for his birthday. That same day, Quigley was in the bank president, Beiderman's office. They were in a money laundring process. When Quigley leaves, he runs into Preston's bike and begins to write a check to pay for it, but splits when he sees the cops, so Preston takes the blank check home. His parents yell at him because his bike is totalled. So with the help of his computer, Preston writes a check for $1,000,000, and at the bank, Beiderman thinks Preston is one of Quigley's men so he gives him the money. Preston soon goes on a spending spree. He buys a big house, a limousine with chauffer Henry. He also buys all kinds of things. Now back when this movie was made, 1994, $1,000,000 was ALOT of money and could buy alot of things, unlike today, 2002. Quigley finds out what happened and he, his henchman, Juice, and Beiderman go to look for Preston. Now you're probably wondering how a 10-year old kid could pull all this off, well, Nosey! He created an A.K.A name, Mr. Macintosh (got the name from his computer). Only problem, a pretty lady from the bank, Shay Stanley, needs to speak to Mr. Macintosh, but Preston takes her out to dinner and they talk about him. They go for a dance in a restaurant spraying fountain. It's going along great for Preston. He throws a big bash because it's Mr. Macintosh's birthday (and his). It's around that time that the shiot (SHEE-OT) really hits the fan. He's run out of money and he owes a debt, so the party is off. The crooks show up and Preston handles them Home Alone style. The FBI are also involved now, and Quigley decides to take over the identity of Macintosh to hide, but now he and his counterparts go to prison, so once again, Preston is a normal kid; this movie is pretty good. Brian Bonsall from Family Ties is in it, so is Karen Duffy, Tone Loc, Miguel Ferrer (son of Jose Ferrer), and Michael Faustino, brother of David Faustino from Married...with Children. So I recommend this film. -",
         "Blank Check may have been an excellent movie for kids, but ends up being uninspired in every way. The movie begins with a criminal named Quigley and he is a robber who goes to a secret hiding place to get his million dollars. We then cut to Preston Waters as an 11 year old kid who is harassed by his family about money. His older brothers run a Lawn Cutting business, and the parents treat them better because they are already making money, and saving. They buy the brothers a new computer and place it in Preston's room. Preston tells his dad about that it's his room, but his dad scolds him for Preston not making money. The brothers though have no idea how to run a computer, and mess it up. Yeah I can see why these are the favorite ones (sarcasm). Eventually the family goes to a party and Preston is sent to ride on kiddie rides while the others are on better rides like a roller coaster. Preston even gets a birthday card, and only an $11 check. How cheap does this family have to be to Preston? He's already being pressured to find a job, and he's only 11! Is this some world where child labor laws don't exist? Preston goes to the bank to set up an account, and meets Shay Stanley who tells him he needs $200 to open an account. We then cut to the villains of the movie, Quigley, and the head of the bank, Biderman. Quigley learns the bills are marked, and sends for Juice, his other henchman. Quigley leaves, but accidentally runs over Preston's bike. Quigley writes a check, but before completing it he sees the cops, and hands Preston a blank check (ladies and gentlemen we have a title!). At home Preston's mom and dad are angry because Preston's bike got run over, and they scold him about not taking care of his valuables, and ground him. Seriously someone needs to call Child Services and take the kid away, and arrest the parents for negligence. Preston decides enough is enough, and uses the check to forge a $1 million check. Preston goes out to the bank (wasn't he grounded?) and meets Biderman who believes he is Juice, and gives him the million dollars. The real Juice comes by, and both realize they have been duped by Preston. Now to be fair, Juice seems to be the only enjoyable person in this movie. Preston creates a new alias name, Mr. Macintosh, and buys a home for himself, a limo driver named Henry who supposed to be comedy relief, but isn't funny at all. Preston meets Shay again, and tells him that Mr. Macintosh would like to meet her. We then learn that Shay is actually an FBI agent who is looking for Quigley, and the other villains. They even watch Mr. Macintosh since they consider him an interesting person which makes no sense considering that all of Macintosh's business is done by a kid. They honestly don't think it's weird or something? From here on in the movie uses a lot of filler with Preston on a shopping spree. I wouldn't mind it so much, but it keeps going on, and on. Preston explains that he has a new job as Mr. Macintosh's assistant to his family, and being the idiots they are they believe it. We get more scenes of Preston riding Go-Karts, playing games, hanging with the driver, buying a lot of ice cream, and so on. The movie then finally remembers it needs a plot, and we cut to, I wish I was joking, Preston taking Shay to dinner and then taking her to a geyser and get both of them wet. Meanwhile the villains are asking kids if they knew Preston, and one spills the beans on him, and they chase him down in the park. Preston and Shay get away and the villains are sprayed with the geyser. Preston then celebrates Mr. Macintosh's birthday, but it is his in reality, and soon realizes he has only a little over $330 in his account. Preston's dad comes into Mr. Macintosh's office, and tells him that he wants Preston to have a childhood, and to send him home early. What a hypocrite. Preston sends everyone home, and sits lonely around pondering his speech his dad told him. The villains though break into the home, and Preston needs to fight back. So the movie decides to go and rip off Home Alone with all the traps Preston sets up. The traps are dead ringers of Home Alone and too similar. Eventually Preston is cornered, and just as he is about to be killed, the FBI movie sin and Shay leads the party. The villains are arrested, and then in probably the creepiest moment in cinema history, Shay and Preston kiss on the lips. If this is romantic, the movie is wrong. This isn't romantic this is creepy on every level, and horrifying. I can imagine when parents took their kids to see this, they must have been shocked to see this scene. Shay continues the creepiness by saying she wants to see him in 6 to 7 years later. The FBI doesn't arrest her because? So the movie ends with Preston goes home to his family who celebrate his birthday obviously forgetting he lied to his family. Final Thoughts: I can't imagine why this movie passed as a family comedy. There are too many creepy moments, and the movie is rather mean spirited. The plot is predictable, the characters are flat, the family is negligent, the humor is dreadful, the romance is creepy, and it steals from Home Alone. The only good thing in this move was Juice. Blank Check will leave a blank feeling in you, and you are better off picking up Home Alone then waste your time and money with this.",
         "The summary says it all. Blank Check is just one of those movies. The story follows Preston, a young boy who obsesses over money just as quickly as he spends it. One day Preston is riding his bike around, and thus the story begins. He's struck by a car, and although he's okay the driver hands him a blank check to avoid any trouble. Preston goes ahead and fills in one million dollars for that check and manages to cash it and purchase a house and several other excessively self-indulgent items. The man who hit Preston, Quigley, has a darker and more dangerous history and is far from happy when he realized one million is missing from a money scandal he's involved in. The story follows Preston as his greed with money leads him down a tunnel that grows only deeper and deeper. As he makes up lies for spending so much time at a mansion that his parents don't realize he owns and manipulates others around him, Quigley embarks on a journey to hunt down the man (or boy) that took his money. Blank Check is not realistic and is completely implausible in real life. We all have our own little guilty pleasure movies, whether its Spice Girls or Power Rangers or Rugrats or Blank Check. If this movie doesn't become one of those guilty pleasures, chances are you won't enjoy it and will find it shallow and worthy of several \"Oh, yeah right\"s. Needless to say, this is a good family film. Any parents out there should be able to put up with it and kids 12 and under will probably enjoy it.",
         "Don't waste your kids' time with movies about dreams, building relationships with family, overcoming life's obstacles with the help of best friends, or how they can improve themselves through scholarship or sport! Instead, show your little future corporate CEO or CFO this film and teach them the important values of: * how fun it is to have valuable toys and possessions, including a go-kart track in the back yard, and your own personal waterslide! * how money gets people to do anything you want! * how stealing money's OK, as long as it's from the bad guys! * a fool and his gold are soon parted (and you don't want to lose your money, do you?) * be wary of gold digging women! * you CAN get away with it by lying! An official selection at the Future Corporate Leaders Film Festival, this movie will be one your kids will always cherish.",
         "Blank Check is probably the best film that could've been made from such a materialistic idea, with a warm-hearted aura quietly ghosting around every scene and a collection of competently-handled scenes that make a fairly strong film. The story opens showing a convicted bank robber Carl Quigley (Miguel Ferrer) escape from prison, to which he immediately obtains a million dollars he had hidden for quite sometime. Before long, we meet ten-year-old Preston Waters (Brian Bonsall), who finds himself constantly pushed around by his investment-banker father, who continues to bask in the light of frugality. After receiving a blank check from his grandmother, Preston asks his dad to fill it out, to which he puts down only $11.00. All Preston wants is a little spending money so he can buy some toys and feel like he has some sort of freedom, rather than being confined to anything other than pocket change. One day, Preston is riding his bike in a parking lot and winds up being struck by Quigley, who doesn't have time to stick around and fill out police reports, so gives Preston a blank check and tells it to give it to his father, presumably to pay for the bike since Preston is unharmed. Rather than giving it to his father, Preston recalls the blank check of his grandmother's and decides to cash it for $1,000,000. Before he knows it, Preston is filthy rich at the expense of Quigley, who, along with his goons, now needs to track down a kid while struggling to adhere to his criminal plan. Meanwhile, Preston lives the dream, buying a house, numerous accessories, and all the materials he could ever want. Anyone who says they didn't dream of something like this, or tries to shout at Preston for being materialistic, is ridiculous. Preston's attitude is no different than a lot of us when we were younger, whether we'd like to admit it or not. Not to mention, Preston acts entirely on impulse throughout the entire film, as most of us did when we were younger, providing situational realism. The kid isn't a god-child who would donate all the money to charity, nor is he using his money to try and manipulate and control others. He is a kid acting out his dream of having enough wealth to live without the worries or authority of his parents chiming in and ruining his fun, and I don't know what kid didn't want that kind of security growing up. Blank Check also, some way, somehow, manages to sustain a romantic relationship between a young kid and an older woman in a surprisingly genial, refreshing manner. Early in the film, Preston meets the gorgeous Shay Stanley (Karen Duffy), a bank teller for the bank Preston winds up cashing his check at. Preston quickly falls in lust with Shay, mainly for her elegant conversations and her radiant appearance, and tries to sustain something of a romantic relationship with her, even though all signs point to impossibility. In unsteady hands, this relationship could've been cheap and exploitative. Under the care and attention of director Rupert Wainwright and writers Blake Snyder and Colby Carr emerges a more gentler focus on the relationship, one that isn't haphazardly strung-along by nonsensical one-liners, but deep-rooted intimacy, despite both parties knowing they can't carry this on forever. Finally, there seems to be a lot of criticism with Preston's character being \"a brat.\" If one refers to Preston as a brat, then one must refer to Kevin from the Home Alone serious a brat as well. Preston is a character who simply wants some freedom and some liberties, which are not offered by his parents, so when he finally gets the opportunity to take responsibility and encounters his own finances, he is acting out on one of his oldest fantasies. If he's a brat because he wants a little leeway and space, then I suppose we were all brats at one point. Finally, there's the ending, which, like the remainder of the film, comes under certain scrutiny because the lead character allegedly doesn't learn anything. Blank Check's ending is quiet and low-key, never over-emphasizing the idea that now Preston appreciates all he had back when life was simpler. Had the ending been louder and more sentimentalized, it would still be criticized for its sappy handling of what should've been a quieter ending. The criticism here is especially ridiculous because, surprisingly enough for a Disney movie, Blank Check doesn't embellish its conclusion nor its character. It simply comes to a quiet, personal realization, evident enough for the audience to pick up, and concludes. As far as I'm concerned, the biggest issue with the film is its datedness, seeing as how the house Preston acquires would be enough to bankrupt him alone, even with one million dollars. Starring: Brian Bonsall, Karen Duffy, and Miguel Ferrer. Directed by: Rupert Wainwright.",
         "This is an obvious attempt to rip off 'Home Alone' and 'Richie Rich', which, coincidentally, both star Macaulay Culkin. If Culkin were young enough to play this part, I have no doubt he'd pull it off, if he did play it. In the case of the Home Alone-rip-off, instead of robbers you have money launderers. Preston's family is similar to that of Home Alone's: His brothers hate him (or at least act like they do). You've got all the elements here for a movie about a kid living in an adult world, except for one thing: a child his own age. That is one crucial thing that's never explored or mentioned here. Just think of the comic possibilities of the movie if he were trying to impress someone his own age, or at least slightly older. But those are just suggestions in an otherwise hilarious family comedy! *** out of ****"
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Agelson",
         "Baumgarten"
      ],
      "summaries": [
         "By accident, the 12-year-old Preston is given a blank check and when he fills in $1,000,000 - he is able to get it! He is having fun spending the money, but the gangsters who owned it want it back...",
         "12-year-old Preston Waters is tired of his pain-in-the-butt brothers and stingy parents. One day, a rich but convicted money launderer by the name of Quigley nearly kills him in a parking lot and gives him (by mistake) a blank check. So Preston boots up his computer, makes out the check for one million dollars cash money, comes up with the pseudonym of \"Macintosh\" and starts to spendin'. But Quigley wants his money back -- it was supposed to be cashed by another man with a blank check and handed back to Quigley. Can Preston keep up the facade? Will Quigley and his goons get their money back? And will Preston learn how valuable money really is?",
         "Preston Waters is a 12 year old boy who is sick of his parents always teaching him the value of money. Little does he know, he is about to learn it. When a smart crook, Carl Quigley, nearly kills Preston by running over his bike, he mistakenly fills out a blank cheque, which Preston prints out for $1 Million. Preston convinces the bank manager to cash the cheque, and when Quigley's employee returns to collect the money for Quigley and finds that the bank manager has given it to a kid, Quigley sets out to track the kid down and get his money. Preston creates the pseudonym of 'Macintosh' to handle his finance, and the police get suspicious. Preston begins his spending, but later becomes aware that he must avoid Quigley who is on his back, and the police seperately attempt to work out the mystery behind 'Macintosh'. Will Preston be convinced that money is'nt everything."
      ],
      "budget": 0
   },
   "movielensId": 2036,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-02-11",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Rupert Wainwright"],
      "runtime": 93,
      "movieId": 2036,
      "title": "Blank Check",
      "mpaa": "PG",
      "actors": [
         "Brian Bonsall",
         "Karen Duffy",
         "James Rebhorn",
         "Jayne Atkinson",
         "Michael Faustino",
         "Chris Demetral",
         "Miguel Ferrer",
         "Tone Loc",
         "Michael Lerner",
         "Rick Ducommun",
         "Debbie Allen",
         "Alfredo Huereca"
      ],
      "imdbMovieId": "0109287",
      "originalTitle": "Blank Check",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["2UywepYhTRE"],
      "plotSummary": "Bullied by his siblings and nagged by his parents, 11-year-old Preston is fed up with his family -- especially their frugality. But he gets his chance to teach them a lesson when a money-laundering criminal nearly bulldozes Preston with his car and gives the boy a blank check as compensation. Preston makes the check out for $1 million and goes on a spending spree he'll never forget. Maybe now, his family will take him seriously!",
      "tmdbMovieId": 13962,
      "avgRating": 2.38165,
      "releaseYear": "1994",
      "numRatings": 1221,
      "posterPath": "/y3SHngrd4vb909iwxgPm1ER4NJb.jpg"
   }
}