{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0075807",
      "video": false,
      "title": "Candleshoe",
      "recommendations": [
         16084,
         112170,
         14822,
         42176,
         18660,
         24236,
         27858,
         27566,
         46317,
         37598,
         29882,
         26984,
         85236,
         35262,
         33839,
         4199,
         42473,
         53229,
         43780,
         20301
      ],
      "backdrop_path": "/6NMedeS4pbfsPfhycL3XH3tCH8U.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Priory",
               "gender": 2,
               "credit_id": "52fe46079251416c7506ab01",
               "name": "David Niven",
               "profile_path": "/xslrziGA3B24iQ7BG9IO0ugycDo.jpg",
               "id": 14261,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Casey",
               "gender": 1,
               "credit_id": "52fe46079251416c7506ab05",
               "name": "Jodie Foster",
               "profile_path": "/eAIE6bnOQ8rm0f933gyeAQdIwrP.jpg",
               "id": 1038,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lady St. Edmund",
               "gender": 1,
               "credit_id": "52fe46079251416c7506ab09",
               "name": "Helen Hayes",
               "profile_path": "/6QJDTvIT0v5E9pR1rgPtq59Ej8.jpg",
               "id": 47439,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Harry Bundage",
               "gender": 2,
               "credit_id": "52fe46079251416c7506ab13",
               "name": "Leo McKern",
               "profile_path": "/qcO1TFO6SowLOQAwKRMKrqmrk6A.jpg",
               "id": 7192,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Cluny",
               "gender": 1,
               "credit_id": "52fe46079251416c7506ab17",
               "name": "Veronica Quilligan",
               "profile_path": "/4A2IttJgV4d0qh1wMSxFgFRtoR7.jpg",
               "id": 1144679,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe46079251416c7506ab1b",
               "name": "Ian Sharrock",
               "profile_path": "/ag7ydRu2z6GvVdY1556tr5KHXzt.jpg",
               "id": 1163671,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe46079251416c7506ab1f",
               "name": "Sarah Tamakuni",
               "profile_path": "/3mNN9wfsnNNwDNlLid9sMFIPDHT.jpg",
               "id": 1163672,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Bobby",
               "gender": 2,
               "credit_id": "52fe46079251416c7506ab23",
               "name": "David Samuels",
               "profile_path": "/3xxjnatc3Wzgg3QEbkoMtcU1SNH.jpg",
               "id": 1163673,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Jenkins",
               "gender": 2,
               "credit_id": "57555ed0c3a3685fc4002804",
               "name": "John Alderson",
               "profile_path": "/i80jfydSIHwhe8gpxx3UPsLReV2.jpg",
               "id": 1171862,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Grimsworthy",
               "gender": 1,
               "credit_id": "5755a0be9251417e730000da",
               "name": "Vivian Pickles",
               "profile_path": "/9IPTFdu9SldCL7Obff5Zo5xsvQA.jpg",
               "id": 19616,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mrs. McCress",
               "gender": 1,
               "credit_id": "5755a16a9251417e730000f1",
               "name": "Mildred Shay",
               "profile_path": "/7AOwIKzR8QE6eHjMHSo1r3KrDjn.jpg",
               "id": 1234110,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Mr. McCress",
               "gender": 2,
               "credit_id": "5755a3a2c3a3687b00000125",
               "name": "Michael Balfour",
               "profile_path": "/5MiwiFjIULYYVwmk3SmsptJXZu4.jpg",
               "id": 18763,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Mr. Thresher",
               "gender": 2,
               "credit_id": "5755a425c3a3687ae1000158",
               "name": "Sydney Bromley",
               "profile_path": "/3uUJyYHgedK6K7BLz5RtZ4xpCjg.jpg",
               "id": 12693,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46079251416c7506ab0f",
               "name": "Norman Tokar",
               "profile_path": "/y2hkH0JWWy6iUbxefaxIZDK3yKb.jpg",
               "id": 83413,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46079251416c7506ab29",
               "name": "David Swift",
               "profile_path": "/yDBh4Fv4cwilXTPGhl8FaEmpK7Q.jpg",
               "id": 29715,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe46079251416c7506ab2f",
               "name": "Rosemary Anne Sisson",
               "profile_path": null,
               "id": 158858,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Family",
         "id": 10751
      }],
      "popularity": 3.389262,
      "production_countries": [],
      "id": 14612,
      "vote_count": 33,
      "budget": 0,
      "overview": "Candleshoe is a 1977 Walt Disney Productions live action movie based on the Michael Innes novel Christmas at Candleshoe and starring Jodie Foster, Helen Hayes in her last screen appearance, David Niven and Leo McKern.",
      "similar": [],
      "original_title": "Candleshoe",
      "runtime": 101,
      "poster_path": "/pogrAhq0K0KWEJrym8lyAe7Unbe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1977-12-16",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Tokar"],
      "runtime": 101,
      "synopsis": "Casey Brown (Jodie Foster) is a young girl in her early teens living on the streets in LA. She spends her days roving with other kids around the same age, shoplifting and making general mischief. One night when she returns to her shabby foster home, she finds that her foster parents seem to have sold her out to a suspicious looking man (John Alderson). The man takes her away in a car, and Casey assumes that he is a policeman who will arrest her for her crimes. Casey finds, however, that the man takes her to a fancy hotel and tells her to take a bath. Another man appears and identifies himself as Harry Bundage (Leo McKern). The man has simply delivered Casey to Bundage based on her appearance and two notable scars on her body, which seem to greatly interest Bundage. Casey soon learns that Bundage is a con artist who intends to use Casey in a scam. The scars on her body match those of a little girl who disappeared in the Los Angeles area many years ago; the girl was an English heiress named Lady Margaret who disappeared after being spirited to the United States by her errant father. Bundage needs Casey to pose as this heiress, Lady Margaret, to gain access to Candleshoe, the regal home of Lady St. Edmund (Helen Hayes). While there, she will search for a hidden treasure that was secreted there many years prior by the now-deceased husband of Lady St. Edmund, a pirate named Captain Joshua. Bundage has an advantage because his sketchy sister, Clara Grimsworthy (Vivian Pickles), was once a housekeeper at Candleshoe and discovered a document that gives the first clue for the treasure hunt. Casey agrees, and Bundage takes her back to England to prepare for the ruse. There, she learns about Lady Margaret, and Grimsworthy trains her to remember all the details known about the girl, including all of the foods Margaret liked and disliked. Once they feel she is ready to pull off the con, Bundage arranges a meeting by sending Lady St. Edmund a letter announcing that he thinks he has discovered her granddaughter. The Lady is skeptical, but agrees to a meeting anyway. Bundage and Casey arrive at Candleshoe and are greeted by the butler, Priory (David Niven). After Casey catches glimpses of several other children lurking around the mansion, Priory introduces them to Lady St. Edmund, who invites them to tea and hears Bundage's phony story about discovering Casey. Casey is good at the con game and responds appropriately when Priory tries to fool her into eating food that triggered Margaret's allergies. Casey finally amazes Priory and Lady St. Edmund by revealing that she knows about a secret hiding place in the large fireplace, and when they check, they discover a hidden music box. Casey knows that it plays \"Greensleeves\", and immediately Lady St. Edmund is convinced, weeping and welcoming the child back into her home. Once installed in Candleshoe, Casey learns that the other children at the mansion are from a local orphanage. Peter (Ian Sharrock), Cluny (Veronica Quilligan), Bobby (David Samuels) and Anna (Sarah Tamakuni) all live at Candleshoe and are treated as if they are part of Lady St. Edmund's family. Casey also learns that Priory is literally the only servant in the place, despite the fact that the Lady appears to have no idea of this. Priory wears a series of disguises that he dons in order to convince the Lady that Candleshoe is still financially solvent enough to afford servants. In reality, they are always on the verge of foreclosure, having sold off all of the valuable art and objects in the place and replaced them with copies. Priory and the children do all the work to keep the place running, including selling baked goods and homegrown produce in the market on Saturdays. Casey is hostile at first and is only concerned with finding the treasure. She finds one clue in the library and another written on a tombstone in a graveyard, but Cluny suspects her of being up to no good and attempts to intervene. Casey refuses to help do any of the work, and she comes to blows with Cluny over it. Casey is also hesitant to accept the love that Lady St. Edmund wants to give her as her grandmother, but eventually she begins to soften and realizes that she is accepted into their home and is part of their family. Even Cluny has forgiven her for their scuffle, especially since Casey refused to snitch on her to the Lady. Casey also helps Priory continue his ruse as the various servants, while she gives them sales tips on how to make more money in the marketplace. Suddenly her idyll is interrupted by Bundage, who steals their marketplace money from Casey as she is on her way home. Casey argues that if the steals the money, Lady St. Edmund and the others will be evicted. Bundage tells her that with the place cleared out and the occupants gone, they'll be able to strip Candleshoe and find the treasure. Casey tries to stop him and she gets slammed into a tree by Bundage as he pulls away in his car. As Casey recovers from her injuries in the hospital, she is paid a visit first by Lady St. Edmund and, later, by the other children. They inform Casey that with the money gone, Candleshoe is being put up for sale, and they must return to the orphanage. She initially sticks by her story that she does not know who attacked her, but Casey suddenly has a change of heart and finally tells the truth about everything to the kids, as well as to Lady St. Edmund and Priory. Lady St. Edmund correctly interprets the last known clue, which directed the treasure seekers to a painting that depicted Captain Joshua aboard his ship. Priory, however, has sold the painting to the local antiques dealer, who in turn has sold it that day to a foreign visitor who is leaving aboard a train. The group climbs into the car and races to the station only to find out that the train has left. Undaunted, Lady St. Edmund urges Priory to give chase, and they manage to flag down the train. The painting reveals the final clue of the treasure hunt: the treasure is located in the Grand Hall of Candleshoe, \"under foot\". Returning to the mansion, the group is startled to discover Bundage and his cronies, including Grimsworthy, tearing the place apart. The two groups clash and engage in a protracted battle, which includes Bundage and Priory duelling with swords and the children distracting Bundage's goons. Peter manages to summon the police, who return just as Bundage inadvertently discovers the hiding place of the treasure, which was secreted inside a statue of Captain Joshua himself. With Bundage and his gang taken into custody by the authorities, and with Lady St. Edmund suddenly very wealthy again due to the treasure, everyone is able to return to Candleshoe and be a family once again. Casey, however, packs her bag and leaves the estate without saying goodbye. As she waits at the train station alone, she looks up and sees Lady St. Edmund approaching her, with Priory waiting in the distance. She asks Casey why she is sneaking off, and Casey tells her that she feels guilty for arriving at Candleshoe to swindle her out of her fortune. The deception bothers Casey because now she realizes that she cares for Lady St. Edmund, who has been so kind to her from the very beginning. The Lady says it doesn't matter to her why Casey came to Candleshoe in the first place, she is only concerned about whether Casey really wants to leave. Casey, who has been so cool and calculating before, breaks down into tears. Lady St. Edmund stands and announces that she's taking Casey home, and together they return to the car and drive back to Candleshoe, where the other kids rush out to greet her and welcome her back. The last lines of the film occur when Casey says \"What if your real granddaughter shows up?\" Lady St. Edmund replies, \"Perhaps she already has.\"",
      "writers": [
         "David Swift",
         "Rosemary Anne Sisson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0075807/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2NDUyMzQ5OV5BMl5BanBnXkFtZTcwNjI5OTUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Jodie Foster, David Niven, Helen Hayes | See full cast and crew »"],
      "reviews": [
         "I worked at the Disney Studios when this film was made. It was given a wide showing to Studio employees prior to release. At that time there were no \"main titles.\" We were also given a list of potential release titles, the simple \"Candleshoe\" winning out. The employee comments were overwhelmingly positive and the movie went on to do good business. One reviewer commented that the movie contained a high level of violence for a live action Disney film. It is no more violent than many such Disney movies (just see the final fight in \"Blackbeard's Ghost\" for example). There are several general brawls in Candleshoe, (including the climatic battle between the good guys and the bad guys), but it all done tongue-in-cheek; it is totally unobjectionable, and meant purely for fun. This last \"battle\" is played so broadly in fact that one might even say it nearly goes \"over the top.\" David Niven is wonderful in a variety of roles, from the butler, to a gardener to a retired army colonel. (The role was originally set for Laurence Oliver.) This was the first of two Niven films for Disney, the other being \"No Deposit, No Return.\" The nice thing about \"Candleshoe\" is that it continues to entertain more than 25 years after its release.",
         "I'm not sure exactly why I love this film so much. It's not like it has shockingly wonderful performances, story, or setting. But it never fails to warm my heart and make me smile. Fans of Jodie Foster will recognize her as the young teenage star of this film. She plays Casey, a foster child and juvenile delinquent. A British con man recognizes her as being strikingly similar to a young heiress who disappeared years earlier and offers her anything she wants if she will pretend to be the missing girl. He is certain that there is a treasure hidden in the house of the girl's grandmother, and he wants Casey to find it for him. The story of how Casey becomes a part of this odd British family is heartwarming and sweet. It is classic Disney fare, without the pathetic romance that often destroys modern Disney films. Watch this film if only for David Niven's performance as the butler, gardener, grandmother's best friend, and chauffeur.",
         "I loved this movie as a kid and watched it so much that i had all the lines memorized and wore out the betamax tape. I love David Niven in this movie and it was actually the reason I wanted to see the David Lean movies... my favorite scene is where Lady St. Edmund and Priory share a last dance. Some of the puzzles have remained in my head (For the sunrise student there is treasure among books) and have formed a long-lasting obsession with pirate treasures and real-life hidden treasure stories (oak island and rennes-le-chateau). Too bad movies of this type are no longer being made.",
         "Another Disney classic, a definite for young children and a movie I would recommend for families. The country setting helps this film along as it reinforces the atmosphere being an \"old\" age film, set in the past, but not to far back. The acting by Jodie Foster in this film is delightful to watch as the tomboy cliché is used but to great effect. Another brilliant performance is by David Niven, the butler, but who undergoes changes in his personality to acquire different identities as to accompany his mistress in disguise, giving her a sense of many friendships. Any fight scenes are classically in Disney fashion, amusing and inventive defences and preceding this, even a car chase magnificently manoeuvred by Mr. Prairy the butler (Niven)and much to any child's delight. A film guaranteed to be loved by young children and even appreciated by the open-minded of older years but without a doubt, a family film enjoyed by all the family, including the grandparents!!",
         "Possibly one of the best family films ever made by Disney. Jodie Foster is brilliant as the wayward teen who's going nowhere. Even at that early age you can see why she has gone on to become one of Hollywoods most successful actresses - she's definitely underrated. Candleshoe is packed full of memorable one liners that just stick with you for months, even years, following watching this film. I grew up watching it and have never stopped! Also, 'Grandmother's' accent is perfect, considering the actress herself is American. Watch this film, you won't be disappointed! Unfortunately I had to surf the Net and order it from America to get hold of my copy, but if you DO find it to buy, don't hesitate.",
         "This is one of those movies I know inside out after watching it on HBO every time it was on (which was quite often). These live-action Disney flicks don't seem to get a lot of attention nowadays, but when I was a kid I was more into movies like \"Candleshoe\" than the animated Disneys. Obviously the charm of \"Candleshoe\" is the talent involved. Helen Hayes and David Niven are on hand, and Jodie Foster is splendid as the American orphan who becomes part of a con man's plot to swindle Hayes's Lady St. Edmund out of a fortune that is hidden somewhere in her very own manse. Goaded by Leo McKern, Foster poses as Hayes's long-lost granddaughter in order to gain admittance to the mansion, where she must follow up on a series of clues regarding the hidden treasure's location. Although definitely made for kids, the best thing about \"Candleshoe\" is that it's just as fun watching as an adult. The plot has a certain giddy excitement to it--after all, who could resist a treasure hunt in an old mansion?--and David Niven's many disguises are pretty funny (especially his grouchy Scottish gardener who has an amusing argument with Lady St. Edmund). The other kids in the movie are enjoyable, too. What really strikes me about the film today are the two surprisingly adult scenes between Hayes and Foster. The way Hayes wins over the distant Foster is a little abbreviated, but the film's denouement between the two of them at the train station is genuinely touching.",
         "This movie is the movie that made me truly fall in love with jodie foster! I don't particularly know why but there is just something about her in Candleshoe that is different from even \"Freaky Friday\". The acting in this movie is generally very good, with stars like David Niven and Helen Hayes (Of course Jodie), to liven up the cast. This movie is great for younger and older audiences! The fight scene at the end is a bit long, but other than that the movie is awesome!",
         "This film has become cult viewing amongst the students of Birmingham, England, with its quirky Disney humour, its cracking one-liners (they're nice and squashy! whats grandmother going to say when she finds out! better take the garlic! ) top performances, (why did Bobby never work again? ) and a storming soundtrack by the fantastic Ron Goodwin! Parties of students have been found wandering through the Warwickshire countryside on a pilgrimage to Compton Wynyates, aka Candleshoe!The walk was 26 miles in the rain but everyone agreed that it was definitely worth it!!!Candleshoe is quite possibly the best film ever made and Disney at its finest!!!!",
         "Before this vehicle became contrived, Disney did it while it was still fresh. A group of orphans must save the castle in which their adoptive \"grandmother\" has housed them. This work involves some intrigue and a very young Jodi Foster as a nearly incorrigible ruffian girl. This is a lot of fun, but it also bears some touching moments, endearing characters, and a great script. Honestly, this is one of my favorites of the Disney Family series. It offers you hope, love, and a promise of better things to come. This is truly good. It rates an 8.9/10 from... the Fiend :.",
         "One of Jodie Foster's first roles, but she succeeds brilliantly despite a script with some corny verbatim. Very tomboyish but still gorgeous and her demeanor and acting ability far surpass her years. Niven is great fun playing several roles, all while trying to keep a straight face. Fight scene near end perhaps a bit overlong and typical, but maintains some humour. Average script is made up for with strong, tender performances in a children's movie (which probably only appeals to adults, now)which surprisingly is not emotionally manipulative. 7/10"
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["Small-time crook Harry Bundage discovers that the old manor house where Lady St. Edmund resides, with three orphans and her butler Priory is the resting place for a hoard of treasure. Unfortunately, he doesn't know where it is. Bundage recruits urchin Casey Brown to dupe Lady St. Edmund into thinking that she is her long-lost granddaughter, so she can search for clues to the location of the treasure. Unbeknownst to Bundage AND her ladyship, Lady St. Edmund is flat broke, and Priory and the children help her ladyship try to keep her home and pride. Joined by Casey, they do all the chores and Priory acts as the butler, gardener, chauffeur and an old major all at the same time!"],
      "budget": 0
   },
   "movielensId": 2037,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-12-16",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Norman Tokar"],
      "runtime": 101,
      "movieId": 2037,
      "title": "Candleshoe",
      "mpaa": "PG",
      "actors": [
         "David Niven",
         "Jodie Foster",
         "Helen Hayes",
         "Leo McKern",
         "Veronica Quilligan",
         "Ian Sharrock",
         "Sarah Tamakuni",
         "David Samuels",
         "John Alderson",
         "Vivian Pickles",
         "Mildred Shay",
         "Michael Balfour",
         "Sydney Bromley"
      ],
      "imdbMovieId": "0075807",
      "originalTitle": "Candleshoe",
      "genres": ["Family"],
      "youtubeTrailerIds": [],
      "plotSummary": "Candleshoe is a 1977 Walt Disney Productions live action movie based on the Michael Innes novel Christmas at Candleshoe and starring Jodie Foster, Helen Hayes in her last screen appearance, David Niven and Leo McKern.",
      "tmdbMovieId": 14612,
      "avgRating": 3.32505,
      "releaseYear": "1977",
      "numRatings": 463,
      "posterPath": "/pogrAhq0K0KWEJrym8lyAe7Unbe.jpg"
   }
}