{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "alien",
            "id": 9951
         }
      ],
      "imdb_id": "tt0077305",
      "video": false,
      "title": "The Cat from Outer Space",
      "recommendations": [
         14822,
         17984,
         27201,
         22777,
         31654,
         15943,
         5762,
         39526,
         14821,
         32014,
         75686,
         19762,
         18966,
         119617,
         84289,
         24032,
         16249,
         16191,
         18660,
         18446
      ],
      "backdrop_path": "/x0j1R4L1tNAawTlyhgVdTIJuFBk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c5b",
               "name": "Ken Berry",
               "profile_path": "/i8fHfRK4668hqSxWfSEd1l6nh5Z.jpg",
               "id": 35031,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Liz",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6c5f",
               "name": "Sandy Duncan",
               "profile_path": "/AuNmo9KppBRuHQpyAiSELrZ0R7A.jpg",
               "id": 88947,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gen. Stilton",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c63",
               "name": "Harry Morgan",
               "profile_path": "/xQlBwecEQEz84k7jDLPGi6FqxRJ.jpg",
               "id": 4073,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Stallwood",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c67",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Link",
               "gender": 2,
               "credit_id": "5587c052c3a368274c006963",
               "name": "McLean Stevenson",
               "profile_path": "/cYz9UEZHUUKuy7DCxSMvcQhnKEe.jpg",
               "id": 151298,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Earnest Ernie",
               "gender": 2,
               "credit_id": "5587c0649251417f6f006e68",
               "name": "Jesse White",
               "profile_path": "/5q5wzKTgFEzjYHYQybm1OHi6ivk.jpg",
               "id": 93664,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dr. Wenger",
               "gender": 2,
               "credit_id": "5587c07692514179f600361b",
               "name": "Alan Young",
               "profile_path": "/n7JSQURI4ldcPXViQVkLpdhM6q2.jpg",
               "id": 21874,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Dr. Heffel",
               "gender": 2,
               "credit_id": "5587c08ac3a368274c006967",
               "name": "Hans Conried",
               "profile_path": "/7JnEMvdZEoA1uumb0HG2qKFh6ZP.jpg",
               "id": 16421,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "1st E.R.L. Expert",
               "gender": 2,
               "credit_id": "5587c0ef9251411efc00056c",
               "name": "Roger Price",
               "profile_path": null,
               "id": 111384,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "1st NASA Scientist",
               "gender": 2,
               "credit_id": "5587c1359251417f6f006e7d",
               "name": "Gil Stratton",
               "profile_path": "/l6k4C7xKynP01LUYZIfv2PZWxu3.jpg",
               "id": 9114,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Presiding Judge (uncredited)",
               "gender": 2,
               "credit_id": "5587c146c3a36837e9005c7c",
               "name": "Sorrell Booke",
               "profile_path": "/4LuFV048VmqjbM98UWklsetsq60.jpg",
               "id": 40191,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6c6d",
               "name": "Ron W. Miller",
               "profile_path": null,
               "id": 12863,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c73",
               "name": "Norman Tokar",
               "profile_path": "/y2hkH0JWWy6iUbxefaxIZDK3yKb.jpg",
               "id": 83413,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545a91d7c3a3682600000b4a",
               "name": "Ted Key",
               "profile_path": null,
               "id": 1242735,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58070aa4c3a3684e5400e4ef",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58070aaa9251415a7a01104a",
               "name": "Charles F. Wheeler",
               "profile_path": null,
               "id": 12119,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.161383,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19378,
      "vote_count": 35,
      "budget": 0,
      "overview": "A UFO is stranded on earth and impounded by the US government. Its pilot, a cat with a collar that gives it special powers, including the ability to communicate with humans, has eluded the authorities and seeks the help of a scientist in order to reclaim and repair his ship and get back home.",
      "similar": [
         602,
         840,
         20424,
         831,
         10200,
         49849,
         348,
         601,
         126889,
         228161,
         16866,
         401513,
         10122,
         234004,
         8077,
         8836,
         2675,
         118340,
         607,
         608
      ],
      "original_title": "The Cat from Outer Space",
      "runtime": 104,
      "poster_path": "/vznPPaLYFr4GPL0Uh9wKwThTyNv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1978-06-09",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "A close encounter of the 'furred' kind!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Tokar"],
      "runtime": 104,
      "synopsis": "The film begins with some strange night in the countryside. A spaceship lands onto a farm because it has had technical problems in the middle of the night. The farmer goes to see what has happened with a loaded shotgun. Voices are heard: an alien had to perform an emergency landing, and it has a limited time, up to 11:15 to solve the problem, because there won't be another spaceship in the Earth area for another 150 years. The army arrives immediately. They take the spaceship but they don't see the cat. They are interested in knowing what kind of energy it uses. Jake travels with the military men without anybody realising that he was there. The army asks for some scientists' help, including Frank Wilson (Ken Barry). He makes some fun comments, comparing the spaceship to an artichoke and saying that mayonnaise may possibly make it work. The female scientist, Liz (Sandy Duncan) feels outraged because of Frank's inadequate comments. When they are left alone, the cat (Ronnie Schell's voice) talks to Frank, and the first comment the cat makes is that Liz is obviously interested romantically on him. The cat says by telepathy that his name is SonarJ5amillion and something else - let's shorten it to Jake - and it says that his collar amplifies brainwaves. To make a demonstration, the cat moves with the power of his brain a cello and a he plays some music, turning the pages at the same time. Frank offers to try to mend Jake's spaceship. Frank also asks whether he could use the cat necklace and he is able to make himself levitate. A friend of Frank called Link (McLean Stevenson) arrives to see a Lakers basketmall match, because he has bet a lot of money on the Lakers. Jake makes the ball move through the basket to score the final winning point. Then Liz appears, and she sets a date \"for a picnic\" with Frank. Liz also brings Belle, her own lady cat, and recommends Frank to take Jake to the vet who lives in their building, which specializes on cats. Frank agrees and leaves quite abruptly. Jake is in a hurry: he only has 36 hours. Frank takes Jake in his arms and they get into the military building. They are discovered by a hounddog, but Jake freezes the dog and the military man with the power of his collar. They enter the spaceship and Jake tells Frank how to start the engine, which means that now he knows how that \"artichoke-shaped\" thing works. Frank gravitates because of the energy. A white-suited man, Mr Stallwood (Roddy McDowall) is following Frank and Jake, making funny faces while Frank gravitates. Jake has found the problem, he needs some weird thing nobody has heard about. Through a description of it, Frank realises that gold has that same atomic weight. Another MP officer (Hank Jones) has discovered the frozen soldier, so he rings the alarm bells. Everybody gets frantic. The second MP officer tells them that there is a cat intruder, and that he has found his necklace. Jake jumps, passes through the necklace, and leaves with it in Frank's lap. Jake makes Frank's moped to fly over the military lorries. Jake needs 150,000 dollars worth of gold to make his spaceship work. Link interrupts Jake and Frank once again: he has bet 150 dollars on Sweet Jake, a horse. His wife is listening to the music of the Metropolitan Opera, that's why he needs to see the race on Frank's tv set. Jake decides to bet to get the money and buy the gold. Link is going to bet on the football match's game, so Jake decides to associate with him to bet on that evening's three matches. Frank explains the situation to Link, but Link thinks that he's crazy. A man is recording the three oof them from the window balcony. Jake makes the beer go back to the can with the power of his diamond collar. Link thinks it's a bad practical joke from Frank and gets angry with him, wanting to leave to see the Metropolitan Opera concert. Link doesn't want to hear anything else, but Jake makes him gravitate. Earnest Ernie (Jesse White) and Honest Harry (Tom Pedi), accept Link's multiple bet. General Stilton (Harry Morgan) has discovered Frank Wilson's fingertips, so he thinks he is some kind of spy. Liz arrives to go on the picnic. Frank has forgotten all about it. She insists on treating Jake's allergy, so she calls Dr Wenger (Alan Young), who is taking care of Jake but is more interested on the American football match. Meanwhile, Link and Frank are interested only on the match. They get nervous when they are about to lose the game. Jake avoids the disaster, but dr Wenger gives a tranquilizer shot to Jake, who passes temporarily out. Link and Frank go out being watched by the military, who think that the maffia may get involved. They try to step back on their bets, because with Jake out, they know they will lose. They have to tell Liz what's happening, because she insists on not l etting them go to the betting shop. Link will bet on a snooker game between Weasel (Ralph Manza) and Liz, who doesn't even know how to play the game. They take sleeping-out Jake with them. While Liz plays, Frank tries to use the collar. The ball jumps all over the shop. Tuna is Jake's favourite food. One of the onlookers is eating a tuna sandwhich, and its smell wakes Jake up. Earnest Ernie doesn't want to accept such a crazy bet. Frank says that he will bet his last bet: 60 dollars 2,000 to one, because Liz will play blindfolded, giving Weasel 12 strikes in advance and winning in only one strike. Honest Harry tells Ernie that his reputation will suffer if he doesn't back up a bet he's just bet. Jake keeps on moving Weasel's ball. Weasel's advancing moves. It's Liz's turn, who plays blidfolded. Jake moves the ball so that the incredible win happens. Earnest Ernie is left crying. Mr Olympus (William Prince) is seen sat, from the back - the same as the bad guy in Inspector Gadget- Then he stands up and we can see him. Stallwood shows him his recording. He asks Mr Olympus for some extra money if the collar allows Mr Olympus to conquer the world. The computer analyses the information and it gives the result that a cat must be the driver of the spacecraft. General Stilton and Colonel Woodruff (Howard T. Platt) finally realise that the thing about the cat must be true. The General thinks about a conspiration when he hears that Frank Wilson has bought a huge quantity of gold. The General and Woodruff try to arrest Frank, but Jake freezes them. Jake reduces to gold in size, so that it has the shape of a pen, but it's still very light. They take the General's clothes to get into the military base in disguise. There is only an hour left. The General Stilton wakes up in his underwear. Woodruff giggles. Frank takes Jake onto the spaceship, and he replaces the gold element in the spacecraft. Jakes calls the flagship. General Stilton and Link arrive to the base almost at the same time. Link warns Frank of Liz's kidnap. Frank insists that Jake leaves for home, and Frank and Link will take care of the problem with Liz. The spacecraft leaves without Jake, who jumpos onto the car with Frank and Link. The spacecraft leaves without direction. They all go to Bailey's air park, where Olympus and Stallwood are with Liz in a helicopter. Olympus wants to jump with the only parachute in the helicopter, but Stallwood holds onto him for dear life. Liz is on her own on the helicopter. Liz holds onto Frank, who is handing from the helicopter. Jake moves the helicopter so that they can jumpo onto the plane, but finds himself also distracted by Belle, Liz's female cat, whom he's trying to seduce. Jake asks for the American nationality. Jake makes the judge levitate. Link, Liz and Frank attend the ceremony.",
      "writers": ["Ted Key"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077305/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0MTAzNzkwMV5BMl5BanBnXkFtZTcwMjYyNDYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ken Berry, Sandy Duncan, Harry Morgan | See full cast and crew »"],
      "reviews": [
         "This movie was one of my earliest memories of childhood and a fond one at that. This was Disney making a sci fi movie fit for children, it's cute, it's campy, it's not meant to be an Oscar-grabbing masterpiece of acting, effects, or even plot. If Disney had produce the pinnacle of special effects, acting and storyline for its day, everyone would trash it as being either too complex, or unsuitable for children. Disney makes movies for kids, that's what they do. Deal with it. Kids would be frightened by a true alien being, so a cat is a suitable substitute, makes for a warm cuddly visual even. The story had to be simple or kids wouldn't and couldn't follow it. Those who want to critique this film as though it were high art need to get over it. If a 6 year old needs to be handed Masterpiece Theater to properly entertain them, there is something very wrong indeed.",
         "Wow, now this is certainly a rarity \u0096 a talking animal flick that doesn't rely on that moving-mouth-n-lip-synch gimmick which has really been dogging the genre of late (bad pun on my part, I know). Sure, the only thing we can attribute this merit to is its age \u0096 as others round here have already pointed out, were this movie shot in this day and age the overused and overplayed technique would have undoubtedly been employed. I also imagine that, at some point during the running time, they'd have Jake spit up a big slimy hairball, mark his territory over some sucker's flowerbed, and stick a leg in the air so he can lick at his crotch \u0096 along with any other animal bodily function they could swipe a gag out of. It's one of those reasons why, for all its skimpy production values, 'the Cat from Outer Space' is now such a refreshing blast from the past \u0096 in an era swamped by crude, flashy animal movies made exclusively for the under-12 market, this is comes across as quite a pleasant piece of nostalgia, harking back to the good old days when the humour was always clean, and any critter who wanted to wrap their tongue around the English language did so the conveniently telepathic way. (Yikes, I'm starting to sound like a right old whinger here, which really I'm not, but that's just how jaded I am). As a stand-alone film, TCFOS is very much a cheesy but warm-hearted affair and, for fans of all things sublime n' feline like myself, this was a childhood classic growing up in the 1980s. Back then, it always qualified as my runner-up pick for Disney's coolest live action feature, second only to the original 'Incredible Journey' (yeah, I *did* watch Mary Poppins', but never really got much further than the animated sequences \u0096 it just got boring after that). I happened to come across it on my shelves recently, having left it undisturbed for several years, and decided it was time for a revisit. The worst thing about it is inevitably the title (which just screams 'B Movie!', don't it?), only just managing to pip some of the flat and, quite frankly, irritating human characters on display to the post, who've more-or-less accepted that churning out even Oscar-worthy performances ain't gonna spare them from being upstaged by the four-legged favourite. Sandy Duncan in particular portrays a bimbo so staggering it'll make your jaw drop that she even made it into the paranormal research department (plus, she believes all of Frank's lame excuses \u0096 yikes, how dumb is she?). Then there's that spy character who insists on speaking with such loathsome smarminess not seen since 'the Shop Around the Corner', you could break your TV screen trying to sock him one in the mouth. The best things about TCFOS, oddly enough, owe a lot to the retrospectives we have after 26 years. Jake is definitely entitled to feel smug that he was getting himself stranded on planet Earth, amongst all the typically hostile folks, and making his human ally's bicycle fly *four freakin' years* before ET showed up on the scene (is that uncanny or what?). Not to mention the casually conniving fashion in which Jake goes about trying to secure his way back home, somehow managing to involve rigged sports games along the way; ethics so dodgy by today's standards that really you gotta love it. And the special effects are now so crude and outdated that, well, they're cute! Jake is undeniably the star of this vehicle, churning out all the better lines of dialogue, and this is such an endearing story deep down that it's all too bad that the script never delves particularly deeply into his friendship with Frank (after all, ET's major trump card was always his lump-in-the-throat relationship with Elliot), choosing instead to skim through the character interactions at such a pace that the film never really has the chance to deliver any true emotional wallop. I did also get a kick out of reading the previous comment concerning the body language of the feline double act playing Jake, and will verify it all the way \u0096 pay close attention to the climax in particular, and note that the poor kitty currently on the scene looks positively bewildered! Sure, it's imperfect and now that I'm older I can see where the faults lie a lot more than I used to \u0096 but still, it's a likable and evocative romp, and personally I'd much rather be subject to this than to recent animal conspiracy theory trash like 'Cats and Dogs' or 'Good Boy!', any day. A real treat for cat lovers everywhere. Grade: B-",
         "A spaceship makes an emergency landing on Earth and the pilot -a talking cat- run into spies, the army, Ken Berry and Sandy Duncan in his mission to get back home. Exciting for youngsters, if not as funny as the average Disney-comedy. A nice cast (with support from the likes of McLean Stevenson, Harry Morgan and Roddy McDowall) although Ken Berry has always seemed like the guy they get if Dean Jones has better things to do. Worth mentioning is it's great finale with some impressive stunts thousands of feet above the ground. Noted for being veteran Disney-director Norman Tokar's final film (he died the following year).",
         "This is one of my all time favorite childhood movies. (Another was a movie about a robotic dog named C.H.O.M.P.S. another great family movie.) I am 33 now but was 6 years old at the time when this movie first aired. I remember watching The Cat From Outer Space back home on my parents big wooden Zenith console TV set. (Yeah those were the thing to have back then\u0085 That was a time where there weren't any VCR's or cell phones. There certainly weren't any DVD's or flat screen TV's.. In fact the only flat screen I remember was the super 8 motion picture roll up screen my dad dragged out into the living room when we wanted to play the silent 8 mm motion picture movies we took of our vacations\u0085 Ahh yester-year.) For years I had this stuffed cat (that kind of looked like Jake). I also had this toy plastic ring toss set. I used one of the rings from the set and it fit perfectly on the stuff cat I had. For years (as a child) I was able to play The Cat From Outer Space at home with my home made figure to represent Jake. This movie has stood out for me since I first saw it as a child and now today I still look back on those years with fond memories. This movie is definitely a charming lighthearted tale (or should I say tail) and I certainly recommend it for the young and adult alike.. It's a movie that all can watch, love and enjoy. It's a movie that also has some of the actors that were big at that time.. Sandy Duncan, Roddy McDowall.. To name a few were big stars at that time\u0085 Their acting is timeless in this movie classic. OK So if you like family movies and have a soft spot for fun and youth in your heart\u0085 Get the kids together (or just pretend you're a kid again yourself) and have a great time watching, The Cat From Outer Space. Rob.. NYC",
         "The Cat From Outer Space was a troubled shoot, with a severe personality clash between it's two stars. The film involves, as you might guess from the title, a cat. From outer space. Except the cat, \"Jake\", looks suspiciously like an Earth cat. If this were modern-day Disney then sophisticated CGI would be used to at least make Jake's mouth move. Yet this was 1978 and we had to settle for Jake being \"telepathic\" and looking in vaguely the right direction. But while Jake \u0096 played by two cats, a boy and a girl \u0096 may act on cue, his body language tells a different story. Whenever he/she is picked up by Frank (Ken Berry), Jake's tail flashes furiously, despite the on-screen buddy-buddy nature of their relationship. I don't know what Berry made of Jake, but it's obvious the cat wasn't his biggest fan and didn't like being handled. I imagine that Hollywood egos came into effect, Jake demanding a bigger trailer. The sex, the drinking, the catnip. Finally, his claim that \"I'm worth $20 million a picture\" would have sunk his movie star prospects. Berry went on to appear in Featherstone's Nest, The Golden Girls and The Legend of Forrest Tucker. For Jake (Rumpler/Amber), this amiable, likeable family comedy was the only role in his short-lived career. FILM'S LASTING INSPIRATION: A scene where Jake the alien cat is in the basket of a (motor)bike ridden by Frank and makes it fly in the air to avoid capture. Mr. Spielberg, were you watching?",
         "I still list this classic from my \"kittenhood\" as one of the best of it's kind. Just a must see for cat lovers, and animal lovers of all kinds. Just really cute story, very funny and all around great for kids of all ages! If you have not seen since were a kitten maybe you need to see it again. If have not seen it then see it! It's Disney so how can you go wrong? I wish they would do more like this. I mean sure they did Cats and Dogs and have done others but non that deal with space Cats or such, not in long time. Meow!",
         "This movie is just fun. No serious plot, just an enjoyable movie with some really wonderful actors. If anyone has kids, enjoys cats, or just likes a lighthearted film, see this one. This movie is the reason we named our cat \"Jake\" not because of his looks, but because of his intelligence (from another world you might say).",
         "This was the first movie that I ever *remember* seeing. It stands out in my mind (and yes probably has clouded my viewing judgement for years) because it was the first film to ever feature the mode of moggy that has been my constant companion for over 25 years - The Abbysinian. An Abby was the perfect cat to play Zunar-J5/9-Doric-47 (or Jake for the non fanatics out there). Being three years old and the proud owner of one of the first Abbys in Australia - I remember for days after putting different collars on my very patient cat Tawney and begging him to talk to me. He obviously didn't, and it broke my little heart, but what he couldn't express verbally he more than made up for with his smooches and furry nudges. Ok the Film never won an Oscar, it was a Disney Kid flick, but as kid flicks go - it was all right. And lets face it - I can't be all bad, McLean Stevenson, Harry Morgan AND Roddy McDowell! Now if I could just find out who did the voice of Jake!",
         "I've watched this movie when I was a kid and loved it, now I'm 25 and I watched it again yesterday and loved it even more! OK, so it might be simplistic and naive, but it's good old-style Disney. OK, so the cat who comes from a Galaxy far far away looks exactly like an Earth cat, and speaks perfect English. So what? You can't spend 1 hour in a 1 and a half hour film showing the cat and the human trying to \"understand each other\" and a \"universal translator\" would be just as stupid. So forget that, accept it, and enjoy the story! Some of the funny stuff probably works better for kids then for adults, but it still makes you smile. The cat talks, but no stupid and ugly 3D/puppet moving mouth, just good old fashioned training and snacks behind camera to make him \"act\" perfectly! And he does: a close-up on his face and his stare makes you BELIEVE that he is talking. There are some goofs and some mistakes, sometimes you see a puppet-cat (for stunts!)which is obviously a puppet, but it's still a very enjoyable movie for all ages! I just wish they made more of these films now!",
         "I have been slowly introducing my children to the great Disney family movies of the 70's. They were a little hesitant to watch this movie stating, \"Not another one of Dad's old movie favorites\"! But time and time again, they find themselves laughing out loud and realizing why this and others (Snowball Express, Blackbeard's Ghost, Herbie Rides Again, Shaggy D.A.) are family classics. This one was extra special because it starred a lovable pussycat who happens to be, \"From Outer Space.\" Oddly enough, our cat Aslan, watched this movie from start to finish. The kids all joked that it was, \"his favorite movie.\" Our children need more movies like this one! Fun, light-hearted comedies with family-oriented values and an interesting storyline that stimulates the imagination."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["A UFO is stranded on earth and impounded by the US government. Its pilot, a cat with a collar that has special powers, including the ability to allow the cat to communicate with humans, has eluded the authorities and needs the help of a man named Frank in order to reclaim and repair his ship to get back home."],
      "budget": 0
   },
   "movielensId": 2038,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-06-09",
      "dvdReleaseDate": "2004-07-06",
      "directors": ["Norman Tokar"],
      "runtime": 104,
      "movieId": 2038,
      "title": "The Cat from Outer Space",
      "mpaa": "G",
      "actors": [
         "Ken Berry",
         "Sandy Duncan",
         "Harry Morgan",
         "Roddy McDowall",
         "McLean Stevenson",
         "Jesse White",
         "Alan Young",
         "Hans Conried",
         "Roger Price",
         "Gil Stratton",
         "Sorrell Booke"
      ],
      "imdbMovieId": "0077305",
      "originalTitle": "The Cat from Outer Space",
      "genres": [
         "Comedy",
         "Family",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["Na0M_gmoUOg"],
      "plotSummary": "A UFO is stranded on earth and impounded by the US government. Its pilot, a cat with a collar that gives it special powers, including the ability to communicate with humans, has eluded the authorities and seeks the help of a scientist in order to reclaim and repair his ship and get back home.",
      "tmdbMovieId": 19378,
      "avgRating": 2.90364,
      "releaseYear": "1978",
      "numRatings": 1292,
      "posterPath": "/vznPPaLYFr4GPL0Uh9wKwThTyNv.jpg"
   }
}