{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "mission",
            "id": 10364
         }
      ],
      "imdb_id": "tt0082199",
      "video": false,
      "title": "Condorman",
      "recommendations": [
         12236,
         55699,
         210599,
         26340,
         24585,
         26603,
         34014,
         35432,
         19596,
         27549,
         206729,
         21366,
         122894,
         36859,
         48302,
         3145,
         50627,
         18520,
         9651,
         33521
      ],
      "backdrop_path": "/uguyv5Y3x2Bi2Y1JLpo9uCJGIS3.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "572272d2c3a3682d3700049e",
         "content": "This one was a lot of fun and much better than it had any right to be. I remember reading the book, oddly enough, when the movie came out, but didn't bother with the movie at the time. A shame, really, for I had loved Michael Crawford in the British TV series 'Doctor in the House', when I was a kid, and Oliver Reed and Barbara Carrera always offer great value to the cinephile.\r\n\r\nWorthy of respect, especially if you have kids around. A Disney live-action movie that hasn't aged half-badly.",
         "url": "https://www.themoviedb.org/review/572272d2c3a3682d3700049e"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Woody",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c97",
               "name": "Michael Crawford",
               "profile_path": "/mjHIQxrulLGCoqn6JrvCdPn7Apa.jpg",
               "id": 19610,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Krokov",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6ca1",
               "name": "Oliver Reed",
               "profile_path": "/we10IusqRV1NHRtA68ftyck2N33.jpg",
               "id": 936,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Natalia",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6ca5",
               "name": "Barbara Carrera",
               "profile_path": "/zmuNNytZ5w3ewWC6ShWeqFZl49c.jpg",
               "id": 10938,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Harry Oslo",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6ca9",
               "name": "James Hampton",
               "profile_path": "/bVes3w8EelatQe7yuJ2OiNL8QOG.jpg",
               "id": 14848,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Morovich",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6cad",
               "name": "Jean-Pierre Kalfon",
               "profile_path": "/70bQNgL8PAhTybJp6QfjsmGwvVR.jpg",
               "id": 16350,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Russ Devlin",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6cb1",
               "name": "Dana Elcar",
               "profile_path": "/8qDt9Rl10UCGnUtOZvlCwZiHTHI.jpg",
               "id": 37712,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Russian Agent",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6cb5",
               "name": "Vernon Dobtcheff",
               "profile_path": "/lcPki2IDdmRvqiBbv2RUBfgm3IH.jpg",
               "id": 649,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "CIA Chief",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6cb9",
               "name": "Robert Arden",
               "profile_path": "/l8lx4yA8IQtgxPsd47p9dnoPWgQ.jpg",
               "id": 535977,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c9d",
               "name": "Charles Jarrott",
               "profile_path": "/7A1eMGphk8p1bEs7VsRHjfjNuKu.jpg",
               "id": 29646,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6cbf",
               "name": "Marc Stirdivant",
               "profile_path": null,
               "id": 72944,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6cc5",
               "name": "Henry Mancini",
               "profile_path": "/sXl1lCYNnSf10ESG1nyCEDYGs1L.jpg",
               "id": 1938,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6ccb",
               "name": "Charles F. Wheeler",
               "profile_path": null,
               "id": 12119,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6cd1",
               "name": "Gordon D. Brenner",
               "profile_path": null,
               "id": 68134,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6cd7",
               "name": "Albert Witherick",
               "profile_path": null,
               "id": 571680,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6cdd",
               "name": "Ron W. Miller",
               "profile_path": null,
               "id": 12863,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 3.983419,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19379,
      "vote_count": 43,
      "budget": 0,
      "overview": "Comic artist and writer Woody performs a simple courier operation for his friend Harry who works for the CIA. But when he successfully fends off hostile agents, he earns the respect of the beautiful Natalia, who requests his assistance for her defection. Woody uses this request as leverage to use the CIA's resources to bring his comic book creation, Condorman, to life to battle the evil Krokov.",
      "similar": [
         1924,
         1452,
         155,
         141052,
         8536,
         9531,
         40662,
         379291,
         13640,
         24428,
         272,
         364,
         11253,
         49521,
         99861,
         297762,
         299534,
         209112,
         30061,
         382322
      ],
      "original_title": "Condorman",
      "runtime": 90,
      "poster_path": "/abgxJPCU2AAxP4kSdvdWCU6qr6r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1981-07-02",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "An action adventure romantic comedy spy story.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Jarrott"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Marc Stirdivant",
         "Robert Sheckley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082199/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNjAwODY0NF5BMl5BanBnXkFtZTcwNjAxOTUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Crawford, Oliver Reed, Barbara Carrera | See full cast and crew »"],
      "reviews": [
         "I love this movie. I grew up watching Condorman and I always think of it with fond memories. The special effects may not be the best; however, the movie is over two decades old, and I think the effects are quite adequate. Besides, the movie is not supposed to be realistic, but rather it is a comedy with action elements. It provides a window into what people worried about in the early eighties; Cold War espionage is a major part of the story. Overall, it is charming and is a feel-good movie. It has all the classic elements: good verses evil and boy meets girl. It is a quality family movie and I would recommend this film to all who are young at heart.",
         "Forget Ben-Hur. Forget Casablanca. Forget The Godfather. Forget them all. Condorman is the greatest movie of all time. The epic story of the larger-than-life hero Condorman, brought to life by comic book writer Woody, a common man. When he is asked to partake in a secret mission of helping a beautiful Russian agent called \"The Bear\", but known passionately to Woody as Natalia, defect to the United States. Things go awry when the evil Russian Krokov sends the deadly assassin Morovich and his deadly Prognoviach. But just when Krokov thinks that \"the best kept secrets of Woodrow Wilkins can be found by any small child for the price of a tiny coin\", Woody uses one of his many disguises to fool Krokov. An amazing boat escape is the climax of this epic. So, order yourself a Triple Istanbul Express and sit back and enjoy the greatest single piece of art ever.",
         "If the best James Bond movie had a \"G\" rating, it might very well have looked liked \"Condorman\". It has all of the cool gadgets, world-wide locations, a sexy femme fatale, creepy Russain villains, and best of all, some of the coolest car and boat chase sequences on film. Keep in mind that this is a kids movie, so the humor level is elementary, but nonetheless funny. The acting is over-the-top and cartoonish, but regardlessly enjoyable. Everyone looking for a fun, fast-paced adventure movie should check out this movie.",
         "I grew up with this film and must have watched it at least 20 times and i still do sometimes. It stars michael crawford who takes his persona of frank spencer and adds an American accent as a cartoon artist who helps a friend who works for the CIA with a job. Anyhows this is merely an excuse for some fun with jokes and some really cool action sequences (the bit with the Porsche's is excellent) think james bond for kids. There is also a bit of romance but nothing to worry about, it really is just a great film for kids. (okay and adults)",
         "\"Condorman\" is not a great movie. However, it is a lot of fun to watch. \"Condorman\" follows cartoonist Woody Wilkins (Michael Crawford), an eccentric who refuses to have his hero, Condorman, do anything in a comic book that he himself hasn't done in real life. The acting is predictably predictable, but still fun. Aside from Crawford, the other characters include a ravishing Barbera Carrera as the gorgeous Russian spy Wilkins falls for, and Oliver Reed as her \"old fling\". If for no other reason than to see a pre-\"Phantom\" Crawford in an outrageous role, this movie is worth at least a look.",
         "Condorman,wow....the film that made a childhood. It was THE Easter/Summer/Christmas/Half Term movie of a generation. Back in the 80's this film was ALWAYS on TV in the UK. Now,you hardly see it, its a disgrace (to my knowledge the last time it was on was at 5am on a Saturday morning on BBC1).Kids today have no idea what their missing,this was superhero movie magic at its best.....no...really...it was. It starred Michael (Phantom,Some Mothers) Crawford as Woody, a comic book artist who turned into his creation (Conderman) in order to rescue the beautiful (when your 10) Barbara Carrera from the clutches of the evil Hannibal (played in ultimate OTT mode by Oliver Reed... What i find more upsetting is that this masterpiece isn't available for us in the UK (Video or DVD). So,why,with the current trend for making Comic Book movies at a high,does nobody take a chance and offer this classic a remake!! Think about it..its got to be better than Daredevil,The Punisher, Batman and Robin and as for Catwoman,don't get me started!!. Question is,who could replace the Wonderful Crawford,Reed,Carrera?? Well the part of Natalia (Carrera) could go to somebody like,umm,lets say Hilary Swank.........Hannibal (Reed),needs to be one mean SOB,so how about Vernon Wells (Bennett in Commando, bad guy,bad string vest,back moustache,perfick!) and last but by no means least the part of Woody Wilkins.....well Vin Diesel needs a Hit!!!! But i feel the acting part of the role may be too much for him, so lets get Jeremy Irons on board!!! COME ON Hollywood GET WITH IT!!!!!!",
         "I only rated it a 9 mainly because of some of the finer details others have pointed out which could have made the film better, but really it is exactly what it was meant to be-- a hilarious double spoof: a spoof on super heroes, and a spoof on spy movies. If you're like me, once you've seen one spy movie, you've really seen them all. They're all the same, with different details. Spy movies, the normal variety, are highly overrated. The same is true with super hero movies, comics, cartoons, etc. Once the original Superman, Spiderman, etc, are introduced, nothing is ever original after that, and it's just so much hogwash that takes itself far too seriously. Enter the spoof, or the farce. This delightful genre of movie or TV show takes something known to be serious, and makes it silly. The fun in watching something like this does not come from thinking \"wow, this really could have happened, it's so realistic\" but rather from thinking, \"Aha! They are making so much fun of James Bond in this scene, it's just hilarious!\" A spoof is a variation of a farce-- a farce is a silly story that no one could really expect to happen, but a spoof is a farce that makes fun of something that people take way to seriously. Other popular farces and spoofs have included Get Smart, Gomer Pyle, USMC, The Inspector General, Mathnet (on Square 1 TV), The Princess Bride, Robin Hood Men in Tights, and all the Monty Python adventures. There are many others. Condorman is just such a spoof. It is meant to be funny. It is comedy first, romance and drama second. It appeals to a wide range of age groups because children actually think it's cool (if they're not already spoiled with too many brain-numbing robot and ninja cartoons to be able to appreciate true comedy) and adults love the stabs and jabs taken at the serious spy movies and superheroes. Yes, Condorman might have been better with a bigger budget, and maybe a little more effort could have been put into some of the plot, but I still love it and I think it is by and large one of the most satisfying and memorable films ever made. They don't make anything like it any more-- it's of the same ilk as Strongest Man in the World, and Herbie. Maybe Don Knotts would have been a funnier Condorman, but I still think it was great. I never noticed the wires holding Condor man up or the poor American accent while I was a kid-- come on, you people still watch the Wizard of Oz! For overall watchability, I think this is one to keep on the front row of your DVD collection.",
         "One of the most talented actor's of his era stars in the lead role. Perhaps we could say that the other actors' were being given a chance. There was no lack of ambition in making the film. Some of the on-location scenes are truly stunning. Although the special effects are starting to appear dated they are none the less original and brilliant. The concept of the film is a cross between a comic book hero and a secret agent who failed O'Level spying. It has the humour of the Morecambe and Wise show and the special effects of an early Bond film. A worthy flick that will appeal to everyone from young to not-so-young. It contains humour, gadgets, one-liners and plenty of action and is certainly not as predictable as one might think.",
         "This film reminds me of the first 'flick' our entire family went to see. Oh and the last. Condorman will only be a good film for those who remember times gone by. This is a very watchable family film but don't expect major laughs, especially with Michael Crawford's (Ooooh Betty) poor American accent. This was Disneys alternative to Superman with a splash of James Bond, and quite simply it was anything but. Please watch it so you can see how much storyboards, acting and special effects have progressed. If you like Porsche's chasing a gypsy waggon, then this is for you. If you are going to analyse this film for its kit-ch humour, and the directors/studio's desperation to get a film out for Summer, don't bother, however it is a way of introducing a spy film to your 3 year old.",
         "I loved this film in the eighties. I used to own it on Betamax, but since VHS and DVDs took over the world, I lost my copy of Condorman somewhere along the way. Michael Crawford (better known for his hapless TV character Frank Spencer), plays a comicbook writer who gets recruited by the CIA. As improbably as that sounds, you're best just glossing over it, as thinking too deeply about anything you see will spoil the film further. It's just stupid, cheesy fun. I loved it as a kid, but I have to admit being a little disappointed at what was really in front of me all the time. I could still appreciate some of it. The gadgets were fun, but Frank Spencer... sorry, Woody Wilkins, can just be a bit annoying. His jokes aren't that funny and he isn't tough enough to carry off being an action hero. I know this is a parody of spy movies in general, but if you want a cheesier spy movie, just watch some of the later Roger Moore James Bond films. Yes, I loved it as a kid and others who have such nostalgic memories of it will probably get something out of it, too. However, it's unlikely to find a new audience nowadays. If you have an eight-year-old boy, he might like it, but anyone over the age of eight will feel pretty bored by it all. I'm giving it 6/10 because of how much I used to love it. By today's standards, it's probably no more than a 5/10. http://thewrongtreemoviereviews.blogspot.co.uk/"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Family",
         "Romance"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Comic artist and writer Woody performs a simple courier operation for his friend Harry who works for the CIA. But when he successfully fends off hostile agents, he earns the respect of the beautiful Natalia, who requests his assistance for her defection. Woody uses this request as leverage to use the CIA's resources to bring his comic book creation, Condorman, to life to battle the evil Krokov.",
         "Cartoonist Woody is trying out a flying apparatus for his comic-book hero \"Condorman\", as he refuses to write a comic about anything that could not actually happen in the \"real world\". Woody becomes the winged creature superhero top American agent code-named Condorman he draws. Using his gadgets he helps a Soviet spy defect to the West. In Istanbul Woody meets a beautiful Russian named Natalia, who poses as the Russian civilian with whom the exchange is supposed to take place, but it is later revealed that she is in fact a Soviet spy. Woody launches on an adventure to rescue Natalia and keep her from the clutches of her two enemies, Krokov and Morovich.",
         "Cartoonist Woody becomes the superhero he draws. Using his gadgets he helps a Soviet spy defect to the West."
      ],
      "budget": 0
   },
   "movielensId": 2041,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-07-02",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["Charles Jarrott"],
      "runtime": 90,
      "movieId": 2041,
      "title": "Condorman",
      "mpaa": "PG",
      "actors": [
         "Michael Crawford",
         "Oliver Reed",
         "Barbara Carrera",
         "James Hampton",
         "Jean-Pierre Kalfon",
         "Dana Elcar",
         "Vernon Dobtcheff",
         "Robert Arden"
      ],
      "imdbMovieId": "0082199",
      "originalTitle": "Condorman",
      "genres": [
         "Comedy",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["QKY01V_Kh5Q"],
      "plotSummary": "Comic artist and writer Woody performs a simple courier operation for his friend Harry who works for the CIA. But when he successfully fends off hostile agents, he earns the respect of the beautiful Natalia, who requests his assistance for her defection. Woody uses this request as leverage to use the CIA's resources to bring his comic book creation, Condorman, to life to battle the evil Krokov.",
      "tmdbMovieId": 19379,
      "avgRating": 2.67969,
      "releaseYear": "1981",
      "numRatings": 896,
      "posterPath": "/abgxJPCU2AAxP4kSdvdWCU6qr6r.jpg"
   }
}