{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "leprechaun",
         "id": 10310
      }],
      "imdb_id": "tt0052722",
      "video": false,
      "title": "Darby O'Gill and the Little People",
      "recommendations": [
         19186,
         41279,
         37204,
         24816,
         15081,
         100339,
         29694,
         75552,
         17978,
         34774,
         6646,
         28476,
         38222,
         18444,
         108181,
         16084,
         64877,
         67606,
         462357,
         7234
      ],
      "backdrop_path": "/nL4O2CHxRXUwgHT9740xMgEIVva.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Darby O'Gill",
               "gender": 0,
               "credit_id": "52fe47a69251416c750a0d6b",
               "name": "Albert Sharpe",
               "profile_path": "/kkPw6K2lVqtHQgJK6BsMYZhYC2O.jpg",
               "id": 83783,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Katie O'Gill",
               "gender": 1,
               "credit_id": "52fe47a69251416c750a0d6f",
               "name": "Janet Munro",
               "profile_path": "/ydXF8J88QDvCSSMMCVDg5Cz2snB.jpg",
               "id": 83129,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Michael McBride",
               "gender": 2,
               "credit_id": "52fe47a69251416c750a0d67",
               "name": "Sean Connery",
               "profile_path": "/ce84udJZ9QRSR44jxwK2apM3DM8.jpg",
               "id": 738,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "King Brian",
               "gender": 0,
               "credit_id": "52fe47a69251416c750a0d7f",
               "name": "Jimmy O'Dea",
               "profile_path": null,
               "id": 1157304,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Pony Sugrue",
               "gender": 2,
               "credit_id": "52fe47a69251416c750a0d83",
               "name": "Kieron Moore",
               "profile_path": "/blayrwuhhugogG4XBE00zqn3SlB.jpg",
               "id": 101678,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sheelah Sugrue",
               "gender": 1,
               "credit_id": "52fe47a69251416c750a0d87",
               "name": "Estelle Winwood",
               "profile_path": "/xtmdaPh7ksaUqx56yCRmIryrGiS.jpg",
               "id": 47504,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Lord Fitzpatrick",
               "gender": 2,
               "credit_id": "52fe47a69251416c750a0d8b",
               "name": "Walter Fitzgerald",
               "profile_path": "/5MMdMRwzX9PbmByeSPWFJ8gcaRk.jpg",
               "id": 52220,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a69251416c750a0d75",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a69251416c750a0d7b",
               "name": "Lawrence Edward Watkin",
               "profile_path": null,
               "id": 52217,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.431727,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18887,
      "vote_count": 46,
      "budget": 0,
      "overview": "Take a wee bit of ancient folklore, mix in some spectacular special effects and a magical cast (including Sean Connery) -- and you've got one of the most enchanting fantasies of all time! A frisky old storyteller named Darby O'Gill is desperately seeking the proverbial pot of gold. There's just one tiny thing standing in his way: a 21-inch leprechaun named King Brian. In order to get the gold, Darby must match his wits against the shrewd little trickster -- which proves no small task, indeed! Fall under the spell of DARBY O'GILL AND THE LITTLE PEOPLE for a fun-filled evening of magic, mirth, and nonstop shenanigans!",
      "similar": [
         19286,
         19287,
         11811,
         18011,
         13207,
         11281,
         42622,
         18009,
         19288,
         126172,
         15004,
         112705,
         120230,
         66457,
         329871,
         329873,
         237363,
         478974
      ],
      "original_title": "Darby O'Gill and the Little People",
      "runtime": 93,
      "poster_path": "/x17wkoUet5WtcC6T1Rfo2E56b0m.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Gaeilge",
            "iso_639_1": "ga"
         }
      ],
      "production_companies": [],
      "release_date": "1959-06-29",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Lawrence Edward Watkin",
         "H.T. Kavanagh"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052722/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNjgxMTQ3MF5BMl5BanBnXkFtZTcwODU3NTYyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Albert Sharpe, Janet Munro, Sean Connery | See full cast and crew »"],
      "reviews": [
         "I saw this movie on TV as a child, and the scenes of the banshee and the death coach scared and impressed me so much, I carried the memory of them all my life. When I was an adult and saw it on video, I was astonished to find that the scenes are STILL impressive and creepy! Considering how sophisticated special effects have become since 'Darby O'Gill' was made in 1959, that's quite a tribute to the moviemaking skills of the day. The scenery is lovely, the actors skilful and wholeheartedly into their work, the music catchy and delightful, and really there's nothing not to like in this movie. The duels between Darby and his nemesis, King Brian, are wonderfully funny, as each tries to outsmart the other. The village characters are all well-drawn and likeable personalities. Pony Sugrue seems more 'American' than the others, but then, he's not supposed really to fit in in the village, and his punishment at the end is an enjoyable comeuppance. Favourite scenes - the banshee and death coach at the end, as mentioned, and all the leprechauns dancing under the fairy mountain then riding their little white horses out into the night as Darby plays them a wild tune on his fiddle. Don't be put off by the date on this movie; it's as good now as the day it was made.",
         "I do not know how much I would like this movie if I saw it today for the first time. But, since I grew up on this movie, I have no choice but to absolutely love it. We had this videocassette in our closet for years, it didn't have a cover on it, but it didn't need one. Wow, how I grew up on those colorful special effects. Those leprechauns riding small white horses around an old Irish man playing the fiddle. The horse turning silvery when enchanted by the leprechauns. The Banshee. Oh, that Banshee. You've never seen a scarier Banshee on film and you never will. A fantastic movie. A young Sean Connery is in it, and that old woman with that scary voice is fantastic. And Darby O'Gill...ahh.. one of the best family films and fantasy movies out there. ANd don't forget the scary, black creativity of the Death Cab. Here's to Darby O'Gill. Clink My grade: 9/10",
         "I first saw this film when I was 6 years old (I'm 49 now) and it stayed with me since then. The special effects are so good that I REALLY believed that the \"little people\" existed.(I also love Walt Disneys acknowledgement in the credits, thanking the \"wee folk\" for their cooperation in making the film). I still watch the film (usually around St.Patricks day) and after 43 years it still delights me. The story is short sweet and to the point, the acting wonderful, especially Albert Sharpe, Janet Munro and a very young Sean Connery(who sings very nicely), and Robert Stevensons' direction is right on the money. The later scenes, with the death carriage and the banshees scared me silly as a child and are still quite creepy. This is a film that holds up extraordinarily well and is terrific for family viewing. I have a copy on laser disc but look foward to its eventual release on DVD.",
         "This is a truly enchanting film for all ages. It takes the viewer to the small Irish village of Rushcullen in County Kerry where not much happens except to one person, Darby O'Gill. Darby is a lovable old caretaker for the local Lord of the Manor whom the Lord jokes retired years ago but never told anyone. Darby's wanderings up to the ruins above the village have led him into contact with the 'little people' ruled by the likable but cunning King Brian. The battle of wits between Darby and King Brian are the central theme running through the film but the subplots surrounding Darby's beautiful daughter Katie (played by the English actress Janet Munro who tragically died at only 38) and the competition between her suitor's, Sean Connery and Kieron Moore keep the older viewers interest. Add to this a bit of drama surrounding a death carriage and a scary banshee and you have a film which works on even more levels. This is something of a forgotten gem of the family film genre. With tales of leprechaun's and banshee's all told through the wonderful west coast brogue, it doesn't fail to captivate. It's somewhat idealised version of Irish life in the 1920's is also a delight. Okay, not all Irish people lived in thatched cottages, tipped their caps to the local priest or went to the pub to catch up on the craig, but a lot did. As family films go this is right up there with Mary Poppins and The Lion King, 10 out of 10.",
         "Upon reading comments of earlier reviewers of this title, I find myself in an unusual situation...I totally agree with them all! This is a wonderful movie. And excellent for all ages (except maybe for very small children due to the banshee scenes). I'm very impressed with the effects considering when this was made. Almost flawless! And the story is so delightful and engaging, I can't imagine anyone not getting a lift from this hour-and-a-half of leprechaun fantasy. Sean Connery is a little weak on the singing, but it certainly doesn't detract from the movie. I've had this movie on VHS since way back, but recently I upgraded to a DVD. There are some interesting supplemental items on the DVD: Including a 'making-of' that explain the effects; And there is a \"Wonderful World of Disney\" excerpt with Darby O'Gill, King Brian, & Walt Disney that's cute. I was surprised how much my teenage boys liked this movie. Usually they are too 'cool' to watch 'kids' movies (as they call them). And they were stodgy at first, but soon they were totally enrapt. This is one of the best family movies I've seen. Get this one and hold onto it because they just don't make em like this anymore.",
         "Like \"The Wizard of Oz\", this is one of those movies that transcends time itself. It is a true family movie that will never go out of style. One of my favorite scenes in this movie is the approach of the Death Coach, coming to claim his sick daughter. Having no where else to turn, the hysterically-frightened Darby calls for his old friendly nemesis, King Brian. See if you feel the same sense of relief at his appearance as I did! This movie covers the entire spectrum of emotions. It's sad, funny, scary, happy, you name it. You might want to shield the arrival of the Banshee from the little ones, as I remember how it frightened me at that age, but don't let that sway you from watching this masterpiece.",
         "As a lad I well remember the kind of campaigns Walt Disney used to publicize his films. He used all the available outlets he had such as his Mickey Mouse Club show or the Walt Disney Wonderful World of Color television shows. If Walt Disney could have worked it out, he'd have plugged Darby O'Gill and the Little People on Zorro. I remember Disney on one of his shows having a formal meeting with King Brian of Knocknasheega to sign over screen rights to the story of the leprechauns. It was all done with a kind of serious pomp that would impress a kid with Disney and Jimmy O'Dea who played the leprechaun king, Brian Conners. According to the Films of Walt Disney by Leonard Maltin, Disney had it in mind to do an Irish story for over 15 years before Darby O'Gill was released. In fact when he saw the original Broadway production of Finian's Rainbow, he had his leading man in mind in the person of Albert Sharpe. Sharpe's Darby O'Gill is a gamekeeper on the grounds of Lord Fitzpatrick who in his declining years spends more time at the local pub, regaling the patrons with his tales of encounters with the leprechauns. As Walter Fitzgerald who plays Lord Fitzpatrick says, Darby retired a couple of years ago without telling me. So he's hired himself a young new gamekeeper, an outsider from Dublin named Michael McBride played by a pre-James Bond Sean Connery. Connery's a decent chap though and he'll give Sharpe time enough to vacate the gamekeeper's gate cottage. Besides Connery's taken a liking to Darby's daughter Katie in the person of winsome Janet Munro. The film alternates and then blends the story of Connery's courtship of Munro with the person of her other suitor, the town bully played by Kieron Moore and Sharpe's adventures with the leprechauns. King Brian tricks him a couple of times, but Darby captures him by getting him drunk and keeping him out until daylight when he has no powers. If Darby O'Gill had been made by someone other than Disney probably Barry Fitzgerald would have played Darby. Sharpe certainly has the elfin charm of Fitzgerald's Michaeleen O'Flynn from The Quiet Man. And because he was not a movie name, he worked a lot cheaper for Disney, always a consideration in The Magic Kingdom. The special effects are really good here considering this was the age before computer generated graphics. Enough to give even a twelve year old a fright with the appearance of the banshee and the costa bower, the death coach. The answer to a movie trivia question is this film if it is ever asked whether Sean Connery sang in a movie. It's in fact him singing, My Little Irish Girl, both he and Janet Munro sing it alone and duet it for the finale. No dubbing, in fact Sean Connery cut a 45 rpm record of it back in the day. Probably worth a fortune if you could find one. Janet Munro did a few films for Disney. She was a wholesome lass in his films, very appealing and her death at too young and age was a real tragedy. Either Disney didn't spot anything in Sean Connery or Connery was too smart to be tied down to a long term contract to that studio. Connery after Dr. No premiered spent the next dozen years or so trying to prove both artistically and financially that he was capable of more than James Bond. But it sure would be fascinating to speculate on what turn Sean Connery's career would have taken if I had starred in a half a dozen or so Disney features. Can you imagine him trying to escape that kind of typecasting? Darby O'Gill and the Little People is a children's film and I think it still has charm a-plenty even for today's generation who might be skeptical about leprechauns.",
         "Until \"Mary Poppins\" came along, I don't think Hollywood took Walt Disney seriously as a live-action movie producer. James Baskett received a special Oscar for \"Song of the South\", as did Hayley Mills in 1960 for \"Pollyanna\". However a great many performances in Walt's early output deserved a more substantial recognition, such as James Robertson Justice in \"The Sword and the Rose\" and Albert Sharpe in this film. Playing storytelling Irish codger Darby O'Gill, Sharpe is charming spinning tall tales in a quaint village, capturing himself a real live leprechaun and being rewarded with three wishes before the little King is freed. Colorful outing for older children and nostalgic adults, relying less on sugary sentiment and doting tots than on old-fashioned whimsy. Sean Connery has a nice romance with Janet Munro (who is always a pleasure) and the special effects, particularly near the end, are quite marvelous. **1/2 from ****",
         "Boy, this is about as Irish as it gets: accents, terminology that is foreign to most other people but fun to hear, leprechauns, pots of gold, three wishes (no more), other magic, Irish jigs and a few songs, lush countryside with plenty of green.....and a lot of good-natured blarney. It's old-fashioned, innocent fun, with a love story thrown in the mix. The latter involves a very young-looking Sean Connery. It's a shock to see him when he was in his late '20s, and even more of a shock to hear him sing, too! Three years later, Connery hit the jackpot (acting, not singing) playing James Bond in \"Dr. No,\" and the rest is history. In this Walt Disney film, he plays \"Michael McBride\" who winds up falling for \"Katie O'Gill.\" The latter is played by Janet Munro, a pretty woman who had the opposite screen success of Connery. After staring in a few of these Disney movies in which she played wholesome girls, she did an about-face and played unhappy and edgy characters and that, it turned out, was a poor choice. Alocholism then led to the tragic misfortune of contracting a fatal illness which killed her at the age of 38. The lead character, \"Darby O'Gill,\" is played very convincingly by Albert Sharpe. He was definitely the \"character\" of the story. This movie is a nice, feel-good film filled with a laughing horse, the good guys winning over the bad, a few dramatic moments, singing and dancing \"little people,\" and an assortment of Irish delights. I think kids would still like this film, even though it's dated with the special-effects, but that's to be expected. After all, the film is almost 50 years old. It has a pleasant feel to it and should still entertain folks today.",
         "Certainly not Mr. Disney. I loved this film as a child and today saw it for the first time in maybe 25 years. I was astonished at how good the special effects were. The Little People were totally believable! The DVD had a wonderful making of which explained the forced perspective technique and showed exactly how it was done. It also finally cleared up any confusion on how matte painting is used and from a technical viewpoint, this film is remarkable. Disney always went the extra mile. That's why he was such a master of film making. I was also delighted with the accents and the use of real Gaelic terms and Irish expressions and could only wonder if they had confused me as a child until I read that this movie had had two soundtracks and one had been dubbed on after the accents were deemed too difficult for American audiences. Fortunately, the original is on the DVD. With captioning, it's not hard to follow at all. And how Disney, to have a rider where he \"thanks\" the leprechauns for helping him make this picture! Of course, the looked so real, you could actually believe it."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Darby O'Gill seems to be as full of blarney as any old codger in Ireland, but the stories of leprechauns he tells at the pub are true. In fact, he and the tiny King Brian, ruler of the little people, are friendly adversaries, continually out-foxing each other. Darby needs a bit of magical help from the wily king when Lord Fitzpatrick replaces him as caretaker with the handsome, strapping young Michael from Dublin. Michael falls in love with Darby's beautiful daughter, Katie, which is all right with Darby; but the lad has a rival in a local ruffian, the son of a devious widow who wants her boy to be the caretaker. King Brian's supernatural assistance is necessary to make everything come out all right, but the sneaky leprechaun won't play matchmaker without a fight. Finally, real trouble comes in the form of the Banshee, and Darby will need all his quick wits to save his daughter from the wicked spirit.",
         "In the enchanted Emerald Isle, Darby O'Gill spins tall tales of leprechauns and banshees. Unfortunately, when he actually captures the leprechaun king and discovers their hidden gold, no one will believe him!",
         "A frisky old storyteller named Darby O'Gill is desperately seeking the proverbial pot of gold. There's just one tiny thing standing in his way: a 21-inch leprechaun named King Brian. In order to get the gold, Darby must match his wits against the shrewd little trickster- which proves no small task indeed!",
         "A wily old codger matches wits with the king of the leprechauns and helps play matchmaker for his daughter and the strapping lad who has replaced him as caretaker."
      ],
      "budget": 0
   },
   "movielensId": 2043,
   "movielens": {
      "languages": [
         "English",
         ""
      ],
      "releaseDate": "1959-06-29",
      "dvdReleaseDate": "2004-08-03",
      "directors": ["Robert Stevenson"],
      "runtime": 93,
      "movieId": 2043,
      "title": "Darby O'Gill and the Little People",
      "mpaa": "",
      "actors": [
         "Albert Sharpe",
         "Janet Munro",
         "Sean Connery",
         "Jimmy O'Dea",
         "Kieron Moore",
         "Estelle Winwood",
         "Walter Fitzgerald"
      ],
      "imdbMovieId": "0052722",
      "originalTitle": "Darby O'Gill and the Little People",
      "genres": [
         "Adventure",
         "Fantasy",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["0LOpdPUM6Ec"],
      "plotSummary": "Take a wee bit of ancient folklore, mix in some spectacular special effects and a magical cast (including Sean Connery) -- and you've got one of the most enchanting fantasies of all time! A frisky old storyteller named Darby O'Gill is desperately seeking the proverbial pot of gold. There's just one tiny thing standing in his way: a 21-inch leprechaun named King Brian. In order to get the gold, Darby must match his wits against the shrewd little trickster -- which proves no small task, indeed! Fall under the spell of DARBY O'GILL AND THE LITTLE PEOPLE for a fun-filled evening of magic, mirth, and nonstop shenanigans!",
      "tmdbMovieId": 18887,
      "avgRating": 3.28048,
      "releaseYear": "1959",
      "numRatings": 1173,
      "posterPath": "/x17wkoUet5WtcC6T1Rfo2E56b0m.jpg"
   }
}