{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "survival",
            "id": 10349
         },
         {
            "name": "explosion",
            "id": 14601
         }
      ],
      "imdb_id": "tt0106868",
      "video": false,
      "title": "A Far Off Place",
      "recommendations": [
         17474,
         48287,
         47939,
         46924,
         17207
      ],
      "backdrop_path": "/fHDHR0PZVHXtv54TKna3Uardciw.jpg",
      "revenue": 12890752,
      "reviews": [{
         "author": "Reno",
         "id": "57951c48c3a36837ae0084d7",
         "content": "> The Kalahari adventure!\r\n\r\nIf you are a Disney live-action film fan, you won't disappoint with it. It comes between the regular Disney films and Disney nature films. It sets in somewhere in the Namibia and takes us with to a great adventure which is more like a documentary film than a film with a story. Actually, there was a small story, mostly on the opening and the end part and the rest of the film was a foot journey like 'The Way Back'. Based on the book of the same name about a girl and a boy who team up with a bushman to cross the Kalahari desert after their family was attacked by the poachers.\r\n\r\nI did not know anything about it, so I expected nothing. But I thought of 'The Gods Must be Crazy', since it is not a comedy, I prepared for something new. I really liked the film, but not that much. Spectacular African landscapes, and awesome performances by everyone. I would have loved it if a few more wild animals participated in it, after all African flavour means that's what we all anticipate, especially the children. So from that perspective, it is slightly a disappointment, but not much. Other than that it is a fine family film from a trusted production house.\r\n\r\n6.5/10",
         "url": "https://www.themoviedb.org/review/57951c48c3a36837ae0084d7"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nonnie Parker",
               "gender": 1,
               "credit_id": "52fe44a6c3a368484e02efd7",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Harry Winslow",
               "gender": 2,
               "credit_id": "52fe44a6c3a368484e02efdb",
               "name": "Ethan Embry",
               "profile_path": "/btE5T04gKo8isQ2UekgXmZIMXmA.jpg",
               "id": 58019,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "John Ricketts",
               "gender": 2,
               "credit_id": "52fe44a6c3a368484e02efe5",
               "name": "Jack Thompson",
               "profile_path": "/l2NNfs9bd6qxqzIOahcz2hErrq8.jpg",
               "id": 12536,
               "order": 2
            },
            {
               "cast_id": 23,
               "character": "Xhabbo",
               "gender": 0,
               "credit_id": "54ef3b0ac3a3686b9a003bfb",
               "name": "Sarel Bok",
               "profile_path": null,
               "id": 1432110,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Paul Parker",
               "gender": 2,
               "credit_id": "52fe44a6c3a368484e02efe9",
               "name": "Robert John Burke",
               "profile_path": "/ctVRWqY0KfSBIpaGulJMbhyE3jy.jpg",
               "id": 31512,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Elizabeth Parker",
               "gender": 1,
               "credit_id": "52fe44a6c3a368484e02efed",
               "name": "Patricia Kalember",
               "profile_path": "/zj0sozm8MPcZOkoxIXX5m7uPokn.jpg",
               "id": 23627,
               "order": 5
            },
            {
               "cast_id": 24,
               "character": "John Winslow",
               "gender": 2,
               "credit_id": "54ef3b29c3a3680b80006850",
               "name": "Daniel Gerroll",
               "profile_path": "/h7IVfBvK9bPTyDg1yNm40pb4zsS.jpg",
               "id": 73933,
               "order": 6
            },
            {
               "cast_id": 25,
               "character": "Col. Mopani Theron",
               "gender": 2,
               "credit_id": "54ef3b4492514179650062ce",
               "name": "Maximilian Schell",
               "profile_path": "/xhjyQpOmwDwU48Kq2b1XCEO9G7E.jpg",
               "id": 12150,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a368484e02efe1",
               "name": "Mikael Salomon",
               "profile_path": "/cIhsLhWqQAy52M8leeH7uCOKQRD.jpg",
               "id": 30149,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54eee369c3a36869e500330c",
               "name": "Laurens Van der Post",
               "profile_path": null,
               "id": 71011,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "54eee37c9251417974005b51",
               "name": "Robert Caswell",
               "profile_path": null,
               "id": 86299,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54eee3a49251417965005ae1",
               "name": "Sally Robinson",
               "profile_path": null,
               "id": 56965,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54eee3cc9251417974005b59",
               "name": "Jonathan Hensleigh",
               "profile_path": "/l1c4UFD3g0HVWj5f0CxXAvMAGiT.jpg",
               "id": 876,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54eee6b09251417968005a9d",
               "name": "James Horner",
               "profile_path": "/oLOtXxXsYk8X4qq0ud4xVypXudi.jpg",
               "id": 1729,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54eee6bfc3a3686d580057fa",
               "name": "Ray Lovejoy",
               "profile_path": null,
               "id": 244,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54eee6cec3a3684aff001001",
               "name": "Juan Ruiz Anchía",
               "profile_path": null,
               "id": 20693,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54eee7209251417968005aa5",
               "name": "Rosemary Burrows",
               "profile_path": null,
               "id": 101523,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54eee7a2c3a368402d002eb6",
               "name": "Elaine Sperber",
               "profile_path": null,
               "id": 102768,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "54eee7c1c3a3684aff001019",
               "name": "Eva Monley",
               "profile_path": null,
               "id": 1324933,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "54eee8029251417974005bc0",
               "name": "Gemma Jackson",
               "profile_path": null,
               "id": 9153,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "54eeeafa9251413ae8002f63",
               "name": "Kathleen Kennedy",
               "profile_path": "/6rGtk7OdbkO2QDM2OQxt9Blww3O.jpg",
               "id": 489,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54eeeb4ac3a3680b80006063",
               "name": "Frank Marshall",
               "profile_path": "/dVPOD85wQ1Xscpe3DOVQ1I59IIF.jpg",
               "id": 664,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54eeeb58c3a368402d002f00",
               "name": "Gerald R. Molen",
               "profile_path": "/ih3yLiYixeQuW2Zp545aHtD5nq.jpg",
               "id": 2211,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54eeeb659251417971005aa1",
               "name": "William W. Wilson III",
               "profile_path": null,
               "id": 56648,
               "department": "Production",
               "job": "Co-Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.547933,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24736,
      "vote_count": 20,
      "budget": 0,
      "overview": "Thrown together under incredible circumstances, two strangers must discover courage and strength when they begin a journey across the treacherous African desert! Equipped only with their wits and the expertise of a native bushman who befriends them, they are determined to triumph over impossible odds and reach their destination. But along the way, the trio face a primitive desert wilderness.",
      "similar": [
         10575,
         4771,
         281957,
         445954,
         133805,
         18587,
         15069,
         26390,
         12150,
         1949,
         14869,
         101299,
         75780,
         281,
         979,
         357096,
         10651,
         1572,
         96,
         238636
      ],
      "original_title": "A Far Off Place",
      "runtime": 100,
      "poster_path": "/5zP6zkZjHasC32GO7S64emGpO5w.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": "/mpGWkDeikYLeAR8LVNaixig0vwE.png",
            "name": "Amblin Entertainment",
            "id": 56,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-03-12",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "A far off land. A far off journey. A far off adventure.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mikael Salomon"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Laurens Van der Post",
         "Robert Caswell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106868/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMDYyMzcyNl5BMl5BanBnXkFtZTcwNjc4OTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Reese Witherspoon, Ethan Embry, Jack Thompson | See full cast and crew »"],
      "reviews": [
         "There are so many things I love about this movie. The score is wonderful, and the actors reveal human depth without dragging us through tiresome dialogue. They learn compassion, selflessness, and perseverance. Even though the plot starts out familiar; two kids at odds with each other, on their own, the film doesn't fall into a rut. instead it presents a refreshing uniqueness with it's quality. It inspires without trying too hard, something most movies fail at horribly. I'm surprised this film is so obscure, but considering how good it is, maybe it isn't.",
         "I saw \"A Far Off Place\" in the theaters. At the time, I wasn't familiar with Reese Witherspoon. When I was reading about her a few years later, I was a little surprised to find out that the girl in \"A Far Off Place\" was her. \"AFOP\" might teach you all that you need to know about poaching. It portrays Nonnie Parker (Witherspoon) and Harry Winslow (Ethan Embry) having to flee into the Kalahari with guide Xhabbo (Sarel Bok) after their camp gets attacked by poachers. Throughout the trip across the desert, the three of them not only get to know each other, but get a feel for the land. This is one movie that you're sure to like.",
         "If only more movies were made to this standard. I saw this movie in the theatre when it first came out, and it was one of the first videotapes I bought. The photography is beautiful. The actors, especially Sarel Bok, are great. I liked that Nonnie became the main character in the movie. The combination of the books A Story Like the Wind and A Far Off Place is seamless in this movie treatment. And the translation from book to screen is near perfect. The spirit of the stories is maintained. The children I have watched this movie with have thoroughly enjoyed it, and we have had very interesting discussions on the themes of protecting wildlife, the environment and the qualities necessary to persevere when faced with life's difficulties and choices.",
         "A Far Off Place is indeed an excellent film. The main reason for this is the characters, the character of Nonnie Parker (Reese Witherspoon) in particular. Reese's character of Vanessa Lutz in \"Freeway\" was, like the rest of the movie, one of Matthew Bright's bad acid-trips. The character of Nonnie Parker, however, is portrayed by Reese Witherspoon in such a way that Nonnie takes on a life of her own. She doesn't say much, we don't know much about her, yet for some reason, she seems as real as you and me. If you're really into the movie, you might even fall in love with her. Reese Witherspoon has portrayed several different types of characters, so it's doubtful we'll ever know what she's like off-screen. I would hope, however, that she's just like Nonnie Parker.",
         "This story has so much knowledge and truth behind it, it's amazing. Reese is very good in this movie, and it's one of her best films ever. She is amazing & she is smart in this movie. Staying strong and surviving is harder than TV shows, and this movie teaches us so much. That friends and family is more important than anything, and we can make it through difficult times if we just stick together and stay strong. This film is great, and I respect Reese alot more than what I already did now. She should be proud to have portrayed such an emotional and well-rounded role. I'm sure she is proud. This film is great, the acting is cool, and it's emotional. But it's good family fun, or maybe just fun for the Reese fanatic like me.",
         "I saw this movie for the first time on the Disney channel about 6 years ago. This is one of my favorite movies. I love Reese Witherspoon and her portrayal of the young girl was superb. The beginning of the movie draws you in as you see how a young boy from the US trys to cope without modern technology and how Nonnie despised him. I followed her emotions throughout the story as she slowly warms up to him and was deeply satisfied with the conclusion. Both children had lost their parents and the tragedy had drawn them together. The love birds were a nice touch. The poor things had a wild ride when the children were hugging at the end. I recommend this film to my friends and their children. Even though I have heard it is a \"copy\" of another story called,\"Walkabout\" or something like this, having never seen that movie, this one stands on it's own as a very adventurous tale. I like to watch it at least twice a year and have recently purchased it on DVD.",
         "This movie about the struggles of these young people in a hostile environment, not knowing who to trust, and learning to know and trust themselves and each other, truly touched me. I have the tape and it is one that I enjoy watching again and again. Several observers have indicated that \"A Far Off Place\" is a poor re-make of the Australian-set \"Walk-About\". If they had paid attention to the writing credits, they would have found that \"Walk-About\" was based on the novel of the same name by James Vance Marshall. \"A Far Off Place\" is based on two novels by Laurens van der Post: \"A Story of the Wind\" and \"A Far Off Place\". Van der Post was by far the more acclaimed author. Several reviewers of both movies have commented on the animal death scenes. In this movie, in the Kalahari, the unanswered question I have wondered about is; what happened to Nonni's dog?",
         "I've voiced my displeasure at the current state of Disney movies before and pointed out how vastly different they are in the 21st Century to movies that were made as recently as the 90s. Reese Witherspoon plays Nonnie Parker and Ethan Embry her reluctant friend Harry. Both kids are living with their parents in rural Africa when their home is attacked by Ivory poachers. With their bushman friend Xhabbo as a guide the kids take off across the Kalahari desert to reach the safety of the coast and nearest town, while the poachers plan to kill off their only witnesses. A Far Off Place opens with the massacre of a herd of elephants. The killers themselves are then mercilessly gunned down by supporting hero Col. Theron. Would Disney DARE allow a scene like this in the 21st Century? Look at the quality of Tim Allen's The Shaggy Dog and you'll find your answer. For any family-orientated movie it takes some nerve to open with killing such as this but even 16-year-old Nonnie herself is at ease yielding a rifle and doesn't hesitate to blow-up bad guys. The African desert scenery is gorgeous and director Mikael Salomon (who also made the underrated Hard Rain) fills the movie with lovely cinematography. The dunes, the blue sky, the night sky...it all makes you wish for a sunny holiday. A Far Off Place (a combination of two novels \"A Story Like the Wind\" and \"A Far Off Place\" by Laurens Van der Post) is not a well known movie and is quite hard to find, but it's worth hunting down. A shame that such a good movie has fallen off the radar.",
         "I'm not quite sure whether or not this movie would appeal to guys, but I have decided that I am going to comment anyway. This is a good role in Reese Witherspoon's early years as an actress. There is not really much of a romance between the two actors as some critics have suggested (there is just the \"obligatory\" kiss and later hug at the end of the movie; is that a spoiler?), but the chemistry and friendship between Nonnie (Witherspoon) and Harry (Ethan Embry then known as Ethan Randall) is surprisingly touching. The violence and language is slightly shocking for a PG-rated Disney family movie and there are a few spiritual-related issues (one scene in particular had me saying \"Wow. That was weird\" and I can't even describe what was happening), but the rest is engaging.",
         "It is unfair to judge a children's film by the same non-technical standards you would judge a film made for a more mature audience. That said, I had a difficult time figuring out the intended target audience for Disney\"s \"A Far Off Place\", an odd mix of \"Alaska\", \"Walkabout\", and \"Blue Lagoon\". Since each of these films had a different target audience (children for \"Alaska\", adults for \"Walkabout\", and teens for \"Blue Lagoon\"), \"A Far Off Place\" suffers from a poorly matched and confused mix of story elements, the attempt to appeal to multiple target audiences ultimately makes it unappealing to all audiences. Despite some positive comments on this database, \"A Far Off Place\" did not impress audiences at the time of its 1993 release and has generated little interest since. Based on stories by South African writer Laurens van der Post, \"A Far Off Place\" is the story of three teenagers: Nonnie (Reece Witherspoon as a girl raised on South African game preserve), Harry (Ethan Randall as a visiting American boy) and Sorel Bok (as their young Bushman guide Xhabbo) who attempt to evade a gang of ivory poachers by fleeing into the Kalahari Desert. Ethan Randall is actually Ethan Embry from \"Can't Hardy Wait\". Although recommended for ages eight and up, younger viewers will be disturbed by the early scenes, where the family's idyllic life is ended by a night attack on their home by the poachers. The house is burned and the parents are murdered. And more mature viewers will be deeply disturbed by the next scene where Nonnie turns into Rambo and kills most of gang in a sequence credible only to a horrified eight-year old. At this point it begins to look like \"Walkabout\", a story of an Australian girl, her little brother, and a young Aborigine on his ritual journey to manhood. In a significant deviation from the book Xhabbo's wife does not accompany the group into the desert. \"Walkabout's\" more adult theme of interracial sexual awakening is replaced by a \"Blue Lagoon\" romance between the two white teenagers, a reflection of the film's narrower values and more modest ambitions. The scenes shot in the desert are almost the equal of \"Alaska\" for scenic beauty but \"Alaska\"s\" more realistic survival challenges are superior to the blend of survival skills and mystic powers that Xhabbo demonstrates to his two companions during their journey. There is an element of \"The Gods Must Be Crazy\" in this clash of cultures but the film does not go very far (bad pun intended) with the concept. Both \"Alaska\" and \"A Far Off Place\" insert the element of poacher violence into the journey, to the detriment of the basic story. 'Walkabout\" did not need this and found sufficient story material in the enormity of the survival experience. Bok is excellent as the young Bushman and Randall/Embry's performance is solid if unexceptional. Those interested in Witherspoon's early work would be better served checking out her great debut performance in \"The Man In the Moon\" and avoiding this career misstep. Those looking for a children/family story should stick with \"Alaska\". Then again, what do I know? I'm only a child."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Amblin Entertainment",
         "Touchwood Pacific Partners 1"
      ],
      "summaries": ["The witty Nonni and the stuck-up city-boy Harry are the only ones to survive a massacre of a gang of poachers among the gamekeeper's family on his lonesome farm in the savanna. Now the ruthless murderers are after them as the only witnesses. Without a means of transportation, the only way to escape is to walk through 2000 kilometers of Kalahari desert with the help of the African bushman Xhabbo. On the months-long journey ahead they not only become good friends against their differences, but also realize that every one of them has strength and skills that are required to survive."],
      "budget": 0
   },
   "movielensId": 2045,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-03-12",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Mikael Salomon"],
      "runtime": 100,
      "movieId": 2045,
      "title": "A Far Off Place",
      "mpaa": "PG",
      "actors": [
         "Reese Witherspoon",
         "Ethan Embry",
         "Jack Thompson",
         "Sarel Bok",
         "Robert John Burke",
         "Patricia Kalember",
         "Daniel Gerroll",
         "Maximilian Schell"
      ],
      "imdbMovieId": "0106868",
      "originalTitle": "A Far Off Place",
      "genres": [
         "Drama",
         "Adventure"
      ],
      "youtubeTrailerIds": ["DDe-OvUWM-A"],
      "plotSummary": "Thrown together under incredible circumstances, two strangers must discover courage and strength when they begin a journey across the treacherous African desert! Equipped only with their wits and the expertise of a native bushman who befriends them, they are determined to triumph over impossible odds and reach their destination. But along the way, the trio face a primitive desert wilderness.",
      "tmdbMovieId": 24736,
      "avgRating": 3.37558,
      "releaseYear": "1993",
      "numRatings": 434,
      "posterPath": "/5zP6zkZjHasC32GO7S64emGpO5w.jpg"
   }
}