{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "laughing",
            "id": 2342
         },
         {
            "name": "magic",
            "id": 2343
         }
      ],
      "imdb_id": "tt0061715",
      "video": false,
      "title": "The Gnome-Mobile",
      "recommendations": [
         41279,
         4932,
         37204,
         18887,
         106112,
         38802,
         25223,
         92168,
         57091,
         41800,
         42986,
         69017,
         80536
      ],
      "backdrop_path": "/ru71zEMGm63drh753PnN9AfnOKx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "D.J. Mulrooney",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302c3",
               "name": "Walter Brennan",
               "profile_path": "/wPp0mmWWVMzOD3ipne6MrgDr0Tm.jpg",
               "id": 4302,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Rodney",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302c7",
               "name": "Matthew Garber",
               "profile_path": "/l2dN6XkreEn3HDBnevlpayg5Ydp.jpg",
               "id": 5830,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "52fe44abc3a368484e0302cb",
               "name": "Karen Dotrice",
               "profile_path": "/wzpDcUOqfMTDAfYebSB4fjkKgSx.jpg",
               "id": 5829,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ralph Yarby",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302cf",
               "name": "Richard Deacon",
               "profile_path": "/ikKk1FGXFDl9GJoyI3I2EBfexEY.jpg",
               "id": 80206,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Horatio Quaxton",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302d7",
               "name": "Sean McClory",
               "profile_path": "/4eOjjwyxE73LoG4eaivI5AgT0Ed.jpg",
               "id": 30501,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Rufus",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302db",
               "name": "Ed Wynn",
               "profile_path": "/rdFZ6qgbqAof6QlUn6Yi146kvVS.jpg",
               "id": 5833,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dr. Ramsey",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302df",
               "name": "Jerome Cowan",
               "profile_path": "/g0FeWrQGcSJ3d1XrFnP6LC6C9Qv.jpg",
               "id": 14452,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dr. Scoggins",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302e3",
               "name": "Charles Lane",
               "profile_path": "/wu5fTupk5atyJlCsHhXPGcdf8Mg.jpg",
               "id": 29579,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Male Nurse",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302e7",
               "name": "Norm Grabowski",
               "profile_path": "/tT0N7fFX5SqRffWNEeAwjZ3JEFP.jpg",
               "id": 116749,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Gas Attendant",
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302eb",
               "name": "Gil Lamb",
               "profile_path": "/vnGdmpmsQcT1DoNYVufovzMHtdZ.jpg",
               "id": 99828,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Katie Barrett",
               "gender": 1,
               "credit_id": "52fe44abc3a368484e0302ef",
               "name": "Maudie Prickett",
               "profile_path": null,
               "id": 151503,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Violet",
               "gender": 0,
               "credit_id": "52fe44abc3a368484e0302f3",
               "name": "Cami Sebring",
               "profile_path": null,
               "id": 1131109,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Jasper",
               "gender": 2,
               "credit_id": "59160d6c92514159c1022095",
               "name": "Tom Lowell",
               "profile_path": null,
               "id": 1231331,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44abc3a368484e0302b9",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44abc3a368484e0302bf",
               "name": "Ellis Kadison",
               "profile_path": null,
               "id": 120893,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.225953,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24816,
      "vote_count": 27,
      "budget": 0,
      "overview": "An eccentric millionaire and his grandchildren are embroiled in the plights of some forest gnomes who are searching for the rest of their tribe. While helping them, the millionaire is suspected of being crazy because he's seeing gnomes! He's committed, and the niece and nephew and the gnomes have to find him and free him.",
      "similar": [
         433,
         10693,
         10882,
         27022,
         672,
         674,
         675,
         767,
         68728,
         411,
         129,
         10895,
         68735,
         57158,
         76492,
         10140,
         12445,
         37430,
         259316,
         671
      ],
      "original_title": "The Gnome-Mobile",
      "runtime": 85,
      "poster_path": "/6KAkxeIvqrwXtJXptCYjffWG2ma.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1967-07-17",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "A Tall Tale About Little People!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Ellis Kadison",
         "Upton Sinclair"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061715/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MTk4OTg2OV5BMl5BanBnXkFtZTcwNjUzMDUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Walter Brennan, Matthew Garber, Karen Dotrice | See full cast and crew »"],
      "reviews": [
         "The kids from Mary Poppins are re-united on screen to play modern-day siblings in this likable live-action Disney feature. Also on display are some neat special effects (for the time, anyway), in which normal-sized actors and gnomes seem to share the same screen space. Rodney (Matthew Garber) and Elizabeth (Karen Dotrice) arrive in San Francisco to meet up with their grandfather D.J Mulrooney (Walter Brennan), who runs a successful lumber company. They drive out to a redwood forest for a picnic, where Elizabeth happens across a gnome named Jasper (Tom Lowell), who begs her for help. Seems Jasper's grandpa Knobby (Brennan, again) is on the verge of death-by-depression because he thinks that he and Jasper are the world's only remaining gnomes and has lost all hope of seeing young Jasper finding a wife. Rodney, Elizabeth and D.J agree to help the gnomes by driving them to other forests further up the coast. En route, an opportunistic freak-show boss, Quaxton (Sean McClory), catches a glimpse of the gnomes and kidnaps them for his carnival. Matters worsen when D.J tries to get his own security agents to lead the hunt for the kidnapped gnomes, for they dismiss his orders as the ramblings of a mad-man and have him locked away in an asylum. Rodney and Elizabeth are the only ones who can free their grandfather, rescue the gnomes, and find a bride for Jasper before it's too late! Generally-speaking the film is likable and entertaining. Brennan is always a pleasure to watch and this is no exception (in fact, a double-pleasure as he has a dual role). Both child-actors are pretty good, especially Garber who demonstrates an understanding of comic timing/underplaying that most kids just don't have. The special effects are impressive for 1967, with convincing visual trick work to have the gnomes interacting with the humans, and some well done talking-animal-scenes at the beginning of the film. There are a few drawbacks. The title song 'Gnome-Mobile' is truly horrible, and McClory's villain isn't built up enough to make him a hissable bad guy. He just sort of appears in a few scenes looking shady, then disappears from the story without his role in it amounting to very much. On the whole, I like The Gnome-Mobile. It's harmless fun, with an inventive plot, enjoyable performances and lots of agreeably zany episodes.",
         "I saw it years ago, before BETA system was erased from the earth, and I still sing the songs from time to time. It is like a weird cross between Mary Poppins, Herbie and fragile rock. It was really amusing and as I said, with some catchy songs. Maybe the special effects are a little bit old-fashioned, but I am sure it is now as charming as it was then. I remember, maybe, the good being too god and the bad guys being too bad but, after all, it's supposed to be for kids! It's also one of those real image movies from Disney, a little bit forgotten, I don't know why. When home video was striking the world, many titles as this one were released, and now with the DVD explosion, some interesting movies, just like this one, seems to be passed by. I think this is much better than \"lizzie McGuire\" and all that \"princess Disney\" stuff and things like that. At least, a movie like \"the gnome-Mobile\", does say something, not just \"hey! be cool and buy clothes\" when you read between the lines. - Jimina Sabadú",
         "This is a bundle of joy, even at the ripe old age of 24. Maybe I took it all in as if it was meant for pure tongue-in-cheek purposes, but even as pure kids movie entertainment this is a blast (in cheesy ways as well as for-real ones). It's about the world of gnomes in the redwood west-coast forests coming to light for a couple of kids (the Mary Poppens tykes) and an old man who runs a lumber company. It might make sense to give a little back-up: part of he reason I watched this movie- make that a big reason- was that Upton Sinclair wrote it. There Will Be Blood is now out in theaters, a big success, and I was intrigued by what else was adapted from his works. Seeing this on the credits list made me give a double-take. What? A Disney movie? Will there be socialist gnomes gathering in the streets to protest the ways of the 5 to 6 foot tall bunch? And what about the greedy capitalists cutting down their trees for their profit motives? Do they have no decency? Those thoughts ran through my mind, thinking that The Gnome Mobile would be bust, some cheesy kids movie that was so bad it would be good. And, in some ways, it is. It breaks into songs in the weirdest of moments (always, it seems, even if infrequently, in the car), and Walter Brennan plays two roles without any real justification except, mayhap, to get a bigger paycheck. But aside from the goofy expectations, it's actually a lot of legitimate fun, too. Kids who aren't completely dulled down by current CGI might get a kick out of seeing how things went in the \"old\" days (i.e. lots of large back-drop sets, the 'old-school' of blue screen of sorts of forced perspective, matte paintings), and for acting and comedy that is of a completely light manner. There's danger with a villainous freak-show captain (the name Horatio Quaxton in and of itself is great), and members of grandpa's own company. It's a big, big, big gas. Only in the 2nd climax (yes, there are two, I think, sort of), when the lady gnomes go after Jasper in a courtship ritual do things get a little TOO weird (if that's possible with the frigging Gnome Mobile), and almost a little out of steam.",
         "when this movie came out in 1967 i was only six. but when it was shown over the years on the disney channel and i got to see the movie for the first time i cried with laughter. the late but not forgotten walter brennan was as funny as funny could be. he was the perfect choice to do both roles. i take my hat off to walt disney for putting this movie together. this is a movie the whole family can enjoy. thank you...",
         "In all the 3 movies which Matthew Garber appeared, Karen Dotrice was his co-star. \"The Gnome Mobile\" is the third of them. The previous ones are \"The Three Lives of Thomasina\" and \"Mary Poppins\". This duo is also known as the «Mary Poppins kids». Matthew Garber and Karen Dotrice are two of my favorite kid stars, particularly Matthew. This fantasy film is something I recommend for anyone who likes old live-action Disney films, Disney in general and especially for fans of Matthew Garber and Karen Dotrice, no matter their age. Yet, this film seems to be more for children because it's somewhat childish. The film was directed by the famous Robert Stevenson, the same guy who directed movies such as the great \"Old Yeller\" and \"Mary Poppins\" and the okay films \"The Love Bug\", \"Herbie Rides Again\" and \"Bedknobs and Broomsticks\". The movie is generally likable, colorful and has soul, but it doesn't manage to be a truly great movie. The movie is quite promising in the beginning and it goes rather well until more or less the middle, perhaps a bit later than that. However, after that it isn't that great and becomes a little goofy for my taste. The sceneries are great, particularly the forest, which create an atmosphere that strongly resembles \"The Wizard of Oz\". Less good are some scenes with cars that inspired certain scenes for \"The Love Bug\", but at least those scenes are separate. The scenes with gnomes clearly resemble later movies such as \"Willy Wonka and the Chocolate Factory\". At the end, there are some nice primitive special effects. Walter Brennan is excellent in the role of the eccentric but disciplined D.J. Mulrooney and he is never annoying, unlike that gnome with big beird whose name I don't even know. The character D.J. Mulrooney owns a Rolls-Royce Phantom II, the gnome mobile of the title. A fine automobile indeed, but gigantic. If we consider its immense size and the time when the car was made, it's concerning the serious dangers they took with such an unsafe and huge car by doing some crazy stuff in curves and high speed. As for the kids (Matthew Garber and Karen Dotrice), they are perfect in their acting. Very lively, cute, charming, smart and classy. It's possible to see Matthew Garber doing incredible things here, such as driving a car and climbing a building. In fact, the scene when Matthew tries to drive the huge car but can't reach the pedals because he's too small for it is funny and Karen gives him a help. After the funny sequence when he climbs a building and helps his grandfather to escape is when the movie begins to lose its initial greatness. Matthew Garber portrays Rodney, while Karen Dotrice plays Elizabeth. They're brothers and their surname is Winthrop. I've gotta say, Rodney is a lovely and different name - very classy and British too. I love Matthew's lines «When I get a car, it's going to be a Maserati» and «1 horsepower??». The kid is fine, huh? I mean, a Maserati. That's thinking tall :) The classic comedian Ed Wynn has a small role as one of the gnomes at the end, but this time he isn't as funny as usual. Sad that Matthew Adam Garber is not with us anymore. Why didn't he and Karen keep in touch after this film? After all, they did 3 movies together and they were friends. Another funny line of Matthew is when he comments that nobody has a snoring like grandpa... As for the soundtrack, \"The Gnome Mobile Song\" is great, very charming, jolly and timeless. The movie wasn't a success. Maybe Matthew lost his motivation because of this and gave up on his acting career. Probably Karen felt the same and maybe that's why she was such a long time without making movies. In conclusion, a decent movie although not all that great. But it's worth for the lovely Matthew Garber and Karen Dotrice.",
         "The Gnome-Mobile is a Disney production and stars Walter Brennan, Tom Lowell, Matthew Garber, Karen Dotrice, Richard Deacon and sees Ed Wynn cameo. It's based on a 1936 book written by Upton Sinclair called The Gnomobile. The story concerns a timber tycoon called D.J. Mulrooney {Brennan} who along with his two grandchildren Rodney & Elizabeth {Garber & Dotrice}, get involved in the affairs of two Gnomes, Jasper & Knobby {Lowell & Brennan (again) respectively}. Jasper desperately wants a bride and Knobby is fading away as he fears the Gnome race is being wiped out by the constant felling of the forests. But in spite of Knobby's mistrust of humans, especially foresters, all five of them set off in Brennan's Rolls-Royce; now nicknamed The Gnome-Mobile by the children. Sure enough tho, problems arise as first a row breaks out when Knobby finds out about Mulrooney's trade, and worse still, when the two Gnomes are Gnomenapped by weird circus owner Horatio Quaxton {Sean McClory}. What will become of them all in Disney's fantastical family delight? What more do you want really? Leonard Maltin praised the film as being one of Disney's most unsung comedy/fantasies, and Roger Ebert wryly observed that Disney makes these types of films for kids, not critics. Who am I to argue with those two wise assumptions? It's a jolly film that contains bright and likable characters {acted likewise}, a lovely title song {written by the Sherman Brothers} and lasting effects work that has a timeless charm about it. The story {adventure} zips along with no boorish filler to hinder it, and the finale delivers everything you hope it will. Go Disney, this deserves a bigger reputation for sure. 7/10",
         "Walter Brennan plays a dual role in this film; he's the millionaire who tries to help the gnomes, and he's also Knobby, the 945 year old gnome who is losing his interest in living because he doesn't believe there are any more gnomes in the world but him and his grandson, Jasper. Anything with Walter in it is bound to be good, and this film has a lot of excitement and chases in it. As well as a catchy title song that you'll be singing in your head for weeks. Great for kids and grown-ups.",
         "One of the most charming fantasies that Walt Disney ever produced was The Gnomemobile. Even seeing it at the age 20 I was rather pleased with this wonderful kid's film. And if you've imbibed in any spirits while viewing it, The Gnomemobile can be quite a trip if you get my drift. The creators of Mary Poppins almost duplicated their success with The Gnomemobile. Walter Brennan gets to play a dual role, a reprise of the business tycoon from his series, The Tycoon and a mini me version of himself as a leader of a tribe of gnomes. These little folks live deep in the forest that Brennan's lumber company keeps chopping down and depriving them of a home. I imagine if this had an Irish locale, the wee ones would speak with a brogue and be called leprechauns. Anyway Brennan the tycoon has a couple of more little ones now, his grandchildren played by Matthew Garber and Karen Dotrice the kids from Mary Poppins. They work on grandpa and he takes an interest in the plight of the gnomes. But to help them grandpa faces some considerable opposition, not the least of which that folks just don't believe in the wee folk. The Gnomemobile marks the farewell performance of Ed Wynn who was a delightful performer who had been in show business for over 60 years when he passed away. Wynn plays one of the gnomes and a rival of sorts to Brennan's mini me. The Shermans, Robert M. and Richard B. wrote the musical score for The Gnomemobile and while it doesn't provide any lasting songs like Mary Poppins, the score is serviceable enough for the film. It's as charming as it ever was, but what a gas it is if you're indulging.",
         "I've always remembered Tom Lowell as Canoe, Hayley Mills beatnik boyfriend in That Darn Cat, since I saw that movie in the auditorium back in school in the seventies. Later, I would learn he was the orderly that Cornelius killed in Escape from Planet of the Apes. I was puzzled as to how he became reduced to such a bit part, then seemed to vanish from sight. He never appeared on Love Boat or Fantasy Island, for crying out loud! Lo and behold, I come across a movie called The Gnomemobile in the movie store. And it had Tom Lowell in it. So I buy it. With Lowell as Jasper the gnome, the children from Mary Poppins (which, oddly enough was how they were credited) and Walter Brennan for some unexplained reason in a dual role, this movie could have been on the level of Mary Poppins, Sound of Music, Chitty Chitty Bang Bang and Willie Wonka. So what went wrong? Over half the movie is spent on trying to get Grandpa out of the nuthouse. With a cast involving Maudie PIckett, Ellen Corby, Frank Cady, Richard Deacon and Alby Moore, they all would have stood out well had the movie made them gnomes along with Ed Wynn. So who was supposed to want to see this movie? If girls were supposed to think Lowell was cute, why does he sit out so much of the movie. He only gets one closeup toward the end as well. So were small children supposed to like the Mary Poppins children? Was Grandpa gnome or doodene supposed to be comically likable? Grandpa gnome maybe, but like Lowell, he sat out the majority of the movie. Once the movie got back to the woods, those beautiful woods, and we see Jasper trying to find a bride, the movie gets cute again. Even the talking animals, the birds, the owl and the raccoon, were all nice to see, but they aren't seen over five minutes at the beginning, then they are gone. Effects-wise, especially in regards to the double filming, this was all done very well. I must have caught some of this decades ago on the Wonderful World of Disney, as it all came back to me in strange shadowy flashbacks. Still it could have worked, even with gnomes singing that silly song instead of grandpa doodene. Ellen Corby, Frank Cady and Alby Moore would have been hysterical singing that thing.",
         "The Gnome-Mobile wasn't a perfect movie, but it was a pleasant, lively and enjoyable one for the family. I do think it is a little too short though, consequently while Sean McClory is suitably shady and enjoyable enough as the villain of the piece his character especially doesn't build up to as much as it could've been. Also, I have never been that receptive to the title song, it just seems bland and forgettable and the lyrics for me are quite uninspired. However, The Gnome-Mobile does have a very entertaining story, and some funny scripting. And it too benefits from some nice photography, scenery and costumes. The direction is good, the film goes at a cracking pace and the special effects are surprisingly reasonable. The main merit though of The Gnome-Mobile is the cast. Karen Dotrice and Matthew Garber are very appealing while Walter Brennan is simply wonderful in a dual role. Overall, an enjoyable film that doesn't quite make the grade but has a lot of things to make it watchable. 7/10 Bethany Cox"
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["An eccentric millionaire and his grandchildren are embroiled in the plights of some forest gnomes who are searching for the rest of their tribe. While helping them, the millionaire is suspected of being crazy because he's seeing gnomes! He's committed, and the niece and nephew and the gnomes have to find him and free him."],
      "budget": 0
   },
   "movielensId": 2047,
   "movielens": {
      "languages": [
         "Italiano",
         "English"
      ],
      "releaseDate": "1967-07-17",
      "dvdReleaseDate": "2004-03-02",
      "directors": ["Robert Stevenson"],
      "runtime": 85,
      "movieId": 2047,
      "title": "The Gnome-Mobile",
      "mpaa": "G",
      "actors": [
         "Walter Brennan",
         "Matthew Garber",
         "Karen Dotrice",
         "Richard Deacon",
         "Sean McClory",
         "Ed Wynn",
         "Jerome Cowan",
         "Charles Lane",
         "Norm Grabowski",
         "Gil Lamb",
         "Maudie Prickett",
         "Cami Sebring",
         "Tom Lowell"
      ],
      "imdbMovieId": "0061715",
      "originalTitle": "The Gnome-Mobile",
      "genres": [
         "Fantasy",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["We-8utU1kHo"],
      "plotSummary": "An eccentric millionaire and his grandchildren are embroiled in the plights of some forest gnomes who are searching for the rest of their tribe. While helping them, the millionaire is suspected of being crazy because he's seeing gnomes! He's committed, and the niece and nephew and the gnomes have to find him and free him.",
      "tmdbMovieId": 24816,
      "avgRating": 2.97605,
      "releaseYear": "1967",
      "numRatings": 167,
      "posterPath": "/6KAkxeIvqrwXtJXptCYjffWG2ma.jpg"
   }
}