{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0061749",
      "video": false,
      "title": "The Happiest Millionaire",
      "recommendations": [
         84840,
         64873,
         37204,
         42797,
         34774,
         36855,
         24816,
         32611,
         17984,
         5928,
         42453
      ],
      "backdrop_path": "/vZRsdR0jQMauTfqGIx3gDPCa78f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Anthony J. Drexel Biddle",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0369e9",
               "name": "Fred MacMurray",
               "profile_path": "/eARBON6ZDOo6aGKDkqLbbkHWHa3.jpg",
               "id": 4091,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "John Lawless",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0369ed",
               "name": "Tommy Steele",
               "profile_path": "/hvqpIeB58zl0Au8ca8Ef9dSMUzl.jpg",
               "id": 93804,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Cordelia Biddle",
               "gender": 1,
               "credit_id": "52fe44c8c3a368484e0369f1",
               "name": "Greer Garson",
               "profile_path": "/lKRl1a8QkMAbWNOhwr1C9EpOSVR.jpg",
               "id": 93805,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mrs. Duke",
               "gender": 1,
               "credit_id": "52fe44c8c3a368484e0369f5",
               "name": "Geraldine Page",
               "profile_path": "/zyGpaCsHZUJRUyFUJNlTQ6dBs6F.jpg",
               "id": 41283,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Aunt Mary Drexel",
               "gender": 1,
               "credit_id": "52fe44c8c3a368484e0369f9",
               "name": "Gladys Cooper",
               "profile_path": "/kDebiupJb7f5ZiFVNT9QTNuJfN9.jpg",
               "id": 3366,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mrs. Worth",
               "gender": 1,
               "credit_id": "52fe44c8c3a368484e0369fd",
               "name": "Hermione Baddeley",
               "profile_path": "/qdCA3FjT4So7sD6NGK3KE0ldqC6.jpg",
               "id": 5827,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Cordy Biddle",
               "gender": 1,
               "credit_id": "52fe44c8c3a368484e036a01",
               "name": "Lesley Ann Warren",
               "profile_path": "/4I5VPyumsxYGKST9b0FL2harYRK.jpg",
               "id": 21818,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Angie Duke",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e036a05",
               "name": "John Davidson",
               "profile_path": "/ka3f7jBCGoOPHUmaj2LieF9ad72.jpg",
               "id": 1915,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Tony Biddle",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e036a09",
               "name": "Paul Petersen",
               "profile_path": "/7WKHZjfpQnNSi9SuESW4efmmsfM.jpg",
               "id": 16763,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Livingston Biddle",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e036a0d",
               "name": "Eddie Hodges",
               "profile_path": "/fMy3fPRm5NQZDHZeVvJK3SDtQvP.jpg",
               "id": 81387,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Rosemary",
               "gender": 0,
               "credit_id": "52fe44c8c3a368484e036a23",
               "name": "Joyce Bulifant",
               "profile_path": "/hZgRI9cmtLAhtbLTmuh0gpTt2T9.jpg",
               "id": 1211892,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Police Sgt.",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e036a27",
               "name": "Sean McClory",
               "profile_path": "/4eOjjwyxE73LoG4eaivI5AgT0Ed.jpg",
               "id": 30501,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Lt. Powell",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e036a2b",
               "name": "Jim McMullan",
               "profile_path": "/ySSDNXhh5xpXbfpYDibBkjWPH5s.jpg",
               "id": 42978,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Lt. Grayson",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e036a2f",
               "name": "William Wellman Jr.",
               "profile_path": "/s6u3wVq37HIYsH4Zmpg4oRGrXVV.jpg",
               "id": 96308,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Walter Blakely",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e036a33",
               "name": "Aron Kincaid",
               "profile_path": "/3Wdf3RxWxsdz5c7yIg8FvUNQF9N.jpg",
               "id": 98169,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0369d3",
               "name": "Norman Tokar",
               "profile_path": "/y2hkH0JWWy6iUbxefaxIZDK3yKb.jpg",
               "id": 83413,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0369d9",
               "name": "Bill Anderson",
               "profile_path": null,
               "id": 49962,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c8c3a368484e0369df",
               "name": "AJ Carothers",
               "profile_path": null,
               "id": 37877,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0369e5",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c8c3a368484e036a13",
               "name": "Kyle Crichton",
               "profile_path": null,
               "id": 1281861,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c8c3a368484e036a19",
               "name": "Cordelia Drexel Biddle",
               "profile_path": null,
               "id": 1281863,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c8c3a368484e036a1f",
               "name": "Kyle Crichton",
               "profile_path": null,
               "id": 1281861,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 3.068691,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25445,
      "vote_count": 9,
      "budget": 0,
      "overview": "A happy and unbelievably lucky young Irish immigrant, John Lawless, lands a job as the butler of an unconventional millionaire, Biddle. His daughter, Cordelia Drexel Biddle, tires of the unusual antics of her father--especially since the nice young men around town all fear him. Wouldn't you fear a father-in-law that keeps alligators for pets and teaches boxing at his daily Bible classes?",
      "similar": [],
      "original_title": "The Happiest Millionaire",
      "runtime": 172,
      "poster_path": "/uHglTUmLm77lWiOwqm8HE43MPGa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1967-06-26",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Tokar"],
      "runtime": 141,
      "synopsis": null,
      "writers": [
         "Kyle Crichton",
         "Cordelia Drexel Biddle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061749/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDYzMDczNTczNl5BMl5BanBnXkFtZTcwMTAwNTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Fred MacMurray, Tommy Steele, Greer Garson | See full cast and crew »"],
      "reviews": [
         "Yes, \"The Happiest Millionaire\" was Walt Disney's last film. Yes, it was obviously made to top \"Mary Poppins\" and yes, like many late-sixties musicals, it flopped at the box office. But the fact remains that it is a glowing, beautifully made musical (with songs by the Sherman Brothers who were responsible for \"Poppins\") and it never got the recognition it truly deserved. The cast, headed by Disney Stalwart Fred MacMurray and legendary star Greer Garson (in her last film appearance) is excellent. The musical numbers are fun and engaging and the players do them well. Both Lesley Ann Warren and John Davidson were introduced in this film and proved an ideal pair of romantic leads. Warren, who became an overnight star courtesy of her delightful performance as Cinderella in the 1965 Rodgers and Hammerstein television musical, literally shines as Cordelia Drexel Biddle. Many scenes are stolen by Geraldine Page playing Davidson's haughty mother, and Tommy Steele can sing and dance with the best of them. There is also a grand performance from Gladys Cooper as the family matriarch. And, for \"Poppins\" fans, Hermione Baddely appears as the Irish housekeeper. There is also a brief bit by Joan Marshall, the star of William Castle's \"Homicidal\" (billed as Jean Arless) as a maid. The fact that this story is (loosely) based on the prominent Biddle family of Philadelphia, adds to the fun. Because the film was released after Disney's death and exhibitors complained about its long running time, it was drastically edited, shortening and removing several scenes, as well as one musical number (\"It Won't Be Long Till Christmas\"), and here is where the controversy comes in. Garson was originally cast as Mrs. Duke, after the part was turned down by several actresses, including Geraldine Page. Just before filming began however, Page changed her mind, and Greer ended up as Mrs. Biddle. (a part she was not anxious to play). She agreed to the switch when she heard the score--especially \"It Won't Be Long Till Christmas\" which was her one musical number. Indeed she COULD sing, and she did so in a few of her '40's films. Because her song was subsequently cut from the film (after it's Hollywood world premiere) she declined to attend any further premieres, though she had been at the Hollywood opening. Thanks to the newly restored roadshow edition, the song has been restored, and Garson and MacMurray perform it to perfection, truly the highlight of a warm and wonderful story that makes for perfect holiday viewing.",
         "I am not sure why some of the people disliked the film so much. The musical score by the Sherman Brothers is first class, the casting excellent, and the story moving. It seems to me those who review films like this in the negative really can't sit down and be entertained for a few hours. One doesn't always need a deep movie....a person can watch this film and feel good when it's over, and to me, that's what film is best at. I just watched for the 6th time the dvd of the roadshow edition, and it is much better than the edited version. The ending was too abrupt before, and now we have not only an extra song, but a much better climax, that of a grand musical. Leslie Ann Warren and John Davidson make their screen debut, and both are perfectly cast. The soundtrack on the dvd has been restored and sounds wonderful, especially in scenes with an orchestra, and the picture quality is very good for the period. The best thing about this film is the score of the wonderful Sherman Brothers. Songs like FORTUOSITY,ARE WE DANCING, I'LL ALWAYS BE IRISH, DETROIT, NO DILLY DALLY, THERE ARE THOSE are much under-rated. This is an excellent original musical score. Highly recommend for kids, families, and grown ups with a child still within.",
         "The Happiest Millionaire has stayed with me since the first time I saw it when I was a child of four. Since then I have watched this brilliant blend of brilliant writing, music and even better acting dozens, perhaps a hundred times. Why should my comments weigh a little heavier than other posted? Because I am only 21 years old. This movie came out twenty five years before I did and my love for it speaks of its timeless charm. I won't give away one single hint of the plot for those who are checking this having never seen the film. Do yourself a favor and let the picture remind us of a time ( a time some of us have never known) of great innocence and beauty. I speak not only of 1916, when the film took place but also of 1967 when shortly before his death Walt Disney himself oversaw the making of this movie. It has been said in reviews that this film was supposed to compete with the earlier success of Mary Poppins and while the box office or revenue reports will show that the masses did not experience it, it does not show that they would not have appreciated it. I am your run of the mill 21 year old college student who likes all sorts of movies but I treasure this and several other films of the era with many of the same actors, DO NOT MISS THIS FILM!!!!!",
         "\"The Happiest Millionaire\" is a lively musical adaptation of the hit 1957 Broadway play that starred Walter Pidgeon as Anthony Drexel Biddle. The play was written by Kyle Crichton, who adapted it from a biographical book he co-wrote with Biddle's daughter Cordelia, \"My Philadelphia Father.\" As adapted to the screen by AJ Carothers (who would go on to create the TV sitcom \"Nanny and the Professor\"), \"Millionaire\" tells the story of eccentric millionaire Biddle and his family in 1916 Philadelphia. The movie actually isn't really about Biddle at all, instead it focuses on his daughter Cordelia [Lesley Ann Warren in her big screen debut] and her impending romance with Angier Duke [John Davidson in his big screen debut]. The two youngsters fall in love much to the dismay of Angier's mother [Geraldine Page]. The clash between Philadelphia \"old money\" [the Biddles] and New York's nouveau riche [the Dukes] comes into play, but ultimately love conquers all in the final reel. Thrown in for good measure is Tommy Steele as \"John Lawless\", an Irish immigrant whose landed a job as the Biddles' new butler. He's the film's \"narrator\" of sorts and oversees the proceedings as they unfold. The score is provided by Disney veterans Richard M. Sherman and Robert B. Sherman [of \"Mary Poppins\" fame], and while this score does not exactly reach the caliber of their work in \"Poppins\" it's not entirely bad either. There are some \"gems\": \"Fortuosity\", \"Let's Have A Drink On It\", \"Valentine Candy\" and \"Are We Dancing\" among them. The choreography by Marc Beaux and Dee Dee Wood [\"Poppins\" and \"The Sound of Music\"] is brought to life by both Tommy Steele and Lesley Ann Warren. Screen legend Greer Garson is Cordelia Drexel Biddle, Sr. and generally plays it straight opposite MacMurray's eccentric-slightly goofy portrayal. Also in the cast Gladys Cooper [\"My Fair Lady\"] as Aunt Mary, Paul Petersen [\"The Donna Reed Show\"] as Anthony, Jr., Eddie Hodges as Livingston and Hermoine Baddeley [\"Mary Poppins\"] as the Biddle's maid. At an original 164 minute running time, \"Millionaire\" may seem to some a bit excessive in length, and while this may be true it is still in my opinion a very entertaining movie which for some reason or another Disney has ignored [save for an occasional 3 am screening on \"The Disney Channel\"]. It took Anchor Bay Entertainment to save this gem from relative obscurity when in 1998 they licensed the film from the Disney studios and released it on VHS and DVD in both a general release and road show edition. Disney finally got wise and finally dusted off the film's soundtrack and released the long out-of-print score in August 2002. I recommend this film for it's music, it's light-heartedness and a compelling motion picture debut by the multi-talented Lesley Ann Warren.",
         "When I saw this movie as a little girl, in the movie theater, I loved it for its songs and the dancing and especially Tommy Steele! Now that I am a grandmother, I still love it - for the above and for lots more. This movie makes me feel good - and isn't that what movies are for?",
         "When I was a boy, I'm in my 40s now, my mother would get Disney albums in the mail. They contained music from the soundtracks of movies. Consequently, I was familiar with the songs long before I had seen the films. 'Happiest Millionaire' was one of them, but I have never seen the movie until 2004 when I bought it on DVD, and it was fantastic! The version on the disc lasts close to 3 hours. It is a 'Roadshow Edition,' and that is entirely enjoyable. It begins with a music overture. In the middle of the film is an intermission, and after the movie is over, there is another musical medley with the word 'Exit' on the screen. That must have been there to remind people to leave the theater! I see that on IMDb it gets an average rating of 5.5. Maybe that comes from the shorter, lesser cuts of the film. This restored edition is much better than that. My children loved it, too! They were literally glued to the screen for the duration of the movie. This is easily the most musical of any film I have ever seen. That is one of the reasons the movie is so entertaining. Tommy Steele looks as if he is having a lot of fun, and that feeling is contagious. 'Happiest Millionaire' was released in 1967, the year after Walt Disney died, but he loved this film. The music is by the Sherman brothers, the same duo who gave us the unforgettable tunes in 'Mary Poppins.' I think it is sad that these kinds of films are no longer made. The great family oriented musicals are gone. Can anyone recommend 'Moulin Rouge' or 'Chicago' to their children? And yet, this is not necessarily a kids' movie. Walt Disney had the genius to understand that things need to appeal to everyone. That was the inspiration behind Disneyland. Out of four stars, I rate this: ***",
         "This picture has some excellent songs written by the same team of song writers that wrote the award winning songs for Walt Disney's MARY POPPINS. The opening number of \"Fortousity\" is a delight. Although this movie is based on a true story about Cordelia Drexel Biddle, I would recommend it more as a lighthearted and fun movie for the whole family.",
         "I have always loved musicals, but I've never cared for the most popular ones from the 50s and 60s, such as \"The Sound Of Music\". However, \"The Happiest Millionaire\" scores on every level. The music is superb, and there's a ton of it. Tommy Steele does indeed steal the show as a new immigrant who shows up for an interview to become a butler, not quite realizing how wacky the Biddle family really is. His tunes are the most lively, particularly the bar scene. However, others such as Fred Macmurray and Leslie Anne Warren really shine here too. And who knew John Davidson had talents outside of being a game show host? This is a real diamond in the rough. Some minor guidelines - the Roadshow edition has quite a bit of extra footage, and for those of us who know the standard edition by heart, it's great to find little bits and pieces (20 minutes worth, overall) that we've never seen, including parts of some of the songs. However, the standard edition is a tighter movie and keeps things moving more quickly - and since the standard edition is already over 2 hours and 20 minutes, I'd recommend it first. Then if you like it, the Roadshow gives you more of the best stuff. This was Disney's last picture, and from all accounts he loved it, even though it was unsuccessful due to being released at just the wrong time. With 30 years distance, though, it is still so much fun that I'd love to see it made into an actual Broadway show. Oh, well, one can dream...",
         "I remember the first time I saw this terrific film. I was nine going on ten and living in Westchester County, New York, at the time. \"Happiest Millionaire\" was the Christmas attraction at Radio City Music Hall that year [1967] and it was a delight! The performances, particularly those of Tommy Steele, Fred MacMurray, and Leslie Ann Warren are all bursting with effervescence and energy, and the Sherman brothers' songs, if not up to their work on \"Mary Poppins,\" (But, then, what could be?) are consistently pleasant and enjoyable. As the last complete film that Walt Disney was to oversee before his death, it's one of his best latter-day works. Which is why I find the critical drubbing it's taken over the years, particularly Leonard Maltin's in his book \"The Disney Films,\" so hard to understand. \"Happiest Millionaire\" is what many family films try to be today, rarely succeeding. I was given a video of it as a present recently and found it just as enjoyable as I did 32 years ago, if not more so. Plus, living in the Philadelphia area as I do today, there's the historical interest, as well. In short, \"Happiest Millionaire\" was great in 1967, and even better today. If you can see it, by all means do. You'll be in for a rare treat and a hidden treasure from the Disney vaults!",
         "A combination of desires- to top \"Mary Poppins\" and to capitilize on the then-current trend of big-budget, three-hour musical films playing to roadshow audiences- caused Walt Disney to make this film, the last he personally oversaw. He hired several of the same people to work on it that had worked on \"Poppins\", including the songwriting team of the Sherman brothers, the chereography team of Marc Breaux and Dee Dee Wood, and supporting cast member Hermoine Baddely in much the same role of the acerbic maid. In addition, he spent freely on costumes and production and hired an impressive cast, including Fred Macmurry, Greer Garson, Tommy Steele, Gladys Cooper, Geraldine Page, and in their film debuts, Lesley Ann Warren and John Davidson. The result was a pleasent, somewhat entertaining but all-around silly and, for the most part, instantly forgettable confection. Yes, it's fine for the whole family, but it will be hard for the kiddies (and even the adults) to stay awake as the rather simple story is stretched to nearly three hours, with a series of plotlines connected by merely a shimmer all going on at once. Macmurry is at his least inspired, making the title character into a bumbling, blustering idiot; it's pretty hard not to cheer whenever someone shows him up, verbally or physically. The songs are nice enough, but only one or two really stick in the memory, and half of them are totally irrelevant. (I saw the restored roadshow edition; there are a variety of other editions that cut out several of the songs) Still, Tommy Steele is likable as the forever perky Irish butler (He gets a very hummable song to sing called \"Fortuosity\") and the chereography certainly is lively. The songs, for all the irrelevance of many of them, really move the picture along, as it slows down considerably whenever the screenplay takes over. It's too bad Disney's last film couldn't have been better, but oh, well. That's life."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["A happy and unbelievably lucky young Irish immigrant, John Lawless, lands a job as the butler of an unconventional millionaire, Biddle. His daughter, Cordelia Drexel Biddle, tires of the unusual antics of her father--especially since the nice young men around town all fear him. Wouldn't you fear a father-in-law that keeps alligators for pets and teaches boxing at his daily Bible classes? Cordelia decides to run off to boarding school and promptly finds the man of her dreams. Unfortunately, his family doesn't approve of Biddle's outrageous antics, either. A Disney musical punctuated by snappy songs and an energetic debut by Tommy Steele. This is reportedly one of the last live- action films Walt Disney personally oversaw."],
      "budget": 0
   },
   "movielensId": 2049,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-06-26",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Norman Tokar"],
      "runtime": 172,
      "movieId": 2049,
      "title": "The Happiest Millionaire",
      "mpaa": "",
      "actors": [
         "Fred MacMurray",
         "Tommy Steele",
         "Greer Garson",
         "Geraldine Page",
         "Gladys Cooper",
         "Hermione Baddeley",
         "Lesley Ann Warren",
         "John Davidson",
         "Paul Petersen",
         "Eddie Hodges",
         "Joyce Bulifant",
         "Sean McClory",
         "Jim McMullan",
         "William Wellman Jr.",
         "Aron Kincaid"
      ],
      "imdbMovieId": "0061749",
      "originalTitle": "The Happiest Millionaire",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A happy and unbelievably lucky young Irish immigrant, John Lawless, lands a job as the butler of an unconventional millionaire, Biddle. His daughter, Cordelia Drexel Biddle, tires of the unusual antics of her father--especially since the nice young men around town all fear him. Wouldn't you fear a father-in-law that keeps alligators for pets and teaches boxing at his daily Bible classes?",
      "tmdbMovieId": 25445,
      "avgRating": 3.29032,
      "releaseYear": "1967",
      "numRatings": 217,
      "posterPath": "/uHglTUmLm77lWiOwqm8HE43MPGa.jpg"
   }
}