{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0114798",
      "video": false,
      "title": "Unstrung Heroes",
      "recommendations": [
         78128,
         47841,
         20328,
         18921,
         49803,
         49940,
         91873,
         32013,
         104732,
         53151,
         18856,
         51321,
         41587,
         29162,
         34615,
         99877,
         140071,
         336666,
         34024,
         91217
      ],
      "backdrop_path": "/hpp5WzQaj102T0PDan9IM5nMZxU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Selma Lidz",
               "gender": 1,
               "credit_id": "52fe4846c3a36847f815f513",
               "name": "Andie MacDowell",
               "profile_path": "/znSR45ZcNNlb1sNP1gYmVACYI2a.jpg",
               "id": 1533,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sid Lidz",
               "gender": 2,
               "credit_id": "52fe4846c3a36847f815f517",
               "name": "John Turturro",
               "profile_path": "/70V4hwvWN0J3aX2LzQg7eKCeq29.jpg",
               "id": 1241,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Danny Lidz",
               "gender": 2,
               "credit_id": "52fe4846c3a36847f815f51b",
               "name": "Michael Richards",
               "profile_path": "/fhUgS8p7YBSwDNEFb7WO0jdItBx.jpg",
               "id": 50807,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Steven Lidz",
               "gender": 0,
               "credit_id": "5494e3cac3a36831b80006d4",
               "name": "Nathan Watt",
               "profile_path": null,
               "id": 1238944,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Arthur Lidz",
               "gender": 2,
               "credit_id": "5494e3d892514130fc001535",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4846c3a36847f815f50f",
               "name": "Diane Keaton",
               "profile_path": "/fzgUMnbOkxC6E3EFcYHWHFaiKyp.jpg",
               "id": 3092,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5494e3efc3a3686ae9002d1c",
               "name": "Richard LaGravenese",
               "profile_path": "/8AF47SFj7L50qpWIz8PmdOEcU62.jpg",
               "id": 2163,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.837415,
      "production_countries": [],
      "id": 52856,
      "vote_count": 9,
      "budget": 0,
      "overview": "Steven Lidz, unhappy with his home life since his mother got sick, goes and lives with his two crazy Uncles. There he changes and gets closer to his Uncles, but his parents want him home even though he is finally happy and popular. Written by Todd Weiser",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         10735,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         242224,
         376867,
         394117,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "Unstrung Heroes",
      "runtime": 93,
      "poster_path": "/puMRjRJYE5TX1ffwuqoLXW9iLqq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
         "name": "Hollywood Pictures",
         "id": 915,
         "origin_country": ""
      }],
      "release_date": "1995-09-15",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Sometimes you find your heroes in the most unlikely places",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Diane Keaton"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Franz Lidz",
         "Richard LaGravenese"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114798/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1ODY5NDUzMl5BMl5BanBnXkFtZTcwNDgwNjUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Andie MacDowell, John Turturro, Michael Richards | See full cast and crew »"],
      "reviews": [
         "Since this story goes back and forth between a comedy and a really sad, dramatic story, I guess you could call it unique. The drama is much more at the end involving Andie McDowell's character. Supposedly, this is a true-life story of Steven \"Franz\" Lidz and his wacky family - the kid (Nathan Watt), the father (John Turturro) and the two uncles (Maury Chaykin and Michael Richards.). The story has a lot of Jewish flavor and religious themes, pro and con. It's not an easy story to explain so I won't go past what I've said that it's simply an interesting portrait of a different-kind of family with lots of laughs early on but tears later. You could get an idea early on that it's kind of a sweet movie, but there are some uncomfortable scenes in here. There is a little bit of about everything, guaranteed to strike everyone's emotions somewhere along the way. The story stayed with me long after I first watched it.",
         "OH! How could anyone NOT love this movie? It's so good. Andie MacDowell and John Turturro make such a cute movie couple. The real show stealer was Michael Richards. Through the movie, you're not saying, 'Hey, why is Kramer being serious?' Instead, you say, 'Wow, Michael Richards is a good actor.' This was a rare opportunity to see him do a better-than-Kramer-by-not-being-Kramer performance. I would love to see him do more serious work like this. It's very tearful at the end. Parts are mildly funny, but this movie is pure drama and it's beautiful.",
         "\"Unstrung Heroes\" is incontrovertible evidence that Diane Keaton is a great director. It focuses on Steven Lidz, a Jewish boy in the early 1960's whose happy life is upset when his mother Selma (Andie MacDowell) is diagnosed with cancer. Unable to bear it, he moves in with his blacklisted uncles, Danny (Michael Richards) and Arthur (Maury Chaykin). They teach Steven about his Jewish heritage, and by the end of the movie, he has had his bar mitzvah and feels freer in his existence. Some of the plot points may seem a little hackneyed, but Diane Keaton knows how to tell the story so that it isn't a cliché. A very good look at how the general atmosphere and zeitgeist in a certain part of American history affected one family.",
         "What is it about these movies that touches one so much? I think it's because of the lack of more movies like these and also because of the innocence in them, that we as adults want to hold on to. This movie was a baggage of surprises for me...Finding Andie McDowell play a role very different from the ones she has so far played. It was a pleasure to see a mainstream Hollywood actor like her act in a movie that is not very commercial. It is a children's movie, but is thankfully devoid of the new-kid-on-the-block talk we hear in so many \"children's\" movies. Learning later that Diane Keaton was the director was another really pleasant surprise! She has done a very commendable job with this movie! What I liked about this movie was how a child's world was captured, with the camera almost being a character in the movie as it explored places hitherto unknown...the camera was almost made to be an extension of Steven's character, with he, like Alice in Wonderland being awed and overwhelmed by the absurd world of his uncles and other adults. Nothing in the world could have accentuated the beauty of this movie than Thomas Newman's music. This man is a maestro of sorts! His music for the movie 'Corrina, Corrina' is one of my favorites! Interestingly, even in that movie, his best renditions are while showing the world through a child's eyes(Tina Majorino). Newman's music brings to the movie an other worldly quality. It lends to the otherwise mundane lives of the characters an aura of mystery, magic and a celestial quality that makes them so memorable! He is really one of the best Hollywood music directors at the moment and I only hope that he continues to spin his magic as he has been doing for so long! Nathan Watt as Steven has given a really sensitive performance..he's the main protagonist of the movie, it is his world we are drawn into. Kudos to him for such an endearing performance! Michael Richards is excellent as the phony-bashing uncle of Steven's!! He's getting better everyday, with his recent portrayal of Mr. Micawber in the latest version of 'David Copperfield'. The rest of the cast, all of them are really good! The last scene, when Steven is watching video tapes of his mother with his father is one of the most touching in the movie... This is one of those movies that celebrates the innocence of a child and a few adults who want to retain that innocence in a superficial and phony world.",
         "This movie shows how you can find heros in the most unlikely people and places. Michael Richards character, Danny, was out-spoken and rude, but his quote, \"People, they get trapped in their own history unless someone shows them a way out\" is a great way of thinking, and the movie shows the hardship of growing up and finding someone special when no one else understands what you're going through. With another great direction job of Diane Keaton, brilliant performances by Andie MacDowell, and Michael Richards and an amazing score by Thomas Newman, this movie lets you know that heros can come from anywhere and be anybody.",
         "Directed by Diane Keaton, this is a beautiful, child's eye view of a difficult but enlightening period in a young boy's life. From Franz Lidz's autobiographical book, it's the story of his experiences coming to terms with his mother's cancer (described to him by his father as \"a very bad cold\"), and the changes within his family brought about by her illness. Offered little more in the way of explanation or reassurance by his father who is naturally overwhelmed with losing his beautiful wife (well-played by Andie MacDowell), the boy bonds for the first time with his two endearingly oddball uncles. The emotional aspects and situations are expressed subtly but richly, with a warm cinematic vision. John Turturro is excellent as the boy's father, who we see as being rather cold and cerebral, always preoccupied and dismissive. The father is a genius, the mother tells her son, explaining that his scientific mind might make him seem like he's from another planet, but to try and cut him some slack and learn to appreciate him. His true feeling and human quality is finally exposed when, during an extended study of his face late in the film, Turturro shows us all the emotion of this brilliant young man who is helpless in the face of his wife's devastating disease. The certifiably mad Uncle Danny is played by Michael Richards, who is finally given the opportunity to bring his Kramer, of Seinfeld fame, to a fully realized and hilariously paranoid characterization. Going to live for a time with Uncle Arthur and Uncle Danny, the boy, Steven (re- named \"Franz\" by his uncles and played impressively by then 12-year-old Nathan Watt) experiences a look into his family history and decides to study for his Bar Mitzvah, contrary to his atheist father's wishes. He also cleverly engineers a solution to the \"Lindquist Problem\" (a war the uncles have going on with their landlord), and learns to care for and about the two of them. Thus he returns home to his immediate family and his dying mother, newly confident and better equipped to cherish the remaining moments of her life. This is a special movie and I couldn't recommend it more highly. There's no sense of the maudlin where it might have gone that way, but there is great humor that will be enjoyable to a wide range of ages.",
         "Very nice, touching movie. Made me cry. A story of a boy coming of age while dealing with a dying mother and rebelling against his father all in the context of a loving extended family. The (Jewish) cultural angle gave it authenticity. A fine performance by Nathan Watt but that John Turturro is really something. Michael Richards was essentially Kramer again. Interesting in that it is a woman director (Diane Keaton) who brings this story of male family love to the screen. While mom is very loving as well, she sadly and symbolically abandons Steven/Franz by dying and it is the weird (eccentric and harmlessly schizophrenic) uncles who support him thru it all, once again posing the question, \"Who really are the crazy (or heroes, for that matter) among us?\" I give it an 8.",
         "Thank you Diane Keaton! This movie is outstanding! My mother passed away from Cancer in 1983 when I was only 13 years old. This movie explains exactly how one can feel as a young kid.(i.e. 'going crazy'-Uncle Danny, the need to find pleasure in 'simple things' \u0096Uncle Arthur). I have seen this movie about 20-30 times and it gets better each time. I'm not sure why this movie is not more accepted 'main stream' or why it did not do better---financially-when it was in theaters----but I really appreciate Mrs. Keaton making this movie. From the need to find God, the frustrations and anger that the father faced, and the need to just be a kid and try to enjoy life while you watch your mother pass away, this is exactly how you feel when going through this.",
         "Based on Steven Lidz's memoir of his childhood in New York. His father is (we are told) a brilliant inventor; Steven adores his mother and is adored in return. Steven's relatives include two genially crazy uncles, Danny and Arthur, who live together in an apartment across town. Precise diagnoses are never discussed and their behavior is seen from the point of view of a boy, but they both appear to have variants of schizophrenia, Danny being paranoid and Arthur more undifferentiated. Steven's almost blissful family life is cruelly interrupted when his mother becomes ill with cancer. Unhappy with his home life after the change, he 'runs away' to live with his uncles. Their apartment is a crowded archive of their mental illness. Steven is alternately fascinated and mortified by their bizarre behavior, but by sharing their world, he becomes a better person. This movie has no real plot or payoff, but it is captivating and moving. My upbringing was completely different from Steven's, but as a member of a Jewish family that has produced both some very bright people and some very crazy people, I can say that the film conveys the accuracy of 'felt life'. It is the antithesis of today's usual deadly conformist, formulaic and violence-ridden Hollywood films. Nathan Watt does a very good job as Steven. John Turturro as his father is part of the long and distinguished tradition in American film and television of Italians playing Jews (and vice versa); he's done it at least once before (\"Barton Fink\"). You can't help but see a bit of Cosmo Kramer in Michael Richards's performance as Danny. Best of all was Arthur as played by that shambling, rumpled Canadian bear Maury Chaikin. Most of the IMDb reviews rave about Andie MacDowell, but this Jewish reviewer feels that in fact she was woefully miscast as Steven's mother Selma; in her looks, her speech, her mannerisms, her body language, and her demeanor, she totally fails to convince as a New York Jewish woman. This was the sort of role that should have gone to someone like Lisa Edelstein, Bette Midler, Tovah Feldshuh or Debra Winger.",
         "I've seen this one once before, long ago, but it is still a movie with a fresh and emotional impact I can't ignore. Maybe you could say that the characters Danny and Arthur are somewhat obviously eccentric, but being played by 'Kramer' and Chaykin, they know just how to pull my strings, as did the rest of the cast (Turturro, MacDowell, Watt). In the end there a few lines by 'Franz' that are a little too much on the obvious and sentimental side, but it's easy to forgive this warm, yet sometimes painfully harsh - somehow in an understated manner - film. Add to that the beautiful cinematography, settings and music and you can't go wrong. A touching story about disease, death, growing up, faith, ideals, paranoia, misfits ánd love... the whole shebang, no less, and still very charming - an admirable achievement. A big 8 out of 10."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Hollywood Pictures",
         "Roth-Arnold Productions"
      ],
      "summaries": ["Steven Lidz, unhappy with his home life since his mother got sick, goes and lives with his two crazy Uncles. There he changes and gets closer to his Uncles, but his parents want him home even though he is finally happy and popular."],
      "budget": 0
   },
   "movielensId": 205,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-15",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Diane Keaton"],
      "runtime": 93,
      "movieId": 205,
      "title": "Unstrung Heroes",
      "mpaa": "",
      "actors": [
         "Andie MacDowell",
         "John Turturro",
         "Michael Richards",
         "Nathan Watt",
         "Maury Chaykin"
      ],
      "imdbMovieId": "0114798",
      "originalTitle": "Unstrung Heroes",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["fPjFjAWYTLc"],
      "plotSummary": "Steven Lidz, unhappy with his home life since his mother got sick, goes and lives with his two crazy Uncles. There he changes and gets closer to his Uncles, but his parents want him home even though he is finally happy and popular. Written by Todd Weiser",
      "tmdbMovieId": 52856,
      "avgRating": 3.50833,
      "releaseYear": "1995",
      "numRatings": 1380,
      "posterPath": "/puMRjRJYE5TX1ffwuqoLXW9iLqq.jpg"
   }
}