{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "counterfeiting ring",
            "id": 179294
         },
         {
            "name": "the love bug",
            "id": 208361
         }
      ],
      "imdb_id": "tt0080861",
      "video": false,
      "title": "Herbie Goes Bananas",
      "recommendations": [
         14140,
         10869,
         14136,
         19378,
         27549,
         15310,
         51036,
         9699,
         18966,
         70259,
         27786,
         11955,
         248506,
         83407,
         53229,
         87704,
         67221,
         35780,
         83857,
         112672
      ],
      "backdrop_path": "/l7yrTK8n1h6u8IlKdtK39AWMQ5x.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tante Louise Trends",
               "gender": 1,
               "credit_id": "52fe44bb9251416c7503efaf",
               "name": "Cloris Leachman",
               "profile_path": "/8ByYhjEHavhZiQYriHVXsWUfu8c.jpg",
               "id": 9599,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Davy Johns",
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efb3",
               "name": "Charles Martin Smith",
               "profile_path": "/fahfWqqrdJwajrfEGmEOXQ1p9bm.jpg",
               "id": 1270,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Pete",
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efb7",
               "name": "Stephen W. Burns",
               "profile_path": "/pcCj82CsVlpMUDxDftXuvsI8Eyv.jpg",
               "id": 71391,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Melissa Drake",
               "gender": 1,
               "credit_id": "52fe44bb9251416c7503efbb",
               "name": "Elyssa Davalos",
               "profile_path": "/6QSNrFFzzSbzo8utcDyVeksWvPP.jpg",
               "id": 71392,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Paco",
               "gender": 0,
               "credit_id": "52fe44bb9251416c7503efbf",
               "name": "Joaquin Garay, III",
               "profile_path": "/hk6HV5ZObZzSfPAe2wTeav8UKRB.jpg",
               "id": 71393,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Capt. Blythe",
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efc3",
               "name": "Harvey Korman",
               "profile_path": "/zXLYvJP3ReKPI6lJr2VuDGupL1j.jpg",
               "id": 13640,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Shepard",
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efc7",
               "name": "Richard Jaeckel",
               "profile_path": "/pTTfCxMxjBvxkcemCBwNqEiHXce.jpg",
               "id": 58423,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Quinn",
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efcb",
               "name": "Alex Rocco",
               "profile_path": "/u2JStL4Pk9Huq1xmrjqezfysivt.jpg",
               "id": 20752,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Prindle",
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efed",
               "name": "John Vernon",
               "profile_path": "/8jESb02RChcuBEh4yZrLHElNhWa.jpg",
               "id": 17580,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Chief Steward",
               "gender": 2,
               "credit_id": "544e9bbe0e0a264c9a00058a",
               "name": "Fritz Feld",
               "profile_path": "/kTS9wZWTKH61e3e7k2LQOuBIle8.jpg",
               "id": 13821,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Armando Moccia",
               "gender": 2,
               "credit_id": "544e9bd80e0a26421e0005f4",
               "name": "Vito Scotti",
               "profile_path": "/pN3aRdEF78xyCHsZrju56FO12wK.jpg",
               "id": 82779,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Garage Owner",
               "gender": 0,
               "credit_id": "544e9bf0c3a3686376000533",
               "name": "Jose Gonzales-Gonzales",
               "profile_path": "/1ZQv7WPrs4zJ3j5szJ6F32DIvGm.jpg",
               "id": 190781,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Store Owner",
               "gender": 2,
               "credit_id": "544e9c050e0a26585c0002c1",
               "name": "Ruben Moreno",
               "profile_path": null,
               "id": 179096,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Store Owner's Wife",
               "gender": 1,
               "credit_id": "544e9c18c3a368565d0005c6",
               "name": "Tina Menard",
               "profile_path": null,
               "id": 1172830,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Bus Driver",
               "gender": 2,
               "credit_id": "544e9c2c0e0a264c9a0005a7",
               "name": "Jorge Luis Moreno",
               "profile_path": "/hNYMKnyVJVuAWwgBtkfyk4k0JyO.jpg",
               "id": 1008513,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efd1",
               "name": "Vincent McEveety",
               "profile_path": null,
               "id": 15657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bb9251416c7503efd7",
               "name": "Don Tait",
               "profile_path": null,
               "id": 62755,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c7503efdd",
               "name": "Ron W. Miller",
               "profile_path": null,
               "id": 12863,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c7503efe3",
               "name": "Frank V. Phillips",
               "profile_path": null,
               "id": 58007,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c7503efe9",
               "name": "Gordon D. Brenner",
               "profile_path": null,
               "id": 68134,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 4.624301,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12129,
      "vote_count": 60,
      "budget": 0,
      "overview": "The adorable little VW helps its owners break up a counterfeiting ring in Mexico.",
      "similar": [
         14136,
         14140,
         70428,
         102664,
         102712,
         191278,
         354747,
         102662,
         270783,
         102715,
         102653
      ],
      "original_title": "Herbie Goes Bananas",
      "runtime": 110,
      "poster_path": "/wopSyv8aYHpoAYyJtU5pwwvRsgW.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1980-06-25",
      "vote_average": 5.1,
      "belongs_to_collection": {
         "backdrop_path": "/hgi9EeU50KFhv9pCDmJyx4VLp5G.jpg",
         "name": "Herbie Collection",
         "id": 12087,
         "poster_path": "/uFvt8t7HlB6BzjiJDU6ea1eI28L.jpg"
      },
      "tagline": "Yes, We Have A Bananza!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vincent McEveety"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Don Tait",
         "Gordon Buford"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080861/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2NDA5MTMwM15BMl5BanBnXkFtZTYwMDk1Mjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Charles Martin Smith, Stephen W. Burns, Cloris Leachman | See full cast and crew »"],
      "reviews": [
         "This third and last theatrical sequel to the classic Walt Disney Production The Love Bug (1969) brought the enormously successful franchise about a magical Volkswagen to a screeching halt. Herbie deserved a better send-off. There's just no love left in the poor little disrespected cash-car. Filmed on the cheap in Mexico, this entry has none of the quality and charm of its original and trashes all that was good about the preceding sequels. Vincent McEveety, the weakest of Disney's three main directors during this period, was assigned the project after having done a fair job with Herbie Goes to Monte Carlo, but makes no effort to elevate the project above the level of its poor script. The frenetic, maudlin result is one of the worst Disney films. Talented comic performers Harvey Korman, Cloris Leachman and Charles Martin Smith are wasted on unfunny material. Only the clever stunt and effects work save this mechanical destruction derby from oblivion. The Love Bug was eventually revived for a brief TV series and made-for-TV movie, but Disney was flogging a dead V-Dub.",
         "Easily the weakest of the series, this is a film the Herbie franchise could have done without. Having a child as the nominal lead in an essentially adult role is a surprisingly common motif in children's movies; surprisingly, because more often than not it fails to work and it certainly fails here. Eight-year old taxi drivers? I think not, not even in Mexico. Our Paco is more annoying than lovable and I found myself rooting for the villains instead. Clearly the writers are to blame for the mess - the cast is actually quite good, e.g. you cannot ask for much better villains than John Vernon, Alex Rocco and Richard Jaeckel, but they were fighting a loosing battle against a rotten script. The best asset of the film is Harvey Korman who shows the right spirit, and is given the freedom to act out his madcap humour. Neither his routines nor his character fit very well into the story, but the story is so weak one does not care.",
         "Herbie's motor was starting to sputter, so to speak, in \"Herbie Goes Bananna's\". It can be argued that this is the weakest in the series as far as plot, characters, and Herbie himself are concerned. The title is one of the major problems of the films. Bananna's were used in only a minute spot on the film. A better title probably would have been \"Herbie Stinks in This Film\". The thinly thought-out plot, if you can call it that, has no real direction and it's not clearly explained. You had to look really hard to tell what was going on and why. Characters are another major problem with this film. Panco was little more than a prop to hold up the story; he was at best a pain and of no real help to the film. The other characters were awful - they could have been used much better than they really were. The same goes for the crooks, too. Unfortunately, Herbie doesn't add a whole lot to the film either. Compared to his other films, there's barely any slapstick commedy and he doesn't really help anybody else out in this film, unlike his other ones. Herbie definitely wore out his welcome mat here in this film. The other three are a much better alternative to this film.",
         "Yanking a few scenes from this Herbie would have been smart. Rework the \"walk the plank\" into some other way to get the bug to it's destination. There are some very comical parts in this movie. Leachman and Martin Smith put character into the movie. The rest were along for the ride and you knew it. The villains were more smart and ruthless in this episode than others. However there were some real stupid moves that disagreed with this notion. The scene with the plane and the heavy gold disk was an insult to everyone's intelligence. Great care should be used to leave magic and mystery where expected (Herbie and Coincidence)but not go beyond the laws of physics in other parts of the production. Large gold objects rolling around inside a small aircraft will destroy it very quickly. Not much racing in this one either. I find my kids watch the other Herbie movies and this sits on the shelf",
         "This was the last Herbie movie to my knowledge. If it wasn't the last, it was defintely the worst. What else do you call a movie when a Mexican child calls Herbie \"ocho\" ( he adds up Herbie famous number \"53\" and gets eight). Then this Mexican child does a horrible paint job and starts using Herbie to run a taxi service. In my humble opinion the only reason to watch this film is to see what sort cellouiod trash Disney was putting out before Michael Eisner took over.",
         "I think the makers of the Herbie franchise must have gone bananas when they conceived this pile of garbage. Every character was reprehensible except the mousy doctor. Herbie goes out of his way to help a street thug while his new owners scam an old woman and her undeserving niece. Had the movie ended with Herbie being dumped into the ocean by the maniacal captain this movie would have had some redeeming quality. My kids actually asked me to take this move off because it was completely lacking in any entertainment quality. Disney should have followed this movie up with HERBIE GOES TO THE CRUSHER. The only saving grace this movie had was Harvey Korman as the insane captain of the ocean liner. Sorry I subjected my family to this sad ending to an otherwise fun and endearing movie series.",
         "I was disappointed when I rented this - the only reason I bought it was partly for loyalty, partly to see if I missed something, if it was any better than I thought...No, in case you're wondering; it was just as lacking the 2nd time I saw it; now I'm just waiting to give it away. A lot of things were left out of this movie that made the 1st 3 so enjoyable, not just Dean Jones. I was a little surprised that he wasn't around, since his character makes a mega-comeback in Monte Carlo, but if he was in this film it'd be a black mark on his record. Jim Douglas has retired, & leaves Herbie to his nephew Pete. He & his friend Davey doubt it'll win a race, so just plan to return home w/it. When they see how fast it can go, they change their minds & decide to race in Mexico - but get delayed 50 times. Paco, a native pickpocket who swipes their & a smuggler's wallets, is invited by Herbie to hide in the trunk. He's taken along on the ship that'll get them all to the race - but is caught. The stupid pirate-obsessed captain accuses Pete & Davy of kidnapping, & when Herbie tries to rescue Paco, he orders Herbie to be thrown overboard. After landing and escaping once more, Paco finds Herbie - & runs into the smugglers, who inform him that the wallet he returned is empty. Now he steals \"Pete's\" wallet which really belongs to the thieves, & is forced to escape both by fleeing w/Herbie, the captain, & a few women Pete & Davey \"befriend\" on the boat, to stop the smugglers from stealing goods. The bull-fight they get into along the way's a highlight in the movie - partly because there's not much else to look forward to. Herbie's name was never used; the only name he gets is \"ocho\" from Paco. He can't swim - it's pretty clear he's lost that ability over time; in Love Bug he skates right over water, in Rides Again he sinks before floating like a human, here he drops like a rock & barely survives. The men pretend to like the women they meet on the ship, but it's just to get support in the race, & there's no sign that they've been forgiven. Nobody except Paco & Louise (1 of the women), had no idea until near the end that they were dealing w/a car that had brains or power. It isn't proved by a race either - for all the trouble they go through to enter him in a race, it isn't shown. I don't understand why he helps Paco the thief, even if he is loving. The title confuses me - it's a reference to Herbie's being covered w/bananas as a disguise, but that was 5 minutes at the most. He was also \"dressed\" as a taxi w/signs all over - but that didn't amuse me. The only thing that could've made this more disloyal to the series was if they'd excluded the car Herbie. I was so bored w/this I forgot the plot & characters. A good example of a bad sequel.",
         "I love Herbie - it's hard not to. However I can recognise how the four movies gradually get worse. This was the worst one. Now I'm not saying it was terrible, and I don't agree with a comment above that says \"make the kids watch something else\", but it was a disappointing effort. The Love Bug is by far the best, closely followed by Herbie Rides Again. Herbie Goes To Monte Carlo is OK, but Bananas is not very good at all. If you're not a fan of Herbie movies, you won't like this. 5/10",
         "Low Bottom Feeder final sequel to the Herbie the Love Bug series, the Spanish version albeit. This was playing on Turner Classic Movies channel yesterday and I still can't figure out how it got on there in the first place. Certainly not a classic but the exact opposite -total bomb. Even the title is stupid,the car goes bananas in every movie it's in however there is a scene in which Herbie is covered in bananas but it takes place near the end of the movie and lasts about 5 minutes. The plot involves a very irritating young Mexican boy ,bumbling crooks, a desperate pathetic Helen Roper type love starved slut played by Cloris Leachman and her niece, a goofy ships captain and two young typical guys who want to race the car. The young Mexican boy befriends Herbie who by the way never gets called Herbie except for one time in the beginning of the movie. The cars number is 53 so of course in Spanish 53 always means 5+3 ,stupid. Now we have the very irritating boy yelling ocho(Spanish for 8 at least 200 times in the movie). Come on ocho , ocho ocho. Good god I wanted to sew his lips shut. They race around the world on cruise ships and through ghetto South America , with Cloris Leachman trying to get into Harvey Korman's pants in these stupid subplot scenes which have nothing to do with the main plot of the movie and this is a Disney flick?. It gets even worse, why do some people think the bull fighting scene is funny etc, it's very stupid with the car holding a cape in its hood and driving around backwards with the bull chasing it ,meanwhile the people inside yell and scream and the kid yells toro ocho toro ocho ,, how can i keep watching. The kid also plays taxi driver and becomes the race car driver too , oh sure yeah ,disney was on something for this movie- most kids i watched it with when i was young were probably bored. In the end , a very bad irritating finale to the series. Harvey Korman is wasted in a role so beneath him its sick, he is like a stupid Captain Stubing love boat style with the worst most unfunny dialog(the writers should have been shot for the preschool humor), the rest of the cast chews scenery and the stupid horny Cloris Leachman overacting every time she looks Kormans way as if she thinks Korman would want anything to do with her gross come-ons. I've never liked her in anything shes been in, shes a terrible actress, how she won awards who knows. After the final scene ,we get treated to a very syrupy irritating ending song about friendship complete with a Spanish word thrown in every few verses like i bet you a banana mañana ,charro, amigo etc. Is this Spanglish? Oh and did i mention the above bananas are also sold by the kid to passersby, yeah id like to buy bananas that were touching a smelly rusty car and the fact they drove 600 miles in the hot sun with the bananas on the outside of the car. these little sub-scenes added no doubt to amuse small children and annoy parents. I wouldn't recommend this movie to anyone unless you want to turn your kids into numb minded dregs. Of course this may keep your 3 y/o amused for ten minutes while you run to the video store to shoot the owners for carrying this movie.",
         "The fourth Herbie took a twist of fate. No racing, no Dean Jones, and no quality movie. I thought there should have been a story where Douglas and Applegate continue on their racing quest to a country like Germany or Italy. These writers probably thought that the \"racing\" idea was too tiring to be used anymore. I did read on some site that Dean Jones did read the actual script for the \"Bananas\" movie. He said no because of the story's new twist itself. I can't blame him for that. Even if he was in that storyline, the movie might have been a bit better but still the worse. If the movie was about racing again, then Jones returns but probably not as good as Monte Carlo. Instead, new story with new characters that made no sense. Therefore, this is where the movie went wrong. This is also where the movie had the twist of fate."
      ],
      "genres": [
         "Family",
         "Adventure",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Pete Stancheck inherits from his Uncle Jim Douglas a race car being stored in Puerto Vallarta. With his friend Davy Johns (D.J. to his friends) accompanying him to P.V., Pete is dismayed to learn that the car is an older model Volkswagen Beetle. But when Pete and D.J. see what the car can do and learn that it somewhat has a mind of its own, they decide to enter it into the Brazil Grand Primeo formula one race. En route to Rio de Janeiro, Herbie, the car, gets Pete and D.J. into one predicament after another as it tries to help its new friend, a streetwise orphan named Paco, who Pete and D.J. encountered in P.V. and who stowed away in Herbie's trunk. Because of these predicaments, Pete and D.J. end up requiring a quick influx of cash and slyly enlist the help of wealthy Louise Trent and her bookish niece, anthropology doctoral candidate Melissa, to be their financiers. Pete's role in the scheme is to woo the shy Melissa, about which he feels guilty. But initially unknown to all of them, Paco, who picks pockets to survive, is being chased by criminals from who Paco inadvertently stole some film which shows the whereabouts of some Incan treasures. As they collectively and individually work their way to Rio, Herbie must ultimately protect Paco, Pete, D.J., Louise and Melissa from the bad guys, while conversely prevent the bad guys from pillaging the treasures. Through it all, will romance bloom between Pete and Melissa, and between Louise and the object of her affection, a cruise ship captain named Blythe, who is more reminiscent of a captain of a ship called the Bounty than of a cruise kind?",
         "The adorable little VW helps its owners break up a counterfeiting ring in Mexico."
      ],
      "budget": 0
   },
   "movielensId": 2050,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1980-06-25",
      "dvdReleaseDate": "2004-05-04",
      "directors": ["Vincent McEveety"],
      "runtime": 110,
      "movieId": 2050,
      "title": "Herbie Goes Bananas",
      "mpaa": "G",
      "actors": [
         "Cloris Leachman",
         "Charles Martin Smith",
         "Stephen W. Burns",
         "Elyssa Davalos",
         "Joaquin Garay",
         " III",
         "Harvey Korman",
         "Richard Jaeckel",
         "Alex Rocco",
         "John Vernon",
         "Fritz Feld",
         "Vito Scotti",
         "Jose Gonzales-Gonzales",
         "Ruben Moreno",
         "Tina Menard",
         "Jorge Luis Moreno"
      ],
      "imdbMovieId": "0080861",
      "originalTitle": "Herbie Goes Bananas",
      "genres": [
         "Fantasy",
         "Comedy",
         "Family",
         "Adventure"
      ],
      "youtubeTrailerIds": ["NsKl0dpczJw"],
      "plotSummary": "The adorable little VW helps its owners break up a counterfeiting ring in Mexico.",
      "tmdbMovieId": 12129,
      "avgRating": 2.51233,
      "releaseYear": "1980",
      "numRatings": 1095,
      "posterPath": "/wopSyv8aYHpoAYyJtU5pwwvRsgW.jpg"
   }
}