{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "becoming an adult",
            "id": 1412
         },
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "infant",
            "id": 3256
         },
         {
            "name": "family",
            "id": 18035
         }
      ],
      "imdb_id": "tt0104437",
      "video": false,
      "title": "Honey I Blew Up the Kid",
      "recommendations": [
         9354,
         11425,
         12139,
         332,
         10603,
         888,
         11806,
         6280,
         12154,
         10414,
         11630,
         9446,
         10438,
         9279,
         9612,
         9438,
         8989,
         11982,
         9607,
         9822
      ],
      "backdrop_path": "/ae2oJzjdGcGo14iECNnkcnLlUyI.jpg",
      "revenue": 58662452,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Wayne Szalinski",
               "gender": 2,
               "credit_id": "52fe44039251416c750260a5",
               "name": "Rick Moranis",
               "profile_path": "/rVZbTJjM4g0Um6trlLHRiBzBO7t.jpg",
               "id": 8872,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Diane Szalinski",
               "gender": 1,
               "credit_id": "52fe44039251416c750260a9",
               "name": "Marcia Strassman",
               "profile_path": "/7ZtYDqLLCiqUK4z18H1tKusBQnL.jpg",
               "id": 57418,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nick Szalinski",
               "gender": 2,
               "credit_id": "52fe44039251416c750260ad",
               "name": "Robert Oliveri",
               "profile_path": "/hakmz3osPPPI1zPXaQjXxkj2avn.jpg",
               "id": 1908,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Adam Szalinski",
               "gender": 2,
               "credit_id": "52fe44039251416c750260b1",
               "name": "Daniel Shalikar",
               "profile_path": null,
               "id": 68379,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Adam Szalinski",
               "gender": 2,
               "credit_id": "52fe44039251416c750260b5",
               "name": "Joshua Shalikar",
               "profile_path": null,
               "id": 68380,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Clifford Sterling",
               "gender": 2,
               "credit_id": "52fe44039251416c750260b9",
               "name": "Lloyd Bridges",
               "profile_path": "/qez0xZiQGt3f530vAGcoYAWd7FM.jpg",
               "id": 2177,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Nosey Neighbor",
               "gender": 1,
               "credit_id": "565009b49251414b070062f2",
               "name": "Julia Sweeney",
               "profile_path": "/mOl6ecUZ1F6XIh1jvPnxzkrRMXn.jpg",
               "id": 11806,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Nosey Neighbor",
               "gender": 0,
               "credit_id": "565009c19251414af5006366",
               "name": "Linda Carlson",
               "profile_path": null,
               "id": 1212058,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Mandy",
               "gender": 1,
               "credit_id": "5a4ff4400e0a26369a000460",
               "name": "Keri Russell",
               "profile_path": "/6fZ5ceRvZtRkRm06HgaV4qCpJNY.jpg",
               "id": 41292,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260bf",
               "name": "Randal Kleiser",
               "profile_path": "/dtSwBcwtYZL9ir9zfKZaTdwdiSm.jpg",
               "id": 8876,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260c5",
               "name": "Stuart Gordon",
               "profile_path": "/6izi3lpxy9tQgiLtxYjOVYxOmCf.jpg",
               "id": 27991,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260cb",
               "name": "Brian Yuzna",
               "profile_path": "/71c5cOYzuDD8q0AZCNPFg7bcRP5.jpg",
               "id": 27992,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260d1",
               "name": "Ed Naha",
               "profile_path": null,
               "id": 52122,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260d7",
               "name": "Garry Goodrow",
               "profile_path": "/wqoBQvY6HGhYA3VvG9iDoKzpz6t.jpg",
               "id": 4203,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260dd",
               "name": "Thom Eberhardt",
               "profile_path": "/etx0mXlGZLPOAcCSySYz49YWs8A.jpg",
               "id": 68381,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260e3",
               "name": "Peter Elbling",
               "profile_path": null,
               "id": 68382,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260e9",
               "name": "Albert Band",
               "profile_path": null,
               "id": 19708,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260ef",
               "name": "Edward S. Feldman",
               "profile_path": null,
               "id": 11302,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c750260f5",
               "name": "Stuart Gordon",
               "profile_path": "/6izi3lpxy9tQgiLtxYjOVYxOmCf.jpg",
               "id": 27991,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44039251416c750260fb",
               "name": "Dawn Steel",
               "profile_path": null,
               "id": 11899,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c75026101",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44039251416c75026107",
               "name": "John Hora",
               "profile_path": null,
               "id": 16156,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44049251416c7502610d",
               "name": "Harry Hitner",
               "profile_path": null,
               "id": 56284,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44049251416c75026113",
               "name": "Michael A. Stevenson",
               "profile_path": null,
               "id": 45862,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 11.625974,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11158,
      "vote_count": 363,
      "budget": 40000000,
      "overview": "Wayne Szalinski is at it again. But instead of shrinking things, he tries to make a machine that can make things grow. As in the first one, his machine isn't quite accurate. But when he brings Nick & his toddler son Adam to see his invention, the machine unexpectedly starts working. And when Adam comes right up to the machine, he gets zapped along with his stuffed bunny.",
      "similar": [
         49519,
         19724,
         334,
         7972,
         10693,
         93456,
         433,
         2698,
         12689,
         271,
         7326,
         7345,
         8967,
         866,
         634,
         11631,
         73,
         88,
         693,
         5176
      ],
      "original_title": "Honey I Blew Up the Kid",
      "runtime": 89,
      "poster_path": "/gwda8CnPAfHGwygclGiKddt60fX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Touchwood Pacific Partners 1",
            "id": 8830,
            "origin_country": ""
         }
      ],
      "release_date": "1992-07-16",
      "vote_average": 4.9,
      "belongs_to_collection": {
         "backdrop_path": "/sfT3NqSnjEDY1449qBgQRWOIcaq.jpg",
         "name": "Honey, I Shrunk the Kids Collection",
         "id": 72119,
         "poster_path": "/xxIwqQARS0RZu5cIENahqZSRw2a.jpg"
      },
      "tagline": "The BIG Laughs Start January 6th!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Randal Kleiser"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Stuart Gordon",
         "Brian Yuzna"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104437/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNTQ0NDc4NF5BMl5BanBnXkFtZTcwMTcxNTcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rick Moranis, Marcia Strassman, Robert Oliveri | See full cast and crew »"],
      "reviews": [
         "Here's another example of the sequel being slightly better than the original, at least in my humble opinion. However, the original (\"Honey, I Shrunk The Kids\") was nothing super, not something you'd call a \"classic.\" It was \"pretty good.\" This one is \"good.\" It had more laughs and less irritating kids. There is still the stupid teen romance, but not emphasized as much as in the first movie. The little kid in here, who is turned into a giant, is cute and affable and his giggle is fun to hear. The first 40 minutes of this film are the best. It gets a little too silly after that. At the end, Disney succumbs to the craze of the early '90s: having a woman punch out a man. In this case, it was nice mother (Marcia Strassman.) Give me a break! The special-effects were okay but not totally convincing. In fairness, it's not easy trying to produce the effects of a 100-foot child walking down the streets of Las Vegas, but they've still come along way from the days of \"The Attack Of The 50- Foot Woman\" in 1958. However, there is still room for FX improvement. Overall, some good laughs in the film and - with one exception - likable characters.",
         "This one is pretty good. Those who say that he runs around in a stupid King Kong or Godzilla like fashion are wrong. Does he eat anybody? No. Does he kill anybody? No. He is just a normal baby that has had an accident that most babies never have. He does break things, but that does not mean that he is a terror to society, or should be killed, or tranquilized. Moranis is excellent as his usual \"eccentric\" role in all three of these movies. Too bad the Szalinski's moved, because I liked the Thompsons from the original. I bet they either had to move because of Nick and Ron always at each others throats, or because Amy and Little Russ could never be parted. But it seems like Amy has forgotten all about Little Russ Thompson by now, because she just goes off to college with no regrets or worries. Bridges was good as Wayne's boss-totally different than his much earlier role as Harvey, the deputy, in the priceless classic, High Noon.",
         "I don't mind sequels, some are great like Home Alone 2 and Empire Strikes Back, some are nothing special but can be an improvement over their originals like Garfield 2 and others that belong in the garbage like Home Alone 4 and NeverEnding Story 3. This sequel really isn't that bad, at this point I don't think it belongs in either of these categories but in a category titled \"a sequel that isn't as good as the original, but a sequel worth watching\". It is very daft, even more dafter than Honey, I Shrunk the Kids, with a very silly final 20 minutes and the pacing at this point in the film isn't as strong as it was in the first 40 minutes, which was fun, fun, fun personified. Still, it is very entertaining for a number of reasons. It is nicely filmed, with a good soundtrack and some fun gags and physical comedy. But it was the performances that made it worthwhile. Rick Moranis reprises his role as Wayne and is immensely likable as always, and Marcia Strassman is great as Diane. Daniel and Joshua Shalikar are very cute as Adam, who has a nice, funny little laugh that doesn't grate, thank goodness. The other kids give appealing performances once again, the teen romance is evident here and is rather sappy, but hey I can live with that. Overall, for a sequel, this is really not bad. 7/10 Bethany Cox",
         "That affable, amiable, absent minded professor family man Wayne (Rick Moranis) is back, but now his experiments in size are funded by a big time company and he's a hot property. Unfortunately, his new toddler son, Adam, is the one who gets zapped this time, but instead of shrinking, he's turned into a toddler of Godzilla proportions. If you thought Wayne's wife was unhappy with Wayne shrinking their older son Nick and daughter Amy (who only cameos here) in the first film, just wait till you see her lose it here when she finds out her little boy Adam here! Now it's a race against time for Wayne to shrink Adam back down to size before he's destroyed by an uncaring society, with help from his now teenage son Nick and his girlfriend, Kerri Russell before she hit it big with \"Felicity\". May strain the cuteness for some, will warm the hearts of others. Followed by a direct to video sequel that's not even worth the price of rental.",
         "Despite their dodgy sets and costumes, hokey acting and far-fetched story lines, the classic monster movies of the Forties and Fifties have proved strangely influential to generations of film makers. Maybe it's the potent memories of a key scene that stay with viewers long after the film has finished - take King Kong swatting bi-planes from the side of the Empire State Building or Godzilla creating all sorts of carnage in Tokyo. I suspect that the key behind this movie probably lies in some rose-tinted vision of a giant baby rampaging through the desert as well as the box-office takings from the first movie. Rick Moranis (remember him?) returns as eccentric scientist Wayne Szalinski, just about hanging onto his sanity and his marriage to Diane (Marcia Strassman) after shrinking his kids and losing them in the back garden. This time, he has been working in a lab trying to reverse the shrinking process he invented. Overseen by shady project manager Dr Hendrickson (John Shea), Wayne accidentally zaps his two-year toddler Adam (Daniel & Joshua Shalikar) who begins to grow in size at an extraordinary rate. Together with his wife, his youngest son Nick (Robert Oliveri) and babysitter Mandy (Keri Russell, debuting), Wayne struggles to get the situation under control, especially when Adam begins to make his way towards Las Vegas... In essence, what we have here is your classic creature-feature but played for laughs instead of earnest damsels in distress screaming in front of rubber-suited swamp men. Primarily, this should be a special-effects exercise but sadly, this looks dreadfully old-school. \"Honey, I Shrunk The Kids\" looks better than this limp sequel does, suggesting that the resources and enthusiasm weren't really there. In truth, the movie doesn't pick up until Adam makes his way to Fremont Street amid the glittering casino fronts and panicked tourists but by then, I'd already lost interest. Performances are pretty uninspired, by and large, because the giant baby crashing through walls and trashing Hard Rock Cafes is far too cute and charismatic for anyone else to get close to. Lloyd Bridges has fun as the corporate owner of Wayne's laboratories but everybody else comes across like they're entertaining kids at a party. Which they very well may be, I suppose. There are also fairly large holes in the logic and cohesion of the story, weakening the film further still. Perhaps if you've got kids of a certain age who are fed up with endless repeats of \"Ice Age\" and \"Shrek\" then maybe this will keep them entertained but for most, this simply hasn't dated well like its predecessor. \"Honey, I Blew Up The Kid\" has one or two funny moments but is generally too reliant on suspect effects and a weak story to carry it through. Moranis was never that great a leading man and films like this weren't likely to change that anytime soon. Harsh, maybe and I'm sure that this film has some supporters but I'm not one of them. It's not as well made, entertaining or exciting as \"Honey, I Shrunk The Kids\" and now looks as crude and dated as... well, the original creature-features like \"Attack Of The 50 Foot Woman\" which at least have more charm to them. Sorry but this giant movie is a huge disappointment.",
         "The lovable Szalinskis are at it again. In this inferior sequel to Honey, I Shrunk the Kids, Dad blows up his little son to the size of a redwood. It is enjoyable enough in the beginning but after a while the filmmakers run out of ideas about what to do with a big baby. As with the first film, Moranis brings a lot of energy to his role and Strassman still looks cute but the other kids and the nosy neighbors are missed. The plot line about Moranis' wacky boss just gets out of hand and by the time the action moves to Vegas, the whole plot becomes tiresome. It may have helped if they had a cuter kid play Adam or if they had him do some funnier things.",
         "I expected some negative comments, but nearly every single one? C'mon, it's not that bad! It's really simple, stupid and (of course) illogical, but denying that there's no absurd comedic moments (the baby is kind of funny!) and no funny scenarios (the teenagers being stuck in the \"toy car\") seems bizarre to me. I loved this film as a kid. There were specials on the Disney Channel when it finally (after what seemed like forever) premiered on there, and it was a rather neat experience for an eight year old. In fact, I've watched this movie so many times as a kid that I've seen it a hell of a lot more than the unquestionably superior first movie. It was just one of those things. Watching it now, I'll admit that the special effects can be rather cumbersome and the lines are almost always pure cheeseball (Rick Moranis' especially). Also, Keri Russell's work here is absolutely terrible; after watching a lot of \"Felicity,\" I for some reason expected her to be at least near that quality. Not to mention the stupid \"villian\" who hits the baby with some projectile; very, very mock able. But it's a nice little dumb movie! Who cares! It's certainly not \"sequel hell,\" etc etc. It's entertaining at the very least.",
         "Honey I Blew Up The Kid is a decent family movie with an average story line.The movie will definitely entertain a younger audience,but adults watching this movie with their kids will probably be bored,although I will say it isn't a horrible family film,its not the best,but its not the worst.The original,Honey I Shrunk The Kids,is definitely a much better movie for the whole family to watch.Honey I Blew Up The Kid will appeal to very young children,but the older audience will be bored,and fans of Honey I Shrunk The Kids will be disappointed by this sequel. Wayne Szalinski (Rick Moranis) gets himself into another very difficult situation when a new experiment causes his youngest child keep growing more and more stories tall.",
         "\"Honey, I blew up the kid\" is wildly fun. When I first saw it back in '92, I couldn't believe how fun the film was. I actually prefer somewhat than Honey, I shrunk the kids. The characters were interesting. The whole relationship between Adam and Wayne was adorable and genuine. Wayne's character was very well developed as a clumsy genius who feels his wife doesn't think he knows what he's doing. And Adam himself has a great babyish personality that I found interesting and absorbing. This movie is a definite must-see. It reminds me a lot of Roland Emmerich's \"Godzilla\" more than any of the other godzilla movies. I also like how the movie doesn't copy from the original at all.",
         "Wayne Szalinski (Rick Moranis) is at it again in Nevada. His house is full of his inventions. His wife Diane (Marcia Strassman) takes their daughter Amy away to college. His son Nick pines for the lovely Mandy Park (Keri Russell). Wayne has licensed his invention to Sterling Labs but they have trouble enlarging. While Wayne and Nick work on the machine, little Adam gets zapped without their knowledge. Soon Adam is growing larger and larger as he wrecks havoc upon Las Vegas. There is something fun and magical about kids shrunk down living in the small world. A giant baby isn't the same thing. It plays differently like a B-horror hybrid. I'm not sure why the sister comes and then leaves the movie. Maybe she had something better to do. Also I don't like putting a corporation and military into the mix. It has some fun moments but it gets more and more tiresome."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Touchwood Pacific Partners 1",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "Wayne Szalinski is at it again. But instead of shrinking things, he tries to make a machine that can make things grow. As in the first one, his machine isn't quite accurate. But when he brings Nick & his toddler son Adam to see his invention, the machine unexpectedly starts working. And when Adam comes right up to the machine, he gets zapped along with his stuffed bunny. Now, whenever Adam comes near anything electrical, the electricity causes him to grow. Adam soon starts to grow to the height of over 100 feet. And he is now walking through Las Vegas which he thinks is one big play land.",
         "Wayne Szalinski is experimenting with his equipment again, but this time for a large company. When an accident in the lab fries some circuits, he is barred from the lab. But 2 year old Adam, was unknowingly zapped during the accident. But Wayne and the family soon discover that something is definitely wrong with Adam. He starts growing, and growing, and growing, and growing...",
         "This time, wacky inventor Wayne Szalinski accidentally zaps his 2 1/2-year-old son with a particle beam, causing the child to grow whenever coming in contact with electricity. Soon topping 112 feet, the overgrown baby is attracted to the bright, shiny lights of Las Vegas, and nothing stands in his way! Now the chase is on.",
         "The Szalinski family is back, this time hilarious disaster strikes when an experiment causes their new toddler son to grow many stories tall."
      ],
      "budget": 40000000
   },
   "movielensId": 2053,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-07-16",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["Randal Kleiser"],
      "runtime": 89,
      "movieId": 2053,
      "title": "Honey I Blew Up the Kid",
      "mpaa": "PG",
      "actors": [
         "Rick Moranis",
         "Marcia Strassman",
         "Robert Oliveri",
         "Daniel Shalikar",
         "Joshua Shalikar",
         "Lloyd Bridges",
         "Julia Sweeney",
         "Linda Carlson",
         "Keri Russell"
      ],
      "imdbMovieId": "0104437",
      "originalTitle": "Honey I Blew Up the Kid",
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["NIury7go2bM"],
      "plotSummary": "Wayne Szalinski is at it again. But instead of shrinking things, he tries to make a machine that can make things grow. As in the first one, his machine isn't quite accurate. But when he brings Nick & his toddler son Adam to see his invention, the machine unexpectedly starts working. And when Adam comes right up to the machine, he gets zapped along with his stuffed bunny.",
      "tmdbMovieId": 11158,
      "avgRating": 2.15278,
      "releaseYear": "1992",
      "numRatings": 5315,
      "posterPath": "/gwda8CnPAfHGwygclGiKddt60fX.jpg"
   }
}