{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jules verne",
            "id": 385
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "shipwreck",
            "id": 2580
         },
         {
            "name": "volcano",
            "id": 3347
         },
         {
            "name": "pirate",
            "id": 12988
         },
         {
            "name": "south america",
            "id": 18266
         },
         {
            "name": "condor",
            "id": 181230
         }
      ],
      "imdb_id": "tt0056095",
      "video": false,
      "title": "In Search of the Castaways",
      "recommendations": [
         37204,
         40454,
         25445,
         64877,
         42779,
         43885,
         42795,
         63438,
         241939,
         29682,
         31102,
         20723,
         50717,
         257001,
         166607,
         30798,
         37969,
         18887,
         44736,
         24816
      ],
      "backdrop_path": "/qmHGDiNVnJo8eDt8oKe3QfgF6zC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jacques Paganel",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033ee1",
               "name": "Maurice Chevalier",
               "profile_path": "/3j483xgtPAplIX4CLcvsAP56Tg5.jpg",
               "id": 112972,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mary Grant",
               "gender": 1,
               "credit_id": "52fe457b9251416c91033ee5",
               "name": "Hayley Mills",
               "profile_path": "/aXXiQcIoFp7WywXDOsskfuLkRe3.jpg",
               "id": 36819,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Thomas Ayerton",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033ee9",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lord Glenarvan",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033eed",
               "name": "Wilfrid Hyde-White",
               "profile_path": "/hBLDxE2Uhf41k5bz0IhmRiKhvPj.jpg",
               "id": 15387,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "John Glenarvan",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033ef1",
               "name": "Michael Anderson Jr.",
               "profile_path": "/jjvwMOXSSXr7qtj976by14KQAmQ.jpg",
               "id": 24808,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Indian Chief",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033ef5",
               "name": "Antonio Cifariello",
               "profile_path": "/fu2T1BDNDW3IlYvVla9mp28KhVh.jpg",
               "id": 112973,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Bill Gaye",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033efd",
               "name": "Wilfrid Brambell",
               "profile_path": "/hH2RLkta481je5W8BASNxiHcS1J.jpg",
               "id": 10595,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Captain Grant",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f01",
               "name": "Jack Gwillim",
               "profile_path": "/6NOuBVu9fSWObuONEfuCtWfViBJ.jpg",
               "id": 13331,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Guard at Dockyard Gate",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f05",
               "name": "Ronald Fraser",
               "profile_path": "/8aR4DwQ1T0FA9grzGrPFygXxpR6.jpg",
               "id": 51881,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Senior Yacht Guard",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f09",
               "name": "Norman Bird",
               "profile_path": "/lHj58cWdvdkleI7lDTpRHnwqKP4.jpg",
               "id": 16275,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Ayerton's Assistant",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f0d",
               "name": "George Murcell",
               "profile_path": null,
               "id": 90625,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Maori Chief",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f11",
               "name": "Inia Te Wiata",
               "profile_path": null,
               "id": 112975,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Rich man at Yacht party",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f15",
               "name": "Mark Dignam",
               "profile_path": "/7tzFChShd2AY0yYNE540yyKhJrY.jpg",
               "id": 93967,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Crooked sailor",
               "gender": 0,
               "credit_id": "52fe457b9251416c91033f19",
               "name": "Michael Wynne",
               "profile_path": null,
               "id": 58699,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "South American Guide",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f1d",
               "name": "David Spenser",
               "profile_path": null,
               "id": 112976,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Crooked sailor",
               "gender": 0,
               "credit_id": "52fe457b9251416c91033f21",
               "name": "Milo Sperber",
               "profile_path": null,
               "id": 39817,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Patagonian prisoner",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f25",
               "name": "Roger Delgado",
               "profile_path": "/bPtlbUq1lJwLHslk0fnFfGi1Wvb.jpg",
               "id": 21607,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Irish claimant",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f29",
               "name": "Barry Keegan",
               "profile_path": null,
               "id": 112977,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Sailor",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f2d",
               "name": "Maxwell Shaw",
               "profile_path": null,
               "id": 112978,
               "order": 19
            },
            {
               "cast_id": 23,
               "character": "Crooked sailor",
               "gender": 2,
               "credit_id": "52fe457b9251416c91033f31",
               "name": "Andreas Malandrinos",
               "profile_path": null,
               "id": 24336,
               "order": 20
            },
            {
               "cast_id": 24,
               "character": "Robert Grant",
               "gender": 2,
               "credit_id": "54da147c9251410a39001853",
               "name": "Keith Hamshere",
               "profile_path": null,
               "id": 1425502,
               "order": 21
            },
            {
               "cast_id": 25,
               "character": "Yacht Seaman",
               "gender": 2,
               "credit_id": "59135e70c3a36864d405bedb",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457b9251416c91033ed7",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457b9251416c91033edd",
               "name": "Lowell S. Hawley",
               "profile_path": null,
               "id": 83126,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 2.138432,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34774,
      "vote_count": 25,
      "budget": 0,
      "overview": "In Search of the Castaways is a 1962 Walt Disney Productions feature film starring Hayley Mills and Maurice Chevalier in a tale about a worldwide search for a shipwrecked sea captain. The film was directed by Robert Stevenson from a screenplay by Lowell S, Hawley based upon Jules Verne's 1868 adventure novel Captain Grant's Children.",
      "similar": [
         71805,
         205775,
         18444,
         10488,
         58,
         1865,
         166426,
         285,
         810,
         9016,
         581,
         2270,
         10693,
         281957,
         120,
         597,
         22,
         122,
         49529,
         167073
      ],
      "original_title": "In Search of the Castaways",
      "runtime": 98,
      "poster_path": "/u2bUxq4uhqJ2PUrrxqJlBwvLvkR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1962-12-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A Thousand Thrills, And Hayley Mills!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Lowell S. Hawley",
         "Jules Verne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczNjczMTU1Ml5BMl5BanBnXkFtZTcwMTA3MzgyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Hayley Mills, Maurice Chevalier, George Sanders | See full cast and crew »"],
      "reviews": [
         "Wonderful Jules Verne fantasy via Walt Disney has jolly, ne'er-do-well Frenchman Maurice Chevalier helping two children convince a ship's captain that the kids' father, a captain lost at sea, is shipwrecked on an island near South America. The journey begins, and soon the whole gang faces every form of a raging Mother Nature trying to reach the castaway. Hayley Mills is near the peak of her ladylike charms here, never lovelier than when singing \"Castaway\" under the stars by guitar or cooking breakfast with Chevalier in a treetop. Maurice himself is a wily coot, and Wilfred Hyde-White is brusquely amusing. Well-produced yarn with fine effects does tail off in the second-half, but there are many requisite Disney-adventure pleasures to be had. Enjoy it! *** from ****",
         "Captain Grant disappeared in the south seas. A bottle with some message suggests he is not dead, as most people in authority choose to believe, but alive and imprisoned. His three children determine to rescue him. THE CHILDREN OF CAPTAIN GRANT was written in 1866-1868 (the year it was published). It followed Verne's first novel successes (FIVE WEEKS IN A BALLOON, A JOURNEY TO THE CENTER OF THE EARTH, FROM THE EARTH TO THE MOON, and - his first North Pole novel - THE ADVENTURES OF CAPTAIN HATTARAS). Of these first six titles, five have been made into films. CAPTAIN HATTARAS can't be made into a film, because Verne was wrong about the state of the North Pole (he put a live volcano there that we know is not there). Pity because it is a good story, deserving a film treatment, with a chilling conclusion. It has been suggested that the genesis of CAPTAIN GRANT is the determination of Lady Jane Franklin in sacrificing her fortune to find out the fate of her husband Sir John Franklin and his Northwest Passage Expedition of 1845-48. Possibly, however, it is something more current than the Franklin Mystery (already solved in 1859, and somewhat old-hat in 1868). The question of whether Thomas Castro was the actual Sir Roger Ticheborne, wealthy, missing baronet, was a growing issue in England in 1868 (it would not be legally settled - against Castro/Arthur Orton - in 1874). That may have been tied to what Verne had in mind. Also the long lost fate of the French explorer La Perouse in the South Seas (in 1788 - his fate is mentioned in TWENTY THOUSAND LEAGUES UNDER THE SEA). In any event, THE CHILDREN OF CAPTAIN GRANT was the first three volumes of seven (or eight - depending on one's counting of sections of TWENTY THOUSAND LEAGUES) volumes that were interlinked. Verne loved cross-connecting stories (in ROBUR THE CONQUEROR he suggests the appearance of an orbiting mystery at the start of the novel is actually an artificial satellite created by Professor Schultz in THE BEGUM'S FORTUNE). He never got this involved again (subsequently, however, he plays a private joke in AROUND THE WORLD IN 80 DAYS, when Princess Aouda is rescued from being burned alive at her husband's funeral: the husband is the usurper of the title of Prince Dakar who is Captain Nemo). CAPTAIN GRANT traces the world wide search for the Captain by his three determined children and their French tutor, which go through South America and the South Seas. The villain is one Ayrton, a sailor who imprisoned Grant for his own purposes on a small island near New Zealand. At the end of the novel, Aryton is punished for his treachery to Grant (and Grant's children) by Lord Glenelg, who promises to leave him there for only 10 years alone, roughly the time Grant was marooned. Then comes the story of Nemo and the Nautilus in TWENTY THOUSAND LEAGUES (published in 1870). Then comes THE MYSTERIOUS ISLAND (1873). A party of five men, led by Captain Cyrus Harding, from Libby Prison in Richmond escape in a balloon in a hurricane as the American Civil War is ending. They land on an uncharted island in the Pacific (called \"Lincoln Island\"), which they build up into a livable environment. They keep finding machinery and books to help them. Also they find a trail that leads them to the rescue of Aryton, nearly insane from loneliness, off a nearby island. Eventually they learn that the dying Nemo (on his submarine) is responsible for their safety and survival. Nemo dies, the island is destroyed in an eruption (the novel has been compared to a study of the growth and destruction of civilization), and Lord Glenelg's yacht comes to rescue the castaways and Aryton. It is a long, complex series of stories. Movies have been made of CAPTAIN GRANT, TWENTY THOUSAND LEAGUES, and THE MYSTERIOUS ISLANDS. However, no miniseries (nine parts possibly) has been suggested for the whole three novels. Possibly because the adventures are so fantastic they stretch our imagination too far. This Walt Disney production is satisfactory for CAPTAIN GRANT and good fun. Hailey Mills was given another of her early star turns in this film, and Maurice Chevalier was coasting on his starring turn in GIGI four years earlier (as well as his appearance as Panisse in FANNY). One can watch this film as an entertaining adventure flick, with Disney's typical good production values. It is actually quite easy to take.",
         "Part of Jules Verne's trilogy that includes \"20,000 Leagues Under the Sea\" with Captain Nemo as the antagonist, \"Mysterious Island\" with Captain Grant as the castaway protagonist going up against Nemo, and \"The Children of Captain Grant...aka 'In Search of the Castaways'\" with (as the titles suggests) the children of Captain Grant as the protagonists in search of their castaway father. Even if Walt Disney had made \"Mysterious Island\" (in 1961 another studio made a pretty nifty though obviously 60's style sci-fi movie from it) there still wouldn't be much to tie this film to Walt Disney's classic starring Kirk Douglas and James Mason. Without knowledge of the characters from \"Mysterious Island\" there is no clue that the Grant children live in the same world as the first film, let alone that of Captain Nemo. With that said, the film does work as a wild and fun Disney adventure (Disney films are a genre all their own). Starring familiar Disney faces such as Hayley Mills and Maurice Chevalier (hey it could have been Annette Funicello and Burl Ives) this is Walt Disney's film not Jules Verne's and a good time can be had by the whole family. Some of the special effects are inferior to Disney's standard but Mills and company are very watchable as are the endless stream of natural disasters that befall them. Recently remakes have been made of \"20,000 Leagues Under the Sea.\" Too bad a mini-series involving the entire trilogy wasn't tackled. Just a thought.",
         "A journey looking for captain Grant (Jack Gwillim) is realized by a teenage girl Hayley Mills (Pollyanna), her little boy brother along with two veterans (Wilfrid Hyde White and singer Maurice Chevalier) and a young man (Michael Anderson Jr.) . During the long travel they find natural disasters as earthquake in the Andes , fire and flood in the ocean and volcano in New Zealand and they attempt to overcome . Besides they encounter different tribes as Araucans (an Indian chief played by Antonio Cifariello ), Patagons (Argentina) and Maoris (New Zealand). The picture contains adventures , humor , emotion , songs , stirring action and sensational outdoors . The film displays some scenes have you on the edge of your seat as the amusing images when the protagonists sledge over floe . Excellent , powerful cast with sympathetic Hayley Mills and Maurice Chevalier and with the cynic George Sanders . Colorful cinematography reflecting marvellous landscapes by Paul Beeson . Lively and evocative music by Willyam Alwyn . Abounds matte painting and special effects by the Disney specialist Peter Ellenshaw . It's a winning Disney effort made by its usual director Robert Stevenson (Herbie , gnome mobile , Mary Poppins) . It's a must for the Disney fans but is beautifully released , being recommendable for all family and especially for little boys public . Rating : Good and entertaining.",
         "I recently watched this movie for the first time and found very enjoyable and it is a good old adventure movie. The only thing I didn't like about it were the songs, which seemed pointless and did not fit in with the storyline. An excellent cast, which includes Hayley Mills (Tiger Bay), Wilfred Hyde White (North West Frontier), George Sanders (Village of the Damned) and Wilfred Brambell (Steptoe and Son). All play excellent parts and they seem to be enjoying themselves. The special effects are excellent too. While searching for Hayley Mills's dad, the expedition encounters dangers such as an earthquake, volcano, tidal wave and flood, cannibals, a leopard and a rather unfriendly giant eagle. They do find him at the end, alive and well. I found this movie excellent but the songs do let it down slightly. Rating: 4 stars out of 5.",
         "How wonderful to see a movie the entire family can watch. Fine acting and plenty of music and laughter along with suspense, drama and human kindness. Not to be scared if a child will curse or anything to upset the audience. Maurice Chaviar and entire cast is superb. What a wonderful movie to just sit and relax and know you will be entertained. I never get bored watching this movie. When I was stationed in the US Army at Russelsheim, Germany,I got to see this movie in the German language. Again, it is a pleasure to have another entertaining motion picture to view over and over with family and friends. Thank You Walt Disney and his staff.",
         "We loved this film as kids, now we're older it retains its appeal but in a different way. It really is the funniest film ever. The search party: - encounter a earthquake and survive by riding on two mini icebergs through ice palaces which appear to be inside a mountain - have one member of the party (Robert, the sweet little brother) carried off by a giant condor to feed her young - get flooded and live in a huge ombu tree for weeks (alongside some kind of big cat which is also trapped there) - go through a thunderstorm that causes above-mentioned tree to catch on fire, giving them the option of being burnt to death or eaten by crocodiles, which are now of course swarming around the tree - or get rescued - get locked up in a tiny hut with a madman who's been there for apparently about fifty years, after being chucked off their own ship by villainous scoundrels and being washed up on an island inhabited by Maoris - and finally, survive a volcano (but the Maoris don't) There is also a love interest in the form of John, the smarmy captain's son who fancies Mary (Hayley Mills) and some funny songs, like the one Chevalier and Mills sing when living in ombu tree. Brilliant!!!",
         "A young boy and girl look for their father with the aid of a disbelieving old English captain and his young son, brought together by a Frenchman who found a note in a bottle. Seeing this movie as a youngster, I found them all delightful (altho I haven't seen alot of his work, I must agree about Chevalier being tedious listening to him explain things. Only Hyde-White's attention and irritation at Maurice diluted any that disdain this viewer may have felt). But the earthquake, the snowslide, the giant condor, the flood, the burning tree, and expecially the suddenly unexpected leopard all made for a good, entertaining film to hold my attention. The slip? Oh, we went the wrong way. Have to backtrack. Definite loss of attention as to what is going on. Pity that George Sander's speech merged with Hyde-White and Chevalier dialects couldn't have helped. Perhaps had he played the father of Mills and her brother instead of the uninteresting actor who did play the part (another downer in the film), things would have been better. Mills and her two male counterparts were delightful to see when I was young so I still enjoy them now. Old Bill Gaye was a definite pick-me-up the film needed. A shame the regular cast couldn't have held on to the film to the end. In watching this movie now, I can't help but check out the characterization of the natives performing their 'ceremony' while the prisoners are escaping. Especially check out the expressions of the 'chieftain'. Hilarious.",
         "First of all let me say that any film with Maurice Chevalier will automatically get a look from me. Even though Hayley Mills was Walt Disney's number one star at the time, Chevalier's international status as a performer guaranteed him top billing. The younger cast members had a lot to do in keeping up with him. Robert Gwillim who is a sea captain and father to Hayley Mills and Keith Hamshere has been lost at sea for many years now and who knows where in this wide world with 5/6 of it covered by ocean. But a swallowed bottle with a note that was found in the belly of a shark by scientist Maurice Chevalier sends the three of them in search of Gwillim's employer Wilfrid Hyde-White to finance an expedition to search. Said note leads them first to South America and then to Australia because Maurice misreads the clues. He did that a lot in this film, an occupational hazard with eccentric scientists. This was the Magic Kingdom's second dealing with a Jules Verne story, the first being the classic 20,000 Leagues Under The Sea. Sad to say while In Search Of The Castaways has some interesting moments and in spots looks more like an Indiana Jones film, it does not make it above the juvenile level. Watching it today, I expected to see Harrison Ford ride in with bullwhip cracking to save the whole kit and kaboodle of them from villain George Sanders. Maurice's first mistake took them 10,000 miles out of their way. It's not often one gets a second chance there.",
         "Based upon Jule's Vernes 'Captain Grant's Children', In Search of Those Castaways (1962) is an incoherent yarn about Mary Grant (Haley Mills), the determined daughter of a missing sea captain (Jack Gwillim) who sets about traveling to exotic ports and hidden mysterious locales in search of dear IL' daddy. On this trip she takes family friend and confident, Jacque Paganell (the marvelous Maurice Chevalier) and meets up with the unscrupulous and hardened, Thomas Ayerton (George Sanders). The cast also includes Wilfred Hyde-White as the stuffy Lord Glenaravan and Michael Anderson Jr. as his son John. But Robert Stevenson's direction on this occasion seems to fall apart on a series of vignettes that have no coherent or driving narrative. Verne's works usually present this sort of problem for screenwriters, in that Verne himself often wrote episodic stories that later became loosely strung together as fantasy novels of their day; visionary \u0096 then; stagnant and wholly unappealing by 1960s standards; completely out of touch by today's expectations. Peter Ellenshaw's matte paintings extend the world of fantasy that Mary and company traverse to good effect. There's some great trick photography taking place during the flood sequence. There's also Chevalier warbling a very family friendly little ditty, 'Enjoy it.' In the end, it seems hard to take up Chevalier on that musical request. The end of the story is a forgone conclusion by reel two. We know Mary's going to find her father; it's a Disney film. There seems to be some discrepancy as to the proper aspect ratio for this film; 1:33:1 or 1:75:1. The theatrical prints appear to have been printed in the latter format since title credit sequences on this DVD occasionally run off the top and bottom of the screen. However, an usual practice occurred in the late 1960s and early 70s in American cinema, whereby certain films were shot in full frame for the sake of economy and then artificially cropped to 1:75:1 for theatrical presentation. Having explained this; the print for In Search of Those Castaways might very well have been one such film, with title sequences specifically formatted for the 1:75:1 theatrical engagement. Hence, when Disney remastered the DVD they forgot to format the titles for 1:33:1 to avoid confusion. At the very least, these credits have not been framed properly. At worst, Disney has given us another full frame only version of a widescreen movie. Yet, for the rest of the presentation, everything looks pretty much as it should. There is no apparent cropping to speak of and scenes appear quite natural in 1:33:1. As for the rest of the image quality: colors are quite solid, pure and rich. Blacks are deep. Whites are generally clean. Film grain is present during the matte shots but absent elsewhere for a picture that will surely not disappoint. The audio is engaging, if dated."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "An earthquake, a flash flood, an avalanche, a volcano, alligators, jaguars, mutineers, and a man-eating Maoris dog the steps of a shipping company owner, a scientist, and the two children of a lost sea captain as they circle the earth along the 37th parallel per instructions in a bottled note the scientist has recovered from a shark's stomach. Only certain facts are discern from the stained note, especially the words \"37 parallel.\" Teen-age Mary Grant (Hayley Mills), her younger brother , Robert Keith Hamshere, and the scientist, French Professor Jacques Paganel (Maurice Chevalier), trick their way aboard the grand yacht, \"Persevero,\" during a bon-voyage party to see the owner of the shipping company, Lord Edward Glenarvan (Wilfrid Hyde-White),the epitome of British aloofness. With the urging of his own son, John (Michael Anderson Jr.'), Glenarvan's luxurious side-wheeler sets sail for the coastal town of Concepcion, Chile in the search for the missing Captain Grant.",
         "In 19th century England young Mary Grant and her brother Robert Grant embark on a dangerous quest to find their missing father,sea captain Grant,who vanished somewhere along the Chilean coast."
      ],
      "budget": 0
   },
   "movielensId": 2056,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-12-01",
      "dvdReleaseDate": "2005-05-03",
      "directors": ["Robert Stevenson"],
      "runtime": 98,
      "movieId": 2056,
      "title": "In Search of the Castaways",
      "mpaa": "",
      "actors": [
         "Maurice Chevalier",
         "Hayley Mills",
         "George Sanders",
         "Wilfrid Hyde-White",
         "Michael Anderson Jr.",
         "Antonio Cifariello",
         "Wilfrid Brambell",
         "Jack Gwillim",
         "Ronald Fraser",
         "Norman Bird",
         "George Murcell",
         "Inia Te Wiata",
         "Mark Dignam",
         "Michael Wynne",
         "David Spenser",
         "Milo Sperber",
         "Roger Delgado",
         "Barry Keegan",
         "Maxwell Shaw",
         "Andreas Malandrinos",
         "Keith Hamshere",
         "Joss Ackland"
      ],
      "imdbMovieId": "0056095",
      "originalTitle": "In Search of the Castaways",
      "genres": [
         "Music",
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["sBVu7oLdd1I"],
      "plotSummary": "In Search of the Castaways is a 1962 Walt Disney Productions feature film starring Hayley Mills and Maurice Chevalier in a tale about a worldwide search for a shipwrecked sea captain. The film was directed by Robert Stevenson from a screenplay by Lowell S, Hawley based upon Jules Verne's 1868 adventure novel Captain Grant's Children.",
      "tmdbMovieId": 34774,
      "avgRating": 3.37121,
      "releaseYear": "1962",
      "numRatings": 198,
      "posterPath": "/u2bUxq4uhqJ2PUrrxqJlBwvLvkR.jpg"
   }
}