{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "fashion",
         "id": 15479
      }],
      "imdb_id": "tt0114805",
      "video": false,
      "title": "Unzipped",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "herself",
               "gender": 1,
               "credit_id": "52fe4968c3a368484e129cc1",
               "name": "Sandra Bernhard",
               "profile_path": "/nYCnCtbbWjrMsmbanQLGhRM3FXh.jpg",
               "id": 3664,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "himself",
               "gender": 2,
               "credit_id": "52fe4968c3a368484e129cc5",
               "name": "Isaac Mizrahi",
               "profile_path": "/gB4s6zmaV2rjVCIPBoRv8VhNvh9.jpg",
               "id": 56696,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "herself",
               "gender": 1,
               "credit_id": "52fe4968c3a368484e129cc9",
               "name": "Naomi Campbell",
               "profile_path": "/xEEqcwmkfjGWKP1QbShGxbJbYEg.jpg",
               "id": 56367,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "himself",
               "gender": 2,
               "credit_id": "52fe4968c3a368484e129ccd",
               "name": "John Galliano",
               "profile_path": "/h8HnJGpTlA3W4V7OnSu5euYZUGb.jpg",
               "id": 547866,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "herself",
               "gender": 1,
               "credit_id": "52fe4968c3a368484e129cd1",
               "name": "Kate Moss",
               "profile_path": "/2KJ9cvdy1Sh7HjCiy66XVj2i6R6.jpg",
               "id": 533007,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "as herself",
               "gender": 0,
               "credit_id": "52fe4968c3a368484e129cdb",
               "name": "Linda Evangelista",
               "profile_path": "/kOa2pgFoHS9EA6Br20cL9fyFLs1.jpg",
               "id": 588627,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "as herself",
               "gender": 1,
               "credit_id": "52fe4968c3a368484e129cdf",
               "name": "Cindy Crawford",
               "profile_path": "/wwlVhWLQH5nWDhnbFDwbfYc4p9o.jpg",
               "id": 33665,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4968c3a368484e129cd7",
            "name": "Douglas Keeve",
            "profile_path": null,
            "id": 588623,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.080282,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 77350,
      "vote_count": 7,
      "budget": 0,
      "overview": "Using a variety of cinematographic techniques, the world of high- profile fashion designer Issac Mizrahi is portrayed as being driven by excitement and creativity, despite the concomitant chaos and cacophony. Mizrahi's frenzied genius and rollercoaster emotions paint a humorous and personal portrait of a brilliant designer. Famous \"SuperModels\", actors, and actresses populate Issac's rarified world, but Douglas Keeve's cameras capture the stress and turbulence beneath the placid coolness of glamour. Written by Tad Dibbern",
      "similar": [
         350,
         400617,
         9611,
         10206,
         4564,
         221667,
         11674,
         329833,
         4599,
         8882,
         18892,
         245775,
         16367,
         1257,
         6641,
         14533,
         11529,
         372411,
         44874,
         3080
      ],
      "original_title": "Unzipped",
      "runtime": 73,
      "poster_path": "/dnIzv4rXr9FXkqW880E3rStYQA7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-08-11",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Douglas Keeve"],
      "runtime": 73,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114805/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwODIwMTk2Nl5BMl5BanBnXkFtZTcwMzA4NDUyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Isaac Mizrahi, Roseanne Barr, Sandra Bernhard | See full cast and crew »"],
      "reviews": [
         "OK, I have seen Unzipped 4 times. I asked myself why, and I came up with a really great lie. Because watching Mizrahi stress out about his \"beast/nanook of the North\" creations makes me feel better about myself as a sane person. I use to think that the fashion industry was something special, once you have used this film to figure things out, you notice how SAD SAD SAD these people are. Designers make these costumes, famous and sickly models make them look interesting and then Anna Wintour makes you want to spend your next 5 paychecks for a stupid coat. A coat that makes you feel good for a few months, by the way thanks Donatella for that black half-trench number you came out with last year, I still feel good about myself every time I think I'm thin enough to put it on. Anyhoo, Isaac is a sad selfish mess and at the same time a very smart man with amazing taste. THe models, whom I LOVE LOVE LOVE to watch, are all tragic and annoying, save for Tara Banks and Cindy Crawford who seem to be the only models with a brain in their heads. I wanted to reach through the screen and punch Linda Evangelista for having such an annoying voice. Could you imagine Kyle having to listen to that at home? She needs to remain silent so I can see her as just utterly flawless. The film, like I said, makes me feel sane, like all my \"problems\" can be dealt with and that I don't ever have to resort to being such a hysterical end=of-the-world drama queen like Mizrahi. And his singing? and his dancing? and his annoying hair? If I had that hair I would have had it cut a long time ago. Having said this, he is richer than I will ever be and he has loads of more prospects than I will ever have. So screw me and good for him. I guess I have to admit it, I really liked this film. It's a guilty pleasure. see it.",
         "OK - so i decided to rent this because i get such a kick out of watching Isaac on his show. he's so funny and witty and entertaining - he could be that proverbial entertaining phone-book- reader. but the thing about this movie that is really so great and wonderful is not the \"insider's look into the fashion world\" or the \"glimpses of stunning supermodels\" or whatever - but rather the fact that this movie documents something rarely shown: how the creative process works, from the initial idea or spark, where it comes from and how it's developed (for Isaac - from movies and music - anything in the culture - and then he starts drawing and chatting about his ideas with family, friends and colleagues to develop it), all the way to making that idea into something tangible and concrete (and really, what i appreciate about what the movie shows, is how such a seemingly abstract or novel \"idea\" can be developed into an entire fashion collection). i study architecture, and the parallels are absolutely there for anyone in any creative or design field. i gave it a 9 out of 10 only because i wish it had been longer. PLUS another benefit of the movie: you get to see/hear Isaac play the piano. so fun. and his mother is a hoot! plus i really loved seeing a few of the really great style arbiters - Polly Mellen, Candy Pratts, Ingrid Sischy - on film. wish Andre Leon Talley had said more. and it was so fun to see mark morris and Sandra Bernhardt too! all in all a fabulous film for anyone in or interested in the creative and design fields.",
         "This is a documentary about Isaac Mizrahi at work; it's a celebration of him and the fashion world, and far more engaging than you would expect because Isaac is so engaging he almost convinces you that fashion can be interesting. It's a wild ride, and the only real problem is that there's too little Cindy Crawford (she doesn't turn up until about an hour or so into the film) and too much Naomi Campbell. But hey, that's what videos and fast-forward buttons were made for...",
         "This movie is wonderful and I've been watching it over and over since I was about 11! An intimate look at what goes on as a designer creates a collection, Unzipped shows all the people in the fashion world that mix and mingle while we watch Isaac Mizrahi come up with his latest collection for 1994. Isaac himself is hilarious with his quirks and impressions, and the characters he deals with from Eartha Kitt to Miss Mellen are ridiculous! Don't see this movie only for the supermodels because while they are there, they aren't the main focus, if you want that set up go for Catwalk instead, but here lies the whimsical tale of a collection destined for greatness and a designer who is as entertaining as his is talented.",
         "Isaac Mizrahi is what he is. I really don;t think he let his defenses down enough for this, although it seems that way at times. The film does not go far enough into the creative process, but it really makes up for that as showtime approaches. His co-workers are more interesting than the models, although they all seem to genuinely like working with the designer. The music adds much to the introspective yet whimsical tone of the film, and during the fashion show it really livens things up. I wish there were a soundtrack available. Put it this way, if you are interested in fashion or Mizrahi himself as a celebrity, you will like this, if neither is the case, you'll hate it.",
         "This documentary is reality before it tanked to the lowest common denominator, and worth watching. For someone who has only been marginally exposed to fashion, (As when I admittedly shop at Saks NY and buy off the rack), I did find this documentary intriguing and the creative ideas of Mizrahi interesting and unusual. His talent for unusual color combinations and prints is nicely manifested on the runway. Not too much pandering here to celebrity, though we do see some hangers-on in Mizrahi's daily life, his angst and ideas for a scrim (even imitated just this last week on a \"Tyra Banks\" show for Fashion Week) While I don't buy into all the hype and refuse to blindly follow fashion magazine trends, the models are lovely to watch, Cindy Crawford, Linda Evangelista, Naomi Campbell, Veronica Webb and a few others. Could now have a wider audience, \"Unzipped\" is far less shallow than more recent comparable documentaries on the fashion industry. 8/10.",
         "I enjoyed this film for three reasons. I like Isaac Mizrahi, I like fashion design, and I LOVE Linda Evangelista! If you like any of these three elements (insert your own favorite supermodel) then most likely you will also like this documentary. The fashion design element is what surprised me the most. I had no idea what it must be like to be a high end clothing designer until I saw Unzipped. All the details of the clothing designs culminate at the end with a fashion show. One of my guiltiest pleasures was watching Linda ham it up for the cameras. Cindy and Naomi didn't look too bad either. They might not be geniuses, but damn if they aren't fun to look at.",
         "I've seen 'Unzipped' many, many times and every time I see it feels as refreshing as it felt the first time. Mizrahi is very interesting, funny and talented at the same time and this film really provides insight into this man's life and career. What I like about 'Unzipped' is that it doesn't show everything. It sifts the recorded events to show something entertaining, with the reality factor still there. I also understand that some scenes like the intro or the ending are probably not \"real\", but I don't care. 'Unzipped' is more a movie and less a documentary and I love it. And it's got Sandra Bernhard in it; what more do you want? 9/10",
         "First off, I must say that I am not the likely audience for a film like this. I know almost nothing about fashion and have difficulty getting into documentaries. I did see this years ago, about the time it hit video, and while I liked Isaac, the movie didn't hold my interest. Fast forward to 2008, I've been watching Ugly Betty for two seasons. It is another unlikely choice for me, but it's over the top enough to be fun. Everyone around me loves The Devil Wears Prada, so I've seen that several times as well. Then Unzipped reappears on satellite TV, and as I watch it I see a first hand look at the world that Betty and Devil are only reflecting. Seeing it in this context I found a whole new appreciation for this movie. It's interesting, funny and dramatic in places, and it's beautifully shot. Maybe there are a lot of documentary clichés at work here, but who better to give the glamorous black and white treatment to than supermodels and fashionistas? It works, extremely well, now I understand better where it comes from. Why settle for an 'inspired by' Anna Wintour when you can have the real thing? Anyway, I'll be getting this on DVD to add to my expanding fashion-themed section. Who knew?",
         "I have seen few movies as ridiculously shallow and pretentious as this movie with the exception of maybe Jawbreaker or Titanic. Mizrahi is mistaken to think that his personality is enough to carry an entire film. We are subjected to bad singing and bizarre dance moves. He shows off his primadona authority by courageously demanding that a skrim be placed at one of his shows to reveal the models change clothes. This somehow makes him a pioneering innovator. The concept of a documentary about a fashion designer working on a collection is a great idea, but Mizrahi wants to show off his character and his connections. At times he shows us the various sources of his inspiration, but that doesn't seem to be the primary focus of the film. That primary focus is the rantings and ravings of a self-centered fool."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Hachette Filipacchi Films",
         "Miramax"
      ],
      "summaries": [
         "Isaac Mizrahi, one of the most successful designers in high fashion, plans his fall 1994 collection. He combines inspirations such as the Hollywood Eskimo look, the Mary Tyler Moore show, and Ouija-derived advise like \"dominatrix mixed with Hitchcock\" into a well-received collection. A behind-the-scenes look at the creative side of fashion.",
         "Using a variety of cinematographic techniques, the world of high- profile fashion designer Issac Mizrahi is portrayed as being driven by excitement and creativity, despite the concomitant chaos and cacophony. Mizrahi's frenzied genius and rollercoaster emotions paint a humorous and personal portrait of a brilliant designer. Famous \"SuperModels\", actors, and actresses populate Issac's rarified world, but Douglas Keeve's cameras capture the stress and turbulence beneath the placid coolness of glamour."
      ],
      "budget": 0
   },
   "movielensId": 206,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-08-11",
      "dvdReleaseDate": "2004-01-13",
      "directors": ["Douglas Keeve"],
      "runtime": 73,
      "movieId": 206,
      "title": "Unzipped",
      "mpaa": "R",
      "actors": [
         "Sandra Bernhard",
         "Isaac Mizrahi",
         "Naomi Campbell",
         "John Galliano",
         "Kate Moss",
         "Linda Evangelista",
         "Cindy Crawford"
      ],
      "imdbMovieId": "0114805",
      "originalTitle": "Unzipped",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["irIUyh38WFw"],
      "plotSummary": "Using a variety of cinematographic techniques, the world of high- profile fashion designer Issac Mizrahi is portrayed as being driven by excitement and creativity, despite the concomitant chaos and cacophony. Mizrahi's frenzied genius and rollercoaster emotions paint a humorous and personal portrait of a brilliant designer. Famous \"SuperModels\", actors, and actresses populate Issac's rarified world, but Douglas Keeve's cameras capture the stress and turbulence beneath the placid coolness of glamour. Written by Tad Dibbern",
      "tmdbMovieId": 77350,
      "avgRating": 3.47684,
      "releaseYear": "1995",
      "numRatings": 1058,
      "posterPath": "/5fY5iN8mUBLdd4fmcXwdTqAZ9Sx.jpg"
   }
}