{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "movie business",
            "id": 886
         },
         {
            "name": "costume",
            "id": 4328
         },
         {
            "name": "stuntman",
            "id": 5956
         },
         {
            "name": "swimming pool",
            "id": 8181
         },
         {
            "name": "documentary",
            "id": 10073
         },
         {
            "name": "filmmaker",
            "id": 11614
         },
         {
            "name": "hot tub",
            "id": 11830
         },
         {
            "name": "special effects",
            "id": 12093
         },
         {
            "name": "hollywood",
            "id": 12396
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "birthday cake",
            "id": 14599
         },
         {
            "name": "filmmaking",
            "id": 33490
         },
         {
            "name": "producer",
            "id": 33879
         },
         {
            "name": "making of",
            "id": 50244
         },
         {
            "name": "rainstorm",
            "id": 156507
         },
         {
            "name": "movie star",
            "id": 162262
         },
         {
            "name": "location",
            "id": 166300
         },
         {
            "name": "cast",
            "id": 166310
         },
         {
            "name": "effects",
            "id": 166313
         },
         {
            "name": "horror filmmaking",
            "id": 166323
         },
         {
            "name": "prop",
            "id": 166339
         },
         {
            "name": "movie set",
            "id": 184793
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0119165",
      "video": false,
      "title": "Full Tilt Boogie",
      "recommendations": [
         89994,
         29597,
         89662,
         43120,
         103424,
         14348,
         146490,
         43208,
         57949,
         26682,
         31281,
         56537,
         52202,
         38750,
         23125,
         44745,
         99194,
         62488,
         42542,
         47894
      ],
      "backdrop_path": "/zLyLPAhT21aXSHnLp97vx0LwaHr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f89251416c91044ad5",
               "name": "George Clooney",
               "profile_path": "/z4SBfpKDThuQY0FsvDbajcooBdA.jpg",
               "id": 1461,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f89251416c91044ad9",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f89251416c91044add",
               "name": "Michael Parks",
               "profile_path": "/54P22YwbYCwfjJWT1jbiHN77TD.jpg",
               "id": 2536,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45f89251416c91044ae1",
               "name": "Fred Williamson",
               "profile_path": "/tc4K1y80KA8RrVR8tvmSNCuvWa8.jpg",
               "id": 9811,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f89251416c91044ae5",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45f89251416c91044ae9",
               "name": "Juliette Lewis",
               "profile_path": "/eeEx3v5ElBHvlrJjULlj5I3EpPF.jpg",
               "id": 3196,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f89251416c91044aed",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe45f89251416c91044ad1",
            "name": "Sarah Kelly",
            "profile_path": null,
            "id": 115698,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.977667,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36606,
      "vote_count": 24,
      "budget": 0,
      "overview": "A documentary about the production of From Dusk Till Dawn (1996) and the people who made it.",
      "similar": [
         74643,
         7446,
         856,
         1581,
         44826,
         509,
         51828,
         294016,
         427900,
         4539,
         11353,
         188222,
         11596,
         75900,
         23830,
         282041,
         1730,
         340101,
         96936,
         11176
      ],
      "original_title": "Full Tilt Boogie",
      "runtime": 97,
      "poster_path": "/gTxkQiC5WJ7GWfnErjmIegXy6f7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-09-09",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Unzipped. Unwrapped. Unleashed!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sarah Kelly"],
      "runtime": 97,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119165/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3ODcyNDMxNl5BMl5BanBnXkFtZTcwMjczNjIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rick Stribling, Ken Bondy, Amy Minda Cohen | See full cast and crew »"],
      "reviews": [
         "This film comes included with the From Dusk Till Dawn Collectors Series DVD and it is quite a find. This isn't just about how someone did this or blah blah blah did that, this film is a real tribute to the entire crew of the film and the comradry that forms between them all on the set as well as off it. The film is basically a journey through the production of From Dusk Till Dawn from problems with the unions to sandstorms and burning sets to dealing with George and Quintin on set, which I might add, make one crazy pair (God I love that opening scene). Will you learn anything important about film-making? I'd say it's hard not to walk away from this a little more knowledgeable about the sheer heart and determination put in by people who's names you'd probably never give a second glance to but they deserve more than just a crawl by mention in the end credits and that's what this film gives them. So if you liked From Dusk Till Dawn... that doesn't necessarily mean you'll like this, BUT if you like going behind the scenes and hanging out with a film crew as they get drunk by a pool, I say you can't do any better than to go for the Full Tilt Boogie.",
         "I came across this documentary when I rented the DVD at Blockbuster. At first, I thought this would be another one of those HBO Special BS that companies usually slap on their DVDs, but from the beginning when Clooney and Tarantino were walking about the set along to the BeeGees, I was hooked. This wasn't the polished crap that I was used to, this was a full-out documentary that explored every aspect of film making. Instead of just interviewing the actors and the director, FTB interviewed the ADs, the grips, the runners, catering, the assistants, and many, many electricians. Instead of exploring about what went right in the movies, this explored what went wrong, and how the filmmakers fixed these problems. The budget problems, issues with the set design, \"union troubles,\" all of it was there. This was the real stuff. Sure it might be a lil' long, but it was refreshing to see what REALLY goes on behind the scenes.",
         "The DVD-cover on From Dusk Till Dawn didn't say anything about this little extra. I don't see why not, but it was a nice surprise. Maybe that was the effect they were looking for. Full Tilt Boogie is definitely not the standard document on making a specific film. It's no where near the quarter to half hour documentaries found as extras on many DVDs. Unlike most, this one doesn't really put emphasis on the stars, director, writers and so on. They are all there, although mostly as part of the crew rather than as individuals making well prepared statements on the movie, which can then be used for promotional purposes. The whole documentary has pretty much nothing to do with promoting the movie, which is a good thing. It seems like a movie from a young filmmaker who is out to prove herself. And in my mind, she did. She's really interested in everything going on behind the scenes. She's not afraid to take on subjects which some might find inappropriate, but which are a part of film-making. Of course the director is always central, but there is so much more going on and the other parts are hardly ever touched in a movie like this. I'm personally interested in film-making beyond the glamor, so this is a movie for me. It's also pretty entertaining and shows many of the more famous people in a different light, at least somewhat. Obviously the people on the set are just people, which means many of the things they do are quite mundane, but still a bit weird. For someone like me, I'd highly recommend this, to others... well, I'd still recommend it, but not very strongly. If the subject matter isn't for you, don't go out of your way to watch this, but if it is - or strange humor from Tarantino interests you - take a looksie.",
         "When Sarah Kelly asked Quentin Tarantino for a project, he gave her an opportunity to document the making of \"From Dusk Till Dawn\" the South of the Border-Vampire flick in which he starred with George Clooney, directed by his pal Robert Rodriguez. What we get is a frank, behind the scenes, none of that prepackaged, smooth-edged stuff you see in the press packs, or on ET. Pace yourself. For in today's world of sound and media bytes, 97 minutes may seem an eternity, but this is a well- paced, fun from start to finish feature. And don't look for Harvey Keitel, he's camera-shy when it comes to these things.",
         "I just purchased the Collector's Edition of \"From Dusk Till Dawn\" about a week ago, and last night finally got around to viewing the \"Full Tilt Boogie\" documentary, which details the making of the project from conception to post-production. Star/writer Quentin Tarantino, director Robert Rodriguez, stars George Clooney and Harvey Keitel and producer Lawrence Bender all give their insight into the making of one of the '90s' most \"cult\"-heavy flicks. Personally I'm not a huge fan of the movie, I think it's good because it's unique - something that doesn't really come out of Hollywood very often: a movie where you don't know what is going to happen next, and when you think you do...you're wrong. It's a thriller in the vein of \"Pulp Fiction\" that suddenly shifts into comedy, then into slapstick, then back into crime thriller, then into horror, then into comedy... it never stops and really is an original film. The documentary details the making of the film and opens at a comic book convention (Fangoria) where Rodriguez and Tarantino are being interviewed about their upcoming project. From then it starts back at the beginning and goes through the entire process. It's not a great documentary but it is a good one with insightful interviews and a comprehensive scope. I don't really think the film as a whole warrants any kind of \"classic\" treatment - the DVD is worthy of a finer picture some might say - but considering some of the awful five-minute HBO making-ofs that are on TV all the time nowadays, \"Full Tilt Boogie\" is a return to form.",
         "On the surface a documentary about the making of From Dusk Till Dawn, 'Full Tilt Boogie' is a frank, revealing, and ultimately informative look at independent filmmaking in today's Hollywood. Be warned, however, that if you're expecting yet another neat, polished \"making of\" documentary, you'll likely be disappointed. `Full Tilt Boogie' has none of the glitz or big budget finish, none of the behind the scenes looks at special visual and makeup effects. While it still delivers the obligatory interviews with cast and crew members, this is largely a film about the unsung heroes behind the actors, directors, and SFX maestros, about the legions of everyday men and women who help bring the movies to life. While this unorthodox approach to the `making of' documentary may not be to everyone's liking, (it's 90-plus minute running time especially may try the patience of the average viewer) `Full Tilt Boogie' is a must for any student of filmmaking, or anyone who has ever considered a career in the industry",
         "This is a really good and informative feature length documentary on the making of From Dusk Till Dawn. It covers most aspects of the film making process...Interviews with all of the cast and crew, following them around during filming and off hours from start to finish. Having to deal with issues like unions, paparazzi, weather, long hours, and unexpected fires...yet they all seem to love what they're doing. *** (Out of 4)",
         "What better way to see two of the filmmakers out of the 90s American quasi-new-wave to collaborate together then on a movie like this? More than ten years before Grindhouse Tarantino and Rodriguez teamed up- following subsequent re-writes by Tarantino of the script for Rodriguez to direct- for From Dusk Till Dawn, a drive-in movie for the 90s with lots of violence, lots of nudity and gore, some very disturbing scenes (not just with the vampires), and innuendo for two movies. Plus, did I mention vampires? This takes one into the film-making process in not just the big scheme of things but the smaller bits, like what Tarantino and Clooney's personal assistants have to do for them, or the little stories told in the breaks between shootings (the one that struck as the funniest, if bragging, was one involving a missing extra beer keg). It's not all completely fun and games, despite the opening scene showing the \"follies\" of Tarantino and Clooney trying to go through the 'back-way' to get to the set. There's drama involving the guilds, specifically the director and actor guilds, and it becomes a bump to get over in order to just continue making the movie. Later on there's detailing of just how much work has to go into making one of the vampires, and how much set-up there is in just doing one shot in the big action sequences at the T**y twister. There's even some insight from Harvey Keitel (prefaced by a very funny assortment of title cards). It's put together mostly for the fans of the filmmakers, and it wont get someone to see how extraordinary directing can be like in the making of Fanny & Alexander or something. It's a fun little doc for a very fun midnight movie; where else will you see Fred Williamson interviewed, seriously, in full vampire makeup?",
         "\"Full Tilt Boogie\" does not provide any great insight into the making of \"From Dusk 'Til Dawn\", nor does it really glimpse in depth into the world of Quentin Tarantino or Robert Rodriguez. It does, however, showcase how calm & humble George Clooney remains in a karaoke bar despite being hounded by women and hangers-on. The film serves more as an episodic confessional for a non-union film crew; explaining how they feel about their work (few consider themselves in a creative light, they are all unabashedly in it \"for the money\"), why they're in the film business (money or avoidance of the 9-to-5 routine), the best perks available (free beer, getting to watch movie stars eat), and how the crew spends their time off (getting \"sloppy drunk\" & playing a lot of guitar). There's a minor story involving union protests over the use of non-union crew members, but it unfolds without any real interest. Rodriguez & Tarantino give a brief interview where they share some funny thoughts on the work of Stephen King, there are also short moments with Clooney, as well as a playful Juliette Lewis; and Harvey Keitel gives a brief, bizarre and distant interview to Tarantino towards the end of the documentary (sorry fellas, no Salma to be found here). I enjoyed \"Full Tilt Boogie\" because I got to know what it's like to work on a film set, albeit not on the set of \"From Dusk 'Til Dawn\". But ultimately, the film didn't really end up telling me much about the people featured in it. And it didn't follow up on some items. For example, they didn't reveal who won the \"Best Butt\" contest? Oh well, I guess this film is for the hardcore fans.",
         "Everyone wants to be an insider. A veritable cottage industry has sprung up in recent years devoted to taking us \"behind the scenes\" on movie sets. One of the best films of this type is FULL TILT BOOGIE. In 1997, 26 year old aspiring film-maker Sarah Kelly talked Quentin Tarentino into letting her take a camera crew onto the set to chronicle the making of his gangsters vs. vampires horror epic \"From Dusk Until Dawn\". Viewers expecting a DVD-style \"how'd they do that\" featurette obsessed with special effects will be disappointed. But if an insightful and entertaining look at the creative process of film-making, and the people who make it happen, sounds good to you and/or you're considering a career in the industry, this movie is highly recommended. There is plenty of footage of the stars at work and at play but we also get to meet the unsung heroes behind the camera: the production designer, the art director, the craft services guy, the personal assistants, the grips, the drivers. This is Kelly's first directing attempt. Previously she had worked as a production assistant on \"Pulp Fiction\". Because she is not a slick, seasoned filmmaker, the cast and crew relax and let down their guard. At its best, \"Full Tilt Boogie\" plays like a candid and engaging \"home movie\" of day to day life on the chaotic set of a \"no frills\" independent film. There are the long hours (\"we started the day at five in the morning, now it's ten-thirty at night and I'm still working on my computer on time codes\"), the bad food (\"for lunch all I got was a piece of chicken and two pieces of bread and a melted brownie\"), the on set accidents (the saloon set almost burns to the ground after a pyrotechnics shot flares out of control) and the threat of a strike (producer Lawrence Bender has hired non-union crew members, thus incurring the wrath of the powerful IATSE union). Mother Nature also gets in the act. A sandstorm shuts down production; there is a rain delay and the daily challenges of location shooting in 122 degree California desert heat. No wonder people have to blow off steam in the nearby town of Barstow. Kelly's camera catches Juliette Lewis singing karaoke, a local girl flirts with George Clooney and Quentin and his posse warble Merle Haggard tunes by the motel pool (until other guests complain about the noise). In one scene Kelly encourages the crew to dish about on set romances. \"I could sleep with any woman on this set,\" Quentin boasts. He's kidding. (I think.) When various crew members are asked why they chose the film biz, the responses range from prosaic (\"for the money\") to poetic. \"That moment, that 1/1000th of a second as the shutter clicks, it's immortalized on film, \" says one youthful crew worker dreamily. \"I get a real rush out of that. It's documenting history, history that doesn't exist, we're making it up and it comes to life and I love it.\" 'Nuff said."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["L. Driver Productions"],
      "summaries": [
         "A docu-drama about filming From Dusk Till Dawn (1996). Sarah Kelly takes a non-union film crew onto the set and on location near Barstow of this independent, non-union production. Camaraderie and a constant eye on the shooting schedule dominate interactions. Quentin Tarantino and George Clooney mug for Kelly's camera; Robert Rodriguez, Juliette Lewis and Fred Williamson talk about craft; we watch scenes being shot; and Kelly asks crew members why they do what they do. Also, the International Alliance of Theatrical Stage Employees protests the non-union status of 'From Dusk Till Dawn', executive producer Lawrence Bender tells his side, and Kelly talks to a Variety reporter and others. What's the nature of an indie film?",
         "A documentary about the production of From Dusk Till Dawn (1996) and the people who made it."
      ],
      "budget": 0
   },
   "movielensId": 2061,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-09",
      "dvdReleaseDate": "2000-10-03",
      "directors": ["Sarah Kelly"],
      "runtime": 97,
      "movieId": 2061,
      "title": "Full Tilt Boogie",
      "mpaa": "R",
      "actors": [
         "George Clooney",
         "Harvey Keitel",
         "Michael Parks",
         "Fred Williamson",
         "Quentin Tarantino",
         "Juliette Lewis",
         "Robert Rodriguez"
      ],
      "imdbMovieId": "0119165",
      "originalTitle": "Full Tilt Boogie",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A documentary about the production of From Dusk Till Dawn (1996) and the people who made it.",
      "tmdbMovieId": 36606,
      "avgRating": 3.05405,
      "releaseYear": "1997",
      "numRatings": 148,
      "posterPath": "/gTxkQiC5WJ7GWfnErjmIegXy6f7.jpg"
   }
}