{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "scotland",
            "id": 388
         },
         {
            "name": "egg",
            "id": 5698
         },
         {
            "name": "loss of virginity",
            "id": 11254
         },
         {
            "name": "kissing",
            "id": 15055
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "gentile",
            "id": 209003
         }
      ],
      "imdb_id": "tt0120687",
      "video": false,
      "title": "The Governess",
      "recommendations": [
         152408,
         45609,
         18654,
         73116,
         66600,
         55123,
         13574,
         41768,
         14334,
         64047,
         38621
      ],
      "backdrop_path": "/vA9lNoCeSjcIjtfyTfIpAkmWta8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rosina da Silva",
               "gender": 1,
               "credit_id": "52fe49a69251416c750cecfd",
               "name": "Minnie Driver",
               "profile_path": "/iWqTeFmdoY8V8RLcH89K75AKeQN.jpg",
               "id": 6613,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mr. Charles Cavendish",
               "gender": 2,
               "credit_id": "52fe49a69251416c750ced01",
               "name": "Tom Wilkinson",
               "profile_path": "/4mxZKgdem0sQ8hJd0Y7TREwq7TJ.jpg",
               "id": 207,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mrs. Cavendish",
               "gender": 1,
               "credit_id": "52fe49a69251416c750ced05",
               "name": "Harriet Walter",
               "profile_path": "/vfpIPsC27D1ONVres7j3DgWYzdN.jpg",
               "id": 17477,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Henry Cavendish",
               "gender": 2,
               "credit_id": "52fe49a69251416c750ced09",
               "name": "Jonathan Rhys Meyers",
               "profile_path": "/A6RyyQ4GeXl0ugnGrqGqBMQIgKh.jpg",
               "id": 1244,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Clementina Cavendish",
               "gender": 1,
               "credit_id": "544550cec3a3683e0e007eeb",
               "name": "Florence Hoath",
               "profile_path": "/dBm7EM7kwNJ69snZW8JASwr7SIo.jpg",
               "id": 105351,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Lily Milk, the Maid",
               "gender": 1,
               "credit_id": "544550e10e0a2663300080e3",
               "name": "Arlene Cockburn",
               "profile_path": null,
               "id": 94502,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Rebecca",
               "gender": 0,
               "credit_id": "5445511fc3a3683e05007e6f",
               "name": "Emma Bird",
               "profile_path": "/fHhSGl0LtkelLqtVqYgDwChciHe.jpg",
               "id": 1376049,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Benjamin",
               "gender": 2,
               "credit_id": "54455151c3a3683e01007fbf",
               "name": "Adam Levy",
               "profile_path": "/kkIFpHOGRasjGYGTqx9RJEB7o2K.jpg",
               "id": 1376050,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Aunt Sofka",
               "gender": 0,
               "credit_id": "5445516d0e0a26632d008029",
               "name": "Countess Koulinskyi",
               "profile_path": null,
               "id": 1376051,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "543b3ed2c3a3681990004434",
               "name": "Sandra Goldbacher",
               "profile_path": null,
               "id": 226493,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "544550660e0a26634d007f2c",
               "name": "Sandra Goldbacher",
               "profile_path": null,
               "id": 226493,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5445507b0e0a26632d007ff4",
               "name": "Sarah Curtis",
               "profile_path": null,
               "id": 53358,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5707a940c3a3686516002bcc",
               "name": "Ashley Rowe",
               "profile_path": null,
               "id": 17791,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5707a95692514129790004d4",
               "name": "Ed Shearmur",
               "profile_path": null,
               "id": 1999,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5707a965c3a36831e800143b",
               "name": "Caroline O'Reilly",
               "profile_path": null,
               "id": 1409307,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "5707a9a1c3a36831e8001446",
               "name": "Sarah Greenwood",
               "profile_path": "/3mCY4fv9z7EdpVH09qcA2dflIcD.jpg",
               "id": 36656,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5707a9e29251412b0e0028e6",
               "name": "Caroline Harris",
               "profile_path": null,
               "id": 119117,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5707aa01c3a368650c002d22",
               "name": "Katie Spencer",
               "profile_path": null,
               "id": 36658,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5707aa2392514117cd00063f",
               "name": "Philip Robinson",
               "profile_path": null,
               "id": 1376048,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5707aa58c3a368650c002d2b",
               "name": "Liam Daniel",
               "profile_path": null,
               "id": 1427557,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 1,
               "credit_id": "5707aa76c3a36831e8001463",
               "name": "Michelle Guish",
               "profile_path": null,
               "id": 5489,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5707aa8ec3a368651100293c",
               "name": "Sally Hibbin",
               "profile_path": null,
               "id": 301826,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5707b84dc3a3686516002d6b",
               "name": "Cathy Lord",
               "profile_path": null,
               "id": 1602682,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5707b867c3a368317900132b",
               "name": "Jupiter Sen",
               "profile_path": null,
               "id": 1602683,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.065051,
      "production_countries": [],
      "id": 96196,
      "vote_count": 10,
      "budget": 0,
      "overview": "When the father of privileged Rosina da Silva violently dies, she decides to pass herself off as a gentile and finds employment with a family in faraway Scotland. Soon she and the family father, Charles, start a passionate secret affair.",
      "similar": [
         112160,
         258480,
         858,
         141,
         244772,
         634,
         401898,
         242224,
         145,
         370663,
         43923,
         8981,
         62177,
         437557,
         297762,
         27586,
         2255,
         2771,
         9587,
         3134
      ],
      "original_title": "The Governess",
      "runtime": 115,
      "poster_path": "/x5QUB2aRVWCsdJjHEoAXfWxhReR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "British Screen Productions",
            "id": 12745,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         },
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         }
      ],
      "release_date": "1998-07-31",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sandra Goldbacher"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Sandra Goldbacher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120687/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzMDczMjMyNV5BMl5BanBnXkFtZTcwNDc2MjMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Minnie Driver, Tom Wilkinson, Florence Hoath | See full cast and crew »"],
      "reviews": [
         "The myth of the governess in English literature, seems to have been the inspiration for film maker Sandra Goldbacher, who makes an auspicious debut with this feature. Never had a first time director been so blessed to be working with a winning team behind her. The glorious cinematography by Ashley Rowe, the music by Ed Shearmur, to name just two, make \"The Governess\" a satisfying movie to watch. We are taken to the England of the 1830s. The story shows us a Jewish family of means. Rosina, the oldest daughter is a sophisticated young woman who seems to thrive in that society. When her father is killed, Rosina's world goes to pieces. She decides to seek employment as a governess for a young girl in the Island of Skye, in the Hebrides. The trip Rosina undertakes in primitive transport makes her think whether she had made the right choice, or not. All she sees is the lush green of the English countryside around her. Her employers are a Scotish couple of means. Charles Cavendish is a man of science working in his own kind of photography. His wife, seems to be a woman who is bored out of her mind. The young charge, Clementina, doesn't like the idea of being bossed by the new governess. Rosina has changed her name and passes herself as a Christian by the name of Mary Blackchurch. There is also a young son, Henry, who is away at school. Mary, who has received an education in London, surprises Mr. Cavendish and soon becomes his assistant in his experiments. The admiration Charles feels toward the young woman soon turns into a passion that is reciprocated by Mary, who we are led to believe has not had any sexual experience before. This newly found passion in Charles soon gets the best of him as he feels it makes him neglect his interest, which has been helped immensely by Mary's innate intelligence. In a surprising turn of events, Mary decides that since she can't have Charles, she must leave the island and return to London, not before presenting Mrs. Cavendish with the naked picture of her husband she took, which appears to have been the excuse for the break in their illicit relationship. At the end, Rosina is back to London where she is seen practicing the new technique she learned by working with Charles in the island. Minnie Driver totally dominates the film. Her Rosina/Mary is perhaps her best role in her career. Some comments point to the fact that Ms. Driver seems older to play this woman, but in our humble opinion, she seems to have an understanding of the character and makes it come alive. Tom Wilkinson, a great actor that probably hasn't been recognized as he should, does an outstanding job in capturing Charles. Jonathan Rhys-Meyers plays Henry the son that comes back from school and ends up falling in love for the governess. Harriel Walter and Florence Hoath play Mrs. Cavendish and Clementina well. The film is a triumph for a novel director. Ms. Goldbacher clearly shows to be a voice to be reckoned with in the English cinema.",
         "I thought this movie was beautiful. It was somewhat overlooked in America when it was released in 1998, partly because it had to compete against some higher profile British films and partly because it is not commercial. It could not be sold to the general public for a very sad reason - most movie goers have absolutely no sense or knowledge of history. So, the story of being a Jewess in mid-19th Century England and Scotland would seem too odd to them. In addition, the average person might have difficulty in grasping how amazing photography was to people in those days. For those who do have knowledge of history, I highly recommend this film. Some might say that Rosina [Minnie Driver] is too much of a modern character, but intelligent women, rebellious women and highly sensual women have ALWAYS existed, regardless of the morals and hypocrisies of the times they lived in.",
         "Gorgeous, stunning film! Minnie Driver shines in this film, as do several of her co-stars. Fascinating, unusual story as well. Most of these period films end in tragedy; no if, and, or buts about it. The \"rise and fall\" of the protagonist is the norm, as many Merchant-Ivory films portray. However, one of the pleasing aspects of this film was that the ending was mixed, and not as simple as \"heroine tries for the moon; fails and is punished\". In addition, I can't remember the last time I saw Sephardic Jews portrayed in a film. The vast majority of time, only Ashkenaz Jews are pictured (Jews from northern Europe and Russia). Quite refreshing to see something new. A beautiful film overall!",
         "Do not be put off by the negative comments in the user reviews here! This is a thoughtful, lovely, well-made film. I would watch it again, which is, for me, the highest endorsement. I can not comprehend how anyone could find it \"boring\".",
         "The Governess was a beautiful film that I think deserves more credit than it got. I feel this film followed in the same quality and artistic depth as Jane Campion's 'The Piano'. Of course the story is very unique. Minnie Driver plays Rossina da Silva, a Jewess in victorian era England, who is forced to find employment in a Christian family when her father dies. She takes on the persona of 'Mary Blackchurch' a pious Christian women. She ends up in distant Scotland, where her employer turns out to be a deeply intelligent scientist - whose family feels detached from society because of his work. Mr. Cavendish's work interest Rossina and in their work they discover not only some breathtaking advances in science but new emotions and feelings, which they each explore differently. The film technique is just impeccable. There are beautiful shots on the shores of the ocean. The use of color and glass distortions makes Rosinna's Jewish world come to life like I have never seen before. I think I loved this film, not only for its story, but also because it opened up a realm to me that I had never been aware of: Jewish life in the 19th century. Minnie Driver is wonderful in this film, her Rosina is stronger than any other role I have seen her in. Tom Wilkinson of 'Full Monty' fame is also a very believable and caring Mr. Cavendish. SEE THIS MOVIE ! It is so beautiful and the soundtrack is moving, almost haunting. The governess is definitely on my list of favorite films of all time !",
         "The story is not up to great things, oft told one way or another and smacking of Jane Austen romantic drama aspirations: a beautiful jewess of sephardi descent in 1830s London decides to take the job of governess to a little girl in a great big mansion supposedly on the Island of Skye, Inner Hebrides, Scotland (though I did glimpse a bit of Glencoe, Scottish mainland, and indeed what was definitely the beautiful Cuillins on Skye) where she falls in love with the master of the household, father of the little girl, and then the son falls in love with her. Well, that alone might have you wandering over to the next projection sala or just twiddling with the remote control, if it were not for certain other factors which may well be called redeeming, so good they are. Minnie Driver certainly looks the beautiful jewess, but her interpretation goes a bit awry at times, or even careers off the rails; her performance has ups and downs of feelings and passions which do not really make much sense. Better directing might well have produced better results from Ms. Driver, as well as the fact that the focussing of the story is very much a feministic appreciation, rather slanted perhaps, forgiveably so I am not so sure, rather as if Ms. Goldbacher herself was brought up on the aforementioned Jane Austen, as well as Daphné du Maurier, a touch of the Brontës, and she finally spiced it all up with some misgivings from D.H. Lawrence. The result is a confusion of desire and sex being mistaken for romantic love. But don't we all, anyway? The excellent photography and scenification makes up quite a lot for many of these pitfalls; the costumes and the settings of the interior of the house of such lucky landed-gentry is superb, as well as the scenes in London in the opening and closing parts of the film. This visual experience is greatly enhanced by the musical setting. Ed Shearmur has done an excellent job of creating his own `sephardi' music, helped by offerings from the Israeli singer, Ofra Haza. The music contributed greatly to the setting of scenes, ably supplying tone and atmosphere. Such that I feel one could enjoy this film solely for the photography, costumes and sets, and the music, and you could quite happily skip most of the story. It is not that the story is so bad, just that it is not anything special to write home to mother about, although she might well be the first to disagree. The Sephardi songs made me remember an old recording I have of some very beautiful melodies sung by Soledad Bravo on a CBS record maybe 20 years ago and which might be found on a Sony CD. The intepretation of these songs, sung in `ladino' (sometimes called judezmo) which is an archaic form of today's Spanish, is pretty authentic. Ladino is still used today by descendents of people thrown out of Spain during the `Inquisición', and now living in parts of Turkey (specifically I found it being spoken in Izmir), Bulgaria, Macedonia, Montenegro and the Croatia coast. Within Israel of course, this language is pretty frequent.",
         "THE GOVERNESS is a moody period piece, the meandering story of a Jewish woman who, upon the death of her father, sets out to 1830's Scotland, posing as a Gentile to get work to support her family in London. Rosina - or Mary, as she calls herself in a none too subtle piece of symbolic writing - is a rudderless child, a socialite with dreams of being an actress. She strikes up an alliance with her employer, and by accident solves a crucial problem in his research with photography. Giddy with success, they begin a halting and uncomfortable affair while the eldest son of her paramour falls hopelessly (and inexplicably) in love with her. And like a child, she fails to understand the consequences of her actions - in the end, betraying those she deceived in order to make a life for herself. Many claim this is something of a feminist manifesto, but I disagree. Whether intended or not, this film only resonates with me if I think of it as a cautionary tale. In the end, Rosina's greatest disappointment is the truth - that she lied, happened upon a way to help a man she wanted to be both her father and her lover, and in the end contributed nothing but destruction. As such, the end of the film gives me the impression that nothing she did, no one she used, made her happy - and that is exactly as it should be. Did I need a movie this long and langorous to teach me this lesson? Not at all. On the contrary, had it not been for excellent cinematography, unique score and my hope that she'd get her come-uppance, I wouldn't have stuck with it to the end of the film. Fans of Minnie Driver will likely be disappointed by her uneven performance but may wish to see it anyway; I doubt young female fans of Jonathan Rhys-Meyers will be able to stay awake for the payoff they expect, and I can't help thinking this holds too little cultural detail to be of interest, even to photography buffs. The 3 points I award the film are solely for its visual style and score. On the strength of their other work, I assume the actors' performances are so disappointing because of a poor script and worse directing, but they are, in the end, unremarkable.",
         "I'm always surprised when I see a movie with Minnie Driver. She's not the best looking actress, or the most skilled but she makes every movie she's a part of worth watching. Even Disney's Tarzan was vitalized by her sparkling voice and energetic acting. This movie places the main character in a very odd position in a house with no love. The dangerous triangle betwixt the governess, the father and the son is very interesting. I would however like to have more motives and reason for the governess treatment of the son. Also that relation seems not to \"fit\" in the movie and should have been given more time to grow. The photography is beautiful and the nice singing of late Ophra Haza adds value to the movie. It has been a while since I last was left so puzzled and thoughtful after a movie. See this movie with a dear friend.",
         "I wanted to like this one - the situation was rich, and the setting unusual and interesting. But the story is swamped with childish female gothic romance elements that are hard to swallow. The director is unfairly prejudiced against the 'goy' characters -- content to let them be grotesque cardboard caricatures -- and inexplicably indulgent towards the homewrecking behavior of the heroine. The potentially interesting power struggle between the inventor and the governess is not really dealt with. Feminist film makers will get more credibility when they stop manipulating situations to throw all the sympathy to the heroine, and start dealing honestly with issues. This movie more closely resembles 'The 7 Pieces of Gold', another earnest failure, more than 'The Piano' - a real tale of passion.",
         "I found this movie to be quite beautiful, and it opened a period of history seldom explored in films. It tells the tale of a Jewess in 19th Century London who must disguise herself as a gentile to obtain employment as a governess. Her joy for life and her searching mind attract her to her employer, who is trying to discover a way to \"freeze\" the photographic image. It is very much of its time. Minnie Driver is excellent, very sensual and convincing. Tom Wilkinson is incredibly strong and attractive. The dark colors and the general sense of gloom are very well depicted. I thought it was a marvelous film."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "British Broadcasting Corporation (BBC)",
         "British Screen Productions"
      ],
      "summaries": ["When the father of privileged Rosina da Silva violently dies, she decides to pass herself off as a gentile and finds employment with a family in faraway Scotland. Soon she and the family father, Charles, start a passionate secret affair."],
      "budget": 0
   },
   "movielensId": 2062,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-07-31",
      "dvdReleaseDate": "1999-02-16",
      "directors": ["Sandra Goldbacher"],
      "runtime": 115,
      "movieId": 2062,
      "title": "The Governess",
      "mpaa": "",
      "actors": [
         "Minnie Driver",
         "Tom Wilkinson",
         "Harriet Walter",
         "Jonathan Rhys Meyers",
         "Florence Hoath",
         "Arlene Cockburn",
         "Emma Bird",
         "Adam Levy",
         "Countess Koulinskyi"
      ],
      "imdbMovieId": "0120687",
      "originalTitle": "The Governess",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["mxbJdJV5bVY"],
      "plotSummary": "When the father of privileged Rosina da Silva violently dies, she decides to pass herself off as a gentile and finds employment with a family in faraway Scotland. Soon she and the family father, Charles, start a passionate secret affair.",
      "tmdbMovieId": 96196,
      "avgRating": 3.10022,
      "releaseYear": "1998",
      "numRatings": 459,
      "posterPath": "/x5QUB2aRVWCsdJjHEoAXfWxhReR.jpg"
   }
}