{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "kleptomania",
            "id": 2548
         },
         {
            "name": "hypnosis",
            "id": 3363
         },
         {
            "name": "marital problem",
            "id": 178210
         },
         {
            "name": "hypnotherapy",
            "id": 215579
         }
      ],
      "imdb_id": "tt0124115",
      "video": false,
      "title": "Seventh Heaven",
      "recommendations": [],
      "backdrop_path": "/hmHjh0RXWINqSs1iqpMjn4IniJl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mathilde",
               "gender": 1,
               "credit_id": "52fe4a149251416c750dd053",
               "name": "Sandrine Kiberlain",
               "profile_path": "/syUJ4VwJYjrfBzENf92zGebI5ti.jpg",
               "id": 81821,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Nico",
               "gender": 2,
               "credit_id": "52fe4a149251416c750dd057",
               "name": "Vincent Lindon",
               "profile_path": "/ttfk7etXzELkW1gMSo5eH8aEzjY.jpg",
               "id": 5443,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Le docteur",
               "gender": 2,
               "credit_id": "52fe4a149251416c750dd05b",
               "name": "François Berléand",
               "profile_path": "/47NVX74FK3KCmGEF7HKmgNhvwMo.jpg",
               "id": 7693,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Le praticien",
               "gender": 2,
               "credit_id": "537f77190e0a2624ba004efe",
               "name": "Philippe Magnan",
               "profile_path": "/pVLif4rJZvuDLuyViZbf4n4r8PH.jpg",
               "id": 24563,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "la mère de Mathilde",
               "gender": 0,
               "credit_id": "5499c907c3a3682f2300017a",
               "name": "Francine Bergé",
               "profile_path": "/5J9nMYNkkZo6s3KEZY7fqdwpKHV.jpg",
               "id": 146195,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a149251416c750dd043",
               "name": "Benoît Jacquot",
               "profile_path": "/gQ9Mxt0uYIcFs0g1byxYqI2FoZx.jpg",
               "id": 229263,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a149251416c750dd049",
               "name": "Benoît Jacquot",
               "profile_path": "/gQ9Mxt0uYIcFs0g1byxYqI2FoZx.jpg",
               "id": 229263,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a149251416c750dd04f",
               "name": "Jérôme Beaujour",
               "profile_path": null,
               "id": 63898,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "587d5f669251413eec01d694",
               "name": "Pascale Chavance",
               "profile_path": null,
               "id": 7701,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "587d5f729251413eec01d69f",
               "name": "Romain Winding",
               "profile_path": null,
               "id": 22153,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "587d5f7ec3a3684a4a020a55",
               "name": "Arnaud de Moleron",
               "profile_path": null,
               "id": 1098178,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "587d5f889251414143011f4f",
               "name": "Caroline de Vivaise",
               "profile_path": null,
               "id": 23731,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "587d5f919251414101012f10",
               "name": "Frédérique Moidon",
               "profile_path": null,
               "id": 36525,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.731264,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 98505,
      "vote_count": 3,
      "budget": 0,
      "overview": "A bored, sexually frustrated woman's life improves when she begins hypnotherapy and tries feng shui, but her husband's life unravels.",
      "similar": [
         29106,
         419430,
         10072,
         167,
         145197,
         506,
         2779,
         9889,
         22824,
         11601,
         5677,
         10742,
         43904,
         9065,
         24735,
         8850,
         1546,
         11498,
         41959,
         12206
      ],
      "original_title": "Le septième ciel",
      "runtime": 91,
      "poster_path": "/tLAF6TLzRVnP31udDX8abJCL6O5.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1997-12-17",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Benoît Jacquot"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Benoît Jacquot",
         "Jérôme Beaujour"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0124115/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3OTE4NTg3MV5BMl5BanBnXkFtZTcwMTE4MDIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sandrine Kiberlain, Vincent Lindon, François Berléand | See full cast and crew »"],
      "reviews": [
         "Seventh Heaven seems to be a \"snapshot\" of a married relationship that has reached a development stage that neither husband nor wife fully understands. Married for awhile, a son of 6 or 7, a nanny, a nice apartment; he's a surgeon and she's a lawyer/notaire, no apparent money problems. To my mind, what's occurring is partly stagnation and partly depression. There are at least two key factors: 1) The wife is experiencing largely psychosomatic fainting spells, often related to her low-level but historic kleptomania, and 2) The husband is not exactly losing interest but confused over her malady. She winds up seeing a man she literally runs into, who turns out to be a hypnotist; a result is both apparent cessation of her thieving as well as the achievement of the ability to experience orgasm, apparently for the first time in her life. Up until that point in their sex life, the husband has satisfied himself as the wife lies quietly, telling him \"not to worry, I just don't get there.\" Then in her \"new life\" they're making love and she has an orgasm that she obviously enjoys and in which she wants to include him, but it scares him to death and affects both his desire and performance -- perhaps not untypically for many men. In the end, after much to-ing and fro-ing, they begin to see the changes as being positive; he through conversation with both a fellow doc at his hospital and with another hypnotist that he is unable to relate to. The resolution phase is, to me, fraught with a lot of significant messages that are both non-verbal and hard to \"catch\" as the movie moves on, but the denouement seems to click. I want to say I wish the film had been more explicit, but that's probably exactly the reason it's so good. It's worth a shot.",
         "At the beginning of the movie, we see this young lanky woman, carefreely dressed in jeans, scarf'd and loose coat, walking down a city street very much like New York, entering a store which reminded me of Meg Ryan's in \"You've Got Mail\" (1998), and then a kleptomaniac gesture almost reminded me of (Robin Tunney in) \"Niagara, Niagara\" (1998) -- enough stray thoughts, this is a French film and very French it is. It's not Isabelle Huppert or Miou-Miou or Fanny Ardant. It's Sandrine Kiberlain who portrays the main character in focus. She's cool and slender. There's a certain calmness to her in spite of the struggling repressed feelings underneath -- quite a performance Kiberlain delivered. It all felt so casual -- that 's how French it is, yet full of nuances and sensitivity. The way the characters and events presented to us is like we are watching them in an ingenuous video setting -- no glamor, no fanfare, just everyday flavor, tout naturel. Seems like just another ordinary day in the life of this young woman: she looks in on her mother, she goes home, she instructs the babysitter, she picks up a book on \"What is hypnosis?\" \"Doing nothing all day,\" she answers her doctor husband Nico. She is Mathilde. She seems to have occasional fainting spells. She's kind of taking time off from the law office where she helps her mother, who's heading the business after the death of Mathilde's father. No, this is not complicated -- it's just supporting details to this young woman's story. Mathilde met a man, le docteur, who took her to a restaurant, where he ordered and enjoyed his escargot afternoon delight while asking Mathilde questions about her childhood, family history, and he brought up the subject of \"Feng Shui\" -- the ancient Chinese wisdom of aligning the harmony of Chi (flow of energy) in your surroundings and prompting subtle changes in furniture arrangements, etc. Then there are the hypnosis sessions, and they seem to reveal her insecurities towards the intimate relationship with her husband (portrayed by Vincent Lindon). This brought to mind Lance Young's 1997 \"Bliss\" (mature audiences only) with Sheryl Lee and Craig Sheffer as the young couple and Terence Stamp as the intimacy psychotherapist, who took them through step by step (poignant intimacy enhancement) lessons. In \"Seventh Heaven\", less explicit, the issues of a young couple trying to gain or regain their intimate tenderness between a husband and wife is also explored. It shows unabashedly the \"challenged\" manhood feelings vs. the female fulfillment; it illustrates the importance of intercourse in both its meanings. There is a small part played by a young boy as their son Etienne -- a light relieving element used to bridge Mathilde and Nico's relationship. \"Septieme ciel, Le\" does not shout to get your attention -- it quietly beckons. It serenely invites you to reflect on the facets of a married relationship presented here in this subtly wonderful gem of a film. Christian Vincent's 1994 \"La Separation\" is another French film that deals with the relationship between a man and a woman with a young son. Isabelle Huppert and Daniel Auteuil are paired as the couple striving to rise above their strained relationship. The tension in \"La Separation\" is taut and almost at a \"hard to breathe\" level. Again, it's French milieu, and every happening and the way the characters go about whatever they're doing, even the way they walk -- seemed ordinarily everyday life yet so intensely interesting without Hollywood elements. It's not a cheery subject (NFE), yet Huppert and Auteuil's paired performance is terrific to watch. Philip Saville's 1997 \"Metroland\" is a British-French approach to depicting and exploring a young married couple's (Christian Bale and Emily Watson) relationship maintenance issues.",
         "\"Seventh Heaven\" is a subtitled French dud which focuses on a young wife and mother who see a therapist for some neurotic tendencies such as kleptomania, frigidity, dyspenia, etc. He attempts to heal her through feng shui (yeah, right) and hypnosis while her husband reacts. This film is well crafted but not very interesting. If it has a problem, it is simply the lackadaisical zombiesque approach to drama and the absence of story arc. A sort of flat fizzling dud, \"Seventh Heaven\" lacks the passion its subject, offers no resolution, expects us to buy into some hokey hypnotherapist characters, and doesn't have much of a story to tell. In a word...unsatisfying. (C+)"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Canal+",
         "Centre National de la Cinématographie (CNC)",
         "Cinéa"
      ],
      "summaries": ["The slightly kleptomanic 29-year-old Mathilde is experiencing strange swoonings since a few days. There she encounters a mysterious doctor who treats her with hypnosis therapy. As she gets better her husband Nico does not. He even has problems recognizing his wife, especially when she has an orgasm while in bed with him. So he also goes to a psychiatrist, but the therapy does not seem to work..."],
      "budget": 0
   },
   "movielensId": 2063,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1997-12-17",
      "dvdReleaseDate": "2004-03-30",
      "directors": ["Benoît Jacquot"],
      "runtime": 91,
      "movieId": 2063,
      "title": "Seventh Heaven",
      "mpaa": "",
      "actors": [
         "Sandrine Kiberlain",
         "Vincent Lindon",
         "François Berléand",
         "Philippe Magnan",
         "Francine Bergé"
      ],
      "imdbMovieId": "0124115",
      "originalTitle": "Le septième ciel",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A bored, sexually frustrated woman's life improves when she begins hypnotherapy and tries feng shui, but her husband's life unravels.",
      "tmdbMovieId": 98505,
      "avgRating": 2.85632,
      "releaseYear": "1997",
      "numRatings": 87,
      "posterPath": "/tLAF6TLzRVnP31udDX8abJCL6O5.jpg"
   }
}