{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "country music",
            "id": 727
         },
         {
            "name": "guitar",
            "id": 953
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "southern baptist",
            "id": 10182
         },
         {
            "name": "country singer",
            "id": 157657
         }
      ],
      "imdb_id": "tt0086423",
      "video": false,
      "title": "Tender Mercies",
      "recommendations": [
         41461,
         69007,
         86955,
         108241,
         50020,
         27150,
         9967,
         19740,
         33851,
         16769,
         30069,
         46270,
         54723,
         49633,
         27984,
         53156,
         18287,
         43278,
         43047,
         54194
      ],
      "backdrop_path": "/r8pGo5jgKZ5eLwoYAF7BWMHstiY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mac Sledge",
               "gender": 2,
               "credit_id": "52fe45eec3a36847f80e2c79",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rosa Lee",
               "gender": 1,
               "credit_id": "52fe45eec3a36847f80e2c7d",
               "name": "Tess Harper",
               "profile_path": "/gJT9fBX04LjmbOzOzYcNbA2ZLF1.jpg",
               "id": 41249,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dixie",
               "gender": 1,
               "credit_id": "52fe45eec3a36847f80e2c81",
               "name": "Betty Buckley",
               "profile_path": "/pP5F1yNuvYfvMuft578k6dwgtAh.jpg",
               "id": 52462,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe45eec3a36847f80e2c85",
               "name": "Wilford Brimley",
               "profile_path": "/t0TLF4qXgXiroirvjVWWP88B0GD.jpg",
               "id": 11065,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sue Anne",
               "gender": 1,
               "credit_id": "52fe45eec3a36847f80e2c89",
               "name": "Ellen Barkin",
               "profile_path": "/i4WSy0da6KaA3xvETtXqZtUMoRP.jpg",
               "id": 6913,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sonny",
               "gender": 0,
               "credit_id": "5381474ec3a36805a1005e3f",
               "name": "Allan Hubbard",
               "profile_path": null,
               "id": 1323933,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Robert",
               "gender": 0,
               "credit_id": "5381475cc3a368059e0060a7",
               "name": "Lenny Von Dohlen",
               "profile_path": "/yZfisRYu3aEDRa0AaEIjMhkmW8w.jpg",
               "id": 15799,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Reporter",
               "gender": 2,
               "credit_id": "53814769c3a368059800604c",
               "name": "Paul Gleason",
               "profile_path": "/TKFcITuV9vyTSZe55B8klclPor.jpg",
               "id": 7675,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Lewis Menefee",
               "gender": 2,
               "credit_id": "53814777c3a36805a8005bc0",
               "name": "Michael Crabtree",
               "profile_path": null,
               "id": 61567,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Reverend Hotchkiss",
               "gender": 0,
               "credit_id": "53814789c3a368737d0013e4",
               "name": "Norman Bennett",
               "profile_path": null,
               "id": 1234808,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Larue",
               "gender": 0,
               "credit_id": "53814795c3a36805a1005e46",
               "name": "Andrew Scott Hollon",
               "profile_path": null,
               "id": 1323934,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Woman in Store",
               "gender": 1,
               "credit_id": "5384e6a40e0a2624c70109f4",
               "name": "Helena Humann",
               "profile_path": null,
               "id": 1193812,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45eec3a36847f80e2c8f",
               "name": "Bruce Beresford",
               "profile_path": "/2BM92YfwzMpFkk5IlNZfZqPmODy.jpg",
               "id": 5696,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "538147a6c3a368737d0013ea",
               "name": "Horton Foote",
               "profile_path": null,
               "id": 8483,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "538147b4c3a368059b005f76",
               "name": "Philip Hobel",
               "profile_path": null,
               "id": 1323935,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "538147c9c3a368059500602b",
               "name": "George Dreyfus",
               "profile_path": null,
               "id": 1323936,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "538147d5c3a368059b005f7b",
               "name": "Russell Boyd",
               "profile_path": null,
               "id": 31027,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "538147e1c3a36805a8005bc8",
               "name": "William M. Anderson",
               "profile_path": null,
               "id": 2705,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "538147fdc3a36805a1005e55",
               "name": "Daniel Loren May",
               "profile_path": null,
               "id": 19046,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5381b906c3a3680595006a4c",
               "name": "Jeannine Oppewall",
               "profile_path": null,
               "id": 9269,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.523283,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42121,
      "vote_count": 29,
      "budget": 0,
      "overview": "Alchoholic former country singer Mac Sledge makes friends with a young widow and her son. The friendship enables him to find inspiration to resume his career.",
      "similar": [
         44264,
         69,
         25196,
         57201,
         475,
         16769,
         14854,
         27932,
         45272,
         5121,
         297806,
         20287,
         430165,
         26829,
         47908,
         19094,
         230698,
         75300,
         324287,
         37416
      ],
      "original_title": "Tender Mercies",
      "runtime": 92,
      "poster_path": "/pkAOhgIt2CLyJaVpFYywe1EPNf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Antron Media Production",
         "id": 18094,
         "origin_country": ""
      }],
      "release_date": "1983-04-02",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Robert Duvall is Mac Sledge, down and out country singer. His struggle for fame was over. His fight for respect was just beginning.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruce Beresford"],
      "runtime": 92,
      "synopsis": "Mac Sledge (Robert Duvall), a washed up, alcoholic country singer, awakens at a run-down Texas roadside motel and gas station after a night of heavy drinking. He meets the owner, a young widow named Rosa Lee (Tess Harper), and offers to work in exchange for a room. Rosa Lee, whose husband was killed in the Vietnam War, is raising her young son, Sonny (Allan Hubbard), on her own. She agrees to let Mac stay under the condition that he does not drink while working. The two begin to develop feelings for one another, mostly during quiet evenings sitting alone and sharing bits of their life stories. Mac resolves to give up alcohol and start his life anew. After some time passes, he and Rosa Lee wed. They start attending a Baptist church on a regular basis. One day, a newspaper reporter visits the hotel and asks Mac whether he has stopped recording music and chosen an anonymous life. When Mac refuses to answer, the reporter explains he is writing a story about Mac and has interviewed his ex-wife, Dixie Scott (Betty Buckley), a country music star who is performing nearby. After the story is printed, the neighborhood learns of Mac's past, and members of a local countrywestern band visit him to show their respect. Although he greets them politely, Mac remains reluctant to open up about his past. Later, he secretly attends Dixie's concert. She passionately sings several songs that Mac wrote years earlier, and he leaves in the middle of the performance. Backstage, he talks to Dixie's manager, his old friend Harry (Wilford Brimley). Mac gives him a copy of a new song he has written and asks him to show it to Dixie. Mac tries to talk to Dixie, but she becomes angry upon seeing him and warns him to stay away from their 18-year-old daughter, Sue Anne (Ellen Barkin). Mac returns home to a jealous Rosa Lee and assures her he no longer has feelings for Dixie, who he describes as \"poison\" to him. Later, Harry visits Mac to tell him, seemingly at Dixie's urging, that the country music business has changed and his new song is no good. Hurt and angry, Mac drives away and nearly crashes the car. He buys a bottle of whiskey but, upon returning home to a worried Rosa Lee and Sonny, he tells them he poured it out. He admits he tried several times to leave Rosa Lee, but found he could not. Some time later, Mac and Sonny are baptized together in Rosa Lee's church. Eventually, Sue Anne visits Mac, their first encounter since she was a baby. Mac asks whether she got any of his letters, and she says her mother kept them from her. Sue Anne also reports that Dixie tried to keep her from visiting Mac and that she plans to elope with her boyfriend despite her mother's objections. Mac admits he used to hit Dixie and that she divorced him after he tried to kill her in a drunken rage. Sue Anne asks whether Mac remembers a song about a dove he sang to her when she was a baby. He claims he does not, but after she leaves he sings to himself the hymn \"On the Wings of a Dove.\" Boys at school bully Sonny about his dead father, and he and Mac grow closer. The members of the local country band ask Mac permission to perform one of his songs, and he agrees. Mac begins performing with them and they make plans to record together. His newfound happiness is interrupted when he learns Sue Anne has been killed in a car accident. Mac attends his daughter's funeral at Dixie's lavish home in Nashville and comforts her when she breaks down. Mac returns to Rosa Lee in despair. He says, \"I don't know why I wandered out to this part of Texas drunk, and you took me in and pitied me and helped me to straighten out, marry me. Why? Why did that happen? Is there a reason that happened? And Sonny's Daddy died in the war, my daughter killed in an automobile accident. Why? See, I don't trust happiness. I never did; I never will.\" Back home, Mac keeps quiet about his emotional pain, although he wonders aloud to Rosa Lee why his once sorry existence has been given meaning and, on the other hand, his daughter died. Throughout his mourning, Mac continues his new life with Rosa Lee and Sonny. In the final scene, Sonny finds a football Mac has left him as a gift. Mac watches the hotel from a field across the road and sings \"On the Wings of a Dove\" to himself. Sonny thanks him for the football and the two play catch together in the field.",
      "writers": ["Horton Foote"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086423/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MDU4MjY5NF5BMl5BanBnXkFtZTcwMTU0MDczMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Duvall, Tess Harper, Betty Buckley | See full cast and crew »"],
      "reviews": [
         "This movie demonstrates what happens when the rare, magical perfect combination clicks together. Duvall, Beresford and Foote blended their talents marvelously and managed to fool the critics by producing a film that is absolutely one of the best ever. Its draw at the box office and on video may have surprised the critics, but is understood by those who place a high value on well-written and well-acted drama. I have nearly worn out my VHS copy from multiple viewings but I have never worn out the experience. The film is uplifting because it is all about unhoped hope finding fulfillment. The movie combines tragedy and pathos with love, warmth and redemption in a manner that rarely occurs in a Hollywood production. To top it off, it does it so that there is not a phoney or contrived moment in the picture. Excellent and somewhat surprising supporting performances came from newcomer Tess Harper (discovered for this film by Duvall and Beresford) Ellen Barkin and Betty Buckley. Brimley (impossible to dislike in any role) is perfect as Buckley's manager. One of the best scenes in the movie occurs when the young band drops over to \"just say howdy\" to the ex-singer. Harper is guarded and protective at first, but the pure hearts and openly embarrassed intent of the young men quickly win her and the viewer over. It is a touching and beautiful scene. It reminds you that there is still decency and humility among American youth (maybe we should all visit east Texas once in a while, although you can easily find it in most parts of rural USA). No action flik this. The best word I know to describe Tender Mercies is \"heartwarming.\" If you have not yet watched it, by all means do yourself a favor: beg, borrow, rent or steal a copy without delay. You'll never think of Duvall or Texas or country music the same again.",
         "Something tells me that when it is all said and done, and people are trying to come up with that definitive \"greatest actor of all-time\" winner, it will be Robert Duval. I know that this is a bold statement. The Jimmy Stewart, Humphrey Bogart, Burt Lancaster, Paul Newman and Henry Fonda fans (among others) will scream and protest. Sure, it is subjective, but then again, maybe it is not. Sometimes there is supporting evidence out there, maybe because of one particular role. I think Robert Duval's performance in \"Tender Mercies\" is the greatest performance by an actor in the history of film. It is a subdued performance, but underneath, so powerful. Duval plays a washed up Country music singer and song writer named Mac Sledge. His better days are in the past. Now, he finds his only comfort in a whiskey bottle. His ex-wife has gone on to use his songs to become a huge star. She detests him because of the way he had become in his later years with her (alcohol). She even denies him the right to see their daughter. Mac has closed himself off to the world, he does not want to become emotionally attached to anybody or anything. The only time Mac was ever happy, bad things ended up as a result. However, Mac will soon come into contact with a widow and her young son and he gets a second chance to join the living. In this film you see a Duval character different from any other he has ever played. You see the rebirth of a spirit, long suffering. The supporting roles are incredible as well. I still find this one of the most emotionally satisfying movies ever made, every time I watch it.",
         "\"Tender Mercies\" is a strong character study about a washed-up country singer (Robert Duvall, in his Oscar-winning role) who finds the will to live and makes the most of his life. After spending a drunken night at a small motel in Texas, he meets the woman (Tess Harper) who can change his life for the better. She owns the motel and after allowing Duvall to stay for a while by doing odd jobs, she marries him and he starts his transformation. Duvall still has songs to sing, but his heart is just not in it any more. His ex-wife has become a singing star, partly by using the songs that Duvall wrote himself. She has also kept their daughter away from him because she was afraid he might do something in a drunken rage. Duvall comes to terms with everything and shows that he is a changed man. He meets his now-grown daughter (Ellen Barkin) and realizes that everything that has happened has occurred for the right reason. However, tragedy will strike and Duvall will have to show how great a person he really is. \"Tender Mercies\" is a film that works due to quiet performances, subtle direction, and a smart screenplay. The film runs a crisp 89 minutes, but never feels rushed. Robert Duvall finally got the chance to showcase his acting ability and he does not disappoint. His performance is the greatest attribute here, but this does not mean that everything else is not impressive. 4.5 out of 5 stars.",
         "This moving and thought-provoking film is a timeless classic of redemption and perseverance.Robert Duvall totally captures the pain, heartache, despair and ultimate survival of a once beloved entertainer.The film is an emotional tour-de-force for all the main characters, as they deal with forgiveness, doubt, loss of faith and memories of what might have been ....... The direction, screenplay, music and cinematography are all top-notch and add to the realistic feel of the film. In a career that has seen a number of great performances, this quiet, unassuming Duvall film will leave you inspired as well as thoughtful. In this film , we see our own lives reflected in this small town saga. Maybe that is why I found the movie so deeply entertaining. It appeals to the lost dreams and missed opportunities in our own lives.",
         "This is a great, great film. Robert Duvall richly deserved the Oscar he won for Best Actor, and Bruce Beresford's direction is quirky but consistently entertaining. The most wonderful aspect of this movie is how the screenwriter (Horton Foote) doesn't let the characters engage in all the obvious, \"Hollywood\" histrionics that the plot would allow them to do. For example: when Mack (Duvall) finally meets his long-lost daughter late in the film, he doesn't run to her and embrace her with tears staining his face while music swells beneath the scene, as a hack director would have him do. Instead, he looks at his shoes, makes small talk, and acts embarrassed. Why? Because, consistently throughout the film, he doesn't believe he deserves the good things that come his way. This is the tale of a man who, in the absolute pit of despair and hopelessness, is saved by the love of a good woman and the love of God. You need to see it.",
         "To all aspiring screenwriters: this is how to do it. Horton Foote eschews all of the phony and melodramatic plot devices Hollywood is so fond of, and concentrates instead on telling his tale as truly and simply as possible. In complete synch with him are his collaborators, director Bruce Beresford and star Robert Duvall. There's not a false gesture, extraneous word of dialogue, or wasted camera move. Just people who seem real, who strive to reach out to others, who want love and want to give it, but sometimes don't know how. There are quiet, subtle moments in this movie that squeeze the heart. Don't pass this one by.",
         "This is a movie with a lot of \"dignity.\" It has such realistic people, it kept me fascinated because it seemed so different from most films I've watched. There aren't a lot of dramatic things that happen in the story yet, as a whole, it's a wonderful tale that stays with you. It's a lot more than just seeing an Oscar-winning performance by Robert Duvall as Texan and former C&W singer and writer, \"Mac Sledge.\" It's simply good storytelling I can't say I am a fan of Duvall's country singing, but that is the only thing I didn't like. Well, maybe \"Dixie\" (Betty Buckley), who played a bitter ex-wife of Duvall's in here. She was not pleasant, but others were really nice, likable people. Yet, this is not some sappy movie just because most of the people are good folks. As in film noirs in which the viewer has a sense of dread, knowing something bad is around the corner, I felt the same thing in this film, even though it didn't necessarily happen. I mean with the main characters: Mac, Rosa Lee and Sonny. There was underlying tension, probably because of Sledge's alcoholic and violent past, that made me fear that any minute he was going to ruin the nice setup he had with a good woman and nice stepson. Duvall, as usual, makes his role a fascinating and unpredictable one. With many of the people he has played over the years, you never am sure what his characters are going to do next. Tess Harper, as Mac's new wife, and Alan Hubbard, as her son, are two of the most realistic characters I've ever seen on film. It helped they were from the area so their accents were real. This is a just straight drama, with a solid screenplay by Horton Foote and direction by Bruce Beresford (\"Driving Miss Daisy\"). In addition, actors Buckley (who can sing, too), Wilford Brimley and Ellen Barkin all give memorable supporting performances. It was an interesting tale of something I have rarely seen on film in the past 50 years: a good Christian woman lifting up a man to her level. She never had to do it verbally, never nagged or preached to the man, just set example of how to act and be a loving, supportive spouse. There is a lesson for people here with how well \"Rosa Lee\" handled situations. Nice.....very nice.",
         "As spare and clean and unflinching as a John Ford movie. At times reminds me of The Searchers in its perfect marriage of style and pained stoicism, and the way the sky and fate dwarf the all-too-human interiors. Superb editing and interior design, and probably Duvall's finest performance.",
         "I was happy to see this film once again when it aired last night on CMT. It's certainly worthy of a second look, as you take something new away from it each time. Even though this was filmed during the urban cowboy era of the early 80s, it doesn't seem dated in its subject matter. Country music fans can draw their own conclusions as to who inspired some of the characters. Robert Duvall's burnt-out drunk Mac Sledge surely borrowed from Lefty Frizzell. Mac's singing style is eerily close to Lefty's and he even performs one of his songs in the film. Betty Buckley's country queen Dixie Scott is reminiscent of Dottie West. Perhaps the writer based his story on George Jones and Tammy Wynette's bitter divorce, Jones' subsequent alcoholism and redemption, and Tammy's raising of their daughter. Whatever the case, it has a wonderful message about loss making us appreciate the good things we're given in life. The final song playing while Tess Harper watches her husband and son tossing a football says it best.",
         "While some may consider the movie a little slow at times, its overall message is a powerful one. A movie about redemption, restoration and hope. Robert Duvall's portrayal of a man whose life is in need of repair is outstanding. Ranks with his character in \"The Apostle\", a similar tale in many ways. In my opinion, the baptismal scene is one of the movie's most moving moments. The bleak landscapes and the dust-blown scenes effectively echo the main character's state of mind for part of the film. Mac Sledge is a great character brought to life by Duvall. As Sledge gradually gets his life together thanks to the developing relationships with a young widow and her son, the mood of the movie becomes a little more positive."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Antron Media Production",
         "EMI Films"
      ],
      "summaries": [
         "Alchoholic former country singer Mac Sledge makes friends with a young widow and her son. The friendship enables him to find inspiration to resume his career.",
         "A broken-down, middle-aged country singer gets a new wife, reaches out to his long-lost daughter, and tries to put his troubled life back together."
      ],
      "budget": 0
   },
   "movielensId": 2070,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-04-02",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["Bruce Beresford"],
      "runtime": 92,
      "movieId": 2070,
      "title": "Tender Mercies",
      "mpaa": "PG",
      "actors": [
         "Robert Duvall",
         "Tess Harper",
         "Betty Buckley",
         "Wilford Brimley",
         "Ellen Barkin",
         "Allan Hubbard",
         "Lenny Von Dohlen",
         "Paul Gleason",
         "Michael Crabtree",
         "Norman Bennett",
         "Andrew Scott Hollon",
         "Helena Humann"
      ],
      "imdbMovieId": "0086423",
      "originalTitle": "Tender Mercies",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["YkRvzcektB0"],
      "plotSummary": "Alchoholic former country singer Mac Sledge makes friends with a young widow and her son. The friendship enables him to find inspiration to resume his career.",
      "tmdbMovieId": 42121,
      "avgRating": 3.94658,
      "releaseYear": "1983",
      "numRatings": 1844,
      "posterPath": "/pkAOhgIt2CLyJaVpFYywe1EPNf.jpg"
   }
}