{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "great depression",
            "id": 5571
         },
         {
            "name": "attempted rape",
            "id": 18087
         },
         {
            "name": "hitchhiking",
            "id": 163726
         },
         {
            "name": "riding freight train",
            "id": 198912
         },
         {
            "name": "institution",
            "id": 198914
         }
      ],
      "imdb_id": "tt0089385",
      "video": false,
      "title": "The Journey of Natty Gann",
      "recommendations": [
         69007,
         71805,
         4542,
         32140,
         18451,
         50020,
         16405,
         43899,
         241432,
         27444,
         41971,
         38986,
         73565,
         16151,
         9698,
         1404,
         35656,
         14785,
         71244,
         35992
      ],
      "backdrop_path": "/dJboXzdH2E8cwWc2kYKdaPxm9zw.jpg",
      "revenue": 2135577,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Natty Gann",
               "gender": 1,
               "credit_id": "52fe45969251416c910379c1",
               "name": "Meredith Salenger",
               "profile_path": "/5KPSGIuTE9lVLsL8rMoxnkn28Fa.jpg",
               "id": 18706,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe45969251416c910379c5",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sol Gann",
               "gender": 2,
               "credit_id": "52fe45969251416c910379cd",
               "name": "Ray Wise",
               "profile_path": "/z1EXC8gYfFddC010e9YK5kI5NKC.jpg",
               "id": 6719,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sherman",
               "gender": 2,
               "credit_id": "52fe45969251416c910379d1",
               "name": "Scatman Crothers",
               "profile_path": "/nzSlIgwX4vMSJhDPdUSkV9MAAai.jpg",
               "id": 7077,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45969251416c910379bd",
               "name": "Jeremy Kagan",
               "profile_path": "/jny7KFWxvc9xYn0q6201OaLC4g4.jpg",
               "id": 128947,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45969251416c910379d7",
               "name": "Dick Bush",
               "profile_path": null,
               "id": 58660,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45969251416c910379dd",
               "name": "Michael Lobell",
               "profile_path": null,
               "id": 1272194,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45969251416c910379e3",
               "name": "Andrew Bergman",
               "profile_path": "/gTx35MhqW8MlGv7JlYnCJQClebi.jpg",
               "id": 41550,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe45969251416c910379e9",
               "name": "Jeanne Rosenberg",
               "profile_path": null,
               "id": 71760,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5652318dc3a3686af6000023",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "56aa90df9251417e260003bf",
               "name": "Steven Rosenblum",
               "profile_path": null,
               "id": 2484,
               "department": "Editing",
               "job": "Additional Editing"
            },
            {
               "gender": 0,
               "credit_id": "591323f5c3a36864a7053eb5",
               "name": "Linda Vipond",
               "profile_path": null,
               "id": 1529604,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 2.651719,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35144,
      "vote_count": 36,
      "budget": 0,
      "overview": "America is in the depths of the Great Depression. Families drift apart when faraway jobs beckon. In this masterful, atmospheric adventure, a courageous young girl (Meredith Salenger) confronts overwhelming odds when she embarks on a cross-country search for her father. During her extraordinary odyssey, she forms a close bond with two diverse traveling companions: a magnificent, protective wolf, and a hardened drifter (John Cusack). A brilliant, moving tapestry, woven of courage and perseverance.",
      "similar": [],
      "original_title": "The Journey of Natty Gann",
      "runtime": 101,
      "poster_path": "/bGe3YdbSdL3NFG214GouWRcKHDI.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Buena Vista Distribution Company",
         "id": 20741,
         "origin_country": ""
      }],
      "release_date": "1985-09-25",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jeremy Kagan"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Jeanne Rosenberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089385/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMTY2NDYwOF5BMl5BanBnXkFtZTcwOTk4NTUyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Meredith Salenger, John Cusack, Ray Wise | See full cast and crew »"],
      "reviews": [
         "In what may be the most remarkable live action film to come out of the Disney studios during the 80's or even the 70's for that matter, I find the treatment it has received from it's own studio appalling. The best thing I can compare it to is having a ruby but discarding it because you only prefer diamonds. Considering all the costume jewelry Disney released in the aforementioned decades, you would think they would have more respect for this gem. I'm sure parents who took their children to see Natty Gann when it was released were surprised and shocked to discover that it was not a film for younger children. It is a very dark realistic film which takes place during the Great Depression. This is not only the story of a young girl traveling across country to find her father, it is the story of people searching for hope and trying to survive in an age when just having food on the table was a constant struggle. When Natty's father Sol(Ray Wise) is offered a job in a logging camp in Washington, he is only given a few hours to come to a decision, either take the job and leave Natty behind, or stay in Chicago with Natty and hopefully find work elsewhere. At first, rejecting the job offer, he steps out into the Chicago streets. In a truly remarkable scene, we see as Sol does, the faces of all those who have lost hope and been beaten down in despair. It is after this brief but telling moment that he realizes, as we do, there is no decision to be made and Sol accepts the work in Seattle. Sol is forced to leave Natty in the care of a boarding house owner Connie(Lainie Kazan). After Natty overhears Connie reporting her as an abandoned child, she decides not to wait for her father to send for her, and begins an arduous journey across country to find him. If ever there was a film that is a picture of contrasts it's this one. Early in the film we are given the harsh reality of depression era Chicago. Director Jeremy Kagan does not spare us from the details. We watch as men stand hopelessly and helplessly praying and hoping for work. There is a scene where a destitute family are evicted from their home. Later, as Sol is heading to Washington in the bus, we see another family on the road with their meager belongings strapped to their car as they head west, their car no longer operable. As Natty walks through the market place vendors sell what meager belongings they have just to get buy. When Natty runs away we see her fishing for food out of a trash can for a morsel to consume. Later, as Natty travels westward, there is beautifully photographed scenery of forests and mountains, but Director Kagan astutely reminds us of the bleakness of the depression with many scenes of the struggle in rural America, ranging from a scene of a farmer and his much pregnant wife plowing a field, to scenes of orphaned and abandoned children left to be wards of the state. This is not your Daddy's Disney, kids. Dick Bush's cinematography of the wilderness is breathtaking, yet in the scenes set in Chicago and in the farm towns of America, he mutes his colors to enhance the contrast between beauty and desperation. When Natty jumps her first train, she is help and befriended by Harry(John Cusack), who is also riding the rails. Cusack in his first major dramatic role after being extremely good in The Sure Thing, shows for the first time that he is not just a comedic actor, but has dramatic prowess as well. Harry may be young, but Cusack gives him the edge of a man aged beyond his years. It is an uncanny performance. Salenger, as Natty, is more than just a teenage actress. Her characterization draws us into the story from the first moments of this film to the last. It is the key that holds this film together and if it had been put into less capable hands the film would surely not have succeeded as well. Although her film career since Natty Gann has not been noteworthy, you will always remember her for her unflinching portrayal of Natty Gann. This is a journey for the ages, and one you will not soon forget. Unfortunately....... I don't make it a habit to comment on the DVD release of films, but in this case I'll make an exception. The transfer of this wonderful film is appalling. It's bad enough when a film that shouts \"wide screen\" is only released in a very horrid poorly done pan and scan, but the full screen transfer is one of the worst if not the worst I have ever seen. It gives new meaning to the word grainy. At times the picture jitters so that you may begin reaching for your VCR remote to adjust the tracking until you remember this is a DVD. There are signs of the film's age running rampant throughout and no visible effort to clean it up digitally or otherwise. I'm not one to believe every film should come with a boatload of extras, and have no problem if a studio wants to give us just the film, but there is absolutely no excuse for the poor picture quality of this DVD. This movie is a gem, and for the Disney studios to tarnish it and treat it in this unconscionable manner, saddens me terribly. What is more frustrating is the fact that Disney can do quality video releases, so just a decent film to DVD wide screen transfer would not have been a lot to ask for. They should be ashamed of what they have done to this fine fine film. My Grade: Journey of Natty Gann-A DVD transfer - F",
         "This haunting and delightful film - intended for children but equally compelling for adults - tells the story of Natty Gann, a brave and resourceful young girl who traipses across Depression-era America to find her only relative, her long-lost dad. If that sounds depressing then think again. This is a gem of a film. It has Meredith Salenger in the lead role displaying a warmth and maturity to carry a role that may easily have overwhelmed a less gifted actress. How on earth she hasn't become a big star is completely beyond me. Offering commendable support is John Cusack as the older boy and drifter she befriends on her journey. Children's films so often tend to lean towards sentiment or easy endings but this uncompromising film, and yes, the language gets a little colourful at times but so what, has a depth to it that makes you root for the heroine to the very end. Natty Gann is simply a wonderful film for young and old alike.",
         "If you haven't seen this yet, go rent it. A heartwarming account of a young girl making her way across the country to get back to her father during the depression. One of the earlier reviews was talking about how all of the bad things that happen to Natty are inappropriate for a disney movie, but I think that those are the things that make this film so great. It is a gritty, realistic, non sugar coated story. The things that are shown to happen to Natty happen every day and have been for many many years. They bring drama and \"heart\" to the film, and make it what it is. Combine the latter with unbelievable cinematography of America, very good performances, and you are left with a very memorable, timeless film. I only wish that Disney would release it on DVD in widescreen. With such great widescreen nature cinematography, having to repeatedly watch the \"chopped up\" pan and scan version on vhs is killing me!! If you release it we will buy it!!!",
         "THE JOURNEY OF NATTY GANN This was in the back of my video cabinet and I haven't watched it since I was a child. NATTY GANN is a rather unknown Disney release from 1985 that takes places in the '30's. Natty Gann is a young girl living with just her father in a bleak time. She is rough around the edges and has clearly built up a crocodile skin due to the life she has led. However, at her core, she truly loves her father. So when he is forced to leave her at a moment's notice to travel to Washington (the only place he can find work) Natty is left in the care of a bitter Landlord. It doesn't take long for Natty, played by Meredith Salenger, to runaway in an attempt to travel the 2,000 miles to be with her father again. On her journey, Natty meets all kinds of people who are suffering due to the nation's economic situation. One thing she witnesses is a dogfight where one of the dog's is a rather wild wolf. Natty reaches out for the wolf though and eventually manages to establish a bond with the wild animal. Together, they continue to travel towards her Washington State in pursuit of Natty's father. As the plot description above makes clear, the framework of this film is not horribly unique or important. However, what does give the film some extra quality is the approach in which the material is taken on. This film is very much in the same vein as another under-appreciatted Disney classic, RETURN TO OZ. This is a very dark family film that lacks all of the standard, corny Disney clichés (aside from the animal friend, but here he doesn't talk... and he isn't particularly nice at first). THE JOURNEY OF NATTY GANN portrays the depression-era and it's effects on the poor very honestly. We see Natty eating out of garbage pales and sleeping in filth. We see the type of work her father is forced to take on. And we see the bitterness and resentment Natty feels towards her situation. She is not your typical \"hopelessly-optimistic\" Disney heroine. She gets angry, she defends herself, and she doesn't make excuses. She starts fight, even smokes what appears to be weed in the opening scene (this was something I certainly didn't notice as a child). However, the role of Natty is always grounded by an appealing and fully realized performance from the young Meredith Salenger. She hasn't found much success in film following this movie, but it is definitely one of the best child performances of the 80's. Now aside from the good qualities of the film, THE JOURNEY OF NATTY GANN moves a little too slow for me to really love it. Despite the many Disney clichés it avoids, it's still always obvious Natty will find her father and all will be happy. So the fact that it takes 105 minutes to do so is a bit much. And there is a supporting role / love interest played by John Cusack who is essentially useless to the plot. But Disney deserves some credit for boldly taking family films to a darker, more artistically developed place in 1985 (both RETURN TO OZ and NATTY GANN were released in that year). There haven't been children's films that really embrace the darker side of things like these 2 films do since '85... and these under-viewed films deserve a little more credit and public acknowledgment for looking outside of the lines in a genre that is too often trapped within the lines. ... B- ...",
         "I was waiting a long time to see this movie. Part of the reason why was that Disney made a poor decision by releasing this movie in pan and scan on DVD. After several failed attempts to convince Disney to release a widescreen version, I gave up and purchased a region-free DVD player and then purchased the region 2 version which was in widescreen. All I can say was, it was worth it. Journey of Natty Gann is a wonderful movie and is perhaps one of Disney's best. The cast features Meredith Salenger, John Cusack, Ray Wise and Scatman Crothers who all put in terrific performances (special mention also goes out to Jed the dog who plays Natty's wolf companion). This movies also boasts some incredible outdoor photography and a memorable music score by James Horner. The story is about a twelve year old girl named Natty (Meredith Salenger) who travels across 1930's America in search of her father. Along the way she has several adventures and meets up with another runaway named Harry (John Cusack). I definitely recommend seeing this one.",
         "'The Journey of Natty Gann' was a film that I watched several times when I was a child. I enjoyed it because there are few movies in which there is a female lead character who is a tomboy, and I could easily relate to this character, being a tomboy and seeking adventure myself. This film is about Natty, a girl during the Great Depression, who is separated from her father. She runs away from her guardian to try to find her father and finds compassion in an captive wolf in a similar situation. During her travels, she meets many new people, including a love interest, and puts herself into danger. She's always on the run in her attempt to get to her father. This film is a good family historical film, and it is packed full of adventure and danger. It has some good messages behind it, and it is easy to see the similarities in the two lead outcasts: wolf and girl. It's a great film because it has a female lead character who is a tomboy.",
         "I saw it in theatres when I was a kid, I bought the VHS when 1st available; I was overjoyed to the point of near misty-eyed-ness when I recieved the DVD from my wife. TjoNG is one of the reasons I fell in love with wolves & learned to overcome my American cultural ignorance of them. The movie is the reason I listened more closely to my grandparents tales of the depression; why I stopped thinking depression meant an emotional state & recognized it as an economic problem. You & your kids can *LEARN* something from this movie, you can enjoy watching it, again & again; there's a marvelous emotional hurrah! throughout the entire story, Disney at it's finest without the clubbed-over-the-head forced-spoon-fed social & morality message & commentary. The scenery is breathtaking, you kinda think I wish I could go back to then & live in that incredible world. The music is perfect, nudging & reinforcing without interrupting or annoying. This is also one of Scatman Caruthers' last roles, doing what he does best; adding a touch of autheniticty that makes our suspension of disbelief effortless. The DVD is a horiffic slap in the face to the theatrical release, the cast, crew & it's *SO* bad it makes the movie look shoddy. I won't reiterate what the other people so ably & eloquently illustrated of the flaws, I'll just say BUY THE VHS! if you can't, well, this DVD is better than nothing. Barely. The only reason there're 3 stars is because I was in the theatre on a magical night near to 2 decades ago & I *KNOW* what should have been on this disc. Let's not even mention the despair of finding no extra features.",
         "This movie was really great, it had an exciting and plausible plot, reasonable acting -- and it wasn't just cheesy crap compared to most of the other drivel that was being played for us kids at that time. This clearly stood out shining in my mind, up there with \"The Neverending Story\" and \"Flight Of The Navigator\". This movie didn't talk down to me as a child, which I quite liked. And it wasn't just another cartoon, which for the most part I found painfully dull in their lack of realism. The Natty character, and all those she meets on her adventures (including the wolf that she befriends), are unique, interesting, thought provoking ... and you actually care what happens to them all by the end. And how many other movies aimed at youth have a kid getting chased away from eating out of a garbage dumpster ? Heh. Great film ! I want to watch it again to see if I still like it as much, but I know I probably will ... I know the plot quite well, I did watch the movie at least 8 or 10 times as kid.",
         "This is a nice movie about a courageous girl just trying to get to her father, with a little help from friends, and even more enemies. Meredith Salenger was perfect for the part of Natty Gann. She's cute, tough, and just a good actress. (So, how then did shwe go into movies such as Dream a Little Dream?) John Cusack, as always is a doll. This is a good movie for eveybody. 7.2 out of 10.",
         "So, Disney finally did something right, and it's a nifty little tough grrrrl movie. It's touching and fun, with sometimes stunning cinematography and great location work. The plot works despite a little Disney cheese... the direction and visuals are great... and John Cusack gives an early hint of what he can do. Overall, it's delightful."
      ],
      "genres": [
         "Family",
         "Adventure"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Silver Screen Partners II"
      ],
      "summaries": [
         "Natty Gann (played by Meredith Salenger) is a twelve year old Depression era girl whose single-parent father leaves her behind in Chicago while he goes to Washington State to look for work in the timber industry. Natty runs away from the guardian she was left with to follow Dad. She befriends and is befriended by a wolf that has been abused in dog fights, hops a freight train west, and is presumed dead when her wallet is found after the train crashes. Dad gets bitter and endangers himself in his new job. Meanwhile Natty has a series of adventures and mis- adventures in various farmhouses, police stations, hobo camps, reform schools, and boxcars.",
         "In the 1930s, a tomboyish girl runs away from her guardian to join her single father who is 2,000 miles away, because there was work there."
      ],
      "budget": 0
   },
   "movielensId": 2077,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1985-09-25",
      "dvdReleaseDate": "2002-05-21",
      "directors": ["Jeremy Kagan"],
      "runtime": 101,
      "movieId": 2077,
      "title": "The Journey of Natty Gann",
      "mpaa": "PG",
      "actors": [
         "Meredith Salenger",
         "John Cusack",
         "Ray Wise",
         "Scatman Crothers"
      ],
      "imdbMovieId": "0089385",
      "originalTitle": "The Journey of Natty Gann",
      "genres": ["Adventure"],
      "youtubeTrailerIds": [],
      "plotSummary": "America is in the depths of the Great Depression. Families drift apart when faraway jobs beckon. In this masterful, atmospheric adventure, a courageous young girl (Meredith Salenger) confronts overwhelming odds when she embarks on a cross-country search for her father. During her extraordinary odyssey, she forms a close bond with two diverse traveling companions: a magnificent, protective wolf, and a hardened drifter (John Cusack). A brilliant, moving tapestry, woven of courage and perseverance.",
      "tmdbMovieId": 35144,
      "avgRating": 3.4899,
      "releaseYear": "1985",
      "numRatings": 1089,
      "posterPath": "/bGe3YdbSdL3NFG214GouWRcKHDI.jpg"
   }
}